{"id": "0008610c8126e6f2149fe984c0c77d0b", "url": "https://www.bonappetit.com/recipe/tibok-tibok", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Tibok-Tibok Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueTibok-TibokBy Melissa MirandaFebruary 9, 20213.9(27)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintThis eggless pudding (which translates from Tagalog to “heartbeat”) gets extra chocolateness by using cocoa powder and melted bittersweet chocolate. Melissa Miranda, the chef-owner of Seattle’s Musang, developed this recipe, a take on the Filipinx dessert using coconut milk in place of carabao milk, with pastry chef Amelia Franada.Ingredients6 - 8 Servings213.5-oz. cans unsweetened coconut milk½(heaping) cup (57 g) Dutch-process cocoa powder½cup (100 g) sugar3Tbsp. cornstarch¼tsp. kosher salt2oz. bittersweet chocolate (no more than 72% cacao), choppedToasted shredded unsweetened coconut (for serving)PreparationStep 1Whisk coconut milk, cocoa powder, sugar, cornstarch, and salt in a medium heatproof bowl. Add chocolate and set bowl over a large saucepan of simmering water (make sure bottom of bowl is not touching the water). Cook, stirring and scraping bottom of bowl often, until mixture is thickened to a pudding-like consistency, 10–12 minutes (it will thicken further as it cools). Remove bowl from pan and divide tibok-tibok among glasses. Chill until cold, at least 1 hour.Step 2Top with coconut just before serving.Do ahead: Tibok-tibok (without coconut) can be made 3 days ahead. Cover and keep chilled.How would you rate Tibok-Tibok?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI love this. It's so thick and chocolatey I made some changes though. I didn't do it over a pot of water, I cooked it slowly directly on the burner. I used 1 can of coconut milk and 1 can of coconut cream, upped the sugar to 3/4 of a cup. Kept other measurements the same. After it came to a boil for about a minute removed from the heat and added in 2 tsp of vanilla. Did the toasted coconut and homemade whipped cream. Everyone loved it so much I've made it 3 times in one week. DianeTampa, Fl4/23/2021I agree with other reviews..a little more soupy than pudding. Next time up the cornstarch and wouldn't heat as long... just enough to melt the chocolate Marc WCape May NJ3/17/2021easy to put together and flavorful. A bit heavy so plan your meal accordingly. \nMade half the recipe which we split among 5 and it felt like plenty. Cécile3/15/2021I haven’t made any homemade pudding ever. I tried this and, while I liked the flavor, I didn’t get a pudding consistency, I got soup. That is more an error on my part than anything. I want to make it again to see if I can improve on my first go. Jort3/13/2021This is a good recipe although based on a Google search I'm not sure it's considered Tibok-Tibok. It's still delicious and next time I'm going to add a little extra cornstarch and use it as a pie filling. I did make some modifications. \n\nFirst, I used Lite coconut milk (because that's all I had). Next, I used 3 tablespoons stevia powder and 1 teaspoon sugar. I upped the cornstarch to 1/4 cup to compensate for using the lite coconut milk. My chocolate was 90% cacao. Finally salt - I used kosher salt and didn't measure (my bad). It was way too salty so I squeezed in the juice of 1 mandarin orange to give it some balance. No vanilla because I didn't have any and I had already started mixing. \n\nEven with modifications I thought this was delicious, but it is very rich. Next time I'm going to up the cornstarch or use full fat coconut milk (maybe one can each?). Definitely use less salt, and possibly less sugar (maybe 2 Tbsp. Stevia and 1 Tbsp. sugar). The mandarin juice is staying though. AnonymousArkansas3/5/2021Heaven on earth!AnonymousSan Francisco CA2/28/2021Explore Bon AppétitPuddingDessertFilipinoSoutheast AsianAsianChocolateOther IngredientsCoconut MilkEasyDairy-FreeGluten-FreeVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}