{"id": "000c99e658584f3bb1a657953bf215a0", "url": "https://www.bonappetit.com/story/fathers-office-burger", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Father's Office Burger Still Reigns In the Age of Smash Burger Supremacy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIn the Age of Smash Burger Supremacy, the Office Burger Still ReignsNo substitutions, no ketchup, no problem. By Aliza AbarbanelNovember 6, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Blame culty pop-ups (Burgers Never Say Die in L.A., Burger Supreme in NYC) or your local drive-in—right now, smash burgers are ruling the burger world. And honestly, I’m not mad about it: Those crispy griddled patties glossed with American cheese have a special kind of magic. Still, I’ll always hold a torch for a decidedly different kind of burger: the drippy, French onion soup-inspired burger at Father’s Office in Santa Monica.If the concept of a French onion soup burger doesn’t sell you right away, you might as well close this tab. Just kidding, stay for the details: an 8-ounce dry-aged chuck patty topped with applewood bacon, arugula, onions caramelized in bacon fat, and both Gruyère and blue cheese, all piled on an oblong French roll. Yes, it’s messy. Yes, it’s a little dated. (Father’s Office has been serving up this burger since 2000.) And yes, my stomach hurts after wolfing down the whole thing in a matter of minutes. But also: None of that matters because the Office Burger is perfect.Chef Sang Yoon has dialed in every single detail. The loosely ground chuck patty is juicy but not fall-apart sloppy. The arugula offsets the fatty bacon and double whammy of lactose, and the bacon-y onions are just as delicious as you’d expect them to be. The whole burger comes together in indulgent harmony, keeping you coming back for another bite until suddenly you’re left with an empty plate and uncomfortably tight pants.Now is probably the time to mention Father’s Office has an infamous no-substitutions-allowed policy. And to prevent customers from taking matters into their own hands, there’s no ketchup on the premises. (Not even for fries, which instead come with a small dish of aioli.) But after 20 years and expanding to three locations—even in the undeniable age of smash burger supremacy—what might have been L.A.’s first “gourmet burger” remains unchanged. And that’s exactly how I like it.Go there: Father’s OfficeExplore Bon AppétitHighly RecommendRestaurantsLos AngelesSanta MonicaBurgersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-06", "author": ["Condé Nast", "Aliza Abarbanel"]}