{"id": "00268ba5e06520374251c1e259f9ffaf", "url": "https://www.bonappetit.com/story/how-to-cook-eggplant-perfectly-every-time", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "How to Cook Eggplant Perfectly, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Eggplant Perfectly Every TimeThis bulbous berry—yep, it’s a BERRY—can be challenging. But once you know how to cook eggplant properly, we promise you’ll fall in love.By Alex BeggsAugust 23, 2021FacebookTwitterEmailFacebookTwitterEmailIn the olden days, when we used to order takeout over the telephone, my aunt always told the restaurant to please deliver to apartment “1E, as in eggplant.” And ever since then the bulbous purple fruit has always held a special place in my heart.A place of fear. The eerie nightshade—did I mention it’s also a berry, a BERRY!—has tried to vex me out of cooking it again and again. (Is it any coincidence that the Italian name for eggplant, melanzana, comes from a Latin phrase for “apple of madness”?!?) The way it soaks up all the oil in the pan, seemingly begging for more, always ends up a mushy, oily mess. Until I consulted with our test kitchen and learned a thing or two about how to cook eggplant, and now I finally feel like I've got the upper hand.“Eggplant wants to soak up things,” test kitchen director Chris Morocco says. “It needs fat, and yet it can quickly turn greasy. But it can take tons and tons and tons of flavor.” In his new recipe for spicy braised eggplant noodles, it soaks up an umami blast of tomato paste, gochujang, and miso. His advice: Don’t hold back.Here are more tips that changed my outlook on life. Well, at least my eggplant outlook.Photo by Emma Fishman, Food Styling by Tami HardemanPick Your Eggplant WiselyThere are hundreds of eggplant varieties of all shapes and shades, from white to deep purple to the cutie Fairy Tale eggplants you can fit in your overall pockets. Lots to cook and experiment with! But the most commonly sold are giant globe eggplants, medium-sized Italian eggplants, and long, skinny Japanese and Chinese eggplants.When cooking with big globe eggplants, cut them in half or into smaller pieces, suggests assistant food editor Jessie YuChen. More manageable slices will cook faster and retain their shape. (You’ll only really want to cook a globe eggplant whole when you’re going to blend the flesh for baba ghanoush or other creamy recipes.) In his recipe for shortcut vegetarian cassoulet, contributor Christian Reynosa cuts 2-inch long fingers of eggplant, sort of a play on the sausages that would typically be in the dish. Clever!Depending on the recipe, you might want to slice and salt globe eggplant slices before cooking them in order to draw out some of the water and keep them from turning to mush. In On Food and Cooking, Harold McGee writes that because eggplants are filled with tiny air pockets, they function like sponges. “The absorptiveness of eggplant can be reduced by collapsing its spongy structure before frying,” he writes. Which you can do by microwaving it before frying (!) or salting slices that’ll draw out the water and close up those air pockets, giving you a firmer flesh to work with.Salting globe eggplant slices is a crucial step in eggplant parmesan because you bread and fry the eggplant, so you need as much moisture out as possible so the flesh of the eggplant remains sturdy enough to fry.Not many other BA recipes call for salting eggplant before cooking, and that’s because, generally speaking, we favor Chinese and Japanese varieties of eggplant, which don’t have as many seeds (seeds = mush) and therefore have a firmer flesh than globes—and their smaller shape is easier to slice. The more balanced ratio of flesh to skin also means it’s easier to properly season. Big eggplants need a heavy hand of seasoning to get to the same level.“Japanese eggplants are pleasantly delicate, and they require little effort to turn the flesh custardy, plus the skin is never leathery or chewy,” says Morocco. “It wants to play ball.”“Honestly,” he admits, “Big, bruised, lopsided eggplants are just horrific and should never be cooked with.” (He means especially when they’re out of season and on grocery store shelves for too long.) He never cooks with eggplant larger than medium-sized, “unless I’m making eggplant parm, and even then, that speaks to the transformative process of making parm more than anything.” Noted.Consider the CrosshatchYuChen’s a big fan of scoring eggplant. In her recipe for harissa-roasted eggplant, she cuts cross hatches into the flesh of eggplant halves, then rubs a harissa-garlic-caper paste into the flesh so it soaks in as it roasts in the oven. You could even cross hatch an eggplant if all you have the energy to season it with is garlic salt.Don't Fear FatBecause eggplant is a literal sponge, you might be afraid to keep adding more oil as you sauté it on the stove. The key is to add little by little, says Chris. “You’re better off spacing it out so that the different faces of the eggplant get an opportunity to absorb the oil, and that oil will help distribute the heat of the pan too.”If you end up with too much oil in the pan, take a tip from Andy Baraghani’s recipe for eggplant with a warm cinnamon-walnut dressing: use a slotted spoon or tongs to fetch the cooked eggplant and leave the excess oil in the pan.In an ideal world, Chris adds, you should toss the cut eggplant in a bowl of oil to get a chance to cover every side of it. In Sarah Jampel’s eggplant and ricotta sandwich, you brush the eggplant slices with oil before cooking them in a nonstick skillet, and then brush the other side before flipping. Smart!Season with AbandonGreen beans have bright green flavor and snappy texture. Tomatoes burst with juicy sweetness. Eggplant, bless its heart, skews a little more on the bland side. It needs a lot of seasoning—salt, spices—to succeed. I noticed that a few reviews of our eggplant pasta mentioned theirs was bland. If you’re following a recipe, keep tasting and adding more salt or seasonings to keep up with the size of your eggplant. A bigger eggplant might need twice the amount of seasonings of a smaller one. “When in doubt, add salt,” says MoroccoKeep on Cookin’A rookie mistake is not fully cooking the eggplant. “Nobody wants medium-rare eggplant,” says Morocco, who sounds like he knows from experience. A raw eggplant is crunchy and flavorless, like a raw potato. When it’s cooked, “it should turn fully tender, all the flesh should be somewhat custardy. If you have to, hammer it a bit, knock it around, let it start to collapse.”When you’re roasting eggplant, like in YuChen’s recipe, “make sure you give them enough space so they can cook evenly,” she says. “You want them properly roasted—not steamed.”Lean Into the MushThere’s a time and a place to let eggplant become its truest self: mush. Eggplant’s custardy nature was made for moutabal, a smoky Lebanese dip, or Trini-stewed eggplant seasoned generously with garlic and curry powder. This eggplant confit practically melts in your mouth. In one of my favorite BA eggplant recipes, halved eggplants turn to custard and you top them with crispy beef. Which brings me to our concluding point. If you accidentally overcook eggplant when you’re trying your hardest not to undercook it, well, blend it into dip and call it dinner. And then the next time you do it, it’ll be on purpose.Now that you know how to cook eggplant…Spicy Braised Eggplant NoodlesA weeknight noodle dish that comes together in no time thanks to a power thruple of gochujang, miso, and tomato paste.View RecipeExplore Bon AppétitFarmers Market ChallengeHealthyishcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-23", "author": ["Condé Nast", "Alex Beggs"]}