{"id": "003252f34efef5946975a50724e42e78", "url": "https://www.bonappetit.com/recipe/sweet-potato-bowls", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Sweet Potato Bowls with Spiced Lamb and Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSweet Potato Bowls with Spiced Lamb and MushroomsBy Anna StockwellFebruary 12, 20185.0(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Anna Stockwell, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThese sweet potato bowls are an easy go-to weeknight dinner: Steam the sweet potatoes while you sauté the mushrooms with spiced ground lamb, quick-pickle fennel and onions, make a simple yogurt sauce, and dinner is ready in about half an hour.Ingredients2 servings1tsp. kosher salt, divided, plus more1large sweet potato (about 1 lb.), halved lengthwise½fennel bulb (about 6 oz.), thinly sliced, plus fronds (for serving; optional)½small red onion, thinly sliced¼cup apple cider, coconut, or unseasoned rice vinegar3Tbsp. extra-virgin olive oil, divided½lb. ground lamb1tsp. ground cumin½tsp. ground cinnamon1tsp. Aleppo-style pepper, plus more for serving8oz. wild mushrooms (such as shiitake, oyster, chanterelle, porcini, hen of the woods, black trumpet), sliced into ¼\" slices½cup plain full-fat yogurt2Tbsp. fresh lemon juice¼cup mint leavesPreparationStep 1Fill a large pot with about 1\" water; season with a big pinch of salt. Set a steamer basket in pot. Cover pot and bring water to a boil. Add potato, cover, and steam until fork-tender, 20–25 minutes.Step 2Meanwhile, toss sliced fennel, onion, vinegar, and ¼ tsp. salt in a medium bowl. Let sit, tossing occasionally, at least 10 minutes and up to 30.Step 3Heat 2 Tbsp. oil in a large skillet over medium-high. Add lamb, cumin, cinnamon, 1 tsp. pepper, and ½ tsp. salt and press into an even layer. Cook, undisturbed, until well browned on the bottom, about 4 minutes. Break up into pieces with a spatula and continue to cook, stirring occasionally, until browned, 1–2 minutes. Push mixture to one side of skillet and add mushrooms in an even layer; season with salt. Cook, undisturbed, until beginning to brown and soften, 3 minutes, then stir together with lamb mixture. Continue to cook, stirring occasionally, until mushrooms are golden brown, about 2 minutes more.Step 4Whisk yogurt, lemon juice, and remaining 1 Tbsp. oil and ¼ tsp. salt in a small bowl.Step 5Divide potato halves between bowls and mash slightly with a fork. Top with yogurt sauce and mushroom mixture. Lift fennel and onion out of vinegar with your hands and scatter over bowls; discard vinegar. Top with mint, fennel fronds (if using), and pepper.How would you rate Sweet Potato Bowls with Spiced Lamb and Mushrooms?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleSo good. This is one of my favorites - easy and chock full of flavor. I’ve made it with proper Aleppo-style pepper and with substitutes (e.g., paprika and cayenne) and I think the Aleppo makes a difference (order from Penzey’s if not readily available where you are). Ditto the fennel fronds if you have them. Tried many different mushrooms and it doesn’t really matter too much which you use but a mix is nice. AnonymousSeattle, Washington 3/11/2022WOW!!!  Lucky to have a half lb of ground lamb in the freezer and came across this.  Roasted 2 small potatoes other than that followed directions exactly which is rare for me.  I was questioning how this would come together but OMG!!  So much flavor, easy, delicious will be made again and again.  Very excited about this one. <3 Auggie Milford, MAA6/23/2021Fabulous recipe and actually doable in the 30 minutes it claims. Took the suggestion of another poster and added grated cucumber to the yoghurt, like a raita. Only had Cremini  mushrooms but they crisped up beautifully in the lamb fat - don’t drain that off!! Definitely something we will keep on rotationJoanna Horobin12/1/2020This is a wonderful recipe. I did not think I was a big fan of sweet potatoes until I made this. Still haven’t had the chance to make it with lamb, but I plan to do so soon. Tonight I plan to make it with leftover shredded beef. This recipe is very versatile in my opinion. AnonymousChattanooga, TN8/10/2020 This is my second time making this wonderful, fragrant, savory, dish. Love, love, love it! Eventually I hope to find some actual ground lamb, rather than hamburger! The quest for all the interesting ingredients in this dish took a while to pull together: Aleppo style pepper, fresh fennel,the lamb! The mint I had in my garden. I would like to try making my own Garam Masala too! Thank you, BA!AnonymousCary, NC6/28/2020This was great!   I doubled the recipe, skinned the sweet potato and cut it into smaller portions so it would steam a bit faster.  I used labneh for the yogurt (personal preference) and added some Aleppo pepper to the lamb - that with cumin and cinnamon was delicious.  My lamb rendered A LOT of fat, much of which I spooned out before added the mushrooms, which never got particularly golden but still tasted great.  The yogurt sauce kind of melts into the sweet potato when it's hot, and the pickled fennel adds a nice crunch with acidity.  I didn't have onion or mint, next time I'll do onion instead of fennel, and I think the mint would set it off nicely.AnonymousOakland, CA4/12/2020Delicious! Complex flavours which all go so well together. Used cumin/cinnamon combo and didn’t change a thing. Will make again and again.AnonymousVancouver4/6/2020100% agree with the previous comment. This is 10/10. I have made it so many times, actually planning to make it for my daughter's 2nd birthday dinner!AnonymousChicago10/18/2019THIS RECIPE RULES. Why is this not getting as much love as the Mushroom Carbonara??? Y'all get on this spiced-lamb train and take it all the way to the end of the line because it is perfect. I do not live in a metropolitan center and therefore my grocery did not carry garam masala (sad) so I used a combo cardamom/cinnamon/cumin & it was DELISH. Plus I threw some shaved cucumbers/mint into the yogurt. One more time, this recipe is the bomb.com. (The printed recipe says garam masala, this one says cumin/cinnamon, my personal thought is that any spice here is a great spice.)AnonymousVirginia8/26/2019Explore Bon AppétitRice and Grain BowlSweet PotatoPotatoVegetableGround LambLambMeatChanterelle MushroomMushroomShiitake MushroomOyster MushroomPorcini MushroomEasyWeeknight MealsMainGluten-FreeNut-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Anna Stockwell"]}