{"id": "00392d8dc247a82907734d8fa4646cee", "url": "https://www.bonappetit.com/story/fariha-roisin", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "Fariha Róisín's Nighttime Routine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFariha Róisín on the Rituals (and Silk Pillowcases) That Help Her Get to SleepWinding down with natural wine... and a few other things.By Martine ThompsonMarch 30, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn 'Going to Bed with...' we talk to the people we're crushing on about how they wind down before going to sleep.What does it mean to genuinely take care of yourself in 2018? Who is able to do so with ease, and who is not? For writer Fariha Róisín, dissecting such questions are part of her M.O. Her work explores how self-care can function not just as self-indulgence but a radical form of self-preservation, and that exploration extends beyond the page and into her personal life too.Fariha making turmeric tea before bed\nPhoto by Emma FishmanAs a queer, Muslim, femme daughter of immigrants, Róisín admits to at times feeling “a lot of guilt and a lot of shame for wanting to care for myself.” But she’s learned at least one solid practice: preparing for a good night’s rest. “A bad night of sleep will terrorize me the next day,\" she says. \"I know I'm happier, more open and a cognizant, generous person when I stay true to my sleep routine.” Here, Róisín shares a few of the ways she winds down after a long day—and, yes, there’s wine involved.Natural wine after a stressful dayA nice, sparkling rosé pet-nat is what I want when I’ve had a really shitty, long day. Ironically, I didn’t grow up drinking. I’m Muslim, so it’s not a thing that was readily accessible to me. But when I did start drinking, a couple years ago, I decided I wanted to be really ethical about what I was intaking. Natural wine has so many health benefits, I don’t get the hangovers, the sugars are lower, and there’s no nasty additives. I really appreciate that purity. The artistry and the care that goes into cultivating the grapes, and just the way that it makes you feel—there’s a very particular kind of experience when you’re drinking natural wine. I could be a complete asshole, and that’s maybe not true for anybody else, but, for me, it’s almost spiritual.Self-care starts with a shower\nPhoto by Emma FishmanEvening showers and aromatherapyI’m definitely a shower in the evening person. I have to feel clean before going to bed, otherwise I can't fully rest. My friend Jenna Wortham told me about how great eucalyptus leaves are—they’re like six dollars from any corner grocery store. I hang them in the shower, and when the hot water hits the leaves, it turns into eucalyptus steam. It’s such a wonderful thing.Post-shower oilsI love the Italian brand Santa Maria Novella’s skin tonic. It comes from Florence, and it’s a 600-year-old company made by monks. I use that all over my body. I use Everyday Oil, which is really wonderful and has lavender in it which is really good for sleep. I’ll put on Lucas’ Papaw ointment on my lips. I also started making my own oils for myself and putting them into little bottles. Argan and avocado are really good for dry skin, so I used them as a foundation for the oil I make. Jasmine is also one of my favorite scents, and I get it cold-pressed from Abu Dhabi, cultivated the way Arabs create perfumes, so it's a darker, more pungent jasmine. Altogether, it nourishes my skin in the way I like best. It’s nice to use something I’ve created. That’s how I like to live: Do it on your own and see what happens.Her current skincare lineup\nPhoto by Emma FishmanA cup of turmeric tea before bedI grew up drinking golden milk; it’s a huge part of my culture, and turmeric has many healing properties. A couple of years ago, I started to make it myself. I make it from scratch, using coconut milk or almond milk, cinnamon, cardamom, and some maple syrup or honey, and I’ll make it to drink before bed. It’s something that I’ve found actually calms me down and brings me back to my body. It takes the anxiety of the day out so I can just relax.Create your own ritualsI find the act of completing a ritual to be really healing and almost more important than the ritual itself. It’s like an offering to yourself. Taking that extra moment to moisturize my body even if I’m really tired and having a bad day, or having that shower: I force myself to do it every day, even when I don’t want to. My body recognizes that it’s time to sleep, and it naturally gets tired.Good sheets mean a good night's sleepMy bed has to look appealing. Sheets are super important to me, and I recently heard about these silk pillowcases from this makeup artist I worked with on a shoot and purchased those, so I feel like that will add a lot to my sleep routine.Explore Bon AppétitHealthyishGoing to Bed withprofileRead MorecultureBody Scrubs, Feather Robes, and Other Failed Experiments in Self-CareBy Jenna WorthamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Martine Thompson"]}