{"id": "003fbaf7cba6a7407cd4f1ed9296ab8c", "url": "https://www.bonappetit.com/story/bay-leaves-taste", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Do Bay Leaves Actually Taste Like Anything? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDo Bay Leaves Actually Taste Like Anything?Let's put this whole bay leaf controversy to bed once and for all.By Alex DelanyJanuary 10, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThe Illuminati. The Loch Ness Monster. Bay leaves. All phenomena that inspire controversy and skepticism. And while we can’t speak to the existence of Nessie or secret societies hell bent on controlling world events (if you are real, please contact us.), we can most certainly say this: Bay leaves are 100% legit.There are a lot of haters out there who think that bay leaves are pointless, a flavorless addition to soups and sauces. And those people are wrong. Bay leaves have flavor. We promise.Sure: If you smell a dried bay leaf, you might not get as much aroma as you would with a pinch of dried basil or thyme. But that doesn’t mean there isn’t flavor there. When the herb is infused into water, broth, or another cooking liquid, an almost minty flavor (somewhere between spearmint and menthol) develops, with subtle hints of black pepper and Christmas tree pine. They add a subtle bitterness that keeps heavy soups and stews from being so, well, heavy. Are you going to be able to pick that flavor out of all the other complex flavors present in a bite of beef stew? Probably not. But would you miss it if it wasn't there? Yes. While the flavor of things like chiles, dried spices, and browned meat shout, the flavor of the bay leaf whispers. Listen for a change, why don't you!Steak with onion and bay leaves, lookin' like a snack. Or dinner.\nAlex LauThat said, not all bay leaves are created equally. Fresh bay leaves, which you can sometimes find in the produce section of the grocery store alongside the other fresh herbs, are going to be a lot more pungent than the dried ones you'll find in the aisle with all the spices. And the dried ones you'll find at the store are probably going to be a whole lot more flavorful than the five-year-old ones that are kicking around in your spice drawer. The moral of this story? If a recipe calls for dried bay leaves, and you happen upon some freshies, you can use fewer of them and get the same impact. That, and if you can't remember when you bought the jar you have at home right now, go ahead and throw those guys out and buy some new ones—they aren't going to taste like much, and we don't need them giving the elegant bay leaf a bad name.People are stubborn. We are too. If you still have your doubts, take some (not ancient) bay leaves and boil them in a bit of water. Let the water cool, remove the bay leaves, and take a sip of that brew. You’ll get that bay leaf flavor. And guess what. That flavor doesn’t go away when the water changes to stock or broth. Just because you can’t see the foundation of a building, doesn’t mean it isn’t there. Same goes for bay leaves. But don’t try to build a skyscraper on a foundation of herbs. That won’t work.Now that you're a believer, let's make some chicken adobo:Easiest Chicken AdoboWe get that sweet, salty, tangy, garlicky chicken adobo flavor with minimal effort. Lazy folks, rejoice!View RecipeExplore Bon AppétitBasicallyBay LeafherbSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Alex Delany"]}