{"id": "00456a394e0c6b12e0f0b51c94e1fa27", "url": "https://www.bonappetit.com/story/recipes-we-need-this-time-of-year", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "The Recipes We Need Most This Time of Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Recipes We Need Most This Time of YearHoliday season recipe recommendations and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroDecember 5, 2019FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last night I saw an old friend, someone I hadn’t seen in far too long considering how close we live and how fond we are of each other. We met in a college writing class, but our social orbits never really overlapped until we both ended up in New York in our early twenties. Lonely and hungry, we ate at restaurants we couldn’t afford on grad-school stipends and entry-level salaries. We’d talk about dating and writing and how much we loved New York, though in hindsight it was steamrolling us, or me at least. After a couple years we fell out of sync again. We both moved and came back, got more degrees and different jobs (actual, paying jobs!), fell in and out of love, and ten years later, met up for dinner again.At the bar at Saint Julivert, we talked about this distinctly New York phenomenon: We have so many friends in this city...and we never see them. We’re all ping-ponging around like unstable atoms, crashing into each other for a meal or a few glasses of wine, then careening out into the city’s dark matter again. My friend had spent the past year experimenting with holding still. “If I just stand in one place, everyone will eventually run into me” is how she put it. That’s meant cooking dinner every Sunday for whomever wants to come, then emailing a little dispatch about what she cooked and whatever else is on her mind.We talked about how lucky we feel to be able to write regularly. My friend keeps her newsletter list small on purpose so she can write as candidly as she wants. The Healthyish list, on the other hand, has reached a size that makes me sweat to think about. I said this, and my friend reminded me of a thing Lady Gaga said in an interview a few years back, about how you should play a dive bar like it’s an arena and an arena like it’s a dive bar. I think I’ve done this unwittingly as Healthyish has grown; most of the time I willfully ignore the number of people who may be tuning in. And I hope to keep doing it that way.Speaking of newsletters, this one by Helena Fitzgerald is a hot take on the best song of the last decade that’s not really about a song at all. For a coming-of-age essay set in a different city, read Liz Riggs on the Nashville wine shop that eased her into adulthood. Also on Healthyish this week, a dashi oats recipe joins the ranks of my beloved dinner scramble: a so-called breakfast food turned into a super simple and cozy weeknight dinner. (Yes I ate the leftovers for breakfast, and you can too). We need recipes like these oats more than ever this month, as our ping-ponging reaches max velocity. This is a reminder to myself as much as to you: You don’t have to RSVP “yes” to everything. You can go home and cook yourself an easy meal.And one other reminder: We have a lot of opinions on the gifts you should be giving this year. Check out our guide for all the hyper-specific recs.Thanks, as always, for reading.Until next week,Amanda ShapiroHealthyish EditorP.S. Last week’s newsletter didn’t send because of ~technical difficulties~, but it’s up on the site now if you care about a curmudgeonly take on Thanksgiving...and who I finally decided to thank this year.Explore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyle[*whispers*] I Don’t Like ThanksgivingBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-05", "author": ["Condé Nast", "Amanda Shapiro"]}