{"id": "0045df5bfada687b5fe18b8570fac411", "url": "https://www.bonappetit.com/story/bas-best-lasagna", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "BA's Best Lasagna Is Our Only Winter Hobby | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBA's Best Lasagna Is Our Only Winter HobbyNothing says personal growth like a casserole dish that weighs more than a slab of marble.By Alex BeggsFebruary 7, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Chris MoroccoFacebookTwitterEmailThere are only as many layers in a lasagna as you can aspire to. And this isn't a metaphor–you really just keep layering the meaty sauce and creamy béchamel and squiggle-edged noodles until your casserole dish cries out: \"Enough is enough!\" And into the oven it goes.Five, six layers should about do the trick. No one knows this lasagna math more intimately than senior food editor Chris Morocco—man who provideth us with BA's best spaghetti and meatballs—who was tasked with the development of BA's best lasagna recipe. The goal was a classic lasagna recipe that, unlike another certain recipe on the site, wouldn't require an epic 5-day pasta making, bolognese-brewing extravaganza of labor. Instead the takeaway here is that a lasagna is only as good as its ragù, and béchamel is not optional. But allow me to elaborate on all of the reasons you should make this lasagna at the next opportunity, because nothing says personal growth like a casserole dish that weighs more than a slab of marble.ContentThis content can also be viewed on the site it originates from.Ragù ThoughtsThe key to incredible lasagna—a step up from pretty good lasagna and three steps up from mystery potluck lasagna—is a meaty sauce that's rich in flavor, and never watery. The thing with a huge, heavy pan of lasagna is the QUANTITY of everything. There's much muchness. You need so much ground beef that it's difficult to make sure it's all browned, an essential detail to flavorful sauce. But there's a simple solution. Roll the ground beef into lazy meatballs. Size doesn't matter, perfect spherical shape doesn't matter, it's all just the fact that you can easily brown meatballs and then smash them down later and get through a ton of meat in one go. The meat gets that deep, mahogany color and tender texture. Kinda crazy sounding, but it works. We call this the MeatballMethod™. Follow it for lasagna success.Serving suggestion: with wine.\nWait, One More Ragù ThoughtMorocco told me something I normally wouldn't share with you, because we at BA live in this glowy fantasy bubble where people make everything from scratch. But shhh sometimes they don't. So please note that even if you prefer to use your favorite jarred ragù, the recipe ratios remain the same, and you still very much need béchamel. Reasons below.Béchamel Dreams\"There's something about béchamel that's medieval,\" Morocco told me over a casual conversation about the \"boiled milk, flour sauce.\" There are béchamel doubters out there, and they can't be acknowledged when it comes to superior lasagna construction. You must have it. Béchamel, a thick (in this case) white roux made by whisking together butter, flour, milk, and Parmesan cheese, acts as a binder in the lasagna skyscraper, helping everything stay together. And as gravy-like as it sounds, it lightens up the lasagna, which can start to taste heavy, and weighted-down from the five-to-six layers of straight-up meat sauce. The ragù needs a counterpoint, like every good meat-based superhero does. Like we all do. You can't get through this life thing alone. Neither can your lasagna.Noodle HopesThis isn't really your homemade pasta moment. However, you could do it, and that would be impressive as hell. Instead, you could buy fresh lasagna noodles from your closest pasta dealer (legal in most states), or you can use the dried stuff. We like De Cecco because they're wide and short, and, I literally quote Morocco: \"They have less severe edge ruffle.\" 😂 DYING. \"How's your edge ruffle today, darling?\" \"A little severe, I'm thinking of stopping by Urgent Care.\" Okay not to take this any further, but the straighter De Cello noodle edge also means you get MORE crispy corners. This is not an ad.In this recipe, the swap is 1:1 for fresh vs. dried, so choose the path most convenient, as Robert Frost said.WAIT, BUT WHAT ABOUT THOSE NO-BOIL LASAGNA NOODLES? No. Hard pass. The chemical makeup of no-boil noodles makes them super absorbent, thirsty for the boiling water they've been deprived. When we took them for a lasagna test drive, they soaked up the ragù and béchamel and became soft and gummy. You want to taste the distinct layers—and more importantly, you want some signature lasagna ooze. You lose the ooze with no-boil noodles. That's a personal tagline.Something's Missing Here. Where Is My Layer of Cheese?We incorporated parm into the béchamel, so the only layers you need to keep track of are the red sauce and white sauce. Keep it simple.Enough Talk. Get the Recipe:BA's Best LasagnaLayers of ragù and béchamel are all that is right in this world.View RecipeExplore Bon AppétitLasagnaItalian AmericanBechamelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Alex Beggs"]}