{"id": "004bf40b1c19184d0e97f09c6207fb34", "url": "https://www.bonappetit.com/story/jonathan-gold-reason-i-write-about-food", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Jonathan Gold Is the Reason I Write About Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJonathan Gold Is the Reason I Write About FoodThe LA restaurant critic set me on my path. In fact, without him, I wouldn’t even have known a path existed.By Julia KramerJuly 23, 2018FacebookTwitterEmailCourtesy Sundance SelectsFacebookTwitterEmailJonathan Gold, who passed away July 21 at age 57 of pancreatic cancer, is responsible for the two major misconceptions I’ve had about food writing: 1) that all of it could possibly have been as good as his and 2) that all restaurants were created equal, no matter the chef, price point, or location.I didn’t grow up wanting to be a food writer, for the simple reason that I didn’t know “food writer” was a thing one could grow up to be. Then in 2004, I shipped off to southern California for college, and I studied at a coffee shop that had copies of the LA Weekly lying around, and I read, for the first time, Jonathan Gold’s annual list of the 99 Essential Los Angeles Restaurants (the number went up to 101 when he went back to the LA Times a few years ago).As someone who had never read any other food writing, I became convinced that writing about restaurants was the most interesting kind of writing that existed anywhere in the world. Which, it turns out, it’s not. I later realized it’s Jonathan Gold—not food writing as a genre—who is brilliant. (I guess I should write \"was\", but it just doesn’t feel right.) By that point, though, I was already too deep in it.For four years of college, I read his reviews. And when, soon after graduation, I started writing my own, for the weekly mag Time Out Chicago, I began studying his. Whenever I was stuck on a lede, I would simply open a new tab and read a few of Gold’s recent pieces.I turned most often to his Essential Restaurants lists, like this one from 2008. Chameau: “An argan-honey dip? Do you know where that argan seed has been?” Langer’s: “In the course of the half-block walk from the Alvarado Blue Line station to the old-line delicatessen Langer’s, you will smell the food from a half-dozen Central American countries, pass within sight of Mexican street murals, and be offered the opportunity to buy fresh mangoes, counterfeit green cards and cut-rate cumbia compilations.” M Cafe De Chaya: “If you’ve ever wondered if people actually wear the $400 jeans you see advertised in Vogue, an hour at M Café can be instructive, a merry parade of the snuggest styles and the most avant-garde finishes, worn by some of the most beautiful people on Earth.”In my head, there were never enough words to describe a meal: What was left after crispy and tangy and nuanced and delicate? But reading Gold was like being set free from my dark, depressing food-writing closet. It would remind me how expansive and evocative language could be. It would remind me that “food writing” shouldn’t sound like “food writing”: It should sound like a real person. It would remind me that restaurant reviews aren’t about knowing it all or, worse, pretending that you know it all; they’re about writing something that people actually want to read.Having been educated in the unofficial school of Jonathan Gold, I couldn’t understand the logic that practically all other media outlets besides the ones he wrote for seemed to abide by. Why were certain restaurants deemed of a caliber deserving “starred” reviews while others were not? Why were “best of” lists only of sit-down restaurants? I find it useful to think back to that time when I imagined that all food writing was like Jonathan Gold’s. It’s like a re-set button, a way to redirect when I realize I’m heading in the wrong direction.A few years ago at Bon Appétit, I started a reading group, where we discussed our favorite pieces of writing and what we liked about them. I never had to hesitate when pulling pieces to share with the group. I always went straight to Gold’s “Counter Intelligence” column, eager to share with my new colleagues what my old ones already knew: This man is the reason I become a food writer. And every time I read his work, I am reminded how much better of a job I could be doing at it.I know that I am both lucky and privileged: that I ended up at a college within the delivery range of the LA Weekly, that Gold wrote for the LA Weekly during that time, that my boyfriend had a car and would drive me from Claremont to Little Tokyo for ramen or Glendora for strawberry doughnuts or Koreatown for Oaxacan tlayudas. Jonathan Gold set me on the road that became my career. In fact, without him, I wouldn’t even have known there was a road.Despite the immense influence that Gold’s work has had over my life, I never felt I had anything to say to him. It didn’t cross my mind to reach out to him, to ask him out for a meal—in my mind, that would be like a kid at tennis camp calling up Serena Williams simply because they both swing rackets. I still feel that way today. And yet there’s another part of me that wants to say something, to express my gratitude, over and over again, to him but also to no one in particular: Thank you, Jonathan Gold.See more: Jonathan Gold Was the Food Writer Who Made Us Love Food WritingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-23", "author": ["Condé Nast", "Julia Kramer"]}