{"id": "004d50f222393c56fcd3df05aa953526", "url": "https://www.bonappetit.com/story/salmon-hot-dogs", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Salmon Hot Dogs: It’s a Hot Dog. It’s Also Salmon. And I Love It. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s a Hot Dog. It’s Also Salmon. And I Love It.Pescatarians, this one’s for you!By Hilary CadiganMay 27, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Here is something about me: I love hot dogs. Here is something else about me: Hot dogs make my stomach hurt. I think it might have something to do with nitrates, and/or the fact that I can never seem to eat just one (picture one of those old-timey cartoons where a dog runs off with a whole string of sausage links—that dog is me). Whatever the reason, my digestive system, usually a reliable old girl, simply cannot handle the things. Over the years, I’ve tried learning to love tofu dogs (bleh!) and opting for burgers instead (okay, fine), but in my heart remained a hot-dog-shaped hole. Or, more precisely, in my stomach remained a dull burning sensation caused by the several processed meat tubes I still couldn’t stop myself from eating at the cookout.That is, until the day I came across Kvarøy Arctic Salmon Hot Dogs.At first, I thought what you are probably thinking: Why. But then I shrugged, throwing caution to the wind and a two-pack into my basket. What did I have to lose?Turns out, nothing but the stomach pains. Believe it or not, the fatty, velvety texture of the salmon makes it an excellent substitute for beef or pork, and a clever casing made with fish keratin means these dogs even have a little bit of that quintessential snap to them. The salmon flavor is present but subtle; balance it out with one of their infused options—like jalapeño and Jarlsberg cheese (my personal favorite)—and you may forget you’re actually eating fish at all. I like to brown them on the grill, squeeze on some grainy mustard and horseradish, and watch my Oscar-Meyer FOMO fade faster than that sausage-toting terrier fleeing the scene of the crime.Honestly though, I’d recommend these babies even if your stomach can tolerate normal wieners. Because did I mention that they’re also really good for you? We’re talking a full weekly recommended allowance of heart-healthy Omega-3’s in one serving. Plus, they’re better for the planet: Kvarøy’s salmon is sustainably farmed in Norway and uses blockchain technology for sourcing transparency. Their salmon burgers and hot dogs are made with the trimmings and off-cuts from the production of their fillets, meaning that by eating them you are actively reducing food waste rather than adding to it.Hot dogs with a side of smug. What’s better than that?Photo by Emma FishmanKvarøy Arctic Salmon Hot Dogs$7 at Fulton Fish MarketExplore Bon AppétitShoppingHighly RecommendSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-27", "author": ["Condé Nast", "Hilary Cadigan"]}