{"id": "004d861394c0da6331d5fddb13f04007", "url": "https://www.bonappetit.com/story/time-for-this-minty-rice", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "The Dish I Bring to Every Potluck | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Dish I Bring to Every PotluckIt’s vegetarian, easy to transport, and it feeds a crowd.By Dawn DavisMay 13, 2021FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to You’ve Got Time for This, a column where Bon Appétit’s editor in chief Dawn Davis highlights recipes from our archives that are delicious and accessible, and work every time.The pursuit of art nearly ruined the potluck for me.Young, curious, and crushing on New York City, I volunteered as a docent at the Museum for African Art. The museum was situated in SoHo, at the time one of the coolest neighborhoods in the city, and had been designed by Maya Lin. The staff came not only from the African diaspora but also from Asia, Latin America, Europe, and every pocket of America. It offered exactly what I had come to the city seeking: exposure to cultural traditions and people from around the globe.When the museum’s founder suggested a staff potluck to which even docents were invited, I knew the food would be outstanding and varied. Filipino adobo, Senegalese peanut stew, and manicotti bursting with the freshest ricotta were all on offer. My plate was full and I was ready to savor everything when a Nigerian staff member walked in and voiced his vehement disapproval, “If I invite you to my home for dinner, I’m not going to ask you to bring your own food,” he said with a dismissive head shake. Because I’d lived in Africa briefly and experienced outsize hospitality at every turn, his disappointment cut right through me. He was right, I thought. Where’s the hospitality in asking someone to bring food to your dinner party? From that point on, I decided that if you were invited into my own home, I wouldn’t insult you by asking you to cook your own food.I stood my ground until nearly two decades later, when a bevy of moms convinced me to celebrate the end of the school year with a potluck family dinner at my place. Daunted by the prospect of cooking for 20 adults and 30 kids on my own, I capitulated.One taste of Troy’s tangy homemade BBQ sauce and LuShawn’s super-moist chocolate cake, and I reversed my decades-long rule: You’re not insulting your guests by asking them to cook, I now understood, you’re giving them an opportunity to show off their best, most crowd-pleasing dish.And that brings me to the subject of my second You’ve Got Time for This, the column in which I scour the archives of Bon Appétit and Epicurious looking for those recipes where the payoff outpaces the effort. When looking for what to take to a small, “we’re all vaxxed” reunion, I discovered Yotam Ottolenghi’s Baked Minty Rice with Feta and Pomegranate Relish. Perfect for any kind of dinner, it’s a particularly elegant addition to a potluck for several reasons. Across cultures and age groups, most everyone loves rice. It complements meat but is vegetarian on its own, and when timed right is easy to serve piping hot instead of lukewarm, which is the fate of most dishes at a potluck. Before setting out, bake the rice for about half an hour, during which time you make the sweet, tangy, herby, and bright relish. (I highly advise getting an olive pitter.) Once at your destination, drain the feta, sprinkle it atop the rice, and broil it. Top it with the relish before serving and watch your friends enjoy one of the most festive, colorful, and delicious rice dishes I know.Get the Recipe:Baked Minty Rice With Feta and Pomegranate RelishIf you’ve given up on stovetop rice methods, you’ll love this hands-off oven technique.View RecipeExplore Bon AppétitYou’ve Got Time for ThisPotluckRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-13", "author": ["Condé Nast", "Dawn Davis"]}