{"id": "004efed74a2f71c866a68e9edde9381a", "url": "https://www.bonappetit.com/story/i-swore-against-cooking", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "I Swore I’d Never Be a Woman Who Cooked—Until I Had a Family of My Own to Feed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Swore I’d Never Be a Woman Who Cooked—Until I Had a Family of My Own to FeedAfter my parents divorced my mom raised me to be a feminist. But those principles became my armor against real intimacy.By Chloé Caldwell August 27, 2021FacebookTwitterEmailIllustration by Tallulah FontaineFacebookTwitterEmailThe George Foreman Lean Mean Fat-Reducing Grilling Machine hit the market in 1995. My parents separated in 1999. Two events that perhaps don’t seem related but are.Up until the divorce, when I was 14 and my brother was 16, we were a nuclear family: two kids, a mom, and a dad. We sat around our cherrywood table eating the types of dinners that were hallmarks of middle-class white families living in upstate New York in the '90s: meatloaf, Minute Rice, stew, and fish sticks when we had a babysitter. SpaghettiOs or ramen noodles if we were home alone. Dessert was occasionally plastic-wrapped Yodels or rainbow sherbert. I didn’t question any of it or think about whether or not my parents were happy—because I was happy.After the divorce my dad moved out, my brother left for boarding school, and dinners were never the same again.That’s when my mom bought a George Foreman. She worked full-time with underprivileged children an hour away, 40 hours a week, and was exhausted when she arrived home. We thought the electric grill was so cool—one of those all-American inventions that promised to make your life easier. And in some ways the George Foreman did make our lives easier; we both had enough stress and stuff to think about (for me, the exhaustion of trying to be middle-school popular; for my mom, money), without piling on dinner and its newly empty seats. So we used the table less and took to the cozy couch in front of the television. Instead of fussing over roast chickens and long-form lasagne, we became our own lean, mean unit of two—eating grilled chicken over greens and toasted English muffins stuffed with salami and molten cheese.My mom recently told me that during those years, post-separation, 6 p.m. was always the most depressing hour of the day for her. Sometimes she’d go to the library after work just to use the heat there, instead of coming home and starting a fire and facing the palpable loneliness of being two instead of four. She told me her therapist had said, \"Of course. That's when, historically, families began preparing dinner.\" I nodded along knowingly. For years I’d dreaded the exact same time of day; I didn’t yet understand how sharing a meal with family could become one of my greatest joys.The story I’d been telling myself (and plenty of others) was that I hate cooking. But was that even true?Since I was 14 at the time, friends and weed were my priorities. I mostly ignored the divorce, easy to do when you’re high all the time, and shut down my heart. My mom had never lived on her own until then, so she learned how to do the work my dad would’ve done: fixing the leaky sink, starting the car with jumper cables, and putting together furniture. “I am so proud of myself!” she’d exclaim, and I was proud of her too. Watching her live her solo lifestyle—going to yoga classes, doing step aerobics with purple weights, and buying Joan Osborne concert tickets—made me allergic to the idea of marriage, which would surely only end in divorce anyway. So I vowed not to learn to cook or to do ‘women’s work’: sewing, gardening, baking. “We aren’t good cleaners,” my mom once told me.I carried these beliefs with me into my 20s, when dinner was a cheeseburger to soak up all the Beefeater gin and whiskey sodas I’d drink. Or free pizza that the Brooklyn bar Alligator Lounge gave out with a PBR. Or Annie’s mac and cheese, the one meal I did pick up from my mom since she loved the peace-sign-shaped noodles. Even then—during those socially accepted young, wild, and free years—I’d watch people throw haphazard dinner parties in television shows like Girls who I couldn’t relate to. Was there a whole world out there I was missing out on?In my 30s, while living alone, I came across a life hack: going grocery shopping for kombucha, rotisserie chicken, and bags of baby carrots around 6 p.m. It was the best time of day to shop because the stores were always empty and I could scoot around with my trolley uninterrupted. There were virtually zero lines, easy parking, and I didn’t have to run into anyone and make small talk. Then one day it hit me. The store was empty because it was dinner time, and all the people were at home cooking and eating with their families. I was on an opposite schedule: picking at chicken bones in the car, a dinner-time loner.The story I’d been telling myself (and plenty of others) was that I hate cooking. But was that even true? A friend called me out once, saying, “You don’t hate cooking—you just don't know how.” Rebellion and defensiveness can look a lot alike. My mom had raised me to be an independent feminist, but in retrospect, I began wearing those principles as armor against real intimacy. I thought people who didn’t cook were cooler than those who did. Instead of breaking bread I found connection through writing books and essays about general mid-20s debauchery. A woman’s place was certainly not in the kitchen, I figured, because it was the place I, like my mom, was most uncomfortable—and alone.Then I met Tony: open-minded, warm, endlessly patient. The first time he saw my fridge, all it had inside was a bottle of champagne and some Earth Balance ‘spread.’ I sat on my kitchen counter as we got to know each other and he asked me if I liked to cook. I scoffed, shook my head, and said, “Nope.” I couldn’t stand to be seen as a woman who cooked; I only wanted him to see me as that archetypical writer, ambitious and self-reliant. Despite my usual defences, I found myself wanting to share my table with him and his precocious seven-year-old daughterThe transformation started slowly. When we were falling in love we’d get fried chicken at a local bar as an afterthought, realizing we hadn’t eaten after a whole day together, high on dopamine. Then, gradually, as our relationship became more serious, we spent as many nights in as out, decorating farro bowls with colorful vegetables and sautéing steaks and buttery spinach. I tried to pretend I knew what I was doing. In reality I was panicking on the inside while trying to look casual as I hacked at tomatoes and peppers. But Tony would gently remind me to season the food with olive oil and salt. His daughter would share bites of her anchovy-laced pizza with me. Tony and I took turns doing the dishes. And, in the safety of their love, I began to challenge my deep-seated belief that cooking dinner for your family would turn you into an exasperated housewife overnight.Our wedding day was very us, something I never imagined a marriage could be. We drank champagne in the backyard; I did not wear a white dress. There was no cake, but the icing for me was that Tony and I ended up in bed by midnight with a sourdough barbecue chicken pizza from the freezer. We ate it while reading the cards we’d been given by family and friends.I’m still not a great cook, but I’m comfortable and excited by food. On Monday mornings I open my weekly email from Smitten Kitchen, scanning the recipes and choosing what to cook with my family. My stepdaughter excitedly asks me what’s for dinner and it’s my favorite question to answer, knowing I’m nourishing the ones I hold dearest, creating stability and ritual that both connects us and allows us to thrive as ourselves. It’s powerful, the influence of those you love. Over the years I realized that cooking didn’t have to be in service to a man; it could be in service to me.I love 6 p.m. now; the opposite of how my mom felt during those lonely years after our family split. We often put on music in our tiny kitchen. We nibble on olives and gouda while we cook and talk. Sometimes we go around and share the highs and lows of our days, sometimes we eat in a mellow silence. Sometimes we laugh until we cry; sometimes we have disagreements. I haven't touched a Lean Mean Fat-Reducing Grilling Machine in 20 years, but writing this essay has made me nostalgic enough to consider purchasing one. I’d leave those dry old chicken breasts in the aughts but try my hand at the kind of grilled cheese my family can get behind: crispy on the outside, gooey in the middle.Explore Bon AppétitLifestyleCultureRead MoreLifestyleI Went Vegan for Love—And I Won’t Do It AgainBy Zoe DenenbergLifestyleI Hired a Cooking Therapist to Deal With My AnxietyBy Zan RomanoffLifestyleWhen I Accidentally Became a Mother, I Had to Learn to Feed UsBy Sophie HeawoodLifestyleDepression Stole My Sense of Taste. Here’s How I Got It BackBy Rachel ZarrowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-27", "author": ["Condé Nast", "Chloé Caldwell"]}