{"id": "006907cc6f3ae81f7ed8aca02f947175", "url": "https://www.bonappetit.com/story/prince-st-pizza-breadcrumb-topping", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "My Favorite Pizza Topping Is Just More Carbs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Pizza Topping Is Just More CarbsSorry, pepperoni cups. I just love the crunchy breadcrumbs at Prince St. Pizza in NYC.By Elyse InamineOctober 17, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I get the cult of black olives, the pep cup Stans, and the longtime anchovy lovers—all the heavy hitters in the very opinionated world of the tastiest pizza toppings. But have you tried breadcrumbs?Let me explain. Imagine a pizza, specifically a pillowy Sicilian square drenched in a fragrant tomato sauce, flecked with granules of salty Pecorino Romano, and baptized in grassy olive oil. And then imagine that this particular pizza comes loaded with a generous dusting of teeny tiny breadcrumbs. Some still burnished and crunchy from the oven, but not so dry that eating turns into a cinnamon challenge. Some partially soaked into the sauce for a comforting pappa al pomodoro effect. That is the Broadway Breadcrumb slice at Prince St. Pizza, the famed slice joint in New York City and the place that forever changed what defines a pizza topping for me.It’s a riff on the classic sfincione, focaccia spread thick with an anchovy-charged tomato sauce and milky caciocavallo cheese and apparently invented by Sicilian nuns. But here at Prince St. Pizza, they do things a little different. The sauce is much more tomato-forward, with an onion-y sweetness. The Pecorino subs for caciocavallo, and the anchovies are nowhere in sight. But the breadcrumbs, tossed with the usual Italian seasoning (oregano, basil, rosemary, thyme) and floating atop the sauce, are a must.This has been my go-to slice at Prince St. Pizza for years, and I always call ahead before I plan to go (hot tip!). That’s so I can grab a slice right when it’s out of the oven; if the pizza is sitting out in the glass cases, the breadcrumbs can get gloopy and lose their crackle. Plus, Prince St. Pizza doesn’t bake the Broadway Breadcrumb every day, which, again: calling is crucial. I probably call way too often—nearly as often as I ring my parents, so weekly. But I like to think of this as just a gentle reminder that some of us niche pizza topping lovers just want to be seen. And by seen, I mean consistently enabled to gobble down a crispy-topped, saucy-layered, soft-textured pizza stat.Go there: Prince St. PizzaExplore Bon AppétitHighly RecommendRestaurantsNew York CityPizzaRead MorecultureThe Frozen Pizza That Won Over This Pizza SnobBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Elyse Inamine"]}