{"id": "007f5c1e2be99691267710ea978a1fb2", "url": "https://www.bonappetit.com/story/how-a-new-orleans-staple-became-a-worldwide-steak-house-icon", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "How a New Orleans Staple Became a Worldwide Steak House Icon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow a New Orleans Staple Became a Worldwide Steak House IconBy Ruth's Chris Steak HouseMay 7, 2018FacebookTwitterEmailPhoto by Christina Holmes, Styling by Alison Attenborough, Kaitlyn DuRoss WalkerFacebookTwitterEmailNo one will blame you for thinking of a steak dinner and its well-earned reputation as “special occasion food” (with good reason) but who said steak can't be an everyday occasion? We’re all for more steak dinners on any night of the week, and Ruth’s Chris Steak House would tend to agree. From its humble beginnings with a single restaurant in New Orleans back in 1965 to leading the charge today as one of the most iconic steakhouse restaurants in the world—with over 150 locations—Ruth’s Chris is steeped in a rich history of community, hospitality, and of course, fantastic steaks. But it’s not just their USDA Prime cuts that get food lovers in the door. You can elevate your dining experience any night of the week at Ruth’s by pairing their custom-aged beef with a variety of mouth-watering, globally-inspired menu items. If you’re looking for a place to indulge in a prime-time night out or treat someone special to a meal they’ll not soon forget—Ruth’s has it all. And now we’re hungry.Cheers! We’re Toasting to Delicious Handcrafted CocktailsPhoto by Christina Holmes, Styling by Alison Attenborough, Kaitlyn DuRoss WalkerThere’s nothing like kicking off a night out with a cocktail or two—especially if they are expertly made. While typically heralded for their world-class wines, Ruth’s Chris has an impressive list of vintage classics and house specialty craft cocktails on their menu utilizing premium spirits, fresh-squeezed juices, and a host of other unique garnishes and ingredients. A favorite—first created at Pat O’Briens in New Orleans—is the Big Easy Hurricane. This 1940s classic gets a modern twist with the addition of pomegranate and garnish of a Luxardo cherry.Pro Tip: During Happy Hour at select locations nationwide, you can get a variety of cocktails, appetizers, and mouthwatering dishes for only $9 at the bar. Cheers to that!Treat Yourself to a Succulent Array of Fresh Seafood DishesPhoto by Christina Holmes, Styling by Alison Attenborough, Kaitlyn DuRoss WalkerThere’s something that feels indulgent about the mere thought of a fresh seafood dish in addition to a sizzling steak. Ruth’s Chris showcases a variety of seafood classics across the menu with starters like a traditional chilled seafood tower, spicy or BBQ shrimp, Ahi tuna, lobster, and of course, crab. To start, try the crab stack that’s served with a medley of fresh mango, avocado, and topped with colossal blue crab. It’s an elevated dish that gives you the perfect combo of sweet and savory in each bite. For the main event go ahead and order a classic combo of surf and turf. With choices of additions like blackened shrimp, jumbo lump crab cake or a lobster tail as the perfect complement to your steak—the world is your proverbial oyster.We’re Talking About Premium Steaks Expertly Cooked Just the Way You like ThemPhoto by Christina Holmes, Styling by Alison Attenborough, Kaitlyn DuRoss WalkerOf course you’ll expect a top quality steak when you’re out at a steakhouse but the beef at Ruth’s Chris is USDA Prime—representing the top beef available. They proudly serve these well-marbled cuts, hand selecting them for both thickness and tenderness. But it’s not just the cuts and quality of beef that are special here. Each steak is seared to perfection in a custom 1800o broiler, finished with butter and fresh parsley, and served sizzling on a 500-degree plate—just as Ruth liked it. A standout on their premium menu is the Porterhouse for two; a 40 ounce cut of prime beef that highlights the rich flavor of a strip and the tenderness of a filet. It’s broiled to perfection and then perfectly hand-cut tableside, ready for you to enjoy. Now that’s some seriously stellar service, well done.Oh, The Sweetest Thing: Handmade Desserts to Complete Your MealPhoto by Christina Holmes, Styling by Alison Attenborough, Kaitlyn DuRoss WalkerA fine dining experience wouldn’t be complete without a selection of homemade desserts to perfectly complement the entire meal. The Ruth’s Chris chefs create mouthwatering dishes including handcrafted, house-prepared classics and indulgent new creations. Try a taste of tradition with Ruth’s famous Crème Brûlée—a nod to their Louisiana-French heritage—or a more modern twist on dessert with the Chocolate Duo. Imagine rich chocolate cake coupled with chocolate mousse, drizzled with sweet cream and topped with fresh seasonal berries. Consider it a chocolate lover’s dream dessert that is the perfect finale to a supremely memorable meal.For more about Ruth’s Chris Steak House, premium steaks, and innovative tastemaker dinners, visit ruthschris.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-07", "author": ["Condé Nast", "Ruth'S Chris Steak House"]}