{"id": "0094fcbb1a690ad77eb83d59826ab73d", "url": "https://www.bonappetit.com/story/ugly-tomato-bloody-mary-mix-recipe", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "This Bloody Mary Mix Recipe Is Perfect for Bruised, Ugly Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Bloody Mary Is Made for Bruised, Ugly Tomatoes (They’re Beautiful Inside)Not all peak summer tomatoes are beauty queens, which is where this 5-minute Bloody Mary mix comes in.By Erika OwenJuly 28, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailMaybe it’s because I just watched Bo Burnham’s movie, Eighth Grade, or because I have a soft spot in my heart for misfits. But I was sold the moment I saw this new recipe for a yellow tomato Bloody Mary, which calls for “bruised tomatoes.”I consider myself a Bloody Mary enthusiast, given that I grew up in a state known for topping its brunch cocktails with mini burgers (Wisconsin—I’m from Wisconsin). I will never say no to a piquant Bloody Mary and I most certainly won’t say no to the opportunity to save some bruised and ugly—though perfectly delicious!—tomatoes from whatever happens to them post-farmers’ market. This recipe was created by Molly Baz for exactly that reason, a way to use up a bag of peak season, ripe, though slightly flawed tomatoes that others pass over for more aesthetically pleasing options. But not us, we’re turning them into a super quick Bloody Mary, blended together in like five minutes, I swear. Here’s how it goes down.After rescuing a few outcast yellow tomatoes—they’re a tad sweeter than the red tomatoes you may be used to, but make sure they’re super ripe, i.e. soft and juicy feeling—I gathered up the remaining ingredients: celery, lemon juice (and a lemon!), red pepper flakes, olive brine, gin, salt, sugar, Worcestershire sauce, hot sauce, and horseradish. (Does it say something about me that I already had most of these in my kitchen? Probably.)Ugly tomatoes, we see you and we love you. Here’s another genius way to use them.\nAlex LauI had to clean my blender of the leftover hummus clinging to the inside and to be honest, that was probably the longest step of this whole process. I grabbed those tomatoes and the chopped celery and tossed them into my weird Blendtec blender, which literally asks if I want to tweet about my blending experience on its futuristic screen. No, blender, I do not.When the celery-tomato mix was blended smooth, I strained it into a big pitcher. It was the color of the kind of sunrise you’d post on Instagram—sunshine-y yellow with a tinge of orange. Once I was happy with my pitcher situation, a particularly minimal glass-and-cork situation by IKEA, (I have three pitchers, this was a style decision, people), it was just a matter of whisking in the olive brine, hot sauce, lemon juice, sugar, Worcestershire sauce, horseradish, and salt. This is the part where you take a quick taste and adjust accordingly (mine needed more salt and a dash of hot sauce).At this point, I chilled everything for an hour to let the flavors meld, so if you’re making this for a crowd, allow for that cushion of time. Smart brunch hosts would do this the night before for even more punch.A note on serving: I have always wanted to know how to make spicy salt rim. It’s one of those things I’ve watched bartenders do but never quite figured out myself. What’s their secret?  Well good news, this recipe calls for a homemade spicy salt mix, so my life’s biggest question has been answered. I mixed black pepper, red pepper flakes, and a teaspoon of salt into a bowl. From there, I rubbed the rim of two glasses with a lemon wedge (to help the salt stick), and filled the glasses with ice. After pouring in the gin—1.5 ounces as recommended, or a little more if it’s a weekend—I topped the booze with my Bloody Mary mix and personalized my garnishes: cherry tomatoes and olives, no celery because I really don’t like it raw, a spicy pickle, and a single cheese curd. It’s no mini burger, but it would sure make my parents proud.Get the recipe:Yellow Tomato Bloody MaryA bright golden Bloody Mary made with bruised (but still juicy wonderful!) farmers’ market tomatoes.View RecipeMolly knows best:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-28", "author": ["Condé Nast", "Erika Owen"]}