{"id": "009a62c9820cbf3ad2c44e57880aac9e", "url": "https://www.bonappetit.com/recipe/charred-bean-and-pea-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Charred Bean Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCharred Bean and Pea SaladBy Claire SaffitzMay 22, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintBeautifully crisp with just the right amount of char, this loose riff on a three-bean salad covers your textural bases. This also can be serve at room temperature!Ingredients8 servings 2dried chiles de árbol6garlic cloves, smashed11½\" piece ginger, peeled, thinly sliced¾tsp. coarsely ground black pepper½tsp. cumin seeds⅓cup plus 2 Tbsp. extra-virgin olive oil2Tbsp. fresh lime juice1tsp. pure maple syrup1½lb. green beans, wax beans, sugar snap peas, and/or snow peas, trimmedKosher saltPreparationStep 1Cook chiles, garlic, ginger, black pepper, cumin seeds, and ⅓ cup oil in a small saucepan over low heat, swirling occasionally, until garlic is golden and oil is very fragrant, 5–8 minutes. Remove from heat and stir in lime juice and maple syrup; set dressing aside.Step 2Meanwhile, heat broiler. Place beans and/or peas on a wire rack set inside a rimmed baking sheet and drizzle with remaining 2 Tbsp. oil. Season generously with salt, toss to coat, and spread out beans in a single layer. Broil, undisturbed, until tender and blistered all over, about 4 minutes. Let cool.Step 3Arrange beans and peas on a platter and spoon reserved dressing over; season with more salt.How would you rate Charred Bean and Pea Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladPeaVegetableBeanSpringQuickEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}