{"id": "009edb5f3d6c5eff89260d76fbf4eab0", "url": "https://www.bonappetit.com/story/cast-iron-kyle-interview", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Brad Talks Vintage Cast Iron with the Instagram King of Old Pans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBrad Talks Vintage Cast Iron with the Instagram King of Old PansThe secret to bringing a rusty old pan back to life? High heat, elbow grease, and a secret blend of seasoning oils.By Brad LeoneMay 28, 2021FacebookTwitterEmailFacebookTwitterEmailI met Kyle Seip, a.k.a. @castiron_kyle, through Instagram and have obsessively followed his adventures in collecting and refurbishing old American cast-iron pans for some time now. And when I say old, I mean old: Some of these things were cast more than 100 years ago—and will last at least 100 more if treated correctly. Kyle’s passion for and knowledge of vintage cast iron is unparalleled. He’ll wake up before dawn to make sure he’s first in line at the flea market or the estate sale, hoping to score a worthless-looking pot or skillet just waiting to be revealed for the diamond it is. Being a great lover of cast iron myself, I sat down with the master to pick his brain about how he got into this stuff in the first place, what he looks for when he’s hunting, and how he restores these pieces of history to their former glory.Instagram contentThis content can also be viewed on the site it originates from.Brad Leone: Kyle, I got to ask: How the heck did you get interested in old cast iron?Kyle Seip: Well, I grew up enjoying food and cooking. I entered a lot of vegetable-growing and recipe competitions in 4-H when I was young. Then when I was an adult, I lived with my grandfather and took care of him for a while. I realized that these were the last years of his life, and I wanted him to have good food. He liked fast food and stuff like that, but I wanted him to eat good food. So I started making him recipes that he remembered having when he was a little kid in Tennessee, and I had to make sure I was cooking it the right way—and cast iron was the right way.BL: So how did you go from that to scouring flea markets and the like for old cast-iron pans and restoring them?KS: Well, I’ve always really enjoyed flea markets and estate sales and yard sales and stuff like that. And once I learned that that was pretty much the key place to get some of this old cast iron, it just drove me to go to them even more. I’ve netted some wild things in general, but also some of the best quality cast iron available, stuff that I probably couldn’t have found anywhere else. And when you get something from a yard sale or an estate sale, there’s often a story attached to it. It means a lot to me to be able to talk to a family member and find out what they’ve done with it or who it was passed down from. There’s something special about buying things that way.BL: Yeah, same for me. And when you’re talking about old American cast iron, these things can last generations as long as you don’t intentionally break them in half or drop them off a bridge or something. It’s like an old house—something you can pass down.KS: Exactly.Instagram contentThis content can also be viewed on the site it originates from.BL: So when you’re hunting for quality cast iron at a flea market, what are you looking for exactly?KS: In my experience, the best cast iron tends to come from the East Coast, especially parts of Pennsylvania and Ohio that were heavily involved in mining because they had access to good iron ore. And I tend to stay away from pans if I can’t identify where they’re from, especially if they’re really old—you can’t be sure that they’re 100 percent iron, and I don’t want to cook with something that might have lead in it.BL: I'm glad you brought that up, because that's something I didn't really even think about. I guess people could be melting down just about anything and pouring it into a cast.KS: Right, exactly. So the more you can identify it and the more you can find out about a pan, the better.BL: Okay, what else are you looking for?KS: Well, I always bring a straight-edged metal ruler with me, which I place along the bottom of the pan to see if there’s any bowing or unevenness. Because the naked eye can see if it's really bowed, but if it's more subtle that ruler will show me right away—if it rocks, then it’s bowed up. A pan like that will always have an uneven cooking surface, and you don’t want that.BL: Okay, so you’ve got to make sure it's flat on the bottom. Anything else?KS: Yeah, along those same lines you want to make sure that the metal doesn’t show any pitting or anything like that because those indentations will catch food and cause sticking.Instagram contentThis content can also be viewed on the site it originates from.BL: What do you mean by pitting?KS: Small depressions in the metal over time, almost like little craters. They’re caused by overheating sometimes or if the metal is too stressed. A couple of little ones are fine because obviously a pan that's a hundred-something years old is going to show some wear. But if it's too much, I pass on it. Same if there are any visible cracks or if I can tell that somebody's attempted to repair it. One thing I’ve learned working with metal my whole life is that you just cannot weld cast iron. Once it’s broken, that’s it.BL: That’s a great point. It's not like a steel pan, where you can possibly patch it. Cracks seem like a major thing to look out for.KS: Yeah! Not to get too nerdy, but cast iron typically has a carbon content of two to four percent, which is 10 times the amount of regular steel. So once it's broken, that's it.BL: Gotcha. Okay, say you find a really nice pan that doesn't have pits or cracks or bowing, but it's really rusted, which seems pretty common. That doesn’t mean it’s necessarily dead, right? It can still be brought back to life?KS: Definitely. Rust is just oxidization, which means the metal was exposed to too much air and moisture—get rid of that and you’ve got your pan back. A really good way to start getting rid of rust or anything that’s gotten stuck on over time is to put the pan on the grill, close the lid, and crank it as high as it’ll go. Leave it in there for two or three hours and a lot of the rust and gunk will lift up in big flakes that you can just peel off.BL: So that’ll get the bulk of it off—what then?KS: Then I’ll combine sea salt and water to create an almost toothpaste-like consistency and start rubbing that into and all over the pan with steel wool. It’s got to be stainless steel; anything lighter will score the pan or stick into it. You’ve got to give it some good old-fashioned elbow grease. That’s the main thing I tell people about these old cast irons—you’ve got to put some real effort into them. This isn’t a dip-and-go sort of thing.BL: Right, we’re talking about years or decades of built-up carbon, so it’s going to take more than a swipe with a sponge.KS: Yeah, it's not a quick or easy process. But the rewards are lifelong. You can end up with a usable pan that’s a hundred years old!BL: So what do you do once you get all that carbon buildup and rust off?KS: Once you get it down to a bare metal with the salt paste and stainless-steel scrubber, you’re going to want to rinse it thoroughly and place it in a 500 degree oven for about two hours, which will sanitize it and ensure that everything you don’t want on the pan is burned off and gone. Then you’re going to take it out, let it cool, and it’s time to season it. I'll actually reveal the blend of oils that I use here—I've always told everybody it's a secret. It's one part avocado oil, one part flaxseed oil, and one part canola oil. It’s a really good blend that doesn’t smoke too much and keeps the finish for a long time. You blend those three together and you rub it all over the entire pan, not just the cooking surface; the oil acts as an anti-rusting agent and is needed to protect the integrity of the whole pan. Once it’s coated, place it on a burner and heat over medium until the pan starts to smoke, shut it off, and your pan is now properly seasoned!BL: Right, and that'll help you get a little bit like a nonstick surface?KS: Absolutely. You'll be able to do the egg test: If you can crack an egg in a seasoned cast-iron pan and swish it around without it sticking, then you did it right.Instagram contentThis content can also be viewed on the site it originates from.BL: And with that final seasoning step, how often will you do that to a cast iron that you’re using often? Once a year?KS: Really just on an as-needed basis. If you have your go-to pans, you can tell when they need the seasoning, like if something starts to stick a little bit. You have to read the pan; it’ll tell you if it needs seasoning or not. It's a learned process, but once you figure it out, it's like a relationship. I know which one of my pans are going to keep their surface for a long time and which ones I’m going to have to season every five uses or so, you know what I mean?BL: Totally. Okay, last question, man. If you could recommend someone to buy or look for one size of cast iron that they’ll get the most use out of, what would it be? Some of these old cast irons will have big eights and sixes and threes on them—which one is going to be the real work horse?KS: Well, if I had to choose one pan to use for the rest of my life, it would definitely be a size eight. (Actually, contrary to popular belief, the number on the handle is not the measurement of the pan, it’s just a casting mark.) A number eight pan measures about 10⅝” to 10¾” across, which is the sweet spot for me. You can roast a whole chicken in one; you can do six or seven slices of bacon; you can do both sides of a grilled cheese. And bake a cake! That's the workhorse. Number eight all the way.BL: Number eight all the way, man, couldn't agree more.Explore Bon AppétitCast ironToolsInterviewsPeopleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-28", "author": ["Condé Nast", "Brad Leone"]}