{"id": "00af49d37dfee950a441e69abf8ba2bc", "url": "https://www.bonappetit.com/story/bola-bola", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "This Filipino Bola-Bola Recipe Makes the Perfect Meatballs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'll Go Ahead And Say It: Bola-Bola Are My Perfect MeatballsDeep-fried splendor.By Arlyn OsborneMay 25, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Before I met my best friend in middle school, whose parents owned a pizzeria, I didn’t know that some people ate meatballs with spaghetti. In my world, hotdogs went with spaghetti. And meatballs definitely went with rice.When I came home from school, I was often greeted by the warm starchy smell of our rice cooker hard at work. But when I saw the fryer on the back deck and a gleaming red jar of homemade sawsawan, a spicy Filipino vinegar-based dipping sauce, standing confidently on the counter, I knew I could get excited for bola-bola. Bola-bola, the Filipino catch-all term for meatballs, are sort of like lumpia without the spring roll wrapper. Each oil-slicked sphere is sheathed in a crusty cortex of deep-fried splendor, with every bite unlocking a juicy center bursting with rich aromatic flavors and deep notes of salty umami. My perfect meatball.Bola-bola (translation: ball ball) can be eaten in a number of ways. A towering pile can be spotted at parties and potlucks as an appetizer. They can be tucked into pillow-soft siopao, Filipino steamed buns. During colder months, bola-bola swim in warm brothy bowls of almondigas, a misua noodle soup that oozes comfort. Over summer break, my sister and I would create elegant buffets of leftover bola-bola, French fries, Ranch, and Hi-C for a kid-friendly, finger food luncheon that I wouldn’t be disappointed to sit down to today. Because I’m a recipe developer, I like the assurance that comes with measurements and times. But when I make bola-bola, I toss all that to the wind and apply my mom’s way of cooking, which has only two guiding principles: whenever it looks right (as in, add the ingredients until it looks right) and whenever it’s done (as in, cook until it’s done). There’s plenty of room for interpretation and that’s really the beauty of it. Here’s how to make bola-bola:For about two dozen bola-bola, start by finely chopping 2 carrots, 1 yellow onion, and 8 scallions. Add the veg to a large bowl and grate in 3 garlic cloves. No need to get hung up on the vegetables. A random bell pepper half, a withered knob of ginger root—it’s all fair game.Next, add 1 egg and 1 Tbsp. each brown sugar, soy sauce, and oyster sauce. Season with 1 tsp. kosher salt and ¼ tsp. black pepper and mix it all together. Liquid condiments like fish sauce, soy sauce, and oyster sauce add complex savoriness, but don’t overdo it or your mixture may become too wet. If that does happen, don’t freak! You can always remedy it with an extra dusting of flour. Of course, spices such as ground ginger or garlic powder are a great way to add flavor without adding moisture.Stir in 1 lb. ground pork (pork is the traditional choice but beef or a combo of the two will also work also). Sprinkle over ⅓ cup flour and give it a final whirl. The mixture should be slightly sticky but able to hold its shape when pressed together in the palm of your hand.Line a baking sheet with parchment paper. This will be a landing spot for scooping and shaping the bola-bola. You can eyeball it, but I like to use a small cookie scoop to transfer mounds of the mixture onto the prepared baking sheet. Dampen your hands with a bit of water to prevent sticking and roll each mound into a ball. Heat ½\" neutral oil in a heavy skillet over medium heat. (Or if you’re my mom, go on and pull out that electric deep fryer.) If you’re using a thermometer, you want to stick around 350° F. Set a wire rack in a baking sheet and place it beside the hot oil. Fry the bola-bola in batches, turning occasionally, until deep brown and crusty, about 5 minutes. Then, use a spider to scoop them onto the rack to drain excess oil and cool slightly.This bola-bola recipe produces my Platonic meatball.\nPhoto by Isa Zapata, Food Styling by Micah MortonServe bola-bola with your favorite dipping sauce, white rice, or sinangag. Stir leftovers into a soup or toss with sweet and sour sauce and sautéed vegetables. Serving bola-bola is like making bola-bola: You really can’t mess it up.Arlyn Osborne is a recipe developer and food writer who splits her time between New York City and the Outer Banks.Explore Bon AppétitIt's That SimpleMeatballFilipinoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Arlyn Osborne"]}