{"id": "00bc93415151d7acc4501c21103cc0f4", "url": "https://www.bonappetit.com/recipe/lemony-herb-salad", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Lemony Herb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueLemony Herb SaladBy Andy BaraghaniJanuary 9, 20183.3(5)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThis simple salad is all about the herbs, so put your best effort into finding the prettiest greens.Ingredients4 servings2medium carrots, peeled, very thinly sliced into rounds½small red onion, very thinly sliced, rinsed, patted dry3cups torn mixed tender herbs (such as mint, parsley, and/or dill)½lemon3tablespoons extra-virgin olive oilKosher salt, freshly ground pepperPreparationToss carrots, onion, and herbs in a medium bowl to combine. Finely grate zest from lemon over salad, then cut lemon in half and squeeze juice over. Drizzle with oil, season with salt and pepper, and toss again to coat.How would you rate Lemony Herb Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleExcellent excuse to break out the mandolin!nancyuenSan Diego1/5/2022Explore Bon AppétitSaladMiddle EasternLemonCitrusFruitCarrotVegetableMintHerbs & SpicesParsleyDillEasyQuickSideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianHealthyishPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}