{"id": "00cf22a9db9bb436797aa1add98e00cd", "url": "https://www.bonappetit.com/story/anthurium-plant", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "This Anthurium Plant Will Make Your Holiday Table Feel Totally Fresh | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis One Flower Will Make Your Holiday Table Feel Totally FreshFlorist Marisa Competello taught us how to use the modern-feeling anthurium plant like a pro.By Aliza AbarbanelDecember 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailA rose is a rose is a rose—but there’s nothing like an anthurium. The waxy, otherworldly flower feels straight out of a Georgia O’Keefe painting, and it’s become a botanical barometer for measuring a restaurant’s downtown It factor. We've been spotting anthurium at NYC hotspots like Dimes, Primo's, and Flora Bar for months, all thanks to florist Marisa Competello of Metaflora.\"My arrangements can be a little kooky and atypical—I go through phases where I’m really into using feathers or painting in my arrangements and anthurium definitely lend themselves to that,\" Competello says. \"They’re just kind of provocative and cool, as well as a little weird and phallic, and they’re available at the flower market year-round.”It's obvious that florists like Competello favor anthurium, but they're striking enough to elevate any homemade arrangement too. Here, she walks us through the perks of using the so-called “flamingo flower.”Go for monochromeAnthurium come in a range of colors like white, red, green, and deep purply black. It can be tempting to use them all, but Competello prefers to hone in one color, clustering the monochromatic blooms together to make a sculptural arrangement. “I often use anthurium as an accent or a pop of color against a neutral background like palms,\" she says. \"They’re like an exclamation point.\" This technique creates impact with just a few flowers, which is ideal as anthurium can be pricy. Try pointing all the flowers in the same direction for a smooth line and a striking shape.Instagram contentThis content can also be viewed on the site it originates from.Don’t kill your darlingsCut flowers quickly fade from their prime, but anthurium are an excellent choice for arrangements because they're relatively hardy. \"Anthurium will last over a week, sometimes more, and when they expire the stamen will stay the same and look alive, which is also interesting,\" says Competello. \"It’s always helpful to change the water every couple of days, but other than that these are pretty low-maintenance and will last.”Instagram contentThis content can also be viewed on the site it originates from.Get a little weirdSometimes the best arrangements aren't afraid to get a little irreverent. Competello creates metallic palms with silver or gold spray paint, and tucks in plumes of feathers to channel tropical '80s vibes. Keep things streamlined by picking one pop of color—a group of red anthurium, a spray of purple feathers—and keeping the background monochrome.Instagram contentThis content can also be viewed on the site it originates from.Go beyond bouquetsFloral arrangement are the perfect holiday party centerpiece but fade almost as fast as those bottles of Beaujolais. Anthurium are also a surprisingly rugged houseplant, just as long as you remember to water them regularly. Want a totally no-maintenance look that lasts? Pick up one of the bouquets from Metaflora’s new collaboration with West Elm—featuring imitation palm leaves, feathers, dried flowers, and yes, anthurium. Just don’t try to smell them. These ones are plastic, and therefore immortal.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleHow To Decorate Your Dinner Table With Fresh FlowersBy Juno DeMeloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-21", "author": ["Condé Nast", "Aliza Abarbanel"]}