{"id": "00d119c2a1fed52b1d37650b05dd8bec", "url": "https://www.bonappetit.com/recipe/winter-squash-carbonara-with-pancetta-and-sage", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Winter Squash Carbonara with Pancetta and Sage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2014 IssueWinter Squash Carbonara with Pancetta and SageBy Alison RomanPhotography by Christina HolmesJanuary 2, 20194.2(672)Read ReviewsTriangleEmailPinterestPrintPhoto by Christina Holmes, Food Styling by Rebecca Jurkevich, Prop Styling by Kaitlyn Du RossEmailPinterestPrintEmailPinterestPrintActive Time1 hoursTotal Time1 hoursKabocha squash is made for purées.Ingredients4  Servings2tablespoons olive oil4oz. pancetta (Italian bacon), chopped1tablespoon finely chopped fresh sage12-lb. kabocha or butternut squash, peeled, seeded, cut into ½” pieces (about 3 cups)1small onion, chopped2cloves garlic choppedKosher salt and freshly ground black pepper2cups low-sodium chicken broth12oz. fettucine or linguine¼cup finely grated Pecorino, plus shaved for servingPreparationStep 1Heat oil in a large skillet over medium-high heat. Add pancetta, reduce heat to medium, and cook, stirring occasionally, until crisp, 8–10 minutes. Add sage and toss to coat. Using a slotted spoon, transfer pancetta and sage to a small bowl; set aside.Step 2Add squash, onion, and garlic to skillet; season with salt and pepper and cook, stirring occasionally, until onion is translucent, 8–10 minutes. Add broth. Bring to a boil, reduce heat, and simmer until squash is soft and liquid is reduced by half, 15–20 minutes. Let cool slightly, then purée in a blender until smooth; season with salt and pepper. Reserve skillet.Step 3Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.Step 4Combine pasta, squash purée, and ¼ cup pasta cooking liquid in reserved skillet and cook over medium heat, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes. Mix in ¼ cup Pecorino; season with salt and pepper.Step 5Serve pasta topped with reserved pancetta and sage, shaved Pecorino, and more pepper.Step 6DO AHEAD: Squash purée can be made 3 days ahead. Let cool; cover and chill.Nutrition Per ServingCalories (kcal) 660 Fat (g) 23 Saturated Fat (g) 7 Cholesterol (mg) 30 Carbohydrates (g) 94 Dietary Fiber (g) 8 Total Sugars (g) 10 Protein (g) 21 Sodium (mg) 780How would you rate Winter Squash Carbonara with Pancetta and Sage?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI don't use sage as that's one herb I really do not like. But I've been making this pasta for years and it's delicious. Irina12/28/2021Wow this tastes so good! After eating it I realized why it's called a carbonara. The squash replaces the eggs essentially. I read some of the other reviews and added the squash mixture slowly just so it coated the pasta. I ended up with about half of the pasta sauce left over but thats okay. Also I forgot to reserve the 1 cup of pasta water so I just used 1/4 of room temp water and that worked just as well. I also added 1/2 of red pepper flakes.GabbyChicago 12/16/2021All I have to say is wow. This was fun and so delicious to make.Madi Brownaustin,tx11/8/2021We call it squashta in our house.  There is no substitute for kabocha. This recipe is the best.Ray5448111/1/2021Excellent straight out of the book! 2nd time we used 6 oz pancetta, even better.BillLa Jolla CA3/14/2021this was indeed really tasty (of course after putting in five cloves of garlic and swapping the onion for four small shallots), but the amount of sauce was INSANE. It’s like I made a full portion of pumpkin soup and i even used 500g of ravioli as opposed to 350g of pasta as indicated here and there was just so much. I would use twice less the amount of pumpkin and everything else needed for the sauce and just go with that. Otherwise really yummy even without the pancetta AnonymousNetherlands 11/21/2020Nice recipe. Added some dried chillies to pep up the flavour. One other thing: why is this described as Carbonara? Nothing remotely like carbonara.Chris HayesLondon11/21/2020I didn't use sage because I didn't have any when I cooked this, I use beef bacon instead of pancetta, but it still taste nice :) basically, the idea of squash sauce is just flawless I think. Cat's BuffetIndonesia4/14/2020Hey, Anonymous from Maryland. You probably forgot the salt, this recipe. Double the amount of Sage is gross. And why make something you're not a fan of???? Ummmm. This recipe rocked! The family loved it. Also, if you didn't know. Recipes are a guide, you didn't know you can alternate? Also, you are supposed to taste as you cook, obviously, you did not.AnonymousMontclair, NJ3/22/2020Am a butternut squash fan... but this pasta sauce was really bland even though I double the amount of fresh sliced sage.  Needs 2x or 3x more pancetta or bacon and more garlic maybe?AnonymousMaryland3/1/2020This is delicious, you really need the pancetta and sage for the texture (taste of course) This is a keeper. My husband is a celiac so I used gluten-free pasta and I actually liked it. salucesKaunakakai, HI1/27/2019YESSS!  I thought this would be a miss for my family but everyone enjoyed it.  The squash really did make it creamy.  Of course I didn't follow the recipe completely.  I used dried sage, frozen butternut squash, and oh yeah, no pancetta.  I sprinkled some bacon in my husband's dish but I enjoyed it meat free!  Delish.  A keeper for sure!Anonymous1/13/2019Explore Bon AppétitPastaKabocha SquashSquashVegetableButternut SquashSageHerbs & SpicesPancettaCured MeatMeatFettuccinePasta & NoodlesLinguineFallWinterMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-01-14", "author": ["Condé Nast", "Alison Roman", "Christina Holmes"]}