{"id": "00d31de12c6f8388f4f4e59992ba0a0b", "url": "https://www.bonappetit.com/story/grilled-chicken-sandwich-not-boring", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "This Grilled Chicken Sandwich Is Definitely Not Boring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Grilled Chicken Sandwich Is Definitely Not BoringWith all the right elements, it's a true masterpiece.By Adam RapoportMay 21, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Judy ManciniFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he’s been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When I moved to New York a gazillion years ago, I spent a lot of time posting up bar-side at Corner Bistro in the West Village. My go-to order was the grilled chicken sandwich. Healthier than a burger, I liked to tell myself, it featured a well-marinated, juicy breast touched with a nice char, and topped with some crisp iceberg and a generous amount of mayo, all on a squishy bun.It’s the kind of sandwich that feels indulgent but doesn’t plunge you into a food coma (hello giant fried-chicken sandwich!). It’s also the kind of thing you can, and will, make on repeat this summer, no deep fryer required.The Bon Appétit version, developed by Molly Baz, brings the grilled chicken sandwich into the 21st century. To start, it swaps breast cutlets for boneless thighs—more flavor, more juiciness, more forgiving on a fiery hot grill.Like any decent grilled chicken sandwich, it relies on a marinade to imbue the meat with oomph—in this case a mixture of Dijon, Worcestershire sauce (god bless, Worcestershire), garlic, and lemon juice. The key move is reserving half of the marinade to blend with mayo and cornichons for the sandwich’s special sauce.Photo by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiAnd while I’ll never be mad at a classic coleslaw, I really dig how Molly introduced a certain...restaurant-y sophistication with the addition of simply dressed shaved fennel.Little Gem lettuce (this century’s iceberg?) offers crunch and protects the bottom bun from soaking up too much juice. And yes, the recipe calls for tomato, but I’m waiting until they’re in season to add a slice.Through an odd twist, my mom now lives directly across the street from Corner Bistro. I haven’t been back in years for its grilled chicken sandwich. Maybe I’ll take her for one this summer.Get the recipe:Grilled Chicken Sandwich with Caesar-ish DressingDeeply charred mustardy chicken thighs are paired with a crunchy and refreshing fennel-basil slaw for the ultimate summer-night chicken sandwich.View RecipeExplore Bon AppétitAdam NewsletterChickenSandwichRead MorecookingThis Is Snack O'clock in the BA Test KitchenBy Adam RapoportcultureThe BA Staff Is Highly OpinionatedBy Adam RapoportcookingMake Spaghetti With Ramps Right NowBy Adam RapoportcultureBon Appétit Used to Just Be a Magazine. Not Anymore.By Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Adam Rapoport"]}