{"id": "00da9bf51e8993514f152f74d79ff3fe", "url": "https://www.bonappetit.com/story/what-is-a-katsu-sando", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Katsu Sandos Are Everywhere, and We’re Here For It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsKatsu Sandos Are Everywhere, and We’re Here For ItThe simple Japanese pork cutlet sandwich that’s stolen our hearts—and dominated restaurant menus.By Elyse InamineAugust 16, 2018FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailIf you want to make a summer blockbuster, you cast The Rock. (Seriously, that guy makes every movie better. Such range!) If you want to open a buzzy restaurant, you put a katsu sando on the menu. That’s just how things work, and we couldn’t be happier.But let’s back up a bit, in case you haven’t spent the past year meticulously scanning menus of new restaurants, line by line, like us. What exactly is a katsu sando? “Katsu” is shorthand for “katsuretsu,” which means “cutlet” in Japanese, and “sando” is just the adorable nickname Japanese people gave the word “sandwich.” Essentially, it is Japan’s answer to the bologna sandwich. Let me explain. The Japanese have a strange fascination with Western food, which is why you’ll find amazing Neapolitan pizzas and hamburgers there. There’s even a word for it, yoshoku—it’s a whole subset of cuisine in Japan! But back to the katsu sando. So legend (a.ka. the Internet) has it that the sandwich first appeared at a restaurant called Rengatei in Tokyo back in 1899 as a sort of homage to schnitzel. Apparently, people really like it because it’s survived this long—and even made its way to the U.S.The katsu sando is a simple thing: two slices of cotton-like shokupan (Japanese milk bread), slathered with zingy tonkatsu sauce (a thick, A1-like sauce), bookending a thick cutlet of meat (typically pork but nowadays a lot of wagyu) that’s been lightly breaded and fried. Sometimes there’s a little raw cabbage salad on the side (or even stuffed into the sandwich itself). There is nothing sweeter than biting into a freshly made katsu sando (well, maybe except for my dad’s speech at my wedding; you had to be there). The all-panko breading makes each square inch of the cutlet super crunchy. The tonkatsu sauce cuts through the richness of the cutlet and lends some depth (and a little moisture so it’s not a sad, dry sandwich). The shokupan protects the roof of your mouth from hot meat and rough breading (baguettes can’t do that!). It all adds up to a dish that looks as harmless and dainty as a tea sandwich but delivers all the intense meaty joy of a French dip. No wonder it’s showing up in restaurants across the country.At Ferris in New York City, a well-marbled cut of Ibérico gets the katsu treatment, while at Momonoki in Atlanta, you can katsu anything for your sando, from steak to chicken. A more classic version, with the usual pork cutlet, weaves its way through more menus, from Alley Cat in Austin to Adana in Seattle to Pagu in Cambridge, MA. Is it a trend? Sure. But what’s more exciting is that this humble sandwich, once just a Japanese convenience store standby, is getting its due.“You have the crispy pork, the soft bread, the sweet tonkatsu sauce, and the bright cabbage, it’s balanced,” says Keisuke Akabori, the chef at Stonemill Matcha in San Francisco.He fries up tender Duroc pork coated in two types of breading, and plans to start making his own milk bread in the future (local fixture Andersen Bakery subs in the meantime). He makes his own tonkatsu sauce—thick, tangy, slightly spicy, and sweet, thanks to prunes (fun fact!). For the Saison vet, it’s not just making a sandwich—it’s all about perfecting it.Read more about the 25 restaurant trends we saw in 2018Now make the crispiest chicken cutlet sando.Explore Bon AppétitHot 10 2018The Hot 10SandwichPorkJapaneseRead MorecookingThe Chicken Katsu Recipe Every Kid (and Adult) Will LoveBy Adam RapoportcookingHomemade Teriyaki Sauce Is a Million Times BetterBy Alex DelanycookingPanko Is the Best Thing to Buy at the Grocery StoreBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Elyse Inamine"]}