{"id": "00de46846fabc4d497eb9a6a3b4dbbc4", "url": "https://www.bonappetit.com/recipe/easiest-chocolate-birthday-cake", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Easiest Chocolate Birthday Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEasiest Chocolate Birthday CakeBy Kat BoytsovaMay 12, 20194.5(291)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintPure homemade birthday love. If you've got a bowl, a cheap hand mixer, and a couple of measuring cups, you can make this rich, chocolatey cake. Got a lot of birthdays on the horizon? You can pre-mix batches of the dry ingredients together, store them in airtight containers for up to three months, and be ready to celebrate at a moments notice with your own DIY cake mix.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRound Cake Pan$12.99 At AmazonWire Rack$23 At BA MarketElectric Mixer$40 At AmazonSmall Offset Spatula$6 At AmazonSieve$18 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketParchment Paper$3 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonSmall Saucepan$155 At AmazonCake Tester$3 At AmazonMedium Pot with Lid$155 At AmazonPlatter$29 At AmazonIngredientsMakes one 9\" cake¾cup vegetable oil, plus more for pan1⅓cups all-purpose flour1¼cups granulated sugar1¾tsp. baking powder¼tsp. baking soda1½tsp. kosher salt, divided½cup unsweetened cocoa powder2large eggs1cup milk1¾tsp. vanilla extract, divided4oz. semisweet chocolate chips or coarsely chopped chocolate bars (do not exceed 64% cacao)½cup heavy cream4oz. cream cheese, room temperature¼cup powdered sugarPreparationStep 1Place a rack in center of oven; preheat to 325°. Using your fingertips, grease bottom and sides of a 9\" round cake pan with vegetable oil. Line bottom of pan with parchment paper, smoothing to eliminate air bubbles. (It may sound fancy, but making a parchment circle is easy! Place pan on a piece of parchment, trace circumference with a pencil, then cut it out.)Step 2Whisk 1⅓ cups all-purpose flour, 1¼ cups granulated sugar, 1¾ tsp. baking powder, ¼ tsp. baking soda, and 1¼ tsp. kosher salt in a large bowl. Sift ½ cup cocoa powder into bowl, then whisk to combine. (You can stop here and package these dry ingredients in an airtight container to create a sort of DIY cake mix if you want!)Step 3Whisk 2 large eggs, ¾ cup vegetable oil, and 1 tsp. vanilla extract in a medium bowl until well combined and creamy, about 30 seconds. Using a spatula, mix egg mixture into dry ingredients until fully incorporated. It will be thick and pasty, that’s okay!Step 4Warm 1 cup milk in a small saucepan over medium heat until it comes to just a bare simmer—make sure it doesn’t come to a boil. Whisk warmed milk into batter until lump-free and just combined; do not overmix.Step 5Immediately transfer batter to prepared pan. Tap pan a few times on work surface to encourage some of the bubbles to escape.Step 6Bake cake, turning pan halfway through, until a cake tester (or toothpick!) inserted into the center of cake comes out clean, 40–50 minutes. Transfer to a wire rack and let cake cool in pan.Step 7Meanwhile, make the frosting: Fill a medium pot with 1\" water and bring to a bare simmer over medium heat. Combine 4 oz. chocolate chips and ½ cup heavy cream in a heatproof medium bowl, place over saucepan, and reduce heat to low (make sure bottom of bowl is not touching water). Stir occasionally with a spatula until chocolate is melted and mixture is homogeneous and thick. Chill ganache until cool to the touch, about 25 minutes (you can mix with a spatula to encourage cooling). Alternately, mix chocolate and cream in a microwave-safe bowl and microwave in 10-second bursts until melted.Step 8Using an electric mixer on medium-high speed, whisk 4 oz. (room temperature!) cream cheese, ¼ cup powdered sugar, and remaining ¾ tsp. vanilla extract and ¼ tsp. kosher salt in a large bowl until very smooth and no lumps remain. Beat in cooled chocolate ganache on medium speed, scraping down sides of bowl as needed, until frosting just holds its peak and is well combined and a little thicker, about 1 minute. You don’t want to overbeat because the frosting can become too stiff.Step 9Run a butter knife around edges of pan. Invert cooled cake onto a plate and peel off parchment. Invert again onto a platter.Step 10Top cake with frosting, spreading evenly across the surface. Make some decorative swooshes with a spoon, if desired. Slice and serve.How would you rate Easiest Chocolate Birthday Cake?Leave a ReviewTell us what you thinkReviews (152)Back to TopTriangleSo delicious! Next time though, I don't think I'll rotate it half way in. I think doing so caused it to sink in the middle a bit. So I'll be leaving out that step next time. AnonymousEarth2/17/2022So easy, so moist, sooooo delicious! I have made this cake several times but have yet to make the icing. If I have left over butter cream, I split the cake in half & just ice the centre, dusting the top with icing sugar. Yum.AnonymousVancouver, BC Canada1/6/2022Amaaaaaazing. Best chocolate cake. Unlike some reviewers I absolutely love the cream cheese and chocolate together. Don't skimp on the salt - it's crucial. I could eat this entire cake in one sitting.\n\nTip: rotating the cake halfway through caused it to collapse in the middle a bit (still delicious). Especially because I have convection, I would skip it next time. KimSanta Fe, NM 1/2/2022awesomeAnonymouspleasant hill, CA12/11/2021Am I reading this wrong? It clearly says one nine inch cake at the top. So I use one 9 inch cake pan and it overflows ten minutes in. Nowhere does it mention it being a double layer cake (which would've been fine). I'm confused, I am a cook and I know how to read a recipe (at least I thought I did). What gives? Steve Lebanon, PA 12/8/2021Easy and delicious! Thank you for this amazing recipe!Michelle DalyParamus, NJ11/25/2021I love this cake and bake it a lot. I just don’t know why sometimes I mess up. I think it could be for over beating the floor. But if not for that it is really easy. I 100% recommend it.\n\nThanks for the recipe 😋Fatemeh 10/24/2021It was very dry, especially around the outside edge.  I compared the ratio of ingredients to some other successful chocolate cake recipes and it seems this recipe has a lower % of fat and eggs.   I am wondering if anyone else has found this to be true and what adjustments have they made.  As it is, I would not make it again.Rick WPalm Springs10/3/2021Love this recipe, I make it all the time. Super easy and I always have the ingredients on hand.StaceyVSpringfield MO9/18/2021Amazing cake. my go to recipe..Bryan.A.N,9/12/2021Excellent and EasyAnonymous8/29/2021Super simple chocolate cake from scratch! Along with the icing, not overly sweet; just right IMHO. Next time, I think I’ll add some orange extract to both the cake and the icing.Anonymous6/7/2021Amazing recipe and so easy! I am coeliac so swapped the regular flour for gluten free flour and worked perfectly! My go-to chocolate cake recipe.MollyLiverpool, UK5/8/2021This cake is so easy and so good! It's also a great base recipe for customization. I thought along the lines of some other users here and added chai-spices: cinnamon, cloves, and cardamom. I also infused the milk with chai tea. Also made the cake with lactaid, as that's what we had on hand, and it came out perfectly moist. I've used oat milk in the past for other cake recipes and the texture was a little too dry. I did not think this cake was too sweet, but I do think a traditional ganache frosting would also be decadent on this.nessaSanta Cruz, CA4/22/2021This is my new go-to chocolate cake recipe - so moist, not too sweet and quick to make. KathyNew Zealand4/11/2021Explore Bon AppétitCakeDessertChocolateOther IngredientsEasyNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-12", "author": ["Condé Nast", "Kat Boytsova"]}