{"id": "00e71881680155a80a4f365d00135f8d", "url": "https://www.bonappetit.com/recipe/romesco-pasta-salad-with-basil-and-parmesan", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Pasta Salad with Romesco Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueRomesco Pasta Salad with Basil and ParmesanBy Claire SaffitzMay 22, 20184.4(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThe reason this pasta salad holds up so well at room temperature is because you dress it twice. It absorbs the first round of dressing completely, the second addition keeps it glossy, and a fistful of walnuts and breadcrumbs means there’s always something to bite into.This recipe is presented to you by Samsung.Ingredients8 servings1cup raw walnuts3oz. country-style bread, crust removed, cut into 1\" pieces (about 1½ cups)4whole roasted red peppers from a jarZest and juice of 1 lemon2garlic cloves1tsp. crushed red pepper flakes, divided½cup plus 2 Tbsp. extra-virgin olive oilKosher salt1lb. fusilli giganti (large spiral-shaped pasta), fusilli, or medium shell pasta1lb. mixed ripe tomatoes, cut into bite-size pieces (about 3 cups)4oz. Parmesan, finely chopped1cup basil leaves, torn if largePreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 10–12 minutes. Let cool.Step 2Meanwhile, process bread in long pulses in a food processor until coarse crumbs form (you should have about 1 cup). Transfer to a small bowl.Step 3Purée roasted red peppers, lemon juice, garlic, ½ tsp. red pepper flakes, and about one-quarter of the cooled walnuts in food processor (no need to clean) until smooth. With the motor running, very gradually stream in ½ cup oil. Process until thick; season romesco dressing generously with salt.Step 4Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and rinse under cold water (this stops cooking and removes surface starch so the pasta will be less gummy). Shake off excess water and transfer to a large bowl. Toss pasta with half of the romesco to coat; set aside. Finely chop remaining walnuts; set aside.Step 5Heat remaining 2 Tbsp. oil in a medium saucepan over medium and cook breadcrumbs, lemon zest, and remaining ½ tsp. red pepper flakes, stirring often, until breadcrumbs are golden, 5–7 minutes. Remove from heat.Step 6Toss reserved pasta with remaining dressing, then fold in tomatoes, Parmesan, and reserved walnuts just to distribute. Sprinkle breadcrumb mixture over pasta and top with basil.How would you rate Romesco Pasta Salad with Basil and Parmesan?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleWe liked it, but although we're garlic lovers, our 2 cloves made it a bit too potent! (Larger than usual, and very fresh.) May try it with roasted garlic for those mellower vibes. Definitely going into our rotation, especially for cookouts. Appreciate some of the other reviewer suggestions, too! SashaPacific Northwest 3/30/2021THE SAUCE!!!!katiarodriguez21Bogotá, Colombia.8/11/2020This is my favourite way to celebrate July tomatoes. So fresh and satisfying! This past time I went a bit rogue on the substitutions. I swapped for chick pea rigatoni and added in some fresh birds eye chilis in the dressing. I also used pistachios as that’s all I had in my nuts collection at the moment and the sweetness worked well with the dish. Out of park and pecorino, I grated a Vermont white cheddar into it and added a touch of nutYeast. So far from Saffitz’ original recipe at that point I tossed in some sardines and called it lunch. I love reading what people swap - hope someone finds joy in this. WemmaVirginia7/30/2020I can't stop eating this. Fresh and delicious. I loved how simple it is. I tried with hazelnut at home and worked really good too. brunacazzBrazil, live in Canada9/3/2019This was amazing.  My new Pasta Salad recipe that I'll bring to every summer cook-out and will also make every couple weeks at home.\n\nWe grill at a quiet and beautiful State Park  on Thursdays for dinner, in season...I kept everything after the initial saucing of the pasta separate and assembled the rest on site, served with some marinated and grilled chicken and it was ridiculously good.\n\nMake this recipedaubie77Boston, MA6/6/2019This is soooo good. It's refreshing, a bit spicy, a little crunchy, and my new go-to pasta salad. Thank you Claire!AnonymousErie, PA5/5/2019caitlyn from Mallorca via NY is rather picky, don't you think?  the sauce I'M imagining is half Romesco (jarred roasted red bell pepper puree garlic nuts bread crumbs) and half Tzatziki (grated cucumber garlic celery preserved lemon rind, all mixed into Fage Greek yogurt).  sourdough bread crumbs -- lots of them, and not too crumbey (coarse and pebbly, not sandy) -- get grated garlic and minced fresh cilantro-dill-mint -parsley mix instead of parsley alone.  the fresh-chopped tomatoes would go better (and even LOOK better) in the Tzatziki version, IMO.  for the Romesco version, i'd choose something more contrasting colorwise; e.g., large cubes of diced hard-boiled jalapeno-pickled eggs.hollis5Vero Beach, FL3/7/2019Made this last night and everyone loved it. Word of warning: if the sauce gets on your clothes or linen napkins, it stains and you cannot get it out. Ruined a shirt and apron. We can’t get it to come out. Must be the peppers. But I will make this over and over, just wear old clothes when I make it. drkoobRedmond, WA7/1/2018there is no paprika, tomatoes or hazelnuts in this sauce, and i've never heard of adding lemon juice or roasted peppers from a jar ... kind of a stretch to call it romescocaitlin_back2spainmallorca via NY6/17/2018Explore Bon AppétitSaladPastaSpanishEuropeanBell PepperVegetableWalnutNutTomatoSummerEasyWeeknight MealsMainSideVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}