{"id": "00ed2ed2bd8120f31f374ecc32060727", "url": "https://www.bonappetit.com/recipe/jalapeno-marinated-grilled-pork-chops", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Marinated Grilled Pork Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueJalapeño-Marinated Grilled Pork ChopsBy Claire SaffitzMay 21, 20194.9(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis year, we're flipping the script and marinating after grilling. Inspired by the technique called escabèche, where cooked fish and meat are preserved in an acidic mixture, we're cooking first, marinating second—in this case, in a coriander-spiked vinaigrette. Don't be intimidated by the slices of jalapeños: The fire of the grill mellows their heat. If you're a real spice-seeker, you can even leave some of them raw.Ingredients4 servings½cup plus 3 Tbsp. extra-virgin olive oil, divided, plus more for grill4bone-in pork rib chops (about 10 oz. each)Kosher salt, freshly ground pepper2tsp. coriander seeds¼cup apple cider vinegar1tsp. sugar2large jalapeños¼medium white onion, very thinly slicedPreparationStep 1Prepare a grill for medium-high heat; lightly oil grate. Pat pork chops dry and season generously all over with salt and pepper. Place on a rimmed baking sheet and let sit at room temperature at least 30 minutes and up to 1 hour.Step 2Meanwhile, toast coriander seeds in a dry small skillet over medium heat, tossing often, until golden brown and fragrant, about 2 minutes. Transfer seeds to a cutting board and let cool. Using a flat-bottomed mug or a heavy skillet, lightly crush. Place in a small bowl and add vinegar, sugar, and ½ cup oil. Season with salt and pepper and whisk until sugar and salt are dissolved. Set marinade aside.Step 3Toss jalapeños and 1 Tbsp. oil in a small bowl to coat; season with salt and pepper. Pat pork chops dry again (the salt will have drawn out more moisture) and rub with remaining 2 Tbsp. oil. Grill jalapeños, turning often, until softened and blackened in spots, about 5 minutes. Transfer to a cutting board. Grill pork chops, turning every 2 minutes or so, until cooked through but still medium-rare closest to the bone (an instant-read thermometer inserted near the bone should register 145°), 8–12 minutes. Transfer to cutting board and let rest 10–15 minutes.Step 4Cut pork along the bone to remove meat in one piece; slice ½\" thick and transfer to a rimmed platter. Slice jalapeños crosswise into rounds and scatter over pork. Pour reserved marinade over and let sit at least 15 minutes and up to 1 hour before serving. To serve, scatter onion over.How would you rate Jalapeño-Marinated Grilled Pork Chops?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis was a hit, my parents both had 2nd helpings!  I followed reviewer's menu of couscous and simple salad with lime vinaigrette and it was just great.  JRSan Diego12/15/2021Someone wrote that this was one of the best things he/she made at home, and I 100% agree! This one’s a keeper. For three chops, I kept all other ingredients the same, with the exception of using a tablespoon of coriander seeds and another jalapeno.Julia4/10/2021one of the best things i've ever made at home! Anonymousnew york, ny7/5/2020really great recipe! seared and roasted the pork as we don't have a grill & it still came out fine. served with cous cous and served w a simple salad dressed in dijon and lime. absolutely delightful & would even work if made a day ahead of time. I'd definitely suggest upping the coriander seeds as the flavour is quite delicatesaccharine serfWhittlesey9/11/2019The article that this recipe came from was my favorite for A Summer 2019.  It changed my way of marinating.  It made me a believer in marinating after cooking vs. prior to cooking.  This prom recipe not only tastes great but is nice and moist.AnonymousNew Jersey8/18/2019I would try a different marinade - the coriander was too mild (might have been old)... maybe oregano; seemed like a lot of oil when serving/ eating.\n\nJalapeños were good (I removed seeds after grilling)...  used thin sliced red onion - lots is good!\n\nChops were good but get boneless pork next time...  good method - might work well for beef steak with a red wine marinade.zipsterCanada7/17/2019Really really delicious. A little fiery with the jalapeño seeds, but not in a bad way.  Added a little more acv, and couldn’t find coriander seeds so I just used ground and it was still amazing. Will def make again! hinagartenNYC 7/5/2019This was a very good, simple pork dish with lots of flavor.  We served with the marinated squash/zucchini with feta (from the same June/July issue) and the veggies out shined the pork, however.  I would possibly cut back on the amount of oil next time, as the pork didn't really soak it up and it there was a lot left on the platter.  No leftovers with this meal - it all got eaten in one sitting!AnonymousTexas7/1/2019Loved it!AnonymousSan Diego 6/25/2019Really great dish. Wife LOVED it. Will definitely make it againajsheppard47Austin, TX5/30/2019Explore Bon AppétitPork ChopPorkMeatJalapeñoChileVegetableSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}