{"id": "00f0042659958bd59bb660a85d232ae2", "url": "https://www.bonappetit.com/story/rise-of-bad-rose", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Bribes, Backdoor Deals, and Pay to Play: How Bad Rosé Took Over | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBribes, Backdoor Deals, and Pay to Play: How Bad Rosé Took OverA sommelier opens up about the shady business practices that are behind the rise of watery, terrible rosé.By Victoria JamesAugust 13, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailHere’s a snippet of an email I got last week:FROM: Wine account salespersonTO: Victoria James, Cote Korean SteakhouseSubject: Opportunity?...I wanted to see if you were around next week to try some wines and see if there is any opportunity for our brands in Cote. It would be my pleasure to put together a proposal for you that includes funding for the location…Do you see what’s happening here? If not, it’s okay. The world of wines in restaurants is not a very public one. This dude is slyly offering me the possibility to get paid to place his company’s wines on our restaurant wine list. It should be the other way around: I pay the winery for cases of wines I can’t wait to share with diners. But when it comes to rosé, sneaky deals like this have become par for the course as the wine becomes more and more popular. We call it pay to play, and it’s caused an outbreak of shitty rosé on wine lists everywhere. Specifically on by-the-glass lists, which sell the highest quantity and where diners are more likely to order based on name-brand recognition.As a sommelier, I know I am spoiled, but when I see big-brand pink swill on otherwise nice restaurant menus, I get furious. You might know which brands I am talking about, the ones that sponsor huge parties in the Hamptons. They masquerade as luxury goods, with fun bottle shapes and cutesy names, but are simply bulk wines.Chelsie CraigBut Wait, What Is Bulk Wine?When I say “bulk,” I mean rosé that might be made from rotten or low-quality grapes, underripe fruit, or red wine by-products. It relies on mass-produced laboratory yeast that's advertised as “full bodied, fruit/lush blush wines, to enhance white country fruit and flower in wines.” (Yeast not only converts sugar to alcohol but also contributes to the final flavors. These commercial yeast strains attempt to mask subpar grapes by adding unnatural aromas to the wine and speeding along fermentation.) Bulk wine is often treated like a lab formula, with chemicals, dyes, and additives that chase that desired light salmon color. Since an ingredient list isn’t required on wine labels, the average shopper might not realize that their go-to grocery store wine has up to 75 ingredients other than grapes. These wines come from huge swaths of land, particularly in California and Provence, with “terroir” barely suitable for even vegetables. Bulk wines—and there are hundreds of them—are owned by large companies with deep pockets, with big marketing budgets. Money is channeled away from the high-quality grape production and toward massive advertising campaigns coupled with paid inclusion on hot restaurant menus.Chelsie CraigThe Shady DealingsWell, first you have to know how wine ends up on restaurant wine lists. As a beverage director, I purchase wholesale from importers and distributors, companies with a portfolio of wine. I only buy wines that I believe in and that go well with our food. But not all sommeliers think this way. Some wineries or distributors use “marketing” dollars to help sway these buying decisions.Somewhere along the way a rosé company might realize your restaurant is popular or has some buzz, particularly around the wine program. They might stop by, drop off a business card, send an email, and hint that they’d make it worth your while to add their wine to the list. A lot of these deals span the gray area of ethics, from direct cash incentives to trips, dinners, sporting game tickets, complimentary product, etc. Anything to get an edge. There are only so many slots on a wine list and oh-so-many wines out in the world. Someone straight-up offered me $5,000 to feature their watery, tasteless rosé for the summer season. This means being an ambassador for the product, a role that I view as at odds with my responsibility as a sommelier.My introduction to pay to play occurred after I’d just published a book on rosé. I was approached by one of the top three rosé brands. They were looking to partner with me and Piora, the since-closed Michelin-starred restaurant where I was the wine director. A few emails were sent before the in-person shakedown. At the tiny restaurant, I was bombarded with drop-ins from these reps trying to strong-arm me into representing their brand. The deal was that they would give me a couple thousand in cash to be an ambassador, and I would have to buy their rosé to pour by the glass for the summer. If I needed to make better margins, like making $10 off a glass of rosé versus making $5 off a glass of rosé, they also offered to drive by and drop off a couple of cases of free product. Horrified, I turned down the deal.Sommeliers around New York have told me they’ve been offered incentives from big brands too. Wineries will come into the restaurant and swipe their credit cards, theoretically expensing a meal. In reality, the swipe is a bonus, with no meal actually taking place. Other sommeliers mentioned that brands will drop off a free case of wine or offer to supplement the somm’s income with funds from their bosses. Someone even called it “mafia-style shit.” When these wines make those 2-3 coveted rosé spots on the by-the-glass lists, their brand recognition skyrockets. If the restaurant is of further renown (Michelin-starred, buzzworthy, well-known chef or sommelier, etc.) they’re able to align their brand with the fame of the place, further bolstering their company’s image.A direct bribe or cash handshake is usually looked down on in the industry—and there’s a gray area between what’s legal and what most certainly isn’t—but that doesn’t mean it doesn’t happen. There’s a more subtle strategy too: Wine companies will offer to print wine lists for restaurants, which can otherwise be tedious and costly (paper costs, time spent editing and formatting). In exchange, their wine brands must be on menu, some demanding to own a certain percentage of the list. For restaurants and Hamptons hot spots seeking to bring in a crowd, bulk rosé companies will have their own DJ on payroll who they can drop into an establishment, along with logo-branded ice buckets and tote bags and sometimes even several cases of free product. Guests at these parties don’t care. When the rosé is served ice-cold, it’s hard to even tell that it isn’t that good.Small rosé producers I’m into right now.\nChelsie CraigHow to Find the Good StuffI’m over the shitty rosé, and hope you are too. But what makes a rosé good? My real rosé manifesto insists that real rosé is made for the sake of making rosé. Real rosé starts with grapes from vineyards destined for pink wine. The grapes are picked at ripeness, sorted, and sent to the winery, where they are treated with as much care as any other grapes. The native yeasts or select local strains turn the sugar in the grapes into a wine that speaks of a place. Real rosé speaks of a farm-based craft from centuries of tradition and is purpose-driven.As a sommelier and buyer, I have always leaned toward grower wines (you may have heard of grower Champagne before). Ask your sommelier or retailer for grower rosé that speaks of a sense of place and tradition, an honest wine. Find importers you can trust, such as Kermit Lynch (full disclosure: my fiancé works for Kermit Lynch), Louis/Dressner Selections, Neal Rosenthal, Grand Cru Selections, and Michael Skurnik—to name a few. A common misconception is that grower wines are not on more menus because they’re so expensive. Not so! In many cases, a good grower rosé can be found for under $20 retail.To fight back, I started a campaign called #sommsforrealrosé (and yeah, #nowayshittyrosé too) to gather like-minded sommeliers dedicated to high-quality pink wine, those who refuse to succumb to padded deals and expensive schwag. As a sommelier, selling out to big brands means giving up on your guests. Remaining honest about quality—and building relationships with reputable winemakers and collectors—is what makes my job so rewarding.If you’re a rosé lover, support small growers who create quality product that is a testament to their land. Seek out grower wine at shops and in restaurants. Ask why certain wines are poured by the glass. If you notice that the same wine is being featured everywhere, there is probably a reason for this. Let’s all stop drinking mediocre rosé. We deserve better.Chelsie CraigVictoria James is the author of Drink Pink: A Celebration of Rosé, and the beverage director and partner at Cote Korean Steakhouse in New York. Follow her on Instagram here.This piece has been updated to include the disclosure that James’s fiancé works for Kermit Lynch importers.Explore Bon AppétitWineRoseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-13", "author": ["Condé Nast", "Victoria James"]}