{"id": "00f5d4867369a8113ce26de890beb95c", "url": "https://www.bonappetit.com/story/hawaii-zippys-spam", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "In Hawaii, Nothing Says You’re Home Like Zippy's, Mac Salad, and Spam | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIn Hawaii, Nothing Says You’re Home Like Mac SaladAn ode to Zippy’s, the island’s beloved restaurant chainBy Elyse InamineJune 6, 2018FacebookTwitterEmailCourtesy of Zippy'sFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I wish I could tell you that my go-to Honolulu restaurant is Ono Seafood for the poke over hot rice; or Helena’s for the kalua pork straight from an imu (underground oven); or perhaps even Palace Saimin for the namesake noodle soup hybrid of wonton mein, pancit, and ramen.But after a ten-hour flight from New York City to Honolulu, the first stop I make is the Zippy’s two miles from my grandma’s house in Kuli’ou’ou Valley in the the Koko Marina mall. For 52 years, Hawaii’s iconic diner-esque chain has been supplying locals with over 100 tons of meaty chili a month across its 24 locations scattered throughout the islands and soon Vegas.Yes, it's in a mall.\nCOURTESY OF ZIPPY'SSure, there’s no poi on the menu. There’s no poke. But there is Spam. There’s mac salad, the mayo-meets-elbow-macaroni side dish that’s become a staple on any menu in Hawaii. There’s a patty melt and a Kraft Singles–topped thin-patty cheeseburger. There’s saimin. Then, of course, there’s the chili, which is a totally normal thing to pile on spaghetti (or a bowl of rice) in Hawaii. This is what has shaken out in the short but storied history of the state. Without launching into a full-on history lesson, many forces have shaped Hawaii’s cuisine and this literal fusion of dishes remains. (We can thank the U.S. military presence for the Spam.) And the locals really like it.My sister adds chubby little wontons to the saimin. My mom pours at least three small bowls of nose-clearing, locally produced Tropics Chinese hot mustard into hers. My brother loves the fried chicken, and my dad orders the Zip Pac (c, not k, he corrected me over a family text). In it, there’s Spam, fried and crackled around the edges from cooking in its own fat; craggy fried chicken; beef teriyaki; breaded and fried hoki (blue hake); and white rice speckled with furikake. It’s the thing he ate as a teenager growing up in Hawaii, and it instantly transforms him from lawyer dad to local boy in a matter of hours anytime he flies in from LAX. A little bit of pidgin slips into his speech. The Hawaiian shirt comes out. We kids always made fun of him for this—betting on how quickly we’d start hearing “ya” tacked on to the end of his sentences—but now I get it.The saimin, my sister's favorite.\nCourtesy of Zippy'sStepping into Zippy’s is like being home, if home had sea-foam-green leather booths. You’ll find summer soccer camps breaking for the evening, older couples making their routine dinner stop, and families just like our own. There was nothing like Zippy’s in Valencia, California, the small suburb north of Los Angeles where I grew up and where my parents still live. So we had to cobble together our own sort of Hawaii, an homage of sorts to my dad’s childhood. During each visit, my parents stocked up on frozen Portuguese sausage at the Costco close to my grandma’s house and smuggled it back in suitcases. They found the only shave ice place in Valencia, and we basically kept it in business for a few years. At our favorite all-you-can-eat sushi restaurant in Valencia, Light & Healthy, my dad settled for a very abbreviated Zip Pac with beef teriyaki, mac salad, and rice.My dad's beloved Zip Pac.\nCourtesy of Zippy'sWe still trek to Hawaii nearly every year despite living all over the country. And Zippy’s welcomes us back each time with with its mash-up of diner staples, a menu of immigrant dishes that bumped up against each other and birthed a cuisine wholly unique to Hawaii. There’s something comforting that 22 of the 24 Zippy’s live on Oahu alone. We can be anywhere on the island—making the rounds to extended family, hanging out at Kailua Beach—and know that Spam, fried chicken, and chili-slicked spaghetti is always within reach.Elyse Inamine is the digital restaurant editor of Bon Appétit.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRead Morecity-guidesWhere to Find the Best Poke in OahuBy Ashley MasoncultureHow a Surf Goddess Eats to WinBy Alejandra BorundarestaurantsAndrew McCarthy Seeks Banana Bread in Maui, HawaiiBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Elyse Inamine"]}