{"id": "00fda3bb45cb64ccc71dfcebce6f7ef0", "url": "https://www.bonappetit.com/story/how-to-buy-olive-oil-beginners-guide", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "How to Buy Olive Oil: A Beginner's Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy Olive Oil: A Beginner's GuideIt's a confusing world out there. Here's how to buy olive oil that you can feel great about, without breaking the bank.By Claire SaffitzJanuary 26, 2018FacebookTwitterEmailFacebookTwitterEmailI used to buy olive oil the way I bought wine—I’d just choose a bottle from the lower-middle price range that had a cool label. (Sort of how I still choose wine, tbh...) I generally looked for words that sounded good to me like “first cold press” and “extra virgin,” but didn’t know exactly know what I was buying. Then I worked on big, deep-dive story about olive oil for Bon Appétit and realized that picking a decent bottle—even just one that wasn’t rancid or poorly processed—is actually pretty tricky. The good news is that getting quality product really just comes down to being able to read a label and decipher some lingo. Now that I know how to buy olive oil, I've vowed to never carelessly sling a random bottle into my grocery cart ever again—and neither should you. Here's what you need to know.Extra-Virgin or Bust“Extra-virgin” is the highest designation of quality given to olive oil, meaning it’s unrefined, free of chemicals and other “defects” like rancidity, and never treated with heat. Quality can still vary within the extra-virgin category, but without intimate preexisting knowledge of individual olive oil brands, it’s as close as you're going to get to an overall guarantee of purity you can get off a label. Look for those two words, and you've already eliminated a vast array of crappy bottles.Stay Away From the \"Light\"Oil is, by definition, 100% fat—there is no such thing as a \"low fat\" olive oil. “Light olive oil” is a misnomer and a marketing ploy that actually means the oil has been refined and treated with heat to strip away odor and flavor. If you're looking for an oil that doesn't taste or smell like anything, you're better off buying a cheap neutral oil like peanut or grapeseed.Don't even think about making this ultra-moist olive oil cake with crappy olive oil.\nPhoto by Alex LauRead the Fine Print:Be skeptical of suspiciously inexpensive oils labeled “Product of Italy.” It’s likely that the olives themselves weren’t grown or pressed there. Companies are required to label an oil’s source, but that could just mean where it gets put into bottles—a loophole that allows disingenuous producers to buy lousy, defective oil from all around the world and pretend it is from Italy. Look carefully on the back label for the initials of the true country of origin: IT for Italy, GR for Greece, etc. As a rule of thumb, you're better off buying olive oil that comes from a single place—ideally one farm or collective, but at the very least one country.Color Is Key (But Not Where You Think)It’s a myth that the darker and greener an oil, the higher the quality. That said, you shouldn’t even be able to tell the color of an oil from the bottle: The bottle itself should be opaque, made of either dark glass or metal. Contrary to what most people think, olive oil actually goes bad fairly quickly, and exposure to light and heat will make the quality deteriorate even more quickly. A company that cares about the quality of its product isn't going to put olive oil in a clear glass bottle, ever.Now that you know how to buy olive oil that doesn't suck, go marinate some olives already:Marinated Olives and FetaAn appetizer you can have it ready within 10 minutes of walking in the door.View RecipeExplore Bon AppétitOlive OilBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Claire Saffitz"]}