{"id": "00ffae78c7d793953fabaaada974e8a5", "url": "https://www.bonappetit.com/story/indigenous-food-canada", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Serving Up Resilience: Indigenous Chefs Preserve Native Foodways—and Create New Ones | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsServing Up Resilience: Indigenous Chefs Preserve Native Foodways—and Create New OnesChefs from across Turtle Island are reclaiming their roots and sharing their take on traditional foods.By Rebecca ThomasNovember 7, 2019FacebookTwitterEmailPhoto by Suech and BeckFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.When I was in my mid-20s, I had the opportunity to go on a medicine walk around my home territory of Kjipuktuk, Mi’kma’ki. Readers might better recognize it as Halifax, Nova Scotia. My territory is mostly shallow soil on bedrock. We have many bogs, swamps, and wetlands. We were walking through a wetland near the coast when our guide pointed to a scruffy, waist-high bush with leaves that look similar to bay leaves.Our guide said that this plant was known as “spice bush,” explaining that food was eaten to survive, and spice bush was one of the few things that could be used to flavor a dish outside of smoke, salt, and whatever was seasonally available. But as the colonization of North America steamrolled through, traditional practices and foods became more scarce, and Indigenous people had to become more creative.When I was a kid, my father used to make me pan-fried bread called four cents. He’d laugh and tell me it was named that because that was as much as anyone was willing to pay for it. I remember he used to put raisins and berries in it and smother it in margarine and jam. Without meaning to, he was passing on a tradition of survival and adaptation. Mi’kmaq in the 19th and 20th century were given flour by the Nova Scotia Indian Agents in charge of “managing us,” but we’d sneak in foods that were hunted and gathered in secret. This would have been my first experience with fusion food: colonial rations flavored with Indigenous resistance.Connections with culture, language, and food practices didn’t passively fade away as European settlers made their way to Turtle Island, the name many Algonquian- and Iroquoian-speaking peoples mainly in the northeastern part of North America use to refer to North American continent. Rather, our way of life was forcibly removed from us and criminalized. Significant ceremonies like potlatch and it’s accompanying feast were banned. Residential schools punished children for speaking their languages, and access to traditional ways of hunting and gathering were all but eliminated in many areas with the implementation of the reserve system. As we look at the history of Indigenous food in Canada, we’ve seen everything from the active destruction of traditional food practices such as the massive kill off of bison and buffalo, to the clever adaptation of communities that made “new traditional foods” from government-issued food allowances, like my father’s four cents. This penchant for survival and flair lives on in Indigenous cooking today through fusion foods, pow wow staples, and a return to simplicity.Diners soak up the sun sitting outside of Powwow Café.\nPhoto by Suech + BeckIn high school, Shawn Adler signed up for a high school cooking course. He explains with a chuckle that he thought “girls would be into a guy that could cook.” He was surprised at how much he liked it. He took a co-op course that had him prepping everything from burgers and fries to banquet hall meals. Then he went to culinary school and then to university to learn about his history; both of which play out in his latest restaurant, Powwow Café, located in the trendy neighborhood of Kensington in Toronto.The menu boasts what Adler calls Contemporary Indigenous Cuisine. A kaleidoscope of bright and fresh colors cover his plates. Standouts include pow wow-style corn soup with smoked duck, poached eggs on fry bread piled with smoked salmon, and, of course, chili-topped fry bread, a pow wow staple also known as an Indian taco. You can wash it all down with sodas infused with cedar, strawberry sumac, wild ginger, and elderberry, all of which grow locally and some of which come from Alder’s backyard.Adler talks about “old traditional foods” and “new traditional foods.” Precontact ingredients including lake fish, cranberries, and wild rice, among others, are often included as features on the menu. Many traditional foods are very common but “the [non-Indigenous] public doesn’t get that. Turkey, cranberries, corn, potatoes, almost everything in a Thanksgiving meal are from the Americas,” Adler explains. He is trying to foster a sense of  understanding. What is often considered a Eurocentric, settler American/Canadian tradition actually rooted in and taken from traditional Indigenous knowledge.New ingredients include flour and sugar; both of which are used in the making of fry bread. “We had to use what was given to us,” Adler says, referring to the dish. “It’s important to understand the history of food but embrace the future.” Indian tacos may be a favorite on the Powwow Trail, an annual series of gatherings that take place all across North America, but finding one outside of that was difficult. “For the longest time, there wasn’t a place you could get an Indian Taco outside of a Pow Wow, a few restaurants on reserve or a reserve gas station. That was it.” Pow Wow Café now offers them all year round.Gary Henry runs Songhees Food Truck, much of his learning coming from watching his grandmother cook.\nPhoto by Kelsey VansickleOn the other side of the country is Songhees Food Truck in Victoria, British Columbia. The food truck is run by Gary Henry, a member of the Pauquachin band. Henry grew up watching his grandmother cook traditional food like octopus in a single pot on a wood stove, and much of his early knowledge came from cooking with elders. He’d watch and learn from their teachings. Since Indigenous communities didn’t have schools in the way we understand them now, this intergenerational teaching was and still is an important part of passing down traditions.While he has homegrown knowledge, Henry has also traveled the world, learning about other Indigenous peoples’ traditional foods. He takes ingredients harvested from the rooftop garden of the Songhees Event Centre and blends his traditions with those of other cultures to create flavors like the stinging nettle sour cream that tops his West Coast Shrimp Taco. Another community favorite is the 656 Burger: wild sockeye salmon piled with house-grown greens on top of fresh bannock combines old-school traditional harvesting with new-school traditional fry bread.The truck has a giant octopus painted on its side, perhaps an homage to Henry’s cephalopod cooking grandmother, and can be found spending most of its time in Victoria.Chef Norma believes in the link between cooking and helping her community come together.\nPhoto by Dominique LaFondNorma Condo is a Mi’kmaw chef who has a small café located in Montreal in the same place she runs her catering services. Chef Norma talks about the link between cooking and helping her community come together. “I learned from my grandma, and now I’m teaching my kids. I pass down the traditions to them and explain why it’s important.” Dishes like the Three Sisters Casserole not only utilize culturally significant plants, but they also carry forward traditions and sacred teachings. The Three Sisters consists of squash, corn, and climbing beans, a staple of many Indigenous groups for thousands of years. The corn provides a stalk for the beans to climb while the broad leaves and vines of the squash shade out any weeds and maintain soil moisture.Condo was inspired by traditional foods as a way to help her community members’ health. She talks about high rates of diseases like diabetes in Indigenous communities and hopes her food can help restore people back to diets similar to ones Indigenous people ate before contact with Europeans. She explains that she uses what could have been found in the environment to flavor her dishes, such as sage and ground roots that grow native to the area. Dishes like her large portions of hearty Chippewa chicken, which is served on a bed of wild rice loaded with cranberries alongside a salad of wild berries and locally sourced greens; and golden and crispy salmon cakes topped with maple-infused Gaspé Peninsula seaweed relish, keep her customers, Indigenous and non-native, “coming back and coming back and coming back.”Condo, a self-taught cook, explains that Indigenous chefs from other regions have shared their recipes with her; she tries to represent other Nations food at her café. “I’ve had so many chefs stand by me while I learned.” If you aren’t able to make it to her café to try her food, you may be able to get a meal on regional airline Air Creebec where Miqmak Catering Indigenous Kitchen prepares the in-flight meals.Butternut squash bannock pizza at Feast Cafe Bistro.\nCourtesy of Feast Cafe“Is there love in it?” Christa Bruneau-Guenther, a member of Peguis First Nation, asks as one of her staff members passes her with a plate of food. She explains that a person can cook the same meal twice but if you don’t put love in it, it doesn’t taste as good. Bruneau-Guenther operates Feast Cafe Bistro in Winnipeg, Manitoba. She gained much of her knowledge from an elder who held seminars on traditional foods. “That’s when the lightbulb went off...reconnecting to our own cultural food was healing and gave us a sense of cultural pride that many of us hadn’t experienced before.”Bruneau-Guenther’s philosophy for her restaurant is summed up by how many traditional foods she can put on her menu while still making modern dishes. Such plates include pickerel sliders, butternut squash bannock pizza, and if you come in on a Friday or Saturday, bison BBQ ribs. “I want people to be able to access their food and try things like bison for the first time without paying too much.”If she can source her ingredients from local Indigenous communities, she does. Her wild rice comes from a local First Nation and the cranberries that go into the feast salad are gathered in neighboring Saskatchewan. But food is not the only thing that is local. Bruneau-Guenther makes a point of employing Indigenous people in her restaurant. From the cooks in her kitchen to her waitstaff, the vast majority of her personnel are community members. “Some folks come in and don’t know how to peel an onion, and pretty soon they are connecting back to their traditional foods and cooking in the kitchen.”Last winter I went eeling using Mi’kmaw eel spears with an Halifax-based organization called Reclaiming Our Roots that helps connect Indigenous youth back to traditional methods of hunting and gathering. We drove out to an estuary, unloaded our gear, and headed out onto the ice on a frigid winter’s day. The ice was dotted with dozens of old cut holes that had frozen over from previous trips out. We spent the next five hours plunging our 15 foot spears into the muddy bottom hoping to tangle an eel up in the prongs of spears.After an hour or so into this work, I felt the pole vibrate and pulled out the spear to see an eel wriggling on the end of it. The overwhelming pride I felt is difficult to describe. It was not just because I had caught dinner for myself and family but rather because I was doing something that connected me to my ancestors. Ancestors that had done this exact same thing in this exact same spot for thousands of years.My father attended one of the aforementioned residential schools when he was a boy. When he was there, he lost his language, the nuns cut off all his hair, and his connection to his culture and community was all but severed. My dad was never able to pass down the Mi’kmaq language to me, but through my own work I’ve slowly been learning, and reteaching him what I now know. This past winter he stayed with me for a couple of weeks. As I served him the dinner I had made, I turned to him and said, “Mijisi, Dad. Eat.”Want more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Rebecca Thomas"]}