{"id": "01044288e3dee513253d1995eb6ad33e", "url": "https://www.bonappetit.com/story/ground-up-nut-butter", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Ground Up Nut Butter is Spreading Good in Portland   | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Nut Butter Company Helping Formerly Homeless and Trafficked Women Build New CareersGround Up makes coconut-cardamom almond-cashew butter—and offers job training to disadvantaged women in the process.By Hannah WallaceMay 14, 2018FacebookTwitterEmailFacebookTwitterEmailWhen she was in her twenties, Staci White left her hometown of Tacoma, Washington to attend college in Portland, Oregon. But finding an affordable place to live while also putting herself through college proved challenging. White, now 31, graduated from Portland State University with a B.S. in community development in 2017, the first in her family to graduate from college. But it wasn’t until she attended a program at Dress for Success that she was able to find employment that aligned with her major.Through a job retention manager at Dress for Success, White heard about a Portland-based nut butter company called Ground Up. Founded by Julie Sullivan and Carolyn Cesario two years ago, Ground Up hires disadvantaged women—usually either formerly homeless or trafficked—and helps them gain job skills, confidence, and, ultimately, a steady, rewarding job.While not the target population that Ground Up works with (White had never been homeless or trafficked) she was seeking an opportunity to build a career. “She is someone who feels very passionately about our mission of empowerment,” Cesario says. Today, White does demonstrations at Whole Foods and local grocery store chain New Seasons, where she shares the story about the nut butter and what it’s doing for her and other women. “Then I start sharing my little story and I’m like, ‘You’re supporting me by giving me a living wage!’ That really grabs their attention,” says White.Sullivan and Cesario met while working for ethical fashion brands based in Uganda, helping impoverished women gain skills, savings, and eventually the money and know-how to start their own micro-enterprises. Sullivan had just moved back to Portland, where the homelessness crisis had worsened, and wanted to help women master job skills so they could transition off the streets. “I saw the training program work in Uganda, I thought, ‘It should be possible here, too!’” she says.While casting about for a business idea, she met Cesario, who was tinkering around with gourmet nut butters that got rave reviews from family and friends. “So, one day, Julie asked me how to make them and she came over and we made nut butters for hours,” recalls Cesario. The two were up until midnight making coconut-cardamom almond-cashew butter with chia seeds, and a snickerdoodle almond-cashew butter.The duo launched Ground Up PDX in June 2016, making their first couple batches with a Cusinart. Over the past two years, they’ve gone from selling their nut butters at a few farmers’ markets to having them line the shelves at most Portland-area grocery stores, including Whole Foods. (Later this month, they’ll be at all Whole Foods in Washington state, too.) Their nut butters, which they make at a local food hub and business incubator called the Redd, are also available at the cafeterias of Adidas, Columbia, and Daimler.Cesario and Sullivan also partner with case managers and coaches at nonprofits such as Outside In, The Cupcake Girls, Door to Grace, and Dress for Success. Claire Anderson, a career development coach at Outside In, has referred five women to Ground Up. “Some of our women have had some great experience in the past, but due to some life circumstance, had back-tracked, or have a gap in their resume,” Sullivan says. Three of the five young women from Outside In who have gone through Ground Up’s training program are now housed and paying their own rent.One of the women at Ground Up explained the joy of working alongside like-minded women in a holiday blog post. “Everything we worked at this holiday season has never been accomplished by Ground Up PDX before! We’re pioneering a process. The chaos of Christmas was promptly conquered by the resourcefulness of a small, sassy, SMART group of women,” she wrote. “The best part is, we killed it while helping support and teach one another.”So far, nine women have gone through the job training program, which is anywhere from six to nine months long, and pays a living hourly wage for between 5 and 20 hours of work per week. The women who work at Ground Up learn everything from roasting coconut flakes and running the nut butter “filling machine,” to lidding, labeling, and orchestrating tastings at farmers’ markets and grocery stores. Though the program is intended to be a stepping-stone to another job, two of the women have become so invaluable that they’ve stuck around as a sales and production assistant and a demo specialist.For White, who recently got a part-time job working in admissions for an alternative high school, one of the best parts of the Ground Up job is the autonomy she has. “Carolyn and Julie trust me, and that’s great,” she says. “I have so much respect for them, giving me all that responsibility.”Explore Bon AppétitHealthyishNut ButterPortlandPortland OregonTrendsRead MoreLifestyleWhich of These 9 Nut Butters Are Both Healthy and Delicious?By Tehrene FirmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-14", "author": ["Condé Nast", "Hannah Wallace"]}