{"id": "010625001773f5f4ede45e36cb03433e", "url": "https://www.bonappetit.com/recipe/slow-roast-spiced-lamb-shoulder-with-sumac-onions", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Roast Spiced Lamb Shoulder Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Roast Spiced Lamb Shoulder with Sumac OnionsAugust 14, 20183.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintAt Maydan in Washington, DC, our No. 2 Best New Restaurant 2018, the lamb shoulder is cooked sous vide until meltingly tender and then finished in the hearth until crisp and golden brown. We adapted their recipe for the oven to similar effect.Ingredients8 servings 16–7-lb. bone-in lamb shoulderKosher salt, freshly ground pepper2Tbsp. black peppercorns2Tbsp. coriander seeds2Tbsp. paprika2tsp. ground cinnamon1tsp. ground cardamom1tsp. ground cloves1tsp. freshly grated nutmeg1large red onion, thinly sliced3Tbsp. fresh lemon juice2tsp. sumac½cup mint leaves½cup parsley leaves with tender stemsSpecial EquipmentA spice mill or mortar and pestleIngredient InfoSumac can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Season lamb very generously with salt and pepper; place on a wire rack set inside a rimmed baking sheet.Step 2Toast peppercorns and coriander seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 3 minutes; let cool. Finely grind in spice mill or with mortar and pestle; transfer to a small bowl. Mix in paprika, cinnamon, cardamom, cloves, and nutmeg, then rub all over lamb. Chill uncovered at least 4 hours and up to 1 day.Step 3Let lamb sit out on counter at room temperature 1 hour before roasting.Step 4Place a rack in middle of oven; preheat to 275°. Transfer lamb to a roasting pan and pour in 3 cups water. Cover tightly with foil and cook, turning lamb over and rotating pan halfway through, until meat is almost falling off the bone, 3–3½ hours. Remove lamb from oven and turn up heat to broil (or to highest heat if you have a drawer-style broiler). Discard foil, transfer lamb to a cutting board, and pour off liquid in pan. Return lamb to pan; roast, uncovered, until nicely browned, about 5 minutes.Step 5Meanwhile, toss onion, lemon juice, and sumac in a small bowl with your hands, squeezing onion a bit to soften.Step 6Just before serving, toss mint, parsley, and a pinch of salt into onion mixture. Serve lamb topped with onion salad.How would you rate Slow-Roast Spiced Lamb Shoulder with Sumac Onions?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleSomeone didn't test this recipe at all -- and you really shouldn't post it this way, or you should at least correct it.  I'm sure the spicing is great.  But you're really suggesting only 3 to 3 1/2 hours for a 6-7 pound lamb shoulder at 275° F?  \n\nC'mon.  Anyone who's ever slow-roasted a shoulder of anything knows that's a preposterous suggestion.  Mine was only 5 pounds, and it took a good 5 hours to become tender -- and I jacked up the heat to 300° after 3 hours.  Julie Vermont 1/26/2021I could not find a lamb shoulder, so used a boneless leg of lamb.  Followed the recipe closely, but ended up with a rather dry, but very tasty roast and over a quart of liquid.  I was disappointed, as I had expected some thing like a pork roast that you can literally pull apart.  On the other hand, my quests loved it.Grampa DaveVirginia1/2/2020The flavor is great and very close to the restaurant's amazing lamb!  The recipe is not exactly accurate to help you approach Maydan.  If you don't have a sous vide (and a large enough one for a 7lb piece of meat), slow cooking in the oven is a close way to do it, but 3-4 hours at 275 degrees is not going to cut it for even a 3lb shoulder.  You definitely don't want to go above 275, but best bet is 250-275 and you'll need at least 8 hours of cook time.\n\nTo recreate their char, you'll need a grill, and lump (never use briquettes) charcoal or wood are the only options when it comes to fast firing meat.  Bon Appetit was trying to appeal to the masses here and show you the best way to do it with just an oven.  However, firing it at the end over a lump charcoal or wood grill will give you that great flavor Maydan does with their fire roasted grill in the center of their restaurant.dm71112/20/2019This recipe grossly underestimates the time needed  to cook a 7 lb lamb 3hours at 275F is definitely not enough! I would think a minimum of 325 to 350 temperature is needed. Lamb was medium well at best and not falling off the bone! Very Disappointed! This ruined my husbands birthday dinner :(Kamilal12/15/2019Had this for dinner at the restaurant this past Saturday, and all I can say is \"Wow!\".\n\nI cannot imagine that a roasted version of this dish will approach the one served at the restaurant, as the giant fire finishing up the cooking process after the sous vide was something unique and unrepeatable, but I can only imagine that it will be a close approximation.binkleyz1 mile from the junction of MD/PA/DE9/27/2018Second on the request for sous vide instructions!jkatzman9/3/2018Made it exactly as the recipe indicates and it was delicious! The kids did not like it. My adult guests loved it!Anonymous8/21/2018would it be possible to get the sous vide instructions pleaseKim SorensenMontreal 8/20/2018Explore Bon AppétitAmericanSumacHerbs & SpicesCardamomCinnamonRed OnionOnionVegetableLamb ShoulderLambMeatMainGluten-FreeDairy-FreeNut-FreeKetoRoastPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast"]}