{"id": "012bc023204225350f35a538d2570842", "url": "https://www.bonappetit.com/story/fast-family-dinner-ideas", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "4 Fast Family Dinner Ideas for Busy Weeknights | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking4 Fast Family Dinner Ideas for Busy WeeknightsShrimp-and-pineapple tacos, salad pizza, and more crowd-pleasing family dinners that are ready in a snap.By Jenny RosenstrachJanuary 10, 2018FacebookTwitterEmailBobbi LinFacebookTwitterEmailFamily dinner ideas are always in short supply. But just getting everyone around the table at one time is something to strive for, especially when kids get a little older and their schedules stack up. Between sports practices and study groups, my two teenage daughters are now busier than their parents, putting the premium for quick-to-make, easy-to-love dinners at all-time high. Here are four meals that deliver exactly that.Shrimp Tacos with PineappleAll you need is one baking sheet and a hot broiler.View RecipeThe shortcuts to a super-speedy taco night? One baking sheet and a hot broiler. You start by charring the pineapple under that heat, and you're rewarded with juicy, tender, slightly smoky bites. A tip for pineapple shopping: Choose one that's fragrant, feels heavy for its size, and gives slightly when pressed at the base. The shrimp gets broiled next (same baking sheet!) until it's just cooked through. Starting with frozen shrimp? No problem. Throw them in a resealable bag and set in a bowl of cool running water in the sink—you'll be good to go in 10-15 minutes.Salad PizzaWe swapped the red sauce for crisp lettuce tossed in a bracing dressing—and we’re into it.View RecipeWho says all pizza needs red sauce and melty mozzarella? We swapped those classics for a crisp lettuce tossed in a bracing dressing—and we're into it. Pro tip: Let the pizza dough sit out for 20-30 minutes makes it easier to handle and stretch. While you're waiting, make a double batch of the pickled onions that go on top. You can keep them around and layer in sandwiches, salads, and tacos that need a pick-me-up throughout the week.Panko-Crusted Roast Chicken Thighs with Mustard and ThymeThis crispy chicken is a weeknight dinner MVP.View RecipeYou get the best of both crispy, crunchy chicken tenders here thanks to the layering of panko, and also the juicy, tender thigh meat. The butter, dijon, and thyme mixture is a genius way to make the panko stick to the skin of the chicken while also providing a huge amount of flavor. Don't forget to spoon that schmaltz-y pan sauce all over the carrots when you're done; you don't want it to go to waste.Wheat Berry Bowl with Merguez and PomegranateYou can use any cooked grain—and any type of sausage you want—for this healthy but hearty dinner bowl.View RecipeCooked a big batch of grains on Sunday? Congratulations—you're halfway to a weeknight dinner. Yep, that's right, you can use any grain you have around. Freekah, barley, and farro all work well in place of the wheat berry. And no merguez? No problem. Sub with sweet Italian pork or chicken sausages instead. Now about that pomegranate... Want to seed it in record time? All you have to do is cut the fruit in half through the equator line, then hold it over a bowl of water cut side down. With a wooden spoon, smack the skin assertively and repeatedly and watch the seeds hail down.Related: Check out more fast family dinner ideas hereAnd make sure to read Jenny Rosenstrach and Andy Ward's 50 lessons from feeding kids in the past 6 years (it's a gold mine!).Attempting to seed a pomegranate for the first time, though—that's a challenge:Explore Bon AppétitWeeknightDinnerChickenRead MorecookingThe Chicken Katsu Recipe Every Kid (and Adult) Will LoveBy Adam Rapoportrecipes33 Family Dinner Recipes That Will Never Get OldGallery33 SlidesBy Alex Delanyrecipes48 Quick and Easy Family Meals to Bust Weeknight Dinner StressGallery48 SlidesBy Christina Chaeytest-kitchen4 Easy Weeknight Dinners for People Who Work Too HardBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Jenny Rosenstrach"]}