{"id": "012cb6306c3af59fa09e8b296390b737", "url": "https://www.bonappetit.com/story/reasons-to-stock-your-pantry-with-this-one-evoo", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Reasons To Stock Your Pantry With This One EVOO | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredReasons To Stock Your Pantry With This One EVOOBy Colavita® March 1, 2019FacebookTwitterEmailFacebookTwitterEmailYou know it when you taste it: the bold, rich flavor of a great olive oil. It goes with almost everything (even sweets!) and it’s healthy too. Few cooking essentials are as important as this good-fat favorite, one that’s perfect for the whole family. After all, family is where the Colavita® story begins. Whether it’s their authenticity and heritage, the heart-healthy benefits, or its versatility, there are plenty of reasons why this EVOO is a pantry must-have.A FAMILY TRADITIONGiovanni Colavita, the current CEO of Colavita® USA, began helping his grandfather package olive oil at the age of four in Molise, Italy.“Quality and tradition is very important to us, and will always continue to be,” Giovanni says.“Today, my cousins and I still continue the tradition that my great grandfather started of producing extra virgin olive oil and other specialty food products using the same knowledge and expertise handed down from our ancestors.”By the time Giovanni and Felice Colavita founded Colavita® as a small olive mill in the village of Sant’Elia a Pianisi in the Molise region of Italy, their family had been growing and pressing olives for generations. The next in line, Giovanni’s sons, Enrico and Leonardo Colavita, extended the family business and expanded to international markets starting with the USA. In 1979, they found their first foreign partner and started to distribute Colavita® olive oil around the world. By the end of the 1980s, their reputation had become a benchmark for Italian quality products worldwide––and it’s still going strong.Today, they still focus on quality above all else. Colavita® operates in Campobasso and Pomezia, Italy, which is also the Colavita® headquarters and is the second largest olive oil bottling facility in Italy. In Molise, where it all began, they produce unique olive oils and Italian specialties. In the U.S., they operate in Edison, NJ and Dixon, CA. No matter where they are producing, their passion for quality is evident in the taste.A METHOD TO THEIR MAKINGLike the evolution of many family customs, Colavita® now uses both traditional and modern methods to make their olive oils. The traditional method, which uses a ladder to hand pick olives, is called “brucatura,” and the other, “raccattatura” lets the olives fall to the ground by letting them ripen, or by shaking the tree with bamboo canes. In a modern way, machinery is used to either comb the branches or vibrate to shake off the ripened olives. The end goal: to produce the best quality olive oil. Colavita® is packaged in green-tinted glass bottles, which are, along with aluminum or stainless steel tins, the best containers for maintaining freshness, as they block out light that negatively affects the oil.THE WELLNESS WONDERBeyond family tradition, Colavita® aims to provide food lovers with wellness inspiration, many of which align with the Mediterranean Diet. This well-known lifestyle relies heavily on fruits and vegetables, lean proteins like fish, whole grains and good fats. Check out the Colavita® blog to learn how to make beautiful and healthy food with good-for-you ingredients like chickpeas, tomatoes, garlic, seafood, white beans, and avocado.BALANCED FOR BAKINGWhile Colavita® has a long history of nourishing people with delicious olive oils perfect for light, nutrient-rich meals, they also love to see at-home chefs experiment with their products. Next time you’re considering baking your favorite cookie––or whipping up a homemade raspberry white chocolate tiramisu––toss the vegetable oil and opt for extra-virgin olive oil. Not only is it tastier, but if offers nutritional benefits right down to the last crumb.To learn more and shop the Colavita® product line, click here.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Colavita"]}