{"id": "012eaec5b583943369a58093b7b864f4", "url": "https://www.bonappetit.com/story/mr-black-coffee-liqueur", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Coffee Liqueur Means We Can Drink White Russians Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Very Cool Coffee Liqueur Means We Can Drink White Russians AgainIt’s the most caffeinated and art-directed cold brew liqueur around.By Aliza AbarbanelFebruary 8, 2018FacebookTwitterEmailPhoto courtesy of Mr. BlackFacebookTwitterEmailBesides avocado toast and Hemsworth brothers, coffee culture is one of Australia’s main exports. Don’t believe me? Head to the trendiest neighborhood you know, then look around for an aesthetically pleasing cafe. You know, the one with a flat white on the menu, great lighting, and an unfairly attractive barista behind the millennial pink La Marzocco? Those signs all point to one thing: Australia.So, really, it's fitting that a modern spin on coffee liqueur is coming from the land down under (sorry, but I had to get at least one Men At Work reference in here). It’s called Mr. Black, and it’s the most caffeinated and art-directed cold brew liqueur around. Each bottle has 25% ABV, and 1100 mg of caffeine per liter, which breaks down to around ten times more caffeine than familiar coffee liqueurs like Kahlúa. Still, a shot of Mr. Black is like ½ to ⅓ a shot of espresso, not quite as big of a bang as a your regular morning latte, but palpable.This potent union of alcohol and caffeine—hey, remember when Four Loko was legal?—combines\nAustralian wheat vodka with three top-grade Arabica coffee beans: Baroida Estate, Kutere Microlot, and the Ngila Coffee Estate. Each variety is roasted separately to maximize the individual flavor potential. It’s a fussy move, but one that should soothe the coffee snobs waiting to pounce in the comment section. (As a former barista, I can say that.) And the results speak for themselves: a smooth and fresh-tasting coffee liqueur that’s decidedly coffee first, vodka second.Oh how convenient, it's Irish coffee season.\nMatt DuckorBut you can still tell there’s alcohol in here. The tell-tale whiff of alcohol is muted but present. Really, this is meant to make some caffeinated cocktails. I’d advise against adding sweetener, as a straight-up shot of Mr. Black tastes about as sweet as spiked diner coffee.Mix it into a “cold fashioned” with rye whiskey and orange bitters, fortify a coffee Mai Tai, or water it down with seltzer for a take on the coffee-seltzer drink cool kids are into these days. Drink some to kick off a big night out, rent The Big Lebowski on iTunes and make a White Russian with it, or pour a little splash over your favorite ice cream for an alcoholic take on an affogato. Mr. Black is destined to appear at your next boozy brunch—and if you’re not looking to day drink, what are you really doing reading about caffeinated alcohol in the first place?At around $40 a bottle, this is definitely a craft coffee liqueur—we also like St. George’s, which has notes of chicory and clocks in at $35. The bottle, an array of line drawings reminiscent of a design school tarot card, helps soften the blow. The more you pour, the more of the drawing is revealed. Incentivized drinking! When my bottle is empty, I plan to keep it as a vase. It would accommodate approximately one sunflower, which somehow, feels fitting.Buy a 750 ml bottle of Mr. Black for $40Then spike your next affogato:Explore Bon Appétitcold brewCoffeeLiqueurAlcoholicAlcohol & Other DrinksTrends + NewsRead MorecultureForget Gin, We Have a New Favorite Partner for TonicBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-08", "author": ["Condé Nast", "Aliza Abarbanel"]}