{"id": "013f29e5ff663016668554e8b233667c", "url": "https://www.bonappetit.com/recipe/marinated-summer-squash-with-hazelnuts-and-ricotta", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Marinated Zucchini with Hazelnuts and Ricotta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueMarinated Zucchini with Hazelnuts and RicottaBy Molly BazMay 22, 20184.9(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintZucchini is anything but boring when bathed in a kicky vinaigrette. Summer squash contains a lot of water, which can cause it to get mushy when cooked. We turned to a trick we use with moisture-rich vegetables like cucumbers and eggplant: Toss raw halved squash with salt and let it sit for at least ten minutes (and up to 30) to draw out some liquid, and then pat dry with paper towels. This also seasons it from the inside out, concentrating the flavor.Ingredients4 servings 3medium summer squash or zucchini (or pattypan squash!), cut in half lengthwise1½tsp. kosher salt, plus more¼cup blanched hazelnuts6Tbsp. extra-virgin olive oil, divided, plus more for drizzling1small bunch mint, divided1small garlic clove, finely grated2Tbsp. white wine vinegar¾tsp. sugar½tsp. crushed red pepper flakesFreshly ground black pepper½lemon½cup fresh ricottaFlaky sea saltToasted country-style bread (for serving)PreparationStep 1Preheat oven to 300°. Toss squash and 1½ tsp. kosher salt in a colander; set over a bowl. Let sit 10 minutes, then pat dry with paper towels.Step 2Toss hazelnuts and 1 Tbsp. oil on a rimmed baking sheet and roast, shaking occasionally, until golden brown, 15–20 minutes. Let cool; crush into large pieces with a measuring cup or glass.Step 3Smack 3 mint sprigs against your cutting board a few times to release their flavor; mix in a large bowl with garlic, vinegar, sugar, red pepper flakes, and 2 Tbsp. oil; set dressing aside.Step 4Heat 2 Tbsp. oil in a large skillet, preferably cast iron, over medium-high until shimmering. Arrange squash cut side down in skillet, breaking into smaller pieces if needed in order to fit in a single layer, and cook, moving around in pan to ensure even browning, until golden brown on cut side, about 5 minutes. Reduce heat to medium-low, cover (if you don’t have a lid use a baking sheet), and continue to cook until very tender, about 15 minutes. Transfer to a cutting board and let cool slightly.Step 5Cut squash into 2\" pieces and toss in reserved dressing to coat; season with kosher salt and black pepper. Let sit at room temperature, tossing occasionally, 15 minutes. Pluck out mint sprigs; discard.Step 6Meanwhile, zest lemon half into a small bowl, mix in ricotta and remaining 1 Tbsp. oil; season with kosher salt. Hang on to that lemon.Step 7Spread lemon ricotta over platter. Top with squash and their juices. Squeeze reserved lemon over. Pull leaves from remaining mint sprigs (you want about ¼ cup). Scatter mint and hazelnuts over squash. Drizzle generously with oil and sprinkle with sea salt. Serve with toast.How would you rate Marinated Zucchini with Hazelnuts and Ricotta?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleMy god this is good. Prepared the zucchini on Sunday and have been eating this for work from home lunch every day, slathering the ricotta on a nice piece of toasted crunchy bread with some fruit on the side. So delicious. I didn't even have white wine vinegar (subbed for half red wine half apple cider vinegar) or mint and it was still amazing. Definitely splurge on good ricotta, it makes a huge difference. This would be a great meal to serve at a summer bbq.Hannah Washington, DC7/22/2021This is one specular side dish. I’ve paired it with so many main courses that it stands alone. A must for any cooks recipe collection. Easy, effective Chef RobertNew York,City7/7/2021Just made it for a hot summer night. BBQ’ed the zucchini because we didn’t want to heat up the house. Stayed true to the recipe and it was the best side this year! So much so that I would bring it to any potluck. Make more lemon ricotta… hubby asked for more and I had to share. Thank you for such a wonderful dish. Flutterbug318Victoria, BC, Canada7/5/2021Simply incredible. I spread the ricotta mixture on a thick slice of french bread I had toasted with olive oil in a pan, then put the zucchini mix on top of that for a toast/open-face sandwich of sorts. Go heavy on spooning the flavorful juices over top along with lemon squeeze. Didn't have the hazelnuts, and it's just wonderful without them. HelenPhiladelphia, PA3/29/2021This was soooo good! I cut the recipe in half and made it for lunch and it was the perfect serving. Comes together really easily. I didn't cover the cast iron for the zucchini and didn't roast my already roasted hazelnuts. Will certainly make again as an appetizer for a dinner partyAlexisDenver, CO12/2/2020The quintessential summer side dish! I'm in love.AnonymousNew York9/29/2020Loved this but my instincts told me not to lid the zukes. I just browned them nicely in a cast iron skillet so they had a touch of crispness with plenty of give. I liked that they had some textural integrity. The lemony ricotta is a dream. Schmered it on some excellent Vermont sourdough bread from Red Hen Bakery in Middlesex, VT. Soooo good!!Vermont7/21/2020Wow this was great. I'm already looking forward to eat this again soon! Hannah_RosalieThe Netherlands5/27/2020YAAAASSS! SO GOOD! Thank you! AnonymousBogotá, Colombia.5/19/2020Made this tonight to feel Summery and forget that it was snowing out today. A huge success! Simple and flavourful and satisfying. Added half a can of drained chickpeas to the marinade to up the protein a bit. \nWill definitely make again and again. AnonymousHamilton, ON5/9/2020Absolutely delicious! Must try. natusik4/21/2020I loved the crunch of the warm hazelnuts against the cool temperature and creamy texture of the ricotta. Those ingredients coupled with the zucchini made for an excellent spread on toast. I will definitely be making this again. Anonymous12/30/2019Ok I love Molly and BA in general... but am I the only one bothered by how soggy and mushy the squash is?? I think maybe I just don’t like squash? Too hard to get it to the right consistency. I bet this marinade would be great with her smashed potatoes-going to try a hybrid!AnonymousNew York 12/16/2019Obsessed with this recipe. Can anyone weigh in as to whether this could work with kabocha squash?Anonymous11/25/2019Veganized this by using a homemade tofu ricotta, otherwise followed the recipe exactly! Seriously one of the best dishes I made all summer. So bright, flavorful, complex, and crazy simple to make! Served it with some fresh baguette and it was 10/10. Make this!!!! (thank u queen molly)sophisrChicago, IL10/2/2019Explore Bon AppétitSaladItalianEuropeanZucchiniSquashVegetableHazelnutNutRicottaCheeseSummerEasyWeeknight MealsSideVegetarianHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}