{"id": "01430a8e2e61dd7340dc5b44d4c4531f", "url": "https://www.bonappetit.com/story/gentle-cooking", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Cook the Food That Makes You Feel Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCook the Food That Makes You Feel GoodBe gentle on yourself.By Adam RapoportMarch 24, 2020FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I can’t recall exactly when in the past 10 days Christina Chaey launched her #gentlefoods campaign. And, to be honest, I didn’t really know what she was talking about when she did. But she had me at gentle.As we became a nation of home cooks last week, we approached our newly isolated status with a startling gusto—sharing our creations on Instagram, facetiming with friends as we embarked on ninja-level cooking projects.At the RapoBuck household, I grabbed my cast-iron skillet and fired-up Basic Bulgogi. I batched a double recipe of BA’s Best Bolognese. I made a creamy, leeky, buttery bowl of colcannon that just might have been the most satisfying thing I’ve made all year.Want this letter before it hits the website? Sign up for our newsletter!Make this Anything Goes Donabe your own.\nPeden + MunkBut, as delicious as it all was, it wasn’t sustainable. This isn’t the kind of food you can eat night in, night out. And, so, as it has become apparent that we’ll all likely be at home for far longer than we ever imagined, we need a diet that will take care of us. Enter Chaey, a voracious home cook who happens to be our newest newsletter columnist. (You can catch her every Sunday on the Healthyish newsletter; sign up here if you don’t already receive it.)“To me, ‘gentle foods’ are the ones that are like a blanket,” says Chaey, who has been with Bon App, off and on, for more than four years. “For me recently, that’s been things like eggs (not the crispy ones fried in olive oil—too aggressive for me right now), simple clear soups with wilted greens and dumplings, bean stew, poached fish. They’re simple, nutritious and intuitive. Not based on a grocery list so much as what your body wants to consume.”We can thank chef Cal Peternell for these braised greens.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraI like the last part the best. We all know what our bodies need; we just choose not to listen much of the time. To get me headed down the gentle path, I asked Chaey for some starter recipes, many of which have popped up in her Instagram stories. There’s BA’s Anything Goes Donabe, a catch-all hot pot that you can make even if you don’t own the elegant, Japanese ceramic cooking vessel. I’m definitely going to make Healthyish’s Simple Khichari, an Indian lentil-and-rice dish that I happen to discuss with Priya Krishna on this Wednesday’s upcoming episode of the Bon Appétit Foodcast. And because gentle doesn’t have to mean vegetarian, how about some Greens with Braised Pancetta and Garlic?As we navigate the next several months, the most important thing we can do is take care of ourselves and those closest to us. And that starts with what we eat. So keep cooking—and be gentle on yourself.Explore Bon AppétitAdam NewsletterCoronavirusRead MorecultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffCoronavirus7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstBy Caroline LangeLifestyleCooking at a (Social) DistanceBy Christina ChaeyCoronavirus17 Ways to Feel Good at Home Right NowBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-24", "author": ["Condé Nast", "Adam Rapoport"]}