{"id": "0154b6ada9513b8d2bf26619dbf35074", "url": "https://www.bonappetit.com/recipe/sweet-potato-loaf-cake-with-dark-chocolate-ganache", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Sweet Potato Loaf Cake With Dark Chocolate Ganache Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueSweet Potato Loaf Cake With Dark Chocolate GanacheBy Cheryl DayOctober 19, 20214.2(43)Read ReviewsTriangleEmailPinterestPrintPhotograph by Christopher Testani, Food styling by Victoria Granof, prop styling by Alex BrannianEmailPinterestPrintEmailPinterestPrintFall is officially sweet potato season, and this aromatic cake from Cheryl Day’s Treasury of Southern Baking is an ideal cozy-weather snack. The outside is completely cloaked in glossy ganache, but when you slice into the cake, it reveals its heart: tender, gently spiced, and faintly citrusy. You can use canned sweet potato purée instead of making your own, but you’ll need to use less of it to make up for the additional moisture.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLoaf Pan$15 At AmazonPotato Masher$15 At AmazonScale$25 At AmazonSilicone Spatula$13 At BA MarketWhisk$10 At AmazonOffset Spatula$12 At AmazonSmall Saucepan$155 At AmazonIngredients12 ServingsCake1lb. sweet potatoes (2–3 medium), peeled, cut into 1\" pieces, or 1 cup (250 g) canned sweet potato puréeUnsalted butter or nonstick vegetable oil spray (for pan)2½cups (313 g) all-purpose flour1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1tsp. baking powder½tsp. baking soda2tsp. ground cinnamon½tsp. freshly grated nutmeg¼tsp. ground cloves2large eggs, room temperature1½cups (300 g) granulated sugar2tsp. finely grated orange zest1tsp. vanilla extract1cup vegetable oilGanache and assembly½cup heavy cream4Tbsp. unsalted butter, cut into 1\" pieces3Tbsp. granulated sugar2Tbsp. brewed coffee½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt8oz. (227 g) bittersweet chocolate½tsp. vanilla extractPreparationCakeStep 1Place a rack in middle of oven and preheat to 400°. If using raw sweet potatoes, wrap in foil and roast on a parchment-lined baking sheet until tender (a knife should slide easily into flesh), 50–60 minutes.Step 2Unwrap sweet potatoes and let sit until cool enough to handle. Transfer to a small bowl. Using a potato masher or fork, smash until smooth. Measure out 1¼ cups (250 g) purée; save any extra for another use.Step 3Reduce oven temperature to 325°. Butter a 9x5\" loaf pan or lightly coat with nonstick spray. Line pan with parchment paper, leaving overhang on long sides. Whisk flour, salt, baking powder, baking soda, cinnamon, nutmeg, and cloves in a medium bowl.Step 4Whisk mashed sweet potato (homemade or canned), eggs, granulated sugar, zest, and vanilla extract in a large bowl until smooth. Gradually add oil, whisking constantly until completely incorporated. Using a rubber spatula, fold in dry ingredients in 2 batches, mixing just until combined after each addition. Scrape batter into prepared pan and smooth surface with an offset spatula.Step 5Bake cake until golden and a tester inserted into the center comes out clean, 75–90 minutes. Transfer cake to a wire rack and let cool in pan 15 minutes. Using parchment overhang, lift cake out of pan and onto rack. Remove parchment and let cake cool completely.Ganache and assemblyStep 6Bring cream, butter, sugar, coffee, and salt to a simmer in a small saucepan over medium heat. Remove from heat, add chocolate and vanilla, and whisk until chocolate is melted and mixture is smooth. Let cool until thickened slightly, 40–60 minutes.Step 7Pour ganache over cake (it should flow over the sides) and, using a small offset spatula, smooth it evenly over surface. Chill cake until ganache is set, 20–30 minutes. Bring cake to room temperature before serving.Do ahead: Unglazed cake can be baked 3 days ahead. Store tightly wrapped at room temperature.Recipes adapted with permission from ‘Cheryl Day’s Treasury of Southern Baking’ by Cheryl Day (Artisan Books). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Sweet Potato Loaf Cake With Dark Chocolate Ganache?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI loved this cake. Rich flavor. Moist. Mine developed the deep crack as it cooled. I made the whole recipe of ganache. The bittersweet chocolate was perfect with the moist sweet potato cake. Highly recommended. No changes needed. Dale San Antonio, Texas 3/13/2022Amazing cake! I don't like chocolate so I didn't make the ganache and it was still perfectly sweet and moist without.ChiBrooklyn2/22/2022The ganache was great, but I had to keep stirring it as it cooled to keep it from splitting.  There seemed to be a large amount of butter.  Finally it got cool enough so the high fat content did not separate. I wonder if the coffee (water) caused the problem.  I have never seen a ganache that had added water.  Next time I will just dissolve instant espresso into the cream.   I will make the ganache agin, but not the cake.  It tasted OK, but was too dry, too salty, and too heavy.  I will put the ganache on typical spice / pumpkin / carrot cakes that have similar flavors and are not so dry.RickWPalm Springs2/8/2022This was a delicious cake and of course the ganache didn’t hurt - I did find it a little dense which may have been mismanagement on my part and you can always add a scoop of ice cream and whipped cream in any case - but take away the chocolate and I envisioned toasting it, with or w/o any additions!AnonymousHomosassa, FL2/3/2022Marvelous even without ganache.  Moist, not too sweet.  Good with cream cheese for breakfast.  TonyCleveland12/26/2021This is a really delicious recipe. I followed some of the reviewers suggestions (thank you!) -\n1. I roasted the potatoes the night before - at 425 degrees, buttered the potatoes and put them in tin foil (I used vegan butter), for about an hour until they were super soft; then brought them to room temp the next day.\n2. I made only 1/2 the amount of the ganache and it was even a little more than enough. It was cool enough to use like icing and gets perfect in the fridge;\n3. I used 1/2 the amount of the kosher salt;\n4. I only used 1 cup of sugar\n5. I live at altitude so of course added a little flour and reduced the baking soda and powder by 1/4 tsp - The loaf still puffed up beautifully.\n6. This is the best part - I chopped up candied ginger and sprinkled it on top of the ganache so it set in there. \nYUM! Thanks for the recipe\nShochetDenver12/4/2021Beautiful cake! After reading the comments I also halved the amount of ganache and it was plentyAnonymous11/29/2021Absolutely delicious! This sweet potato loaf was a huge hit at our Thanksgiving gathering this afternoon. Thank you for the tasty recipe Ms. Day! I am like looking forward to baking your other recipes from your  newest cookbook “Cheryl Day’s Treasury of Southern Baking”.\n\nFor T. Hunt I replaced the vegetable oil with coconut oil  and the loaf was perfect. RitaLos Angeles, CA11/26/2021I cut the ganache recipe in half and it was more than enough! The cake is excellent. When I took it out of the oven I cut a slit down the center of the cake so that the ganache could drip onto it. :) Yum! Five stars. MandyCorpus Christi TX11/24/2021Very good, I love the flavour! I always disliked sweet potato pie, but this bread is amazing. My friend made it first, and the only downside was that it was a bit too salty. When I made it myself, I cut the amount of salt in half and it was perfect.KateVancouver, BC11/20/2021Any thoughts on making this as a bundt cake? DMLos Angeles11/17/2021I made only half the amount of ganache and it was plenty! The full amount would've dripped off the cake or been too thick on top. There's no way the image above includes the entire amount of ganache -- my ganache coating was at least as thick, if not thicker, with only half the recipe. \n\nOther notes: I decreased the sugar to about 1 c and it was plenty sweet for my tastes (the roasted sweet potatoes bring a lot of sweetness.)AnonymousMN11/15/2021I'm wondering if I could make the cake now and freeze it- then thaw the night before Thanksgiving and apply the ganache day of.AFCNew York, NY11/15/2021Decadent, delicious. Flavors are the perfect medley of spices with slight hint of citrus. I never buttered the pan, just lined with parchment.  RedheadChicago, IL11/15/2021I thought this recipes was great! I roasted the sweets the night before and brought them to room temp before baking with them. The crumb and the flavor were amazing. It was a little but spicy, but not too much and the ganache gave the bread a wonderful sweetness that balanced the bread. I loved the coffee in the ganache too, that was something I have never done. I would definitely make this again!May-LinBrooklyn, NY11/9/2021Explore Bon AppétitSweet PotatoCakeDessertGanacheChocolateOther IngredientsDark ChocolateLoafSnackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Cheryl Day"]}