{"id": "0163a4633b4e767049e00abc9a0e9cd0", "url": "https://www.bonappetit.com/story/loisa-seasonings", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "Loisa’s Sazón and Adobo Impressed Even My Puerto Rican Grandma | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLoisa’s Sazón and Adobo Impressed Even My Puerto Rican GrandmaIt’s not the brand I was raised with, but Loisa’s seasonings have earned their place in my kitchen.By Alexis MontoyaSeptember 23, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.A cascade of amber powder falls from my grandma’s hand. As it hits the pinto beans, dancing in their pot, notes of garlic, achiote, and oregano fill the air. While the beans cook, she pulls the tostones out of the fryer and hits them with a light sprinkle of another powder, this one as yellow as the plantains. A beloved standard in many Boricua kitchens, sazón and adobo are always kept at the ready—and when I need to replenish, I look for Loisa.Loisa Organic Sazón Seasoning$11 at Amazon$19 at Loisa (pack of 2)Historically, my family (and almost everyone else I knew) always used Goya’s sazón and adobo. So when I came across Loisa, I was intrigued: A company that dared to compete with Goya? (This was a year before the boycott of the brand, which sent many looking for alternatives.) After I got my hands on Loisa’s adobo and sazón, I hurried to my grandma’s house, and with a lot of convincing, she gave it a try. The deep red sazón carried a strong aroma of cumin and garlic, and the almost glistening gold adobo popped with the flavors of turmeric, garlic, and a hint of oregano. After using Loisa, Goya seemed pale in comparison. Even my grandma, grudgingly, was impressed.Kenny Luna, Scott Hattis, and Yadira Garcia started Loisa to recreate the Latin seasonings they loved but with organic ingredients and no dyes or preservatives—and they ended up with products that taste brighter and more flavorful than the other versions too. The sazón adds smokiness and depth to sancocho or arroz con gandules. I sprinkle the adobo on top of root vegetables for an enhanced savory flavor (your fried yuca will never be the same) and incorporate it into marinades for pernil.Loisa Organic Adobo Seasoning$11 at Amazon$19 at Loisa (pack of 2)I don’t have to change my grandma’s recipes when using Loisa because the seasoning blends have been formulated with Puerto Rican cooking in mind. They may not be the ones that my grandma grew up with, but Loisa adobo and sazón have earned spots in her kitchen—and in mine.Explore Bon AppétitShoppingLifestyleHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-23", "author": ["Condé Nast", "Alexis Montoya"]}