{"id": "01725b832cf59de8884139966c37312f", "url": "https://www.bonappetit.com/story/the-egg-house-experience-review", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "One Woman’s Search for Meaning Inside The Egg House, a Pop-Up “Experience” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOne Woman’s Search for Meaning Inside The Egg House, a Pop-Up “Experience”I stood in line. I took some selfies with eggs. I did not drink the eggnog.By Kelly ConaboyApril 10, 2018FacebookTwitterEmailA visitor at The Egg House in New York. (Not the author. Just to clarify.)Courtesy of The Egg HouseFacebookTwitterEmailIt seems irresponsible to start writing about The Egg House without issuing a warning that every second spent reading about the egg-themed Instagram photoshoot pop-up is a second taken away from the planning and construction of one’s own Instagram photoshoot pop-up—something that seems, at least for the moment, like a guaranteed monetary success. Maybe your pop-up is an icing pond full of giant lily-pad style cinnamon rolls and you bring your dog to it? Or maybe it’s something like a peanut butter and jelly house. Or a garlic hotel? Whatever it is, I advise you to go, set up the neon lights and the big versions of small things, and charge people about $20 to take photos in front of it, and then come back to read about The Egg House. (If you do set up a popular pop-up you owe me 60% of the income; reading this is legally binding.)The Egg House is a pop-up similar to the wildly successful Museum of Ice Cream. How does it compare? Not having visited the ice cream museum myself, I’ll relay a conversation between two egg-sweater-wearing men who were standing in line behind me at an egg ball pit photo op. “This is actually not as good as the Museum of Ice Cream,” one said. “At least that gave you some info about ice cream.” There you have it.Egg refreshments.\nCourtesy of The Egg HouseIt’s true that The Egg House, which costs $18 to enter and will run until June 27, offered no information about eggs. It barely offers any information about Ellis, the Egg whose House it is. The story of The Egg House, found in promotional materials and mentioned only once at The Egg House by an employee stationed in front of Ellis’s bedroom, is this: Ellis is an egg who moved to the Lower East Side. Ellis the egg has fallen asleep. While he is sleeping you’re able to explore his home after indulging in some light “cracking” and entering, ha-ha. (That is not The Egg House’s joke, that is my joke; if The Egg House would like to use it they may contact me—I am willing to sell.)According to the press release, the house is the product of a team of recent art, interior design, and marketing grads from NYU, Parsons, SVA, and Pratt. The so-far anonymous founder, again according to the press release, “is also the founder of a social media account with huge followings and the owner of a millennial tea store opening soon in SoHo.”The house claims to be a “multi-sensory experience,” featuring six interactive rooms. I would say there are 3.5 rooms and a few walls, and the main sense is “sight.” The walls feature attempts at slogans people would want to take a photo in front of, like “Flipped.” (complete with quotation marks and a period) and “Live your life sunny side-up, or over-easy, or scrambled.” I believe sunny side-up would have sufficed here, but I am grateful for the options. “The Egg House,” declares another. (That one I understand.)The ball pit pool.\nCourtesy of The Egg HouseThere is some food available for purchase: egg-shaped chocolate lollipops for $6, a macaron decorated to look like an egg for $4. Coffee and eggnog are made available at some points, allegedly, however they were not offered during my visit. Luckily, the commercial space does not smell like eggs.The proper rooms are a ball pit pool, a bedroom, and a garden. (I’m counting an oversized egg carton that you can sit in as a half room.) Though there were only a handful of people in line for the ball pit, it took me 22 minutes to reach the egg-colored ball water because the couples in front of me spent upwards of five minutes each trying to capture the perfect iPhone shot that made it seem like they were preserving memories of fun. Some disappeared their whole bodies into the ball water for a photo, even though many of the balls had other peoples’ hair static-clinging to them.Entering the bedroom was preceded, as I mentioned, by a short explanation of Ellis. Oh, sweet Ellis. He is an egg, you see, and he lives in the city. The guide pointed out that one might notice he is adjusting to city life well, as evidenced by the MetroCard on his table and pizza boxes beside his bed. It’s true, they were there. There were also Sleep No More masks on the wall, which allowed you to take a photo of yourself in a Sleep No More mask by an egg on a bed.The phone prop is also an option.\nCourtesy of The Egg HouseAn egg swing inside The Egg House; a place to think about things.\nCourtesy of The Egg HouseIn the garden downstairs, you were able to briefly swing on a giant eggshell swing (see above) for a photo after waiting in another line held up by everyone else’s photoshoots. Elsewhere in the swing room, there was a bunch of white fabric you walked into, revealing a hole in a wall opening into a miniature egg room with an actual egg in it. There was a miniature bed and a miniature desk and, like I said, an egg. Very cute. This was an interesting twist, because you could not easily take a photo of yourself in front of the real egg—instead you just had to take a photo of it. An egg.We are living in a very strange time. Lots of people are willing to pay money—money that could be spent on something like a cocktail (!)—to experience the life of a Sears catalog model. It’s odd. The best theory I can come up with for the existence (eggistence) of The Egg House is that it is a prank to be revealed on the next season of Nathan for You. (And we will certainly all have “egg” on our faces then, won’t we, ha-ha?) The best theory I can come up with for the sold-out crowd on the day I attended is ummm, ahhh. Oh yes: Instagram. I would say that it would maybe be a fun place for a baby, but I do not think a baby would enjoy the lines. I’m not sure who it would be a fun place for, but I guess for some the social media dopamine spike is worth $18.The anonymous Egg House founder said she created the pop-up to function as a momentary escape from the city. But the crowded, commercial space full of temporary Instagram photoshoot backdrops felt more like a saturated version of what you’d most want to escape from: the feeling of constantly being marketed to, lines, a general sense of social media-related despair. At least, however, there wasn’t that egg smell.Explore Bon AppétitEggNew YorkInstagramTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-10", "author": ["Condé Nast", "Kelly Conaboy"]}