{"id": "0185c59d4195d9ae8ec3c5ac5fdfbda8", "url": "https://www.bonappetit.com/story/thanksgiving-table-decorations", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "These Thanksgiving Table Decorations Are Better Than Any Place Card | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleForget the Place Cards and Put These on Your Thanksgiving Table InsteadFrom terrazzo scraps to actual Legos, here’s how to add even more fun to dinner.By Erika OwenNovember 20, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailPlaying with food may not be sanctioned at your Thanksgiving table, but that doesn’t mean fun is off the menu. Readers, I have one word for you: knick-knacks.At my table, we like to call these objects dinner table Legos: things you can play with during awkward silences, meandering stories, and those achingly long minutes between dinner and pie. Instead of stabbing at your turkey breast with a fork or quietly dying inside, you can stack terrazzo scraps, balance plastic army men, or make a clay model of the relative sitting across from you. Skip name cards and set a postcard at each place setting. Tell your guests to pick the one that speaks to them and take it home with them.In my experience, giving dinner guests something to look at or play with makes everything a little more seamless, whether you’re hosting friends, in-laws, or the same familial crew. It can also serve as an icebreaker. I once learned that a dear friend had previously studied to be an architect after I innocently asked, “What are you building over there?”There’s no need to go out and buy anything new here. The whole idea is to use the items around the house that you already find yourself fiddling with. Almost a year ago, I bought a pile of Barbie postcards—yes, you read that correctly—while antiquing in upstate New York. (Each one depicts a different Barbie and, as you can imagine, they are quite dated and hilarious.) Until recently, they had been gathering dust in a closet. But setting a few out on the table delivered more joy than anything I’ve ever cooked. Even better: Skip name cards and set up a postcard at each place setting. Tell your guests to pick the one that speaks to them and take it home as a sweet little dinner party gift.If you’re looking for inspiration, here are a few objects you can start with: actual LEGOs, puzzles (like these food-themed lovelies from Areaware), dominos, chalk (add a layer of chalkboard paper between you and your table first), Russian nesting dolls, Rubik’s cubes, Jenga, or Fortune Fish (my favorite thing in the world, in case you were wondering). I promise, your dinner guests will thank you for the free entertainment. So when your cousin who always starts sharing a little too much after her second glass of wine ramps up, toss her a bamboo finger trap and give thanks for knick-knacks.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishThanksgivingTrendsRead MoreLifestyleHow to Add Candles to Your Dinner Table Without Going Full GrandmaGallery5 SlidesBy Erika OwenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Erika Owen"]}