{"id": "0186f9baaf3ed689bf84e82ba5342949", "url": "https://www.bonappetit.com/story/what-is-bechamel-sauce", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Okay, What Is Béchamel Sauce, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOkay, What Is Béchamel Sauce, Anyway?Once you learn what béchamel sauce is, you'll realize it's integral to so many amazing dishes, from mac and cheese to lasagna.By Alex DelanyMarch 13, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Jennifer OphirFacebookTwitterEmailThe first thing you've got to know about béchamel is that it's what's known as a \"mother sauce.\" (And no, a mother sauce is not a sauce that signs permission slips or helps you with your homework.) A mother sauce is one of the building blocks of classic French cuisine—a sauce used to make other sauces. There are five mother sauces, and of those five béchamel might be our favorite.In its purest form, béchamel is comprised of butter and flour that have been cooked together (a mixture that's also known as a roux) and milk, with just a bit of seasoning. The result is a silky cream sauce that can be used either on its own or as the base for countless other sauces.Béchamel is thick, clinging to food in the way that a good sauce should—and it’s that roux we have to thank for that. The first step in making a béchamel is to create a roux, a mixture of flour and fat that acts as a thickening agent. (If you've made gravy on Thanksgiving, you've probably made a roux before.) To make a roux for béchamel, you simply heat the fat—in this case butter—and whisk in roughly equal parts flour, cooking it just long enough to get some of the raw flavor out of the flour but not so long that it takes on any color. (In some other instances—gumbo being one of them—a roux will be cooked for an extended period of time, until it takes on a deep, dark color and nutty flavor, but that's not what we want here.)Once the roux is properly cooked, the next step is to whisk in milk. (You may have noticed at this point that this sauce is pretty much just fat, flour, and more fat—that’s why it's so good, folks.) Milk is what turns the roux into a sauce. But you can’t just dump it all in at once. To create a smooth consistency (a necessity when it comes to béchamel), you need to gradually whisk in the milk. If you pour it all in at once, it will get clumpy and awkward. No one wants an awkward sauce. But we do want a flavorful sauce, so we need to continue to cook the béchamel, whisking it frequently, until it thickens to the degree that we want it to. Different recipes will call for different amounts of milk and different coking times, which will produce different consistencies. For example, when making a croque monsieur, you want the sauce to be thick and almost spreadable, but for lasagna you want it to be thinner and almost pourable.Once you've reached the degree of thickness you're after, it's time to season the béchamel with salt and nutmeg. Yeah: nutmeg! It’s not a flavor you should necessarily be able to pick out if you didn’t already know it was there, but nutmeg lends this otherwise kind of one-note sauce a considerable amount of warmth, spice, and complexity. It’s like putting a coat on over your favorite sweater. The whole situation gets cozier.Mac and cheese sits comfortably in the Béchamel Hall of Fame\nAnd that's it! Now all you have to do is use the béchamel. How? Well, there are plenty of ways. You could swipe it all over the bread you’re using to make croque monsieurs. You could use it as the creamy component for a classic lasagna. You can use it as a base for your cheddar-loaded mac and cheese. You could use it as the French do and make some fancy sauces like mornay or nantuan or soubise.But really, all you need to know is that you have a versatile, creamy white sauce that can act as vehicle for whatever flavor you want to deliver. You can load it with herbs or cheese or lemon zest or chile powder. You can take it in any direction you’d like. That’s the beauty of béchamel.Now, about those croque monsieurs:Basically Croque MonsieurLike a hot ham and cheese sandwich, but slathered with cream sauce and baked to bubbly perfection. (Yeah, it's as good as it sounds.)View RecipeExplore Bon AppétitBasicallyBechamelSauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-13", "author": ["Condé Nast", "Alex Delany"]}