{"id": "018e510318374e4de677dacf8ababebb", "url": "https://www.bonappetit.com/recipe/sesame-lemon-pickled-cucumbers", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Sesame-Lemon Pickled Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueSesame-Lemon Pickled CucumbersBy Andy BaraghaniMay 25, 20214.0(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Julian Cousins, food styling by Adriana Paschen, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintWith a simple cold brine of water, vinegar, sugar, and salt, this pickle recipe is open to so many additional layers of flavor. Here, that’s thin slices of fresh lemon, some green chile, and sesame seeds (black or white). The cold brine keeps the cuke slices extra-crunchy. It’s also our go-to method for pickling thinly sliced fennel, cauliflower florets, quartered radishes, or thinly sliced celery.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonCutting Board$10 At IKEA8-Inch Chef's Knife$47 At AmazonIngredientsMakes about 1 quart1lb. kirby, Persian, or English hothouse cucumbers, sliced ½\" thick½lemon, thinly sliced into rounds, seeds removed1small green chile (such as serrano), thinly sliced12\" piece ginger, peeled, julienned1½cups unseasoned rice vinegar¼cup sugar4tsp. Diamond Crystal or 2 tsp. Morton kosher salt1Tbsp. sesame seedsSpecial equipmentA 1-qt. glass jar with a lidPreparationPlace cucumbers in jar. Bring lemon slices, chile, ginger, vinegar, sugar, salt, sesame seeds, and 2 cups water to a boil in a small saucepan and cook, stirring, until sugar and salt are dissolved, about 1 minute. Let cool. Pour brine over cucumbers in jar; cover and chill. Pickles will taste good after a few hours, but for the best flavor wait at least 24 hours before using.Do ahead: Cucumbers can be pickled 2 months ahead. Keep chilled.How would you rate Sesame-Lemon Pickled Cucumbers?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleAbsolutely love these -- they are now a staple in the fridge for salads, sandwitches and a side.  Working on my 4th batchAnonymousWilliamsburg VA9/6/2021Boiling vinager + peppers basically mustard -gassed my home. Had to run the pot outside so everyone would stop coughing.Anonymous8/13/2021i really didnt like the flavor. it was not refreshing at all. tasted like watery soupRobinSan Francisco8/8/2021I made these and they are tasty, I used half the sugar and followed the rest of the recipe. Next time I will cut the lemons in 4’s after thinly slicing so when I pour the brine there is more room for everything to wiggle around while waiting to be eaten.  I’ll make this again and again! Diane 🐝Seattle 7/26/2021BEST PICKLES EVER!SaoirseDublin Ireland7/2/2021This was my first time trying to make pickles at home and wowza, I'm a convert!  They stayed so crispy and crunchy and were just a delight in sandwiches or stolen right out of the jar as a snack.  Love these!!Alyssa M.Bay Area, CA6/27/2021Similar method to a Swedish pickle recipe. Different spicing. Chilling the brine with ice first preserves the color and crunch of the cukes. I plan to try this recipe. Judyatthelake WI6/21/2021Just a heads-up to anyone making this, you'll need more than 1 quart jar for this recipe. The brine itself measures over 1 quart before adding the cucumber.Ryan NibSouth Lake Tahoe, CA6/2/2021Clearly the prior reviewer cannot read much. Lemme highlight. . . .\n\"Let cool. Pour brine over cucumbers in jar; cover and chill. \"Anonymous5/31/2021The recipe specifies cucumber slices at 1/2” thick, but the slices in the photo are no where near that thick. I would guess 1/8” is more accurate?Jeff LopesLisbon, Portugal5/30/2021I haven't tried these yet but am super confused- the description is that they are a cold brine but the directions are to boil all of the ingredients for the brine- wouldn't that make it a traditional pickle brine? Anonymous5/26/2021Explore Bon AppétitPickleCondimentLemonCitrusFruitCucumberVegetableChileGingerHerbs & SpicesEasySideDairy-FreeGluten-FreeVeganVegetarianHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Andy Baraghani"]}