{"id": "01904ccf522bcda01dad8005446fedc5", "url": "https://www.bonappetit.com/story/90s-chinese-buffets", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "The Chinese Buffet Near Me Has Closed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Nostalgic Glory of the ’90s Chinese BuffetThe all-you-can-eat restaurants of my childhood—the China Gardens, Super Buffets, and King Woks—are dying out.By Naureen KhanFebruary 25, 2022FacebookTwitterEmailIllustration By Hazel Zavala TinocoFacebookTwitterEmailThe year is 1995. My family, the Khans, formerly of Dhaka, Bangladesh, now of Dallas, Texas, are finally beginning to settle in our adopted homeland. After a few rocky years in the States, my parents have steady-ish jobs, an apartment where the lights come on, and a neurotic 8-year-old (me) who no longer weeps in school every day, my angst already threatening to bloom at a tender young age. When the mood strikes, when there’s joie de vivre in our hearts, we even go out to eat. The restaurant? It’s always, always a Chinese buffet.And it’s always on a Saturday morning when my family makes the pilgrimage to our favorite all-you-can-eat establishment tucked into a strip mall off of Northwest Highway. We follow a certain set of rituals: The night before, my dad imposes a half-joking, half-serious fast, encouraging light portions. He has a banana for dinner; my mom rolls her eyes but acquiesces. If we arrive at exactly 11 a.m., right when the restaurant opens, we’re greeted by rows and rows of fresh, heaping platters of all the American Chinese classics: mounds of fiery red General Tso’s chicken, piles of slick lo mein, deep vats of beef-and-broccoli, and some sort of crab-and-cheese casserole. We walk past stately plastic bamboo plants and regal dioramas of waterfalls and pagodas. Inexplicably, we also see trays of pizza and french fries and chicken wings, although they look a little too much like freezer food to be all that appetizing.For the indecently low price of $4.95 a person, we heap grotesque piles on our plates, the garlic sauce from the chicken oozing onto the sweet and sour eggplant spilling into the noodles, the whole construction haphazardly sprinkled with fried wontons and spring rolls. At the Chinese buffet, I am a child sovereign with total freedom to do with my dominion as I wish. Occasionally, my dad cries out, “That’s enough! Enough!” when I wield the serving spoon too indiscriminately. This rings hollow because, of course, he will finish what I cannot. My favorite part is the maniacal power I feel while operating the soft-serve machine, swirling crooked lines of chocolate and vanilla ice cream into a crystal bowl.For me, the best part of going to the buffet was always that, when you did it correctly, you felt as if you were getting away with something. My family loved Chinese buffets so much that, as we grew more comfortable living in the U.S. and started taking road trips, we ate at buffets in every state we happened to be driving through at lunchtime, in Oklahoma and Arkansas, in Illinois and Maryland, in Utah. (At 15 years old, I had to draw the line when, on our first European vacation, my parents attempted to drag me to a Chinese buffet in Paris.) Today, however, the heyday of the Chinese buffet seems to be long past. While some still exist throughout the country, all the ones we used to go to in my hometown—the China Gardens, the Super Buffets, the King Woks—have closed. I’m deeply nostalgic for that feeling of waking up on a Saturday morning knowing I would spend the next few hours gorging myself at the Chinese buffet.I’m not the only avid buffet enthusiast. David R. Chan, an archivist of Chinese dining who lives in Los Angeles and has eaten at nearly 8,000 restaurants over the past several decades, said although some might sneer at the quality of the food, he’s always been a sucker for a good Chinese buffet. He first visited one in the late 1970s, when a buffet chain called the Viking’s Table began offering Chinese cuisine at one of its branches. Over the years, he’s patronized them all over the West Coast for delicious, satisfying meals at bargain prices. “I love a deal, so that’s part of the attraction,” he said in an email. “So is the fact of being able to find a dish that you really like and eat to your heart’s content.” But many of Chan’s favorite buffets have since closed too.For such a beloved institution, Chinese buffets seem to be a fairly recent phenomenon. In 1949, Chang’s Restaurant advertised itself in The Los Angeles Evening Citizen News as a Chinese buffet, claiming to be the “first served in the U.S.” with “over 20 delicious selections.” Chan said Chinese buffets likely drew inspiration from the Scandinavian smorgasbord-style restaurants that started popping up in Las Vegas casinos after World War II and spreading across the country as word of their success grew.The buffets really began proliferating in the 1990s, according to Jennifer 8. Lee, a journalist and the author of The Fortune Cookie Chronicles. She said their numbers were propelled by the arrival of Fujianese immigrants who came to the U.S. and took over restaurants from Cantonese proprietors. They quickly discovered the benefits of the buffet business model: The quantity of food cost more and resulted in more waste, but the self-serve model meant cheaper labor costs and hardly any need for the staff to speak English.“At a certain point, it’s sort of what everyone expected,” Lee said of the buffets becoming mainstays across the country. “In the Midwest, ‘No. 1 Chinese Buffet’ became the standard thing in small towns.” Lee, who crisscrossed 42 states and patronized dozens of Chinese restaurants to research her book, also had a particular fondness for Chinese buffets, with a big selling point being the chance to try a lot of different dishes. “I loved the Chinese buffets. I thought they were amazing,” she said. “You had noodles, you had rice, it’s relatively cheap per pound, and you could have all the things. They had variety.”In recent years the buffet format has struggled to continue to lure diners, with large national chains such as Sweet Tomatoes and Old Country Buffet closing. The pandemic may have hastened their demise over concerns about the safety of sharing serving utensils and crowding next to other diners in line.But Chinese buffets have faced unique changes. Even before the pandemic, the New York Times found in 2019 that more than 1,000 Chinese restaurants, not limited to buffets, had closed in major metropolitan years in the five years prior. Some owners told the Times that their sons and daughters were pursuing professional careers, and they were glad that their children didn’t have to take on the grueling work of running a restaurant, with its long hours and slim margins. Chinese restaurants supported immigrant families trying to make a livelihood. But, Lee says, as future generations grew wealthier, they no longer relied on the restaurants as much.The reign of the Chinese buffet may be coming to an end, but I’m grateful that they were able to give my family a little taste of luxury when they, too, were new immigrants trying to build a life. For me, the best part of going to the buffet was always that, when you did it correctly, you felt as if you were getting away with something. We weren’t getting away with much back then: My parents were preoccupied with paying the bills; I was just hoping to survive second grade. So this was as close to abundance as we would get. We were taking our joy where we could find it, and for a while, we found it within an enormous tray of chicken fried rice.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-25", "author": ["Condé Nast", "Naureen Khan"]}