{"id": "01951ee0e5ee567eb3dae6753c854474", "url": "https://www.bonappetit.com/recipe/chicken-and-cucumber-rice-bowls", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Chicken and Cucumber Rice Bowls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueChicken and Cucumber Rice BowlsBy Kat BoytsovaFebruary 12, 20194.6(5)Read ReviewsTriangleEmailPinterestPrintPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintProtein, whole grains, crunchy vegetables, and a kick-in-your-pants sauce—yep, this packable lunch has it all. Start by roasting a big batch of chicken thighs, fennel, and scallions for dinner the night before, and use the leftovers to throw together this grain bowl.Ingredients2 servings 4leftover cooked chicken thighs (from Big Batch Chicken Thighs with Fennel and Scallions)2cups cooked rice or other whole grains½cup Sesame-Scallion Sauce2cups leftover roasted fennel (from Big Batch Chicken Thighs with Fennel and Scallions)1½cups Chile-Garlic Cucumbers¼cup crushed salted, roasted peanutsPreparationStep 1Remove skin from chicken thighs and shred meat; discard skin and bones.Step 2Divide rice among 2 airtight containers. Top with shredded chicken, fennel, and cucumbers. Drizzle green sauce over and top with peanuts.How would you rate Chicken and Cucumber Rice Bowls?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSomething about this didn't quite come together for me.  I made as part of a big batch recipe, so on night two I coated my brown rice noodles in peanut sauce (peanut butter, tamari, rice vinegar, honey, chili paste, ginger, garlic) and that really brought everything together.  Also added roasted broccoli (gotta get those crucifers, babee).  Anonymous598013/15/2019yum yum yum yum yum yum yum!!!! takes a bit to make but worth the time- just ate this at my desk and mwah! it was delish, i kept my chicken on its bone/skin on because i want the flavors Anonymousnew york ny3/5/2019Explore Bon AppétitRice and Grain BowlChicken ThighChickenPoultryRiceRice & GrainsFennelVegetableCucumberMainDairy-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}