{"id": "01d6b4301cb8fb380e2e9ec42df818bf", "url": "https://www.bonappetit.com/recipe/red-pepper-potato-and-peanut-sabzi", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Red Pepper, Potato, and Peanut Sabzi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueRed Pepper, Potato, and Peanut SabziBy Priya KrishnaOctober 25, 20194.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe classic Indian marriage of snappy, sweet red peppers and crisped potatoes gets a jolt of flavor from crushed peanuts, toasted cumin and fennel seeds, and a spritz (or more!) of lime juice. The resulting colorful, crunchy, woken-up sabzi is an easy side that you can make in 20 minutes or less. You can also double it for an excellent vegetarian main course. Even better: Warm up some tortillas and scramble some eggs, and you’ve got yourself an Indo-Texan breakfast taco party. Excerpted from Indian-ish © 2019 by Priya Krishna with Ritu Krishna. Photography © 2019 by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4 servings2Tbsp. extra-virgin olive oil1tsp. cumin seeds1tsp. fennel seeds1small yellow onion, cut into ½\" pieces1large russet potato, cut into ½\" pieces2medium red bell peppers, cut into ¾\" pieces1tsp. (or more) kosher salt¼cup roasted unsalted peanuts, crushed1Tbsp. (or more) fresh lime juice (from about half a lime)PreparationStep 1Heat oil in a large skillet over medium-high until shimmering. Add cumin seeds and cook, stirring, until they turn a medium shade of brown, about 1 minute. Reduce heat to medium and stir in fennel seeds. Add onion and cook, stirring occasionally, until translucent, 4–6 minutes.Step 2Stir in potato, then spread mixture into an even layer in pan. Cover and cook until potato is tender and not mushy (a little charring on the bottom is A-OK), 7–10 minutes. Stir in bell pepper and salt. Cover and cook until peppers are slightly softened, 5–7 minutes. Using a large spoon or spatula, scrape up the delicious charred bits from bottom of pan and stir into potato mixture.Step 3Stir in peanuts and lime juice. Taste and adjust lime juice and salt, if needed, before serving.How would you rate Red Pepper, Potato, and Peanut Sabzi?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleDelicious and easy! Served with some grilled naanAnonymous2/20/2022Super fast, tasty recipe. The spices were very fragrant which was definitely what made the dish. I added cubed tofu to the mix, which was excellent, and I would recommend it. Thank you, Bon Appetit!AbbeySouth Carolina, USA7/7/2021Surprisingly good and easy, even with  orange bell peppers and white potato. Used a bit less salt, and lemon instead of lime juice. Keeper. FranMexico 11/16/2020Surprisingly good and easy, even with orange bell pepper and white potato. Used a bit less salt, and lemon instead of lime juice. Also cashews, due to peanut allergy. Keeper.FranMexico11/16/2020This was delightful.  Full disclosure: in this shelter-in-place era of infrequent grocery shopping and limited supplies when you get there; I used sweet potatoes instead of white and completely skipped the peanuts.  This works fine as a tray bake if you don't want to tend a skillet, I found the oven method required a bit more olive oil.  AnonymousSan Francisco4/16/2020Simple, tasty & quick. Not much else to say.AnonymousToronto4/6/2020This was amazing and easy to prepare!  mikermealsChicago, Illinois1/19/2020This was amazing! It was so easy to make and so delicious. Loved the smell and taste of spices! AnonymousLithuania11/28/2019Great, quick recipe for a tasty side.  Potatoes took significantly longer to cook through than 10 minutes but still a simple preparation.  I added some chopped cilantro to finish and it was a big hit.  Will definitely make it again - though next time I'll double it to have leftovers.Northern California11/7/2019I'm shook. Priya is a legend for monetizing on Indian Americans' two-minute-lazy-af recipes. Anonymous11/1/2019Thanks Priya for introducing me to this delicious dish!  The smell of cumin seeds, fennel seeds, and onions in olive oil was heaven.Toby CurtisEhime, Japan10/31/2019I've made something similar to this sans spices and with white beans. It's great comfort food.AnonymousChicago, IL10/30/2019I made this for dinner with scrambled eggs, cilantro, and hot sauce. It came out amazing! So easy and super delicious, I'll definitely be making this again!Holly AltNew Berlin, WI10/29/2019Explore Bon AppétitIndianSouth AsianAsianBell PepperVegetablePotatoPeanutNutRusset PotatoQuickOne-Pot MealsSideVeganVegetarianDairy-FreeGluten-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-25", "author": ["Condé Nast", "Priya Krishna"]}