{"id": "01e6566f9e61f9df3122ab7557117f08", "url": "https://www.bonappetit.com/recipe/classic-herb-and-fennel-stuffing", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Classic Herb and Fennel Stuffing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueClassic Herb and Fennel StuffingBy Andy BaraghaniOctober 16, 20184.7(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf your Thanksgiving isn’t Thanksgiving without a craggy-topped, herb-infused, crusty-bread-based stuffing, this one's for you. Better yet, make two: A dish of stuffing at each end of the table will help ease the traffic jam and maximize those primo corner scoops.Ingredients8 servings 12-lb. loaf country-style bread, torn into 1\"–1½\" pieces¼cup extra-virgin olive oil2medium onions, finely chopped1fennel bulb, finely chopped4celery stalks, finely chopped½cup dry white wine1cup (2 sticks) unsalted butter1cup chopped parsley2Tbsp. chopped sage1Tbsp. chopped rosemary1Tbsp. chopped thyme3tsp. kosher salt2tsp. freshly ground black pepper2large eggs2½cups low-sodium chicken brothPreparationStep 1Place a rack in middle of oven; preheat to 250°. Arrange bread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until dried out, about 1 hour. Let cool; transfer to a very large bowl. Increase oven temperature to 350°.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Meanwhile, heat oil in a large skillet over medium-high. Cook onions, fennel, and celery, stirring often, until softened but not yet browned, 8–10 minutes. Add wine and cook, stirring, until almost completely evaporated, about 1 minute. Add butter and cook, stirring, until melted, about 3 minutes. Scrape vegetable mixture over bread in bowl and mix in parsley, sage, rosemary, thyme, salt, and pepper.ChevronChevronStep 3Whisk eggs and broth in a medium bowl to combine.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 4Pour over bread mixture; fold gently until thoroughly coated.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Divide between two 8x8\" baking dishes (you can also put it all in a 13x9\" baking dish if you prefer) and pack stuffing down.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Cover with foil and bake until you can see some bubbles around the edges of the dishes, 30–35 minutes.Step 7Increase oven temperature to 425°. Uncover stuffing and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.Step 8Do Ahead: Bread can be baked 2 days ahead; store airtight at room temperature. Stuffing can be assembled 1 day ahead; cover and chill. Bring to room temperature before baking.How would you rate Classic Herb and Fennel Stuffing?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMade for thanksgiving, and it turned out great. Added a bit more chicken broth. Would definitely make again! AnonymousColumbus, Ohio11/26/2021First time making stuffing and it was delicious- we added carrots to the recipe. The fennel gives it such a great taste!LianyNew York, NY11/26/2020Marvelous recipe and everyone loved it. I baked a small scale for family Sunday dinner and received raved reviewsGoldenTexas11/21/2020Crowd favorite!AnonymousColumbus 11/28/2019Bake temp is 350FBig JoeMontreal,Canada11/22/2019What is the bake temperature?AnonymousDurham NC11/18/2018Explore Bon AppétitStuffingAmericanFennelVegetableCelerySageHerbs & SpicesRosemarySideNut-FreeThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Andy Baraghani"]}