{"id": "01edd5394077a75e702de32d3311686f", "url": "https://www.bonappetit.com/story/the-new-oat-drink-on-the-block", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "The New Oat Drink on The Block | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe New Oat Drink on The BlockFor Espresso, Matcha, and More, Chobani Oat Barista Blend's Got You CoveredBy ChobaniDecember 13, 2019FacebookTwitterEmailFacebookTwitterEmailCabell Tice didn’t set out to be a three-time world latte art champion. He didn’t set out to work in coffee. He fell into it. After graduating high school, Tice lived in Portland, Oregon and planned to play a lot of music and got a job at a coffee shop to support himself. That job led to barista training and ultimately to a blazing career in coffee.Today, he owns his own cafe, Orchard Coffee, in Waynesville, North Carolina where his wife is the baker. The pair live upstairs from the shop along with their coon hound. Tice walks down the back fire escape daily to open the shop and at 7 a.m.and is greeted daily by his regulars. We caught him one chilly winter morning after the morning rush to chat about current coffee trends, America’s obsession with milk substitutions, and Chobani’s new Oat Barista Blend.You started working in the coffee space 10 years ago. A lot has happened in that decade. What “wave” of coffee are we in now?Waves are always funny. People say third wave. I think third wave maybe just signifies that people are trying to care a lot more about the origin and characteristics of coffee that can make it better. But, I think we’re also in the service wave. Coffee is like the side hustle to giving people good service. People are focusing less and less on saying “Here’s how you should drink your coffee” and more and more on saying “How would you like your coffee?” and serving it kindly. That’s wave 3.1 — realizing that it’s okay for customers to have it how they like it and that’s fine.What are the big trends you are seeing in coffee today?Definitely there are trends towards roasting more developed coffees. For a long time everyone was trying to go as light as possible, and just give you these very fruity, citrusy kind of acidity bomb coffees, which are great but a lot of folks don’t like that. There’s a lot of people who want something that’s chocolatier and nutty. For a long time, coffee as a whole was not really looking to provide that. It was like “we’re specialty and if you don’t like it, you don’t like specialty coffee.” Maybe the big trend is approachability.From the customer side, people are becoming more conscious of what they’re eating, what they’re drinking, and the quality of it. I think part of the overarching trend is people realizing what they put in their bodies matters. Obviously, oat based drinks are a big trend lately.What is driving the oat craze in the coffee space?A lot of folks are dropping dairy. There are more and more companies doing a great job with oat based drinks. Oats also fills the sustainability piece as well. When you look at how much water it takes to produce an almond in California, producing oats is a lot less water forward. I think oats are more sustainable, they’re more environmentally friendly to produce.In terms of substitutions to milk, oat is the new kid on the block. When did you first see different options show up in the coffee space?I think diverse options really started to enter the space probably 5-7 years ago and we started to see some barista series milks launched. They really started to take off in cafes when companies started to pay attention to the quality of it. And looking at it and saying “How can we make this alternative to milk behave a little bit more like milk?” Part of the experience of coffee in a cafe is getting something that’s textured well and looks beautiful and it still embodies that experience. If you got an oat or almond based drink 10 years ago, it was just watery and wouldn’t hold texture. Now we’re looking at alternatives that look and feel just like regular milk.The new Chobani Oat Barista Blend is definitely one of those products. What do you like about it?I think the Chobani's Barista Blend carries really well with espresso. It tastes really good. It’s not too sweet, it’s not too heavy. It’s a nice canvas that highlights the espresso or syrup. It steams almost identical to whole milk. In the process of steaming, it behaves just like regular milk and when pouring it, which is really the tell tale of a great substitution, it pours just like whole milk. In the cup, it holds really well. With the espresso it creates one homogenous liquid, which is one of the things that a good quality alternative will do — it doesn’t separate itself.What’s the most ordered drink at Orchard Coffee and how does Chobani Oat Barista Blend work in it?The most ordered drink is the latte, we serve a ton of lattes, flavored and unflavored, hot and cold. Latte as a category is by far our biggest seller.Having a great oat based alternative means that more people have a good option. I think that when oat based drinks really became a little bit more mainstream two years ago, it became something people preferred over whole milk, myself included. I prefer the lightness over whole milk any day of the week. I feel like I can drink so much more of it.What about other drinks it really pairs well with?There’s a couple of drinks on the menu that are just better with oat based drinks like the matcha latte. The matcha latte is so much better — because it’s a tea based drink — oat alternatives being water based, it kind of fits a lot more fluidly with the matcha powder. And the same thing with another favorite of ours here, which is the turmeric and ginger latte. So, golden milk with an alternative to whole milk is always better, it just tastes better. The clarity of the turmeric when you’re serving it is just next level.You’re a latte art champion, so we have to ask, how does the Chobani Oat Barista Blend work into latte art?It’s easy to make great latte art with Chobani's new oat blend. And customers want to see things that are beautiful and this as a base to that, it really works.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast"]}