{"id": "01f25e6caff0f20b7112fbe540026364", "url": "https://www.bonappetit.com/recipe/spring-minestrone", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Spring Minestrone Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpring MinestroneBy Andy BaraghaniApril 18, 20194.1(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWith leeks, fennel, sugar snap peas, and English peas, this soup is perfect for ushering in spring. While it’s definitely a lighter take on the classic minestrone, it gets a lot of depth of flavor from the ground spices, toasted garlic, and white miso.Ingredients4 servings1tsp. coriander seeds1tsp. fennel seeds½tsp. black peppercorns¼cup extra-virgin olive oil4garlic cloves, thinly sliced6scallions, coarsely chopped½serrano chile, thinly sliced (optional)22x1\" strips lemon zest2large leeks, white and pale green parts only, tough outer layer removed, sliced into ½\"-thick rounds1fennel, halved lengthwise, bulb and stalks thinly sliced, fronds coarsely chopped115.5-oz. can cannellini beans, rinsed5oz. sugar snap peas, thinly sliced on a diagonalKosher salt2cups baby spinach1cup shelled fresh English peas (from about 1 lb. pods) or frozen peas, thawed1Tbsp. white misoSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Coarsely grind coriander seeds, fennel seeds, and peppercorns in spice mill or with mortar and pestle. Cook oil, garlic, and ground spices in a large saucepan over medium heat, stirring often, until garlic is softened but not crisp, about 2 minutes. Add scallions, chile (if using), and lemon zest and cook, stirring occasionally, until scallions are softened and almost completely charred, 5–7 minutes.Step 2Pour 6 cups cold water into saucepan, increase heat to medium-high, and bring to a simmer. Add leeks, fennel bulb and stalks, beans, and sugar snap peas (pan will look crowded but vegetables will shrink as they cook). Reduce heat to medium. Add a large pinch of salt and simmer, stirring occasionally, until leeks, fennel, and sugar snap peas are fork-tender, about 5 minutes. Add spinach, English peas, and miso and cook, stirring, just until spinach is wilted, about 10 seconds; season with salt.Step 3Divide soup among bowls. Top with fennel fronds.Step 4Do Ahead: Soup can be made 1 day ahead. Transfer to an airtight container and chill.How would you rate Spring Minestrone?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleI scanned reviews which were mixed- so I made a few adjustments based on any cooking knowledge I have and what would seem to make sense.  Water base sounded boring so I made my own vegetable stock.  I know-major added step but it was delicious.  You can use ready made but the Chik'n Broth from Unbelievably Vegan by Charity Morgan is wonderful.  FYI it adds and hour. Next I ground the coriander and fennel seeds.  Chopped a bunch of garlic (not sliced), got all my veggies ready to go.  I heated olive oil and toasted the ground spices and then added the fennel, chile, snap peas, scallions, leeks, salt and sauteed until soft.  Next I added the hot stock, beans and spinach.  I forgot the lemon- I didn't need it.  This was delicious!  We ate with crusty bread and grated parmesan.  I didn't need miso because the broth had so much flavor.  I wanted to top with fresh basil but forgot that too!  Glad it didn't need the extras.  It was wonderful just as it was.  Made enough for leftovers and I have extra broth too which I can freeze for future use. Homemade broth will always make a big difference in flavor but at the very least substitute the water for chicken or vegetable broth and I think it will make a difference in the end result!  I gave 4 stars only because the recipe as written is a little flawed. MofroChicago3/16/2022This recipe has been a staple for us for a long time- we love it! I do add more miso or extra salt and it's great with other things thrown in.AnonymousDenver, CO2/2/2022Not terrible, but certainly the biggest let down from all of the bon appetit recipes i've made. Not sure how this made it on to the site to be honest. I fully agree with the other comments, this soup needs a lot of help. Yes there is something to be said for the simple flavors of leek and fennel which are enjoyable, but why use freshly ground spices if you're not even able to taste them in the finished product? It is truly like eating boiled veg in water.... chaseNew York6/23/2021Made a few improvisations after skimming the comments, not sure why some are so negative though as I’m sure it would be tasty either way - there’s something to be said for simpler flavours where you can pause and savour each of the ingredients… I think some people expect too much; I’ve rarely followed a recipe and found it didn’t need any tweaks! Anyway, I digress! I sautéed the veggies altogether until they started getting a little colour, then added the garlic, slightly extra of the spices (minus fennel seeds as we were out) and fresh chilli. I added a veggie stock cube and just eyeballed the water to the desired level. We didn’t have sugar snaps or spinach so I just chucked in extra peas (didn’t even thaw them) and some sweetcorn too. It was pretty good at this stage, but then I added a little salt, squeezed in a fair amount of lemon juice (I’m a big fan!) and zested over the top before serving, to kick it up a notch. I think next time I would do more strips of zest at the start, but this is honestly a perfectly lovely soup as long as you season to taste!DaniLondon6/22/2021Delicious! Made exactly as described (though added lots of extra freshly cracked pepper for garnish) and it was definitely NOT bland. Great spring/summer soup, filling but heavy, and looks very pretty. AnonymousSaint Louis, MO6/8/2021I love this soup so very much. It’s subtle fresh flavors are a delight; my favorite bowl of joy to take to work for lunch. It also keeps me eating healthy with a smile on my face. :-)AnnPhiladelphia5/16/2021Another review to let you know how disappointing this soup was. There was NOTHING I had tried that saved this soup and made it worth eating, which is a shame because it uses a lot of ingredients. All of the ground seasoning fell to the bottom and didn't become absorbed by the rest of the soup, in the end, it wound up stuck in my teeth with the last serving and that was about it.LeeBrooklyn, NY5/10/2021This soup was so good! Definitely going to make it again. I don't understand why people are saying it's bland, but I did add a whole serrano pepper, sliced and sauteed the dark green parts of the leeks, added in some leftover celery, and seasoned with salt throughout the cooking process. Next time I'd try swapping out the canned beans for dry, mostly because I'm not a fan of canned legumes and would rather cook my own.\n\nAlso, this recipe made SO MUCH. The soup yielded at least 8 servings.KarinaBROOKLYN, NY5/3/2021I was excited to make this but agree with other reviewers - it is unfortunately very bland. I used all freshly ground spices but it definitely needed more flavor. AnonymousIndiana3/31/2021I made this exactly as specified and it was so bland as to be demoralizing. I tried everything from extra miso, lemon juice, umami powder, bouillon, dill, and horseradish just to give it some semblance of flavor. It's impossible to believe anyone gave this more than two stars.Jane MontgomeryWashington DC3/29/2021Spring is here and I was so excited to make this but it's veggies and water...with some light seasoning. Pretty disappointed, I also wanted double the amount of liquid to veggies. I topped mine with Parm but I think a spicy chili oil topping would help give it the umph this needed. EricaBay Area, California3/23/2021Delicious soup. I have added red onions, and I didn't put crunchy peas in it, but I did add some lemon juice at the end of cooking and a handful of dill and fresh coriander.I didn't expect it to combine so well with miso. It was wow.ManaBelgium2/15/2021This is a good recipe but per other comments and dislike for fennel made a few additions. \n-added onion\n-omitted fennel\n-extra snap peas \n-squeeze of lemon at the end \n- also added 3cups vegetable broth in place of water  CraegDC12/31/2020So delicious!! made several modifications just based on what I had-- I cooked a lb of white beans in the instant pot with garlic and onion and added them at the end, and the ingredients I used in the rest of the soup were: 1 bunch of scallions, 1/2 onion, 1 fennel, 1 bunch of rat's tail radishes (chopped up small), 1/2 head of cauliflower broken into florets, 1 bunch kale (chopped), and then all the whole spices, miso, lemon zest, plus the juice of ~1 lemon at the end. Super good, and just as delicious reheated the next day!funkychicken.uglymonkeyMendocino, CA6/11/2020We got a CSA box full of greens and have been scrambling to find things to do with them - this minestrone helped us polish them off. I made it last spring as well, it's so delicious and fresh. Love, love, love. AnonymousLos Angeles5/31/2020Explore Bon AppétitSoupSoups and StewsCannellini BeanWhite BeanBeanVegetablePeaSpinachLeafy GreensSpringMainDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Andy Baraghani"]}