{"id": "01fe794b08fc6945840772c936e3bdf0", "url": "https://www.bonappetit.com/recipe/vegetarian-meatballs-with-soy-honey-glaze", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Vegetarian Meatballs with Soy Honey Glaze Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian Meatballs with Soy-Honey GlazeBy Andy BaraghaniMay 2, 20183.4(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy Baraghani, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis vegetarian dinner features a spicy soy-honey glaze that caramelizes on the chickpea-mushroom balls as they cook.IngredientsMakes 20 balls1lb. shiitake mushrooms, stemmed3Tbsp. vegetable oil, plus more for greasing115.5-oz. can chickpeas, rinsed1small red chile, thinly sliced into rounds½cup low-sodium soy sauce¼cup honey3Tbsp. unseasoned rice vinegar, divided3large eggs12\" piece ginger, peeled, finely grated2garlic cloves, finely grated½cup panko (Japanese breadcrumbs)4scallions, dark green parts finely chopped, white and pale green parts very thinly sliced⅓cup finely chopped cilantro, plus ½ cup cilantro leaves with tender stems1tsp. kosher salt, plus more2celery stalks, thinly sliced, plus ½ cup leavesPreparationStep 1Preheat oven to 350°. Working in 3 batches, pulse mushrooms in a food processor until no pieces are bigger than ¼\". Transfer to a lightly oiled parchment-lined rimmed baking sheet. Wipe out and reserve food processor.Step 2Add chickpeas to sheet and toss to combine. Bake, tossing once halfway through, until chickpeas are slightly darkened and mushrooms have shrunk and are browned, 35–40 minutes. Let cool. Keep oven on.Step 3Meanwhile, bring chile, soy sauce, honey, and 1 Tbsp. vinegar to a boil in a small saucepan. Reduce heat to medium-low and simmer, stirring frequently, until slightly thickened and foamy on top, about 10 minutes. Let cool.Step 4Pulse eggs, ginger, garlic, panko, chopped scallion greens, ⅓ cup cilantro, and 3 Tbsp. oil in food processor until fully incorporated. Add chickpea-mushroom mixture and 1 tsp. salt and pulse until no pieces are bigger than ¼\". Transfer chickpea mixture to a large bowl and chill at least 25 minutes to firm up.Step 5Oil a new sheet of parchment and place on baking sheet. Roll chickpea mixture with your hands into golf-ball-size balls (about 1½\"). Arrange balls on prepared sheet and brush with about one-quarter of spicy soy glaze mixture. Bake meatballs until firm and slightly darkened, 18–20 minutes.Step 6Meanwhile, toss celery (with leaves) and remaining scallions, ½ cup cilantro leaves, and 2 Tbsp. vinegar in a medium bowl; season with salt.Step 7Arrange meatballs on a platter and drizzle with sauce. Scatter celery salad over. Serve remaining sauce alongside.Step 8Do Ahead: Soy glaze can be made 1 day ahead. Cover and chill. Meatballs can be formed 2 days ahead. Cover with plastic wrap on a rimmed baking sheet and chill.How would you rate Vegetarian Meatballs with Soy-Honey Glaze?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleI made these for my daughter who is on her way to becoming vegetarian.  I followed the recipe exact and I think they are delicious. I am sure she will be asking me to make them again.  AnonymousRhode Island 10/23/2020I made these and they were amazeballs. But I didn't really follow the recipe. Since fresh shitake mushrooms are $$$ I used 1/3 lb fresh shitake mushrooms, 100 gm dried shitakes, and 1/2 lb brown mushrooms. I soaked the dried ones, sliced all the mushrooms roasted them with the chickpeas, and the finely chopped ginger and garlic and a generous squirt of sesame oil (a few tbsps?). Then I threw the roasted stuff in to the food processor with the green stuff and chopped to 1/4\" chunks. In a mixing bowl I mixed 3 eggs with 2 TBSP each white miso paste and tahini. Then added the chopped stuff with 1/2C gluten free panko. I founded I needed to add about 3/4 C of the mushroom soaking liquid to get it to the consistency of ground meat. I chilled it overnight, then rolled into 1 1/2\" balls and rolled these in panko. I then lightly oiled a cookie sheet with sesame oil and sprayed the tops of the balls with cooking spray. Baked at 425 F for 20 mins, turning once, until nicely browned all the way around. AnonymousCalgary, Canada9/14/2019I made a half recipe but used 2 eggs, for a slightly wetter mixture, and let it chill overnight in a bowl covered in plastic wrap. When I baked them, I set the oven to 325 instead of 350 and checked them after 15 minutes and keeping close eye on them until they were done. Previous comments made me weary of dry meatballs so I think these steps helped keep them moist and flavorful. They definitely aren't the consistency of meatballs but I really enjoyed them.AnonymousMiami5/25/2019For all the work the results are less than marginal.  The oven temp is too high, there is too much salt in the recipe, the texture is more like a matza ball than a meat ball and the sauce over the balls is burnt at this temperature. \n\nI agree that it’s too expensive, not worth the effort and lacking in flavour and texture\n\nAnonymousCanada10/25/2018I enjoyed the flavour of these, but found texture just ever so slightly lacking. I may have pulsed the mushrooms a little too much. Overall they very aromatic and the sauce is super complementary to the savouriness of the meatballs. Served rather randomly with boiled new potatoes and a quick stir fry of broccoli, zucchini and chilies because CSA boxes make us do weird things for supper - but hey the potatoes soaked up the soy honey glaze really well and everything was fantastic.toronto8/29/2018I think your oven temp or time is wrong. I followed this recipe exactly and ended up with the most dry, burnt veggie balls imaginable. I was really excited by this recipe because it seemed promising and I love the celery salad that went on top. In the end, after almost 2 hours of prep/cook/chilling time, I was humiliated by the outcome and threw half of it away. kaletherineWashington, DC5/15/2018Made these tonight. Followed recipe exactly and they came out wonderful. Very flavorful! AnonymousNY5/11/2018Andy, I followed the recipe exactly and they came out wonderful, just as you wrote it!!!RahnashahrokhMd 5/10/2018This recipe yields approximately 8 balls.  Rather expensive since the shiitake mushrooms alone were $13.16 at Trader Joes.  The garbanzos are a little dry and grainy, but overall the sweet and sour with the crunchy greens were needed for adding another layer of flavor and texture. Followed the recipe, maybe they will be better tomorrow.  I think a nice yoghurt /leben dip would have helped the dryness...Anonymous5/10/2018I am making this now but wondering what about salt?\nevatnaples fl5/9/2018Looks good. Trying to minimize grains so I was trying to figure out the overall carbs per ball. Anyone has made this that can tell me how many balls the recipe yields?  I will review again with my experience once I try it.gonzogrubLos Angeles5/7/2018This recipe IS vegetarian, but because their is egg - it is NOT vegan.\nThe other commenter is incorrect.AnonymousBeaverton, OR5/7/2018There is a one star review below from a person who says BA is “shortsighted” for posting a vegetarian recipe which contains eggs. This person clearly doesn’t understand the difference between a vegetarian and a vegan recipe. Furthermore, there are plenty of egg substitutes, both homemade and commercial that would allow someone to turn the recipe into a vegan recipe. Looks like Anonymous is the one with egg on their face ; ) AnonymousUSA5/7/2018Wanted to make these, but these are NOT vegetarian as they have eggs in them.  Boo.  And, short sighted on BA's part.AnonymousChicago5/7/2018Explore Bon AppétitMeatballShiitake MushroomMushroomVegetableChickpeaBeanEasyMainStarterDairy-FreeNut-FreeVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Andy Baraghani"]}