{"id": "0219ebd87769a1f98aab1774ed07e353", "url": "https://www.bonappetit.com/story/super-bundt-super-bowl-pan", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "No Super Bowl Is Complete Without a Super Bundt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNo Super Bowl Is Complete Without a Super BundtEven if you don’t like football, you probably like cake.By MacKenzie Chung FeganFebruary 2, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I am not what you’d call a die-hard football fan, but I know just enough trivia to make small talk with your uncle, and I do watch the Super Bowl. Sometimes it’s because I care (Colin Kaepernick–era 49ers), and sometimes it’s for the ads (Clydesdales make me emotional)—but always it’s for the snacks. Dips are my favorite food group, sustained grazing is my preferred method of sustenance, and blue cheesy Buffalo wings? To me, you are perfect, just like Jerry Rice’s performance in Super Bowl XXIII.But there’s one thing my Super Bowl spreads have been missing, and that’s a Bundt cake shaped like a neoclassical outdoor football arena that can seat 80,000. Until now. Nordic Ware’s Stadium Bundt Pan is made of cast aluminum with a nonstick finish, and the cakes that emerge are the centerpieces you didn’t know your snack boards needed. I used it to bake Yossy Arefi’s Spiced Chocolate Pumpkin Cake. The recipe, which was developed for a loaf or 9-inch round pan, yielded a smidge less batter than I needed to fill the 9-cup Bundt pan—sort of like Super Bowl XXXIV, when Tennessee Titan Kevin Dyson was tackled just short of the end zone—but the cake was still a showstopper. Plate it on a bed of dried shredded coconut for a Lambeau Field vibe.But why stop at cake! I also baked a stadium-shaped savory olive bread and filled the center with vegan queso, because I am a monster. You could make a decorative ice ring and float it in a bowl filled with Gatorade punch. Or use it as a mold for Jell-o Waldorf Salad, as wobbly as Seahawk Jermaine Kearse’s improbable catch in Super Bowl XLIX. My stadium Bundt pan provides the festive oomph my game day needs, and if I must be penalized for excessive celebration, so be it.Nordic Ware Stadium Bundt Pan$38 at Williams Sonoma$45 $33 at AmazonExplore Bon AppétitHighly RecommendSuper BowlRead MoreculturePam Baking Spray Is Sprayable Flour That Saves My BundtsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-02", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}