{"id": "022092d5200eb8f7ec454f1f080864a1", "url": "https://www.bonappetit.com/story/aileen-suzara", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Aileen Suzara Is Flipping the Script About 'Unhealthy' Filipino Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAileen Suzara Is Flipping the Script About 'Unhealthy' Filipino FoodThe food educator and activist is our first Healthyish Superpowered honoree.By Melissa Pandika March 8, 2018FacebookTwitterEmailPhoto by Peter PratoFacebookTwitterEmailWe're honoring Aileen Suzara as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. Join Suzara, the Healthyish team, and our partner Caviar at Cala in San Francisco on March 27th, or see when we'll be in a city near you.When I step into her Berkeley, California apartment on a brisk February morning, Aileen Suzara greets me with a hug. We sit at a sunlit table, a bowl of Cara Cara orange slices already waiting for me to snack on before we start cooking lunch. Since I’ve interviewed her before, I joke that she’s probably sick of me by now. “Oh my gosh! Not at all,” she says. “You must be sick of me.” She asks how I’m doing, how my writing is going. I feel like I did as a kid catching up with my sister over an after-school snack, the weight of the day melting away.Suzara, 33, brings that same warmth and hominess to her work helping Filipino-Americans reconnect with healing foods from their heritage. Her food business, Sariwa (Tagalog for “fresh”), serves healthy, vegetable-based Filipino dishes beyond the fried, meaty fare more familiar to American palates.Cooking is a major form of self-care for Suzara. Although it might entail preparing a lavish meal, “other times, I just want to put something in my belly and feel like the dish is giving me a hug,” she says. She traces her earliest memory of lugaw—the dish we plan to cook together, a rice porridge similar to congee—to her mother, who made it for her when she was 11 to soothe a winter cold. It’s an easy-to-make comfort dish that allows for ample freedom in ingredients.As I get to work peeling a claw of ginger, Suzara chops leeks, scallions, and garlic. “I’m hardcore with ginger and garlic,” she says. “When a recipe calls for two cloves of garlic, I’m like, why not two heads?”If she’s not cooking, self-care for Suzara simply means slowing down and “being extravagant about time.” Growing up in Waimea, Hawaii, she relished afternoons that stretched aimlessly, sharing food and stories with friends and family. “Empty time isn’t really empty, though,” she says. “It allows time to reconnect with our thoughts, our bodies, [and it] allows our minds to rest.”Here in Berkeley, “empty time” might mean cozying up with a fantasy novel, preferably one with a female protagonist. (One of her favorites is Monica Furlong’s Juniper, about a Celtic princess who learns herbalism and the healing arts.) “These stories are all about restoring the natural balance,” she says, “versus male-centered narratives, where it’s like, ‘Let’s destroy it!’”Suzara turns to nature to step outside herself, going on hikes and occasionally driving two hours north to Yuba River. As someone who grew up near the ocean, and whose family hails from coastal provinces in the Philippines, Suzara admits that a part of herself “is missing or dormant when I’m away from water.” Her parents immigrated to Buffalo, New York and lived in eight different states before finally settling in Hawaii in the late 1990s. They moved back to the Philippines a little over a decade ago.The components of lugaw, a rice porridge similar to congee.\nPhoto by Peter PratoWhen the leeks and scallions turn translucent, Suzara adds black and brown rice, folding in some glutinous rice for silkiness and “squishiness.” (“The technical term,” she jokes.) She explains that Sariwa came about because she’d long seen relatives, as well as community members from other cultures, suffer from diabetes and other chronic diseases, which she believed was rooted in a loss of access and connection to the land and to cultural foods. In 2015, she earned a master’s in public health from the University of California, Berkeley.  She began fleshing out the the concept of Sariwa as a culinary health intervention while still a student; it gained acceptance into La Cocina, a San Francisco food incubator, in 2016. She spent about a year there, learning the ropes of running a food enterprise and developing Sariwa, before it officially opened for business last summer.Suzara defines wellness as “having mental, physical, and spiritual balance so you can live to your full potential.” Importantly, it means others in our communities are thriving too, a perspective anchored in the Filipino concept of kapwa—a shared inner self. Racism and other forms of oppression are societal diseases that ultimately harm us all, she says. “Finding ways to uproot and heal these is also a measure of our own health and wellness.”Suzara also believes that wellness should celebrate culture, and that sharing stories about food is crucial. Relatives and others have told her about healthcare providers advising them to cut back on Filipino food, which can imply, “this thing you value, that helps tell you who you are, is making you sick.” Yet people in her workshops can often recall eating vegetable dishes growing up. They realize they already carry the ancestral knowledge needed to flip the narrative; they can eat bok choy and sweet potato leaves instead of (often pricey) kale. “If you want to change health outcomes, those are the pockets of wisdom that have to be shared,” she says.Suzara sets aside the garlic slivers, now crispy and golden-brown, replacing them with chopped Napa cabbage shoots, followed by shimeji and shiitake mushrooms. She stirs fish sauce and chopped cilantro into the lugaw before ladling it into bowls and topping it with the mushrooms, cabbage shoots, garlic, and halved hard-boiled eggs. At the table, we finish it with a squeeze of kalamansi, a small, tart citrus fruit—from a tree she received as a wedding gift—and a drizzle of fish sauce mixed with chili peppers, and lemon and kalamansi juice.The lugaw has a delicate flavor, laced with bright acidity and a subtle, herbaceous bite. By the time I finish, I'm pleasantly warm, and I’m reminded of napping on the sofa after eating my mom’s lugaw on cold, rainy days. We digest with salabat, a tea brewed with ginger, lemongrass, and honey that leaves behind a slow, satisfying burn.The meal is honest, unpretentious, and comforting—like Suzara herself. She admits to “feeling a little funny” about not having formal culinary training. “I admire the technical genius [of trained cooks], but I also hella admire lola [grandma]-style cooking,” she says. “I get the most excited when people of different abilities feel empowered about creating good, nourishing food.”“Being able to feed yourself, your loved ones, or community can be a huge contributor to wellness,” she says as we near the end of the meal. Sariwa recently launched a month-long pop-up café at UC Berkeley alongside two other La Cocina businesses, employing a handful of students. Suzara says her “dream of dreams” is to build out this concept further, housing Sariwa in a physical space and helping youth who want to reconnect to cultural foods gain skills in the kitchen. “Will it be on a college campus? I’m not sure yet,” she says. “There are a lot of exciting question marks.”Join Healthyish Superpowered to celebrate Suzara on March 27th in SF.Explore Bon AppétitHealthyishSuperpoweredprofileRead MoreLifestyleIntroducing Healthyish Superpowered: A New Kind of Dinner PartyBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-08", "author": ["Condé Nast", "Melissa Pandika"]}