{"id": "022d9eb724b31e7b52a890de52a84420", "url": "https://www.bonappetit.com/recipe/creamy-french-onion-dip", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Creamy French Onion Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCreamy French Onion DipBy Zaynab IssaNovember 23, 20214.7(32)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintThink of this crowd-pleaser as the love child of French onion soup and French onion dip: an ooey-gooey, salty, tangy Gruyère-filled dip with jammy caramelized onions. Gruyère is classic for that French onion soup flavor, but any fairly firm cheese like cheddar or Gouda will work—you can even mix and match if you’d like.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonCast Iron Skillet$30 At AmazonSilicone Spatula$13 At BA MarketBox Grater$13 At AmazonIngredients6 - 8 Servings3Tbsp. plus 1½ tsp. extra-virgin olive oil5medium sweet onions, thinly sliced5garlic cloves, thinly sliced2bay leaves½tsp. crushed red pepper flakes1sprig thyme, plus more for serving1¾tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, divided8oz. cream cheese, room temperature¾cup mayonnaise¾cup sour cream1lb. Gruyère, coarsely grated, divided (about 4 cups)Freshly ground black pepper½cup panko1baguette, sliced2pears, sliced2red endive, leaves separatedPreparationStep 1Preheat oven to 350°. Heat 3 Tbsp. oil in a large skillet over medium. Add onions, garlic, bay leaves, red pepper flakes, 1 thyme sprig, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt and cook, stirring occasionally, until onions are golden and jammy, 15–20 minutes.Step 2Meanwhile, stir cream cheese, mayonnaise, and sour cream in a large bowl to combine (a few lumps are okay).Step 3Remove bay leaves and thyme sprig from onions; discard. Transfer onions to cream cheese mixture. Add 3 cups Gruyère and season with pepper; stir to combine. Transfer dip to an 8\" cast-iron skillet or 2-qt. ovenproof baking dish and spread into an even layer with a rubber spatula.Step 4Toss panko, remaining Gruyère, remaining 1½ tsp. oil, and remaining ¼ tsp. salt in a medium bowl to combine, then sprinkle over dip. Bake until heated through and top is lightly browned, 25–30 minutes.Step 5Heat broiler. Broil dip until bubbling and golden brown, about 3 minutes. Let cool 5 minutes.Step 6Scatter more thyme over dip and serve with baguette, pears, and endive alongside for dipping.Do ahead: Dip (without panko mixture) can be made 3 days ahead. Cover and chill. Top with panko mixture just before baking.How would you rate Creamy French Onion Dip?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleGreat appetizer scalerNJ1/14/2022The very first time I made this with my boyfriend for Christmas 2021! And it came out AMAZING! We highly recommend this dip!!  AshleyNew York City1/9/2022Followed the recipe to the letter. I've been a professional chef for several years now. This for me was a hard pass. The savoury onions mixed with the cream cheese, sour cream and mayo was way too rich. As it suggested in the recipe I tired serving it with pears and apples and that was still not enough to cut through the richness. \n\nThis as a spread on a sandwich or served with charcuterie might be amazing. East coast cooksnewfoundland 12/27/2021I made this per the recipe- it is absolutely delicious!  It is definitely a crowd pleaser, and I will be looking for excuses to make it again.Susan C.Northern VA12/25/2021Made this for our Christmas Eve lunch at work, and it is fantastic.  Followed the recipe as it is written, and I have noooooo regrets.  Seriously yummy. Kris KimbleMelbourne Beach12/24/2021Out of this world! Fantastic dip for the holidays. The suggested endive, pear, and baguette was a great accompaniment to this dish. I used a mandolin to slice the onions. This certainly cut down on tedious chopping. I wouldn’t change a thing! Elizabeth PerrineCharleston, SC 12/23/2021My daughter wanted French Onion soup but when I came across this recipe from my new issue had to make it instead.  Well move over soup this dip is to delicious.  Creamy and onions aren't overpowering when cooking them to their jammy, sweet consistency! I used swiss cheese and some cheddar instead of Gruyere which can be costly for this type of dish.  Also used one less onion....make again next week!Karol GraceHammonton, NJ12/13/2021Turned our fantastic. Made 3 days ahead per the instructions. Big party hit. Don't print, save as a PDF and open as needed or Pinterest. AnonymousEarth, Denver 12/12/2021Don't print it.  Take a photo with your phone.AnonymousAvon, CT12/5/20213 pages to print! Come on now. That'a waste. MFBEarth12/5/2021This is delicious. I served it with baguette and low salt Old Dutch ripple chips. I added about 2 tbsp red wine to deglaze once done carmelizing the onions. I used 6 small to med yellow onions, about 4.5 cups sliced. I used a smaller cast iron pan and it took me an hour for the onions. I would note that if you use a 2qt dish with less surface area than the cast iron skillet the topping will be quite substantial. I used a deeper casserole dish and the topping was thicker than desired.LauraWinnipeg, MB12/5/2021This is unbelievably delicious.  Served with a baguette, sliced apples, pears and crackers.  Didn't try the endive spears but will, next time.  One prep note -- recipe says to thinly slice, which resulted in stringy onions that were hard to scoop neatly onto the bread or fruit slices.  Next time, I would chop the onions to make it easier to eat.  Worth every calorie.Creek ChefKittery, ME12/4/2021Explore Bon AppétitSnackStarterVegetarianNut-FreeDipGruyèreCheeseCheddarGoudaCream CheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}