{"id": "023d68769ec2014b6814bd99cff35e57", "url": "https://www.bonappetit.com/recipe/spring-vegetable-bhajia", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Spring Vegetable Bhajia Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueSpring Vegetable BhajiaBy Preeti MistryMarch 16, 20213.8(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintFried bhajia are a popular snack across India, and chef Preeti Mistry’s version makes the most of spring produce. They take scallions, onion, Napa cabbage, carrots, and sugar snap peas; slice the vegetables thinly (so they cook evenly); then batter and fry them until the bhajia are golden brown. “I can’t think of any food that screams Indian party food more than hot crispy bhajia,” they say.A few tips: Don’t skip the baking powder in the batter! This keeps the bhajia light, even as they start to cool off. To avoid making a soupy mess, add the flour mixture to the veg in batches, instead of dipping the veg into a wet batter. Resist the temptation to form the bhajia batter into balls, Mistry advises. Keeping the batter in flat disks lets more surface area come into contact with the hot oil, giving the fritters lots of sharp, pokey edges and crispy bits.Find more of chef Preeti Mistry’s Holi party recipes here.Ingredients8 ServingsVegetables2bunches scallions, white and pale green parts only, thinly sliced lengthwise into 1½\" pieces1medium onion, thinly sliced2cups thinly sliced Napa cabbage2carrots, thinly sliced lengthwise into 1½\" pieces1cup thinly sliced sugar snap peas2Tbsp. ground coriander2Tbsp. red chili powder1Tbsp. ground cuminKosher saltAssemblyVegetable oil (for frying; about 8 cups)2cups chickpea flour⅔cup rice flour3tsp. baking powder2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus moreScallion Chutney and store-bought spiced ketchup (such as Brooklyn Delhi curry ketchup; for serving)Special equipmentA deep-fry thermometerPreparationVegetablesStep 1Toss scallions, onion, cabbage, carrots, and sugar snap peas in a large bowl to combine. Sprinkle in coriander, red chili powder, and cumin; season generously with salt (about 1 Tbsp.). Toss again; let sit 30 minutes.AssemblyStep 2Pour oil into a large pot to come 2\" up sides; fit with thermometer. Heat over medium until thermometer registers 350°. Whisk chickpea flour, rice flour, baking powder, and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a medium bowl. Working in batches, knead flour mixture into vegetables with your hands, waiting until flour mixture is absorbed before adding more.Step 3Working in 3 batches and adjusting heat to maintain oil temperature, pull off bite-size pieces of dough (about 2\") and gently stretch out as you carefully drop into oil (8–10 pieces per batch). Fry, turning often, until deep golden brown, about 3 minutes. Using a slotted spoon, transfer bhajia to paper towels; season with salt.Step 4Serve bhajia with chutney and spiced ketchup for dipping.How would you rate Spring Vegetable Bhajia?Leave a ReviewTell us what you thinkExplore Bon AppétitFritterIndianSouth AsianAsianRice FlourFlourChickpea FlourSpringSnackSideVegetarianVeganNut-FreeGluten-FreeDairy-FreeDeep-fryEasterRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}