{"id": "0247c935293108837b2abe43a43af355", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/la-grotta-del-formaggio", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "La Grotta Del Formaggio Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverLa Grotta Del FormaggioAn old-school Italian deli on eclectic Commercial Drive for sandwich savantsFacebookPinterestTwitterEmailGrant HarderGO HERE: for La Grotta’s legendary sandwiches, some of which are large enough to feed four.ORDER THE: full focaccia with the works, grilled (unless you are alone, in which case ask for a half, grilled). Choose your own meat from the packed deli case. If you can’t make up your mind, the salami and roast beef are tops (the latter is a $2 upgrade, but you’re worth it). Yes to the pesto mayo, yes to the oil and vinegar, and heck yes to the banana peppers and pickled eggplant.THE VIBE IS: just what you’d expect from a well-established deli run by Italian immigrants for decades: no-nonsense service; shelves packed with European imports of every kind, including hundreds of panettone around Christmas; a ceiling painted to look like the sky; and a large tub of Baci chocolates next to the register.PRACTICAL STUFF: Open every day: Monday to Thursday and Saturday, from 9 a.m. to 6 p.m.; Friday, from 9 a.m. to 7 p.m.; and Sunday, from 10 a.m. to 6 p.m. Visit midmorning or slightly later in the afternoon to avoid the lunchtime rush (which includes many hungry construction workers). Hot tip: You can also call your order in!—Lindsay AndersonGrant HarderWE ALSO LOVEDon’t Argue! Very good pizza and people-watching at this casual Mount Pleasant jointDock LunchMount Pleasant’s best-kept secret for lunch and a little readingGranville Island Public MarketAll the Canadian food (smoked salmon!) under one roof Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}