{"id": "0250b2b4d904d3918716da06a4c354d0", "url": "https://www.bonappetit.com/story/indian-ish-chile-peanut-rice", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "We Can’t Stop Thinking About This Indian-ish Chile Peanut Rice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Can’t Stop Thinking About This Indian-ish Chile Peanut RiceIt’s spicy, earthy, crunchy, and tastes like buttered popcorn!By Emily SchultzApril 18, 2019FacebookTwitterEmailPhotograph by Chelsie CraigFacebookTwitterEmailAnother month, another gathering of BA editors for cookbook club! This time, we all took home a recipe from our dear friend and colleague Priya Krishna’s new cookbook, Indian-ish, and set up the next day in the Test Kitchen to share our dishes, potluck-style, for lunch.And let me tell you, there was a lot of delicious Indian-ish recipes (Priya’s name for the dishes that her Indian mother, Ritu, would make—and make up—in their American home of Dallas, TX) to try. Restaurant editor Elyse Inamine brought a vegetarian main: the addictively crunchy lotus root with sweet jammy tomatoes. They were perfect for scooping onto the pleasingly oily and slightly spicy paratha I made (I’m trying to brand myself into the flatbread girl). Assistant editor Aliza Abarbanel made the Sabudana—a peanut-lime tapioca dish, which had the consistency of mochi and was surprisingly savory! She served it with Aloo Bhujia, these crispy-crunchy fried potato noodles that are like a skinnier version of those fried wonton strips that come with Chinese takeout.But the unanimous crowd-pleaser of the day was the chile peanut rice that food editor Molly Baz made. Did we expect to be infatuated with a rice dish? No. But the minute we scooped our first bites into our salivating mouths, we fell in love. Christina Chaey politely asked for seconds. “WHY IS THIS SO GOOD?!” scream-asked Rachel Karten. “It tastes like MF buttered popcorn!” shouted Molly as she walked us through the dish, which uses leftover rice, earthy fried mustard seeds and curry leaves, almost-caramelized onions for a touch of sweetness, crunchy-toasty peanuts, and Indian green chile for some heat.Site Director Carey Polis and I ate these by the fistful.\nPhotograph by Chelsie Craig“It’s crazy to see you guys freak out over the recipes we cooked on a random Wednesday,'” Priya said, as she watched us all shovel more servings directly into our gaping maws.As we cleaned up, we agreed that we would definitely be making many of the book’s recipes part of our random Wednesdays too. They’re approachable, effortlessly vegetarian, perfect for lunch (no midday naps necessary!), and epic enough for the most colorful dinner party spread you could imagine.We didn't forget about dessert! Priya brought Shrikhand–a strained yogurt with saffron and cardamom.\nPhotograph by Chelsie CraigSo make this chile peanut rice, whatever else that calls your name, and tag #BACookbookClub so we can see what you’ve made.Get the recipe:Chile Peanut RiceLeftover basmati rice gets gussied up with earthy fried mustard seeds and curry leaves, sweet caramelized, crunchy peanuts, and spicy chiles.View RecipeBuy It: Priya Krishna’s Indian-ish, $17 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubIndianishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Emily Schultz"]}