{"id": "0259aeca0c12b2c9d0d593611eec87fe", "url": "https://www.bonappetit.com/recipe/red-cabbage-and-onion-slaw", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Red Cabbage and Onion Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueRed Cabbage and Onion SlawBy Chris MoroccoJuly 9, 20194.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintNo shade to your standard church picnic slaw, but these days we’re more into this understated variety, with just crunchy vegetables, salt, a good squeeze to soften the veg, and a splash of seasoned rice vinegar for brightness.Ingredients4 servings6cups thinly sliced red cabbage¼red onion, very thinly slicedKosher salt¼cup seasoned rice vinegar2Tbsp. extra-virgin olive oilPreparationStep 1Combine cabbage and onion in a medium bowl; season generously with salt. Let sit until they start to release their water, 8–10 minutes, then begin to massage, gently at first so they don’t break, then harder as they begin to expel their liquid, until softened to about the texture of coleslaw. Pour off all excess liquid and add vinegar and oil; toss to coat. Taste and season with more salt if needed.Step 2Do Ahead: Slaw can be made 3 days ahead. Cover and chill.How would you rate Red Cabbage and Onion Slaw?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleGreat, simple recipe with a lot of flavor.  I don't care for traditional coleslaw, but this one is delicious.  It's much lighter are more flavorful.AnonymousPortland, ME1/26/2022Great recipe, this slaw became an immediate staple at home. I have used other vinegars as well, but rice vinegar is the best for this. AnonymousSan Francisco, CA6/28/2021I make this all the time, minus the onions. The salting and squeeze out of the excess water makes the slow crunchy rather than slimy.  I've also substituted sesame oil for the olive oil for extra kick.SandyRiverside, CA6/20/2021Explore Bon AppétitSlawSaladRed OnionOnionVegetableRed CabbageCabbageLeafy GreensSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}