{"id": "0268b71c29b3a12dcebb68da4ce5a2c8", "url": "https://www.bonappetit.com/story/dependent-on-weed", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Quitting Weed Is Something I Think About a Lot But I Can't Follow Through | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Know I'm Dependent on Weed But I Don't Want to QuitI am not a moderate person, and I have no desire to be. But I might have to become one when it comes to weed.By T. WiseApril 8, 2019FacebookTwitterEmailIllustrations by Bryan FountainFacebookTwitterEmailAt my fifth grade graduation from the Drug Abuse Resistance Education program, I stepped to the podium sporting a blue button-up shirt, braces, and uneven bangs, and played the flute. I can’t remember exactly how D.A.R.E. had molded me into an eleven-year old who believed that doing drugs was a crime and a sin, but it had succeeded. Some weeks later, I caught my teenage sisters smoking weed behind our back porch during a dinner party. In a brainwashed fervor, I cried and screamed at them, “Well I hope you know you’re going to hell!”At fourteen I took my first hit, lay back, and said, “This is heaven.”Weed is complicated for me. It has been an escape, a ritual, and a medicine. And it has been a trap, a habit, and a source of pain. I’ve gone from glass bowls and bongs to grape Swisher Sweet blunts to spliffs in RAW papers. I smoke with friends and by myself, while I’m making music and while I’m watching TV. I smoke when I am sad and when I am overjoyed. I smoke a lot. I know I’m too dependent on weed, but I don’t want to quit.I roll up and relax, hoping that if inside I’m easy, nothing outside can rock me.Quitting means giving it all up, including the times when weed is a conduit for connection and creativity, an extra eye for the subtly sweet things, like Riis beach at sunset, sitting on the boardwalk, dusty turquoise benches and lavender sky, with all my favorite people, passing a joint between us. Or stuffed with homemade pasta at my parents’ house in the winter with a fire in the living room, when I step onto the back porch and smoke a spliff. Springtime on a stoop in Brooklyn, my friend and I burning one with some beats on, her freestyling like a fool and me laughing hard.But  most of the times I smoke are not necessarily special. It’s pretty easy for me to find reasons to roll up.If the morning feels bleak and I need a lift, I’ll smoke a little something. When the words won’t flow and a draft is due, I light one to get loose. Maybe it’s one of those days when my chest gets tight when I think about leaving the cocoon of my room to dive into the current of the city but I have to go to work, make money, be an adult. I roll up and relax, hoping that if inside I’m easy, nothing outside can rock me.I’ve been smoking regularly for over half of my life and I’m not in denial about the toll it takes on my lungs, my wallet, my mental health. I know that I’m much more productive without it, that I’m too quick to curl up with it as a way to avoid others, my desires, and my fears.So once or twice a year I go stone-cold sober for two or three months. Then I’ll re-engage, but with boundaries: Only smoke at night. No more than two joints. No smoking before the gym. No buying weed twice in one week. No cereal in the house, ever.These rules will last for a time, but soon I’m back to smoking multiple times a day. Going sober is an attempt to eliminate the problem without fixing it: It doesn’t make me a stronger or more balanced person. It doesn’t give me more control over my behavior.If I pour more of myself into the parts of my life that heal and feed me, I’ll have less to pour into the parts that numb and distract me.For the past two months I’ve been doing consistent crunches. Before, if I had to do any exercise that involved balancing on one leg, I would fall out of it within seconds. But after taking months to build the muscles of my core, I can finally hold the position. I can hold myself up.So what’s the crunch for my mind or my heart, to strengthen that core, so I can indulge sometimes, party and get trippy, eat my heart out, drink and sweat and spend, and still be able to return to my baseline? I want my vices to be vacations, wonderful and wild, but then I want to come back to balance. I don't want to need weed. I also don't want to need complete sobriety. I want a stronger core.“Everything in moderation, including moderation.” My father said that so much when we were growing up that I thought he, not Oscar Wilde, had coined the phrase. I am not a moderate person, and I have no desire to be. At best, being moderate feels like being average, not sure enough to go one way or another. At worst it feels like diluted truth.But maybe I don’t have to be a moderate person to achieve moderation. Maybe moderation doesn’t mean diminishing my passion or energy but rather redistributing it. If I pour more of myself into the parts of my life that heal and feed me, I’ll have less to pour into the parts that numb and distract me. I’ll have less time in my day for sitting and smoking if I use more of my time to go write at the library, bike around the park, find new music, meet with other artists, stretch and pray and light candles, cook for my friends, call my mom.If smoking is my ritual, then I need other rituals. If smoking is my therapy, I need other therapy—maybe even actual therapy. If smoking is my mood-stabilizing, anti-anxiety medicine, then I need other ways to center, quiet the negative self-talk, worry less, and enjoy more.Only then can I trust that what I do, what I smoke, is not an attempt to escape but a way to keep exploring.If you have concerns about your marijuana consumption, you can get support from the National Drug Helpline at 1888-633-3239Explore Bon AppétitHealthyishCannabisessayRead MoreLifestyleHow to Talk to Your Family About Weed This Holiday SeasonBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "T. Wise"]}