{"id": "026f751b0da65926662d81e5f46e2bce", "url": "https://www.bonappetit.com/story/diy-buckeyes", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "This Buckeye Recipe Is Sort of Like Reese's Cups, Only Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Love Reese’s, You’ll Go Wild For BuckeyesThey also make a great “I-definitely-did-NOT-forget-Valentine’s-Day” gift.By Lisa RulandFebruary 12, 2021FacebookTwitterEmailPhoto and Food Styling by Emma FishmanFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I made it through all of pastry school without admitting my dark truth: I don’t like chocolate. But there is an exception to every rule. Mine? Chocolate paired with peanut butter. I used to satisfy my cravings through impulse purchases of holiday-themed Reese’s Cups. For the record, Reese’s Easter Eggs have my favorite peanut butter to chocolate ratio (read: a very high ratio). But that was before I came across buckeyes.Sweet, salty, crumbly-yet-smooth peanut butter balls dipped in dark chocolate, buckeyes are the retro no-bake confections that taste like peanut butter cups and look like seminude chocolate truffles. Dress ’em up, dress ’em down, they’re better than Reese’s and require no baking or special pastry skills.The buckeye candy originated in Ohio (a.k.a. the Buckeye State). According to legend, sometime in the 1960s, Ohio resident Gail Tabor invented buckeyes while trying to dip peanut butter balls in chocolate. She noticed that her partially dipped confections looked just like buckeye nuts, which are shed by Ohio’s state tree and resemble chestnuts: dark and shiny dark brown, with a lighter brown top. Tabor brought her buckeyes to Ohio State–Michigan football games for years to great acclaim. The recipe eventually got out, much to Tabor’s dismay, and now we can all enjoy these tasty treats.To make a simple batch of buckeyes, get your set up in place. You’ll need wooden skewers and a cooling rack set in a rimmed baking sheet that’s lined with parchment paper (this will catch the chocolate drippings).Mix together 2½ cups powdered sugar, ½ cup plus 1 Tbsp. peanut butter (not natural, which has a higher oil content and can separate), 5 Tbsp. melted unsalted butter, 1 tsp. pure vanilla extract, and ½ tsp. kosher salt. The final texture will be a little crumbly but hold together when squeezed.Scoop a tablespoon of the peanut butter dough into your hand. Squeeze or roll the dough between your palms to form a 1\" ball. Repeat. They don't have to be perfect. Cover the peanut butter balls and chill for at least one hour, or overnight.After the peanut butter balls have fully chilled, melt around 8 oz. chopped dark chocolate (between 58% to 70% cacao) in a small bowl until smooth, stirring frequently. You want to use real semisweet chocolate and not chocolate chips. Chocolate chips contain emulsifiers and will not harden properly.Buckeyes dipped in plain melted chocolate and simply left to harden taste great. Ever the pastry chef, however, I like to glow up traditional buckeyes by tempering the dark chocolate. This process will make your chocolate extra glossy, with a satisfying “snap” when you bite into it. You can easily temper dark chocolate in the microwave: Melt ⅔ of the chopped dark chocolate (here, that’s about 5⅓ ounces) to 114°F to 118°F on an instant-read thermometer. Then “seed” the melted chocolate with the reserved ⅓ chopped unmelted chocolate, a small handful at a time, stirring constantly until all the chocolate is melted and the temperature reaches 88°F to 89°F.Whether you temper the melted chocolate or not, skewer the top of each peanut butter ball and dip it most of the way into the chocolate, leaving the top exposed.Let the excess chocolate drip back into the bowl for a couple seconds, then transfer the buckeye to the cooling rack to drain. If you like, decorate the buckeyes after you dip them in chocolate and before they harden on the cooling rack. I garnish the dipped buckeyes with flaky sea salt, like Maldon, or decorative nonpareil sprinkles or sugars.Repeat, then let the buckeyes rest on the rack at room temperature until the chocolate fully hardens, about five minutes. Remove skewers and smudge over the holes with your finger to smooth the tops. Serve your buckeyes chilled or at room temperature.This recipe calls for more chocolate than you’ll probably use because you need enough to dip all of the buckeyes. Pour the leftover melted chocolate onto a clean sheet of parchment to harden, then simply peel it off, break into pieces, and store for another use. This is much easier than having to chip away a block of chocolate that’s hardened in the bowl.I’m a non-Ohioan, non-chocolate lover not ashamed to admit I’m in love with buckeyes. And that means there’s a pretty good chance you will be too.Lisa Ruland is a recipe developer, pastry chef, and food writer living in Washington, D.C., and Brooklyn.Explore Bon AppétitIt's That SimpleChocolatePeanut ButterValentines DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-12", "author": ["Condé Nast", "Lisa Ruland"]}