{"id": "02710d2789893a3503e814abb7a89799", "url": "https://www.bonappetit.com/story/lauren-underwood", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Lauren Underwood Is Doing Her 30s Better Than Just About Anyone We Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLauren Underwood Is Doing Her 30s Better Than Just About Anyone We KnowThe youngest black congresswoman ever talks power, representation, and what self-care looks like for millennial politicians.By Hilary CadiganJune 12, 2019FacebookTwitterEmailPhoto Courtesy by R. Dione Foto courtesy of Lauren UnderwoodFacebookTwitterEmailThis story is part of the Healthyish Guide to Your 30s, our best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.This year, at 32, Lauren Underwood became the youngest black woman ever elected to congress. Since the 116th Congress convened on January 3rd, she's been kicking ass and taking names as Representative for Illinois's 14th congressional district, co-sponsoring acts in favor of wage equality, net neutrality, universal background checks for firearms possession, and amending the Violence Against Women Act to protect transgender rights and survivors of domestic violence. She's also been a consistent champion for healthcare as a human right—an issue that's personal to her as someone with a pre-existing heart condition. We chatted with Lauren Underwood about what it's like entering the big leagues early, her “millennial cohort”, and what self-care looks like for a time-strapped politician.Did you ever see yourself reaching this position so early in life?I did not imagine that I would be running for congress at 30 or getting elected at 32. But it's pretty awesome, because I'm not the youngest overall. There are five of us who are my age or younger. Obviously Alexandria Ocasio-Cortez, who's 29. Abby Finkenauer's 30. Katie Hill, who's my roommate, is 31. Josh Harder, from California, is 32. Then there's me. Plus a few others under 35. There's actually a millennial cohort! We live our best lives together, and do the work on behalf of young people who have not had a voice in this chamber—not in this way with such large numbers—ever.I'm really excited because we all come from different backgrounds in terms of geography, upbringing, lived experience, race, ethnicity, but we're united based on our experiences in the same generation. What's also great is that there are a lot of Republicans who are also millennials. It's a wonderful time to be able to do bipartisan work on issues that are so important to folks in our generation.Is it easier to do bipartisan work with younger people, thanks to that shared millennialism?Well, we all recognize that younger people are very often an afterthought in these policy conversations. It's not that it's necessarily easier to work with [millennial Republicans], but there's less fighting over partisan nonsense. We all agree that top-of-mind issues like the student loan crisis and climate change are a problem, and now we can jump over that argumentative phase and go toward a solution.Was getting elected to congress at 32 a lightswitch moment for you? Did it make you feel instantly more adult?There's something about getting your name on a ballot and going around talking about social security or Medicare solvency or real issues of national security and national defense every day that makes things serious, and not just theoretical. So I would say it's less about “adulting” and more just like, “Okay, this is the big leagues.”Thanks to all the newly elected millennials—including yourself—the average age of a U.S. congressperson dropped by a decade this year, but it's still hovering around 50. How do you deal with insecurities about your age in that environment?They give us these pins—member pins—but I wasn't into having holes in all my stuff. So I wear it around my neck as a pendant, sort of like a Jesus piece. [Laughs.] I'm always so conscious of having my pin on because the capitol police often think I'm a staffer and are very quick to tell me I can't go into certain places. So it's like, I have to make eye contact with this person and make sure they see me walking in so we don't have a problem. I think that is very much a function of being a young, black woman in a space where there hasn't been someone like me—as young as I am and probably look—ever. Every week I get stopped and told I'm not supposed to be where I am.What happens when you then say, “I'm a congresswoman”?Then it's, “Oh I'm so sorry ma'am.” This whole ma'am thing. That's weird. But yeah, you have to be firm about it, and then they realize.You've got a lot of factors setting you apart from the stereotypical congressperson: not only your age, but also your race and gender.We have the most women serving in this 116th Congress than ever before. It's pretty awesome. Fifteen years ago there wasn't even a women's restroom close to the chamber. Now we have a little ladies' hideaway where we can have a snack and catch up before we go do an interview. I appreciate that a space that was not designed for us, has now… I mean, we run it! We run the capitol! The loudest voices, the boldest ideas are coming from women—from Speaker Pelosi down to my millennial congressional colleagues. We are setting the agenda, and we are getting things done. I am over-the-moon excited.At the same time, I am a member of the Black Caucus. The Congressional Black Caucus has 55 members now. It's never been this big before, ever. We have literally the most diverse congress in history.What's been the most exciting moment so far?So, I'm a nurse. I worked on the Affordable Care Act to expand health coverage for 23 million Americans. I have a pre-existing condition and, every single day when I was running for office, I would tell my story and talk about how important it was to protect pre-existing condition coverage. And then yesterday [May 9], we passed a bill to protect pre-existing condition coverage. I got to preside over the floor of the House of Representatives for an hour and a half of debate and then for the vote, and then the Republicans on the floor of the House tried to undermine our bill. I presided over that too, and ultimately we passed the bill.You know how there are those life moments where you know you're in the right place, doing exactly what you're meant to do? I call that living your best life. And I was living my best life yesterday. I was standing there looking at my colleagues, just beaming. Because there are 360-something million people in the United States, and well over half have pre-existing conditions. We passed the bill to ensure that those people can have healthcare coverage and that it won't be jeopardized at the whim of our adversaries. It feels good to be able to do what we came here to do.I mean, do you feel like a rockstar on a daily basis? Because I think that's how a lot of us are looking at you guys right now…[Laughs.] No! But it's so nice of you to say that.So what does it feel like on a daily basis? What's the grind like?It's really hard. I give all of myself to my work every day, and I'm happy to do it, but this job is a heavy thing. You have to know about so many issues, be responsive, engage with so many people throughout the day. I'm scheduled from 7:30 a.m. to 10:00 p.m. at night. It's physically exhausting. I am knocked out on the flight back to Illinois every week. But it's worth it.How you have changed the way you eat and take care of yourself to cope with the change?Well, in the past, sometimes breakfast could have been a little flexible. Now, absolutely not. If I don't have a breakfast meeting, I'm eating oatmeal with berries and almond milk and some pistachios to get a little protein in there. That will keep you full. And my team knows I have to eat lunch. Those days when we get scheduled through lunch, it's just not good. I have to take 20 minutes to eat or I won't make it through to that evening. Dinner ends up being nothing to write home about, and that's fine, but the key is to eat three meals a day. I have a vegetable whenever I see one—which is sometimes rare—but you have to be thoughtful about it. Because if I'm not intentional about eating, drinking water, and getting rest, those things don't just happen. I can't be up all night doing my reading or catching up on emails or whatever. Not in this job.Obviously, as millennials we like to talk about self-care. Self-care is not really a thing for me right now, four months into this job. [Laughs.] But it's essential. Like, I went to spin class last week with my roommate, who is also a congresswoman. We did a little bit of accountability partnering to make sure we both got up that morning to go. It felt great.Your 30s is when you start to realize that you actually need to take care of your body.Nobody told me this, but it's like going through puberty again at 30! Your metabolism changes. It's not like you can do cereal and salad for two weeks and lose the five pounds. That stuff is just there. It's not going anywhere anymore. It's real life. I'm growing up, I guess.What advice would you give to someone entering into their 30s? How do you do it with both grace and power?Take a risk on yourself. I would not be here if I was not willing to put everything on the line to fight for my community to have better representation. That was scary, at 30 years old, to quit my job and spend all of my savings and literally travel around my community every day, talking to people in order to get elected to this position. But I did it because, one, I knew it was that important. But two, if I lost I would be able to go back to work again. And I realize I'm saying this with a lot of privilege. I don't have student loan debt; I was able to live with my family. I acknowledge that. But I want to encourage people to think about what's possible, because the consequences may not always be as severe as we imagine they would be. And the risk/reward ratio is high. So take the risk on yourself. It's worth it.Explore Bon AppétitHealthyishGuide to Your 30sRead MoreLifestyle“If I Could Do My 30s All Over Again, I'd...”By The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Hilary Cadigan"]}