{"id": "028250ac40c30f0734fa7ef1227a16f0", "url": "https://www.bonappetit.com/story/tools-to-master-every-egg-recipe", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "The 11 Kitchen Tools You Need to Master Every Egg Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 11 Tools You Need to Master Every Egg RecipeEven if you don't think the egg came first, these are the best tools for cooking them.By Zoë SessumsMarch 29, 2018FacebookTwitterEmailPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGFacebookTwitterEmailEggs might be the first food you learn how to cook, but to perfect? That takes some time. And the right tools, honestly. That scratched out old non-stick from college isn’t going to cut it for creamy, soft-scrambled eggs. The items on this list are pieces of equipment to guide you in all your egg pursuits from poaching to the crispiest fried egg around. Whatever route you want to take, these are the tools to get there.PHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGSaucepanIf for some reason you don’t yet have a saucepan, a hard-boiled, soft-boiled, or wonderfully jammy egg should convince you. Why not try out a series of tests to find your ideal boiled egg time? Then use all of the excess eggs for a big batch of egg salad.Buy It: Cuisinart Stainless Steel 3-Quart Saucepan with Cover, $51 on AmazonPhoto by Chelsie CraigMixing BowlsScramble your eggs in a mixing bowl, use one to combine your ingredients for an egg salad, and have a bowl handy for an ice bath (aka the secret to easy-to-peel hard-boiled eggs). It’s nice to have a selection of sizes and a bowl for all egg occasions.Buy It: Stainless Steel Mixing Bowls by Finedine, $25 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGNonstick SkilletIf Brad said this is his go-to egg pan, trust him. These are what he stocks in the BA Test Kitchen because their nonstick coating doesn’t easily chip off, and they make the smoothed scrambled eggs. The nonstick skillet is convenient for wet foods, and it’s especially important for achieving the perfect showstopping French omelets.Buy It: Zwilling JA Henckels Madura Aluminum Fry Pan, $50 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGSlotted SpoonThis spoon is there for you in the egg-boiling process: Lower your eggs into the boiling water and then scoop them out for their ice bath—allowing the eggs to cool in the ice bath. Slotted spoons also help in the poached egg process too. Use one to gently stir the pot of simmering water and to carefully slide in the egg.Buy It: OXO Good Grips Nylon Slotted Spoon, $7 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGWhiskSure, you could use a fork, but a whisk can make a quicker, creamier scrambled egg and is there for you to break up the yoke. Whip up your soft scrambled eggs for the most beautiful cheesy egg sandwich.Buy It: Kuhn Rikon Speed Whisk, Stainless Steel, $16 on AmazonPhoto by Chelsie CraigDutch OvenDutch ovens are a lifesaver for feeding a crowd, and a baked egg dish like this cheesy brunch number is one of those lazy but flavorful meals that only requires a bunch of eggs and your favorite additions. You can use a bunch of shredded cheese and roasted veggies in a simple breakfast-for-dinner situation or scale up a recipe like these Baked Eggs with Coconut Milk and Cilantro for a healthyish brunch. Plus, if you need to poach eggs for the whole family, a wide Dutch oven has all the space to make the process easier.Buy It: Lodge Enameled Cast Iron Dutch Oven, $74 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGSilicone SpatulaIf you’re into golden, soft on the verge of custardy, scrambled eggs, this heat-safe spatula will help you achieve the glory. If you didn’t know that scrambled eggs could exist as beautiful waves, it’s a simple life-changing endeavor.Buy It: Get It Right Premium Silicone Ultimate Spatula, $13 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGFish Spatula“The unicorn of kitchen utensils,” the fish spatula will work with you in a number of ways. From flipping hefty American-style omelets to working in a pinch as a slotted spoon to aiding you in making the most crispy, olive oil fried eggs, add this to your arsenal.Buy It: Winco 6.5-Inch Blade Fish Spatula, $6 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGCast Iron GriddleBreakfast feasters, this is for you. Maximize your stove top burners or even a campfire with all manners of eggs pancakes, bacon, and sausages—all at once! Cast-iron retains heat well and evenly, and the seasoned, non-stick surface is a great friend to the fried egg, whether you’re making two or eight.Buy It: Lodge Cast Iron Reversible Grill/Griddle, $45 on AmazonPHOTO BY CHELSIE CRAIGPHOTO BY CHELSIE CRAIGEgg TimerSometimes it's nice to take the heavy duty technology out of cooking, no beeping and buttons. I’m a big fan of the old-school egg timer. You place the timer in a pot of eggs and water—it adjusts to the number of eggs and level of water—and watch the color of the timer change. Like a mood ring, it changes by temperature. What to do with the eggs is up to you.Buy It: Norpro Egg Perfect Egg Timer, $6 on AmazonPhoto by Chelsie CraigMesh StrainerIf you want to poach your eggs like a pro, those wispy white strands gotta go. The solution is simple: Use a mesh strainer to wipe away the stray whites and achieve a perfect, bouncy final egg to top eggs Benedict, grain bowl, or fancy toast.Buy It: Ipow Stainless Steel Fine Mesh Strainer, $10 on AmazonOmelet goals:Explore Bon AppétitToolsShoppingBA RecommendsScrambled EggsPoached EggsHard-Boiled EggsEggRead Morerecipes91 Egg Recipes That We Always CraveGallery91 SlidesBy Bon Appétitrecipes35 Recipes to Make with Hard-Boiled EggsGallery35 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Zoë Sessums"]}