{"id": "0284c49046ab8101edc0a74782c57540", "url": "https://www.bonappetit.com/recipe/gochujang-sesame-noodles", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Gochujang-Sesame Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueGochujang-Sesame NoodlesBy Zaynab IssaMarch 15, 20224.8(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Dayna Seman.EmailPinterestPrintEmailPinterestPrintWhen a sauce has this many heavy-hitting ingredients—fiery gochujang, earthy tahini, umami-rich soy sauce—you don’t need to add much else. Any noodles you have on hand will work (even spaghetti) and if bitter broccoli rabe isn’t your thing, swap in your favorite hearty leafy green. For a balanced, spicy kick, Issa suggests using O’Food or Mother-in-Law’s brand gochujang.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCarbon Steel Wok$60 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonWhisk$10 At AmazonIngredients4 servings8–10oz. fresh or dried wheat noodles (such as lo mein, udon, or ramen)Kosher salt¼cup gochujang3Tbsp. soy sauce2Tbsp. light or dark brown sugar2Tbsp. tahini2tsp. toasted sesame oil2Tbsp. vegetable oil1bunch broccoli rabe, coarsely chopped4garlic cloves, finely choppedFreshly cracked black pepperHandful of torn basil leaves, plus sprigs for servingToasted sesame seeds and lime wedges (for serving)PreparationStep 1Cook noodles in a large pot of boiling salted water according to package directions. Drain and rinse under cool running water.Step 2Whisk gochujang, soy sauce, brown sugar, tahini, sesame oil, and 2 Tbsp. water in a small bowl to combine; set sauce aside.Step 3Heat vegetable oil in a wok or large nonstick skillet over medium-high. Add broccoli rabe and garlic; season with salt and lots of pepper. Cook, tossing often, until broccoli rabe stems are crisp-tender and leaves are wilted, about 2 minutes. Add reserved sauce and cook, stirring often, until thickened slightly, about 2 minutes. Add noodles and a handful of basil and toss gently until sauce clings to noodles, about 1 minute.Step 4Divide noodles among bowls and top with sesame seeds and more basil. Serve with lime wedges for squeezing over.How would you rate Gochujang-Sesame Noodles?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleVery very versatile with what you have in the pantry! \nI agree, crushed roasted peanuts are a great add. 1lbs of a protein of your choice (chicken, shrimp, tofu, etc) and doubling the greens rounds it out as a filling entree. I have swapped coconut aminos for the soy sauce, nut butter for the tahini and it was still awesome. Only hard staple to me are the gochujang and sesame oil, don't leave those out. My boyfriend LOVES this recipe. Clean plate and seconds every time.FaithHouston, TX3/22/2022Super spicy and so flavorful. I squeezed half a lime over the finished dish, rather than serve with wedges, and next time will use more lime juice. Peanuts would be a nice addition and, yes, there is so much to play with here. This was delicious. nilssonsBoston, MA3/20/2022Quick, tasty, easily riffable recipe. I added mushrooms and snap peas, could add ground pork, fish sauce, peanuts, etc. Great template for any time you want some spicy noodles! AlyssaMilwaukee 3/19/2022it's a great recipe 😋 👌 alii new jersey 3/16/2022Explore Bon AppétitDinnerMainEasyQuickWeeknight MealsVegetarianVeganDairy-FreeSautéNoodlePasta & NoodlesUdon NoodleRamenTahiniCondiments, Sauces & PastesBroccoli RabeVegetableBasilHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Zaynab Issa"]}