{"id": "028c00c3a41195a89425d83b261ef094", "url": "https://www.bonappetit.com/story/lactose-intolerants-guide", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "A Lactose Intolerant's Guide to Loving Cheese Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Lactose Intolerant's Guide to Loving Cheese AgainI loved it. I left it. And then, mercifully, I found my way back.By Amiel StanekApril 27, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailA Brief History of My Dairy-Obsessed ChildhoodFettuccine lolling about in a puddle of creamy Alfredo sauce. Piles of corned beef cloaked in melted Swiss. Chocolate-peanut butter milkshakes so thick that my eyes would bug out trying to suck them through a straw. Fondue. These were the objects of my pre-pubescent lust, and. because they were more or less off limits, I coveted them all the more.See, this was the '90s, and The War on Fat was in full effect. My mom, a nutritionist by training, was as reduced-, low-, and, no-fat obsessed as any other red-blooded American—nothing ended up in the shopping cart without a thorough inspection of the label. And, as a hungry pre-teen hanging onto a humiliating amount of \"baby fat,\" the fundamental tension of my life revolved around the stuff. I knew that food that had fat in it was fattening and made you fat. But also: It tasted really, really good. Which is where my obsession with all things creamy and cheesy came from: Rich, full-fat dairy intensely and simultaneously elicited feelings of profound, unrequited pleasure and deep, deep shame. It was Bad. And I wanted it.Chile con Queso got me feelin' some type of way.\nRestaurants were where I indulged my lurid cravings; if it was full of fat and dairy, you better believe I was going to order it. I scanned menus for different keywords—\"creamy,\" \"gooey,\" the names of various cheeses—and ordered accordingly. I learned words like \"gratin\" and \"bisque\" well before my peers, and was acutely aware of the difference between Manhattan clam chowder (cream-less, disgusting) and New England clam chowder (cream-filled, luscious).Just so we're clear, it's not like I wasn't allowed to eat these foods—my parents preached moderation in all things, and weren't going to police my decision of entree. But combine a child's nuance-less concept of nutrition with serious insecurity about my weight, and self-policing becomes even more potent than any parental decree. Eating macaroni and cheese was the closest thing this young non-believer had to sin.They also made me feel absolutely terrible every time I ate them. Within a half hour of motoring through a cheese quesadilla I would begin to feel exhausted, listless and lethargic, like I was moving through water. Then, within an hour or so, my stomach would start to knot up, and I swore that I could feel my pudgy little belly expand. And then, later...well, you get the picture. Clearly, I was being punished.For the longest time, I didn't tell my parents about my Situation because I didn't want to admit that they were right—that these creamy, \"fattening\" foods were as bad for me as everyone made them seem. But I finally admitted my discomfort to my mom after one particularly gnarly ice cream bender, and her tone was all gentle concern: \"Huh, maybe you're lactose-intolerant, sweetie.\"Lac-WHAT-and-WHAT?The Lactaid YearsThus began the next phase of my dairy journey. I now had a Problem, and like most Problems in our culture, it could easily be solved with a pill—Lactaid Original Strength Lactase Caplets, to be more precise. It was explained to me that dairy products contained a type of sugar called \"lactose,\" and that my body was doing a mediocre job of producing an enzyme called \"lactase\" that helps to digest it. Those pills contained the digestive enzyme I was missing, and so long as I took them when I was eating pizza or ice cream or grilled cheese—\"with my first bite,\" as instructed by the package—I would be free from the unpleasant symptoms that had previously dogged me. Easy! So passed my high school years—wary of dairy, but armed at all times with a sheet of individually-wrapped pills in case I cared to indulge.Fast forward to the fall of 2007. I'm a college sophomore, a vegetarian now, and studying abroad in London for the semester. Having spent the previous year living and eating in one of the school's hippie coops, and the previous summer working the line at a vegan-vegetarian restaurant in my hometown, avoiding dairy was a breeze—I stopped carrying The Pills altogether. But the situation across the pond was dire. My three friends and I shared a two-bedroom flat in a rather derelict and far-flung part of East London, and we were broke. Like, B-R-O-K-E broke. None of us had ever lived on our own in a city before, and, without regularly scheduled Moosewood-approved meals available on the daily, feeding ourselves was proving a challenge. So we got creative.Across the PondThere were two free food opportunities that presented themselves to us on the regular, both of them dairy-full. The first was the bowls of thick yogurt and too-sweet granola that were often sitting around in the college's student center, leftovers from some breakfast meeting or lecture. I would down a bowl before classes and, on occasion, pack myself up a second bowl to eat after. The second were day-old sandwiches from the fast-casual chain Pret a Manger. When each store closed at the end of the day, they would leave a loosely knotted—and otherwise clean!—black trash bag full of the day's unsold product out on the curb. We would casually pace the block of an unsuspecting Pret location around sunset like burglars casing a bank, and, when the trash bag appeared, we descended on it like wolves. There was really only one sandwich I was ever looking for: \"Mature Cheddar and Pickle,\" a simple-enough combination of the sharpest, crumbliest cheddar cheese I had ever tasted, lettuce, tomato, onion, mayo, and a sweet-tart spread called Branston Pickle. I would squirrel away as many as I could find into my backpack and take the long tube ride back to Limehouse feeling like a true Urban Forager.Hunger being the best sauce and all that, I found both the yogurt-granola situation and those weird trash sandwiches to be completely, indescribably delicious. And it wasn't until I had spent a solid month with those two things making up the lion's share of my daily caloric intake did I realize that, despite the fact that my diet had gone from mostly dairy-free to almost entirely dairy-based, I felt, inexplicably, completely fine. I mean, depressed and alienated and lonely and sad, but, hey, at least not painfully gassy! A confusing blessing, but a blessing nonetheless. Had I cured myself of my Affliction? Was there no lactose in the UK? I didn't know why all of this was OK, but I wasn't going to interrogate a good thing too rigorously.The EpiphanyFast forward another six months. I'm back on campus and, having spent the better of the fall holed up in the library reading cookbooks and fantasizing about different things that I wasn't eating, I am full-on, head-over-heels-in-love with food. I meet one of my early culinary mentors, an on-again-off-again student, who schools me in the dark art of fermentation. We mix gloopy sourdough starter with flour and water and watch it miraculously bubble and spring to life; make batches of sauerkraut and kimchi and kombucha in hardware store compound buckets; and talk about fermenting things with the kind of obsessive fervor that I imagine other men our age reserve for college sports. He lends me a dogeared paperback copy of Sandor Katz's seminal DIY fermentation book, Wild Fermentation to read. And, one night, stoned in bed, close-reading Katz's book like it was one of the postmodern novels I was supposed to be analyzing, I finally figured out what had been going on.There they were, two sentences at the end of the intro to a chapter on fermented dairy products: \"If you avoid milk because of a lactose-intolerance, you might give cultured milks a chance. Lactobacilli consume lactose in milk and transform it into lactic acid that may be easier for you to digest.\"It was as if a lightbulb had gone off in my head. I pulled an all-nighter reading everything I could find on the Internet about fermented dairy and came to at least a rudimentary understanding of what fermentation meant in the context of the category of foods that I had such a complicated relationship with. For Lactobacilli and other friendly microorganisms, lactose is their food, and they convert it into lactic acid, the substance that makes yogurt sour and funky aged cheeses tart. I thought back to my yogurt-and-aged-cheddar diet of the previous fall and how shockingly non-existent the symptoms of my lactose-intolerance were when compared to earlier, excruciatingly unpleasant encounters with cream-based soups and ice cream sundaes; the former category of dairy products were fermented, almost free of the lactose that caused me distress, and the fresh, unfermented ones in the latter camp were full of the stuff.The ReunionIt's been nearly seventeen years since I first heard the words \"lactose intolerant,\" and my relationship with dairy is the healthiest it has ever been. I ate a small bowl of creamy, full-fat yogurt with a sprinkling of granola for breakfast this morning, and I feel great; I also know that if I had substituted that yogurt for a pour of cold whole milk, I'd have had a stomachache by the time I got to the train. I know that hard, dry, long-aged cheeses—Parmesan, Grana Padano, manchego, aged cheddar and the like—go down easy (and are incredibly delicious), while milky, fresh cheeses like ricotta, mozzarella, burrata, and cream cheese make me feel awful, even if I still indulge from time to time. I've learned that sourness and tartness is a fairly reliable gauge of whether or not a dairy product will agree with me—more acidity means more Lactobacilli, and more Lactobacilli means less lactose, and less lactose means me walking away from a cheese plate happy and feeling fine. Perhaps unsurprisingly, taking an active interest in the same category of foods that once filled me with such anxiety turned out to be a far more effective solve than simply taking a pill. Though I'd be lying if I said that I don't still have a few Lactaid pills stashed in my tote bag at all times—sometimes you just want a slice of pizza, you know?Explore Bon AppétitHealthyishCheese WeekRead MoreLifestyleWhat IS Nut Cheese, Exactly, and Can't We Call It Something Else?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-27", "author": ["Condé Nast", "Amiel Stanek"]}