{"id": "02a1475cb88227ef74e61a7df95e308d", "url": "https://www.bonappetit.com/story/john-mackey", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "John Mackey: 'We Were Just a Bunch of Young Hippies Selling Food to Other Hippies' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle'We Were Just a Bunch of Young Hippies Selling Food to Other Hippies'Whole Foods' CEO John Mackey on building his natural-food empireBy Ali FrancisDecember 19, 2018FacebookTwitterEmailPhoto courtesy of Whole FoodsFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to John Mackey, co-founder and CEO of Whole Foods Market.Most corporate success stories paint a picture of the selfless grind—long nights in the office and time-spent with loved ones forgone for the greater good of The Company. But on any given weeknight, at least these days, you’ll find John Mackey at home in his kitchen cooking a vegan dinner for his wife; steaming vegetables and whipping up some kind of nutty sauce, most likely.“To be fair, our office is on top of one of our flagship stores in Austin,” says Mackey, the co-founder and CEO of Whole Foods Market. But the point is, after 40 years slinging good food, his heart is still behind the movement he pioneered. “It's not just the hours spent working,” he says. “It's about purpose for me.”The day I met Mackey on the Whole Foods Gowanus roof, some 90,000 of his employees had just received a significant pay rise. It’s thanks, he says, to adopting Amazon’s notorious operating efficiencies. (Mackey sold Whole Foods to Amazon for $13.7 billion in 2017, and has since lowered prices twice storewide.)But regardless of a healthy cash-out for Mackey, he says the chain he helped start out of an old Victorian house in Austin had humble beginnings. “We weren't MBA students with a strategic plan that we were trying to execute,” he explains. “We were basically a bunch of young hippies selling food to other hippies.”Here, we chat with Mackey about building something from nothing, finding and following your higher purpose, the old-fashioned power of learning on the job, and the 50-cent breakfast he swears by.What motivated you to start Whole Foods?When I was about 23, I moved into this vegetarian housing co-op in Austin. I wasn't a vegetarian when I moved in; I was just interested in all things counterculture and I thought I'd meet some really cool people in a vegetarian co-op.Did you meet any interesting people there?I actually met my ex-girlfriend, Renee, there. We were together five years and she was one of the co-founders of Whole Foods. But when I moved into the co-op, I got interested in all things natural and organic. I learned how to cook, and became the food buyer for the co-op.How did that formalize into something bigger?I didn't know it at the time, but I’d found the purpose of my life. I got super turned on about it, very enthusiastic, and I went to work for a small natural food store in Austin. I came home one day to the co-op and said to Renee, \"What do you think about opening up our own store?\" And she thought that was the coolest idea.Wow. What if she had rejected the idea?I often wonder. Whole Foods might not exist.What came next?We opened the first store, called Safer Way, inside an old Victorian house. We had the store on the first floor, and a café on the second floor, and Renee and I lived on the third floor. We were very idealistic, so it was strictly vegetarian. Even our cat was vegetarian. We didn't sell sugar. We didn't sell white flour. We didn't sell alcohol. We didn't even sell coffee or tea. And the result of that was we just didn't do very much business. [Laughs.]What did you learn from that experience?We realized that we needed to open a bigger store that would be accessible to more people. So we merged with another natural food store back in 1980 and moved into a much bigger location. It was 10,500 square feet in the heart of Austin but only about a half a mile from Safer Way. And we sold meat and seafood and coffee and alcohol.Did you feel like you were compromising on your personal values by making those changes?No. After two years of being in the wilderness, what we were hearing from customers over and over again, was, \"I'd shop here more if you sold this.\" I realized, in an unsophisticated way, that we were not meeting people where they were. I was ready to open it up.Was that an important business lesson?In business, you have to meet the market where you find it, not where you think it ought to be. If you want to be in business and you just want to do your own thing and ignore everybody, you're probably going to fail. You've got to evolve. And you've got to adapt to the marketplace that you find.So what happened after you opened that first store in 1980?Within a few months it was the highest volume natural foods store in the United States. It just exploded.Were there any hiccups?We built our store in a hundred-year flood zone. I was told, \"Look, if you're in the hundred-year flood zone, about once every hundred years there's going to be a flood that's going to put your store under water.\" And I calculated it. I was like, “Once in a hundred years, those are pretty good odds.” But in fact, nine months after we opened the store, Austin had its worst flood in 70 years. And our store was completely under water. Renee closed that night and she literally had to swim out. We were able to rebuild but realized we were better off in another store. So we opened a second and third pretty quickly.Did you ever raise any money?Eventually, in 1989, we raised enough venture capital money to get us to California. The reality is that venture capital was not well developed in the mid to late '80s. We sold 34 percent of the company for 4.5 million dollars. That original valuation of 8 or 9 million would probably have been over $100 million today.So, after opening a bunch of stores in California, did you run out of money?Yeah. The investors wanted to do another round of VC financing but that would have given them control of the business, and I really didn't like the venture capitalists. Their goals were not synced up with ours long-term. And I knew they really wanted to secretly get rid of me because I was an outspoken hippie and argued with them all the time. So I got rid of them by taking the company public in ’92.Could you ever have imagined when you started out, that Whole Foods Market would become this prolific?I'm pretty sure when I was in my twenties, if somebody had said, “This is your destiny,” I would have run away. It would have been way too scary.How did you learn to deal with that fear?You grow into things. You grow as a leader. You grow as a person. Things you didn't think you were capable of, you become capable of as you get more experience. And Whole Foods has been through so much good and bad over the years. I've learned a lot. Plus, I'm very fortunate to have an amazing team—Whole Foods has always attracted really talented people to work with us. I always say, “You're no better than your team.”So, you’ve been in this business for 40 years. I don't know many people that stay in something for so long. Why?It's the purpose of my life. I'm very clear on my own higher purpose in life—what I'm here doing—and I haven't finished with it yet. I'm getting older so there will come a time when it's done, but not yet.How is your recent cookbook a reflection of that purpose?Just imagine for a moment that you know how to solve the healthcare crisis. You know how to help people lose weight. You know how to reverse Type 2 diabetes. You know how to reverse heart disease. You know how to prevent, for most people, ever having cancer. I felt I could help, and this was a bucket list thing. I had to write this book. I had an ethical obligation to write this book.If you could only choose three favorite recipes from the book, what would they be?Okay, the pesto linguine with lots of greens is a good starter. You can make that really quickly. The pesto is not going to have Parmesan cheese in it, but it's going to have nutritional yeast instead. Another one is my one-pot veggie loaded chili. The chili is such a powerful flavor that the vegetables take that flavor on. I consider those really good for people who are trying to make this transition to eating more vegetables. And my third is literally any of the smoothies.What are your own kitchen essentials?A selection of herbs and spices, for sure. Because they can make anything taste pretty good. I'm always going to have whole grains and dried beans because they'll store really well. And starchy vegetables—I really love sweet potatoes.Being vegan, what about any ‘replacement’ products?Kite Hill cream cheese is the best.What’s your go to breakfast?I generally have one of two breakfasts. When it's cold, I'm cooking up steel cut oats, which I soak overnight. I travel with a little mini rice cooker. So I put my steel cut oats in before I go to bed, and then when I get up in the morning, I flip the switch. I have it with unsweetened almond milk and a little bit of raisins and blueberries.People must laugh at this.[Laughs.] Yeah, but how much does it cost? It costs about 50 cents. And it's super, super delicious and healthy. I never get tired of it. But most of the time Austin has warm weather, so probably nine months of the year I'm making smoothies in the morning.Are you an almond or a peanut butter person?The honest truth is that I use almond butter more often because I think it's healthier. But I really like peanut butter.How do you stay active?I bicycle and swim, but mostly I love to hike. I'm a long-distance hiker. I've hiked the Appalachian trail twice. And my wife's a yoga teacher. So I do some yoga. But definitely not to her standards.Over the years have you had anyone, a mentor or a friend or family member, give you some advice that has stuck with you? That you find yourself coming back to?The single best piece of advice that my father gave to me is to “follow your heart.” That has stuck with me, and I’ve built my life around this piece of advice. Follow your heart. Be true to yourself. Most people choose security and want to be safe. But life’s too short to do anything but what you're really passionate about.So, if it’s not money, how did you define success all these years?I don't measure it. I don't think about it. America is somewhat obsessed with success. It's very interested in fame and money and power. I'm not driven by those things.Buy it: The Whole Foods Cookbook: 120 Delicious and Healthy Plant-Centered Recipes, $18 .All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitGroceryEntrepreneurs Run the WorldHealthyishInterviewsRead MoreLifestyleGlory Edim on How Eggs Fuel Her Mornings and How Stories Change the WorldBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-19", "author": ["Condé Nast", "Ali Francis"]}