{"id": "02a16000236b73287f7b0479f9c44fc6", "url": "https://www.bonappetit.com/story/trash-fish", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Don’t Call ‘Em Trash Fish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDon’t Call ‘Em Trash FishConsider the wolf eel, and three other species to start loving now.By Alex BeggsSeptember 19, 2019FacebookTwitterEmailIllustration by David BiskupFacebookTwitterEmailDOWNER ALERT: Our love for salmon and other overfished species is—you knew this already—ruining the ocean. Solving this gigantic problem is more complex than this, but hey, let’s do the best we can. You, individual eater with good intentions, can do the planet a teeny tiny favor and order the weird fish instead. Or support a local fishery and embrace the luck of the catch. Chef Jacob Harth of Portland, Oregon’s Erizo, might love the weird fishes most of all. He cooks “stuff we catch on accident,” as in little guys who get scooped up in crab traps (wrong place, wrong time, little guy!). Here are a few recent favorites, lesser-known and lesser-loved creatures found along the Oregon coastline that Harth showcases in delicate, beautiful bites in his stellar tasting menu.Illustration by David BiskupWolf EelRich, fatty, and flaky-like fish—because it IS a fish. The eel thing is a misnomer. Wolf eels are objectively hideous, with huge molars from crushing crabs. But wolf eels mate for life, so clearly someone’s into it. When one gets caught in a crab trap, Harth steps in. He smokes it and serves it in a spread, like whitefish dip. “We can use one fish for the whole weekend because it yields 70 to 80 servings,” he says.Illustration by David BiskupButter ClamA big, tender Oregon boy as creamy as his name suggests and sweeter than any scallop you’ve ever had. Harth serves it almost like ceviche, with lemon and olive oil. “It’s the most special thing we have here; it’s like nothing else,” he says. “The fact that it’s not in every restaurant here is baffling.”Illustration by David BiskupShield LimpetScraped off a rock just for you, this tiny, briny abalone (ahem, snail) is firm and perfect for grilling with a spritz of lemon. Harth tells me it tastes like chicken, but I think he’s joking.Illustration by David BiskupGooseneck BarnaclesThese guys are ugly as sin but taste like LOBSTER, with a texture that starts off chewy “like a rubber band” and then melts in your mouth. Harth has a license for harvesting them and serves them at the restaurant nearly every week. Kind of a big fan.Do you like freaky fishes? Follow Chef Jacob Harth on Instagram and see them pop up in your feed when you least expect it. Like huge, flabby oysters. Something called “monkeyface eel” and “spotted nudibranch.” Don’t say I didn’t warn you.Read more about buying sustainable fish hereExplore Bon AppétitPortlandFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Alex Beggs"]}