{"id": "02b93b0cd1eef79c3bdb3bd09e055d1a", "url": "https://www.bonappetit.com/story/emma-straub-thanksgiving-tradition", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "My Family’s Thanksgiving Tradition? A Complete Disregard For It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Family’s Thanksgiving Tradition? A Complete Disregard For ItHow I learned, one turkey at a time, to accept that we were never going to get it together.By Emma StraubNovember 17, 2018FacebookTwitterEmailIllustration by Amrita MarinoFacebookTwitterEmailIt took me until I was almost 30 to realize how jealous I was of other people’s family holidays. Blame Instagram, blame Martha Stewart, blame my friends who are best friends with their siblings and whose parents have Famous Recipes and whose nieces and nephews have slumber parties. To paraphrase Tolstoy, happy families are all the same on Thanksgiving, and it took me until well into adulthood to realize that my own happy family was an exception to that rule: We had somehow missed a memo on calcifying our traditions, and I was bummed about it.When I was a kid Thanksgiving was all about the balloons. I grew up four blocks north of the American Museum of Natural History, around which the Macy’s Day Parade (as we called it) inflated its enormous, unwieldy Snoopy and Superman balloons on Thanksgiving eve. The following morning all the floats and high school marching bands would line up along Central Park West, with Santa’s sleigh, the very tail of the parade, sitting vacant at the end of our block. Sure, we had turkey, but the food was secondary to the girls with batons and the costumed professionals holding a 65-foot Kermit on a string. My mother, a former high school cheerleader who will be horrified to have that fact printed in a magazine, is still very much an enthusiast, and she liked nothing more than to stand along the sidelines, shouting along with Al Roker or whoever was the grand marshal, imploring each balloon to “Join the parade!”True to form, the most meaningful childhood Thanksgiving I remember has nothing to do with food or family—just the parade. It was the year that the New Kids on the Block were on one of the floats. (If you’re too young to bring up a mental image of the New Kids on the Block in, say, 1989, imagine haircuts like atomic bomb explosions, blousy silk shirts, and elaborate leather jackets.) I was so stunned by seeing them in person—just feet away from me, not on MTV—that the moment their float passed by, I became a black hole of tween misery for the rest of the day. Pity the parents who had to cajole me into enjoying the stuffing. It’s a metaphor for a holiday: so much buildup, so much excitement, and then the crushing realization that it’s a day, just like any other, that will be over in a few hours, and nothing more. Existential dread fueled by tryptophan.“Once we came loose from the mom-dad-kid-kid structure, we were\nsearching for the thing that made us feel like the cast of a Nancy\nMeyers movie, wearing white and unafraid of stains.”My parents both come from small far-flung families, so holidays were never about the gathering of a tribe. Then my brother left for college in California, and coming home for the Thanksgiving holiday quickly proved ridiculous—cold weather, two days, jet lag. It didn’t make sense, and what for? For some turkey? And so for the last half of my life, Thanksgiving has been, well, sort of higgledy-piggledy. Once we came loose from the mom-dad-kid-kid structure, we were searching for the thing that made us feel like the cast of a Nancy Meyers movie, wearing white and unafraid of stains. It took me a long time to realize that there are a lot of us who feel that way, like we missed the orientation at proper adulthood and so we’re still flailing around in the dark while everyone else trusses and bastes with ease.When my husband and I got together, I was 22 and he was 24. Mike had just moved to New York from Florida, and I was the only native he knew. The first\nThanksgiving we spent together, we went with my parents to their artist friends’ loft on Cooper Square in the Village. We ate a butternut squash soup and marveled at the jars full of colorful gumball-size casts of the sculptor host’s head and teeth. I think that’s when Mike knew he wasn’t in Florida anymore. That was the first time we’d been guests on Thanksgiving, which felt a little bit like taking a vacation: very nice and also not what you want to do forever.The following year we went to Mike’s parents’ home in the mountains of North Carolina. The air was clean and brisk, the view was mountainous and lovely, and civilization was an hour away. Mike’s stepfather, a man who feels about condiments the way my mother feels about parades, was very excited to show us how to fry a turkey, which he did in their garage because it was too cold to do it outside, and doing it inside the actual house is a very good way to set said house on fire.The four of us—Mike, his parents, me—dutifully stood in the garage while his stepfather slowly lowered the bird into the vat. It looked like a coffee urn in a deli except filled with boiling peanut oil. There were crackles and fizzes. Nothing exploded. Mike’s stepfather let the bird settle into the pot, then took off his oven mitt.“Cool,” said Mike, or something close.“Okay then,” said his mother, or something close, and rubbed her hands together. They both turned around and headed back into the house, Mike’s mother to continue to cook the rest of the meal and Mike to do what so many young adult men do when in their mother’s house: get horizontal on an over-stuffed piece of furniture and take intermittent breaks to graze on whatever food is in sight. It seemed awfully rude to abandon someone with a turkey, especially cruel with the (albeit low) threat of disaster. Plus, I was still trying to endear myself to my future in-laws. I stayed put.“You’re my turkey-frying buddy,” Mike’s stepfather said, verbatim. (Satisfyingly, I know this because he still says this to me on a regular basis.) We stood in the garage drinking glass after glass of very good California Chardonnay for the duration of the frying, which, if I had to estimate, took three hours, and which cemented our affection forever. (Fried turkey is delicious and not to be discounted.) Nevertheless, when it was time to go back to New York, we knew that mountaintop Thanksgivings weren’t for us.We moved to Madison, Wisconsin, where I went to graduate school. We got married. (Small Thanksgivings with imported parents, transient in nature.) We moved back to New York, to a small house that had an actual dining room, where we hosted Thanksgiving for a raucous group of people, including several butcher friends of ours. If the food industry is famous for a hard-living, liver-ruining sense of fun, butchers should be at the top of the fun pyramid. People drank so much that one young (adult) guest vomited! It was a thrill, but too wild, truly, for our dispositions. The next year we’d just finished my book tour and came home the day before Thanksgiving. We ordered Thanksgiving takeout, which was nearly as good as having made it at home, only minus the leftovers, which everyone knows are the best part. I found out I was pregnant with our first child the next morning.“Now we were going to be someone’s parents, and therefore all\nforthcoming holidays would be a part of the Official Record. We had to\nget it together.”And that’s when it happened: the realization that we were two (about to be three) people who, despite our genuine affection for corn pudding, brussels sprouts, and pie, were unmoored. Before then I hadn’t minded the haphazardness of our planning because in a way it had felt like we were still just kids ourselves, and anything we did was a pretty good effort. Now we were going to be someone’s parents, and therefore all forthcoming holidays would be a part of the Official Record. We had to get it together.For the past decade we’ve hosted. The guest list changes from year to year. We always have to ask our butcher friends how to properly cook the turkey. But the important thing is to have guests who will adapt to your life changes. One fun year, pre–Official Record, our friend Stephin brought pot brownies, and my father had a neat little pile of them, rendering him somewhat narcoleptic but pretty happy about it. The year after we had our first baby, Stephin brought earplugs. For everyone.The more people came, the less we had to cook, which was delightful. I think it’s a good holiday when you realize that you left at least one dish in a half-complete state in the fridge—a tart unbaked, onions uncaramelized—and that it didn’t matter because there was already more than enough. Very few people show up to Thanksgiving expecting to have their mind blown, and so the bar is actually nicely low.When I was eight months pregnant with our second child, we moved to a new house in mid-November and hosted anyway, though we got the whole meal from Poppy’s, our excellent local caterer, cooking only the turkey and dessert. Stephin brought packaged chocolate bars. No one cared. The key, I think, is to have enough guests that not everyone can easily fit around the table, which means that people can choose their own adventure. Informal, as gluttonous as one prefers, like a cocktail party, but with a mostly untouched bowl of cranberry sauce.This past year—like so many of the Thanksgivings this decade—was a first for us. This time we had recently opened Books Are Magic, a bookstore in our Brooklyn neighborhood of Cobble Hill, our seven-month-old (retail) baby. We had a full house at home: both sets of grandparents, Stephin, his boyfriend, Stephin’s mother, our friend Tyler, and the rambunctious children, who are hard-pressed to sit at the table for a whole meal any day of the week, let alone when the house is exciting and full of people and there are cakes and pies and cookies in sight.Mike wanted to go and open the store. “No,” I said, clearly moved by the spirit of generosity and friendliness. Our staff had the day off, and our customers certainly expected us to be closed. But then we already had all the grandparents in the house, no doubt watching the parade on television, which meant that it was possible for us to sneak out for a few minutes. We walked the ten minutes to the store, greeting people on the street as we walked. People with small children still need the twice-daily trips to the playground, regardless of holiday or weather. At the store we unrolled the side gate and shimmied our way in the door. We weren’t inside for more than two minutes before someone walked by and asked if we were open.“It feels almost transgressive in the age of social media to admit\nthat things aren’t going exactly the way you planned, that there’s\nroom for improvement.”“Yes!” Mike said, so thrilled to be asked. “What are you looking for?” The man was in search of L’Appart, David Lebovitz’s memoir of living in Paris, and just like that, we were open, at least for one customer. What was he doing for Thanksgiving? He was visiting family, knocked out of his routine, and needed a book. And we were there. Mike was right: It felt good to be a small part of someone else’s day.The holidays are built up with the pressure of perfection and an audience both real and imagined. But isn’t this kind of the point of a day like Thanksgiving? To be a little more luxurious with your time? As I tell our five-year-old when he whines that his brother’s ice cream sandwich is lasting longer than his, you need to have an attitude of gratitude—even if it’s just acknowledging that my holidays are never going to be as perfect as other people’s, and I’m grateful for that. It feels almost transgressive in the age of social media to admit that things aren’t going exactly the way you planned, that there’s room for improvement.Someday, when the boys are bigger, we’ll take the train uptown the day before Thanksgiving and herd together with all the other tourists to watch the giant balloons get inflated, slowly rising from their rest. Garfield, Pikachu. There will be some from my childhood, and some we can’t identify, and somehow there will already be characters that my sons have loved and gotten over because everything starts earlier than we think. What will my kids remember about the holidays, I wonder? They eat Parmesan off the rind. They want dessert first because they know what’s what. Someday, they might even try the turkey.Emma Straub is the author of the novels Modern Lovers and The Vacationers.\n \n For more Thanksgiving long reads:Rembert Browne Thanks God for Black ThanksgivingMichael Chabon Reminds Us That Thanksgiving Is Where the Meal IsThanksgiving at Patti Smith’s HouseRead MorecultureIf You Need Something Done on Thanksgiving, Ask My GrandfatherBy Amanda ShapirocultureHow Cranberry Sauce Became a Staple of My Indian ThanksgivingBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-17", "author": ["Condé Nast", "Emma Straub"]}