{"id": "02be9a04734bd3c313ad8320221e4e8d", "url": "https://www.bonappetit.com/story/zojirushi-food-thermos", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Zojirushi's Sparkly Food Thermos Has Inspired Me to Pack My Own Lunch Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingZojirushi’s Sparkly Food Thermos Has Inspired Me to Pack My Own Lunch AgainGone are the days of lukewarm soup.By Esra ErolMarch 1, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When I have absolutely zero desire to cook, I can always count on soups and stews to nourish me. They’re hearty and delicious, usually come together in less than an hour, and turn out an abundance of leftovers. That said, unlike pasta or a classic PB&J, soup doesn’t travel very well in snap-lidded food storage containers, even if they claim to be leakproof. And after I found a thick pool of soup at the bottom of my tote (note: always invest in a waterproof lunch bag), I realized it was time to level up to something mightier.A quick internet search led me to Zojirushi’s stainless-steel food jar. I literally gasped, reader. How could I not have thought of Zojirushi sooner? I swear by its travel mugs—BA tested and approved. Zojirushi applies the same vacuum insulated technology to its food jars, which makes sense because these are the very same geniuses who dared to ask, “What if our rice cookers could sing?”Like the travel mug, Zojirushi’s food thermos is wonderfully uncomplicated. It comes in various sizes (12 oz., 17 oz., and 25 oz.) and five colors (shiny pink is my personal favorite). The tight-fitting lid minimizes leaks—my very scientific, very aggressive shake test yielded no spills—and the wide opening allows for easy pouring and cleaning. Bonus: The SlickSteel finish repels stains, which means even if you opt for a pastel-colored thermos, you need not fear chili oil stains from your chicken and rice soup.Photograph by Isa ZapataZojirushi Food Jar$39 at Amazon (25 oz.)$27 at Amazon (12 oz.)What really sold me on this particular thermos is that it retains heat for six—count ’em, six—hours. I preheated the food jar with hot water (Zojirushi recommends this for optimal heat retention), dumped the water out and poured in some hot soup, twisted the lid nice and tight, and let it sit on the counter. Six hours later, the soup had dropped from a starting temperature of 200 degrees to a perfect-for-slurping 140 degrees. Imagine my delight when I ate a spoonful of curried lentil tomato soup and it was neither burn-your-tongue red-hot nor tepid. It’s ideal for commuters who don’t want to queue for the splatter-stained office microwave or for hikers who crave something other than a cold protein bar for lunch.If you, too, are sick and tired of lukewarm liquids and you don’t want to deal with the microwave and dishes, I recommend Zojirushi’s food thermos. There’s something delightful, nostalgic even, about opening a pearlescent pink thermos and eating oatmeal or soup directly from the container. Kinda makes you feel like you’re sitting down at the table in your elementary school cafeteria, ready to enjoy a meal made by your mom.Soup’s on:Explore Bon AppétitHighly RecommendCultureShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-01", "author": ["Condé Nast", "Esra Erol"]}