{"id": "02bf2ac08a01ae19d13f60b169ab31f2", "url": "https://www.bonappetit.com/story/pampas-grass", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Pampas Grass Is the Hearty Floral Brightening Up My Apartment This Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHouseplants May Wither But This Pampas Grass Is EternalIt’s very pretty and basically unkillableBy Aliza AbarbanelMay 1, 2020FacebookTwitterEmailPhoto by @calma_floralFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Like many people, I've turned to plants to brighten up my cloistered living situation. A precious bouquet of goofy, sunny daffodils didn't make it through the week—but at least the feathery pampas grass perched on my kitchen counter is basically eternal. The dreamy dried grass doesn’t require any watering to stay fresh, making it a favorite of florists like Robin Hilleary of Fleurotica, who deployed psychedelically-dyed pampas to camp up New York City restaurants like Basque taverna Ernesto's and Mina’s inside MoMA PS1.Of course, I spotted plenty of the striking Seussian plumes on Instagram too. After a few days of lusting over the cheerful, technicolor bouquets, I called in the experts to figure out how to make my own arrangement at home. It turns out that unlike ephemeral daffodils and tulips, pampas’ longevity makes it an excellent candidate for at-home arrangements. Bonus: You don’t need a flower market hookup to get started, and those of us with extra time on our hands can even tackle the dyeing... with a bit of expert assistance. Here’s what to know before getting started.Go rogue...or go to the crafts storeWild pampas grass is an invasive, spiky-stemmed species often found by beaches. Do what you will with this information, but bring thick gloves and gardening shears...or check a local flower market, craft store, or Etsy.Live in technicolorPampas grass grows white or pink, but don’t let Mother Nature get in the way of your imagination. There’s plenty of dip-dyed pampas grass available online (at a higher price tag than the au naturale stuff), and it’s surprisingly simple (albeit messy) to DIY.Elizabeth Jaime, owner of Calma floral studio in Miami (and a former BA photo editor!) dunks pampas in Rit clothing dye, opting for highly-impact hues like purple, blue, and red. Be sure to use a big color-safe container to submerge the entire grass, and leave it submerged until you reach your ideal hue: a few hours for light pastels, or overnight for deeper tones.Ward off waterUnlike most plants, water is the enemy here. Whether you’ve dyed or left the pampas as nature intended, hang it upside down overnight to dry out any remaining moisture. Fluff with your fingers or a blow dryer in the morning, then spritz with hairspray to prevent shedding.Mix in live and dried blooms“I experiment with switching out fresh blooms on top of the pampas so the arrangement feels fresh but has less waste,” says Hilleary. Try botanicals with contrasting textures, like stiff palms and waxy anthurium, and put the stems in a cup of water inside the vase to keep the pampas dry.It’s possible to add lots of height and depth with only one grass—just prepare for a little surgery. “When I use pampas with fresh flowers, I'll break up a piece of pampas grass into smaller pieces and add it around the arrangement to create a feathery texture,” says Jaime. She carefully pulls tufts off the central stem, then attaches them to the stems of live flowers with rubber bands or wire for a floaty, fanned out effect.Buy it: Pampas Grass, $15All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreCoronavirusI Ordered Two Bags of Dirt, and a Week Later I Had MushroomsBy Toniann FernandezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast", "Aliza Abarbanel"]}