{"id": "02c0ff56b5b7af2cf3453898dfae0488", "url": "https://www.bonappetit.com/recipe/braised-chicken-and-spinach-soup", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Braised Chicken and Spinach Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBraised Chicken and Spinach Soup with Pita ChipsBy Chris MoroccoMay 21, 20184.4(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintMolokhia, a braised chicken and greens dish popular in Lebanon and Egypt, inspired this riff on chicken soup. The citrus notes of cardamom and coriander lend brightness to the broth, and a one-two punch of salt and acid by way of crunchy pita chips and pickled red onion finish the dish off.Ingredients4 servings1small red onion, thinly sliced2Tbsp. fresh lemon juiceKosher salt2Tbsp. extra-virgin olive oil2Tbsp. unsalted butter1large yellow onion, thinly sliced4garlic cloves, thinly sliced8green cardamom pods, lightly crushed1tsp. ground coriander¼tsp. crushed red pepper flakes1large bunch mature spinach, trimmed, or one 10-oz. package frozen whole-leaf spinach, thawed1lb. skinless, boneless chicken thighsSteamed white rice and pita chips (for serving)PreparationStep 1Combine red onion, lemon juice, a large pinch of salt, and 2 Tbsp. water in a small bowl. Let sit until ready to serve.Step 2Heat oil and butter in a large saucepan over medium until butter is melted. Add yellow onion and cook, stirring occasionally, until very soft, 8–10 minutes. Add garlic, cardamom, coriander, and red pepper flakes and cook, stirring occasionally, until very fragrant and garlic is softened, about 4 minutes. Add spinach a handful at a time, stirring constantly and letting each batch wilt before adding more (if you’re using frozen, add all at once and cook until heated through). Add chicken and 2 cups water. Bring to a simmer over medium-high heat. Reduce heat to medium-low and simmer gently, stirring occasionally, until chicken is cooked through and shreds easily, 35–45 minutes.Step 3Transfer chicken to a cutting board and shred into large pieces with 2 forks or spoons; season with salt.Step 4Divide chicken, greens, and broth among bowls. Mound a big spoonful of rice over and top with drained pickled red onions and crushed pita chips.How would you rate Braised Chicken and Spinach Soup with Pita Chips?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis a solid, not too complicated, soup for a cool evening. A few modifications I made folks might want to try. I used chard out of the garden rather than spinach. I'm a bit mystified at adding spinach (or chard) so early in the braise. One, it's hard to fish the chicken out from around the greens and two, they are really overcooked. I added them 5 min before the chicken was done, but I will probably add them with the shredded meat and cook for 5-7 min next time. As recommended by another reviewer, I added 3/4c of brown lentils when the chicken went in and did without the rice. I also used chicken stock rather than water. As as recommended by others, I doubled the spices and added 1 1/2 tsp of (New York Shuk) harissa when the shredded chicken went back in. It brightened it up.Eric W.Durham, NC1/30/2022Lovely bright soup for a chilly spring day. I subbed mushroom broth for water and added a half cup of brown lentils - fab! AnonymousMontreal5/3/2021This was one of the best things I've ever made. I doubled the recipe and used a whole chicken instead of breasts. I divided the chicken into parts, browned the skin and used the rendered schmaltz to cook the onions and spices. When the chicken was done I pulled it out and let it cool before pulling apart. Then I strained out the spinach into a bowl, and used an immersion blender to emulsify the schmaltz on the surface into the soup. Added everything back in and served with the pickled onions!! sbangsPortland, OR7/1/2020Great stuff as usual Morocco!  I just added allspice and a little bit of cumin extra. \n\nBut so yum. Thanks! TheCrookCookEGYPT12/1/2019I doubled the spices because I thought it was bland otherwise. The garnishes save it.AnonymousAtlanta 2/18/2019A super delicious, easy, and quick go-to weekday meal that satisfies the flavor palate. I found that 3 cups of water rather than 2 cups worked best. AnonymousChicago1/21/2019This is delicious! Soul-satisfying, and also totally wholesome. Don't skip the pita chips on top.AnonymousNew York 11/26/2018Explore Bon AppétitSoupSoups and StewsSpinachLeafy GreensVegetableChicken ThighChickenPoultryCardamomHerbs & SpicesEasyOne-Pot MealsWeeknight MealsMainNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-21", "author": ["Condé Nast", "Chris Morocco"]}