{"id": "02d19d685583e60d6c3c90a69c53e8f1", "url": "https://www.bonappetit.com/story/chef-raymond-li", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Jail Time Threatened to Ruin Raymond Li’s Future, But the Kitchen Gave Him a Chance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJail Time Threatened to Ruin My Future. Only the Kitchen Offered Me a ChanceChef Raymond Li of Miami’s acclaimed Palmar tells his story. By Raymond Li, as told to Clarissa BuchDecember 4, 2019FacebookTwitterEmailPhoto by KARLI EVANSFacebookTwitterEmailBefore Raymond Li became executive chef at Palmar in Miami’s Wynwood Arts District in 2018—the same year Bon Appétit named it one of its top 50 nominees for America’s Best New Restaurants—he spent time behind bars at Florida State Prison. But as he tells it, he might not have made it to where he is today if the kitchen hadn’t been the only place willing to hire him—a young man with no professional experience and felonies on his record. Now, after saying goodbye to his post at Palmar in October, Li is gearing up on a restaurant concept of his own, scheduled to open in Bogota, Colombia, in 2020. Here, the chef looks back on his past experiences and toward the future ahead. —Clarissa BuchI never wanted to be a chef—cooking was just something I had to do. Growing up in Miami, when my parents worked long hours, I cooked for my younger brother, Bruce. I must have been about 10 years old, and though we were raised in a Chinese-Cuban-Colombian household, I stuck to preparing “easy” things like steak and onions, eggs and ham, and omelets.But once I got involved on the streets, it all took a back seat. Money was tight for my family, so in high school selling Xanax and weed seemed like a good idea. Before graduation, it turned into transporting large amounts of cocaine. I never made a decision to become part of a gang. I was a product of my environment and my surroundings. Things took a turn one night at a party, though. I got into an altercation with someone who pulled a gun and pointed it at my throat. Seconds before he was about to shoot, one of my friends drove by and scared him off. I got away, but later on I decided to take matters into my own hands. I drove by his house and fired 11 shots out of my 9 mm Smith & Wesson. [No one was injured.]By the morning, nearly a dozen officers and a handful of detectives surrounded my parents’ home in Kendall, a suburban area in southwest Miami. Guns blazing, they arrested me and charged me for the drive-by shooting. I was already on probation, so I was given no bond. It was bad. Really bad.I spent about a year away in what’s known as the original Florida State Prison, located in a small town called Raiford. It’s in the middle of nowhere, in between Gainesville and Jacksonville with a population of 200 or so people, not including the correctional facility. My time consisted of making a lot of “gulas”—a common word used in prison to describe a stew-like mix of different commissary items, like corn chips, mayonnaise, sausage, and ramen noodles—inside my cell.Once I was released, my mom fell ill with liver disease. Even if I wanted to get back onto the streets, I couldn’t. I was too busy traveling to and from Colombia, where she was living, to take care of her. That’s when I started a side hustle meal-prepping for a family friend’s business that catered to individuals who wanted to reach a certain weight or fitness goal. I was cooking basic things, like chicken breast with broccolini in soy glaze. There was something therapeutic about it, and it wasn’t long before the guys I worked with on the line started to tell me I wasn’t half bad either. That’s when I decided to take it up a notch and accept a kitchen job as a busser at a mom-and-pop operation called Cool de Sac in Hallandale Beach, Florida, which at least got me in the right environment. It wasn’t necessarily the most glamorous, searing tenderloin and smashing together paninis in the back, but it set the stage for what was to come. The Venezuelan family who ran it took a chance on me. Looking back, I can’t really tell you why they did, but I’m eternally grateful for it.No one—and I seriously mean no one—had wanted to give me a job. I applied to every place I could, from the dry cleaners to the dollar store, even auto shops. Yes, I have felonies on my record, but I know who I am: I’m not a bad guy. I’m not who I was as a teenager. In the end, the only place that would even give me the smallest chance of changing my life was the kitchen.The reality of the industry is that most places, at least where I worked, don’t conduct background checks, which is how I got my “in.” Once I’d worked in a few different restaurants, I realized the heat and adrenaline rush of working on the line was enough to keep me going. After spending time at Cool de Sac, I knew the only way I’d ever reach a higher level was to attend culinary school.Of all the schools here in Miami, Le Cordon Bleu has the biggest influence, which was important to me because of my past; I felt like it could help me outshine my record. I know some people think enrolling in school isn’t worth it, but it was for me, and with the help of financial aid and a few loans, I was able to make it work. Culinary school was the first time I took my education seriously. It wasn’t just about getting by.Li manning the stove at Palmar.\nPhoto by KARLI EVANSJust before graduating in 2016, I came across a job posting for the Ritz-Carlton hotel in Bal Harbour. I applied and scored a gig making the daily amuse-bouche. That’s when I discovered my own unique flavors, blending my Chinese and Latin American descents. Looking back, I recognize how lucky I am to have landed that job—and to have been given the kind of creative freedom cooks fantasize about. The chef just believed in me and that was enough to bring me onto the team and let me run free.From there, cooking took me to restaurants around the world. In Miami, I worked at Zuma and then Matador Room by Jean-Georges Vongerichten under Top Chef winner Jeremy Ford. I shadowed the kitchen at Benu in San Francisco. I spent two months in Paris at L’Atelier de Joël Robuchon. By 2018, I returned home and started working at Palmar, a Miami-inspired Chinese restaurant in the Wynwood Arts District. Here, I make all sorts of things that draw inspiration from my heritage, from duck confit dumplings with pickled ginger and five spice aioli to Sichuan sirloin, to smoked duck rolls. During my first year as executive chef, the restaurant was named a Top 50 nominee for America’s Best New Restaurants by Bon Appétit and earned a four-star review from the Miami Herald. Like many chefs and kitchen workers, I didn’t get into this business for the awards and recognition. I found refuge and a career through cooking. The rest was just a bonus.It’s funny, though: I’ve realized the kitchen has some similarities to the streets. When working in great kitchens, there’s always the jealous guy, the hater. It’s competitive, but my past has shaped me to be tough: I know better than anyone that nothing will be harder than escaping the world I was in. Cooking has also become the creative outlet I never knew I needed. My inspiration never runs dry because I take a little something from the kitchens I’ve worked in, my past experiences (yes, even prison), and the different foods I ate with my father and mother growing up.And now—I can’t believe I’m saying this—I’m getting ready to design my own restaurant, with direction from one of the most talented Latin American chefs, Juan Manuel Barrientos Valencia. He’s dined at Palmar before, and I expressed to him how I’d love to open my own place. A couple months later, he approached me about making that fantasy a reality.I can’t exactly describe how I feel about the transition. I’ll always love Palmar. It was difficult for me to say goodbye, but it’s necessary for my growth. It feels good knowing my hard work and innovation in the kitchen has been recognized to the point that someone would want to invest in my own restaurant. It’s also an acknowledgement of how I’ve evolved as a person and how the kitchen saved my life. This is a chef’s dream come true.But now the work begins. I can’t say much about what my restaurant will be, but what I can share is that it will be an approachable fine-dining Asian concept. The first one will open in Bogota, and then we’ll see where it takes us. For now, I’ll bounce between Washington D.C. to help open Valencia’s second U.S. outpost of his El Cielo chain; Colombia, to get my own restaurant off the ground; and Miami, where my son is. Though his mother and I split up about a year ago, I make it a point to remain as close to him as possible.In fact, Liam recently turned one, and he’s already picking up pots and pans while I cook. It reminds me of when I was little, and stood under my father as he prepared dim sum or roasted pigs in our backyard.The magic of cooking is what I want to share with my son. I don’t want him to cook out of necessity. I want him to know that, if nothing else, he has a life worth living and a future worth working toward—whether it’s in the kitchen or not.Explore Bon AppétitFirst PersonRestaurantsChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-04", "author": ["Condé Nast", "Raymond Li", "As Told To Clarissa Buch"]}