{"id": "02d6b4afc5032caf52d584b3e7626ecd", "url": "https://www.bonappetit.com/recipe/jerk-turkey-shepherds-pie", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Jerk Turkey Shepherd’s Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueJerk Turkey Shepherd’s PieBy Tiffany-Anne ParkesOctober 20, 20204.1(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“There’s no Thanksgiving spread like a Jamaican Thanksgiving spread,” says Pienanny chef-owner Tiffany-Anne Parkes. “When I was growing up, we’d have one table laden with traditional savory dishes like curry goat, rice and peas, and jerk chicken, and another full of pies for dessert. Things are different this year, so I’m making one dish that incorporates an entire feast. Hibiscus cranberry sauce, inspired by my mom’s holiday sorrel drink, tames the heat of the jerk turkey; pie crust stands in for the island's doughy fried festivals; lime-zested mashed potatoes go on top. Like Jamaica itself, this is a mash-up of cultures and flavors and ideas—all together in one delicious savory pie.” Because the pimento wood that is used as a cooking surface during the traditional Jamaican smoking and jerking process is scarce, it is almost impossible to produce true jerk in the United States. Here, we use smoked paprika as well as cloves to help create the smokiness that is essential to the jerk tradition.Ingredients8 - 10 ServingsBrine1cup Diamond Crystal or ½ cup plus 4½ tsp. Morton kosher salt1large onion, chopped6garlic clovesA small handful of thyme sprigs3bay leaves23\" cinnamon sticks1¼cups jerk marinade (about 10 oz.; such as Walkerswood)112–14-lb. turkey, neck and giblets removedDough1¼cups all-purpose flour¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt6Tbsp. vegetable shortening, cut into pieces, chilled3Tbsp. chilled unsalted butter, cut into piecesPotatoes3lb. Yukon Gold or russet potatoes, peeledKosher salt1cup half-and-half½cup (1 stick) unsalted butter2tsp. finely chopped thyme1½tsp. finely grated lime zestFreshly ground black pepperTurkey and assembly2Scotch bonnet chiles, pierced a few times with a paring knife1tsp. ground cloves1¼cups jerk seasoning (about 10 oz.; such as Walkerswood)1cup (2 sticks) unsalted butter1–1½cups low-sodium chicken broth or waterAll-purpose flour (for surface)½tsp. smoked paprikaHalf-and-half (for brushing)Hibiscus Cranberry Sauce (for serving)PreparationBrineStep 1Bring salt and 4 cups water to a boil in a 16-qt. pot, stirring until salt is dissolved. Remove from heat and add onion, garlic, thyme, bay leaves, cinnamon sticks, and marinade to pot. Chill, uncovered, until cold, about 1 hour.Step 2Add 6 quarts cold water to pot and carefully lower in turkey. Place a heavy plate on top of turkey to keep it submerged. Cover and chill at least 12 hours and up to 1 day. (The turkey will be more moist and flavorful if you let it brine the full time.)DoughStep 3Mix flour and salt in a large bowl with a fork to combine. Add shortening and butter and toss to evenly coat. Working quickly and aggressively and using a pastry blender or 2 forks, press into dry ingredients until pieces of butter and shortening are about the size of a dime (the idea is to smash the butter into the flour, creating some pieces that are flat and thin and some that are large and chunky). Drizzle 1 Tbsp. ice water over mixture and stir in with a fork. Knead dough gently in bowl until it comes together (it will still look a little dry).Step 4Turn dough out onto a work surface and knead 1 or 2 more times, pressing to incorporate shaggy edges. Press into a disk about 1\" thick and wrap in plastic. Chill at least 1 hour.Step 5Do ahead: Dough can be made 1 day ahead. Keep chilled, or freeze up to 1 month.PotatoesStep 6Place potatoes in a large saucepan and pour in water to cover by at least 2\"; season generously with salt. Bring to a boil, reduce heat, and simmer until a paring knife easily slides through flesh, 25–35 minutes. Drain potatoes and let cool slightly.Step 7Meanwhile, bring half-and-half and butter to a simmer in a small saucepan over medium heat.Step 8Cut potatoes in half lengthwise. Pass potatoes through a ricer or food mill into a large bowl. (If you don’t have either, gently mash in bowl with a potato masher.) Pour in half-and-half mixture and mix well. Stir in thyme and lime zest; season with pepper. Set aside.Step 9Do ahead: Potatoes (without thyme, zest, and pepper) can be made 1 day ahead. Let cool; cover and chill.Turkey and assemblyStep 10Line a large rimmed baking sheet with 3 layers of foil; set a wire rack inside. Remove turkey from brine and transfer to a plastic cutting board; discard brine. Pat turkey dry inside and out. Place, breast side up, on rack and tuck wings underneath. Let sit at room temperature 1 hour.Step 11Purée chiles, cloves, and 1 cup jerk seasoning in a blender. Transfer chile mixture to a small bowl; set aside.Step 12Melt butter in a small saucepan over medium heat. Add remaining ¼ cup jerk seasoning and whisk until smooth, about 1 minute. Remove from heat.Step 13Place a rack in middle of oven; preheat to 450°. Wearing disposable food-grade gloves to protect your hands from chiles, gently separate skin from breast meat starting at neck. Spread chile mixture over breast meat underneath skin, then smear remaining chile mixture all over outside of turkey. Tie legs together with kitchen twine and pour 1 cup broth into baking sheet.Step 14Roast turkey, rotating pan halfway through, until skin is mostly golden brown, about 30 minutes. Reduce oven temperature to 300° and continue to roast, brushing with jerk butter every 30 minutes and adding ½ cup broth to pan if liquid evaporates, until an instant-read thermometer inserted into the thickest part of breast registers 150°, 65–85 minutes longer. Skin should be deep golden brown and lacquered-looking. Transfer turkey to a cutting board; let rest 2 hours. Pour juices from pan into a heatproof measuring glass.Step 15Let dough sit at room temperature 5 minutes. Roll out on a lightly floured surface to a 10½\"–12\" round (1½\"–2\" wider than pan). Place dough in a 9\"-diameter pie pan or 10\" cast-iron skillet; lift up edges, allowing dough to slump down into skillet. Trim any overhang and crimp edges as desired. Chill until ready to use.Step 16Carve turkey and shred meat. Measure out 5 cups (a mix of light and dark meat is good); save remaining meat for other uses. Arrange meat evenly in dough. Pour just enough pan juices over turkey to moisten (be careful not to oversaturate or your crust may be soggy). Mound potatoes over meat. Using a wet butter knife or spoon, spread to edges, covering meat completely. Using a fork, create decorative ridges in potatoes and sprinkle with paprika. Brush dough with half-and-half. Bake pie until crust is golden brown, 35–45 minutes. Let cool 15 minutes. Serve with cranberry sauce.How would you rate Jerk Turkey Shepherd’s Pie?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleLove, love, love this recipe.  This was my second year in a row making this for Thanksgiving (Canadian) and Xmas.  It was so good, I grew Scotch Bonnets from seed just because I couldn't find them fresh.  I stuck dutifully to the recipe, and also struggled with finding instructions for temp and time for the pie.  I used Anonymous NYC, NY's suggestion for this, however I found it best when I didn't parbake.  Thank you Tiffany-Anne Parkes for sharing this fantastic dish.AnonymousVancouver, Canada10/12/2021This was so delicious! I made a vegetarian version with lots of root veggies (parsnips, carrots and turnips marinated in jerk seasoning overnight) plus onions, garlic, celery and more ginger. Sautéed everything and made a gravy with more jerk seasoning & a couple cups of veg broth, much like a pot-pie filling.  I did use a different pie crust recipe as I needed two crusts, but the structure and texture of a crust was the perfect base. I think the pie baking instructions are missing from this recipe. I set my oven to 425 and pre-baked the crust for 5 min, then filled & topped, and baked for 35-40 min rotating once for even color.\n\nThe lime-zested potatoes and hibiscus cranberry sauce are not to be missed! Two of us gobbled up this whole pie in just two days. Will definitely be making again (though probably with store bought crust as that’s the most tedious part for me).AnonymousNYC, NY12/8/2020Coming here to put some respect on this recipe because it really did make our humble dinner feel a little extra special. The turkey came out perfectly moist and the brine did exactly what it was supposed to do. Next time I make this, I'll do two things differently -- add a little bit of extra jerk seasoning or marinade to the turkey with the juices, and possibly do a partial pre-bake on the pie crust. Mine was not dry at all, but didn't really come to a golden bake at 300. I ended up increasing the temp toward the end of baking to get a golden finish. I am wondering if the recipe is missing the final bake time, but I'm also in a high desert so that could have something to do with it. Overall, a fantastic recipe -- don't be intimated by all the steps, it's manageable if you pace yourself!Ari H.ABQ11/28/2020Made this for thanksgivng and it was a huge hit!  I made a small change by adding some flour to the juices and turning them into gravy, we saved the extra and I'm glad because that little extra moisture was a nice addition, and the gravy holds the spice and flavor of the dish more than the turkey.  I thought the pie shell was delicious and added a ton to the dish, though I would maybe double the recipe because it was hard to get it to fit the skillet, and certainly didn't leave any to make pretty edges with.  I'm surprised that this isn't spicier.  the walkersons jerk sauce is sooo good.  But we only had one jar of it so had to supplement some with a far less flavorful jerk sauce.  ALl in all i love this and would make it again.  Anonymousnyc11/27/2020I agree 100% with Lori B. The pie crust was too dry and contributed nothing to this dish. The turkey is awesome though. Next time I will make a casserole with a layer or stuffing, a layer of the jerk turkey, and a layer of the lime zested potatoes. Might be a bit too traditional, but I’ll be pouring gravy on top next time too.Dan EWilmington DE11/26/2020This is a super complicated recipe, but the flavor of the turkey is amazing! The good news is, there's no reason to make it as written. The crust recipe proportions weren't correct (it was super dry and needed more fat/water), but leave it out! It's unnecessary and doesn't mesh with the other flavors. \n\nInstead, make the turkey, carve, and serve it with the mashed potatoes and the sublime cranberry sauce on the side. Lori BChicago, IL 11/25/2020I really was expecting more flavor from this recipe. It was a lot of work to make from brining and cooking the Turkey to the assembly of the crust, shredding the meat and making the mashed potatoes. I loved the hint of lime in the potatoes and would make and eat these as a side dish in the future. Maybe it needed a vegetable mixed with the jerk Turkey?\nThe good news is that there is an extra 5 cups of Turkey meat left over to use in other recipes!RcmartoneHouston, TX 11/21/2020Explore Bon AppétitSavory Pie & TartTurkeyPoultryPotatoVegetableRusset PotatoYukon Gold PotatoMainNut-FreeThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Tiffany-Anne Parkes"]}