{"id": "02d70f12c5e0224951187836b7f4e7f6", "url": "https://www.bonappetit.com/story/patagonia-meal-kit", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "I Eat These Camping Meals Even When I’m Not Camping | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Eat These Camping Meals Even When I’m Not CampingPatagonia Provisions meal kits are perfect whether you’re on the go or on the couch.By Ali FrancisDecember 7, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are eating, drinking, and buying right now. Next up, Ali Francis makes the convenient case for Patagonia’s camping meals. For me the worst part about camping trips is camping food: Shriveled old meat sticks, sandy protein bars, handfuls of bland almonds. By day 0.5 I’m over the novelty items and craving real sustenance. Which is why, in advance of a recent glamping adventure in the Grand Canyon with my boyfriend, I ordered one of Patagonia Provisions’ 2-day camping meal kits for two. Photo by Isa Zapata2-Day Camp Meal Kit For Two$76 at Patagonia ProvisionsFor $76 you get a box filled with enough food to last two adults for 48 hours. It’s a mix of lightweight, shelf-stable, and easy camping meals and snacks that, in classic Patagonia fashion, are all responsibly sourced and designed for life outdoors. Think portioned packets of fruity porridge for brunch; seasoned grains like lentil soup and mushroom kamut; tins of mackerel and smoked mussels; baggies of savory seeds in iconic chip flavors like Chipotle Lime and Classic BBQ; fruit and nut granola bars; and, the pièce de résistance, a huge hunk of cooked and vacuum-sealed wild sockeye salmon. To prepare the dry goods, you need a pot (or two), heat (a camp stove or campfire), potable water, and some optional groceries—maple syrup, fresh produce like oranges and bell peppers, cheddar cheese—if you want to zhuzh your Patagonia staples into meals like cheesy polenta and red bean chili, seafood paella, and whole grain pancakes (laid out in the included booklet full of easy camping recipes). S'mores not included.In the end, my forward-thinking could not prevent a weather catastrophe. Two days before we were supposed to arrive at the Canyon, a pesky, volatile snow storm popped up on the radar—a major Buzz Killington to our plans. At the last minute we decided to forgo the camping and reroute our car full of backpacking gear and trail mix to the nearest budget hotel. While my boyfriend mournfully surfed the cable TV channels—an unhappy camper—I opened the Patagonia Provisions box and set to work making us an easy meal of green lentil soup in the microwave. I topped our bowls with a packet of Patagonia’s toasted Mellow Curry seeds, a dollop of supermarket Greek yogurt, and a side of baguette that I’d originally bought for a romantic fireside date. And let me tell you, this humble bowl of rehydrated legumes came together in 10 minutes flat and had us muttering glass-half-full-isms like, “It’s actually kinda cool to see the Canyon in snow!” and “Now that I look closer, those carpet stains are totally not blood!”Finally, the sun came out. We filled our Camelbaks with the remaining snacks—smoked mussels, Inca Berry bars, and lunch containers of mushroom-y grains—and hiked below the snow-dusted rim. The views were amazing and all, but the main takeaway from that botched glamping trip was that Patagonia’s meal kit is for more than just camping. Sure, everything inside is designed for roughing it: The meals and snacks are filling, affordable, packed with flavor, and easy as pie to make. But those are qualities that are just as useful during a busy work week, a period of cooking fatigue, a quick Airbnb stay, or a spate of inclement weather as they are on an action-packed outdoor adventure. Back home it’s become the MVP of our pantry.On the nights I’m too stressed or tired to chop or stir, I’ll open a can of mackerel and toss it with spaghetti, capers, herbs, and parmesan. Italian sausage quickly seared in a cast-iron skillet and crumbled over some savory grains with a handful of arugula is an excellent lunch. A grazing board featuring little ramekins of Patagonia seeds, smoked mussels, and chopped up apricot and almond bars (kinda like quince paste?) alongside some raw veggies, a wheel of brie, and a dollop of store-bought hummus is my perfect Netflix and dinner. And there is really nothing more satisfying than shredding Patagonia’s salmon and mixing it with Kewpie mayo, cilantro, lemon juice, and salt and pepper before slathering it on a a tortilla or toasted slice of whatever bread has been knockin’ around your freezer since 2019. Trust me: Buy a box of these camping meal kits and it’ll make any journey better, even if it’s just from the kitchen to your couch.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-07", "author": ["Condé Nast", "Ali Francis"]}