{"id": "02dcc32f33e7b30a698aaac606d2248f", "url": "https://www.bonappetit.com/recipe/cod-poached-in-tomato-curry", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Poached Cod in Tomato Curry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPoached Cod in Tomato CurryBy Andy BaraghaniSeptember 18, 20194.7(116)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWe opted to use cherry tomatoes here because we like their sweetness and how quickly they collapse into a sauce, but you can use larger tomatoes if you have those on hand—just make sure to give them a rough chop before incorporating them into the curry.Ingredients4 servings3Tbsp. virgin coconut oil or vegetable oil1red chile, halved, seeded, thinly sliced11\" piece fresh ginger, peeled, thinly sliced2garlic cloves, thinly sliced4cardamom pods, crushed1tsp. ground coriander½tsp. ground turmeric2pints cherry tomatoes (about 1¼ lb.)¼cup unsweetened coconut creamKosher salt45-oz. skinless cod fillets1cup basil leaves, torn if largePreparationStep 1Heat oil in a medium skillet over medium until melted. Add chile, ginger, and garlic and cook, stirring often, until garlic has softened but not taken on any color, about 3 minutes. Add cardamom, coriander, and turmeric and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and cook, stirring occasionally, until most of the tomatoes have burst and released their liquid, 12–15 minutes. Stir in coconut cream; taste and season curry with salt.Step 2Reduce heat to medium-low. Season cod with salt and nestle into curry. Cover and cook at a bare simmer until fish is opaque throughout and beginning to flake, 5–7 minutes (thicker pieces will take longer to cook).Step 3Gently transfer cod to shallow bowls. Stir basil into tomato curry, then spoon over fish.How would you rate Poached Cod in Tomato Curry?Leave a ReviewTell us what you thinkReviews (64)Back to TopTriangleI’ve made this several times and my friends family and I always enjoy it.  It’s quick and easy to make and modify to your own taste…although I’ll say I usually follow the recipe pretty closely and find it delicious. If it seems bland perhaps you didn’t salt the cod before adding it or didn’t use fresh ginger?  EBRColorado 1/15/2022Boring, not much of a curry flavor.  Didn't like the skins from the cherry tomatoes.LavaButtAlsea, OR9/21/2021One of my absolute favorites- so easy and so flavorful!  I’ve made it many times for my family and guests.  Beth PHamilton Square, NJ9/19/2021This was hands-down one of the best things I ever ate!  Had so many fully ripe summer tomatoes so I seeded and cut them up. I used about 1 3/4 pounds before seeding. Used ground cardamom (1/4 t.) and added 1/4 teaspoon of my favorite curry powder.  I didn't have a red chili pepper so I used red pepper flakes for heat.  The deep tomato flavor reminded me of another favorite BA recipe: Buttery Tomato and Cinnamon-Spiced Rice from Aug. 2020. It's the combination of sweet tomato and a sweet spice; in this case cinnamon instead of cardamom. I have a great photo of the cod dish. A brilliant recipe!MaryAnn NeblockSE Pennsylvania8/27/2021Yum!! Added some lime juice, and it was perfectly balanced! AnonymousLA8/13/2021So good and super easy. I doubled the spices, garlic and ginger and added a squeeze of lime at the end. JosieChicago4/28/2021Very easy to put together. served with beluga lentils. \nAdded some lime juice.\nMake sure you add enough salt to bring out the spices. Cecile4/21/2021I've made this once before and, like many reviewers, found the recipe to be lacking in a few ways. I made several modifications on my second go and boy was it worth it! First, use an extra chile pepper if you want detectable heat. Second, before adding the coconut cream I threw a whole sprig of basil into the hot oil to open up the basil aromas for ~30 seconds. This eliminated the need for basil garnish IMO. Finally, I doubled the sauce to fish ratio and bumped up the flavor by adding an extra teaspoon of curry powder into the sauce before nestling in the fish. EmilyLos Angeles, CA1/13/2021So delicious and easy! I made this with fresh or home canned tomatoes. Easy to adjust the flavor profile without ruining the dish.AnonymousNC1/11/2021Delicious ! And easy ! Maxine Sarasota , FL12/6/2020This became the classic coconut curry for cod in our family.  Everyone loved this dish.  The combination flavors and aroma, makes you want to eat it the next day and the next day.  Great recipe!!!  DeeSherman Oaks, CA 12/3/2020Followed the instructions from the other reviews. Doubled the spices and added fish sauce and lime. The family loved it. Adelbert Illinois11/24/2020this recipe is great! i saw the comments below saying the recipe as is quite bland, so i added more spices than the recipe calls for, also put fish sauce when seasoning curry before putting in cod fillets, and a squeeze of lime right into serving bowl. tasted amazing, and it was so easy to make, even for a cooking novice like me! will make again for sureAnonymous10/29/2020I actually think there are several things missing in this recipe.  It's fine as it is but it could be better if Andy had added a squeeze of lime (perfect for curry and fish), salt to counter balance the sweetness of the coconut cream, and for my taste a little more heat.  A single red chile does not provide enough heat as is needed for a curry.  I will try this recipe again by adding a little fish sauce for umami, a squeeze of lime, and try swapping out basil for cilantro. San Francisco10/6/2020I love this recipe because it's so versatile.  I made it on a Sunday and found that it needed more spiciness; the red chile I used was not spicy at all, but overall the dish had a lot of potential so I made it again on Tuesday, but this time around I used one habanero pepper sliced.... yikes! super hot! and I used cilantro instead of coriander.  I had never used cardamom pods before and they added a nice nutty aroma and flavor.  This is a wonderful dish, the coconut cream with the cod and all the other flavors makes it delicious and interesting.  Just keep in mind that cod is always on the bland side, no matter what you do to it.AnonymousMiami9/21/2020Explore Bon AppétitCurryIndianSouth AsianAsianCherry TomatoTomatoVegetableCodFishSeafoodBasilHerbs & SpicesOne-Pot MealsMainDairy-FreeGluten-FreeHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-18", "author": ["Condé Nast", "Andy Baraghani"]}