{"id": "02dd7b00e08f807f8507f79a47111fbc", "url": "https://www.bonappetit.com/recipe/egg-korma-with-frizzled-onions", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Egg Korma  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEgg Korma With Frizzled OnionsBy Sohla El-WayllyDecember 9, 20194.6(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue Li EmailPinterestPrintEmailPinterestPrintWhole jammy eggs are seared in ghee until blistered and crispy, then smothered in a gently spiced coconut sauce. Just as you would when searing meat, pat the eggs dry for better browning and to prevent spattering. Don’t rush cooking down the yogurt base for the sauce, which will ensure the spices toast and aromatics caramelize, flavoring the entire dish.Ingredients4–6 servings8large eggs14\" piece ginger, scrubbed, unpeeled, thinly sliced2garlic cloves, smashed, peeled¾cup whole milk yogurt½tsp. ground cardamon½tsp. ground cinnamon¼tsp. freshly ground black pepper1medium red onion, thinly sliced, divided¼cup ghee or neutral oilKosher salt⅓cup dried apricots, quartered1bay leaf113.5-oz. can unsweetened coconut milk1lemon, quartered1bunch of red radishes, trimmed, thinly sliced1cup mint leaves, torn if large2cups cooked ricePreparationStep 1Bring a large saucepan of water to a boil over medium-high heat. Using a slotted spoon, carefully lower eggs into water one at a time. Immediately set a timer for 7 minutes and cook eggs, maintaining a low boil. Carefully transfer eggs to a large bowl of ice water and let cool until just slightly warm, about 2 minutes. Gently crack eggs all over and peel, starting from the fat end containing the air pocket. Gently dry eggs with a clean dish towel.Step 2While eggs cook, purée ginger, garlic, yogurt, cardamom, cinnamon, pepper, and half of onion in a blender until smooth; set aside.Step 3Heat ghee in a large nonstick skillet over medium-high until it sizzles as soon as an egg hits the skillet, about 1 minute. Fry whole eggs, rotating twice to get golden brown and crispy on 3 sides, about 5 minutes total. Using a slotted spoon, transfer eggs to a plate, leaving ghee behind; generously season eggs with salt.Step 4Add remaining onion to skillet and cook over medium-high heat, stirring constantly, until browned and crisp, about 5 minutes. Using a slotted spoon and leaving as much fat in skillet as possible, transfer half of fried onions to plate with eggs (but keep them separate); season with salt.Step 5Add apricots to skillet with remaining fried onions and cook over medium-high heat, stirring frequently, until just starting to blister, about 1 minute.Step 6Add reserved yogurt purée and cook, stirring frequently and smashing against sides and bottom of pan (the yogurt paste will begin to stick to pan and darken—this is what you want; just keep stirring and smashing until you get there), until yogurt cooks down and purée is the color of gravy, 5–7 minutes. Add bay leaf and ½ cup water to pan and scrape up any browned bits. Reduce heat to medium, add coconut milk, and season with salt. Bring to a simmer and cook, stirring occasionally, until flavors have melded and sauce is the consistency of gravy, about 1 minute. Squeeze in juice from one-quarter of lemon; pluck out bay leaf. Return eggs (but not the frizzled onion) to sauce and cook until heated through, about 1 minute.Step 7Meanwhile, toss radishes and mint in a medium bowl. Squeeze in juice from remaining lemon quarters; season with salt and toss again to combine.Step 8Serve egg korma with warm rice and radish salad alongside. Top with reserved fried onions.How would you rate Egg Korma With Frizzled Onions?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleOne of the best things I've cooked recently! Followed the recipe with the following changes: added half a seeded jalapeño to the yogurt sauce (next time would add more), used raisins instead of apricots because it's what I had on hand. Like others, I reduced for longer than was written in the recipe. Next time would use 1/2 c. raisins and double the fried onions. Would be even better with ghee. finseckerMadison, WI12/7/2020Maybe everyone else knows this, but I used butter instead of ghee (mistake #1), nearly starting a grease fire with exploding butter (!!), AND didn’t dry the eggs that well? (mistake #2) so I low key feared for my life while frying those wonderfully delicious jammy eggs. MORAL OF THE STORY: if you don’t have ghee, use an oil with a high smoke point (learned about this tidbit after) and really dry the eggs. But my foibles aside- incredible recipe! Followed the advice of other reviewers and let everything brown/reduce longer. Thanks Sohla for this sweet and savory dish! AnonymousDallas10/9/2020Really good!! Used raisins instead of apricots and gave the mixture an extra 15 minutes to reduce. Was delicious and would definitely make again :). Probably would cut the oil down by half next time tooAnonymous9/12/2020SO DELICIOUS! I just made this, easy and quicker than I thought (took me 25 mins from prep, cook   to meal time, and including clearing/washing dishes)  I sub dried apricot with dates, added chili powder and thai bird eye chili. Love. I love crispy onions so I made 3x much more than this recipe called, and did not regret that. I also agree with the other reviewers about reducing the yogurt puree to a lot longer.  I'd do this recipe again. So delicious, comforting. Thank you, Sohla! AnonymousSan Francisco8/24/2020This dish was eggcellent! I didn't change any ingredients, and loved the amount and size of the apricots, which gave some toothsome texture to the dish. I did cook the yogurt purée a lot longer than suggested, maybe 15 minutes, so it would get the same caramelization color as in the photo, which I think did a lot to meld the flavors and soften the apricots, releasing their sweetness to the dish. Once I added the coconut milk/bay leaf/water, I cooked that for quite a bit longer than directed as well, maybe 5-10 minutes! One minute didn't seem like enough time for the bay to give off its flavor. Next time as some comments suggested, I will add chili to the dish, I felt it could use a little more heat than black pepper provides.San Francisco7/20/2020This is a lovely dish. Definitely flavorful, although it seems like the flavors are a bit distinct instead of harmonious: that isn't necessarily a bad thing. Frying the eggs was an absolute nightmare. I swear they were as dry as they were going to get and still left a monstrous splatter. The only other complaint is that most of the flavor is apricot and yogurt and egg. The sauce feels like it fades in the background with everything else in the bowl. Which is a shame, because by itself the sauce is amazing. cbruettSalt Lake City, Utah6/24/2020This was such a great recipe! The korma is so tasty and flavorful, though I did make a few changes/additions. \n\n- Use half the suggested amount of apricots. Apricots are def the star of this dish and you shouldn't omit them, but 1/3 cup made the dish a bit too sweet, in my opinion! Half that amount still left a great flavor and cut the sweetness a bit. I also diced them into small pieces so it dispersed easier in the sauce, like a previous commenter suggested.\n\n- For a  subtle bit of heat, add 1/2 tsp kashmiri red chili powder and/or a chopped green chili to the yogurt before pureeing. \n\n- After taking out half the frizzled onions for garnish, add a tablespoon of tomato paste and fry it off for a bit before adding in the apricots. Introduces an extra tangy element to the korma that I enjoyed. k_meenaNew York City, NY6/7/2020Sohla is such a great recipe developer, the apricots really make it!Anonymous6/6/2020To keep it short: I made this recipe for my girlfriend and she thought it was the best I ever cooked for her. Don't be put off by the apricots - they kind of melt into the sauce and are crucial for the sweet dimension in this dish in my opinion. Highly recommended!AnonymousGermany5/25/2020Short review: this was exceptional and tasted complex but was super easy to execute. 10/10.\nFor your consideration: if you are in a household of radish-lovers, you may want to double or more the salad recipe. Raisins/currants sub in nicely for apricots if you, like me, are averse to them. If your sauce seems relatively runny, just scoop the firm coconut cream from the top of the can, and stir it in. amy engelSaskatoon, SK4/26/2020The apricots are... off putting.AnonymousDetroit 1/20/2020Made this for late breakfast... it was so delicious! All of the flavors melded together perfectly, and we enjoyed the freshness of the radish and mint. Would eat this again and again!AnonymousLos Angeles, CA1/5/2020This was so delicious! I substituted unsweetened coconut yogurt for the whole milk yogurt to make the recipe dairy free, and it was incredible. My only qualm was that I found the apricot pieces to be a bit unwieldy in the final product, so next time I would chop them more finely and smash them a bit more during cooking.\nSUCH a great recipe; I highly recommend it!\nAnonymousMontreal, QC1/3/2020So good! Made with local duck eggs and watermelon radish (because that’s what was available). Easier to cook than I expected it to be. emmaroseAnn Arbor, MI12/18/2019bruhAnonymousTennessee12/13/2019Explore Bon AppétitIndianSouth AsianAsianEggCoconut MilkOther IngredientsYogurtMainSideGluten-FreeVegetarianHealthyishRamadanLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-09", "author": ["Condé Nast", "Sohla El-Waylly"]}