{"id": "02e5862bcaf29d9922f18657adf681e3", "url": "https://www.bonappetit.com/story/ruffage-cookbook", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Ruffage, a Cookbook by Abra Berens, Is Changing the Way I Use Vegetables | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cookbook Is Changing the Way I Use Vegetables'Ruffage' by Abra Berens is the practical guide to vegetables every kitchen needs.By Christina ChaeyApril 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!As much as I fancy myself the type of person who experiments with new and creative dinner recipes every night, the reality is that I’m probably eating a pile of sautéed kale and some fried eggs with hot sauce for the third time this week. And if I didn’t have to read new cookbooks such as Abra Berens’s Ruffage for my job, I doubt I would ever deviate from this basic formula.Ruffage, which is billed as a “practical guide to vegetables,” is the kind of book I wish I’d had when I was a line cook, because it is a master class in improvising with what you have and what’s in season right now, which are pretty much the two foundations of intuitive cooking. There are recipes for nearly 30 different vegetables, but the real gold mine of this book are the hundreds of little variations Berens provides for how to riff on the recipes as written. She doesn't just give you a beautiful recipe for, say, blistered cucumbers with cumin yogurt and parsley, she shows you how those same cucumbers would be delicious paired with peaches, mint, and chili oil, or tossed with buttermilk, tomatoes, and herbs. This is the book I want on my shelf right next to my dog-eared, sauce-flecked copy of Joshua McFadden’s Six Seasons. It's a total classic.Buy it: Ruffage: A Practical Guide to Vegetables, $25.Explore Bon AppétitHealthyishHealthyish Loves ItCookbooksShoppingRead MoreLifestyleThese Bookends Are My Excuse for Buying All the BooksBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-27", "author": ["Condé Nast", "Christina Chaey"]}