{"id": "02f1932cd662e6bd4126bdbbd09d0a71", "url": "https://www.bonappetit.com/recipe/honey-chipotle-shrimp-tacos", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Honey-Chipotle Shrimp Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHoney-Chipotle Shrimp TacosBy Andy BaraghaniJuly 10, 20184.9(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThese easier-than-easy shrimp tacos are ideal for busy weeknights, but those fancy-seeming toppings—lime juice-massaged red onions and a throw-together garlic crema—are destined for dinner party greatness.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketMedium Bowl$17 At AmazonSpatula$12.99 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonSpoon$24.69 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Skillet$84 At AmazonHeavy-Duty Aluminum Foil$10 At TargetIngredients4 servings2Tbsp. adobo sauce from 1 can chipotle chiles in adobo2Tbsp. honey1lb. medium shrimp, peeled, deveinedKosher salt½cup mayonnaise1small garlic clove¼head of green cabbage1cup cilantro leaves with tender stems1small red onion1lime8corn tortillas2Tbsp. vegetable oilPreparationStep 1Stir 2 Tbsp. adobo sauce and 2 Tbsp. honey in a medium bowl until combined. Add 1 lb. shrimp; season with salt. Toss until shrimp is evenly coated with sauce. Set aside while you prep your toppings.Step 2Mix ½ cup mayonnaise with 2 Tbsp. water in a small bowl. Grate 1 garlic clove into bowl, season with salt, and stir to combine.Step 3Thinly slice ¼ head of cabbage into very thin strips.Step 4Coarsely chop 1 cup cilantro.Step 5Peel and trim 1 onion. Cut in half lengthwise, then thinly slice.Step 6Cut 1 lime in half and squeeze out juice from both halves into another small bowl. Add sliced onion and a pinch of salt. Massage with your hands until onion begins to soften.Step 7Heat a large nonstick skillet over medium-high. Working with one at a time, warm tortilla in skillet until pliable and starts to darken, 30–45 seconds per side. Transfer tortillas to a piece of foil and wrap tightly to keep warm.Step 8Return skillet to medium-high heat and pour in 2 Tbsp. oil. Once oil begins to shimmer, add shrimp mixture and cook, stirring occasionally, until shrimps turn pink and cooked through, 1–2 minutes. Remove skillet from heat.Step 9Unwrap tortillas and build tacos with shrimp, cabbage, garlic crema, cilantro, and onions.How would you rate Honey-Chipotle Shrimp Tacos?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleI've made this with salmon instead of shrimp. Delicious!Alaska JodiAnchorage, AK 2/9/2022Easy and so tasty!! Love this recipe AnonymousToronto 1/12/2022A staple - also great for last minute company! So good. I also put a bit of chipotle into the mayo. Chefs kiss! Shazzizle New York City 10/11/2021Easy to make my husband loved itKorinaNY9/10/2021DELICIOUS. Super quick & easy!! Will be making again!Sophia K. Fort Collins, CO7/27/2021Very good, quick and easy!Mark VKansas City, MO6/29/2021I liked the chipotle honey shrimp, but feel like you could cut the quantity of the marinade in by a 1/3 and still have plenty. Also would maybe do 2 parts adobo to 1 part honey. They were pretty sweet. Also made a slaw with the mayo instead of the individual veggies, raw cabbage didn't seem that interesting to me. BenChicago, IL12/18/2020Tasty and quick! Couldn't find adobo for the life of me, so threw together some smokey tang based on what I had - amended each to taste and coupled with the honey, it worked. Onions were a surprise highlight with rave reviews and friends asking for more!AnonymousHong Kong8/17/2020Excellent!  Very flavorful.  Interesting combination of flavors and textures, and it's easy and quick to make.  The only change I made was that I heated a little extra adobe sauce and brushed it on the tacos.  AnonymousVirginia8/16/2020Loved this - one of our favorite SIP meals! I did make one change - I used 1/2 mayo, 1/2 sour cream, since I had it and I am glad it did, otherwise I think it would have tasted too preserved (perhaps BA buys better mayo than I do!). I also used defrosted frozen shrimp, which some how watered down the sauce a lot. I wish I had lifted out the shrimp from the marinade with a slotted spoon, fried them off so they got seared, then removed them from the pan, and cooked down the sauce until the water evaporated. Instead, I ended up poaching the shrimp in the liquidy sauce, removed them once I realized what was going on, and then cooking off the water, totally fine, but no caramelized bits on the shrimp like in the GIF in the recipe. In any case it was a great recipe: super easy and fresh - will definitely make this again.AnonymousSan Francisco, CA5/20/2020Y'all are being such babies about the printing in this comment section. How hard is it to copy/paste the bits you're interested in into a word document and just print that. If you're so dead set on killing the planet you can't complain about having to do some workyucateco4everStockholm5/15/2020Really easy and delicious recipe! A new go-to recipe for me. I think I'll make the shrimp like this even without the tacos because the adobo+honey was so perfect on the shrimp. If you really want to take the crema to the next level swap water out for lemon juice, add a little minced garlic, 2 tsp adobo sauce, and a little salt.... extra yum!!!!California5/4/2020LEGENDARY! Not only was it super easy to make, but a total flavor bomb. As another user suggested, I pickled the onions a few hours ahead which really took things to the next level. Perfect for a quick weeknight dinner, but could easily hold their own at a dinner party. 10/10 will make again, and again. AnonymousLos Angeles, CA4/26/2020Just made this and it was amazing. I didn't have any cilantro so I spruced up the sauce a bit. I went with 1/4 cup mayonnaise, 1/4 cup sour cream, 2 Tbsp. water, half an avocado mashed, salt, 1 Tbsp. ground coriander, 1 clove minced garlic, and mixed the lime juice from the onions into it as well. I also marinated the cabbage in 1/4 cup white vinegar, 1/4 cup water, and 1 Tbsp. vegetable oil. It was insanely good.WaterCursesOrange County, California4/22/2020We love this recipe!  warming the tortillas is fun!  the shrimp are tasty with the right amount of heat and spice.  AnonymousNew Jersey8/30/2019Explore Bon AppétitTacoMexicanLatin AmericanShrimpShellfishSeafoodChipotleChileVegetableCilantroHerbs & SpicesQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeSautéFourth Of JulyMemorial DayLabor DayLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}