{"id": "02fe25de37f205e8dd7920411f203bf6", "url": "https://www.bonappetit.com/recipe/instant-pot-chicken-stock", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Instant Pot Chicken Stock Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInstant Pot Chicken StockBy Carla Lalli MusicDecember 3, 20184.4(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintYou will get as much richness and depth from this stock after 40 minutes under pressure as you would from 3 hours of simmering on the stovetop. Add the ginger if you want a little bit of heat and brightness—a nice addition to chicken soups and rice pilafs. If you plan on reducing the stock after making it (for example, if making a braise with it), skip the salt, which could become overwhelming.IngredientsMakes about 2 quarts3lb. chicken wings or chicken bones1large carrot (6–8 oz.), scrubbed, halved1large onion, unpeeled, halved1head of garlic, halved crosswise11\" piece ginger, unpeeled, halved (optional)Handful of thyme2bay leaves1tsp. whole black peppercorns2tsp. kosher salt (optional)Special EquipmentAn Instant Pot or other pressure cookerPreparationStep 1Combine chicken wings, carrot, onion, garlic, ginger (if using), thyme, bay leaves, and peppercorns in Instant Pot. Add 3 quarts water and bring liquid to a simmer, spooning off any foam that rises to surface. (If using a stovetop pressure cooker, bring to a simmer over medium-high heat.)Step 2Lock lid and cook stock on high pressure 40 minutes, then release pressure manually.Step 3Strain stock through a fine-mesh sieve into a large bowl; discard solids. Add salt (if using), stirring to dissolve. Let cool.Step 4Do Ahead: Stock can be made 4 days ahead. Cover and chill, or freeze up to 6 months.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Instant Pot Chicken Stock?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThank you to Carla Lalli Music for posting this wonderful recipe.\n\nI have been making chicken stock \"the old fashioned way\" for years.  However, I decided to see if there was a way to make it in the Instant Pot and found this recipe.  \n\nI could not disagree with the post from \"Anonymous\" more.  This. Is. Excellent!  It is so easy and comes out very tasty.  It is definitely a dump and go recipe.  I put it in and came back hours later to a nice, rich, heatlhy and tasty stock.  Next time I think I will skip the simmering step and maybe add the ginger, which I forgot this time.  When the pressure cook step was done I just let it release naturally for a couple hours, since I was busy, and it turned out perfectly!\n\nThis will probably become my go-to method and we will be having homemade chicken stock much more often now!Melinda WolfhausLong Beach, CA1/26/2022I have been making my grandmother's chicken stock in a giant pot for years. It is rich and golden and tastes like chicken.  This was my time making anything in the instapot. It didn't seem like much chicken but I thought maybe through the magic of a pressure cooker it brings out more flavor or the flavor is intesified?  Nope. What came out tastes like dish water. I dumped it all and will go back to the old fashion way of cooking it - MORE chicken (whole chickens) and slow simmering it for hours. Anonymous1/19/2022Omg this is so good. I'm drinking it. I'm making more already. Recipe is definitely a keeper!!AnniesmamaTexas11/3/2021Easy And delicious!  AnonymousFlorida9/21/2021This is for a person that wanted to know if they could use the chicken for chicken soup or just eat like that and yes you can I bet it will taste so yummy hope this helped because no one answered you have a great dayAnonymousLowell mass8/18/2021This recipe is such a game changer. I make stock on weeknights now, sometimes at the same time I'm whipping up dinner. It's just too easy. I don't even bother with the simmer part (somehow missed that instruction the first time), and found that it's totally unnecessary. Filling up my 8 qt. instant pot to the water fill line, this makes 14 cups of stock. I freeze them in Tupperware in 2-4 cup increments, so homemade stock is always on hand! Boxed stock, never again. ChelseaLos Angeles, CA1/13/2021Fantastic stock!  Everyone was skeptical of using the Instant Pot for stock, considering all of them were used to stovetop simmering for hours... and hours.  I’ve changed their minds and I will always opt for this method until proven otherwise!\n\nWe had about 2.5 pounds of bones, only half a head of garlic, and a small onion.  So, I used about 2 cups less water & crushed the garlic to extract as much flavor as possible.\n\nI opted to cook it at high pressure for 60 minutes, just to appease one person.  I also let it release pressure “naturally” just because I was in no rush.\n\nEveryone else tried it first, salting their tasters accordingly, and they were surprised and impressed.  I happily patted myself on the back after tasting the rich & flavorful broth.  Phew!  Good enough to drink on its own, btw!erin Bay Area11/28/2020I made this recipe yesterday.  It is FABULOUS!!  It was so good that I just added noodles to it.  I didn't put in the ginger.  I also sauteed the vegetables first.  it's just a habit I have from all of the cooking classes that I've taken.  You won't be sorry with this recipe.Lauren TilburyHuntington Beach, California11/23/2020I made this yesterday afternoon with around a 5-6 pound chicken carcass from a rotisserie chicken we bought from the store. It was DIVINE! It made our entire house smell amazing and the broth was just so very rich! I think I ended up using 4 quarts vs 3 but kept everything else the same. I couldn't believe how delicious the broth was on it's own, not to mention in our Zuppa Tuscana and Spinach/Leek risotto! So delicious! I will always make this! We used the instant pot method, the strained through a sleeve. Frozen leftovers in freezer safe bags flat for easy storage. AngelColorado10/15/2020I neglected to notice I was supposed to simmer everything and scoop off the foam before turning on the pressure cooking for 40 minutes, so I just did a dump and run.  The broth turned out great.  I will try it the right way next time and see if it is better, but I was very pleased with the results.  One question I had is do you have to throw out all the meat after using it to create the broth, or is it ok to add it to the chicken soup?AnonymousPortland, Oregon1/9/2020I've made this recipe about 10 times now. It's always been consistently excellent and the instant pot is really perfect for making homemade chicken stock. I always have some chicken stock from this recipe ready to go in my freezer.  cdalzellHonolulu9/9/2019I STRONGLY suggest doing a natural pressure release rather than a manual pressure release with this recipe.  It's chicken stock--it's not like you need to worry about it overcooking.  I did manual pressure release/QPR this weekend, and ended up with a kitchen covered in a jet of chicken fat.  I should have thought better to begin with, given that you're scooping fatty foam off the top before you ever apply pressure.  On the bright side, the stock is great, and this is going to become a weekly practice for me--just on NPR.Anonymous1/22/2019Not your grandmother's chicken broth. But nana never had an IP, either. I was not overly excited by the recipe but being in a hurry for some chicken noodle soup, I gave it a try. Prep and actual cooking was easy and straightforward. Followed the instructions to a T, and when finished I mixed in my aromatics and let it bubble away on the stovetop until carrots were soft. I cooked the egg noodles separately, then added them to my bowl, ladled out the soup and sat down to my dinner, not expecting much.  Much to my surprise, I realized that this was one of the best bowls of chicken noodle soup I had ever tasted. Bright, clean and spicy from the red chilies I had added, I was very impressed with this tasty broth. Two thumbs up!zenbuddhist2490Michigan1/13/2019This is Diamond Crystal salt right? I want to get it right! This is a perfect winter dish. suzrodSan Jose 12/26/2018Carisa - sautéing the vegetables first was in reference to making vegetable stock, not this chicken stock.gloriamBritish Columbia12/3/2018Explore Bon AppétitStockChicken WingChickenPoultryEasyDairy-FreeGluten-FreeNut-FreeInstant PotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Carla Lalli Music"]}