{"id": "0315c31f176f5ad60ea3f14c79657f58", "url": "https://www.bonappetit.com/story/best-food-ornaments", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "33 Food Ornaments for a Deliciously Festive Christmas Tree | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Food Ornaments for a Deliciously Festive Christmas TreeThe perfect gift for the office Secret Santa you’ve only met on Zoom.By Tiffany HopkinsNovember 3, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When in doubt, get them an ornament. That’s my motto, at least, when I’ve scoured every gift guide on the internet and still feel stumped. Finding the best gift for everyone in your life is hard, especially when it’s for the pickiest person in your family or the office Secret Santa you’ve only met on Zoom. But after years of gift exchanges, I’ve learned that ornaments often satisfy—especially food ornaments, which require little to no knowledge about your intended recipient. Don’t know whether your sister’s new girlfriend is a reader or if she’s allergic to scented candles? Doesn’t matter—everyone likes burritos, and she can hang one on her tree right next to Rudolph.Whether you’re shopping for your baker friend who couldn’t live without his stand mixer, your millennial cousin who can’t afford a house because of all the avocado toast they eat, or your favorite coworker who always arrives with a pumpkin spice latte in hand, you’re sure to find a food ornament that’s festive, appetizing, and makes a great gift. Here are some of the best food ornaments we’ve found:Comfort FoodsNo better way to commemorate the season of watching The Holiday on repeat and eating your feelings.Dumplings$16 at Food52Cheeseburger$14 at EtsyBaked Potato$18 at Amazon6-Pack$25 at NordstromTakeout box$13 $3 at Pottery BarnPantry StaplesCanned soup will last for years, but a canned soup Christmas ornament will last a lifetime.Pasta Boxes$26 $22 at AmazonRamen Noodles$28 at Sur la TablePeanut butter$14 at WayfairHot sauce$45 at Neiman MarcusTomato Soup$18 at EtsyFresh ProduceThe cold days of winter are upon us, but these fruits and veggies are in season all the way through December.Apple$20 at AmazonPineapple$5 at TargetWatermelon$18 at Sur la TableSweet Potato$20 $12 at AmazonCorn on the Cob$15 at AmazonBreakfast EssentialsThe most important meal of the day is also the most important meal on the tree.Bacon and Eggs$18 $16 at AmazonBiscotti$17 $2 at Sur la TableCoffee pot$5 at TargetDoughnuts$14 at TargetCocktail HourThese spirited drink ornaments (and, for the teetotalers, a pack of La Croix) will get the holiday party started.Vodka, Whiskey, Tequila and Rum (4-pack)$41 at AmazonCharcuterie board$16 at Food52Old fashioned$22 at Sur La TableLa Croix (3-Pack)$64 at Food52Moscow Mule Mug$30 at Sur la TableMartini$5 at TargetBakery FavoritesThe cookie swap doesn’t end until you say it does.Cherry Pie$19 at AmazonBaguette$18 $2 at Sur la TablePatisserie Shop$26 at Cailini CoastalBlack & white cookie$16 at Food52Gingerbread house$48 at Bergdorf GoodmanFrom the SeaWhat’s more festive than rainbow trout?Half shell oyster$15 at Sur la TableLobster trap$16 at Wayfair$18 at WalmartSushi Set (5-Pack)$44 at Food52Fruitcake season:Explore Bon AppétitShoppingGift GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-03", "author": ["Condé Nast", "Tiffany Hopkins"]}