{"id": "032350eb55cb8658f59b8b38e19d62bd", "url": "https://www.bonappetit.com/story/solo-apartment-kitchen", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "A Kitchen to Call My Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Kitchen to Call My OwnBeing at home is one thing. Feeling at home is something else entirely.By Christina ChaeyJune 14, 2021FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.For the last week, I’ve been re-using a to-go plastic iced coffee cup as my water glass and eating most meals out of the same single plastic takeout container that I’m treating as a bowl. Yep—I’m moving! And Mercury is fully freaking out and ensuring that the whole process is as nightmarish as possible. (For starters, my pantry flooded with brown water during two flash floods last week.)But then I remember that by the time this newsletter goes out, I’ll be inhabiting a new kitchen, one that is very much my own (okay it’s a rental, but still). I’ve dreamed of this moment ever since I graduated college ten years ago, and I’ve got the (secret) Pinterest boards to prove it. At 32, I’ve never lived without roommates, and thus have never gotten the opportunity to creative-direct the common areas of my homes. I also spent most of my twenties moving at least once a year (sometimes more!), and during that decade I got very attached to the idea of living a minimalist-nomadic lifestyle: Amass as little as possible, because this is not your home-home. And also, moving is a pain in the ass. And ALSO, will your roommates actually take care of that Japanese chef’s knife you’ve been coveting? Didn’t think so.Over time, my living circumstances nudged me to be okay with the state of being at home rather than feeling at home. I never hung art on my bedroom walls, never painted, never even so much as bought a throw pillow for (not my) living room couch. If I’m being honest, I don’t feel like I know how to create a home just for me, and sitting with that has been unsettling and anxiety-provoking in turn. It makes me feel behind, somehow.But I do know a thing or two about the kitchen, and I’ve been finding comfort in planning out the kind of space I want this next kitchen to be. I’ve been slowly amassing the things I’ve always wanted to own: nice towels to wipe my hands dry after the last dish of the night is done; cloth napkins for all the future dinners; the big solid-wood butcher block cutting board I hope to have long enough to pass down one day. They feel like representations of an idea of home I’ve only ever held in my head, one that I’m now getting a chance to manifest in life. I’ve got that nice Japanese chef’s knife in my virtual cart right now, by the way; I guess it’s finally time.Quick Hits for Cooking Limbo:Photo by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeSpaghetti Al Limone with AsparagusUltimate BLTTomato Toast with Chives and Sesame SeedsEveryday Greens SaladSpicy Braised TofuSheet-Pan GnocchiExplore Bon AppétitHealthyishWhat's Chaey Cooking?essayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-14", "author": ["Condé Nast", "Christina Chaey"]}