{"id": "032493f28fa365deddd0100e376f5ec2", "url": "https://www.bonappetit.com/story/what-is-five-spice", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Chinese Five-Spice Power is the Spice Blend We Add to Dry Rubs and Cookie Doughs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Spice Blend That’s Great on Ribs (and Also in Cookies)Sweet, warming, licorice-y, and so versatile.By Sarah JampelAugust 20, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen they’re fresh and fragrant, spice blends are the ultimate flavor shortcut: You get the benefits of a handful of spices but you only have to buy one jar. They’re like footie pajamas (shirt, pants, and socks) for your spice cabinet. Five-spice powder, a mix that’s common in China, Taiwan, and certain parts of Vietnam and Thailand, is no exception. It's the one-ingredient reason these Sweet-Sticky Five-Spice Pork Ribs complex and aromatic, with just a whisper of sweetness.Five-spice has a consistent flavor profile—think warming, deep, and distinctly spicy without being fiery—but it isn’t always made up of the same five spices (and there aren’t always , or even usually, five of them). The number actually refers to the five traditional Chinese elements (wood, fire, earth, metal, and water) and flavors (sweet, bitter, sour, salty, and acrid/pungent), of which five-spice achieves a harmonious balance.No salt added? That's your ticket.\nMost blends from China include star anise, cinnamon or its close relative cassia, cloves, Sichuan peppercorns, and fennel seeds, but the mix can also contain ginger, nutmeg, turmeric, galangal, Mandarin orange peel, white or black pepper, and licorice. (That’s way more than five ingredients, if you’re counting.)Traditionally, five-spice is used to complement fatty meats, like duck, goose, or pork, in marinades, stews, and braises. And it can add warmth without sugary sweetness to lots of other dishes, as well. Try adding a smidge to your favorite nut or snack mix, fall fruit galette, banana bread, sugar cookie dough, cream cheese frosting, carrot cake, or granola. Or simply sprinkle some in when you're whipping cream or simmering oatmeal. Start conservatively—five-spice is pungent (and you can always add more).When you’re buying five-spice, look for mixes without salt and, if you have an opportunity to give it a whiff, smell for fresh licorice. (Need a brand rec? Cookbook author Andrea Nguyen recommends Spicely Organic Five Spice Seasoning in Vietnamese Food Any Day). Store five-spice powder in an airtight container in a dark, dry place and remember that, like any spice, it has an expiration date: When it starts to lose its smell, it’s time to get a new jar—you have more ribs to make.Got five-spice? Got ribs:Sticky-Sweet Five-Spice Pork RibsLacquered with a tangy, garlicky hoisin glaze, these ribs are impressive without being burdensome: There's no grilling or marinating—just two hours in the oven followed by a quick broil.View RecipeExplore Bon AppétitSpiceChineseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-20", "author": ["Condé Nast", "Sarah Jampel"]}