{"id": "032c3fb09089bd81c88236c79ffb6b26", "url": "https://www.bonappetit.com/recipe/sheet-pan-chicken-and-squash-salad", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Sheet-Pan Chicken and Squash Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueSheet-Pan Chicken and Squash SaladBy Zaynab IssaJanuary 4, 20224.6(29)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah MortonEmailPinterestPrintEmailPinterestPrintIn this low-lift but jam-packed salad, a comforting medley of add-ins are all made on one sheet pan: There’s lemony roast chicken thighs, tender delicata squash, jammy shallots, and Halloumi cheese, which crisps into cheesy croutons. We love a big bowl of massaged kale, but feel free to use whatever salad greens you have on hand.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketMicroplane$16 At AmazonCitrus Juicer$7 At AmazonGlass Measuring Cup$19.99 At AmazonWhisk$10 At AmazonIngredients4 servings4garlic cloves, dividedZest and juice of 1 small lemon4Tbsp. plus ⅓ cup extra-virgin olive oil, divided3½tsp. Diamond Crystal or 2 tsp. Morton kosher salt, dividedFreshly ground black pepper6skin-on, bone-in chicken thighs1medium delicata squash6oz. Halloumi cheese, cut into 1” cubes2tsp. ground cumin4shallots, thinly sliced1Tbsp. Dijon mustard1Tbsp. pure maple syrup1bunch kale, ribs and stems removed, leaves choppedPreparationStep 1Place a rack in upper third of oven; preheat to 425°. Finely grate half of garlic into a large bowl. Mix in lemon zest, 3 Tbsp. oil, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt; season with pepper. Pat chicken dry and place in bowl, turning and rubbing to evenly coat.Step 2Cut squash in half lengthwise; scoop out seeds and discard. Slice crosswise 1” thick. Place squash and Halloumi on one half of a large rimmed baking sheet. Drizzle 1 Tbsp. oil over, finely grate remaining garlic on top, and sprinkle cumin and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt evenly over. Season with pepper and toss to combine. Arrange into an even layer, keeping to the same side.Step 3Place shallot slices in 6 piles on other half of baking sheet; top each pile with a chicken thigh, skin side up. Roast until chicken is cooked through and squash is fork-tender, 33–36 minutes.Step 4Heat broiler. Broil vegetables and chicken until skin is golden brown and crisp, about 2 minutes.Step 5Meanwhile, whisk lemon juice, mustard, syrup, remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a clean large bowl; season with pepper. Gradually stream in remaining ⅓ cup oil, whisking until emulsified. Add kale; massage dressing into greens.Step 6Transfer chicken to a cutting board; thinly slice, discarding bones. Transfer to bowl with salad; add squash, Halloumi, and shallots and toss. Season with pepper.How would you rate Sheet-Pan Chicken and Squash Salad?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI subbed Turkey thighs (2) for the chicken and used mustard greens. Loved it! AnonymousPhiladelphia 2/18/2022Added a jammy soft boiled egg and used vegan feta instead of halloumi. Super delicious JillChicago 2/3/2022Cooked chicken thighs+shallots separate from squash+halloumi mixture per previous reviews. This helped pull out the halloumi and squash sooner than the chicken, the halloumi crisped up way sooner than the chicken being done. Excellent recipe, will definitely repeat! Svetlana Scottsdale, AZ2/2/2022This salad is pretty simple to make and delivers BIG on flavor! The combination of squash, Halloumi, shallots, lemon, garlic, cumin, and chicken thighs work so well together, humble ingredients that punch above their weight when roasted all together. A great balance of savory and sweet, and soooo comforting. The kale and dressing serve as a great foundation, the flavors work seamlessly and the greens help add variety to the texture. I cooked it for 35 minutes, which I worried was too long, but the chicken, Halloumi, and squash were all perfectly happy to get extra crispy. I recommend adjusting the ratio and adding a little more squash and halloumi than the recipe calls for. Why skimp out on some of the best players in this symphony? ClamSeattle, WA1/29/2022Seems like there is a split opinion on cooking times/temps.  Mine turned out perfectly using the time and temp as written.  Squash was cooked perfectly, cheese was a bit crunchy on the outside, chewy in the middle.  Raising the chicken up on the little \"shallot towers\" helps get the hot air under them so they don't sit in their own juice and get soggy.  Plus, the roasted shallot thrown into the salad is yummy!  Be sure to not use giant chicken thighs, as I could see that impacting the cook times.  I even threw in most of the schmaltz from the pan for some extra flavor.  Everyone in the family loved it - even my husband who doesn't usually like raw kale.LBinTXTexas1/25/2022It would be great if BA ever included nutritional value to the recipes Anonymous1/24/2022This was good. I did need to throw the cheese into the toaster oven on its own at the end to get some some extra crunch. Oh, and keep an eye on that sheet pan in the oven at 425, don’t trust the times!ShaunDunedin, Fl1/23/2022Awesome!  The squash was creamy, the cheese crunchy, and the chicken moist. I had no problems cooking everything on one pan—everything came out perfectly. Kim S1/23/2022Great flavors! Truly delicious! But I agree with many posters--putting the cheese and squash on a separate sheet pan allows you to take them out before the chicken. I also used boneless skinless thighs because cutting the hot chicken off the bones is too much work. Dressing was great, and the whole dish really worked well together!AbbyLos Angeles, CA1/20/2022Great flavors but it worked better when I roasted the chicken separately from the halloumi and squash. These ingredients do not cook at the same temperature.  andromedanew york, new york1/18/2022The length of time in the oven and the high temperature practically dissolved the shallots and made the cheese inedible.  I suggest sauteing the shallots and cheese on the stovetop.  Having the shallots under the chicken as a seasoner was unremarkable.  Anonymous274031/18/2022I want to try so many of these yummy recipes including this one but need nutritional info. Is there a way to find that? Thanks in advance!\n\n\nAnonymousSouth Acworth, NH1/16/2022Really great weeknight recipe! I kabocha squash instead and worked just fine.Anonymous1/14/2022Explore Bon AppétitDinnerMainSheet-Pan DinnersEasyWeeknightHealthyishGluten-FreeSaladHalloumiCheeseKaleLeafy GreensVegetableSquashDelicata SquashChicken ThighChickenPoultryRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Zaynab Issa"]}