{"id": "032d0b52d43bd309df916a2a7ac1fc9e", "url": "https://www.bonappetit.com/story/boxed-stock-or-better-than-bouillon", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "What Tastes Better: Boxed Stock or Better Than Bouillon? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Tastes Better: Boxed Stock or Better Than Bouillon?We tasted chicken, beef, and vegetable options to pick the best in each category.By Alyse WhitneyJanuary 29, 2018FacebookTwitterEmailFacebookTwitterEmailIn our dream kitchen, we'd have unlimited supplies of homemade chicken stock in our freezers. Always at the ready. We'd love to say that every time we make soup or a hearty braise, our first instinct is to make stock. But life is busy, and it's hard enough to get dinner on the table every night. So, if you also don't always have homemade on hand, should you use a box of stock or a jar of Better Than Bouillon paste?Boxed stock goes bad about a week after opening and typically comes in a 32 oz. shelf-stable carton. Per its name, stock is made with bones, while broth is made with meat or cooked vegetables. Better Than Bouillon is a concentrated paste made of cooked meat or vegetables that you dilute with boiling water in whatever quantity you'd like, and it can stay good for months in the fridge.Senior food editors Chris Morocco, Andy Baraghani, and I  tried three Swanson stocks—we've ranked them as No. 1 in a taste test in the past, and Morocco called them the \"tasting Goliath winner\" across the internet—against three Better Than Bouillon flavors. In both brands we sampled organic chicken, organic beef, and organic vegetable. In the end, we crowned one winner for all-purpose use (if you're not vegetarian or vegan).Boxed Swanson Chicken Stock vs. Chicken Better Than Bouillon BaseThe chicken flavor was \"not strong enough\" in the Swanson stock, and instead tasted more vegetable-forward and \"watery and murky.\" Carrot, celery, and onion juice concentrates make up part of the ingredients, and overshadow the taste of chicken. It lacked the body that homemade stock would, as did Better Than Bouillon. It's hard to emulate the real thing on such a large scale.That said, Better Than Bouillon tasted \"way too intense.\" It has the nostalgic (for some) flavor of \"canned chicken noodle soup\" and a ton of salt. (They do make a low-sodium version, but it isn't as widely available in grocery stores, so we tested regular.) It had a more prominent real chicken flavor, but the green-yellow hue (from added turmeric) is a little off-putting. Better Than Bouillon was the chicken winner with one caveat: never use it at full strength. The jar recommends 1 tsp. of paste to every 8 oz. of water. We'd double the amount of water to dilute it, or use a low-sodium version.Boxed Swanson Beef Stock vs. Better Than Bouillon Beef BaseBon Appétit does not suggest using commercial beef stock because it rarely holds a candle to the flavor of homemade, and unfortunately neither Swanson nor Better Than Bouillon changed our minds about that. The smell of both was \"off-putting,\" but they didn't taste quite as bad as they smelled. The stock had a \"flat\" taste and \"wasn't savory enough—almost sweet without any beefy taste or umami.\" The beef Better Than Bouillon had a \"musty\" scent and mostly tasted like salt. We think you'd be better off adding an extra short rib bone to a pot of water to impart \"beefy\" flavor to a soup rather than using a box of beef stock. There was no clear winner here, but if they had to choose, the Swanson stock had a slight edge in flavor.Boxed Swanson Vegetable Broth vs. Better Than Bouillon Vegetable BaseSwanson's vegetable broth surprised us in how well it was balanced. It mixed sweet and salty in a combination that made us tilt our heads, wondering what that secret flavor was. Some of the sweetness comes from pear juice and cane juice, and the can't-put-your-finger-on-it vegetable was celeriac. It was a bit cloudy and a slight orange color, likely from lots of carrots. There is a bit of \"sulfur onion funk,\" but it wasn't too overpowering. It also surprisingly didn't have any mushrooms or tomatoes, which are prominent in a lot of other store-bought vegetable broths. (We wish this had as much flavor as our umami-rich vegan broth.)Vegetable Better Than Bouillon kicked us with a lot of onion and garlic powder flavor. It tasted \"overdeveloped, like the vegetables were cooked for too long\" and like a \"vegetarian version of Marmite.\" The salt level was particularly intense in this one and tasted more like tomato and mushroom, so you would have to make sure anything you were making with it complemented those flavors. The Swanson vegetable broth was our favorite. We would use it over beef stock any day.In the end, our winner was chicken-flavored Better Than Bouillon which should definitely be diluted further than the package says, and used more as an additional flavoring agent for dishes rather than the base stock for a soup. You can keep it in the back of the fridge for times when homemade stock isn't an option, but we'll continue to encourage you to spend a weekend making stock, or make it in 30 minutes with your pressure cooker. Think of it as therapy. Self-care. A way to get through the cold months. Time to stock up.Buy a 3-pack of chicken Better Than Bouillon on Amazon for $19.1 / 10ChevronChevronToasted Garlic-Beef StockView RecipeThis is the best vegetable stock to keep on hand:Explore Bon AppétitStockTaste TestShoppingRead MorecookingThe Very First Thing You Make for Thanksgiving Should Be StockBy Brad LeonecultureWait a Second, Are Bone Broth and Stock the Same Thing?By Elyssa GoldbergtechniquesYou Don't Always Need to Cook With Stock (Except When You Really Do)By Rochelle Bilowcooking5 No-Brainer Ways to Use That Last Inch of Stock Hanging in Your FridgeBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "Alyse Whitney"]}