{"id": "033d629c6325c1bb3535e0ac18ae4feb", "url": "https://www.bonappetit.com/story/save-dry-cake", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Use a Cake Soak to Make Dry Cakes Moist and Moist Cakes Even Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Make a Dry Cake Moist (And a Moist Cake Moister)Sorry we said \"moist\" a lot of times.By Sarah JampelApril 1, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailIn your lifetime, there will inevitably be bad days, global pandemics (hopefully just this once though), and dry cakes. Sometimes you will be to blame: You overmixed, you mismeasured, you forgot to set a timer, you baked the cake at too high a temperature for too many minutes (if you’re me, all of the above). Other times, you can fault the recipe—not enough fat, too many dry ingredients without enough wet, a ratio that is just plain off.The good news is that it’s not only possible but easy to salvage a dry cake (maybe you know it’s dry from the way it looks or feels or because you snuck a small bite!) with a little simple syrup. By easy, I mean easy: Poke your loaf cake or layer cake (with a skewer, cake tester, or toothpick), then use a pastry brush to coat it generously with simple syrup, which will soak into the crumb through the channels you just created. That's it: You've successfully completed a “cake soak.”Fast-forward to minute 13 to learn all about cake soaks.\nA cake soak is a quick fix for dry cakes, yes, but it also serves to make good cakes even better, guaranteeing that they’re extra moist and extra tender. In Caroline Wright’s book Cake Magic, she suggests brushing syrup into a hot cake, then letting it cool completely in the pan until it’s no longer wet to the touch, 1–2 hours. “By bathing the cake layers in syrup right after they emerge from the oven,” she writes, “you make double use of the cooling time. While the layers cool, the syrup settles into the cake, changing the crumb and flavor with minimal work on the part of the baker.” She uses ½ cup simple syrup between two 8-inch cake layers.When it comes to changing the flavor, the simplest simple syrup won’t do much besides making the cake sweeter and moister. But Wright’s coak soak suggestions go way beyond sugar dissolved in water. By changing up the liquid—try cream, milk, coconut milk, apple cider, brewed tea or coffee, lime or grapefruit juice, root beer—and adding spices, extracts, herbs, and liqueurs, you can enhance the taste of a plain cake.Even if you forgot to add syrup to the cake hot from the oven, if you're making a multi-layered cake you can still apply a cake soak during assembly. For her famous Milk Bar Birthday Cake, Christina Tosi dampens each layer with a mixture of milk and vanilla extract as she stacks them. Claire Saffitz recommends trimming a cake layer first (rather than poking it) so that the syrup can more easily penetrate the interior crumb. In both of these cases, you’ll want to be careful about the amount of soak you use, as it can cause the cakes to oversaturate and disintegrate: Dab the soak over a layer just one time.With this technique in your pocket, you may never have to suffer through a dry cake again. Unless, of course, you’re served a slice at someone else’s house—in that case, just eat it. (Or ask for some whipped cream.)Want a slice?No-Mixer Vanilla Cake With Tangy Cream Cheese FrostingExtremely plush, fine-crumbed, and dare-we-say moist, this is like the best wedding cake—and you mix it entirely by hand.View RecipeExplore Bon AppétitBasically BakingCakeSimple SyrupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-01", "author": ["Condé Nast", "Sarah Jampel"]}