{"id": "034d4b03fe07e1f4139d8de6184ace40", "url": "https://www.bonappetit.com/story/mission-red-wine", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Mission Is My Favorite Do-It-All Food Wine  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMission Is My Favorite Do-It-All Food Wine This light, fruity, and easy drinking Californian red hits all the right notes.By Andre MackFebruary 12, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWelcome to The Pour, a monthly column about what we’re drinking (and loving) right now.Here’s a quick history lesson: Mission is believed to be the first grape ever planted in the state of California by missionaries back in the late 18th century. But over the years, as California wanted to compete with the world’s serious wine regions, grapes such as Mission were cast aside for more established ones like Chardonnay and Cabernet Sauvignon.Now, as modern winemakers explore the forgotten diversity of California grapes, these thin-skinned table wine grapes are helping them recapture a feel for the state’s wine identity when it was in its early days.You may have had Mission before. It goes by País in Chile and Lístan Prieto in Spain, where it is grown and vinified all over the Canary Islands. With the propensity for producing softly tannic, tart, chillable, low-alcohol wines, it’s easy to see how Mission has become a favorite of the easy-drinking glou-glou set. But the beauty of Mission is that while the light red packs fruit, it also has the savory, spicy traits of bigger reds, making it a do-it-all food wine too.So next time a za’atar roasted chicken, crunchy acidic salad, or crispy-skinned salmon hits my table, I’ll have a bottle of multidimensional California Mission right there with it. The deeper connection to America’s wine roots is just a nice bonus.Two Bottles to Try:Monte Rio Cellars Lodi 2019: Big-time fruit fragrance and lush herbaceousness (thanks, carbonic maceration) make this Mission especially nice when chilled before opening.Pax Mission “Somer’s Vineyard” 2019: Inspired by the winery’s departure from classic flavors of Chardonnay and Pinot Noir, this wine is all violets, spice, and strawberry-watermelon diesel.Andre Mack is a sommelier, winemaker, author, and designer based in Brooklyn. Check out his label, Maison Noir Wines, online and in-store.Read MoreculturePipeño Is Our Post-Zoom WineBy Joseph HernandezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-12", "author": ["Condé Nast", "Andre Mack"]}