{"id": "0376abc899658cfc3b6880361c0aa7e4", "url": "https://www.bonappetit.com/story/the-feel-good-food-plan-is-back", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "The Feel Good Food Plan Is Back! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Feel Good Food Plan Is Back!Everything you need to know about this year's Feel Good Food Plan, and other announcements from Healthyish editor Amanda Shapiro.By Amanda ShapiroDecember 13, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I'll get right to it: The Feel Good Food Plan is BACK! ICYM last year's plan, the idea is to cook 10 delicious, healthyish dinner recipes during the first two weeks of January and have a total ball while doing so. This year, we're back at it with 10 more hit dinners, a dessert you're gonna live for, and a meal prep strategy so you can pack a different lunch every day (no more boring, identical Tupperwares). What do you have to do to join the party? Make sure you're getting this newsletter and forward the sign-up link to your friends, parents, that guy you're kinda seeing, or anyone else you'll want to cook with come January, then keep your eyes peeled for the recipes—and some fun giveaways—which we'll drop before the end of the year.This Week on Healthyish, vol 1: Gift Guide HQLove it or hate it, we've officially hit the Christmas crush (note to self: good name for a punch recipe). To help you stay sane, we curated a few gift guides so you don't have to think so hard about what to get your sister-in-law with intimidatingly good taste, your friend who keeps threatening to move to California, your do-gooder cousin who swears she doesn't want a present this year (she does), or your mom who really needs a little pampering for once. And, for good measure, here are six ceramic mugs, none of which include dad jokes, and 10 books we Could. Not. Put. Down. in 2018. Consider these guides our gift to you.This Week on Healthyish, vol 2: FooooodMeanwhile our food editors have been producing true holiday miracles down in the test kitchen, like—[grabs airhorn]—MISO ALMOND BUTTER COOKIES. They taste like your favorite peanut butter cookie eloped with a salt shaker and went skinny-dipping in a dark chocolate pool. You'd think  Chris Morocco would be sick of baking after developing every single cookie recipe in Bon Appétit's December issue, but he's like the Energizer Bunny of cookies. Then, to clear his palate, he turned out a roasted broccoli recipe that just casually tastes like nacho cheese Doritos. Chris, you're a maniac and we love you.Vegan, but Make It FishI got an email the other day informing me that searches for the phrase \"eating pegan\" was up 337% on Pinterest. At first I read it as \"eating pagan\" and thought, WTF? But still: WTF? Turns out, \"pegan\" means that you eat vegan and also fish. Which I know is a trendy thing to do right now, but do we really have to give it a fake name? Can't we just say, \"I don't eat animal products except fish?\" And on that note, I wish we'd stop turning diets into identities: \"I'm paleo.\" \"I'm keto.\" \"I'm vegetarian-except-for-corn-dogs.\" Just say what it is you eat. Or you could, you know, not say anything and just eat.The 5-Star ReviewAs if I need more cookies in my life, one of Santa's elves (i.e. a harried mail carrier) dropped off a stack of Daily Harvest's new frozen, ready-to-bake cookies, and I have to tell you I've been dipping into the boxes every night for a week. Made with cassava flour and lightly sweetened with maple syrup, they're soft right out of the freezer, which is how I've been eating them, though I suppose you could, uh, bake them too.What I'm Reading NowA copy of Busy Phillipps's memoir, This Will Only Hurt a Little, found its way to my desk recently and, against my better judgment, I love this book. No, it's not To Kill a Mockingbird; it's like listening to Phillipps tell her life story on Instagram, which is what got her 1.3 million followers and this book deal in the first place. She's got good material! It's fun and suspenseful and you should read it just for the behind-the-scenes 'Freaks and Geeks' and 'Dawson's Creek' goss.Enough now with the cookies,Amanda ShapiroHealthyish editorP.S. Questions, comments, or joyful exaltations? We're at healthyish@condenast.com.Explore Bon AppétitHealthyishHealthyish NewsletterFeel Good Food PlanessayRead MoreLifestyleWe Try 'Euphoria Cocktails,' and How to REALLY Get the GlowBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Amanda Shapiro"]}