{"id": "0382fd424abeb8cb93aaa8b88da1182c", "url": "https://www.bonappetit.com/recipe/overnight-oats", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Overnight Oats Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOvernight OatsBy Claire SaffitzJanuary 24, 20224.4(29)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintOpen to infinite variations and requiring truly nominal effort, this creamy overnight oats recipe is the ideal make-ahead breakfast for those short on time (or energy) in the morning. Be sure to use old-fashioned rolled oats as steel-cut oats won’t soften enough, while instant or quick oats will simply disintegrate in the milky abyss. A batch can hold for four days in the refrigerator, meaning you’re set for most of the week if you meal prep on Sunday night.This base recipe is as easy as it gets (just oats, yogurt for protein, and dairy-free milk). It includes two optional add-ins (flaxseed and wheat bran). Both ingredients boost the fiber to keep you feeling full longer. Chia seeds would work well too.Toppings are what keep the oats interesting, so change them up often. For something savory, omit the sweetener and top your bowl with miso-braised kale and a jammy egg or ghee-toasted seeds and cashews. Meanwhile, combinations like banana, maple syrup, and tahini and coconut, dates, almonds, and honey offer a sweet and slightly earthy start to the day. And if all you have time for is a handful of blueberries and a scoop of your favorite nut butter, that works too. Looking for more healthy breakfast ideas? Right this way.Editor’s note: This recipe was originally published January 24, 2017.Ingredients4 servingsOvernight Oats:1cup old-fashioned oats½cup plain whole-milk Greek yogurt2tablespoons ground flaxseeds (optional)2tablespoons wheat bran (optional)1¼cups non-dairy milk (such as cashew milk, almond milk, soy milk, oat milk, or coconut milk), plus morePinch of kosher salt1–2tablespoons light agave syrup (optional)Toppings:Soft-Cooked Egg and Miso-Braised Kale (optional)Cashews, Seeds, and Turmeric (optional)Banana, Maple Syrup, and Tahini (optional)Coconut, Dates, Almonds, and Honey (optional)PreparationStep 1Combine oats, yogurt, flaxseeds (if using), wheat bran (if using), salt, and 1¼ cups nut milk in a medium bowl, re-sealable plastic quart container, mason jar, or large measuring cup. If serving with a sweet topping, add agave syrup and stir to combine. Cover and chill overnight.Step 2If desired, loosen mixture by stirring in a few more tablespoons of nut milk and let come to room temperature. Top as desired.Do Ahead: Oats can be assembled 4 days ahead. Keep chilled.How would you rate Overnight Oats?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI am so excited to be a part of this oatmeal family, great recipe as a start :)MaddyReno, NV2/18/2022I make overnight oats with half regular oats, half steel cut. I add a bit of brown, chia seeds and oat milk in a pint size mason jar. It makes enough for four days. In the morning, I take out one portion, heat it and add maple syrup, raisins and chopped pecans and more oat milk. So easy and delicious!  SooseaQSafety Harbor, FL2/7/2022I still prefer the consistency of steel-cut oats. If you add the salt AFTER you let them soak overnight, the oatmeal will soften more (basic science, see Alton Brown's episode on oatmeal). Then you can use steel-cut oats, which have a better flavor and toothsomeness. Also, if you start with water boiled in a kettle at the start then put in the fridge once cooled, you will also get more nutrition (science again) AND softening power.Jason B.Woodbridge, VA2/6/2022I make overnight oatmeal in a French jelly jar which also serves as my bowl in the morning(I only make 2/3 cup oats). If I am in the mood for warm oatmeal, I can heat it in the microwave. Fruit usually provides all the sweetener needed, fresh or dried, but a spoonful of Maple syrup is always good. Oatmeal as well as dried dates, walnuts, raisins, sunflower seeds, and maple syrup are all pantry items so it is a particularly handy recipe. When my family visits we have a “make your own” station the night before with lots of choices. Fun for all the oatmeal lovers, easy for me. Have you tried banana, peanut butter & chocolate? 😁PattonBirmingham, AL2/6/2022I have made this recipe several times now and it always turns out perfectly. I add 2 tablespoons of Chia seeds and I use dairy milk, and vanilla Greek yogurt. I also like to add a few shakes of ground cinnamon and I omit the sweetener since the vanilla yogurt add sweetness. A bowl of this in the morning with some sliced bananas, blueberries, or strawberries is delicious, easy, and very filling!CarolineCoastal NC, USA2/6/2022@Corinne try oat bran!Emma2/5/2022Is there an alternative for the wheat bran that's gluten free? Otherwise I won't add anything but the flax, but curious. CorinneLos Angeles1/29/2022Okay, I've never been a huge overnight oats fan, but this recipe turns out consistently well—I really like how creamy it is without being slimy. Definitely better if you include the flaxseed meal and wheat bran; considering how much of an improvement it is with those two ingredients, I wouldn't consider them optional. Great both sweet and savory, hot or cold. Even my partner who absolutely despises oatmeal considers this one \"tolerable.\" If that's not a ringing endorsement, I don't know what is!wizardlingBerkeley, CA10/9/2020Explore Bon AppétitOatRice & GrainsYogurtOther IngredientsQuickEasyVegetarianGluten-FreeHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-01-25", "author": ["Condé Nast", "Claire Saffitz"]}