{"id": "038bdb0a1e229583d85a9bc2a8ba03d8", "url": "https://www.bonappetit.com/story/light-and-ladder-planter", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "This Vayu Planter Deserves Your Kitchen Real Estate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Sculptural Planters Deserve Your Kitchen Real EstateLight + Ladder’s Vayu planter is the most beautiful little home for all my herbs.By Allie WistSeptember 14, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My kitchen recommendation of late is plants. Your home is likely already filled with them, but we don’t always give edible plants the same real estate as giant fig trees and ferns. For all your basil and cilantro, I advocate getting a nice planter like Light + Ladder’s sculptural Vayu planter.Most planters are quite uniform: round and consistent. What makes Light + Ladder’s planters so striking is that their surface plays with dimension, resisting the typical houseplant-pot dogma with designs reminiscent of 20th-century brutalist architecture. Sweeping platforms wrap around the planter’s walls and the result is something that’s both awe-inspiring and calming, a feeling we could all use in the kitchen these days.Farrah Sit, the designer behind Light + Ladder, creates many beautiful objects for the home, but she thinks her planters are the ones with the most avid following because her love of gardening is apparent in the design. “The aesthetic [of the planters] was an expression of that focused concentration and peace that you feel when you’re gardening,” she told me. “As I was taking care of a small veggie farm on my roof, at a particular time in my life when I was trying to figure things out, it gave me such a sense of peace. I wanted to bring that feeling to the planter design.”Many of us are staying inside our homes now more than ever, and I not only find some solace in these beautiful planters that keep me company, but I’m also able to use them to cultivate a micro-relationship with the world. I’m growing my own food at a small scale and engaging with the ecosystem in a new way. And when my tasks and days bleed together, I find that plants are more reassuring timekeepers than calendars and clocks.Photo courtesy Light \\+ Ladder / Brooke Holm VAYU Ceramic Tabletop Planter$80 at Light + LadderExplore Bon AppétitHighly RecommendherbShoppingRead MorecultureThis Granny Cart Is My Saving Grace Right NowBy Meryl RothsteincultureMy Label Maker Lets Me Pretend That Everything Is Under ControlBy Sarah JampelcultureThis Extremely Precise Electric Kettle Grounds Me in the MorningBy Rachel KartencultureI Never Knew I Needed an Office Toaster Oven Until This One Came Into My LifeBy Annalee SoskinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-14", "author": ["Condé Nast", "Allie Wist"]}