{"id": "038f44591ed15c034e52f54bfdc03dce", "url": "https://www.bonappetit.com/story/sourdough-is-not-the-only-bread", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Heads Up: You Don't Need a Sourdough Starter to Make Great Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHeads Up: You Don't Need a Sourdough Starter to Make Great BreadSoda bread! Flatbread! Literally anything else!By Jesse SparksApril 24, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Pearl JonesFacebookTwitterEmailThis may be hard to hear, but the truth often is: It’s okay not to make sourdough. This feels like a controversial take in the midst of the current sourdough stress-baking craze, but I mean it. Despite what your high school friends are saying in their IG lives, you don’t have to make sourdough. You can make great bread without making sourdough at all.As an avid baker who has churned out a few loaves of sourdough myself, I understand the urge to want to bake along with others. After all, the sense of community that comes from baking with or for others is one of the best parts of the process, and when so many of us are trying to feel closer to our people, baking feels like a way to display affection from a distance. But all of those warm and fuzzies aren’t null and void just because you’re not making actual sourdough.What even is sourdough, exactly? These naturally-leavened breads (meaning, no baking powder, baking soda, or store-bought yeast) get their distinct tanginess from the starter, the combination of flour and water that becomes the home for a colony of wild yeast. The process of nurturing the starter and then harnessing its power to bake is a sensitive one that requires a lot of time, patience, and flour. Success hinges on the starter’s health—and about a million other factors. That’s why many other breads use commercial leaveners to churn out consistent results. If you can find these (I know yeast is hard to come by these days), it’s totally okay to take advantage. Sourdough bread isn’t the only bread. Here are some of my favorites, no starter involved:Soda BreadA “soda bread” gets its lift from, you guessed it, baking soda. It can be a simple combination of baking soda, flour, buttermilk, and salt, or it can include sugar, butter, dried fruits, and seeds.Soda bread makes great toast.\nBeer BreadClassic beer bread channels the carbonation and flavor of beer to transform flour, sugar, and butter into a fluffy, slightly malty loaf. It’s an ideal choice for those looking to cut down on the effort of sourdough while still getting a final product with a more complex flavor profile. To make it, all you have to do is mix the ingredients together and transfer the dough into a buttered loaf pan. (If you’re looking for a recipe, I like this one from King Arthur Flour.) And while the ingredient ratios are pretty consistent, the recipe is forgiving enough to accommodate some slight tweaking.FlatbreadFlatbreads are a perfect alternative to more time- and ingredient-intensive recipes. Their beauty lies in how straightforward and almost foolproof they are. Because many are made without yeast (thanks, baking powder!), they come together quickly. Start with this caramelized zucchini flatbread and swap in whatever produce you might have on hand. You can even shower it with your favorite blend of herbs and spices to accompany any dinnertime dip situation.FocacciaIf you’re looking for something that will deliver a feeling of huge accomplishment, consider turning to this no-knead focaccia. Although it requires yeast to deliver that fluffy, pillowy texture, it’s still less labor-intensive than many other recipes. Once you’ve mastered the recipe, you can start experimenting with toppings. To do so, you’ll want to partially bake (a.k.a. parbake) your dough. Pull it out of the oven after 20 to 25 minutes, add what you'd like—test kitchen editor Sohla El-Waylly loves adding cherry tomatoes, chunks of mozzarella, and shaved ribbons of zucchini—and return it for the remainder of the cook time.Or take it one step further with pretzel focaccia.\nPhoto by Laura Murray, Food styling by Yekaterina BoystovaSandwich BreadWhile these recipes do require yeast, they're much lighter lifts than sourdough, delivering plush, slightly sweet loaves. Because sandwich bread isn't as potent as funky-tangy sourdough, it’s also significantly more versatile. You’ll be able to use it for toast, sandwiches (duh), French toast, bread puddings, croutons, and more. Start out with our go-to sandwich bread, this insanely soft milk bread, or a straight-forward honey whole-wheat loaf (I like this version from Bob’s Red Mill).At the end of the day, it’s the ~feeling~ and the nourishment of making bread that makes it so worthwhile—not whether that loaf was leavened with yeast harvested from nature or packed up in a factory. So cash in on the feels and take selfies with your round bois! Just because they're not sour doesn't mean they don't deserve your love.Get baking:1 / 33ChevronChevronPumpkin Bread with Salted Maple ButterView RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Jesse Sparks"]}