{"id": "03989cc0afb2db02780c7c499f5cf958", "url": "https://www.bonappetit.com/recipe/black-bean-and-sweet-potato-soup", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "BUSH’S® Black Bean Fiesta™ and Sweet Potato Soup Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® Black Bean Fiesta™ and Sweet Potato SoupFacebookPinterestTwitterEmailMake this simple and super-satisfying soup your go-to weeknight meal.PrintIngredients2 tablespoons unsalted butter1 medium yellow onion, minced (1 ½ cups)4 garlic cloves, thinly sliced3 ½ cups low-sodium chicken broth2 lb. sweet potato, peeled and cut into roughly 1/2-inch cubes (7 cups)¼ cup extra-virgin olive oil1 ½ teaspoons sweet paprikaKosher salt2 tablespoon fresh lemon juice1 (15.5 ounce) can BUSH’S® Black Bean Fiesta™Chopped fresh cilantro leaves and thin stems, for servingRecipe PreparationIn a medium saucepan, melt butter over medium. Add the onion and cook, stirring occasionally, until light golden, about 5 minutes. Add the garlic and cook, stirring, until golden, 2 minute. Add broth and sweet potatoes; season with salt. Increase heat to high and bring to a boil. Reduce heat to medium and simmer until sweet potatoes are tender, 8 to 10 minutes.Meanwhile, in a medium skillet, heat the oil over medium heat. Stir the paprika  into the oil and immediately scrape the oil into a medium heatproof bowl. Stir in the lemon juice. Season with salt.Return the skillet to medium heat and add the beans, cook, stirring occasionally, until beans are heated through, about 2 minutes. Keep warm.Working in batches, using a ladle to carefully transfer the cooked soup into a blender. Pulse until smooth. Return the soup to the pot.Ladle hot soup into 4 bowls and top each with warm black beans. Drizzle with paprika oil and sprinkle with cilantro.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansSoupSweet PotatoBlack BeanMainGluten-FreeNut-FreeSimmerDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}