{"id": "039a221eea40330422580b8a0760aed2", "url": "https://www.bonappetit.com/story/ba-variety-show", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Did You Catch Our Live Variety Show? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDid You Catch Our Live Variety Show?A good show for a good cause.By Adam RapoportMay 5, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.So we did this big Test Kitchen Variety Show Friday night on YouTube Live. Fourteen of us editors Zooming in from all over North America—Rick Martinez in Mazatlán, Mexico, Priya Krishna in Dallas, Molly Baz in Joshua Tree, Brad Leone (where else?) in Jersey, and lots more of us in New York.Our aim was to raise funds for José Andres’ tireless relief organization, World Central Kitchen—and we went all in to do so. Sure, we were sitting at home, gazing at our laptops, but a production crew was talking to us in our ear pieces, sliding us in and out of a virtual greenroom when it was time for each of us to appear onscreen. Animated graphic cards popped up between segments, and just like a proper telethon, we threaded the show with fundraising updates (“We just hit $69,333—let’s get to $100,000!).If you’re like me, and you grew up in the ’70s, it felt like watching The Carol Burnett Show with your parents. There were pet segments, game-show competitions, musical interludes, and an ensemble-cast opening that would’ve made Jack Tripper from Three’s Company proud.Want this letter before it hits the website? Sign up for our newsletter!As the show was coming together, what struck me as fascinating was that we managed to do all of this not despite the coronavirus but because of it. These past eight weeks have spurred us to become resourceful, more creative, and more efficient. In fact, the idea for the variety show was conceived months ago by our deputy editor Julia Kramer. But at the time, after several meetings, we decided there were too many reasons why it couldn’t happen.This time around, we decided it needed to happen. We not only wanted to raise funds for a deserving organization in need of them, but we wanted to provide our dedicated, supportive fans with something they could look forward to during these monotonous days and weeks of quarantine.If you missed the live broadcast of the show, you can still watch it in its entirety on our YouTube channel. And you can still give! The donate button beneath the screen works just fine. Last time I checked, viewers had donated $195,061. I’m thinking with your help we can get to $200K. What do you say?Watch the Variety Show now—and donate!Explore Bon AppétitAdam NewsletterRead MorecookingBeef and Bacon Stew, With Substitutions EncouragedBy Adam RapoportcookingBean Broth Is My Bone BrothBy Adam RapoportcookingA Recipe for When You Want to Stop WorryingBy Adam RapoportcookingWe've Got New Recipes to Transport YouBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-05", "author": ["Condé Nast", "Adam Rapoport"]}