{"id": "03a21863af7d13eb4ae49ee0e46ab316", "url": "https://www.bonappetit.com/story/olympian-food-influencers", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Olympics TikTok: Olympians Are Food Bloggers Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOlympic Athletes Are Food Bloggers NowSure, the Olympics are about sports. But on TikTok, they’re about food.By Karen YuanAugust 6, 2021FacebookTwitterEmailFacebookTwitterEmail“Tonight we’re in the main dining hall. Let’s see what we got to eat,” Erik Shoji, a volleyball player on Team USA, tells the camera. He brings a piece of cucumber sushi up to view. “Good.” Tuna sushi? “Good.” Shumai? “HOT. But so good.”The Olympics might be about sports, but on TikTok they’re about the food. Over the past couple of weeks, Olympians have been responsible for some of the app’s most popular food content: Shoji also filmed the dining options in Team USA’s High Performance Center, where the grilled vegetables, garlic pesto pasta, and steak are “cooked to perfection.” Ilona Maher, an American rugby player, reviewed the deep-fried cheese, spring rolls, and ramen in the main food hall. Irish rugby player Harry McNulty conducted a tour of the food hall and its Epcot-like carousel of cuisines. Australian tennis player Luke Saville vlogged about what he ate in a day—beans on toast, pasta, and dumplings (plus hydrolytes resembling an orange Fla-Vor-Ice pop, which took me straight back to summer camp).TikTok contentThis content can also be viewed on the site it originates from.Everything looks delectable. Olympic FoodTok is playing one of the most significant roles so far in the formation of the TikTok food aesthetic—the particular kinds of videos that fits the medium super well: phone shots by regular people (as regular as Olympians can be), close ups (the more graphic and gnarlier the better), and narration (whether by the user or the popular text-to-speech voice). Food writer Jonathan Nunn, in his Vittles newsletter, compares the TikTok food aesthetic to “ugly delicious,” the David Chang term to describe food that is gastronomically but not visually appealing. It doesn’t “fall within the traditional parameters of what is considered tasteful or beautiful,” but it’s still riveting.Never before have we had a front-row seat to all this Olympic food porn, and it’s a good reminder that many of this year’s Olympians include young millennials (zennials, cuspers, however you want to call them) and Gen Z—in fact, two-thirds of them are in their 20s. TikTok is not a surprising platform for them to use, and some athletes have been documenting their entire Olympics journey there, a notable one being Sunisa Lee, the 18-year-old gymnast who won three medals in women’s gymnastics including gold in individual all-round. For a dose of serotonin in its purest form, watch her lil’ post-win celebration dance.And yes, it’s not just food. Olympians are sharing tours of their dorms, including (safe for work) tests of the durability of their cardboard beds. They’re joining in on the new Photo Crop filter challenge, albeit from the Olympic Village, not their bedroom. They’re shooting day-in-the-life vlogs, which have a particularly surreal feel to them when the day starts with a jog through an avenue dramatically flanked by the Olympic rings and dotted with fellow early risers who happen to represent the physical peak of humanity. I can’t speak for everyone, but I’ve gotten so much of my Olympics content not from NBC but from TikTok (although NBC has an Olympics TikTok account as well). Following the game itself has felt somewhat unsatisfying this year due to its myriad controversies. Getting to know the personas and quirks of the athletes has felt far more entertaining—plus, these videos give access to scenes I’d otherwise never see. It’s reality TV, but at the Olympics.So what does it mean for the creator economy (however people define it!) to have reached the Olympics? It’s put the spotlight back on a certain type of content: the pop-up TikTok event, in which a crazy amount of single-service content populates the app for a blip of time (it’s not quite the same, but remember all the 2020 election videos?). The Olympics is an event that is unique in both its scale and ephemerality—it’s a Big Deal, but only for about two weeks. Its content is pop-up content and its creators are pop-up creators. These Olympian creators may or may not continue to post at such a volume outside of the Olympic Village, and an audience may or may not continue to have such an appetite for those posts.While OlympicsTok is highlighting what many realize by now—everything is content! Everyone’s a creator!—it's also helping expand and define the characteristics of the TikTok food genre. And showing us that athletes really do eat a lot.Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-06", "author": ["Condé Nast", "Karen Yuan"]}