{"id": "03aec8ade0ac87222b558445c5e223ea", "url": "https://www.bonappetit.com/recipe/eggplant-parmesan", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Eggplant Parmesan Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDEggplant ParmesanFacebookPinterestTwitterEmailSalting and pressing the eggplant before dredging it in the breadcrumb mixture will both season it and help it achieve a silky, creamy texture when baked.PrintIngredientsKosher Salt3 lb. Italian eggplants (about 2 large), peeled, sliced lengthwise ½\" thick2½ cups panko (Japanese breadcrumbs)1 cup all-purpose flour4 large eggs1 cup extra-virgin olive oil, divided, plus more for foil3 oz. Parmesan, finely grated (about 1½ cups)½ cup finely chopped basil2 20-oz. jars Barilla® Vero Gusto Sicilian Herb sauce1 lb. fresh mozzarella, thinly slicedRecipe PreparationLine a large rimmed baking sheet with paper towels and sprinkle with an even layer of salt. Top with a single layer of eggplant slices; season top of eggplant with salt. Top with a layer of paper towels and repeat process with more salt and remaining eggplant. Top with paper towels and place another rimmed baking sheet over; weigh down with a heavy pot or cast-iron skillet. Let eggplant sit until excess liquid is released, 45–60 minutes.Place racks in upper and lower thirds of oven; preheat to 350°. Place panko in a shallow bowl. Beat eggs to blend in another shallow bowl. Place flour in a third shallow bowl. Working one at a time, dredge eggplant slices in flour, then dip in egg, allowing excess to drip off. Coat in breadcrumbs, packing all around; shake off excess. Transfer to a clean rimmed baking sheet as you go.Heat ½ cup oil in a large skillet, preferably cast iron, over medium-high. Cook as many eggplant slices as will comfortably fit in pan, turning once, until deep golden brown, 5–7 minutes. Transfer to paper towels and let drain. Repeat with remaining eggplant, adding ½ cup oil and wiping out skillet as needed.Toss Parmesan and basil in a medium bowl. Pour out any excess oil in skillet and wipe out, or use a shallow Dutch oven. Spread 1 cup Vero Gusto sauce over bottom of skillet. Top with a layer of eggplant slices (trim as needed to fit). Drizzle another 1 cup sauce over. Top with one-third of Parmesan mixture and one-third of mozzarella. Top with another layer of eggplant, followed by 1 cup sauce, then half of remaining Parmesan mixture and mozzarella. Repeat process with remaining eggplant, sauce, Parmesan mixture, and mozzarella. Tightly cover with lightly oiled foil and bake on a rimmed baking sheet on lower rack until eggplant is custardy, 45–55 minutes.Remove skillet from oven and heat broiler. Uncover eggplant parm and broil on upper rack until cheese is bubbling and browned in spots, about 4 minutes (broilers vary wildly, so start checking after 1 minute to be safe). Let rest 30 minutes before serving.Eggplant parm can be baked (don’t broil) 2 days ahead. Let cool; cover with foil and chill. Reheat in a 350° oven, uncovering halfway through, until bubbling gently at edges before broiling.Recipe by Carla Lalli MusicSponsored by Barilla® Vero GustoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBarilla® Vero GustoCasseroleItalianEggplantMozzarellaMainVegetarianNut-FreeDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}