{"id": "03b06b2339dfa555484d9dce3ab4b965", "url": "https://www.bonappetit.com/story/rose-sangria", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "You Love Rosé. I Love Rosé. Let’s All Make Some Rosé Sangria. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Love Rosé. I Love Rosé. Let’s All Make Some Rosé Sangria.And serve it with smashed cucumbers, tons of green summer herbs, and sparkling lemon soda.By Alex BeggsMay 8, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWhat’s pink and green and not a J. Crew catalogue? This rosé sangria. You thought you’d get away from us this spring without a rosé cocktail recipe, didn’t you? Well I didn’t. I will politely sit here while you complain about rosé, how over it you are, how corporate it’s gotten, how much better a zippy Grüner Veltliner is, yada yada. I know you love it. I know you’re just saying that to be a contrarian. That kind of anger is for Twitter, not life. Let it go.But instead of going the fruit salad sangria route, all mushy orange slices and bitter blackberries, we went in more of a preppy spa water direction. I don’t hate myself for writing that, because I tasted it and it’s wonderful: slightly salty, bright and herbal, refreshing and crisp. It’s pink, yes, but I don’t judge a pitcher of booze by its color. And neither should you.The recipe: We’ve got rosé, white vermouth (it plays up the cucumber and herbs because of the vermouth’s botanicals), Persian cucumbers (more concentrated flavor, less mush than other types), a fistful of herbs (use your favorite, like basil + mint), and a sparkling soda topper like Limonata, Sprite, those Trader Joe’s Italian sodas, or just use a bit of club soda and a squeeze of lemon.We love to smash.\nPhoto by Alex Lau, food styling by Judy Mancini.There’s one step you can’t skip. I know we talk about smashing cucumbers a lot here—uh, we’re sort of obsessed with it—but it serves a purpose. It starts to release the juices of the cuke, and you’ll get much more cucumber flavor than you would if you tossed some chopped wedges in there. Go this tiny extra step, people!While red and white wine sangrias can sit with the sugars of berries (and added sugar) and become close to syrupy, this sangria is lighter, and almost on the savory side. Can we even call it a sangria? Cucumber is a fruit! There’s wine. Who’s to say, really. It’s somewhere on the road to a spritz, to be honest. But we have more important things to debate. For now, set your sights on the pool, a funny but not too braggy vacation auto-response, and a pitcher of rosé sangria. It’s quite chuggable, as sophisticated people with wide vocabularies would say.Get the recipe:Rosé All Day SangriaWe like to think of this refreshing sangria as spa water but with a little buzz!View RecipeOr go with another pink drink—they’re all winners:Explore Bon AppétitVermouthRoseCucumberCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Alex Beggs"]}