{"id": "03c7cbcb303a2c154101d4b891a7f19e", "url": "https://www.bonappetit.com/recipe/red-pesto-pasta", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Red Pesto Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRed Pesto PastaBy Molly BazJune 1, 20194.6(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThis red pesto (the third in our Italian flag–hued pestos, after green and white) tastes like a mash-up of your favorite spicy arrabbiata sauce and the savory anchovy-garlic dip bagna cauda. All of which is to say, it’s delicious.Ingredients4 servings6oil-packed anchovy fillets4garlic cloves, smashed¾cup extra-virgin olive oil½cup walnuts3Tbsp. double-concentrated tomato paste2red Fresno chiles, split lengthwise, seeds removed3Tbsp. fresh lemon juice3oz. finely grated Parmesan, plus more for serving½tsp. kosher salt, plus more1lb. spaghetti2Tbsp. unsalted butter, cut into piecesPreparationStep 1Cook anchovies, garlic, oil, and walnuts in a small saucepan over medium heat, stirring often, until walnuts are deeply golden and garlic is just beginning to turn golden, 4–5 minutes. Add tomato paste and cook, stirring often, until it turns a shade darker, about 2 minutes. Remove pan from heat and let cool 5 minutes.Step 2Transfer walnut mixture (including the oil) to a food processor. Add chiles, lemon juice, 3 oz. Parmesan, and ½ tsp. salt. Pulse until a thick paste forms.Step 3Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1½ cups pasta cooking liquid.Step 4Scrape pesto into a large bowl and add butter, then pasta and ½ cup pasta cooking liquid. Using tongs, toss pasta vigorously, adding more pasta cooking liquid if needed (you may not need all of it), until glossy and well coated with sauce.Step 5Divide pasta among bowls. Season with more salt and top with Parmesan.Step 6Do Ahead: Pesto can be made 5 days ahead. Cover and chill.How would you rate Red Pesto Pasta?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleVery good. Like Jane, I used anchovy paste. Cut recipe in half- with close approximation of the ingredients. Used red pepper flakes as I had no peppers to add.  This will be made again most definitely. HopsingOregon6/23/2021Make this! I wasn't sure about this but it really was good.  I used Anchovy paste because that's what I had.  this is much better than the sum of it's parts,  I didn't use as much pasta water as it asked for and it was delish.Jane3/2/2021This is one of the best pastas I have ever had!!! I’ve never tried red pesto before and now it’s a new favorite. This dish is an umami bomb! Made it exactly as written, no changes needed. AiliLivonia, Michigan 12/21/2020Quite possibly one of the best pastas I've ever had!  PERIOD.  I've cooked a lot of pastas at home, and had pasta in the some of the best restaurants of SF and NY, as well as eating up and down the boot of Italy twice... and this is truly one of the best pastas I've ever had.  However, it may not be for everyone.  It's very salty and spicy and oily... all descriptors I love.  So if you're a fan of more subtle flavors, this one may not be for you.  Highly recommend!AnonymousSan Francisco, CA6/19/2020I LOVE this pasta. It's become one of my go-tos. I've probably made it 10 times and every time I can't believe how good it is. It has a really nice depth of flavor. It's easy to make too - very simple pantry ingredients. When I don't have the chiles, I use red pepper flakes instead. AnonymousNY5/21/2020SOOOO delicious. And really simple ingredients. Kimberly OkazakiSan Francisco5/8/2020It pains me to write this because every recipe I’ve tried on BA has been superb. Followed the recipe to a T and unfortunately family all disliked it so I had to whip up another dish at the last minute. I’ve cooked various dishes in the past using anchovies and sardines but sadly, this particular dish just didn’t hit the spot. AnonymousNYC5/8/2020OMFG this is delicious! I used 1 tbsp white miso instead of the anchovies (vegetarian things), and it still turned out amazing. I've made it twice now and will likely continue to make it often.AnonymousToronto4/6/2020This recipe is absolutely amazing. I've made it twice now and wish it were easier to find fresh peppers where I live so I could make it again and again. I made it for my parents and my dad said he would pay $20 in a restaurant to eat it, he thought he was complimenting my cooking but in reality it's just a testament to how truly perfect this recipe is!AnonymousIN3/11/2020absolutely delicious, my fav pasta recipe to date and they always come from molly. i adapted a little using half breadcrumbs half walnuts, and replacing half the amt of anchovies with fish sauce. worked fantastic in my humble opinion~niccsuxSingapore3/1/2020I discovered my last can of anchovies had gone very, very off when I opened it to make this pesto. I subbed with a tablespoon of red miso and it came out really good, but I can’t wait to try it again with anchovies. I really love the walnuts in this, more than pine nuts in a standard pesto.erin schmidtCanada1/26/2020This is so delicious. One of my favorite pasta dishes ever. The flavors are just so good and deep and amazing. AnonymousPhilly 1/19/2020Love this recipe! So simple and comes together in a snap. Used red jalapeños instead of fresno chilies and the heat was perfect.AnonymousSeattle1/6/2020Absolutely delicious and SO easy to make. It comes together really quickly so is perfect for a satisfying weeknight meal!AnonymousVancouver, Canada10/17/2019substituted the anchovies for capers being vegetarian and loved it!!  was easy to make and delicious, will definitely make it again.  a great way to make a pasta dish a little more interestingbellasgonemissingAustralia7/18/2019Explore Bon AppétitPastaItalianEuropeanSpaghettiPasta & NoodlesFresno ChileChileVegetableAnchovyFishSeafoodTomatoQuickEasyWeeknight MealsMainLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-01", "author": ["Condé Nast", "Molly Baz"]}