{"id": "03e2a250becb927d7d47d09dac3f9250", "url": "https://www.bonappetit.com/story/oprah-winfrey-secret-talent-stain-removal", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Oprah Winfrey's Secret Talent Is Cleaning Stains Out of Carpets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOprah Winfrey's Secret Talent Is Cleaning Stains Out of Carpets\"STAAAAIN REMOVAAAAL!\"By Andrea ParkJanuary 25, 2018FacebookTwitterEmailFacebookTwitterEmailYou get a clean carpet! And you get a clean carpet! Twenty-one dogs and countless \"accidents\" later, that's Oprah Winfrey's longest-lasting rallying call. As she reveals in a new episode of Vanity Fair's \"Secret Talent Theatre,\" over the years, the media mogul has become something of an expert in the art of stain removal. And now, she's sharing her tried and true strategy for lifting red wine, gravy, and, yes, dog poop right out of the carpet with the rest of us mere mortals.In the clip, Oprah uses gravy as a stand-in—apologies in advance for ruining your next Thanksgiving dinner—for dog...mess. She pours the gravy-poop on a patch of fluffy white carpet and, before it can soak in, covers it with a healthy dose of club soda. As Oprah explains, the club soda \"loosens the stain, bubbles it up—don't know how that happens—and makes it easier for you to blot, so that you're not just pressing it further down into the carpet.\" She continues to alternate between dousing the stain with club soda and blotting it with a washcloth, growing increasingly more excited as the stain slowly but surely starts to disappear. \"This is fantastic!\" she exclaims at one point. \"I love the bubbling part. This excites me.\" Before putting down the club soda, she lets out another \"FANTAAASTIC!\"Next, the Wrinkle in Time star pours a small amount of \"plain old dishwashing liquid\" on the washcloth and dabs at the stain. \"Not a lot, just a little, because if you get too much, now you're gonna have dishwashing liquid all in your carpet,\" she advises. After the stain is almost gone, Oprah brings back her beloved club soda, squealing with delight as it fizzes on the carpet. \"It's a club soda fizz cake!\" she shouts, before noting that the carpet actually looks whiter than it was before The Great Gravy Incident of 2018. After giving the treated area some time to dry and fluffing the carpet a little, she lets a out one last contagiously joyful yell: \"STAAAAIN REMOVAAAAL!\" 10/10, would watch Oprah give cleaning advice for hours on end.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Andrea Park"]}