{"id": "03f06176f61646c84737b2e98c9d3196", "url": "https://www.bonappetit.com/story/5-most-common-baking-questions", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "5 Most Common Baking Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour 5 Most Common Baking Questions, AnsweredExcluding “Can I have another piece?”By Sarah JampelApril 17, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.The Basically Guide to Better Baking* has come to an end and I’m already feeling nostalgic. Call me a sap! Just as amazing as seeing pictures of your biscuits and buns and brownies was reading all of the posts on the Basically Baking forum. You had questions! And we sometimes had answers?We may have learned more from you—in terms of what recipes you’d like us to develop, what information we should include, and what’s tripping you up—than you did from us. These are the five questions that came up over and over again, plus our best attempts at adequate responses.*Did you love the Basically Guide to Better Baking? Or not so much? Fill out our extremely brief survey—we’d love to hear from you!1. Can I swap this for that?I’d guess that nearly half of all questions on the forum revolved around whether you could swap in what you had on hand and still make the recipe successfully. This is a) not surprising and b) perfectly reasonable, considering everyone has their own preferences, dietary restrictions, and fridge contents. This was true before the global pandemic—and even more relevant now.I think that the thing to understand about baking subs, as opposed to cooking subs, is that until someone has tried it in that very recipe, it’s hard to say for certain if it will work (which is why we often gave you such wishy-washy, inconclusive answers). So you’ve swapped light brown sugar for dark brown sugar in a cake with no problem—that’s not a guarantee it won’t affect your cookies.When deciding whether to make a swap, consider these questions:Is the ingredient critical to the structure, texture, and/or chemical composition of the baked good? Think: sugar, flour, eggs, fat, yeast, leaveners (baking soda/powder), dairy products like milk or yogurt. If the answer is yes, the risk of swapping is big.Or is its sole purpose flavor? Think glazes, fillings, or add-ins like nuts, chocolate, or extracts. Those aren’t likely to affect the make-up of your finished product—go wild!Is the ingredient you want to swap out similar to the ingredient you want to use in its place? You’ll usually have the most success with something that’s comparable in terms of fat, acid, protein, sugar, and moisture. A few examples tol reveal the nuance: Nuts and seeds are fatty, small, and likely exchangeable. Honey and maple syrup are both liquid sweeteners and can often, but not always, trade places. Plain yogurt and Greek yogurt can sometimes stand in for each other, but it’s not guaranteed—Greek yogurt is much higher in protein and lower in moisture, which could affect delicate yeasted doughs.Is my recipe relatively forgiving? Will I be okay with cookies that are too pudgy or too flat? Will I want to eat this cake if it’s a little dense or tough? If the answer is “sure, give me anything sweet and tasty,” go for it.Might it be better to choose another recipe entirely? While we’d be sad to see you go, sometimes it’s the right choice.No yeast? No flour? Probably can't make focaccia. :( \nPhoto by Laura Murray, Food Styling by Susan Spungen 2. I bake with Trader Joe’s/Costco/Whole Foods sea salt—how much should I use?Salt is giving you grief. While we develop recipes with Diamond Crystal salt (and cross-test to make sure Morton will also work), many of you asked about using salt that falls outside of these two. You want to bake with sea salt, fine sea salt, or—if you’re my mom—iodized table salt.I encourage you to get kosher salt, but if you’re working with what you have, the best way to convert between different kinds* is to measure by weight (1 Tbsp. Diamond Crystal weighs about 8 grams). This is yet another reason for us to provide you with weights for salt and for you to buy a scale so that you can actually use that information to move freely between brands.* Save finishing salts—like flaky salt or that Himalayan pink sea salt you got in a Secret Santa five years ago—for just that: finishing.3. Can I bake this recipe in a different pan?The answer is usually yes, but with some adjusting. The volume capacity of any pan depends on its shape and height of its sides (remember tenth grade geometry?). I use this handy guide to determine if I need to scale the recipe up or down and by what percentage. It’s also important to keep in mind that changing the pan will also change the baking time—more incentive to bake to the indicator, not the time and to start checking early. If your pan is bigger than the one called for and you haven’t increased the amount of cake batter, for example, that batter will be spread thinner and will cook faster. (And it’s always better to check too early than too late!) On the other hand, if you’re using a glass pan rather than a metal one, don’t be alarmed if you have to add many minutes to the baking time.We also noticed that some of you are baking in silicone pans. [Insert screaming face emoji] And while silicone is a great nonstick material, it does a REALLY bad job of conducting heat, which means your cakes and brownies and bars won’t rise or brown or set up properly. Save your silicone molds for frozen desserts and sticky things like caramels and fudge. Same goes for silicone mats. While they’re invaluable for certain applications, they’re actually not doing your cookies any favors. Cookies baked on nonstick silicone mats will spread more compared to cookies baked on parchment. Okay, silicone rant over!Use your buckwheat to make this gorgeous galette. \nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen Kaminski4. Where do I find buckwheat flour?So no one wants to track down buckwheat flour. Duly noted. But if you did snag some to make these buckwheat chocolate chip cookies, you could use it to make…Oat and buckwheat pancakesBuckwheat banana breadChocolate and buckwheat wafflesSeeded buckwheat cookiesFruit galette with a buckwheat crust5. My cookies spread. My cake didn’t rise. My focaccia didn’t brown. What happened?If you’ve already ruled out the other usual suspects and you followed the recipe to a T, we have one more question: Do you have an oven thermometer? If you had an inexplicably weird result, we're going to go ahead and blame your oven. We know we’ve said this a million times, but if you don’t have a thermometer yet, get one: It’s the only way to know if you’re actually baking at the recommended temp.Our baking series may be over, but the forum is still open. Even if we're slower than usual to answer questions, I'm sure your fellow bakers will be ON IT.More baking intel:1 / 10ChevronChevronThe non-negotiable, must-buy baking toolsYou know how it’s okay to guess on the SATs but not on your medical history? Well it’s fine to estimate when cooking—a tablespoon here, a handful there—but not when baking, where an extra 25° F and ¼ cup flour can be the difference between chewy cookies and super-thin mutants that spread into one giant Pangea. Together, a scale and an oven thermometer will eliminate risky guesswork, lighting your path to success. Here’s why:\n\n\nElectronic scale: One cup of any dry ingredient varies in weight depending on how densely it’s packed, but with a scale, you can make sure your measurements are correct and consistent. No more cake-like cookies or brick-like cakes. Not only will a scale save you from cleaning sets of measuring cups (tedious!), but you’ll also use it for brewing coffee and figuring out how many sweet potatoes equal a pound. Click here to read more about how food director Chris Morocco fell in love with this scale—and why thinks you should have one even if you aren't a baker.\nBuy It: Escali Primo Digital Scale; $25, amazon.com\n\n\nOven thermometer: Brownie bottoms burning before the interior’s cooked through? Scones slouching rather than standing straight? Sounds like you’ve put too much trust in that oven dial. Unless your superpower is to detect the difference between 325 and 375° by feel alone, a thermometer is the only way to know if your oven is actually at the right temperature, whether you’re baking biscuits or roasting chicken. \nBuy It: Rubbermaid Instant Read Monitoring Thermometer; $7, amazon.com\n\nExplore Bon AppétitBasically BakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-17", "author": ["Condé Nast", "Sarah Jampel"]}