{"id": "0404fd769742b110e97f8feb0b3bcd64", "url": "https://www.bonappetit.com/story/layer-cake-decorating-tips", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "How to Stack a 2-Layer Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Stack and Decorate a Layer Cake Without an Architecture DegreeBecause it should look as good as it tastes.By Lisa RulandMarch 29, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEven the most fastidious pastry chef (I may or may not have two pairs of culinary tweezers, X-Acto knives, and a protractor in my kitchen drawer) can acknowledge the charm of an imperfect-looking layer cake. Layer cakes are the best of home baking: nostalgic, accessible, and made with love. If someone offered me the option of a perfect bakery cake or a slightly slumped homemade one, I’d choose the homemade version every time.That said, there is no reason not to let your layer cake look as good as it tastes—especially since it may be the centerpiece of the party. Now that you can bake a layer cake, here are six essential tips for decorating it.1. Stack it evenlySome cakes dome when baked. Stacking cakes with rounded tops means less stability and an uneven-looking result. Get down to eye level with your cake layer, then use a long serrated knife to slice off the domes.I prefer not to slice all the way through the cake in one cut; you are more likely to cut crookedly that way. Instead, slice into the cake about a third of the way toward the center, then give the cake a quarter turn and slice toward the center again. Repeat until you work all the way around the cake, and, finally, cut through the center and lift off the dome. (It helps if you have a turntable—more on that below.)Next, stack your top cake layer upside down so the bottom of the cake faces up. Now you have a perfectly flat, crumb-free cake top. Some people discard the cake tops. I call them a perfect snack.2. Invest in a turntable (the other kind)I’m not talking about your vinyl. A cake turntable makes cake decorating a smooth operation in every way. The heavy cast-iron Ateco version is the gold standard, but less-expensive versions abound.If you use a turntable, you’ll also want to buy inexpensive cardboard rounds for under the cake. That way you can support the cake and transfer it to the serving plate (or box) without risking the cake cracking or collapsing. A smear of buttercream will “glue” the bottom cake layer to the cardboard. A folded, damp paper towel or piece of tape between the turntable and the cardboard keeps the cake from shifting on the table as you decorate it. Cardboard rounds also build a little extra height to the cake (I often tape two together) and keep the cake knife from scratching your nice platter.3. Use an offset spatula—or a handy altMost bakers swear by offset spatulas, large and small, to spread and even buttercream on a cake. An offset spatula—a straightedge, leveling tool, and spreader all-in-one—is worth the investment.But offset spatulas aren’t the only tools that can pull buttercream duty on a layer cake. Bench scrapers and even household rulers are common tools as well—especially for spreading buttercream evenly on the sides of the cake. Place the long edge of the ruler or bench scraper flush against the side of the cake after you’ve added buttercream, resting the bottom edge on the cake turntable or plate. Then drag the ruler around the cake, or rotate the cake on the turntable, if using, to create smooth, evenly buttercreamed sides.(Added bonus: A ruler lets you ensure that all sides are an even height. Rather than eyeballing the cake for evenness, you can hold the ruler parallel to the cake sides and precisely measure the heights.)4. Cover your cake plateIf you don’t have a turntable, no problem—you can build your cake directly on the platter. To keep your serving plate crumb- and frosting-free, place strips of parchment or wax paper on the cake platter, set the cake on top of the strips, and decorate. The strips should be wide enough to extend to the edge of the plate. After you’ve finished decorating, pull the parchment strips away to reveal a pristine cake platter.5. Add a little something on topSprinkles on a cake are always the right decision. But there are a few other ways to decorate a cake with almost zero effort.Fresh berries, maybe dusted with a little powdered sugar, always look gorgeous and pair well with both chocolate and vanilla. For chocolate cake, buy a bar of chocolate and run a vegetable peeler down the sides to create instant mini chocolate curls. For carrot cake, dip long carrot peels into warm simple syrup for about 30 seconds. Drain, then wind them into rosettes.6. Have a backup planWe’ve all been there. If, despite offset spatulas, turntables, and tutorials, your cake looks like a schlumpy fail, just pile on the buttercream and use the back of a spoon to create pillowy swirls.Let’s bake a cake!No-Mixer Vanilla Cake With Tangy Cream Cheese FrostingExtremely plush, fine-crumbed, and dare-we-say moist, this is like the best wedding cake—and you mix it entirely by hand.View RecipeLisa Ruland is a recipe developer, pastry chef, and food writer living in Washington, D.C., and Brooklyn.Explore Bon AppétitBasically BakingBakeCakeDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-29", "author": ["Condé Nast", "Lisa Ruland"]}