{"id": "041a3dc32b39f7170fca0fdfefd8c8f9", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/kaptajn", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Kaptajn Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenKaptajnA laid-back lakeside hangout, with skewered meat and lots of natural wineFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: to experience another side of Copenhagen. The Ancestrale wine bar team opened this restaurant by the lakes. It’s fun to bike here in good weather and sit on the waterfront micro-terrace for a few bottles of natural wine and pretty plates that add up to a very nice, pleasantly affordable meal.ORDER THE: tartare; cured Danish mackerel; and anything on the yakitori grill.THE VIBE IS: quietly stylish and always easygoing.PRACTICAL STUFF: Open Wednesday to Saturday, from 5:30 p.m. to midnight. Closed Sunday to Tuesday.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEAncestraleIn Vesterbro, a cool little wine bar (and a relief to your wallet) Restaurant SchønnemannGet the OG Copenhagen experience at this Indre By *smørrebrød* destinationJuno the BakeryFuel up for those canalside bike rides with these outstanding Østerbro carbsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}