{"id": "042ced6e1f2789cf54246c265a9a8f21", "url": "https://www.bonappetit.com/recipe/spicy-and-tangy-broth-with-crispy-rice", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Spicy and Tangy Broth With Crispy Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSpicy and Tangy Broth With Crispy RiceBy Andy BaraghaniAugust 21, 20204.1(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“A good broth should be able to stand on its own—not just in the background of a stew,” says Andy Baraghani. “This version is inspired by rasam, a South Indian soup that typically gets its tangy flavor from tomatoes and tamarind juice, and it’s the one I’ve been making on repeat. It’s pungent, spicy, and garlicky. It comes together quickly and is tasty on its own, added to a braise, or ladled over crispy rice with a handful of herbs.” In lieu of tamarind, this recipe leans on tomato paste and lime juice for that fruity acidity. Parboiling gives the rice a head start before getting steamed in a nonstick skillet where the bottom layer gets crisp.Ingredients4 ServingsRice1cup long-grain rice (such as basmati or jasmine)Kosher salt½cup plain whole-milk yogurt (not Greek)⅓cup vegetable oilBroth and Assembly¼cup ghee or vegetable oil8garlic cloves, thinly sliced1green chile (such as serrano), thinly sliced, 1 dried chile de árbol, crumbled, or ½ tsp. crushed red pepper flakes2tsp. ground coriander1tsp. cumin seeds½tsp. ground turmeric¼cup double-concentrated tomato paste2tsp. raw sugar or granulated sugar1Tbsp. (or more) fresh lime or lemon juiceKosher salt½cup cilantro leaves with tender stems or torn mint leavesPreparationRiceStep 1Rinse rice in a fine-mesh sieve under cool running water until water runs clear. Bring a medium pot of heavily salted water to a boil over high heat. Add rice and give it a few stirs to prevent it from sticking to the bottom of the pot. (The water will stop boiling once the rice is added.) Cook until water returns to a boil and rice is nearly doubled in size, 2–6 minutes, depending on the quality of your rice. Rice should still be on the slightly al dente side and not fully cooked. Drain rice and rinse under cold running water to stop it from cooking further. Reserve pot.Step 2Mix yogurt and 1 cup (about two thirds) parcooked rice in a medium bowl. Heat oil in a large nonstick skillet with a lid over medium. Scrape in yogurt mixture and spread out into an even layer. Scatter remaining rice over and cover. Let cook, turning pan 180° halfway through to ensure even cooking, until rice along edges is starting to look crisp (it’s okay to peek), 8–10 minutes. Reduce heat to low and continue cooking (still covered) until rice around edges of pan is golden brown, 10–15 minutes. Remove from heat and let sit (still covered) 5 minutes.Broth and assemblyStep 3While rice is cooking in skillet, combine ghee, garlic, and chile in reserved pot and place over medium heat. As soon as oil around garlic starts to sizzle, start stirring occasionally and cook until garlic is barely golden, about 3 minutes. Sprinkle in coriander, cumin seeds, and turmeric and mix until turmeric has stained garlic and ghee, about 20 seconds. Scrape in tomato paste and cook, stirring often, until slightly darkened in color and beginning to stick to bottom of pot, about 3 minutes. Pour in 5 cups cold water; bring to a boil. Reduce heat to medium-low; add sugar and lime juice and season with salt. The broth will be thin but should have lots of flavor. Taste and add more lime juice and/or salt if needed.Step 4To unmold crispy rice, remove lid from pan, invert a large plate on top and invert rice onto plate like a cake. Divide rice among bowls and ladle broth over. Top with herbs.How would you rate Spicy and Tangy Broth With Crispy Rice?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleClarifying, you add 1 green chile + red pepper OR the dried chile’s? How did evryone find the heat on this dish? Thx!PTWJ3/18/2022I used 2 cups of chicken broth 3 cups cold water instead of the five cups cold water… it added a lot of flavor. DeliciousAnonymous1/20/2022It smelled sooooo wonderful while it was cooking, but when I took a sip it was lacking in flavor. It definitely wasn't bad, my boyfriend actually loved it and claimed all the leftovers, but I wish the spices came through a bit more. To me it tasted like a watery, lightly spiced, tomato soup. I wish I used tamarind instead of lime because that might have upped the tang a bit.SarahIN1/28/2021OMG So good! I had to substitute with brown basmati rice (I boiled it for like...15 minutes and it finally reached \"slightly under\") and sour cream (fine but probably not close to ideal). Really loved the flavors and how quickly it came together. The rice seemed intimidating but you can do it!Allie J.Chicago, IL1/14/2021I don't know how anyone is ending up with a bland result making this dish. It has an astonishing amount of flavor for such a thin broth and is my new absolute favorite dinner fallback. I almost never repeat recipes because I'm constantly rushing off to make new ones, but I've made this several times now with ever increasing delight and crave it constantly. It is light yet satisfying, bright but punchy, and even though I have never once gotten my rice to successfully detach from the pan, I don't even care because this dish is a perfect eating experience and I love it with all my heart. HariraiSanta Fe1/4/2021Awesome. Spicy, tangy, cozy, crunchy ... I wouldn't change a thing. Great recipe, Andy!JTMadison, WI12/22/2020remarkable that we can cook like this at home! easy to follow recipe.cglos angeles,ca11/6/2020The broth is great but greasy, it does not need as much ghee as called for in the recipe. I used more tomato paste and more lime. Next time I will use half as much ghee. My rice did not come out and considering how many fat-based calories this recipe has I'm just not eating it. I also wish the soup had veg. I'm eating some baked salmon in it. Next time I'll make the broth and add leafy green veg in it and fish. In summation, I like the broth with less ghee and I'd like to utilize it elsewhere.Mari K-CGrand Rapids, MI11/6/2020I used crushed tomatoes instead of tomato paste and used veggie stock to make it a broth/soup consistency. I also added a minced onion and 1.5 Tbs tamarind paste, 1 jalapeño seeded and finely diced. This is now a favorite!Seattle 10/27/2020I followed the recipe but found it bland. I had to spice it up further with tamarind paste, fish sauce, more lime juice, salt and sugar. ZeegsMelbourne, Australia.10/10/2020Hello!  I look forward to making this because it sounds absolutely delicious!!  Tamarind is one of my most favorite things ever and would like to make this with it, however there are no instructions on how to substitute for the tomato paste and lime...is there anybody out there who can help?  Thank you so much.  daffodil67Los Angeles, CA10/5/2020I love this recipe so much! I learned to make crispy rice and the broth is so so good. I added salt, sugar and lemon (no limes in quarantine kitchen here) to taste, cooked it a bit longer until reduced and it was perfectly sour, sweet and salty. Will make this the whole winter long!AnonymousBerlin, Germany9/20/2020Yum! I used more tomato paste (the whole can), because I seem to never ever use the rest of a partial can, but it was exactly what I needed. Cozy, simple, deliciousAnonymousMinneapolis, MN9/19/2020This was a very flavorful broth. Spice was definitely present which I liked, but wasn't expecting because I am used to spicy recipes always falling short on the spice level. The steps to make the soup were very easy which helped balance straining rice over cold water and making the yogurt and rice mixture ready for pan doable so that both items were hot and fresh ready to eat together. \n\nKeeping the broth recipe in my head to pair with other dishes for the rest of my life!\nAnonymousAnchorage, AK9/4/2020Doubled all the spices (save the garlic), added ground cumin too, added 2-3 pre-roasted tomatillos, and 1-2 Tbs yellow curry paste. Blended with immersion blender on the stove top to attempt greater clarity and uniform consistency... if I were serving for dinner I would likely strain it. Drinkable as a hot tangy broth. Eager to try the rice and serve with a poached white fish. obglassysan francisco8/29/2020Explore Bon AppétitSoupSoups and StewsRiceRice & GrainsChileVegetableChile de ÁrbolSerrano ChileMainGluten-FreeVegetarianNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Andy Baraghani"]}