{"id": "04308c1f16d5694ffb3b72661632e129", "url": "https://www.bonappetit.com/recipe/blueberry-ginger-buckle", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Blueberry-Ginger Buckle Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlueberry-Ginger BuckleBy Sarah JampelJuly 16, 20204.7(33)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintA member of the larger umbrella group of easy fruit desserts, a buckle features tons of fruit barely held together by tender cake. We're talking so much fruit that the cake buckles around it, hence the name. There are many regional buckle variations, and not all have a streusel topping. This particular recipe, however, has got lots of big crumbs—and we think you’ll be glad that’s the case. If you’re not into ginger or you don’t have it hanging around, you can change up the flavors. Try using the zest of ½ orange in place of the fresh ginger and ground cinnamon or cardamom in place of the ground ginger. Peanuts would be fair game instead of pecans or walnuts, or you can skip the nuts entirely.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8\" Baking Pan$25 At AmazonParchment Paper$3 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonMedium Bowl$17 At AmazonWhisk$10 At AmazonSpoon$24.69 At AmazonMicroplane$16 At AmazonLarge Bowl$18 At AmazonElectric Mixer$40 At AmazonSpatula$12.99 At AmazonCake Tester$3 At AmazonIngredientsMakes 98Tbsp. unsalted butter, room temperature, divided, plus more for pan½cup (63 g) raw pecans or walnuts2¼cups (281 g) all-purpose flour, divided¼cup (packed; 50 g) dark brown sugar½tsp. ground ginger1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided1tsp. baking powder¼tsp. baking soda12\" piece ginger⅔cup (133 g) granulated sugar2large eggs½cup sour cream1tsp. vanilla extract2½cups (325 g) fresh or frozen conventional or wild blueberriesPreparationStep 1Place rack in middle of oven; preheat to 350°. Lightly butter an 8x8\" or 9x9\" baking pan, then line with overlapping pieces of parchment paper, leaving overhang on all 4 sides. Lightly butter parchment.→  Unsure how to line your pan? Click here.Step 2Make the topping. Coarsely chop ½ cup (63 g) raw pecans or walnuts. Combine ¾ cup (94 g) all-purpose flour, 4 Tbsp. unsalted butter, room temperature, ¼ cup (packed; 50 g) dark brown sugar, ½ tsp. ground ginger, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a small bowl. Using a fork or your fingers, smash butter into dry ingredients until mixture is homogeneous and no streaks of butter remain. Add pecans and mix until clumps form. Cover and chill streusel while you make the batter.Step 3Whisk 1 tsp. baking powder, ¼ tsp. baking soda, remaining 1½ cups (188 g) all-purpose flour, and remaining ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl. (You can also do this in an airtight container—just combine everything, cover, and shake!)Step 4Peel one 2\" piece ginger (a spoon makes this easy work). Using a Microplane, finely grate ginger into the bowl of a stand mixer, or a large bowl if using a hand mixer. (Try to avoid adding any of the really stringy bits and compost those.) Add ⅔ cup (133 g) granulated sugar. If using a stand mixer, fit with paddle attachment. Beat on low speed until sugar is moist and fragrant and no large clumps remain. Add remaining 4 Tbsp. unsalted butter, room temperature, increase speed to medium-high, and beat, scraping down sides of bowl 2–3 times, until very pale and fluffy, about 5 minutes.Step 5Add 2 large eggs, one at a time, beating on medium speed 1 minute after each addition. Mix in ½ cup sour cream and 1 tsp. vanilla extract. Scrape down sides of bowl and beat once more to make sure batter is smooth and homogenous (don’t worry if it looks curdled). Add dry ingredients and beat on low speed until nearly incorporated. Add 2½ cups (325 g) fresh or frozen conventional or wild blueberries and fold into batter with a rubber spatula. The batter will be very thick, especially if you’re using frozen berries. Scrape batter into prepared pan and spread out evenly with spatula (you might have to use some force). Photo and Food Styling by Sarah Jampel Step 6Sprinkle reserved streusel over batter, squeezing the topping between your hands if you want bigger clumps and breaking them up if you want smaller ones.Photo and Food Styling by Sarah Jampel Step 7Bake buckle until streusel is golden brown all over and a tester inserted into the center comes out clean, 55–60 minutes. Transfer pan to a wire rack and let cake cool in pan. Using parchment overhang, hoist buckle out of pan and cut into 9 squares.Photo and Food Styling by Sarah JampelHow would you rate Blueberry-Ginger Buckle?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangle\"It's a keeper!\" was the consensus at the family dinner. not too sweet which was nice also with vanilla ice-cream.TerriVictoria BC Canada6/21/2021Fabulous recipe: not sweet, yet the touches of sweet offset by the salt notes.. Southern Hemisphere: Fan forced 160°  for 65 minutes. Cuts in to 12 squares....with cream and ice cream....ample. LesleyDenmark, Western Australia5/1/2021Overall tasty and a great way to use my stash of CSA blueberries.  Unfortunately, and perhaps this was a blending issue on my part, it was too salty.  I am going to try it again with some of the modifications others have mentioned, and leave the salt out of the topping, and maybe cut it down some in the batter.eskiedocNJ1/28/2021Was worried that the cake was going to be dry because the batter was quite thick, but it came out wonderfully fluffy and moist.  Substituted a bit of citrus zest for the fresh ginger as per recipe suggestion and was not disappointed with flavor either. As others have commented, I did need an extra tbsp of butter to make my crumb topping come together properly.  Baked to perfection in a 8x8 tin for 55mins.  Might try and see if I can make this again, as muffins instead of squares.ChelseaTempleLos Angeles, CA10/19/2020I made this version for my Dad with frozen blueberries that he wanted to use up.  It was great!  I wanted to make one for my husband but he does not eat blueberries, so I riffed on this recipe to make him a cherry one.  I crushed up slivered almonds and used cinnamon plus two extra Tbl of butter in the topping.  For the cake I used self rising flour and left out the baking powder and salt.  I subbed whole milk yogurt for the sour cream and fresh grated orange peel for the ginger.  I used frozen cherries which I sliced in two because they were very large ones.  It baked for 70 minutes and came out perfect.  navytraOhio10/10/2020I made it and it is delicious.  I also ate with a good ginger ice cream which was heavenly.\ndaryllovescolor2476Columbus Ohio9/29/2020Seems like it's going to be eventually amazing (cause I stole a few licks of batter hah oops) but perhaps due to frozen berries my cooking time seems to be substantially off from the recipe - my oven is at 350 and after a full hour still very wiggly and raw in the middle. I'm getting impatient cause it smells great hah!kmarxmarxchicago, il9/14/2020Delicious flavor & not overly sweet! Can’t wait to have it with my coffee in the morning!\n\nI did use frozen blueberries and they sadly all sank to the bottom of the cake. Still delicious, just not as pretty! AnonymousLos Angeles 9/5/2020Loved it! Not too sweet and perfectly gingery! Ended up baking it for around 65 minutes to get that good crumble. Hats off to the chef! ;) AnonymousDenver 8/30/2020Welp, this is my new favorite way to eat blueberries. This buckle is sweet without being too sweet. Easy to come together. Will definitely be making this again. ttmjacobsonPortland, OR8/23/2020This was fantastic!! We couldn’t stop eating it! As others said, having the parchment pan liner was great, and makes removal easy for a nice presentation. \nI did find the directions confusing. It would be easier perhaps to list cake ingredients, then list streusel ingredients, rather than divided ingredients. I had to keep checking to make sure I was adding the right amount. But that’s just me!! Lol. I added nutmeg and cinnamon to the batter because I think it compliments blueberries so much. When I made it the first time, I questioned whether or not to flour the blueberries before adding to the batter so they wouldn’t sink. It didn’t say to, so I didn’t. They really sunk to the bottom and at first I was unhappy, but then you know, I quite liked that really dense blueberry layer on the bottom!!  I’ve made it again since and kept it that way. I also added a bit more butter to the streusel, which was heavenly. All in all, a wonderful recipe that got rave reviews. Looking forward to trying the orange and cardamom variations.  AnonymousHouston, TX8/15/2020I did not appreciate the salt. Would make again omitting salt all together. AnonymousChicago7/27/2020Delicious! I used ground cinnamon, zested a small lemon and reduced sugar by about 30%-family absolutely loved this cake! It was just sweet enough. AnonymousManhattan, NYC7/22/2020FANTASTIC. I will definitely be making this again and again, with different fruits and flavour combinations. I did the orange zest/cinnamon and cardamom rather than ginger. It is super easy, I whipped it up for breakfast. Really good tip with over lining the pan with parchment paper, it made it super easy to hoist out when it was done. Saskatchewan7/21/2020Super yummy with the ginger.  I had to go back into the topping section to figure out the remaining flour and salt for the dough...kind of a pain.Chandler, AZ7/21/2020Explore Bon AppétitCakeDessertFruit DessertAmericanBlueberryBerryFruitGingerHerbs & SpicesSummerSnackBakingFourth Of JulyMemorial DayLabor DayBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-16", "author": ["Condé Nast", "Sarah Jampel"]}