{"id": "043bd44427648a7aa66fa4b004dab078", "url": "https://www.bonappetit.com/story/jennifer-garner-loves-ina-garten-beef-bourguignon", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Jennifer Garner Loves Ina Garten’s Beef Bourguignon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJennifer Garner Has Been Making Ina Garten’s Beef Bourguignon Since Her Spy DaysThe actress and Ina are now friends, but years ago, she was just another fan, testing out this recipe on her ‘Alias’ co-stars.By Jennifer GarnerOctober 29, 2018FacebookTwitterEmailFacebookTwitterEmailIn honor of Ina Garten's guest editing week, we asked chefs and celebrity fans to share their favorite Barefoot Contessa recipes as part of our series “How Easy Is That?” Below, actress Jennifer Garner (currently starring on Camping on HBO) reveals how she discovered Ina’s classic beef bourguignon. \n What is my favorite Ina Garten recipe? This is an unfair question, I may have to quit here. How could I possibly choose a favorite? Do you mean to ask me my favorite from each book? My favorite chicken, my favorite shrimp, my favorite muffin? Torture.Okay, okay. My favorite Ina recipe is Ina’s beef bourguignon. (Called by its traditional French name boeuf bourguignon in the book.) The first time I made it was ages ago—we were shooting Alias in the early 2000s, and my co-star Michael Vartan had hunted down a signed copy of Barefoot in Paris for me. I made dinner for Victor Garber—who played my dad on the show—and his partner, Rainer. We were mid-season and had just finished a long week, and I somehow made this gorgeous meal on a Saturday night. I remember being in my little house listening to music and drinking a glass of gorgeous red wine. (Always cook with a wine you’d like to have at the table, right, Ina?) The house smelled like winter when Victor and Rainer arrived, and the meal was done. I didn’t have to get up to check anything or stir or sauté—everything had cooked in the oven, and we just sat and ate and talked and laughed.Since that night I have made this recipe countless times—for small, intimate dinner parties or doubling it for my family at Christmas. And I’ve learned a lot about it through the years. I tried having a butcher cut the meat for me once and won’t do that again; I like my meat more carefully trimmed than just cubed. I know now to watch the bacon carefully (it can go from sizzling to sizzled in a few short seconds), and that the grilled bread dipped in the stew is worth every bite—even if half the table is filled with actors on no-carb diets! No matter what, it is absolutely a winner and gives everyone the feeling of luxury and time and depth of flavor. I haven’t made this for Ina, but would be thrilled to—her recipe is foolproof and there is no one better to share a table with than Ina and Jeffrey!I wonder what other gems Ina has hiding in plain sight.  Sometimes I go through and read her earlier books over again to come up with fresh ideas. Ina’s books, like her beef bourguignon, never ever disappoint. Ina Garten’s Boeuf Bourguignon(Beef Stew with Red Wine)From Barefoot in ParisServes 6I never really liked beef bourguignon. After cooking for three hours, the meat was stringy and dry and the vegetables were overcooked. So, I tried to solve the problem and came up with a delicious stew that cooks in an hour and a half. The good news is that it’s even better the second day, so it’s great for entertaining. To make in advance, cook the stew and refrigerate. To serve, reheat to a simmer over low heat and serve with the bread and parsley.1 tablespoon good olive oil8 ounces good bacon, diced2½ pounds beef chuck cut into 1-inch cubesKosher saltFreshly ground black pepper1 pound carrots, sliced diagonally into 1-inch chunks2 yellow onions, sliced2 teaspoons chopped garlic (2 cloves)½ cup Cognac or good brandy1 (750-ml) bottle good dry red wine, such as Burgundy2 to 2½ cups canned beef broth1 tablespoon tomato paste1 teaspoon fresh thyme leaves4 tablespoons (½ stick) unsalted butter, at room temperature, divided3 tablespoons all-purpose flour1 pound frozen small whole onions1 pound mushrooms, stems discarded, caps thickly slicedFor serving:Country bread, toasted or grilled1 garlic clove, cut in half½ cup chopped fresh flat-leaf parsley (optional)Preheat the oven to 250 degrees.Heat the olive oil in a large Dutch oven, such as Le Creuset. Add the bacon and cook over medium heat for 8 to 10 minutes, stirring occasionally, until the bacon is lightly browned. Remove the bacon with a slotted spoon to a large plate.Dry the beef cubes with paper towels and then sprinkle them with salt and pepper. In batches in single layers, sear the beef in the hot oil for 3 to 5 minutes, turning to brown on all sides. Remove the seared cubes to the plate with the bacon and continue searing until all the beef is browned. Set aside.Toss the carrots, onions, 1 tablespoon of salt, and 2 teaspoons of pepper into the fat in the pan and cook over medium heat for 10 to 12 minutes, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for 1 more minute. Add the Cognac, stand back, and ignite with a match to burn off the alcohol. Put the meat and bacon back into the pot with any juices that have accumulated on the place. Add the wine plus enough beef broth to almost cover the meat. Add the tomato paste and thyme. Bring to a boil, cover the pot with a tight-fitting lid, and place it in the oven for about 1¼ hours, or until the meat and vegetables are very tender when pierced with a fork. Remove from the oven and place on top of the stove.Combine 2 tablespoons of the butter and the flour with a fork and stir into the stew. Add the frozen onions. In a medium pan, sauté the mushrooms in the remaining 2 tablespoons of butter over medium heat for 10 minutes, or until lightly browned, and then add to the stew. Bring the stew to a boil, then lower the heat and simmer uncovered for 15 minutes. Season to taste.Rub each slice of bread on one side with garlic. For each serving, spoon the stew over a slice of bread and sprinkle with parsley.Recipe reprinted from Barefoot in Paris: Easy French Food You Can Make at Home). Copyright © 2004 by Ina Garten. Photographs by Quentin Bacon. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Explore Bon AppétitIna GartenBeefFrenchStewHow Easy Is That?CelebritiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-29", "author": ["Condé Nast", "Jennifer Garner"]}