{"id": "043ea482353c04754ba0be976ea34ee0", "url": "https://www.bonappetit.com/story/its-it-ice-cream-sweatshirt", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "One of My Most Prized Possessions Is an Ice Cream Sandwich Brand's Swag | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOne of My Most Prized Possessions Is an Ice Cream Sandwich Brand’s SwagIt’s-It is it.By Zoë SessumsApril 16, 2019FacebookTwitterEmailPhotograph by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The first time I passed Anna Wintour in the hallway, I was wearing jeans, 15-year-old purple slip-on Vans, and a big, grey, unisex sweatshirt. I could’ve felt disappointment (Anna, I promise I have amazing outfits!), I could’ve felt embarrassed (Anna, I really am a stand-up citizen!), but really, I was thrilled to be in the presence of Vogue’s editor in chief wearing my most prized piece of clothing: my It’s-It swag.I lived in San Francisco for three months in my early twenties, a trying time of BIG LIFE CHANGES, but the moment I discovered that freezer treat—two oatmeal cookies surrounding a slab of ice cream covered entirely in a generous shell of chocolate—I knew it was all worth it. Years later, and now on the East Coast, everyone around me still knows about my adoration, even despite the vast distance between myself and a highly accessible supply. I wear the brand’s merchandise everywhere I go. I’ve worn it to a fancy New Year’s Eve party. I’ve worn it to important meetings. I’ve wore it on a really great first date.To know me is to know my dessert allegiances. It’s-It are it, and I’ll wear it loud and proud.Buy It: It’s-It Gray Pull-Over Sweatshirt, $40 at itsiticecream.com.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Zoë Sessums"]}