{"id": "0451064917ac9b25dc284ab3280ff6bc", "url": "https://www.bonappetit.com/story/harris-family-food-traditions", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "For Maya Harris and Her Family, Every Meal Was an Adventure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWith Mommy, Food Wasn’t Simply Sustenance—It Was an Adventure and a CelebrationMaya L. Harris, lawyer, writer, and sister to the Vice President, shares the family traditions she’s passing on.By Maya L. HarrisFebruary 9, 2021FacebookTwitterEmailShrimp and Okra with SausagePhoto by Emma Fishman, food styling by D'Myrtrek BrownFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.“What you eating, Gramma?”It’s a question the little one (all of two years old) asks me—eyes wide and full of curiosity—every time I take a bite of anything. But of course it’s not really a question. It’s an invitation...for me to ask her if she wants some.Perhaps she thinks she’s getting away with something: a snack between meals, or a tasty treat she’s not supposed to be eating. But I’m more than willing to be her accomplice. It warms my heart every time I see her curiosity in the kitchen.My mother (the little one’s great-grandmother) loved cooking, and her tastes were eclectic. With Mommy, food wasn’t simply sustenance. It was a stroll through all the places she went and the people she met along the way. It was an adventure, a celebration, and a mélange of many cultures, and she approached it much the same way she moved through the world: with the curiosity of the pioneering breast cancer scientist she was; the boldness of spirit that led her from India to UC Berkeley at age 19; and the fearlessness with which she threw herself into the civil rights movement once she arrived there.Author Maya L. Harris with her mother eating Aam Papad, one of her favorite Indian sweets.\nSo many of my favorite dishes growing up were products of this remarkable journey. They were extensions of, or connections to, the beloved friends, neighbors, and colleagues who wove themselves into our lives. There was shrimp and okra with hot links from Mrs. Shelton, who’d moved to California from Palmetto, Louisiana, as so many did during the Great Migration. She and her husband lived two doors down and looked after me and my sister, Kamala, when our mother was at work or away on a business trip. Mrs. Shelton became our extended family, and my mother’s simplified spin on her dish has been one of the most faded and careworn pages in my recipe binder.There was spaghetti alla carbonara, a recipe from Tyra, the American-born wife of an Italian scientist who was both a colleague and friend. Over the years it became not only one of our staples (I’d eat the leftovers for breakfast; “after all, it’s just bacon and eggs with cheese!” Mommy would say), but also one of those indelible comfort foods that still makes me feel completely content.And of course there was dessert: Rozelle’s cheesecake, one of my mother’s favorite recipes out of a cookbook assembled by the women’s auxiliary at the Jewish General Hospital in Montreal. Mommy had picked it up while conduct-ing cancer research and teaching at McGill University when we were kids. Although I don’t for the life of me remember Rozelle’s last name, I hope she’d be touched to know her creamy, melt-in-your-mouth cheesecake has been gracing our family gatherings for over 40 years.These recipes, and so many others, will always remind me of my mother, the people she knew, the places we went together. And yet, adventurous as her palate could be, Mommy’s cooking was also grounded in the tastes of home. We grew up on the same South Indian staples her own mother had prepared during her child-hood in India. To this day, when I’m feeling under the weather, I crave the warmth of Mommy’s spicy, nasal-passage-clearing rasam, or a simple bowl of rice and yogurt with a scoop of hot mango pickle on the side. Homemade Jamaican patties and roti—like those we (over)indulged in as children on trips to visit my father’s family—also do the trick every single time.One by one these recipes were passed down to me along with Mommy’s love of cooking. I was thrilled to discover that nearly all were easy to throw together; I could make them for my own daughter while juggling work and school as a single mom. And since then I’ve been collecting and adding some recipes of my own—from my Alabama-raised mother-in-law’s mouth watering cornbread stuffing and yams, to my sister’s tangy collard greens, to my very own trial-and-error-perfected gumbo that the whole family feasts on every Christmas Day. All of these recipes are tucked away in the scribbled, ingredients-stained pages of my precious little green notebook: a gift from Tyra when I was about 10 years old.We lost Mommy, Tyra, and Mrs. Shelton to cancer—each of them far too soon. But the sounds of laughter in their kitchens, the warmth of their love, and the comfort of their cooking live on at my table.As for my grandbaby, she may think she’s getting away with something by asking “What you eating?” when she wants a taste of whatever’s in my bowl. But soon enough she’ll see that she’s inherited the family tradition of finding adventure, joy, and comfort in the heat, spices, and smells of food—prepared with and for the people you love.Shrimp and Okra With SausageCreole seasoning is the key to adding a spice cabinet’s worth of flavor in just a few shakes in this one-pot dinner.View RecipeExplore Bon AppétitFirst PersonAll on the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Maya L. Harris"]}