{"id": "045bf2cbe235253f981683369e31b3ac", "url": "https://www.bonappetit.com/recipe/peperoni", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "Marinated Peppers with Basil and Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarinated Peppers with Basil and GarlicBy Sahara BohoskeySeptember 22, 20214.2(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThese jammy peppers are best after they’ve had at least an hour to soak up the marinade and taste even better the next day, which means they’re an ideal condiment to make ahead for a week of meals. I enjoy them on a snack plate with cheeses, olives, and crackers; on an open-face sandwich with cheese; or with sliced deli meats. For meals on the go, I also throw them in pasta salads and in a vegetarian salade niçoise with feta, boiled eggs, and green beans. —Sahara BohoskeyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketTongs$13 At AmazonMicroplane Grater$16 At AmazonIngredients4 servings5red, orange, and/or yellow bell peppers (about 2 lb.)2large sprigs basil, plus leaves for serving3garlic cloves, finely grated½cup extra-virgin olive oil½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltPreparationStep 1Heat broiler. Broil peppers on a foil-lined rimmed baking sheet, turning with tongs every 5–7 minutes, until all sides are charred, about 20 minutes. Let sit until cool enough to handle.Step 2Peel peppers and discard skins. Tear flesh into ½\"-wide strips. Transfer to a medium bowl and add basil sprigs, garlic, oil, salt, and any juices on baking sheet; toss to combine. Cover and let sit room temperature at least 1 hour.Step 3Top with basil leaves just before serving.Do ahead: Peppers can be marinated 3 days ahead. Chill if making more than 1 hour ahead. Bring to room temperature before serving.How would you rate Marinated Peppers with Basil and Garlic?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangle3 words....yum, yum, yum!Daughter of mother and mother of daughtersMilford, CT11/24/2021I have made these wonderful marinated peppers many times. They are fantastic when combined with roasted veggies and stir in some of the awesome pepper juices. I then roll out shop bought puff pastry. Cook it and then lay the veggies on top with a good sprinkle of grated chedder cheese, pul biber pepper (or freshly ground black pepper) and pop in oven until cheese has melted and lovely and gooey. I always have a jar or two available for last minute meals. Really versatile and super tasty.Nannie StearnCambridge, United Kingdom10/13/2021I roast them on the top of the stove.  Use tongs that will not pierce the skins. Turn them when one side is blistered and black etc etc.  Put them in a plastic bag to steam and cool off enough to handle them, then clean the skins and the seeds. Do not run them under water to speed up the cleaning.....rinse your hands off once in a while.  You want to keep as much of the juices as possible. Cut or tear into pieces and place in bowl of olive oil, the juices and lots of chopped or sliced garlic.  Salt as needed.  Let rest in fridge a while.  Your whole place will smell divine! HeidiNYC9/26/2021I blacken them over a stove burner, put  them in a paper bag, then remove them for easy peeling.Charlotte BurkholzPalm Desert, CA9/26/2021I think microwaving wouldn't give you the same resulting taste as broiling.  I don't broil peppers when I want to blister the skins and peel them but roast them on a baking sheet instead at a high temp (425 - 450 degrees).  Check them about every 8 - 10 minutes and turn them when the top side is blackened.  Continue until they're blackened in spots all over.  When they're blackened all over, put them in a paper bag or in a covered bowl for a few minutes so they steam.  Makes removing the skins very easy.Nancy SDenver, CO9/25/2021I'm intrigued but can you retool the recipe for a microwave? (Broiler sets off smoke alarm in my typically small = average middle class NYC apartment.) AnonymousNYC, NY9/24/2021\nCan these marinated peppers be frozen?\nAnonymousMontreal, Quebec9/24/2021I will definitely be making these. They sound so good!Rebekah945719/24/2021Explore Bon AppétitBell PepperVegetableCondiment/SpreadSnackVegetarianVeganDairy-FreeGluten FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-22", "author": ["Condé Nast", "Sahara Bohoskey"]}