{"id": "0466867760d441b8f66ebb8d36ec2c0e", "url": "https://www.bonappetit.com/story/luigis-georgia", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How a Family of Greeks Ended Up with an Iconic Italian Restaurant in the Deep South | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow a Family of Greeks Ended Up with an Iconic Italian Restaurant in the Deep SouthThe oldest Italian restaurant in Augusta, Georgia, is a fifth-generation, Greek family–owned red sauce joint called Luigi’s.By Virginia WillisApril 16, 2019FacebookTwitterEmailPhoto by Lauren CarnesFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Penny reaches into her purse and pulls out her wallet. Opening the folds, she reveals a worn and tattered article from The Boston Globe. It’s not a restaurant review. It’s a sports column detailing the long list of famous people who have frequented Luigi’s, her family’s restaurant in Augusta, Georgia, over the decades. Today that list includes golfers Ben Crenshaw, Jordan Spieth, Fred Couples, and Davis Love III (all of whom came for Augusta’s legendary Masters Golf Tournament) as well as celebrities like Jackie Gleason, Kristi Yamaguchi, and Andre the Giant.I’m sipping a glass of sweet iced tea, seated beneath a hand-painted mural of Venice that has darkened with age, listening to Nat King Cole croon over the vintage tableside-controlled Seeburg 100 Wall-O-Matic jukebox. An antique Coca-Cola clock glows on the wall and the bathrooms are designated male and female by respective photos of Edward G. Robinson and Mae West. A straw-wrapped Chianti bottle sits adjacent to a molded glass shaker of Parmesan. Open since 1949, Luigi’s is one of Augusta’s oldest restaurants and a veritable time capsule of pop culture.“Take it, take it,” Penny insists, pressing the scrap of newspaper toward me, her carefully coiffed silver ponytail bobbing up and down.Although I am certain very few disobey Luigi’s grand matriarch, Penelope Orphanos Ballas (a.k.a. Yiayia, the Greek word for grandmother), I politely refuse. “No ma’am. I’ll take a snap with my phone and I’ll look it up later online.” It simply doesn’t seem right to take something that has been so carefully guarded and treasured for nearly 30 years.At Luigi's, Greek moussaka sits on the same table as Italian garlic bread.\nPhoto by Lauren CarnesLong before there were Olive Gardens on every interstate and pizzerias in every strip mall, Italian food was an exotic, unknown, and mysterious cuisine throughout much of the South. Though America received more than 20 million immigrants between 1880 and 1920—most from non-English speaking countries in Central, Eastern, and Southern Europe—very few made it below the Mason-Dixon Line.But some did, including Penny’s father-in-law, Nicholas “Papou Nick” Ballas, who left his native Greece for the U.S. in 1920. He bounced between states, cities, and various catering gigs before settling in Augusta, and in 1949 found the perfect spot for a brick-and-mortar restaurant in a historic building along Broad Street downtown. There, Luigi’s was born.Knowing most Georgians weren’t familiar with his native Greek cuisine, Nick opted for a sure thing and created a menu of mostly Italian dishes. Possibly because of the Italian prisoners of war held at nearby Fort Gordon, locals had already been introduced to Italian cuisine. But he also added a twist: Luigi’s was the first restaurant to introduce pizza to Augusta. For many years, customers became confused when they ordered “pizza pie” and didn’t get a dessert.Luigi’s is the first Italian restaurant in Augusta and the only restaurant from that era that is still in operation.\nPhoto by Lauren CarnesA few short years after Luigi’s opened, Nick’s son Chuck Sr. traveled from the Boston area to visit his father. A World War II veteran, mechanical engineer, and contributor to the Manhattan Project (yes, the one that invented the first atomic bomb), Chuck Sr. was skeptical about the financial prospects of a restaurant. But when he arrived at Luigi’s, he saw two giant soup cans beside the cash register: one reserved for bills to be paid, the other overflowing with money. That was all the incentive he needed. He hightailed it back north to ask his wife, Penny, to move to Augusta and enter the restaurant business. Penny smiles, remembering it now: “I told him I had two requirements: A Greek Orthodox church and good drinking water.”Her move paid off. “It’s been a good place to raise a family,” she tells me. And family is still what Luigi’s is all about. Even now, at 91 years old, Penny can be found at the restaurant every Friday afternoon, the one day it’s open for lunch. Her son, Chuck Jr., still makes all the sauces and sausages from scratch, keeping the recipes safely confidential in his little black book. His eldest daughter, Penelope Ballas-Stewart, is manager and host, and her 17-year-old daughter, Kalli, waits tables: generation number five. Penelope’s son Mattie is still a bit young at 13, but she promises he’ll be busing in a year or so.The Masters Tournament has become a driving force for nearly everything in Augusta, and entry badges are now one of the most sought-after tickets in sports. “My husband, Chuck Sr., loved golf,” Penny says. “He used to purchase golf badges to give to customers.” Since those days, dinner at Luigi’s has become an integral part of the Masters experience for many patrons. Every spring when the azaleas are in bloom and the little white balls are flying, there’s a line out the door. Luigi’s serves cocktails on the sidewalk for people to enjoy while they wait.Meet the Ballas family, from left: Kalli, Chuck Jr., Penny, and Penelope\nPhoto by Lauren CarnesWhile the menu remains predominantly Italian, with recipes dating back to the early 1950s, the Ballas family has snuck in reminders of their own heritage over the years. Greek food no longer feels foreign to Southern palates, notes Penelope. Greek chicken—made with olive oil, lemon, and herbs—is a top seller. It lives in harmony with tender lasagna and plump pillows of amber-toasted ravioli stuffed with molten ricotta and topped with Chuck Jr.’s wonderfully spiced secret sauce. (I think I detect the faint aroma of allspice, but I know better than to ask.) Glance around the restaurant at any given dinner service and you’ll see platters of butter-soaked toasted garlic bread and veal scaloppini side by side with bowls of Greek avgolemono and plates of layered moussaka. Oh, but don’t forget, we’re also in the Deep South. Penelope points to the fried chicken livers with meat sauce, laughing. “It’s Italian-Southern fusion!”As a Southerner myself, I know the region is far more diverse than people expect it to be. And it’s the stories of immigrant families like the Ballases that make it so. Slurping a bowl of vanilla ice cream topped with crumbled baklava, I scan the room. Underneath the vaulted pressed tin ceiling and the gleaming crystal chandeliers, customers are happily enjoying Chuck Jr.’s creations. Penelope is at the register, and Penny is talking to a table of regulars. A print of the Parthenon hangs on the wall between a smattering of golf memorabilia, vintage menus, and a mounted largemouth bass. And above the door? A smiling portrait of Papou Nick.Virginia Willis is a James Beard Award–winning cookbook author, food writer, and chef.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Virginia Willis"]}