{"id": "047b7d9a1e65a22a68daa7c453a93a22", "url": "https://www.bonappetit.com/story/what-is-worcestershire-sauce-anyway", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "What Is Worcestershire Sauce, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Worcestershire Sauce, Anyway?Yes, it's hard to pronounce. And yes, you should be using it a lot more than you think you should.By Alex DelanyDecember 20, 2018FacebookTwitterEmailFacebookTwitterEmailWorcestershire sauce is one of those ingredients that exists in 98 percent of kitchens. Maybe the bottle is brand new. Maybe it’s six years old. But regardless of age, it’s most likely there. Which begs a couple questions: Why do I have this stuff? What do I use it for besides that one recipe I used it in that one time? And what is Worcestershire sauce in the first place?Well, we could go into the history of the sauce, explaining its English origins, copyright battles over the name, and just how many people have tried to replicate the original recipe. But when it comes to history, the only thing you really need to know is that this sauce was first made by the company Lea & Perrins in Worcestershire, England.And there are about as many ways to incorrectly pronounce Worcestershire as there are ingredients in Worcestershire sauce. It’s a sauce with a tremendous depth of flavor, and all that flavor is the result of many different ingredients being fermented individually, blended, and fermented again. There are some vegan and vegetarian versions of Worcestershire sauce, but for the most part, the regular versions contain the following: Vinegars. Fermented onions. Fermented garlic. Molasses. Tamarind paste. Salt. Sugar. Cured anchovies. And a seasoning mixture that can include spices like coriander, mustard seed, cloves, or pepper, as well as citrus peel.Yeah: There’s a lot going on in that bottle. And that means there’s a lot of flavor. Worcestershire sauce is really an umami delivery vehicle, a cousin to fish sauce or soy sauce that the family kind of forgot about. And we tend to forget about it, too—but at the end of the day, you can use Worcestershire to add flavor to anything saucy much in the same way you’d use soy or fish sauce.Adding some Worcestershire to lentil soup? Pro move.\nPhoto by Chelsie CraigWe’re partial to adding Worcestershire to stocks, broths, and braising liquids to quickly build flavor that could take hours to develop. Whether you’re braising in red wine, dropping vegetables into chicken broth, or even making something creamy like a chowder or a pot pie, the range of flavor in Worcestershire makes it a pretty versatile ingredient. It has umami, acid, and sweetness to offer.But it also helps in dishes that don’t involves broth, stock, or braising liquid. A few drops of Worcestershire in a vinaigrette or creamy salad dressing take it to a whole new place. And adding the sauce to marinades will add another level of umami to that seared, browned exterior on chicken thighs or pork chops. It’s essential in condiments like cocktail sauce, and a dash in a Bloody Mary is sure to bring you back to life.If you’re looking for umami and are growing tired of soy, oyster, or fish sauce, give Worcestershire a shot. You might have to rummage through the condiment shelf. Or possibly run out to grab a new bottle. But the flavor it brings to the table will make you wonder why you haven’t been using it more. And maybe even why you never learned to pronounce it. Wuss. Terr. Sherr. You’re welcome.Speaking of braises, this looks good:Beef and Bacon StewYou can call it beef bourguignon if you want to sound fancy—nobody has to know how much easier it is than the French classic.View RecipeExplore Bon AppétitWorcestershire SauceBasicallyIngredientsUmamiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Alex Delany"]}