{"id": "0481e40a1b5ce42668653d3dbb7027f8", "url": "https://www.bonappetit.com/story/veal-guilty-pleasures", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How Did Red Sauce Joints Become the Last Remaining Bastions of Unquestioned Veal Consumption? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow Did Red Sauce Joints Become the Last Remaining Bastions of Unquestioned Veal Consumption?It’s out of vogue everywhere, except....By Bobby FingerApril 16, 2019FacebookTwitterEmailPhoto by Cole WilsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Long before I ever had my first taste of it as an adult, I knew that veal was a “bad” meat. The burgers my parents prepared most Saturday afternoons; the chicken my dad threw on the grill; even catfish, a bottom-feeder best served deep-fried—those were all “good” meats. Most proteins were, actually. Just not veal. While I can’t pin down exactly where my acute awareness of this ethical binary originated, I have a feeling I owe it to one of American pop culture’s most famous and outspoken vegetarians: Lisa Simpson, the righteous, animated permatween who’s been refusing meat on The Simpsons since the series’ seventh season, which aired in 1995. (At one point, four seasons later, she explicitly asks her carnivorous boomer father, Homer, for a meal that wasn’t “brutally slaughtered.” “I think the veal might have died of loneliness,” he replies, as smoke billows off the grill.)Lisa, like most representations of vegetarians in pop culture, is both the butt of jokes and a moral compass for her audience—someone whose guidance we meat eaters would absolutely follow if only steak weren’t so tasty when prepared medium-rare. When it comes to veal, though, Americans of all diets largely agree it’s one of those cuts probably best served not at all. (Spoiler: It’s sourced from baby cows that are often confined to small crates to prohibit muscle growth to keep things tender and fed a low-iron diet to keep their flesh pink. And out of vogue it’s become.)The veal spiedini, in all its rolled up, lightly breaded, white wine–baked glory.\nPhoto by Cole WilsonExcept…at red sauce restaurants. “To native Italians, veal was always a delicacy,” Paul Petronella, owner of Paulie’s in Houston, told me by phone, framing veal as a matter of generations-old tradition and not of ethics. “Over the past couple years, the prices have gone way up, but we do want to keep it on our menu.” And he’s not the only one. If you check the kitchens at many of the country's legendary Italian-American joints, from Rao’s in Manhattan to Italian Village in Chicago to Dan Tana’s in West Hollywood, you’re almost guaranteed to find it. And not just slotted between the chicken parm and pork chop, but as its own dedicated menu section with more preparations than you can count on two hands: pounded and breaded, doused in Marsala sauce, rolled and stuffed, sautéed, grilled, and fried. Walking inside these places feels like going back in time, so why should their menus be any different?I experienced a time warp of my own recently at Vinny’s, a charmingly kitschy, brightly lit joint in Brooklyn’s historically Italian Carroll Gardens neighborhood. The brisk March night I visited with my husband, I didn’t plan on ordering veal for the second—and likely last—time in my life, but at the suggestion of my server, I chose the veal spiedini, a dish alluringly described as a veal cutlet with mozzarella, “rolled up, lightly breaded, baked in white wine sauce.”“When in Rome,” my husband announced before deciding on the pizzaiola, a dish of sautéed veal and tomato-garlic sauce.Our dishes arrived not long after, and I looked at the glistening bedrolls of pale meat and cheese. A very Simpson’s visual appeared in my mind: three frustratingly mouthwatering spiedini sucked from spiedini-shaped holes of an anime-eyed cartoon calf. I cut into my first bite. It was delicate, delicious. By the second bite, I regretted the order. At some point during the third, I convinced myself that nothing could be done now; the cow had been killed without my consent, and I would have to eat it so it wouldn’t go to waste…right? The intricacies of veal production clouded every perfectly tender bite that followed. Joy, then guilt. Joy, then guilt. I lacked both the willpower and moral courage to ignore the former and was raised Catholic enough to cope with the latter.Still wracked with confused feelings days later, I reached out to the American Veal Association (there is such a thing) to ask some questions. “Things are soooo different on veal farms today compared to the ’80s, ’90s,” AVA’s executive director Donna Moenning told me via email, in an effort to make me feel better about my decisions. “Consumers who love meat and enjoy Italian cuisine featuring veal appreciate the changes the industry has made for more humanely, and sustainably produced, veal.”I was struck by the number of o’s in Moenning’s sentence and interpreted them as evidence of her own uncertainty—a Freudian keystroke suggesting some combination of willful ignorance and overcompensation. Joy, then guilt. Joy, then guilt. It appears to go all the way up the food chain.Bobby Finger is a Brooklyn-based writer and co-host of the podcast Who? Weekly.Explore Bon AppétitRestaurantsItalian AmericanRed SauceBrooklynVealRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast"]}