{"id": "04905ff333374246d42b1c705974b299", "url": "https://www.bonappetit.com/story/the-angels-are-still-there", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "My Temple of Steam-Table Soul Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Temple of Steam-Table Soul FoodWorshipping at the altar of sweet tea and collards in southwest Atlanta.By Rembert BrowneJune 6, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Growing up, I thought they were angels. Which I thought made sense because the restaurant was called The Beautiful.My young life as a kid in southwest Atlanta—the historically black neighborhood I grew up in, the same one my mother grew up in—revolved around driving from one activity to the next. There was dance camp at Spelman College, baseball and basketball at Adams Park, tennis at McGhee and Washington—and those were just my obligations. We drove around so much, I rarely knew where the next stop was, and I wouldn’t ask. I was a happy child, eager to just look out the window, soaking up this hood that was my entire world.A plate of baked salmon, shrimp, collard greens, macaroni and cheese at The Beautiful.\nPhoto by Emma FishmanEvery now and then our car would start making familiar turns through the forest that is Atlanta and I would get both excited and nervous. Sure, I was ready to enter the booth-lined soul food temple and feast on my four vegetable plate of collards, yams, rutabagas, and macaroni and cheese (the latter is, in fact, a vegetable). Yes, the infinite refills of sweet tea with crushed ice and banana pudding in a to-go Styrofoam cup were gifts for my sweet tooth. But there were innumerable restaurants that could put that lineup of items together, a few on the same street, and just one with the ability to make my adrenaline rush.I was about to see the angels.“Hello, welcome to The Beautiful,” one would say to me with a smile as I grabbed a brown tray.The holy steam table.\nPhoto by Emma FishmanShe, like most of the people behind the hot food counter, and behind the register, and scattered among the aisles of the restaurant bussing tables and refilling drinks, was a black woman dressed in a bright orange apronlike dress that popped over a white long-sleeved shirt, with a matching bright orange bonnetlike headwrap. The attire made no sense beyond the confines of the restaurant. It felt appropriate for another century—less 1990s and more 1690s. I knew the women were real because they were only a few feet away, but then again maybe they weren’t. So, as a child, in my wildly imaginative head, looking up at the women as the light from the ceiling hit the steam rising off the food, they became holy. They were angels.My primary goal during the two minutes I had in line was to do my best job impressing the women adding food to my plate. With a Kool-Aid smile on my face, “yes ma’ams” flew out my mouth. I made sure to speak up and enunciate my order, so as not to embarrass my mother. The distance from the chicken to the checkout was my St. Peter’s Gate.Photo by Emma FishmanEvery time I return home, I make a trip to The Beautiful to make sure the angels are still there. They are. On one of my last visits, I realized the restaurant had a website, something I’d never considered. I’m glad I did because on that site I learned that the early religious feeling I got from the place was justified.The name comes from the New Testament, Acts 3:2.And a certain man lame from his mother’s womb was carried, whom they laid daily at the gate of the temple which is called Beautiful, to ask alms of them that entered into the temple.Growing up, I thought they were angels. And then I grew up, and learned I was right the whole time.Rembert Browne previously wrote about his family’s Thanksgiving for Bon Appétit.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsAtlantaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Rembert Browne"]}