{"id": "04923ca1eb376a1897e4112e2569603d", "url": "https://www.bonappetit.com/city-guides/las-vegas/venue/bavettes", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Bavette's Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlas vegasBavette’sEscape the casino chaos for steaks and sundaes inside the Park MGM meat templeFacebookPinterestTwitterEmailPhoto by Tara WhiteGO HERE: to be magically transported to a branch of the Hogsalt restaurant group’s pitch-perfect Chicago steakhouse. After walking past rows of slot machines and through heavy wooden doors of the Park MGM, you’ll suddenly find yourself out of space and time and in the possession of a soothing, icy gin martini.ORDER THE: unfussy, old-school chophouse staples executed with new-school aplomb. Perfectly poached shrimp reclining on a divan of crushed ice with spicy dijonnaise. Dressed lump crab meat piled high atop of a buttery avocado half, flanked by crisp leaves of butter lettuce. And while the steaks—dry aged and impeccably crusty, with an ample bearnaise sidecar—more than hold their own in this beef-obsessed city, the rest of the entrees are every bit as formidable: craggy-edged spiced fried chicken thighs, rosemary-scented lamb chops, and the restaurant group’s infamous, expertly-griddled cheeseburger.THE VIBE IS: seductively dim—all Tiffany lamps and burgundy velvet—and the volume is almost conspiratorially-low in merciful contrast to the fluorescent sting and bell-and-whistle chaos of the casino floor.PRO TIP: A side order of broccoli, lightly charred and dressed simply with butter and plenty of lemon, is a welcome spot of brightness on a menu that otherwise skews rich-on-rich—non-optional.PRACTICAL STUFF: Open everyday for dinner: Sunday to Thursday, from 5 to 10 p.m., and Friday and Saturday, from 5 to 11 p.m.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-06", "author": ["Amiel Stanek"]}