{"id": "0493b351aa0c0c77253ec6de1440654b", "url": "https://www.bonappetit.com/recipe/oxtail-and-red-wine-stew", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Oxtail and Red Wine Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueOxtail and Red Wine StewBy Claire SaffitzSeptember 18, 20184.3(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintLove beef stew and braised short ribs? Consider giving oxtails a try. These surprisingly meaty cuts contain a ton of collagen, which melts into the stew to create an ultra-rich, ultra-silky texture and flavor. In fact, you might end up needing to thin the finished stew with water before serving. Letting it sit the full 12 hours really brings all the flavors together, but this step is totally optional. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servings Herby Panko3Tbsp. extra-virgin olive oil½cup panko (Japanese breadcrumbs)Kosher salt, freshly ground pepper2Tbsp. finely chopped chives2tsp. thyme leavesHorseradish and Beet Relish1medium beet, preferably golden, trimmed, peeled1small knob horseradish, peeled1Tbsp. red wine vinegar½tsp. honeyKosher salt, freshly ground pepperStew and Assembly5lb. oxtails or beef short ribs, cut into 2\" segments, patted dryKosher salt, freshly ground pepper3Tbsp. extra-virgin olive oil2large leeks, white and pale green parts only, halved lengthwise, then sliced crosswise into ½\" pieces4celery stalks, sliced ½\" thick2heads of garlic, top third removed¼cup tomato paste1750-ml bottle red wine1bunch thyme, stems tied together with kitchen twineParsley leaves, grated Parmesan, and/or sliced jarred pepperoncini (for serving; optional)PreparationHerby PankoStep 1Heat oil in a medium skillet over medium. As soon as oil is shimmering, add panko and cook, stirring often, until golden brown, about 3 minutes. Season with salt and pepper. Remove from heat and mix in chives and thyme. Let cool.Horseradish and Beet RelishStep 2Grate beet on the large holes of a box grater into a medium bowl. Grate about 1” of horseradish on the small holes of grater into the same bowl. Add vinegar and honey and season with salt and pepper; mix well. Let sit at room temperature at least 15 minutes before serving.Step 3Do Ahead: Relish can be made 2 days ahead. Cover and chill.Stew and AssemblyStep 4Season oxtails very generously all over with salt and pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook oxtail in a single layer, turning once, until browned on both sides, 8–10 minutes per batch. As oxtail pieces finish cooking, transfer to a large plate.Step 5Reduce heat to medium and cook leeks, celery, and garlic, cut side down, in the same pot, stirring leeks and celery occasionally, until leeks are softened and browned in spots and garlic is golden brown, about 5 minutes. Add tomato paste and cook, stirring constantly and scraping bottom of pot, until vegetables are coated and paste is slightly darkened in color, about 3 minutes. Gradually add wine, stirring to release any bits stuck on bottom of pot, then add 6 cups water and thyme. Season generously with salt and pepper and bring to a simmer. Return oxtails to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is fork-tender, 3–3½ hours.Step 6Uncover and remove pot from heat. Transfer oxtails to a cutting board and let cool 15–20 minutes. Pull meat from bones and tear into bite-size pieces; discard fat, cartilage, and bones. Add meat back to pot as you go. Let stew cool uncovered until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).Step 7Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard thyme and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Herby Panko, Horseradish and Beet Relish, parsley, Parmesan, and/or pepperoncini as desired.Step 8Do Ahead: Stew can be made 3 days ahead. Keep chilled.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethHow would you rate Oxtail and Red Wine Stew?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleJust made this recipe for first time. Used oxtails. When cooked long enough meat becomes meltingly soft and unctuous. Garlic an important component. Garlic browned as in recipe. Just keep garlic heads in stew entire cooking time. At end, remove oxtails and whole garlic heads to cool. Squeeze out garlic from heads for wonderful ooey gooey garlicness to add to stew. I like to remove meat from bones, then savor \nbones as well. Didn't make accompaniments yet. Not inclined to do panko. Maybe horseradish without beets (beets, ugh). Maybe pepperoncini on side. Parmesan confetti for salt. Probably will serve over egg noodles!AnonymousBerkeley10/16/2020what size pot did people use for this?\ni have a 8.5 qt dutch oven - want to make sure it's large enough.AnonymousToronto10/15/2019I’m halfway through making this and it’s taken me way longer (double OT in the oven now!) to tenderise the oxtail and short rib (decided to use both!) it’s very fatty so looking forward to cooling it down and discarding some of the fat and seeing the end product. I’ve popped it in the oven instead of stovetop for a more even cook - could this be the reason why it’s gone a very dark brown/red colour? I used a cab sauvignon I think.. Slightly put off because it looks different to the lovely photos above, my flavours so far seem very dark and it seems to taste like any ther stew... what am I missing here? Please disregard rating as dish is WIP!AnonymousLondon1/15/2019Loved it! I used short ribs and cut the recipe in half. The liquid cooked off a surprising amount. Maybe I simmered too aggressively??  I added more water (~2cups) and it was still super flavorful and not a ton of excess broth. Based on all of the confusion around garlic, I just smashed the cloves and peeled them and threw them in with the celery and leeks. I also added a large red onion. The beet and horseradish was fantastic. Definitely helped complete the dish and cut through the richness. I pulsed it in the food processor because I didn’t like the shredded beet texture. The bread crumbs were cute but didn’t add much. We dipped bread in the remaining broth and were in heaven. Can’t wait to make again. AnonymousPortland, OR11/11/2018Amazing flavor! Whole Foods was out of oxtail so I subbed short rib per the recipe's suggestion. I also halved the recipe but found it was not brothy at all, maybe I should've have cut the liquid exactly in half? I served over polenta so it was still excellent but definitely not soup. Also share same question as others: when do you remove garlic head?? I fished 1 half out with thyme and bones but the other half broke apart and I was pulling paper out of my mouth as I ate! :( Will definitely make again but will maybe try putting garlic in cheese cloth...closetcarnivoreBrooklyn, NY10/31/2018Overall, the stew had a nice consistency and flavor.  However, the oxtail meat was so tough that i ended up tossing the remaining stew after attempting to feed 3 people.  The meat was not edible.  The oxtail meat and bones most likely added a nice depth of flavor, but I would recommend adding a pound and a half of boneless short rib to the recipe and to discard the oxtail meat and bones when serving.Anonymousflorida10/26/2018My family would be very upset if they didn't each get at least one oxtail served to them in their individual bowls. No pulling the meat off the bones during the preparation process for us! Sucking and gnawing the bones is a key element of enjoying our oxtails, using this recipe or any other way!AnonymousNew York10/10/2018Over the weekend I made the silky pork stew from your most recent issue .  The recipe does not mention removing the heads of garlic.  The oxtail stew recipe above doesn't call for their removal either.  Are the split heads of garlic to be left in and served? toma488581668Michigan10/8/2018Gonna ask the same question I did about the chicken and kale stew, and will likely ask on every recipe from the article until there's an answer. Does the garlic come out of the pan after browning? Does it stay in during the cooking (with the skin on) and then get removed? Do you take any of the cloves out of the halved head and put them back in?Anonymous10/4/2018this is amazing! i used short ribs. \ncurious if the beets should be cooked or raw...AnonymousAtlanta, GA9/27/2018Explore Bon AppétitStewSoups and StewsEuropeanOxtailBeefMeatBeetVegetableHorseradishHerbs & SpicesWinterMainBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}