{"id": "049ad34208aa6c4b4e172bde4fdf23bd", "url": "https://www.bonappetit.com/story/pineapple-glazed-ham", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "How I Learned to Love Pineapple-Glazed Ham | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I Learned to Love Pineapple-Glazed HamThe garish Christmas classic gets a modern makeover.By Elyse InamineDecember 20, 2018FacebookTwitterEmailFacebookTwitterEmailLet’s play two truths and a lie, holiday edition.I’ve never cooked a pineapple-glazed ham.I’ve never eaten a pineapple-glazed ham.I’ve always understood why people love pineapple-glazed ham.Was that too obvious?I didn’t grow up with the grand tradition of making any kind of holiday ham—never mind this particular festive roast, which more or less embodies the word “garish.” My family was more surf and turf, a.k.a. my mom’s pepper-crusted prime rib served alongside my great aunt’s sushi, and I never totally understood the appeal of a huge hunk of salty pork covered in a nipple-esque pattern of saccharine-sweet maraschino cherries stabbed through pineapple rounds. But, I’m open-minded.Well, I became opened-minded once I laid eyes on senior food editor Chris Morocco’s pineapple-glazed ham during a photo shoot for our December holiday issue. There it was in all its 10 pounds of shiny glory, lacquered with a spicy, vinegary glaze that I could smell from a mile away and luxuriating in the middle of a propped-out table. I watched as half of it was sliced so thinly that the tender, juicy pieces kind of just flopped over the burnished orange and pineapple rounds, like a well-executed hair flip. For the first time in my life, I felt the call of the ham—and a deep urge to make it.Chris said it needed to be “good quality,” so I spent days searching for the right one. Would “maple” curing flavor would affect the recipe? It wouldn’t, Chris assured me. Is it okay if it’s labelled “uncured”? It was, he soothed. “Uncured and cured, it just means no nitrates are added. Unless it’s a fresh ham, which you don’t want to use, you can’t go wrong with either.”Days passed as I waited for my 6-pound, boneless, maple-cured prize from Heritage Foods to arrive (that’s what Chris used when he developed the recipe). Then, it finally did. On a Wednesday. At 6 p.m. And because I couldn’t wait any longer, I immediately got to work.I laid out a few long strips of foil (key), layered slices of pineapple and orange, placed the ham on top of the fruit, and then tightly wrapped the foil around it. (FYI, the fruit will all slide to the bottom of the foil and get piled up underneath the ham, which is totally fine.) Instead of using the fruit as a scary garnish, making it a “Donna Hay fantasyland/shingled armadillo ham,” as Chris described it, he decided to imbue the ham with those classic flavors by creating a citrusy steam room for it. “I wanted to treat the ham the way it deserved to be treated,” he says. A-M-E-N.During the three-hour steam session, I made the glaze. It’s just jarred pineapple juice, apple cider vinegar, brown sugar, and hot sauce (I went with Cholula), which makes for a complex, spicy, not-too-sweet combo. Then I kicked back, read a book, scrolled Instagram—the cooking was that hands-off! Imagine the next family gathering and how you could use all those hours to sneak away and destress a bit, then come back to unleash a showstopping centerpiece that will really bring everyone together. Joy to the world!So dreamy.\nAfter the three hours was up (yeah, it was getting late), I cranked up the oven to 425° and unfurled the foil. For the next 12 minutes, I brushed the glaze over the ham every three minutes—it’s worth it—until it had the same black lacquered look as the first ham I fell in love with. (If it’s not getting dark, it’s probably because it’s not caramelizing correctly. You’ll need to reduce your glaze a bit more, which I ended up having to do.) Once the ham took on that perfect hue, I let it rest. This. Is. Key. Do. Not. Skip. “Make sure you let it rest for at least 30 minutes to an hour,” Chris says. “This preserves its juiciness, and that’s entertaining insurance.”While it rested, I spread out the fruit and roasted it for about 25 minutes longer, spooning all the hammy-citrusy juices over the top every so often, until the edges turned a burnt-toast color. I arranged the fruit on my favorite platter, dotting it with some maraschino cherries (I went with fancy Stonewall Kitchen ones, but even the neon-red ones are fine here). Then I carved out thin slices of the ham, blush pink and so moist it almost looked sweaty, and laid them one by one on the platter. Proudly, I presented it to my husband at 11 p.m. Christmas had come early. Then I couldn’t restrain myself anymore and started dropping the slices straight into my mouth. It was then that I truly understood the allure of pineapple-glazed ham.Get the recipe:Pineapple-Glazed HamWe spiked the glaze for our retro-chic version of 1950s-style ham with hot sauce and apple cider vinegar to cut through the sweetness.View RecipeExplore Bon Appétitholiday2018HamChristmasRead MorecookingYour Big Holiday Dinner Should Be a Roast Beef Sandwich SpreadBy Alex BeggscultureThe Formula for a Memorable Holiday PartyBy Adam RapoportcookingThis Overnight French Toast Casserole Is a Holiday Breakfast as Exciting as PRESENTSSSSBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Elyse Inamine"]}