{"id": "04a3a6b9c7d3e4e1c3670118eb39c4b6", "url": "https://www.bonappetit.com/story/cook-for-ukraine", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Cook for Ukraine: How to Help People in Ukraine Through #CookForUkraine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Help People in Ukraine Through #CookForUkraineThese fundraisers are sending donations to relief organizations while celebrating Ukrainian cuisine.By Jessica Quinn and The Bon Appétit StaffMarch 9, 2022FacebookTwitterEmailIllustration By Arsh RaziuddinFacebookTwitterEmailWhen my wife Trina and I started Dacha 46, a queer Jewish Eastern European pop-up project celebrating Eastern European food, it was a business venture, but also a deep dive into my cultural roots and a way to rediscover my identity.My parents grew up in Soviet Russia. The majority of my childhood, I would tell people I was Russian. They would ask where I was from—regardless of the fact that I was born in New York—after hearing my mom’s thick accent or learning of my dad’s name, Boris, or seeing my brown-bag lunches of chopped liver sandwiches or butter and caviar black bread tartines. It wasn’t until much later, in high school even, that I realized that wasn’t entirely true. I’m Latvian Ukrainian, a fact I now take deep pride in.This past week, after the entire world watched as Putin invaded Ukraine, the hashtag #cookforukraine began trending on Instagram. The movement—in which chefs seek to raise both awareness of Ukrainian cuisine and money for various aid organizations—was started by London-based chefs and authors Olia Hercules and Alissa Timoshkina, two people Trina and I greatly respect and admire for their thoughtful and comprehensive support of Ukrainian and Russian culture and cuisine. We’ve since seen many fundraisers popping up all across the world, selling cheesecakes, hosting piroshki pop-ups, teaching virtual varenyky cooking classes, and donating millions of dollars to vital organizations such as Razom, World Central Kitchen, and UNICEF UK.From here in Brooklyn, Dacha 46 teamed up with 11 incredible local chefs to sell pastry boxes and raise funds for several organizations providing assistance to people in Ukraine, such as Razom, the American Jewish Joint Distribution Committee (JDC), and Nigerians in Diaspora Organisation. Each chef baked an Eastern European-inspired pastry, so we offered goods like strudel, piroshki, medovik, and mak bulochki—and sold out in a matter of hours.Sometimes when you try to tame a fire, the flame only rages stronger. Putin’s war hasn’t just made the people of Ukraine stronger, it’s united a community of proud Ukrainians dispersed around the world and made us more resolute in the fight for freedom. And as for Dacha 46, we fight with food. —Jessica Quinn, pastry chef and co-owner of Dacha 46Here’s a list of ongoing or upcoming food-related fundraisers and events. Check back for updates.2/26–3/10: @sqkarn is holding a raffle of Ukrainian foods, folk art, and other goods on Instagram. She says 100% of raised funds will go toward Razom and World Central Kitchen.2/28–3/13: @ogi_the_yogi is selling Basque cheesecakes in Austin, Texas. She says 100% of food sales will go toward charity organizations.3/13: @gertienyc, @huertasnyc, and @dacha_1946 are hosting a potluck dinner featuring music, drinks, and “Ukrainian Jew-ish food” at Gertie in Brooklyn. They say all proceeds from the event will go toward Razom.3/13: @littleloucooks is hosting a virtual cook-along of varynyky and potato pancakes over Zoom. She says all raised funds will go toward SOS Wioski Dziecięce, a Polish charity organization.3/13: @pingcoombes, @somerset.foodie, and @the_village_baking_co are hosting a cooking skills demonstration in Warminster, England. They say 100% of event ticket sales will go toward UNICEF.3/14: @olmstednyc is hosting a benefit food crawl at participating locations in Brooklyn. They say all proceeds will go to the Ukraine Crisis Relief Fund by Global Giving. 2-26—3/17: For @hamantashen_for_ukraine, bakeries around the world are selling hamantashen in participating locations in the U.S., Canada, England, the Netherlands, Poland, France, and Germany. They say proceeds from hamantashen sales will go toward the Polish Humanitarian Action, a Polish charity organization.3/19: @zuzazakcooks and @olaosmit are hosting a pierogi-making workshop in London, England. They say 100% of event ticket sales will go towards #CookForUkraine fundraisers.3/1—3/30: @pechka.bakery is selling a variety of cookies in Columbus, Ohio. The bakery says all cookie sales through March will go toward Razom and World Central Kitchen.4/30: @zuzazakcooks and @olaosmit are hosting a pierogi-making workshop in London, England. They say 100% of event ticket sales will go towards #CookForUkraine fundraisers.Ongoing: @veselkanyc is serving borscht in New York. The restaurant says all proceeds from borscht sales are “being donated to help Ukraine.”Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-09", "author": ["Condé Nast", "Jessica Quinn", "The Bon Appétit Staff"]}