{"id": "04a47f07a9f27a91711468e2219a91f0", "url": "https://www.bonappetit.com/story/rice-pilaf", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Rice Pilaf Is the Reason I'm Breaking Up With Stuffing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Reason I’m Breaking Up With StuffingRice pilaf is my new Thanksgiving side piece.By Asha LoupyNovember 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailEvery year on November 1, I think one thing: STUFFING. But this year as the month turned and my mind started wandering toward a table laden with festive foods galore, two new words popped front and center: RICE PILAF.Rice pilaf—when made well (we’ll get to the how-to’s in a minute)—is a thing of beauty: buttery, savory grains of rice intermingled with nutty, toasted noodles and flavored with alliums. Give me the serving bowl of that and a spoon and I’m a happy little turkey. But the holidays are all about gilding the lily, am I right? Here that means adding a mountain of caramelized mushrooms, a generous drizzle of lemony brown butter, and a veritable garden of dill (yes, the dill is mandatory).Now that we’ve made our introductions (reader, rice pilaf; rice pilaf, reader), let’s start with the basics. There are five building blocks of a good rice pilaf: long-grain rice, noodles, good vegetable stock, a few alliums, and a woodsy herb (think a sprig or two of fresh thyme or a couple of bay leaves).Because the ingredient list is simple, it’s important to use the best of each ingredient you can find, starting with the rice. I like to use aged basmati, which is aromatic and cooks into long, fluffy, discrete grains. I like Royal brand, which you can find at your local Indian supermarket or online.Next up, my favorite part: the noodles. Some people like orzo and others go for spaghetti, but for me, the only choice is angel hair. While it might be the internet’s most contested shape, angel hair gives me that classic childhood Rice-A-Roni vibe I crave and cooks in about the same time as the grains of rice. (Rice pilaf is not where you want al dente pasta.) In fact, I keep a package of angel hair pasta in my pantry at all times for when a rogue pilaf craving hits.Once you have your pasta, it’s time to break some of it into ½\" pieces. (This is a great task to give to any children running around or a friend or family member glued to the couch watching football.) You can also buy Spanish fideos, which are thin vermicelli-like noodles that are already broken for you.Whatever pasta you start with, the most important step is toasting the broken noodles, which adds a rich, toasty flavor that complements the fragrant basmati rice. While many pilaf recipes call for about a 3:1 or 4:1 rice to vermicelli ratio, I like almost a 2:1 ratio because the more toasted noodles, the more deep nuttiness permeates the whole dish.After the rice and toasted vermicelli, the other building blocks are simple. Good vegetable stock (it can be boxed or homemade), a few alliums like shallots and garlic, and a bay leaf or two (though you could substitute or supplement with thyme or rosemary). All of this is combined with salt and pepper and cooked to light, fluffy pilaf perfection.Once you’ve gotten the basics down, the world is your rice pilaf. I switch out the toppings from season to season. Around Thanksgiving it’s all about whatever mushrooms I can get my mitts on. But as I move into winter, a mess of caramelized brussels sprouts becomes the star. Come spring, tender asparagus and fava beans grace the rice pilaf. And in summer, caramelized zucchini and feta are my toppings of choice. No matter what vegetable topping you use, don’t skip the lemony browned butter drizzle or the fresh herbs.Even if you wouldn’t dream of skipping the stuffing this year, add this rice pilaf to your table—then just wait and see which one disappears first.Get the recipe:Rice Pilaf With Lemony Brown-Butter MushroomsFresh herbs, loads of noodles, and a glorious amount of brown butter make this mushroom-packed rice pilaf main course-worthy.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-08", "author": ["Condé Nast", "Asha Loupy"]}