{"id": "04b38629efba5618de17f3ffe43d7500", "url": "https://www.bonappetit.com/story/peach-tomato-burrata-salad", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "This Peach and Burrata Salad Recipe Has a Few of My Favorite Things  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Salad Has a Few of My Favorite Things (Burrata, for One)If you’re reading this, Julie Andrews, can we eat this salad together?By Emily SchultzJuly 17, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneFacebookTwitterEmailThe first words that came to mind when I saw this savory fruit salad were: “These are a few of my favorite things.” In fact, I sang it in my head, just like that. As you know, this is a line from the greatest movie to ever exist, The Sound of Music. And the more I think about it, the more I notice all of the similarities between the Julie Andrews classic and this new peach-burrata recipe.First, let’s discuss the unexpected pairing of a zippy hot sauce vinaigrette with creamy burrata, sweet peaches, and peak summertime tomatoes. Not unlike the pairing of the detached Captain Von Trapp and straight-from-the-nunnery Maria. Upon first glance, you wouldn’t think these flavor combos work. There’s a lot going on. But just as Maria’s softness balances out Captain Von Trapp’s harshness, as does the melt-in-your-mouth burrata and the punch-to-your-gut vinaigrette.Of course, we’ve all probably had some sort of cheese-and-fruit salad in our lifetimes; ever heard of caprese my friend?! What really separates this one is that fiery vinaigrette. When I asked Chris Morocco, the inventor of this dish, how he decided on the hot sauce vinaigrette, he fondly pointed out Gaskins, a restaurant in Germantown, NY. “I have only good memories there,” he said. One fond memory, at Gaskins last summer, was of a savory peach and tomato salad with chorizo oil, which was the inspiration for this dish. Instead of asking home cooks to make chorizo oil (the fat rendered after cooking chorizo), Chris decided on a vinegar-based hot sauce dressing, which has a similar bright color and heat.The real reason we’re all here though, is to savor the peak summertime fruit. Peaches and tomatoes so juicy you have to eat them over a sink. And instead of eating them during dessert, we’re moving them up a few courses. Specifically, to the salad course. Fire hydrants are sprinkling, music is blasting, and rules are meant to be broken during the summer.Photo by Alex Lau, Prop Styling by Alison Attenborough, Prop Styling by Heather GreeneTo cut peaches with ease, I learned a trick from food director Carla Lalli Von Trapp Music that made my friends watching me assemble this salad think I went to culinary school in some far off village. You hold the peach in your hand, and with a paring knife, make two cuts the length of the peach the size you would like your peach wedge to be. Cut all the way until you feel the pit, and on one side of the slit, simply turn your wrist just a hair so your knife is angling into the other slit. Then remove a wedge. This will save your kitchen countertop from a pool of peach juice and messy, squished peach wedges everywhere.You can finish this dish with whichever herb or flibbidegibbit you’d like; Chris recommends tarragon but I used basil and mint. I tossed all of the fruit together in a big bowl with the vinaigrette, neatly poured it out onto a serving plate with a lip to catch the hot sauce, and tore up some burrata to sprinkle on top of the fruit. Just like each Von Trapp child’s unique whistle call, you can customize this salad with whatever herbs, fruits, and creamy cheeses you’d like. Raindrops on roses and whiskers on kittens, peaches and tomatoes with burrata and hot sauce and warm woolen mittens. It does have a certain ring to it.The hills are alive with you making this salad:Peaches and Tomatoes with Burrata and Hot SaucePeaches with a zippy hot sauce-honey dressing and creamy burrata cheese.View RecipeExplore Bon AppétitBurrataSaladPeachTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Emily Schultz"]}