{"id": "04e0c443b6b9acb9a6a8687c384a6b78", "url": "https://www.bonappetit.com/story/how-covid-19-broke-food-system", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "This Dish Tells the Story of How COVID-19 Broke the Food System | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThis Dish Tells the Story of How COVID-19 Broke the Food SystemWhen a restaurant suffers, so does every supplier that relies on them.By Priya KrishnaDecember 1, 2020FacebookTwitterEmailPHOTO BY RENE ASISFacebookTwitterEmailFilipinx restaurant Archipelago has eight seats and five staffers, including owners Amber Manuguid and Aaron Verzosa, but its community extends to fishmongers, farmers, ceramists, and more. When the pandemic hit earlier this year, Seattle was one of the first U.S. cities to see its restaurant industry grind to a halt. But it wasn’t just its restaurants that suffered; it was all the suppliers who rely on them. For Archipelago, the domino effect was vast, as evidenced by the network involved in creating a single dish, their Anak Ni Bet (pictured above). Derived from a classic Ilokano dish called pinakbet, it usually includes bitter melon, squash, and eggplant. In this version the ingredients change seasonally. See how the virus’s ripple effect plays out below.Illustration by Steve GavanBarrel-Aged Apple Cider Vinegar from Alpenfire Cider in Port Townsend, WA“We have scaled back production, so the cider is just sitting,” co-owner Philippe Bishop says. But there’s a silver lining: “We found that with the type of apples we are using, letting them mature longer in bulk actually enhances the flavor of the final product.” Apples from Luckiamute River Farm in Kings Valley, ORCo-owner Rachel Ashley was worried she wasn’t going to be able to sell most of her apples this year. But her Airlie Reds—a cider apple with a red interior—are moving. The rest? She’ll turn them into juice.Apple processing at Northwest Mobile Juicing in Lolo, MT“We are actually much busier than expected,” owner Ryal Schallenberger says. Illustration by Steve GavanSpot Prawns from Key City Fish in Port Townsend, WA“Serving restaurants was 75 percent of our business,” president Johnpaul Davies says. To make ends meet he’s now connecting his restaurant partners with other local producers, like farmers and butchers. The chefs order directly from the producer, and Key City Fish handles the delivery.Seafood from New Day Fisheries in Port Townsend, WAThe market conditions have been “challenging” but are slowly improving, owner and third-generation fisherman Scott Kimmel says. Sales are 25 percent less than what they were last year.Illustration by Steve GavanHoneyboat Squash from Kamayan Farm in Carnation, WAOwner Ariana de Leña had to develop new procedures for harvesting and delivering food safely. On the plus side, she says, it has been a good year for selling crops. “There is a renewed interest in buying local and a deeper understanding of how fragile the food system is.”Squash seeds from Osborne Quality Seeds in Mount Vernon, WASales rep Linda Fenstermaker was inundated with calls from home gardeners wanting to buy seeds, even though Osborne sells mostly to commercial growers. “It was exciting to get so many new growers,” she says, “but it will be interesting to see next year how many people come back.”Illustration by Steve GavanCeramic Bowl from Lexa Luna Studio in Seattle“Before the pandemic, I relied a lot on in-person markets,” founder Alexa Villanueva says. “The pandemic has forced me to get creative in how I share my process, like creating videos for Instagram (@lexalunastudio).”Clay from Clay Art Center in Tacoma, WA“Sixty percent of our income is tied to the public education system,” owner Quinn Bougher says, referring to the center’s art classes. “Traditionally, our slow period is summer. This year it started in March, when we closed our showroom.” To control costs they’ve bought fewer materials and pivoted to curbside service.Illustration by Steve GavanChanterelles from Foraged & Found Edibles in SeattleForaged & Found used to sell primarily to restaurants; now it has shifted to retail. It’s not easy. “Even dealing with a grocery chain with 16 locations, the volume of orders is less than one large restaurant,” proprietor Jeremy Faber says.We’ve been following how the restaurant industry has been coping with the Coronavirus throughout the year. For more reflections from the people on the inside, read our Restaurant Diaries series. Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Priya Krishna"]}