{"id": "04fb7c0d615c2d6d548ac2b3e48c4c81", "url": "https://www.bonappetit.com/story/quarter-sheet-pans", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "These Tiny Sheet Pans Made Me a Better, Faster Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Tiny Sheet Pans Made Me a Better, Faster CookThis mini but mighty pan is a staple in restaurant kitchens for a reason.By Christina ChaeyOctober 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.One thing I wish someone had told me when I started cooking in a restaurant kitchen is that you only spend about 50 percent of your time actually cooking. The other 50 percent is mostly spent fighting with other cooks over, more or less, everything: Who gets the best burner. Who gets the good squeeze bottles (and who gets the ones that are permanently stained mystery orange). And, most critically, who gets to use the ovens.Restaurant ovens are particularly coveted real estate, because there are almost always fewer ovens than there are cooks who need to use them. I very quickly learned to a) set up my cutting board every day at the work station closest to the ovens, and b) keep a stack of quarter-sheet pans near me at all times. At about 9½ x 13” quarter-sheet pans are the little sibling of the sheet pans you probably already use at home to roast potatoes and bake cookies, and they were my secret weapon tool for maximizing kitchen efficiency. The second another cook would take out their giant trays of roast chicken/carrots/walnuts/whatever, there I was ready to claim that newly free rack with three or four tiny baking sheets of sesame seeds, croutons-to-be, and nuts that could all cook at once.And while I haven’t touched my fancy restaurant tweezers once since I stopped cooking professionally (there's something very tragic about using tweezers to plate a meal I'm eating alone in my pajamas), quarter-sheet pans remain one of the top five most useful tools in my home kitchen. I'm constantly reaching for mine to toast a few handfuls of walnuts for a salad, bake a couple of sweet potatoes, broil shrimp, or heat up leftover pizza—tasks that don't merit a half-sheet pan, which is only twice as big but ten times more annoying to handle. And since several quarter-sheets can fit in the oven together comfortably, I can roast garlic, make crispy Brussels sprouts, and bake fish fillets for dinner all at the same time like some sort of kitchen ninja.Need more proof that quarter-sheet pans are the hardest-working tools in the kitchen? I use them as a dish for breading crispy cutlets; as a makeshift cover for my one saucepan without a lid; for transporting tongs, oil, salt, pepper, and dish towels to the grill; and (my personal favorite) as counter garbage pail for scraps and trash. This mini pan‘s greatest advantage, however, comes after cooking: It slides right into the bottom of my sink for easy cleaning and reusing. I'm no longer fighting with anyone for oven space, but the line cook in me is still all about that maximum efficiency life.Photo by Alex LauNordic Ware Quarter-Sheet Pans, 2-Pack$26 at Amazon$34 at Food52Explore Bon AppétitShoppingRead MoretechniquesThese Are Pots and Pans You Really NeedBy Rochelle BilowPhotography by Alex Laucooking10 Tips for Better Sheet-Pan DinnersBy Anna StockwellcultureThe Only Sheet Pan You’ll Ever Need Costs $20 and Will Last a LifetimeBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Christina Chaey"]}