{"id": "04fe9769d1d1fd530b2e13550348a552", "url": "https://www.bonappetit.com/recipe/ham-hock-and-white-bean-stew", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Ham Hock and White Bean Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueHam Hock and White Bean StewBy Claire SaffitzSeptember 18, 20184.5(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintWhile this stew is definitely heavier on the beans than on the ham, the hocks lend a rich, smoky essence that flavors the beans from the inside out. If you can’t find corona or gigante beans, sub in a smaller white bean like cannellini, but keep in mind that they’ll cook a lot faster. To compensate, make sure you give the ham hocks a 30-minute head start. You can let this stew sit a full 12 hours to let the flavors really meld together, but this step is totally optional. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servingsFrizzled Shallots3medium shallots, thinly sliced into rings½cup vegetable oilKosher saltHoney-Mustard Cream½cup sour cream3Tbsp. Dijon mustard1½tsp. honeyFreshly ground black pepperStew and Assembly3Tbsp. extra-virgin olive oil2medium onions, peeled, halved through root ends2heads of garlic, top third removed2small carrots, trimmed, scrubbed, cut into bite-sized pieces½cup dry white wine2½lb. smoked ham hocks (about 4 medium)1bunch of thyme, stems tied together with kitchen twine2cups corona or gigante beans, soaked overnight, drainedKosher salt, freshly ground pepperChopped cornichons and/or dill sprigs (for serving; optional)PreparationFrizzled ShallotsStep 1Heat shallots and oil in a small saucepan over medium, swirling often, until shallots are deep golden brown, 6–8 minutes. Pour into a fine-mesh sieve set over a heatproof measuring glass. Give sieve a good shake, then spread out shallots on a paper towel to drain. Season with salt; let cool.Honey-Mustard CreamStep 2Stir sour cream, mustard, and honey in a small bowl until smooth; season with pepper. Cover and chill.Step 3Do Ahead: Cream can be made 2 days ahead. Keep chilled.Stew and AssemblyStep 4Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook onions and garlic, cut side down, and carrots, turning carrots occasionally, until cut sides of onions and garlic are golden, about 4 minutes. Add wine, stirring to release any bits stuck on bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add ham hocks, thyme, beans, and 9 cups water. Season with several pinches of salt and lots of pepper and bring to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until beans are tender and creamy and broth is very flavorful, 2–2½ hours.Step 5Remove pot from heat and transfer ham hocks to a cutting board. Let sit until cool enough to handle, then pull meat from bones and tear into bite-size pieces; discard fat, skin, and cartilage. Add meat and knuckle bones back to pot as you go. Let stew cool uncovered until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).Step 6Bring to a very gentle simmer, covered, over medium-low heat. Pluck out and discard bones, thyme, onions, and garlic heads (don't worry about any cloves that may have escaped into stew). Season with more salt and pepper if needed. Ladle into bowls and serve with Frizzled Shallots, Honey-Mustard Cream, cornichons, and/or dill as desired.Step 7Do Ahead: Stew can be made 3 days ahead. Keep chilled.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethHow would you rate Ham Hock and White Bean Stew?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI love bean stews!... I'm just curious why you don't chop the onion but leave it in halves...how does that affect the overall taste and consistency of the dish?Daniel OchirosiStockholm, Sweden11/8/2020This was delicious!! Everyone loved it. Recipe clearly says “pluck out and discard...onion and garlic heads.”AnonymousMaryland2/28/2020For those wondering about what to do with the garlic, I have seen other recipes where you cook with the head intact (except for the top third that was cut off) and then at the end you squeeze the heads with tongs and the cooked flesh easily omes out in a paste that will flavor the broth. I imagine that is what they were going for here.Anonymous10/15/2019The flavor was amazing, I loved the dijon cream addition. I made the soup 2 weeks ago and already plan to make it again tomorrow. AnonymousSt. Petersburg, FL1/15/2019PLEASE tell us what to do with the garlic heads!!!kildairaConnecticut10/25/2018What do you do with the garlic?\nAnonymous10/22/2018This soup was a crowd pleaser last night. Great broth and creamy beans go hand in hand. Definitely make the sour cream and fried shallots if you make this soup. They take no time to make but really improve the flavor. The sweet crunch bites of shallots with the dijon coming in at the end of the bite make this soup so good. The only reason why I gave this recipe 4 stars was because the directions were a little unclear. I followed the first paragraph of the soup assembly directions to a T. After letting it sit about 24 hours in the fridge I removed the ham and strained everything out. After bringing the broth to a gentle simmer I added 2 cans of Cannellini beans (I didn't use any dried beans) and hand torn ham back in. Right before serving I stirred in a hearty amount of chopped kale. The recipe doesn't specify straining the soup but without straining this would have been difficult to consume. However, the browned garlic heads and onion add so much goodness to the broth you can't skip browning them. DarrahPState College, PA10/9/2018This was fantastic.  I added the shallots, cornichons, dill and cream and would definitely recommend all of them.  They made the soup.  I cooked the soup on Sunday night, and then reheated and ate the soup on Monday.  I will definitely be making this again.  The only thing that I wasn't sure about was the garlic.  There aren't any directions as to what to do with the garlic after the first step, and I didn't want garlic skin floating around in my soup, so I ended up peeling the cloves and adding them in whole. ktanmoSonoma County, California10/8/2018Explore Bon AppétitStewSoups and StewsAmericanWhite BeanBeanVegetableCarrotGarlicFallWinterMainGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}