{"id": "0526c0bd19329ff226fc03e6cd213db0", "url": "https://www.bonappetit.com/story/better-whipped-cream", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "For the Best Whipped Cream, You Need This One Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One Ingredient Takes Whipped Cream From Good to GreatYour whipped cream could be even better. (Yeah, you heard us right.)By Alex DelanyJune 14, 2019FacebookTwitterEmailFacebookTwitterEmailSome would call us big whipped cream people over here at Basically. Others would say we're whipped cream fanatics. Some might even go so far as to claim that we include whipped cream whenever and wherever possible. So yeah, we'll admit it: We love whipped cream. But just because you love something doesn’t mean you can’t make it better (just don't try to do that with your significant other).Sometimes creamy, lightly sweetened, and pillowy just isn’t enough. Sometime you need to introduce one more flavor to the spectrum: Tang.And where does that come from? Sour cream. Thick and tart, it's our secret weapon when it comes to turning whipped cream up to 11, lending a brightness that makes buttery, sweet desserts taste more refreshing. (Sour cream is also what helps to make the biscuits in our Strawberry Shortcakes so light and tender.)Here’s how to upgrade your whipped cream:\nWhisk your heavy cream in a large bowl using a whisk (if you're strong) or a hand mixer (if you're efficient) until soft peaks start to form. (If you're using an electric beater, gradually increase the speed as the whipped cream thickens to avoid messy splattering.) Once you start to see soft peaks (the shapes that cling to the edge of your whisk and stand up in the bowl but slump over in cloud-like billows), add ¼ sour cream for every 1½ cups of heavy cream. Whisk in the sour cream in until it’s incorporated fully, but don’t go any further! Stiff, over-whipped cream is a sad sight.Strawberries, waiting for whipped cream.\nPhoto by Chelsie Craig, FoodNow you’ve got a bowl full of slightly tangy, multi-dimensional whipped cream that can be dolloped on all of the berries, pies, cobblers, and cakes that will hopefully be making their way to your table in the very near future.Whipped cream is already great. But you deserve better. You deserve a whipped cream with multitudes.A very good reason to make whipped cream. Just saying.Basically Strawberry ShortcakesYou can make this classic summertime dessert with whatever seasonal berries are calling your name.View RecipeExplore Bon AppétitBasicallyDessertWhipped CreamRead MorecookingThese Strawberry Shortcakes Have Only 10 IngredientsBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Alex Delany"]}