{"id": "0536e35e0f6a65dc1fcfefa02602fbec", "url": "https://www.bonappetit.com/story/simple-shoyu-chicken-recipe", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "This Shoyu Chicken Recipe Is Almost Too Simple to Share | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mom Said Her Shoyu Chicken Recipe Was Too Simple to ShareA quintessential dish from Hawai’i, it's the perfect combination of salty and sweet.By Mitchell Kuga, As Told to Ali FrancisMay 11, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Fusion is a word that’s come to imply a lack of authenticity, but much of the culture of Hawai’i is itself a hybrid, and the plate lunch is a beautiful reflection of that. A kind of bento box—like take-out meal, plate lunch was originally eaten by laborers. Today, you can roll up to drive-ins and food wagons across the islands for a styrofoam container loaded with two scoops of white rice, mayo-laden macaroni salad, and an entrée—to name just a few, katsu, kalua pig, and cold ginger chicken, or shoyu chicken.Sweet and salty, shoyu chicken is made by simmering chicken in an aromatic broth of ginger, garlic, Mr. Yoshida’s sauce (or soy sauce plus brown sugar), and mirin. The word shoyu in the name refers to Japanese-style soy sauce, and the flavor of the dish as a whole is similar to that of teriyaki. Still, the “official” origins of the recipe are hard to trace. Like many dishes in Hawai’i, shoyu chicken is an amalgamation of tastes brought together by immigrants from China, Portugal, Japan, the Philippines, Korea, and Puerto Rico who began traveling here to work the fruit and sugar plantations in the 1850s.I don’t remember the first time I ate shoyu chicken; when I was growing up in Hawai’i, it was one of those ubiquitous dishes that was always around. My mom had three kids to feed and my dad was always working—this was a meal she could easily throw together with only a pot and a handful of staples. It can feed mass amounts of people in a short time and you don’t have to be too precious about quantities; most combinations of the core ingredients will result in moist, flavorful meat. In many ways shoyu chicken is really about abundance and communion.My mom’s recipe deviates a little from the plate lunch entrée because she tends to let the sauce caramelize longer so it’s thicker and the flavors feel more concentrated. I personally like to go heavier on the ginger and garlic than what my mom’s recipe calls for, but you can adjust the quantities to your own tastes.Here’s how to make shoyu chicken:Place a large pot or Dutch oven over medium heat and coat the base with vegetable oil. Slice up a 2-inch piece ginger and smash 3–4 garlic cloves, then stir-fry them in the oil until they’re aromatic. (Note: More ginger equals more heat.) Add 1 cup Mr. Yoshida’s sauce or 1 cup shoyu plus ¾ cup brown sugar, 1 cup water, and ½ cup mirin to the pot, and bring the liquid to a boil. Transfer 3 lb. bone-in, skin-on chicken thighs, wings, or drumsticks into the pot. When the liquid returns to a boil, reduce the heat, cover the pot, and simmer chicken for about 30 minutes. Remove cover and simmer for another 15 minutes or until the sauce has noticeably thickened. After serving, top the chicken with chopped scallions.Growing up, I remember eating shoyu chicken drumsticks ravenously with my hands, but there are plenty of ways to serve it. Mac salad is a classic pairing; it lends a cold, creamy texture that cuts some of the saltiness perfectly. In my family, there was always cooked white rice present to soak up the umami-rich sauce, plus a side of canned sweet corn.This is the first time my mom’s recipe has been written down—shoyu chicken is a dish that was passed down orally—and she was actually reluctant to share it. She said it’s “too simple,” a dinner she would make when she was feeling tired or busy. But that’s exactly the point for me. Over the last year, especially as my zest for culinary experiments wanes, I’ve been making shoyu chicken more often. Each time the end result varies just a little. But it always delivers a kind of easy, homey comfort—something I can’t get enough of these days.Mitchell Kuga is a culture writer based in Honolulu, Hawai’i.Explore Bon AppétitIt's That SimpleChickenHawaiiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-11", "author": ["Condé Nast", "Mitchell Kuga", "As Told To Ali Francis"]}