{"id": "056a0bd6a0c4b044b80841e9aacde73f", "url": "https://www.bonappetit.com/story/new-spritz-recipes", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "6 Spritz Recipes: All You Need Is Booze + Soda + Bubbly Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBooze + Soda + Bubbly Wine = All You Need for These 6 Spritz RecipesAnd a glass, I guess.By Alex BeggsMarch 23, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailThere’s nothing wrong with an Aperol Spritz—like red nail polish, The Great Gatsby, or the early work of Britney J. Spears, it’s classic for a reason. And that reason is: It’s perfect. Prosecco, Aperol, club soda, an orange wedge. No night that began with an Aperol spritz has ever ended in murder and mayhem. I think. But, for the sake of moving time forward and having a bit of fun, we came up with six spritz recipes that follow the easy formula of:base + bubbles + more bubbles + garnishBut instead of your usual Prosecco, club soda, etc, we’re playing with Amaro combined with the nose-hair-tingling bubbles of cherry soda and Lambrusco. There’s the crowd-pleaser Campari, sparkling rosé, and lemon soda. And the weird, slightly savory one you didn’t see coming but can’t stop sipping, Pimm’s and Cel-Ray soda (the test kitchen’s favorite). Cynar and grapefruit soda?! Don’t mind if I do. (The sweet-bitter combo is super refreshing after a long summer’s day of poolside napping.) The thing here is, you need to try all five to truly decide which spritz is right for you.Spritz 101Combine 2 oz. liqueur and 3 oz. sparkling wine in an ice-filled glass+Top with a splash of soda and stir gently to combine.+Garnish optional but highly recommended (grapefruit zest, a slice of peeled ginger, a cherry on top never hurt).Memorize: The 2:3 ratio of liqueur to sparkling wine. Everything else will fall into place—in your glass.Get the recipes:Cynar SpritzSweet, citrusy grapefruit pairs well with herbaceous Cynar, and adding dry Prosecco provides balance.View RecipeSpiced Cherry SpritzA cherry cola spritz—for adults.View RecipePimm’s SpritzCel-Ray (celery soda) and Pimm’s make an unsuspecting great pair in this easy spritz.View RecipeCampari SpritzSparkling rosé and lemon soda complement the citrusy flavor of Campari and make for a beautifully vibrant cocktail.View RecipeAperol SpritzThis classic combo should be credited with starting the whole spritz phenomenon in the United States.View RecipeGinger SpritzGinger beer and bubbly cava were meant to be together.View RecipeOr try this classic from last summer:Explore Bon AppétitCocktailAperolCampariSummer DrinksRead MorecultureThe Rosé-Aperol Spritz Is Your Drink of SummerBy Alex BeggscultureShrubs, Spritzes, and Swizzles: Everything You Need to Make Summer's Coolest CocktailsBy Belle Cushingrecipes32 Wine Cocktails, Because You Need More Summer WaterGallery32 SlidesBy Elyssa GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-23", "author": ["Condé Nast", "Alex Beggs"]}