{"id": "056fd7dbea764293d015c5fd7621f067", "url": "https://www.bonappetit.com/story/white-balsamic-vinegar", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "What Is White Balsamic Vinegar, and Why Do Chefs Love It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenWhat Is White Balsamic Vinegar, and Why Do Chefs Love It?This isn’t the syrupy-sweet stuff you drizzle on Caprese.By Christina Chaey and Chris MoroccoSeptember 19, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailLike Coca-Cola Clear or white chocolate, white balsamic vinegar seems...wrong. But then we spotted bottles of it all over the kitchen of our #7 Best New Restaurant of 2018, Che Fico, and wondered: Had we been overlooking something secretly great all along?The answer: Yes. Yes we have. At Che Fico, chef David Nayfeld uses white balsamic to brighten up vegetable dishes and salads—anything that could use a touch of agrodolce, or sweet-tart flavor. It’s floral and fruity with a sweet finish, like a wine we wouldn’t mind drinking a glass of. Nayfeld uses a mixture of white balsamic vinegar and butter to glaze roasted Brussels sprouts for his kaleidoscopic Chopped Salad, which he says is inspired by his serious love and nostalgia for the Olive Garden chopped salad. The glossy and rich Brussels sprouts join a tangle of honey-roasted squash, marinated chickpeas, cured meats, and cheese in a salad so complex and flavorful that we had to get the recipe.We often use O California’s white balsamic ($15) in the BA Test Kitchen.\nPhoto by Chelsie CraigSo what is white balsamic, exactly? It starts out same way regular balsamic vinegar does: with grapes. Both types begin with a white-grape “must” (the term used to describe the crushed fruit plus the skins, seeds, and stems). To make regular balsamic, the must simmers for basically ever, until it becomes syrupy and caramelized. The resulting vinegar is then aged in a series of barrels for several years, which add to the vinegar’s flavor, color, and character. For white balsamic, however, the must is pressure-cooked to prevent it from browning before it’s aged for a short time. The result is a golden-hued vinegar that tastes like a gentler version of syrupy balsamic.Restaurant chefs use white balsamic vinegar not only for its milder flavor, but also because it won’t turn a salad dressing or sauce brown the way the regular stuff will. Use it in any vinaigrette recipe, for dressing roasted vegetables, or for deglazing a pan of crispy chicken thigh bits. Don’t know where to start? Acetaia Cattani ($15) and O California ($15) are a couple of our all-around favorites for the price and quality.Then make the Che Fico salad:Chopped SaladThe dressing and assembled ingredients alone make this salad a star. But the extra effort of cooking the vegetables is worth it we promise!View RecipeExplore Bon AppétitVinegarRead Morebest-new-restaurants3 Lessons I Learned Cooking at Che Fico, One of America's Best New RestaurantsBy Chris Moroccobest-new-restaurantsChe Fico in San Francisco Is the No. 7 Best New Restaurant in America 2018By Julia KramercookingWhy Make Pudding When You Can Make Chocolate Budino?By Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-19", "author": ["Condé Nast", "Christina Chaey", "Chris Morocco"]}