{"id": "05735eb7b96e582ca9987802f5b72f2c", "url": "https://www.bonappetit.com/story/what-are-tomatillos", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "What Are Tomatillos, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are Tomatillos, Anyway?Tomatillos look like little green tomatoes, but don't go jumping to conclusions. They have their own identity.By Alex DelanyMarch 20, 2018FacebookTwitterEmailFacebookTwitterEmailGuess what. Tomatillos aren’t baby tomatoes. Yeah. Even though the Spanish name translates to “little tomato,\" they are something else entirely. What are tomatillos then? Allow us to explain.First things first. These little fruits (yep, they're fruits, just like tomatoes and cucumbers) are native to (and largely grown in) Mexico, but have been adopted by American farmers due to their resistance to disease. Tomatillos, sometimes called husk tomatoes, look like green, unripe tomatoes with a dry, leafy husk that wraps around the outside. The color of the fruit is a beautiful bright green, which fades a bit once you cook them—but hey, some of us just peak early, right?Tomatillos have a slightly more acidic, slightly less sweet flavor than ripe and unripe tomatoes. Overall, the flavor is more vegetal and bright, and the interior texture is denser and less watery. Prepping a tomatillo is pretty straight forward. The husks can be easily removed with your hands and discarded. You’ll notice a sticky film on the surface, which will come off with a quick rinse under warm water. From here, you decide what you want to do with them. If you want to keep the flavor bright and play up their bracing acidity, use them raw. If you want to mellow out that acidity a bit and access the fruit's deeper, more savory qualities, cooking them—whether you're roasting or grilling them whole or chopping them for a saute—is the move.Four very good words: Avocado. Tomatillo. Salsa. Verde.\nMarcus NilssonRoasted tomatillo salsa is great. Raw tomatillo salsa is tangy and great. But tomatillos are good for more than salsa. You can keep the sauce train running by pureeing them into creamy sauces and curries, or add them into vinaigrettes for more acid. They can also sub in for a tomato when sliced thinly, layered over some ricotta, drizzled with olive oil, and eaten on toast. You can grill them with onions for steak side, incorporate them into bean-heavy chili or posole, or braise them with chicken for a saucy stew.Tomatillos are versatile as all hell and pack fresh, tangy flavor that lights up a spring or summer dinner. They can be anything you want them to be. Just don’t call them baby tomatoes. It hurts their feelings.Tomatillo salsa is a solid tostada topping, FYI.A Cheap Chorizo Tostada Recipe for Your Rent Week NeedsBecause quesadillas are SO sophomore year. This chorizo and refried bean tostada recipe is what you need when your wallet is broken.View StoryExplore Bon AppétitBasicallyTomatilloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Alex Delany"]}