{"id": "05774149f47d062b7feb9b8aa7217b51", "url": "https://www.bonappetit.com/recipe/nasi-lemak", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Nasi Lemak Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueNasi LemakBy Kyo PangSeptember 17, 20193.1(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIt’s way too easy to fall in love with the Malaysian dish Nasi Lemak, a coconutty rice bowl topped with crispy-crunchy crumbles of teeny little fried anchovies dressed in a sweet-spicy sambal. This recipe is from chef Kyo Pang of Kopitiam in New York, No. 6 on 2019’s Hot Ten list. Look for the smallest dried anchovies (ikan bilis) you can find: They’re known for their superior flavor and texture. We’ve provided a few options for dried chiles below, but any thumb-size red chile you can find at an Asian market will get the job done.Ingredients4 servingsSambal Ikan Bilis3½oz. dried paper lantern chiles, dried bird chiles, or dried chiles de árbol2cups vegetable oil½cup red-skin Spanish peanuts2½cups small dried anchovies2medium shallots, halved3garlic cloves2Holland chiles, stems removed, halved lengthwise4½tsp. sugar1½tsp. tamarind concentrateRice and Assembly2cups jasmine rice1tsp. kosher salt3pandan leaves (optional)½cup light unsweetened coconut milk4large eggs½English hothouse cucumber, cut in half lengthwise, thinly sliced crosswiseSoy sauce (for serving)Ingredient InfoPaper lantern chiles can be found at Asian markets and themalamarket.com. Tamarind concentrate, often labeled “concentrate cooking tamarind,” can be found at Asian and Thai markets.PreparationSambal Ikan BilisStep 1Chop paper lantern chiles into ½\" pieces, discarding most of the seeds that fall out. Place in a small bowl and pour in boiling water to cover. Let sit 30 minutes to soften, then drain.Step 2Meanwhile, bring oil and peanuts to a gentle simmer in a small saucepan over medium heat; cook, adjusting heat as needed, until peanuts are golden brown, 6–8 minutes. Using a slotted spoon, transfer nuts to paper towels to drain; set aside for serving. Immediately add anchovies to oil and cook until golden brown and crisp, about 2 minutes. Transfer to fresh paper towels; let cool. Set ¼ cup oil aside.Step 3Pulse shallots, garlic, and ¼ cup fried anchovies (save remaining anchovies for serving) in a food processor until a smooth paste forms. Transfer to a medium bowl. Add paper lantern and Holland chiles to food processor (no need to clean) and pulse until very smooth and no visible pieces of dried chile remain. Transfer chile purée to a small bowl.Step 4Heat reserved oil in a medium skillet over medium-high until shimmering. Add shallot mixture and cook, stirring, until slightly darkened in color and fragrant, about 2 minutes. Mix in chile purée and cook, stirring often, until it starts to stick to bottom of skillet, about 3 minutes. Reduce heat to low. Add sugar, tamarind concentrate, and ¼ cup water and cook, stirring often, until sambal is much darker in color and thickened, 25–35 minutes.Step 5Do Ahead: Sambal ikan bilis can be made 1 week ahead. Let cool; cover and chill.Rice and AssemblyStep 6Place rice in a medium saucepan and pour in cold water to cover; swirl with your hands to rinse away some of the starch. Drain and repeat process 2 more times. Water should be just slightly cloudy at this point. Place rinsed rice back into saucepan and cover with 2½ cups cold water; stir in salt. Gather pandan leaves (if using) together and tie into a knot; add to pan. Bring rice to a simmer over medium-high heat. Cover pan and reduce heat to low; cook 18 minutes. Remove lid and stir in coconut milk. Cover, remove from heat, and let sit 5 minutes.Step 7Meanwhile, bring a small saucepan of water to a boil. Carefully lower eggs into water. Cook 10 minutes, then transfer to a bowl of ice water and let cool. Peel eggs and cut in half lengthwise.Step 8Combine sambal ikan bilis, reserved fried peanuts, and reserved fried anchovies in a medium bowl and toss to evenly coat. Scoop a generous ½ cup sambal mixture into a 12-oz. bowl. Top with 1½ cups rice and pack into bowl with a rubber spatula to compress. The bowl should be filled to the rim. Place a slightly larger bowl upside down over bowl of rice. Invert so larger bowl is now on the bottom; lift off smaller bowl. You should have a dome of rice and anchovy mixture nestled in the center of the larger bowl. Arrange 8 cucumber slices around rice dome, overlapping slightly to make a semicircle. Add 2 egg halves to side of rice with no cucumber slices; season yolks lightly with soy sauce. Repeat with remaining rice, sambal mixture, cucumbers, and eggs to make 3 more bowls.How would you rate Nasi Lemak?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis recipe should come with a warning! I saw that other reviewers said this dish was too spicy so I added only half the amount of chilies de arbol and skipped the Holland chilies altogether. It was still a three alarm fire for everyone at the table -- no one could finish their bowl. Even after making huge reductions in the amount of chilies this was spicy to the point of being inedible. Extremely disappointing, especially for the amount of work involved. ClarkSeattle, WA1/24/2022A little perplexed by this recipe. I live in NYC and am lucky enough to eat at Kopitiam semi-regularly. I’m looking at a jar of their sambal ikan bilis and the ingredient list mentions shrimp paste and turmeric neither of which show up here. It’s also deeply fishy and flavorful but not terribly spicy. AnonymousBrooklyn, NY12/15/2021this recipe is SO Bomb. All the flavors mix together in ways that feel so simple yet mind blowing. The salty fattiness of the peanuts with the tangy sourness of the sambal, and the crunch of the anchovies!!  Christina Yaep is quickly becoming my favorite at bon appetit. AnonymousOakland4/19/2020Much better to watch the accompanying video than follow this recipe verbatim. As noted in other comments below, 3 1/2 oz of dried chilies is WAY too spicy for this recipe. The video from Kopitam shows them using more fresh long (mild) red chili, and probably less than an ounce of the dried - and they're making more than double quantities. That said, the concept of the recipe is great, just follow the video! Possibly worth noting is i have often eaten this recipe with some quickly sautéed onion in with the fish and sambal (Nonya in NYC Chinatown is a good example) which add sweetness and bulk. \nAnonymousnew york4/5/2020I love nasi lemak! However, I don't think that this recipe was developed well. I used less than 1/5 of chili paste produced following this recipe and still the spiciness brought tears to my eyes. I found it impossible to eat. Although, I believe that if you reduce the amount of chili paste used (or adjust it to your liking) there is a hope of nailing this dish following the rest of the instructions. AnonymousNYC1/6/2020This was a fun recipe to try! BUT, oh my god it’s extremely spicy. I substituted dried chiles de arbol for paper lantern (as the recipe suggested) since I had them on hand, and Fresno chiles for Holland since the internet said that was a decent substitute. This is the spiciest thing I’ve eaten in a long time, so there should have been some kind of warning in the recipe or alternative sambal ingredients for a less spicy version! Luckily I made a single serving for my first taste and didn’t mix all of the sambal with the fish and peanuts, so I can cut back on the next round. Just be warned! Otherwise (looking past the Xtreme spicy), this was delicious with all of the different textures, and the bowl inversion actually worked!soapnanaChicago11/2/2019Delicious! I was sharing with a toddler so I scaled down the dried Chile’s and replaced one Holland chile with 1/4 of a red bell pepper and it was a big hit. I love Korea style dried anchovies and peanut but the coconut rice and tamarind in this recipe take it to a whole new level. Yummy and easier than I’d expected.Sarah KrikorianOakland, CA10/9/2019Explore Bon AppétitMalaysianSoutheast AsianAsianAnchovyFishSeafoodChileVegetablePeanutNutRiceRice & GrainsMainSideDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Kyo Pang"]}