{"id": "057936ab40335448c871770e607c38a6", "url": "https://www.bonappetit.com/recipe/black-seed-bread", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Black Seed Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueBlack Seed BreadBy Cortney BurnsJanuary 8, 20193.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis seedy gluten-free loaf features sesame in three forms: white and black seeds and tahini. Ground flaxseed and egg bind the batter, and whole seeds provide a tiny crunch. Plus, this bread keeps for days and is a great vehicle for nut butters, dips, and spreads. Snacktime, solved.IngredientsMakes one 9x5\" loafNonstick cooking oil spray1cup flaxseed, divided6large eggs3Tbsp. grapeseed or extra-virgin olive oil1Tbsp. tahini1cup black sesame seeds½cup white sesame seeds½cup poppy seeds1Tbsp. kosher saltSpecial EquipmentA spice millPreparationStep 1Preheat oven to 200°. Line a 9x5\" loaf pan with parchment paper, leaving a generous overhang on both long sides. Coat with nonstick spray. Grind ½ cup flaxseed in spice mill to a fine powder. Whisk eggs, oil, and tahini in a large bowl to combine. Add ground flaxseed, black and white sesame seeds, poppy seeds, salt, and remaining ½ cup flaxseed and mix well. Let sit 30 minutes to let flax hydrate.Step 2Scrape batter into prepared pan and bake until top is firm to the touch (an instant-read thermometer inserted into the center should register 165°), 1½–2 hours. Transfer pan to a wire rack and let loaf cool in pan 5 minutes. Using parchment overhang, lift loaf out of pan and onto rack; remove parchment. Let loaf cool completely.Step 3Do Ahead: Loaf can be made 5 days ahead. Wrap tightly and chill.How would you rate Black Seed Bread?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleReplace the tablespoon of salt for a teaspoon (or even less). Great nutty taste, great texture. Next time I'll add a couple of tbsp of honey!lemikeMontréal, Canada3/2/2019It was entirely too salty! Either it was a mistake or the writer of this recipe needs to cut back on her salt intake.  I will try it again though. I had everything on hand and it was fairly easy.  I loved the texture.AnonymousOK2/10/2019Are the white sesame seeds hullled or unhulled?Anonymous2/4/2019It came out really salty.  I wonder if the tablespoon of salt on the ingredient list was a misprint. I gave it two stars because my dog likes it!AnonymousRidgefield, CT1/20/2019Explore Bon AppétitBreadFlaxseedSeedTahiniCondiments, Sauces & PastesSnackGluten-FreeDairy-FreeVegetarianHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Cortney Burns"]}