{"id": "0581cb2dffdacd7080227fe65df89549", "url": "https://www.bonappetit.com/recipe/sweet-and-salty-mango-lassi", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Sweet and Salty Mango Lassi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueSweet and Salty Mango LassiBy Preeti MistryMarch 16, 20214.7(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChef Preeti Mistry prefers their lassis not too sweet, which is why this mango and cumin version—a cross between a mango lassi and a salty lassi called chaas—includes a little lime juice for acid and kala namak (black salt) for umami (in a pinch you can use kosher salt). To finish, Mistry suggests adding white rum, “if that’s your thing.” This recipe is on the lighter side, so if you like your lassi thicker, hold back some of the water and skip the ice.Find more of chef Preeti Mistry’s Holi party recipes here.Ingredients8 servings2Tbsp. cumin seeds½cup fresh lime juice2tsp. kala namak (black salt) or kosher salt4cups plain whole-milk yogurt130-oz. can unsweetened mango pulp (such as Swad)Mint sprigs (for serving)special equipmentA spice mill or mortar and pestlePreparationStep 1Toast cumin in a small dry skillet over medium heat, shaking pan occasionally, until slightly darkened and very fragrant, about 2 minutes. Let cool, then finely grind in spice mill or with mortar and pestle.Step 2Whisk lime juice, kala namak, and ground cumin in a small bowl until salt is dissolved. Pour into a large pitcher and add yogurt, mango pulp, and 2 cups cold water; stir until smooth. Chill until cold, at least 1 hour and up to 1 day.Step 3To serve, divide lassi among glasses filled with ice and garnish each with a mint sprig.How would you rate Sweet and Salty Mango Lassi?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is delicious. I don’t think you lose much by using ground cumin rather than toasting and grinding the seeds yourself.   AnonymousNew York NY4/5/2021Explore Bon AppétitCold DrinkDrinks AllPitcher DrinkIndianSouth AsianAsianMangoStone FruitFruitYogurtOther IngredientsEasyQuickDrinksVegetarianNut-FreeGluten-FreeNonalcoholicHealthyishRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}