{"id": "058cff00b4cdd007c83d9d8cc5d17d7f", "url": "https://www.bonappetit.com/story/sichuan-peppercorns", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "What Are Sichuan Peppercorns? First of All, They're Not Peppers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are Sichuan Peppercorns? First of All, They’re Not PeppersSichuan peppercorns are essential in Sichuan cooking. Here’s what else you need to know about these tiny, mouth-numbing flavor grenades.By Chala Tyson TshitunduSeptember 29, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Sichuan cooking is one of the most complex, sophisticated, and flavorful cuisines in the world–that’s not an opinion, it’s a fact. As one of China’s Eight Great Cuisines, the inimitable culinary culture of this southwestern Chinese province is so spectacular that in 2011 Sichuan’s capital city, Chengdu, was recognized as UNESCO’s second ever City of Gastronomy. Responsible for bringing dishes like hot-pot, dan dan noodles, and mapo tofu to the global stage, Sichuan food is known for balancing big spice with pungent aromatics, as well as mind-blowing, mouth-numbing goodness courtesy of one special ingredient: the electrifying Sichuan peppercorn.What are Sichuan Peppercorns?For starters, they’re not actually peppers. Unlike the red chiles that are also ubiquitous to Sichuan cooking, these petite “peppercorns” are actually the berries of the prickly ash tree, which is a member of the citrus family. Harvested only once a year in the late summer, these tiny bumpy fruits are painstakingly picked from their thorny branches by hand and laid out to dry naturally in the heat of the sun.As they dry out, the berries open up into a distinctive floral shape that earned the spice it’s local nickname hua jiao, or “flower pepper.” After open dried husks release their small black seeds, which are bitter and inedible, the fragrant peppercorns are hand-processed to ensure no thorns, seeds, or twigs make it into the batch. It’s a labor-intensive process, but clearly a labor of love.How do they taste?There are two main kinds of Sichuan peppercorns: red peppercorns, which showcase an earthy depth, and green peppercorns, which are rarer and more floral. While both types taste great and boast beautiful citrus notes, the magic of these miniscule marvels lies as much in their function as in their flavor; instead of attacking the tongue with spiciness, Sichuan peppercorns induce a tingling sensation similar to drinking a super carbonated seltzer or eating a whole pack of pop rocks.“I would say that it's almost a mouthfeel or a dimensional feeling rather than a taste,” says Chengdu native Jing Gao, professional peppercorn enthusiast and founder of popular chili oil brand Fly by Jing. “It’s definitely got mystical qualities.” The piquant, numbing quality of Sichuan peppercorns comes from a chemical compound called hydroxy-alpha sanshool, which causes micro-vibrations across the tongue and lips that clock in at the same frequency of some power grids.Aside from being scientifically fascinating, the special effect of these peppercorns is also a key component of Sichuan cuisine’s greatest gift to the culinary world, a numbing and spicy flavor profile known as málà. “When the chile pepper was introduced to China a couple hundred years ago, it was said that the numbing quality of the Sichuan pepper would allow you to eat more chiles,” Gao says. “It’s kind of a symbiotic relationship, and málà became super well-known from Sichuan as a result.”How are they used?Because of its multitude of uses beyond just food, Sichuan peppercorns have been highly revered across China for more than two millennia. In addition to being incorporated into topical medicines and tinctures for its anti-inflammatory and analgesic effects, certain varieties, like the rare gongjiao tribute pepper, were once harvested exclusively as fertility gifts for ancient emperors and their concubines.These tantalizing little wonders also have a litany of uses if the only thing you really want in your belly is a delicious meal. As a star ingredient in many chili oils and five-spice powders, Sichuan peppercorns are as versatile as they are unique. Whether you’re craving perfectly cooked fish in spicy broth, garlicky marinated green beans, or a kick-ass cold noodle salad that’ll come together in minutes, there’s always a way to sneak in some Sichuan peppercorns for an elevated taste experience.“It’s present in almost every dish in Sichuan,” Gao says. “One stall in Chengdu has been making incredible pastries for a hundred years, and one of my favorite things there is this flaky butter cookie that’s sweet, but also savory and numbing at the same time.” Gao personally likes to take Sichuan peppercorn–infused oil and put it on popcorn or drizzle it on ice cream. “It’s just a really nice topping with citrusy overtones.”Where to buy themThe bad news: The quality of Sichuan peppercorns in the United States has been pretty poor for decades. In 1967, the peppercorns got caught in the crossfire of a USDA-issued blanket ban on Chinese citrus in order to prevent the spread of a bacterial disease known as citrus canker disease.Though the ban was lifted in 2005, exporters were required to heat-treat their peppercorns in order to kill bacteria before shipping them Stateside, which damages the potency of the product. The USDA has since reversed this restriction, but many companies still import cheap heat-treated peppercorns to sell in American stores.The good news: The internet exists and direct-to-consumer brands like Fly By Jing are here to combat the quality-control issues that have plagued many Asian food importers for decades. “I started this company because there wasn’t a go-to source for high-quality Chinese ingredients,” Gao says. “For the longest time, people weren’t willing to pay premium prices for Chinese products, so there was no incentive for producers to export anything of quality.”Fly By Jing Sichuan Peppercorns$23 at Bon Appétit MarketWhile studying under Sichuan master chef Yu Bo, Gao came to realize the importance of sourcing fresh food directly from growers. “Over several years, I built relationships with the farmers [in Sichuan] to access ingredients before they sell out,” she says. “We make sure to only carry what was freshly harvested that year.”How to store themBecause Sichuan peppercorns are dried, they won’t “go bad” per se, but that doesn’t mean they’ll last forever. “Without the proper storage and proper treatment, it loses its potency very quickly,” Gao says. “It has to be actually stored in a cool environment, so I store my Sichuan pepper in the fridge or the freezer.” A surefire way to know whether your peppercorns have gone stale is to give them a good sniff. If you’re not getting a waft of citrusy aroma, they’re probably duds. “The highest quality peppercorns smell so strong,” Gao says. “It’s said that if you hold it in the fist of your hand, you can smell it through the other side. It’s just so potent.”Explore Bon AppétitcookingtechniqueShoppingRead MorecookingBlack Vinegar Doesn’t Just Season a Dish–It Transforms ItBy Clarissa WeiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-29", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}