{"id": "0590c7b3e4ac6eafbea757d57a3e9c68", "url": "https://www.bonappetit.com/story/cheesy-baked-cauliflower-pasta", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "This Cheesy Baked Pasta Was Designed to Please Children—I Feed It To My Adult Friends | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cheesy Baked Pasta Was Designed For Children—I Feed It To My Adult FriendsWhen everyone I'm hosting has allergies and dietary restrictions, I make this. By Elyse InamineFebruary 28, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I am an equal opportunity dinner party host. No nut allergy, gluten intolerance, pork aversion, nor half-hearted vegetarianism can deter me from inviting you to dinner. And that is my 2020 campaign platform!I see it as a fun challenge, one worth poring over new cookbooks I’ve been wanting to page through or scrolling through BA recipe slideshows. But when I’m crunched for time and too overwhelmed to puzzle together random recipes into a crowd-pleasing, cohesive-enough dinner, I turn to this cheesy baked cauliflower pasta.Vegetarians go for seconds. Friends with nut and soy and seafood allergies rejoice. Even omnivores are satisfied, peeling off the costra-like crispy cheese bits baked into the sides of the dish. And gluten-free guests can indulge when I sub in corn- and rice-based pastas.(I’ll just get this out of the way: This isn’t good for vegans, but I don’t have any vegan friends...yet, hence the glaring amount of cheese in this dish. I’m not sure what that says about me, but moving on.)Chris Morocco developed this dish mainly for his kids, but I can confirm: Adults love it. And adults (me) love making it, too, because it couldn’t be simpler if you’re scrambling to put together an insert-thing-here-free dinner on a recent weeknight (guilty!).After stress-shopping, stress-prepping, stress-shredding cheese, and stress-chopping the cauliflower, all you need to do is turn on the oven, cook the pasta, and then breathe. Crush the canned tomatoes (Chris calls for cherry, but plum is fine in my experience) and mix in the cheeses (melty provolone, creamy mozzarella, sharp cheddar, the requisite parm), cream, cauliflower florets, and a scoopful of salty pasta water. Dump it all into a buttered baking dish, cover with foil, stick in the oven, and pour yourself a glass of wine.As it bakes for about 25 minutes, you have time to tend to your other hosting duties, like forcing your husband to set the table or double-checking the allergies (right, no walnuts in this salad). Thirty minutes out from dinnertime, rip off the foil and crank up the heat, so you get that cheese gurgling, charred-in-the-right-spots finish.Then, once everyone arrives and settles into their seats, it’s your time to shine as the most gracious, ingenious host of all time, with a casserole of hot, cheesy pasta that everyone can eat and actually enjoy.Get the recipe:Cheesy Baked Pasta with CauliflowerThis baked pasta is super-kid-friendly. (They won't be able to detect the cauliflower!)View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-28", "author": ["Condé Nast", "Elyse Inamine"]}