{"id": "059d6ead896d358be48f962b1fdcd5fb", "url": "https://www.bonappetit.com/story/october-2018-scary-food-horoscopes", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Spookiest Food Horoscopes Yet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Spookiest Food Horoscopes YetYour Halloween horror-scope is here! What scary food is hiding under your bed this month?By Catherine UrbanOctober 1, 2018FacebookTwitterEmailIllustrations by Jay Daniel WrightFacebookTwitterEmailWe’ve made it to the spookiest month of the year, in more ways than one. Whether you’re scared of accidentally eating candy corn you mistook for actual corn (it happens—wait, does it?) or a taco full of cilantro, there’s something edible and terrifying for everyone. We really made a list. So what ghoulish food is in store for your sign in this October horoscope? Find out below.Illustration by Jay Daniel WrightAriesYou’re a speed-walker who’s always on a mission (even if that mission is grocery shopping as fast as humanly possible). But this month, you might have better reason to do the fast-walk: ghosts from your past sneak up to say hello. Maybe not all of them are scary (a sweetheart from college suddenly starts following all your IG stories), but some of them might rattle you—like that parking ticket you forgot to pay last spring. These ghosts are here to help you tie up loose ends, make peace with the past, and free up your energy. You might be spending a lot of time on-the-go this month, so watch out for the evil airport lobster roll that tempts even the smartest of travelers. Stay away!!!! Like the ghosts from your past, who knows where that thing has been lurking before it made its way to terminal 4.Illustration by Jay Daniel WrightTaurusThis month, you crave deeper connection with those you care about most. Maybe you’re feeling more needy than usual because everyone else seems to be so busy these days. Plan meaningful one-on-one dates to check in with your crew.  But beware the spOooOky taco filled with cilantro…and noOoOthing else prepared special for you by a sleEEeepy zombie kitchen staff. As one of the most indulgent signs of the zodiac, you have high taco standards (more like a flash-fried shell overflowing with shredded pork). Nobody has time for bad tacos, but especially not you.Illustration by Jay Daniel WrightGeminiRight now, you’re craving an extra dose of entertainment—you might be dressing up for a Halloween-themed bar crawl or finally  trying your hand at that escape room. Halloween riles your mischievous spirit. You tend to get real into it. You’ll do a dare, TP a house, scare children with robotic werewolves on your front porch...but some pranks can go too far. Beware the bitter spoonful of cocoa powder here to damage your life for the sake of a funny viral video. It could kill you! It tastes drier than a bag of bones! Noooo!Illustration by Jay Daniel WrightCancerYou’re putting in a lot of effort these days and need some reassurance that you’re on the right track (we acknowledge you, sweet Cancer). Instead of waiting for others to tell you what you’d like to hear, challenge yourself to come out of your shell and speak up this month. But beware! A strong-willed request for lasagna could backfire this month with instead, a platter of vegan lasagna with unmelted nut cheese. Dry and unsatisfying—the stuff of nightmares INDEED.Illustration by Jay Daniel WrightLeoThis month you might find yourself overly ambitious (oh, it’s you again). Just be mindful you don’t neglect your own well-being in the process (sleep is still important!). Since you’re so focused on your new band/book club/kombucha-brewing/fill-in-the-blank project-here this month, you could become temporarily distracted from other departments in life.  Oh NO. Did you accidentally order a steak, well-done and served with plasticware? The most hellish deviant of all kitchen nightmares. You always know what to do Leo, so trust your gut, flip the table and RUN.Illustration by Jay Daniel WrightVirgoThis month you’ll be bringing more balance into your life as you restructure how you distribute your time and energy. There will be opportunities for breakthroughs during the first half of the month, spurring open-hearted creativity, romance, and even a little risk-taking. Don’t be surprised if your general outlook on life even looks a little brighter by month’s end. But beware of unexpected  breadcrumbs from a strange man’s mustache. How did they happen to be sprinkled onto your plate of pasta? We’re not sure, but we’re terrified. You can be very inventive on the spot, Virgo, so either blow them off and hope for the best—or run.Illustration by Jay Daniel WrightLibraThis month, change is imminent with new opportunities rolling in—new job, moving? And since no one’s expecting you to juggle it all (it’s okay to say “no,” Libra), decide what’s worth continuing while opening yourself up for the new. Stay true to yourself while making these big-life decisions. Big life changes can be scary, but not as scary as a martini glass filled with tap water and an olive. The horror! The crime! Where did the GIN go? Is there a shortage? Keep one eye open this month, Libra, and don’t let anything slip below your high standards.Illustration by Jay Daniel WrightScorpioThis month, you’re feeling more energized than you have about anything in a long time. Are you riled up about a cause? Genuinely excited about life? Or maybe it’s because love is in the cards for you, Scorpio! The cool air and the revival of your black wardrobe always seems to enhance your natural mysterious magnetism. You know what else has a mysterious magnetism? 175 year-old royal wedding cake. But resist the allure of this piece of history you won at auction or found in the back of your boss’s mini-fridge! It’s sure to bring bad luck, specifically to your stomach.Illustration by Jay Daniel WrightSagittariusFor the past year, you’ve been in a bit of an incubation mode, but don’t worry it’s not gonna last much longer. Allow yourself plenty of space to wander and reflect to help you strategize the moves you’ll soon be making at your job, in your relationship, or within your home. So for now, finish reading those books, get lost binging an HBO series or even better, get lost in the woods… but it’s not the Blair Witch you need to worry about… it’s a diabolical hamburger with no toppings chasing you through the woods! Imposter, begone! However this came to be is an evil doing. If a naked burger shows up on a plate near you soon, don’t say we didn’t warn you. And then RUN.Illustration by Jay Daniel WrightCapricornThis month, you might be considering  switching up some of your after-work activities. You’re a go-getter who believes in challenging yourself, so it’s totally understandable that you, well, get bored after a while. By the end of the month, you’ll cheerfully settle into your new groove, whether you decided to take ceramics classes or learn to play the guitar on YouTube.  There’s so much to explore within yourself this month, Capricorn, but it might lead you to also explore the pantry: is that cinnamon raisin bread or ...mold? You may be hungry, and you may be fearless, but this is one malevolent villain you need not dare to face.Illustration by Jay Daniel WrightAquariusYou’ve got an edge this month that’s giving you new life. Helpful ideas arrive from random people you meet, and since no one is telling you what to do, you’re more open to new possibilities than usual (you can take that trip and write it off as a business expense). You might be considering a move, a major update to the home, or some exciting changes within your career role. You will have much more clarity by the end of the month. Until then, bEwArE!! You might encounter a cup of who-knows-how-old milk in your fridge—or is that bubble tea? These curdles might cause a blood-curdling scream if you get too close. Don’t risk it Aquarius.Illustration by Jay Daniel WrightPiscesThe falling leaves and eerie gusts of wind stir your curiosity for all things metaphysical. Yeah, you’re thinking more deeply than usual this month, and you should definitely seek insight from your mentors, your elders, or hey, even your astrologer! Mid-month, you may be challenged to defend your beliefs, but hold strong and you’ll see the results, because next month, your confidence is boosted to a whole new level. But until then, be weary of when the doorbell rings…BEWARE the platter of raw chicken sushi here to taint your life with salmonella! Terrors and tremors of feverish night sweats overcome your imagination! Refuse this horrid visitor and kick it to the squirrels.Catherine Urban is an astrologer, writer currently avoiding mustache crumbs (shudder). Find out more about Catherine’s astrological obsession here, or follow @AstroCatherine.Explore Bon AppétitHalloweenFood HoroscopesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Catherine Urban"]}