{"id": "059d2e83359296beffff47d18111a44e", "url": "https://www.bonappetit.com/story/how-i-get-my-smoothies-so-good", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "How I Get My Smoothies So Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Get My Smoothies So GoodA dispatch from Christina Chaey's summer of beverages.By Christina ChaeyJuly 25, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish friends,A typical morning for me starts with no fewer than four beverages: a big bottle of water after a swampy early-morning bike ride, a mug of coffee (currently working my way through a bag of Counter Culture’s Gradient), a tall glass of roasted-barley iced tea, and the smoothie of the day.Nine months of the year, I don’t so much as think about smoothies; I’d almost always rather cook something warm and cozy with a spectrum of textures and flavors (a.k.a. the opposite of a smoothie.) But the heavy, wet heat currently falling over New York is causing my brain to shut down, not to mention making it impossible to contemplate chewing anything. And so I’ve gone on autopilot in the mornings, throwing whatever I have around (any frozen fruit, spinach, grated ginger, parsley stems, flax or hemp seeds) into the blender without thinking too hard about the end result, because it’s all going to the same place anyway and nothing matters anymore (shit, did I say that last part out loud?)It doesn't stop at almonds: Cashews, hazelnuts, and pistachios also make great mylk.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesBut the real reason I'm writing this newsletter isn't to talk about smoothie recipes—it's to sell you on making your own nut milk for said smoothies. (I know, stay with me.) Since I’m not trying to lug home six pounds’ worth of almond/soy/oat milk every week, I’ve gotten into the routine of making alt-milk using the most incredible raw Spanish almonds from Nuts.com (disclaimer: not sponsored, but I AM at the point in my life where I am trying to get a Nuts.com hat.) Unpasteurized almonds—which haven’t been treated with heat or chemicals and therefore maintain all their natural enzymes, vitamins, and oils—can be tricky to find and, yes, are expensive. But they have little in common with their chalky, dusty, pasteurized counterparts: A good almond smells both floral and tannic, like fine black-tea leaves, and tastes rich and sweet under its smooth, dry skin.Every couple of days before I go to bed, I’ll soak a scant 1 cup of raw almonds in a jar of water in the fridge overnight. In the morning, I’ll strain them and add them to the pitcher of a high-powered blender along with 4 cups of water, a good pinch of kosher salt, a tiny splash of vanilla extract, and a pitted Medjool date to bring out the natural sweetness of the nuts. I blend all of that on high for a full minute (watch out, it gets crazy-foamy!) and then strain it through a nut milk bag, because I am fully dedicated to this life now. And if you feel moved to add a dusting of cinnamon or cardamom, or a plop of maple syrup, it’s your world. The resulting milk (or “mylk,” as I fondly refer to it) is refreshing, ultra-creamy, and just sweet enough.Because I’ve spent more time cooking and thinking about what to cook in the last few months than I ever have before, starting every day by making a variation on the same one drink has become something of a mental respite. The result is never-changing, which in normal times would send me running (boring!), but right now is affording me a welcome sense of calm. Okay I’ll stop there before I start sounding too melodramatic—it’s just breakfast, after all.Stay hydrated,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?Read MoreLifestyleA Summery Grain Bowl That Doesn’t Bore MeBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-25", "author": ["Condé Nast", "Christina Chaey"]}