{"id": "05ad9dcbd3d8e7594faa8c49758c7aa0", "url": "https://www.bonappetit.com/story/freda-deknight-cookbook-a-date-with-a-dish", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "How Freda DeKnight’s Cookbook, ‘A Date with a Dish’ Inspired Generations of Black Cooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Freda DeKnight’s Cookbook, ‘A Date with a Dish’ Inspired Generations of Black CooksDeKnight was first food editor of Ebony magazine, and her recipes changed the course of black culinary history.By Hannah GiorgisJune 19, 2018FacebookTwitterEmailFacebookTwitterEmailThere’s a cookbook, long out of print, probably not stocked at your local Barnes & Noble or beloved indie bookseller. Even as the foods that fill its pages remain inarguably delicious, the book has fallen out of most records. But A Date with a Dish: A Cook Book of American Negro Recipes, the seminal 1948 recipe collection written by Ebony magazine food editor Freda DeKnight, inspired a generation of cooks. It was both a cookbook and cultural guide: the book shared instructions and insights in equal measure. A Date with a Dish changed the course of black culinary history and shaped everything from family gatherings to social movements in the process. Freda DeKnight may not be a household name, but her recipes fed the black imagination—and her story should live on into our future.DeKnight, who was born in Kansas in 1909, lived with Paul and Mamie Scott in Mitchell, SD, while her mother was working as a traveling nurse (DeKnight’s father died when she was two years old). The Scotts were “famous at that time as being the finest caterers in the middle west and among the finest in the country,” DeKnight writes. They had a farm, smoked their own meats, made some of the first potato chips for retail in the country, she proudly notes. The Scotts were “the inspiration for my early cooking aspirations,” and with their urging, she went on to study home economics at Dakota Wesleyan College in Mitchell, SD.After graduating, she moved to New York and taught sewing at a high school, as well as classes at vocational schools. She married the pianist René DeKnight of the Delta Rhythm Boys. But how she landed at Ebony was a fluke. William Barrow retells the story in DeKnight’s obituary in Negro Digest:“While visiting Chicago, en route to Los Angeles, she was invited to dinner at the home of a wealthy couple who were longtime friends of hers. Shortly before the dinner hour, the hosts learned that their caterer had broken a leg in an accident. Freda soothed her frantic hosts, assured them that she would take care of everything in short order, and promptly proceeded to do so. Sparing no expense, she bought the ingredients and prepared a meal fit for royalty. As fate would have it, one of the dinner guests was young publisher John H. Johnson. So impressed was he with the food that he asked Ms. DeKnight to give him the menu....When the menu arrived, it was done in an exciting narrative style that made it seem like fun to cook.“He offered her a job, and she began her nearly 20-year career at Ebony magazine in 1946, a year after the magazine launched. DeKnight’s food column was a treasure trove of recipes, cooking tips, and cultural reflections from chefs across the vast expanse of the African diaspora. DeKnight drew her recipes and insights from Mississippi to Trinidad, California to Haiti. A Date with a Dish, DeKnight’s 1948 cookbook (reprinted as The Ebony Cookbook in 1962)—dedicated to her mother as well as Mamie Scott—consolidated DeKnight’s Ebony recipes into one collection that captured the palate of black America. It contains recipes for everything from chicken okra gumbo to oyster turnovers to multiple preparations of ribs (including one titled “Spareribs With A Future”). DeKnight demystified foods both familiar (pot roast) and more foreign (mulligatawny soup).DeKnight’s Creole-baked snapper: “The beauty of baked fish lies in serving it whole,” writes DeKnight, “Be sure, however, that it is well scaled and clean, and quite important, of course, fresh!”\nPhotography by Oriana Koren. Food Styling by Jillian Knox and Malina Syvoravong. Prop styling by Jillian Knox.In the “Guide for the Housewife,” DeKnight writes of spices with an enthusiasm and wit that predates oft-circulated black Twitter jokes:“Negroes and Latin races are famous for spicy foods. In certain parts of the country, where many of the herbs are grown in one’s own garden or back yard, it is so easy to use them. Don’t be afraid to season foods; that’s what spices are for. Some Negroes have never had the pleasure of reading spice hints, but they most certainly have the knack for adding the right spice at the right time to the right food.”The passage is illustrative of DeKnight’s trademark tone throughout the text: decidedly auntie-like, with equal parts admonition and affirmation. She acknowledges the privilege of the work she does—after all, cultural archiving and culinary research are both pursuits for which few black people have received compensation—while still speaking with reverence for black home cooks who have long created magic without formal training. The effect is instructive without being insulting, a literary experience that was (and arguably still is) all too rare for black readers.DeKnight’s blackberry cobbler.\nPhotograph by Oriana Koren. Food Styling by Jillian Knox and Malina Syvoravong. Prop styling by Jillian Knox.A Date with a Dish took its subject matter—and black readers—seriously. In doing so, the book mirrors the food it documents: It warms, comforts, and sometimes even challenges. But perhaps most importantly, it brings people together. “Deep dish cobblers are country favorites,” writes DeKnight in the introduction to the recipe pictured above. “When all else in desserts fail, the unforgettable cobbler takes a bow. When sugar was scarce and pennies low, maple syrup and even molasses made delightful eating, added to apples which were topped with a crunchy, flaky crust. One of the nicest crusts I’ve had the pleasure of eating was made with black walnuts.”In her charming and appreciative tone, DeKnight shared recipes that had once been passed down largely through oil-stained recipe cards and cursive-flecked scraps of paper. Throughout the book, and in a special section called the Collectors’ Corner, she gives credit and shares recipes from chefs and home cooks she encountered across the country, sharing their stories and giving them a voice.Introducing black walnut macaroons from Aunt Sue, who made prize-winning cookies “for every church social and country fair,” DeKnight notes: “Although the newspapers and books didn’t write her story, she was a big person in her little way...I hang my head in shame when I think of all the modern things I have to enjoy when women like Aunt Sue spent a day molding, shaping, and baking cookies in a coal stove, and yet could also do the rest of their work as well, and still end up happy and full of life.”To cook for someone is to make your love embodied. For DeKnight, that love extended to black readers who had never seen their families’ recipes in print—as well as black people for whom kin, fictive or otherwise, is not a source of sustenance. For those without access to maternal figures willing to share these secrets, the book can be something of an ancestral lifeline. For those new to a country that cannot digest their blackness, A Date with a Dish offers a taste of one of the most enduring forms of black resistance. It reminds the reader that black people in America and beyond have always made feasts from scraps, transformed the discarded into the divine. Ham hocks, neck bones, gizzards, and other animal parts unwanted by white families found their way into black kitchens by necessity; unsung black cooks turned these disparate bits into craveable dishes.Today, DeKnight continues to inspire journeys in the black American cultural landscape. For photographer Oriana Koren, the fact that the recipes in the book were neither illustrated nor photographed inspired her to bring them to life in this photo project, a few of which are featured above. For Chicago-based culinary historian Donna Battle Pierce, DeKnight’s story deserved a book, a biography she’s currently working on.  In a column for NPR’s The Salt last year, Pierce writes:“I grew up in the 1950s and '60s in a family of black physicians and educators. DeKnight knew both of my grandmothers socially, and both my Granny and Gran used to say that, compared to other black cookbooks, which they described as a folksy approach for white households employing black cooks, A Date With a Dish was the first to ‘represent the race with dignity...deliciously.’”DeKnight died of cancer in 1963 when she was 54, but her book holds significance beyond the communities to whom she dedicated her years of scholarship. To fête one another with unending joy, to open our hearts and homes, is to celebrate DeKnight’s generous work. A Date with a Dish changed black culinary history not by “elevating” African American cooking, but by honoring the gifts of those who had first forged those foodways—or, as DeKnight wrote in her preface:“Years ago...some of our greatest culinary artists were unable to read or write. But their ingenuity, mother wit and good common sense made them masters in their profession without the aid of measuring spoons and cups, modern equipment or science. Needless to say, the old methods they used were tried and true, and no matter how advanced the art of cooking is today, therein lies the basic success of cookery of the ‘old school’.”Hannah Giorgis is a culture writer at The Atlantic. Oriana Koren is a photographer in Los Angeles. Jillian Knox is a food stylist in San Francisco.Photography by Oriana Koren. Food Styling by Jillian Knox and Malina Syvoravong. Prop styling by Jillian Knox.To celebrate Juneteenth—the holiday that celebrates the emancipation of American slaves—photographer Oriana Koren designed a dinner party inspired by the work of Edna Lewis and Freda DeKnight. See the full menu here.Explore Bon AppétitCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Hannah Giorgis"]}