{"id": "05b00dfa7048a6561c7bce38b539aa3b", "url": "https://www.bonappetit.com/story/konbi-chocolate-croissant", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "I Instagram-Stalked This Croissant, So I Found Out How It’s Made | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeAll hail Konbi.By Rachel KartenFebruary 25, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.Everyone seems to be Instagramming the katsu sandos and caneles at Konbi, a tiny Japanese sandwich shop in Los Angeles. But have you seen the croissant? Ever since Konbi opened last fall, I have double-tapped and saved almost every photo of the shatteringly-flaky, so-damn-chocolatey confection. I just had to know how they got it that way. Here chefs Akira Akuto and Nick Montgomery break down the pastry I can’t stop thinking about.The ButterChef-owners Akira Akuto and Nick Montgomery tried “a crazy amount” of butter before finding the One. The winner was Anchor’s butter sheets (made specifically for layered pastries like these) from New Zealand. Buying the butter already formed into long, thin sheets makes for a more consistent texture.The dough gets a sprinkling of King Arthur's Sir Galahad flour.\nPhoto by Alex LauThe FlourThe Konbi team ate the croissant at Tokyo’s Path restaurant every day on a research trip. So they tapped Rihito Maruhashi, Path’s pastry chef, to help develop their own recipe. His steepest learning curve? American flour. They chose King Arthur’s Sir Galahad, a low-protein bread flour similar to what Maruhashi used in Japan.The small but mighty lamination machine.\nPhoto by Alex LauThe LaminationThose layers take work. In a process known as lamination, first the dough gets folded over butter, then it’s flattened into slabs by a machine called a sheeter. Konbi relies on a rare Yoshida model with a small footprint since the café is about 520 square feet. They make just 36 croissants a day, building up the hype.Two chocolate batons are wrapped into every croissant.\nPhoto by Alex LauThe ChocolateYes, the croissant passes the critical “Is there chocolate in every bite?” test. To ensure this, the team uses flatter-and-wider-than-usual chocolate batons from France’s Cacao Barry and expands the dough’s gluten structure so it’s strong enough to keep the chocolate from sinking to the bottom of the pastry.Rolled up and ready to go in the oven.\nPhoto by Alex LauThe FlareWith most chocolate croissants, the lip of dough is tucked underneath itself before baking to help keep the pastry contained. Not at Konbi. By pushing the laminated folds apart and leaving the lip exposed and untucked, they’re able to create these signature cascading stairway-like flaky layers.Explore Bon AppétitPastryRestaurantsDish DecodedRead MorerestaurantsThe Long and Winding Road to Richmond's Most Ambitious New Restaurant—in One DishBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-25", "author": ["Condé Nast", "Rachel Karten"]}