{"id": "05c7a238b44501d7536aded17de50b29", "url": "https://www.bonappetit.com/recipe/eggs-remoulade", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Eggs Rémoulade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueEggs RémouladeBy Rebekah PepplerMarch 15, 20225.0(1)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joann Pai, food and prop sryling by Rebekah Peppler.EmailPinterestPrintEmailPinterestPrintTo turn hard-boiled eggs into an impressive snack for company, dress them up with a spoonful of rémoulade, the classic sauce of mayonnaise, herbs, capers, cornichons, and “just enough” anchovies. If you’re too short on time to make a fancy arrangement, just set the unshelled hard-boiled eggs in a bowl, spoon rémoulade in another, and let your guests have at it.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Saucepan$39 At AmazonCitrus Juicer$7 At AmazonSlotted Spoon$13 $10 At AmazonSmall Bowl$13 At AmazonIngredients6 Servings12large eggs1oil-packed anchovy fillet, finely chopped¼cup mayonnaise1Tbsp. finely chopped cornichons1Tbsp. fresh lime juice1tsp. Dijon mustard½tsp. finely chopped drained capers⅓cup finely chopped tender herbs (such as parsley, chives, tarragon, and/or dill), plus more for servingKosher salt, freshly ground pepperHot sauce and/or flaky sea salt (for serving; optional)PreparationStep 1Pour water into a medium saucepan to come 1\" up the sides and bring to a boil. Using a slotted spoon, gently lower eggs into water. Cover pan, reduce heat to medium-low, and cook 10 minutes. Transfer eggs to a bowl of ice water and let cool, about 5 minutes.Step 2Peel eggs and slice in half lengthwise. Arrange cut side up on a platter or large plate.Step 3Stir anchovy, mayonnaise, cornichons, lime juice, mustard, capers, and ⅓ cup herbs in a small bowl until well combined. Season rémoulade with salt and pepper.Step 4Spoon ½ Tbsp. rémoulade over each egg half. Top with more herbs, followed by hot sauce and sea salt (if using).Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Eggs Rémoulade?Leave a ReviewTell us what you thinkExplore Bon AppétitSnackStarterEasyQuickGluten-FreeNut-FreeEggFrenchEuropeanSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}