{"id": "05c815095b3a7a76d1774635f535e6e4", "url": "https://www.bonappetit.com/story/tomato-toast-sesame-seed-sprinkle", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "THE Tomato Toast Recipe of Summer 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTHE Tomato Toast Recipe of Summer 2018Topped with an elaborate, necessary sprinkle of sesame seeds, chives, flaky salt, cracked pepper, Aleppo-style pepper, olive oil, and lemon zest.By Amanda ShapiroJuly 30, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI’ve known some toasts in my time. I’m well acquainted with avo, though I prefer a smear of ricotta and orange jam for breakfast these days. I make a regular pilgrimage to Hart’s for their clam toast, and don’t get me started on this caramelized leek number from Botanica—I’ve made it too often to count. But tomato toast? Never met the guy.Until Bon Appétit’s August Simple Issue came out, and I came face to face with this gorgeous photo of hyper-red and juicy tomatoes resting on a cloud-like swipe of mayo all on top of crisp, olive-oil-soaked bread. Oh, hi, hello there, I don’t believe we’ve been introduced.The full photo has a nice can of cold Modelo in it. Equally enticing.\nPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonThe recipe, by senior food editor Andy Baraghani, is hardly a recipe at all. (We called it the “Simple Issue” for a reason.) You toast some bread, stir mayo with a little grated garlic and lemon juice, and thinly slice a few tomatoes. Then come the garnishes, and there are  A LOT. Here at BA, we call this kind of garnish frenzy “peak Andy.” You’ve got—wait for it—sesame seeds, minced chives, flaky salt, cracked pepper, Aleppo-style pepper, olive oil, and lemon zest. Roll your eyes all you want, but it makes for one good-looking toast (actually, four toasts). I forgot the lemon zest, and it was still the most-liked photo I’ve ever put on the internet. [Note from Andy: “She should really have gone for the lemon zest.”]Exhibit A:Instagram contentThis content can also be viewed on the site it originates from.Oh, and they’re incredible. I served these guys for a family brunch alongside a platter of scrambled eggs with Swiss chard. The tomatoes’ sweet acidity played off the garlicky mayo, which softened right into the still-warm bread. The sesame seeds lent subtle crunch; the Aleppo pepper gave the slightest suggestion of heat. If you’re not into the idea of mayo and tomato juice dripping down your wrists, you’ll want to grab a fork and knife for this one. But then I have to ask, what kind of summer eater are you?Get the recipe before summer’s over:Tomato Toast with Chives and Sesame SeedsSprinkle the chives, sesame seeds, and flaky salt with abandon.View RecipeHonestly, this couscous is the real “peak Andy”:Explore Bon AppétitTomatoToastSummerWeeknightRead MorecookingIt’s Called TOTES Toast: Tuna, Olives, Tomato, Eggs, ShallotBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Amanda Shapiro"]}