{"id": "05cae8fb3e664f5f96946a015127fe23", "url": "https://www.bonappetit.com/story/is-sprouted-garlic-safe-to-eat", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Is Sprouted Garlic Safe to Eat? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIs Sprouted Garlic Safe to Eat?You're rooting around in the pantry and all you can find is sprouted garlic—what's a cook to do?By Alyse WhitneyNovember 27, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou’re minding your own business, trying to chop a bunch of garlic for a big pot of Italian wedding soup, when you spot it: sprouted garlic. There are green shoots peeking out of the cloves on your cutting board, like little aliens hiding in their middles. Should you throw the cloves away? The whole bulb? Don’t worry—it’s not menacing or dangerous. It’s just the garlic sprouting more garlic out of itself, like Deadpool regenerating every time he loses a limb. But, you know, less gruesome. And slower. (And also...edible.)You’ll usually catch garlic before those long, skinny green stalks emerge from the top of each clove; a lot of times you won't even notice that it has sprouted until you cut into it. And even though those sprouts resemble chives, they doesn’t have the herb's mild flavor—the sprout itself is actually quite bitter. It's sharp in flavor, without any of the natural sweetness that garlic should have. But even though the flavor is a little less than ideal, sprouted garlic is fine to eat. TBH, if you're just incorporating one or two cooked cloves into a larger dish, you probably won't notice a difference at all. We wouldn't recommend using sprouted garlic in a dish where garlic is the star of the show—think garlic bread, chicken braised with whole heads of the stuff, or garlic fried rice—but otherwise you're probably fine. If you're really concerned, you can slice the offending cloves in half lengthwise and simply pull the green sprout out, but honestly we don't bother unless we're using the sprouted cloves raw, like in a salad dressing, which is where you're most likely to taste the difference.You want only the best garlic when using it raw, so remove the sprout if you're grating for Caesar dressing.\nPhoto by Heidi's BridgeThe sprouts are a sign that garlic is starting to go off, mostly because it is getting older, or because it has been exposed to too much heat, light, or moisture—garlic wants to be stored in a cool, dry, and dark place for maximum longevity. A lot of times, you have no way of knowing how long garlic has been sitting in the bin at the grocery store, so it may have already started sprouting before you even got home. Stored properly, garlic can last up to six months as a whole bulb, and around three weeks as unpeeled cloves if stored in a cool, dark place. So make sure to keep garlic in your pantry, and if you end up with some inevitably-sprouted cloves, only bother cutting out those green bits if you’re planning on using them raw (like for Caesar salad dressing). Otherwise, everything is going to be juuuuuuust fine.Now, how about a nice, garlicky roast chicken?No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitBasicallyGarlicRead MorecookingHas Your Garlic Gone Bad?By Alex DelanycookingHow to Mince Garlic Without Actually Mincing GarlicBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Alyse Whitney"]}