{"id": "05ed04aa446ec7c278c8539387ffac55", "url": "https://www.bonappetit.com/story/never-fail-masala-chai-tea-recipe", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Chai Recipe is Easier Than Leaving Your House to Buy Chai | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chai Recipe is Easier Than Leaving Your House to Buy ChaiIt’s so gingery and perfect I could drink a gallon of it in one sitting.By Emily SchultzFebruary 9, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the chai recipe that associate social media manager Emily Schultz just couldn't live without.I’ve always wanted to be one of those calm, cozy people who have tons of candles around their apartment and are always drinking loose leaf tea, which is basically how I stumbled upon this chai recipe. Buying cup after cup of the stuff at my local coffee shop was starting to get pricey, so I wanted to be more economical by making it at home. I Googled a ton of different recipes, but a lot of the ones that were coming up had way more spices than could even fit in my spice rack. That is, until I stumbled upon this one. (FYI, I started making this magical recipe before I started working Bon Appétit. Some say it’s fate, but I say it’s the power of The Chai).It's beyond easy. You start by peeling a piece of ginger a little bigger than your thumb (this way, obviously) and grating it up like there’s no tomorrow. Next, lightly crush a cinnamon stick and throw it in 3 ½ cups of water with the ginger. Wait for all of that to come to a boil and start doing a happy dance because your kitchen is already starting to smell like some sort of fancy candle store. Once we’ve entered Boil Town, turn it down to a simmer and let it reduce for 20 minutes (approximately one episode of It’s Always Sunny in Philadelphia).Turn the heat off, toss in your crushed cardamom pods and your black tea and let that steep for about 2 minutes. Carla uses this black tea and these cardamom pods, and I do whatever Carla says. It's wise for you to do the same.Making a drink with spices feels fancy.\nOnce everything is nice and steeped, turn your stove back on to medium-high, and add your milk and maple syrup. Important note! The amount of maple syrup this recipe calls for is totally flexible, depending if you like your chai sweeter or more ginger-forward. Keep it on the flame for the next five minutes, and stir occasionally so it doesn’t foam up and spill all over your stove like a high school science experiment. (Definitely have never done that.)Healthyish side bar: If you want to use almond milk rather than cow’s milk, omit cooking the milk, and let it hang in the pot until you see steam rising.Pour this fragant sea of goodness through a fine mesh sieve into whatever kind of vessel you like to drink your liquids from, and you’re good to go! If I restrain myself and ~ don’t ~ drink the whole thing in one day, I’ll usually stir some espresso into it the next morning for an extra ka-pow of caffeine. As Carla says, “Bingo, bango, Bob’s your uncle”.Get the recipe:BA's Best Masala ChaiView RecipeExplore Bon AppétitBasicallyNever FailChaiTeaGingerHot DrinkRead MoreBA's Best Masala ChaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Emily Schultz"]}