{"id": "05f24314cdb9fb417156c5921868167a", "url": "https://www.bonappetit.com/story/substitute-for-parmesan-cheese", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "3 Substitutes for Parmesan Cheese That Won't Break the Bank | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 (Cheaper!) Substitutes for Parmesan CheeseCash doesn't grow on trees. Neither does Parmesan. These are the cheeses that solve that problem.By Alex DelanyJune 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn a perfect world, we’d have a limitless Parm budget. There would simply be no reason to find any substitute for Parmesan cheese, the undisputed heavyweight champion of hard, salty, tangy dairy products. We would drop thousands of dollars on massive wheels of the stuff. We’d stack them up and make houses out of them. Replace the tires on our cars with Parmesan wheels and use them as ottomans. And yes, cook with them too. But we can’t. Because the famed Italian cow’s milk cheese that we’ve been in love with since our first bite of fettuccine alfredo is expensive. And our Parmesan budget is much smaller than we wish it was. And as a result, sometimes we turn to other cheaper, still totally delicious options to get our fix.Parmesan (or Parmigiano Reggiano) is expensive for two reasons: 1. True Parmesan can only be made in a particular region of Italy, and 2. Parmesan is usually aged between 18 and 36 months. This means that there are only a small number of cheese producers making true Parmesan, and that cheese has to sit around for a while before it’s fully matured. Tasty cheese needs time, and time is money. So when we don't feel like shelling out for the real thing, we turn to cheeses with similar textures and flavor profiles that are a little easier on the checking account. They still deliver that dried, nutty, easily grate-able goodness that we love in Parmesan, but with a few small differences. Here are our three favorite substitutes for Parmesan cheese:Michael Graydon & Nikole HerriottPiaveParmesan has a little brother, and his name is Piave. This Italian cow’s milk cheese is the most similar to Parmesan out there, but it’s a little less mature. No, not like it tells dirty jokes at the dinner table. More like it’s only aged 12 months instead of the 18-36 months that most Parmesan is aged for. Since Piave is younger, it’s umami-rich flavors and toasty nuttiness are less developed. It’s a tad sweeter than Parmesan, and noticeably creamier. But it’s still hard enough to grate into sauces and on top of roasted vegetables, toasts, and pastas.Pecorino RomanoThis is the cheese that most people will reach for when Parmesan isn’t in the cards. Pecorino’s base flavor and texture are similar to Parmesan’s, but it has a couple key differences. Pecorino is made from sheep’s milk, which contains more fat than cow’s milk. But most importantly, Pecorino is a tad sharper than Parmesan and a hell of a lot saltier. Its saltiness can overwhelm pasta dishes with delicate sauces, so if you’re using Pecorino in a recipe that calls for Parmesan, make sure to dial back on the kosher salt.Grana PadanoHere’s another Italian cow’s milk cheese with a protected name. Like Parmesan, Grana Padano has to be made in a certain region of Italy, but Grana Padano’s region is much larger, which ultimately makes the cheese more affordable, since more producers can make the cheese. While Pecorino turns up the salt and flavor, Grana Padano is much milder. The savory, nutty flavors are similar to Parmesan, but Grana Padano is generally less crumbly, so expect a softer cheese that works better when mixed into sauces than it does when grated on top of pastas.This is all to say that if it's the distinctive flavor and texture of true Parmigiano Reggiano you're after, you're going to have to shell out for the real thing. But if it's a less-specific hit of rich, salty cheesiness that you need to punch up that platter of salad or bowl of pasta, you've got options. Great options, in fact.You can use all of these cheeses in carbonara. So go do that.Simple CarbonaraThe no-food-in-the-house dinner of our dreams.View RecipeExplore Bon AppétitBasicallyCheeseParmesanPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Alex Delany"]}