{"id": "05fbe0811625a2b427d88b612d7c5d51", "url": "https://www.bonappetit.com/story/corto-jersey-city", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "I Haven’t Had a Just-Okay Dish at This Little Italian Spot in New Jersey | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Haven’t Had a Just-Okay Dish at This Little Italian Spot in New JerseyThe young folks at Corto know what they’re doing!By Brad LeoneOctober 25, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I got a great little BYOB spot: Corto in Jersey City. Up in The Heights, right across the mighty Hudson River, it brings something to the neighborhood that’s been missing for far too long: an approachable restaurant with fantastic Italian food. Oh, and a backyard space too!Everything on the Italian-inspired menu is delicious. Chef Matt Moschella puts an amazing meat-and-cheese plate that he changes every day. The one above features bresaola, mortadella, finocchiona from old-school NYC deli Salumeria Biellese; NJ-made crema de bleu and pepato from Valley Shepherd Creamery; fermented broccoli rabe from Italy; cherries from the garden at Corto; and crackled carta di musica. Now that’s a cheese plate!He also makes fresh pastas—get the spaghetti, get the ravioli, get any of the pastas, really! There’s always a fish on the menu, like whole bass or skin-on tile fish, which you should definitely get, and staples like the angry chicken (Calabrian chiles will do that to you), perfectly cooked octopus over borlotti beans, and ricotta toast with honey and TONS of crushed pink peppercorns, which, yeah, you should order. Haven’t had a just-okay dish yet.Every meal at Corto has left me satisfied and I can’t recommend it enough. All the food is simple and thoughtful without lacking creativity and quality. These young folks know what they’re doing!Go there: CortoExplore Bon AppétitHighly RecommendNew JerseyItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-25", "author": ["Condé Nast", "Brad Leone"]}