{"id": "061b09dacadebc791ac6a932c22b6068", "url": "https://www.bonappetit.com/story/can-i-sub-this-for-that", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Baking Substitutes - Your Most Common Questions About Baking Swaps, Answered By Us  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking“Can I Sub This For That?”: An Almost Comprehensive AnswerYou asked, we tried to answer. By Sarah JampelFebruary 14, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.“Can I substitute X for Y?” is the baking question I get more than any other. Just this week, as we started The Basically Guide to Better Baking and introduced the first recipe, Salty Buckwheat Chocolate Chunk Cookies, I’ve fielded the following queries:Can I substitute whole-wheat flour for buckwheat flour?Can I substitute buckwheat flour for all of the flour?What about using vegan butter in place of butter?Or flaxseed eggs in place of eggs?Whole eggs in place of egg yolks?Can I use dark brown sugar when the recipe calls for light?While the answer to all of these is, technically, yes (who am I to stop your fun experiments, some of which may end in serendipitous success?), my genuine answer must always be no and I’m sorry. Or, please don’t.While I promise I want to accommodate the ingredients you have on hand, I’m more determined to help you achieve a good result. I understand it like this: If I only have grasshopper flour in my pantry (let’s imagine) but I know that using it will make for a terrible cake, isn’t it worth it to go out and get some of what’s called for?No, you cannot replace the sour cream in this cake with water.\nAlex LauI’m not alone in my rigidity. When I told assistant food editor Sohla El-Waylly that I was planning to write a semi-comprehensive guide to appropriate baking substitutions, she practically laughed in my face. If she were to write the article, she told me, it’d be one word: No!Think of each baked good like an ecosystem in a delicate state of equilibrium. You might be able to alter something—to replace all-purpose flour with buckwheat flour, say—without seeing a big impact but, then again, if you tweak one pivotal component, the whole network could collapse. System failure!Even if a change does work in one recipe, it’s not a rule you can apply to all others, where the ingredients are interacting in their own unique way. Every recipe is a little bit different, which means it’s impossible for the developer to definitively answer “YES, you can do that” unless they’ve tested it themselves. We can only know what we’ve experienced firsthand. Everything else is an educated guess. (BTW, I did test the Salty Buckwheat Chocolate Chunk cookies with whole-wheat in place of the buckwheat: It produces a good cookie. But is it a cookie with an earthy, nutty, complex flavor? Not so much.)I don’t mean to make baking sound scary because it’s actually sort of miraculous, all of these ingredients working in concert to produce a beautiful chemical reaction that results in a delicious item that will, hopefully, bring you and your friends great joy. So rather than tell you “NO, don’t exercise your free will” and leave it at that, I’m answering a few of the most common q’s in the hope that explanation will help justify my obstinance:Got your flour? This is how you should measure it.\nPhoto by Laura Murray, Food Styling by Susan Spungen Can I use whatever flour I have on hand?No. Flour is a massive category and each one varies in flavor, protein content, gluten levels, hydration, fat levels (when it comes to nut “flours”)…The number of factors is mind-numbing. I couldn’t put them on a bar chart if you paid me.When in doubt, it’s safest to start by replacing just 25 percent of the all-purpose flour with an alternative. That should produce a noticeable effect without too drastically altering the structure and texture of your final product.Can I mess with the eggs?Eggs give baked goods volume, richness, and structure and the two members of the dynamic duo (the yolks and whites) play different roles. If you change the number of eggs, the way they’re incorporated (whisking with sugar until light and foamy versus stirring together, for example), their temperature (cold versus room temp), or the ratio of yolks to whites, you’re sure to change the texture and flavor of your final product.Can I use vegan butter/gluten-free flour/egg substitutes?Unless specified, we haven’t tested with these. But if you decide to try, please let us know about your results in the baking forum. I’m sure so many other people would love to hear.When it comes to gluten-free flour, specifically, I recommend going with a store-bought mix you’ve used with success in the past, whether that’s Cup for Cup, Measure for Measure, or something similar. But don’t try to use it in baked goods that depend on the power of gluten for their existence—namely, breads and pastries (think: focaccia, rolls, challah, naan, brioche, and Danish). Those need gluten to survive.What would the plush, tight crumb of milk bread be without gluten?\nPhoto by Alex Lau, Food Styling by Pearl JonesCan I swap light brown sugar for dark and vice versa?Even though light and dark brown sugar are often used interchangeably (and some recipes do work with both), they differ in their molasses content, which in turn affects their moisture level and pH. Chris Morocco’s recipe for BA’s Best Chocolate Chip Cookies, for example, calls for dark brown sugar. When Sohla made them with light brown they spread pancake-thin on the baking sheet. The more acidic dark brown sugar was meant to help activate the baking soda and cause the cookies to puff in the oven. Light brown sugar just didn’t have the same oomph and, thus, skinny cookies.Swap with caution and, only if baking soda is not involved (like custards, puddings, sauces, cheesecake, etc.).Can I use low-fat milk/yogurt in place of full-fat milk/yogurt?We test with whole milk and full-fat yogurt unless otherwise indicated. Replacing these with lower-fat alternatives will affect the texture and richness of the finished product. In the best case scenario, you won’t be able to tell the difference; in the worst case scenario, weird things will happen when you’re baking, or the taste and texture will leave something to be desired (think: less creamy, less satisfying). In recipes where dairy is an imperative ingredient—ice cream, cheesecake, pudding—it’s particularly important not to skimp on fat.This answer also applies to milk and yogurt alternatives (almond, oat, rice, cashew, coconut, etc.). Not only do the Alt Mylks have different amounts of fat compared to cow’s milk, but they also have different flavor profiles and chemical make-ups. It might not make a difference in a small quantity, but the higher the volume of milk, the riskier it gets.Can I line a pan with foil when the recipe calls for parchment?Would not recommend. Foil and parchment conduct heat differently. Whereas parchment helps to protect the cookies from the heat of the baking sheet, foil is a conductor, causing the cookies’ bottoms to get too hot too fast. This can result in uneven cooking, too-dark undersides, and flat, spread-out cookies. Invest in a roll of parchment paper (or treat yourself to pre-cut sheets!).But all you really have to remember is this: If you’re going to make a tweak to the recipe, don’t do it the day you’re planning to bake a cake for your partner’s birthday party. I speak from personal experience when I say that it may not end well.Explore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-14", "author": ["Condé Nast", "Sarah Jampel"]}