{"id": "062b8296ef49c422e3b68aba56753e35", "url": "https://www.bonappetit.com/story/spicy-chicken-katsu-sandwiches", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "I’d Invite Myself Over for This Spicy Chicken Katsu Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’d Invite Myself Over for This Spicy Chicken Katsu SandwichIt’s spicy, crunchy, juicy, and yeah—perfect.By Elyse InamineMarch 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI’m a lurker on the Bon Appétit tastings Slack channel. It’s a secret thread the Test Kitchen uses to announce when recipes in development are ready for relevant editors to taste and give feedback. Meaning, not just any staffer can show up or else the whole BA team would come (free food!). So even when I see alerts for everything bagel quiche (!), molten caramel cake (!!), butternut squash Parm (!!!), I quietly restrain myself from just, you know, conveniently making a visit to the Test Kitchen to “ask someone something.” But when I saw senior food editor Chris Morocco announce a Spicy Chicken Katsu Sandwich, I just couldn’t help myself.When I got to the kitchen, Chris told me his idea was to marry the katsu sando—a beloved Japanese convenience store classic—with hot chicken—the insanely spicy, craggy-textured bird from Nashville. The result would be a panko-stubbled, cayenne-spiked cutlet cradled between two slices of cottony-soft milk bread slathered with a pickle-y spicy mayo. Yeah, I mean, who could stay away?Here’s how it went down.Chris’s first thought was to soak the chicken thighs in buttermilk and hot sauce, but it was too wet and gloppy to cook successfully in an inch of oil, like you would with katsu. “Katsu is a little bit delicate,” he said. “It can’t be knocked about with abandon.”So he ditched the marination and opted for two types of heat, distributed throughout the cooking process instead: 1) A healthy amount of smoky cayenne went into the panko dredge, 2) a lot of Crystal hot sauce was beaten into the dredging eggs, 3) little more was mixed in into the mayo with some chopped bread and butter pickles.Though it doesn’t have that same burn-your-face-off heat as true Nashville hot chicken (we’ve got a different recipe for that right here), the Louisiana-style Crystal hot sauce Chris chose has a fruity, vinegary, not-too-hot heat that he felt would bring another, tamer spice dimension to the sandwich. “So many flavors are going on here,” he says of the sauce. “You get the sweetness to keep you from falling off the cliff, the acidity to brighten it—the spice is there to support all of it.” (If you want your sandwich even hotter, add an extra splash of sauce to your mayo mix, or right on top the shredded lettuce you add to the sandwich.)In the end, it’s neither totally faithful to Nashville hot chicken, nor is it 100 percent traditional katsu in its preparation. But it’s tasty as all get out, and it owes its beautifully balanced, crunchy-creamy-spicy-pickle-y life to both.Get the recipe:Spicy Chicken Katsu SandwichesThe shattering panko crispiness of katsu-style cutlets plus the fiery heat of Nashville-style hot chicken, all in one sandwich.View RecipeExplore Bon AppétitFried ChickenSandwichRead MorecookingA Grilled Chicken Sandwich Doesn’t Have to Be Boring and FloppyBy Alex Beggs and Molly BazshoppingThe Best Cooling Rack Will Reward You With Crispy Fried Chicken and Tender CakesBy Tiffany HopkinsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-25", "author": ["Condé Nast", "Elyse Inamine", "Molly Baz"]}