{"id": "062d32da865452b3a7e91015087e8e91", "url": "https://www.bonappetit.com/recipe/poached-eggs-in-chicken-broth", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Poached Eggs in Chicken Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPoached Eggs in Chicken Broth with Mixed VegetablesBy Seamus MullenJune 22, 20183.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis simple veg-forward broth (with #aneggonit) is the ideal cure for whatever ails you. Don’t skip the splash of vinegar at the end—it adds an acidity to the broth that helps brighten it and really brings it to life.Ingredients4 servings8cups homemade chicken stock or low-sodium chicken broth4large eggs1lb. asparagus, trimmed, cut into 2½\" pieces4small carrots, peeled, sliced 1½\" thick8oz. shiitake mushrooms, stems removed, caps halved8ramps, green and white parts separated, coarsely chopped1cup torn basil leaves1Tbsp. apple cider vinegarKosher salt, freshly ground pepperExtra-virgin olive oil (for drizzling)PreparationStep 1Bring stock to a simmer in a small pot over medium-high heat. Crack an egg into a small bowl, then gently slide egg into stock. (If you want a crystal-clear broth, you can poach the eggs in water instead.) Repeat with remaining eggs, waiting until whites are opaque before adding the next one (about 30 seconds). Poach eggs until whites are set and yolks are still runny, about 3 minutes. Using a slotted spoon, transfer eggs to paper towels as they are done.Step 2Reduce heat to medium and return stock to a gentle simmer. Add asparagus, carrots, mushrooms, and white parts of ramps. Cook, stirring occasionally, until asparagus and carrots are tender, 3–5 minutes. Remove from heat and stir in basil, vinegar, and ramp greens; season with salt.Step 3Divide broth and vegetables among bowls. Gently slip an egg into each bowl; season with pepper and drizzle with oil.How would you rate Poached Eggs in Chicken Broth with Mixed Vegetables?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSo good! A perfect comfort food dish. I felt so warm and fuzzy inside. My rendition was sort of a poor man's version. I swapped the chicken broth for beef broth (because that's what was in the fridge), added chopped baby carrots, salad lettuce, and ramen noodle soup base mix. Diluted it a little with water, and cooked it. The eggs were a hassle, but I'm just bad at poaching. This recipe will definitely give me a chance to practice! \nThe secret is in the runny yolk. Once I popped the eggs and let the heavenly liquid gold escape, the entire bowl transformed! Don't skip on the egg! Don't skip on the vinegar either -- it gives the broth an Asian flavor. Absolutely love this recipe. I'm excited to try the recipe as written next time I go shopping!RoseNY12/5/2020Explore Bon AppétitSoupSoups and StewsEggSpringQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeGluten-FreeHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Seamus Mullen"]}