{"id": "06352785b3977f3fe9a4ebc9864a639f", "url": "https://www.bonappetit.com/story/bar-norman-wine-shop-bar", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "I Fully Endorse Tipsy Wine Shopping at Bar Norman | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Fully Endorse Tipsy Wine Shopping at Bar NormanYou can drink wine and buy a bottle to take home.By Amiel StanekJuly 5, 2019FacebookTwitterEmailPhoto by David AlvaradoFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The last time I was in Portland, Oregon, I walked into Bar Norman on a mission: to pick out a bottle or two of easy-drinking gamay for a friend’s dinner party. But the magical thing about natural wine hero Dana Frank’s takeaway shop-cum-bar is that you can’t not sit at the bar when you’re checking out. Which also means you can’t not see the list of 30-plus wines by the glass on offer. Which, of course, also means, well, whaddya know, you do have time for a splash (or two, or three) of that Loire pet-nat that you weren’t initially planning on buying a bottle of—but, of course, you are now.Frank won’t steer you wrong. She stocks what she hails as “the grand-daddy of dry riesling in the Rheingau”: 2014 JB Becker Riesling Trocken Wallufer. “I absolutely love the unequivocal German-ness of Ha-Jo Becker’s wines and the fact that he was one of the very first to make naturally farmed dry rieslings that fly in the face of tradition,” she told me. Then there’s the 2017 Complemen Terre Muscadet Croix Moriceau. “It’s from the ‘new school’ of Muscadet, where the wines see a little bit of malolactic fermentation,” she explained. “That gives them an exquisite texture and body. Like sucking on a stone covered in lemon curd. So good!” Now that’s my kind of shopping.Go there: Bar NormanExplore Bon AppétitHighly RecommendWine BarsPortland OregonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-05", "author": ["Condé Nast", "Amiel Stanek"]}