{"id": "06514be5cd00449e3aa09f1e711b99f6", "url": "https://www.bonappetit.com/story/oyster-sauce-spaghetti", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Adding Oyster Sauce to My Spaghetti Was Probably the Best Thing I’ve Ever Done | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAdding Oyster Sauce to My Spaghetti Was Probably the Best Thing I’ve Ever DoneThis dish is loaded with garlic and bursting with umami.By Amber LeeNovember 18, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My mom used to bulk-buy boxes of oyster sauce—every recipe she made for stir-fried vegetables called for it, and she wouldn’t let us kids go one meal without eating our greens.But there are so many great reasons to keep a bottle of oyster sauce in the fridge. As a no-frills (read: lazy) home cook whose go-to recipes are all under 20 minutes, I tend to throw a few tablespoons of oyster sauce into whatever’s cooking in my pan—vegetables, minced pork, tofu, instant noodles, fried rice…everything! Oyster sauce has this caramel-like sweetness and mildly briny saltiness that works well with just about any food. And not having to make a sauce from scratch by carefully measuring out six different types of dressings helps me keep my cooking time to a minimum.The good stuff!!!\nPhoto by Laura MurrayConsidering my prolific use, you’d think I wouldn’t have been that surprised to see this recipe for Spicy Garlic Butter Linguini from Marion’s Kitchen calls for oyster sauce. But I was. The combination of butter, garlic, and red pepper flakes in this dish distinguishes it from any bowl of gàn lāo miàn (dry-tossed noodles), and that doesn’t even begin to address the Parmesan in the ingredient list. Cheese with oyster sauce? Really?But after whipping it up for dinner one day, I was absolutely hooked. It’s loaded with garlic and bursting with umami, reminding me of classic stir-fried veggies topped generously with fried garlic. The thick, almost syrupy consistency of the oyster sauce clings to the noodles, giving them a glossy coating. It’s the sort of super savory pasta that keeps you slurping until there’s only a light sheen of oil left on the plate.While the original recipe includes a few more ingredients, such as soy sauce and Parmesan, I’ve tried making it with just five, and it still comes out as lip-smacking. I’d compare it to an aglio, olio e peperoncino (garlic and chile with butter as a substitute for olive oil) with a twist. The oyster sauce lends the dish a rich savoriness without the pungency that can come with seafood.Just like my mom, I don’t measure out my ingredients, but here’s my best approximation for my variation of this dish that feeds two: Finely chop 8–10 garlic cloves (I said it was garlicky!), then sauté them in 2 ½ Tbsp. butter along with 1 ½ Tbsp. crushed red pepper flakes (I like my food with extra heat, but you could certainly use less). Once the garlic is lightly browned, add 2 ½ Tbsp. oyster sauce and stir until the butter and oyster sauce are well mixed. Then throw in 8 oz. al dente spaghetti (or any other long-shaped pasta) and toss ’em around until evenly coated. When it’s ready to serve, garnish with a handful of chopped scallions.Whether you’re tossing your oyster sauce with Chinese broccoli or adding it to your pasta or noodle dishes, you’ll want to adopt my mom’s practice of buying oyster sauce in bulk. That way, you’ll never run out.Explore Bon AppétitIt's That SimpleOyster SauceChineseSpaghettiRead MorecookingI Wouldn’t Have Dreamt of Making My Own Korma—Until I Figured Out This ShortcutBy Varu ChilakamarriRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-18", "author": ["Condé Nast", "Amber Lee"]}