{"id": "0655092003a18846622fb046d3de3e1b", "url": "https://www.bonappetit.com/story/read-a-cookbook-like-a-book-book", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "There's No Better Time to… Read a Cookbook Like a Book-Book | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere's No Better Time to… Read a Cookbook Like a Book-BookIt's less about the cooking and more about the comfort.By Amanda ShapiroApril 23, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Coping with cookbooks.In the time I’ve worked in food media, I’ve heard other people say they read cookbooks like book-books, and I always had the same response: eye roll, yeah right, so annoying. If I was going to make the time to read anything from cover to cover, it would be a real book, thought judgy me. My cookbooks stayed in the kitchen, where I, you know, cooked from them. Of course, it took a worldwide lockdown to change my mind.When I got sick with what I think was COVID-19, my already high baseline of anxiety shot up like the price of Purell. I found it impossible to concentrate on anything except, sorry to get dark here, my own mortality. Not even Tiger King could distract me. Reading books was completely out of the question, and so was cooking—I could hardly muster the enthusiasm to open my fridge.One afternoon, sitting on my couch writing a work email, I was graced with my first-ever panic attack—heart volleying in my chest, arms tingling, a wash of cold from the crown of my head. My laptop dropped to the floor as I slumped onto my back, ready to pass out. Luckily I didn’t, and the whole thing was over in barely a minute. After calling my mom and sobbing into my couch cushion for what felt like days but was actually probably 20 minutes, I turned my head to the stack of cookbooks under my coffee table. I saw Mark Bittman’s iconic tome, How to Cook Everything—the honeybee-yellow “Completely Revised Twentieth Anniversary Edition” to be precise—and felt an overwhelming urge to open it.I flipped to a random page and read a sidebar: “15 Thirty-Second Ways to Jazz Up Plain Rice.” (“1. Stir in a tablespoon or more butter.”) Further down the page, I read a section called The Basics of Rice Pilaf. It was boring, but I found myself taking deeper breaths. On the next page, I read a recipe for Chicken Paella. (“Sometimes perceived as a major production, paella is nothing more than a combination of rice and something else.”) I read another sidebar, “17 Grain Dishes That Make Good Leftovers.” I flipped to one of the recipes: Stuck-Pot Rice with Potato Crust. I read the recipe and Bittman’s suggested variation (swap the potato for pita). I had no desire to make it, but I felt oddly calm.Mark has so many ideas for jazzing up plain rice.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesNo shade to Mark, but I don’t use HTCE much for cooking. I consult it for things like bread-baking (okay, I did that once) and for his fried-rice technique, but I gravitate toward cookbooks that are more curated than encyclopedic. But ever since Panic Attack Day, it’s been my most effective form of therapy, second only to actual therapy. In moments when the anxiety starts bubbling in my chest, I open to a random page and read it through. I’ve read the recipe for Bean Griddlecakes (“These are amazing,” begins the headnote), as well as “10 Additions to Bean Griddlecakes” and “6 Sauces for Bean Griddlecakes.” I know “What to Expect from Whole Wheat Pasta” and how Mark suggests removing a fish head (“Use a mallet to pound the knife through the backbone, if necessary”). I’ve read all about “Comforting Soups” and have not made a single one.A common strategy for dealing with panic attacks, I’ve learned recently, is something called the 5-4-3-2-1 method. You find 5 things to see, 4 things to feel, 3 things to hear, 2 things to smell, and 1 thing to taste. The idea is to get your brain away from Anxietyland and back to the immediate present by focusing on what’s around you. I think reading HTCE works in a similar way. My eyes are focused on a page, my hands on holding a solid (and quite heavy) object, and my mind on the food I’m reading about: how the ingredients come together, how the dish might smell and taste, the texture of it in my mouth.Since HTCE became my panic-reduction strategy, I’ve found myself flipping through it, and even other cookbooks, in calmer moments too. It’s the kind of soft-focus activity that I think a lot of us are craving right now, like knitting, coloring, and looking at photos of Stanley Tucci. I’m still not reading cookbooks cover-to-cover and probably never will, but I am sorry for judging all you people who do. We each find comfort in different ways, and, right now at least, I’m finding it in “13 Sauces to Make with Mayonnaise” on page 70.Explore Bon AppétitThere's No Better Time CoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Amanda Shapiro"]}