{"id": "065ddf9673420cdbb259e76ae04196d9", "url": "https://www.bonappetit.com/recipe/pan-seared-chicken-breasts-with-crunchy-radish-salad", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Pan-Seared Chicken Breasts With Crunchy Radish Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPan-Seared Chicken Breasts With Crunchy Radish SaladThis fast technique brings out the best (a.k.a. the juiciness!) in boneless, skinless chicken breasts.By Carla Lalli MusicApril 18, 20214.5(48)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintHow can you bring out the best in skinless, boneless chicken breasts, which have a tendency to overcook and dry out? Cook them mostly on one side over moderately high heat for a tasty crust and plenty of juiciness, then pair them with a bright vinaigrette to further counteract any potential dryness. Finally, top them with a crunchy salad to build in the textural contrast that will keep things lively.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit Market8-Inch Chef's Knife$47 At AmazonMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonWhisk$10 At AmazonRolling Pin$13 At AmazonLarge Skillet$84 At AmazonSpatula$12.99 At AmazonIngredients2 Servings12oz. radishes (such as red, icicle, watermelon, or daikon)Kosher salt, freshly ground pepper6scallions2Tbsp. white wine vinegar1Tbsp. drained prepared horseradish2tsp. Dijon mustard¼cup plus 3 Tbsp. extra-virgin olive oil2skinless, boneless chicken breasts (about 12 oz. total)PreparationStep 1Trim green tops from 12 oz. radishes (such as red, icicle, watermelon, or daikon); compost or save for another use. Cut radishes into quarters if smaller or into ½\" pieces if larger. Transfer to a medium bowl and season generously with kosher salt and freshly ground pepper. Toss radishes with your hands, squeezing lightly to dissolve some of the salt and help the radishes release some juices, 1 minute.Step 2Trim top 3\" from 6 scallions, then trim root ends; discard. Thinly slice scallions and transfer to bowl with radishes; toss to combine. Set aside.Step 3Whisk 2 Tbsp. white wine vinegar, 1 Tbsp. prepared horseradish, and 2 tsp. Dijon mustard in a small bowl to combine. Gradually add ¼ cup extra-virgin olive oil, whisking constantly until emulsified. Season vinaigrette with salt and pepper.Step 4Pour half of vinaigrette over reserved radish salad and toss to coat. Divide remaining vinaigrette between 2 plates.Step 5Place 2 skinless, boneless chicken breasts (about 12 oz. total) between 2 sheets of parchment paper or plastic wrap. Using a rolling pin or meat mallet, pound chicken breasts out to about ¼\" thick. Season both sides with salt and pepper.Step 6Heat remaining 3 Tbsp. extra-virgin olive oil in a large skillet over medium-high. Place chicken breasts in skillet and press down firmly on them with a spatula to ensure cutlets are making good contact with the pan. Cook, undisturbed, until chicken is deep golden brown underneath and there is a thick band of cooked flesh around the edge, about 5 minutes. (Cooking the chicken primarily on 1 side ensures great browning but minimizes the chance of overcooking.)Step 7Turn chicken over and cook until second side is light golden brown and chicken is just cooked through, about 2 minutes.Step 8Transfer a chicken breast to each plate with vinaigrette and let sit 5 minutes for juices to redistribute. Transfer to a clean cutting board and slice each chicken breast crosswise into 4 or 5 pieces. Return to plates. Spoon radish salad over and around chicken, making sure to get all the vinaigrette too.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Pan-Seared Chicken Breasts With Crunchy Radish Salad?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleSimple yet surprisingly delicious!! I had bought a bag of radishes for a recipe that called for 2 radishes so needed to use them up! The sauce and green onions were perfect with the radishes, and then paired with the easy to prepare chicken made for a colorful, tasty, and filling dinner in no time!! Will make again! KathrynAtlanta, GA2/3/2022Weeknight repeat dinner forever! I've already made this twice, with the only addition adding more greens to to the salad component because they were on hand + health. I'm going to make it with salmon next week and keep the vinaigrette in mind for all purposes--great, big flavor but not too heavy. Erin APortland, OR1/24/2022the recipe itself is great, and as others have said is unexpectedly delicious given how little effort is required! \n\nthe method for cooking the chicken breasts is also amazing - i use it every time i want to cook a chicken breast now. LukeLondon, UK9/19/2021This is definitely a no for me - too pungent for my taste AnonymousRaleigh, NC6/18/2021I made this recipe three times in one week. It's simple, quick, flavorful - light yet surprisingly filling. All around great recipe as is. Anonymous6/9/2021\nThis was simple, but excellent! The horseradish was ESSENTIAL. Brought everything together and added nice complexity and a little funk. This was a great lunch. CJSan Diego5/21/2021Wow, this was way better than I was expecting. Initially looking at this, I felt like it could potentially be too bland, but boy was I wrong. The extra virgin olive oil provide a pleasant richness to everything, and the vinaigrette married it all together. Definitely recommend.NickPA5/8/2021Holy moly!!! This recipe was absolutely fantastic. I wish I would have made more chicken because I had leftover radish salad and it would be great to have leftovers chicken too for lunch the next day. I will certainly be making this again soon!  SarahToledo, OH5/1/2021So tasty!! Great as leftovers, even served cold. I loooooved the radish salad — I'll make it outside of this recipe!Jacob SChicago4/30/2021This was an easy and tasty dinner! The chicken came out juicy and nicely browned. I would say we had more radishes than we really wanted, and I would cut them down to about 2/3 what the recipe calls for next time. Couldn't find horseradish so used grated fresh ginger instead, which worked pretty well! Served with couscous and asparagus.SonaliNew Haven, CT4/22/2021Explore Bon AppétitChicken BreastChickenPoultryRadishVegetableQuickEasyWeeknight MealsMainGluten-FreeDairy-FreeKetoDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-18", "author": ["Condé Nast", "Carla Lalli Music"]}