{"id": "066ee31a6c75cafce849128b11278320", "url": "https://www.bonappetit.com/story/everyone-cooking-but-me", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Everyone Is Cooking Right Now. Except Me. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureEveryone Is Cooking Right Now. Except Me.Who decided an economy-crushing, emotionally trying pandemic was a good time for self-improvement?By Josh DuboffApril 23, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI have never, to put it mildly, been one to cook. A New Yorker in the Carrie Bradshaw “My oven? You mean where I store my sweaters?” vein, I cannot remember the last time I made something more complicated than a mixed drink in my kitchen. Once, seven or eight years ago, my friend David came over to try and teach me how to make a “simple” dish: a chicken-based stew. While we prepped, the oddly intricate salt-and-pepper shaker fell apart into the pot. We thought we had removed all the components, but when I was ladling the leftovers into a container after we finished eating, I found a … triple-A battery in the remains. As I tried to process the fact that we had just ingested a battery-flavored stew, the battery itself seemed to taunt me: You are not meant for this.Now, during this quarantine period, I am taunted by banana bread. Each Instagram Story of a well-lit sourdough loaf or glistening roast chicken or complex soup presents a new spiral of envy and shame. They have been impossible to avoid this past month, this deeply strange stretch of time where each day seems to last a year, no matter how late you sleep in.Wherever I scroll, close friends, acquaintances I haven’t seen in 11 years (but still monitor assiduously on social media), celebrities—they’re all sharing their culinary outputs. One college classmate has posted a new homemade dessert every night: “Whipped these up!” he’ll write, as if he reached into his pocket and emerged with this set of 12 elegantly shaped almond macaroons. I watch influencers and reality-show contestants present braided artisanal breads (“made from scratch!!”) instead of their usual sponsored teeth-whitening and gym equipment posts. Kylie Jenner recently shared her banana pancake process on Instagram, step by step, and—even in that case—it looked to me like an impossible feat, as if I were witnessing an Olympian complete a high jump.For years, people have been suggesting I might want to try learning at least a few recipes. (See also: people I barely know offering, “I feel like yoga would be really good for you!”) And there is a part of me that has watched all of this cooking content with a pang of regret: Maybe I wouldn’t be panic-Googling symptoms or texting people I probably shouldn’t be if I were instead spending hours whipping up a falafel feast or crème brûlée in my kitchen (in this fantasy, I’m also wearing something other than the same two pairs of flannel pants I’ve been alternating between). But right now, I barely have the psychological fortitude to write a coherent email; acquiring a new skill set does not feel within reach.My “quarantine food diary” probably does not look very dissimilar from that of a typical eight-year-old during non-quarantine times. I have reverted to peanut butter and jelly sandwiches, tuna fish sandwiches … uh, hummus sandwiches. The extent of my “inventive-ness” came a few afternoons ago when I realized we were out of bread, so I fashioned a sandwich out of tuna salad and two slices of turkey. (Take that, everyone showing off their elaborate broths on Instagram Live!). There have been pastas and canned soups and Clif bars and scoops of raisins—and a particularly low point when I peeled a banana with a fork and knife because I still don’t really understand what we should and shouldn’t be touching with our hands. I bought a few bags of the Stacy’s cinnamon sugar chips I used to subsist on as a teenager. Frozen meals reheated. Crackers found in a tin of unknown provenance. I fear I am just days away from wandering around my kitchen in a blanket, pouring cereal into my mouth directly from the box, mixing a bunch of sauces with Sour Patch Kids in a bowl and finding out how it all tastes together.None of what I’ve been eating during this quarantine period is food that one would savor, or that feels particularly healthy or nourishing. But, considering the way I’ve experienced this period of time, days lived tentatively, fearfully, scared of what my phone might have to tell me but also unable to put it away, it also feels like the “right” food. It’s food that serves its purpose, combinations that—in their middle-school essence—manage to spark some kind of nostalgic joy. And at the very root of it all, I am aware of how lucky I am to have this food in my pantry at all.When I’m on Facetime calls with my friends, I find myself staying quiet when everyone else shares their cooking anecdotes. “What have you been … making, Josh?” someone will inevitably ask, and I’ll just laugh: “Oh, you know...!” I am sometimes struck by a sense of quasi-embarrassment, that I should be “making the most of this time” in the way everyone else seems to be. What is stopping me from being able to concoct an Instagram-ready loaf? But in listening to the tales of others, in viewing the meals on display in my feed, even if I do find myself wanting to roll my eyes at times (We Get It! You Made Bread, Too!), I at least feel like I’m part of a social ecosystem.One night this week—in a moment of particular vulnerability—I came across some chocolate chip cookies posted by someone I’ve met maybe twice. She shared the recipe, which seemed straight-forward enough. I took a screenshot. Could that be me? Attempting these cookies would be hours spent focusing on something—anything other than everything!—that didn’t involve the Internet. I imagined the gratification, the sense of worth and productivity I’d feel. When I talked to my friends later, I’d be able to provide an actual substantive update for them, something other than just “I drank half a bottle of wine and Photoshopped what I’d look like with blonde hair again.”It was a nice thought. I put my phone down and reached into my bag for another handful of cinnamon sugar chips.Josh Duboff is a New York-based writer still figuring out a non-awkward way to end a Zoom hangout.Explore Bon AppétitCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Josh Duboff"]}