{"id": "06735b6151e0562a0222e7f7c202e820", "url": "https://www.bonappetit.com/story/types-of-tofu", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Types of Tofu and How to Use Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Are So Many Types of Tofu: Which Should You Use?Tofu can be bamboozling to buy. Here's what you need to know.By Andrea NguyenFebruary 8, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThis week on Basically, we're diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.Are you a person who stands at the grocery store tofu display pondering which one to buy for a recipe? I’ve been eating, cooking, and making tofu for decades, and still, I linger in front of the case. Tofu is a staple in my kitchen, but it can be puzzling to purchase. Like jeans sizing, tofu texture isn’t consistent—“firm” can seem like “extra-firm” when switching between brands, for example.Many recipes gravitate toward the reliability of extra-firm tofu, which is easy to manipulate and not likely to fall apart in dishes. But tofu isn’t a one-texture-fits-all ingredient. It’s a wondrous flavor sponge, and the softer the texture, the better it will take on seasonings. And since the pandemic has made supermarket inventories iffy, it's even more important to keep your tofu options open. Here’s a brief run-through of common types of tofu sold at mainstream grocers that you can use to decide what's best for your particular application:Silken Tofu, in Tubs or BlocksSilken tofu can come in a range of textures, from soft to firm, but what they have in common is that they are not pressed and they have a high water content, which makes them prone to falling apart. Silken tofu is unpressed and undrained coagulated soy milk.When silken tofu comes molded in a tub, it has a dreamy custardy texture. Many people love to whirl silken tofu into a smoothie or dip, but try scooping or cutting it into cubes, then garnishing with soy sauce, dark vinegar, chili oil (or chili crisp), and green onion (or shiso) for a quick snack. A drizzle of good olive oil, balsamic, and flaky salt are great, too (add tomato and basil when in season).Add silken tofu to canh.\nIf silken tofu comes as a block sitting in water, it’s been coagulated to take on a sturdier form. Cube and drop it into brothy Asian favorites like Korean jjigae, Japanese miso soup, or Vietnamese canh. It can be added to mapo tofu without having to be drained. This form of silken tofu looks luxuriously silky and has a slippery mouthfeel, but won’t absorb seasoning as well as spongy types of tofu that are produced by coagulating soy milk then weighing down the resulting curds (similar to how cheese is made), such as the next types discussed.Medium or Medium-Firm Tofu BlocksWhen you cut into a block of medium or medium-firm tofu, you’ll notice little pockets between some of the tender curds. That kind of tofu is what I’ve seen used in Chengdu for mapo tofu (and it’s what I use too). During the simmering period, the tofu cubes absorb the sauce and seasonings to carry the tingly, umami heat of the iconic Chinese dish. Medium or medium-firm tofu is often considered “regular” tofu. It may simply be labeled “tofu” without any texture description (in California, where I live, that’s the case at Trader Joe’s). Don’t pass up trying it.Firm TofuFirm tofu, which has been weighed down a bit longer or with more weight than medium or medium-firm tofu, is terrific for mashing to mimic ricotta or egg salad. It won’t weep as much water. Firm tofu straddles textures: Feel free to sub it in for medium-firm tofu, or in a pinch, use it instead of extra-firm tofu.Extra-Firm TofuWhen pan-frying tofu, choose firm or extra-firm tofu. The former may take a little longer to pan-fry because it has more moisture, but pan-fried firm tofu absorbs flavors well simply because it’s not as dense as extra-firm tofu. Extra-firm tofu fries up faster than firm, with less sticking, because there’s less residual liquid in the block; the result may be crisper and more handsome than firm tofu, but it won’t take on flavor as well as firm.Crisp up extra-firm tofu, then simmer it in a sauce of soy, mirin, and toasted sesame oil.\nPhoto by Laura Murray, food styling by Susie TheodorouI pan-fry both kinds of tofu, depending on my mood and what’s available at the store. Regardless of type, I lightly salt the cut pieces then let them hang out on paper towels or a clean dry kitchen towel to drain for 15 minutes before patting dry and frying.In general, I find that firm and extra-firm tofu are the most useful because they’re versatile. They hit the tofu texture sweet spot—soft enough to absorb flavor but hardy enough to be cooked without risk of falling apart. Do note that some firm tofu, like House Foods’, skews soft, more like medium-firm.Super-FirmWhen tofu comes as vacuum-sealed packages, it’s often labeled super-firm with a “high protein” description. It’s solid stuff, so much so that you can toss a block of super-firm tofu between your hands without fearing it breaking like you would with less dense tofu. That’s not necessarily a bad thing. You can grate super-firm tofu for dumpling filling, for example. You may also thinly slice it, coat it in soy sauce, and pan-fry to a crisp for a sandwich or salad topping. Whereas other kinds of tofu may require draining during prep, you only have to pat super-firm dry with paper towel before using. If you have to store leftover super-firm tofu, treat it like other tofu blocks: Put it in a container of water and change the water every third day.Tofu is a fascinating ingredient to manipulate and master for vegetarian or low-meat dishes. Don’t be afraid to explore and tinker with the different kinds.Andrea Nguyen is a writer, recipe developer, and teacher based in Northern California. Her latest cookbook is Vietnamese Food Any Day.Explore Bon AppétitBasicallyTofuShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-08", "author": ["Condé Nast", "Andrea Nguyen"]}