{"id": "0682df95bf60117203f69925813bf4d9", "url": "https://www.bonappetit.com/story/best-greek-yogurt-for-cooking", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "The Best Greek Yogurt for Cooking is Wallaby | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWallaby Is the Best Greek Yogurt for CookingIt's tangy, it's silky, it's not too thick, and we're on board.By Carla Lalli MusicApril 4, 2018FacebookTwitterEmailPhoto courtesy of Wallaby YogurtFacebookTwitterEmailAmerica’s love affair with Greek yogurt has led to an explosion of brands in the dairy aisle, and I love trying new ones that catch my eye. But which is the best Greek yogurt for cooking? I fell for Wallaby Organic Whole Milk Greek Yogurt, made out of California. It’s shiny, silky, bouncy, and tart—with a lot of lusciousness and none of the chalkiness found in some other brands. The official Wallaby website credits their “unhurried” culturing process for the buoyant texture, and claims their yogurt is “authentically” strained to achieve a “deliciously thick” result. I don’t know enough about how it’s made to confirm or deny these claims, but I can tell you that, based on my empirical research, this yogurt is excellent for cooking, and I'd eat it straight too.When the grocery delivery service that we use in the BA test kitchen started carrying the brand, we began using it in recipe development on a regular basis, and slowly but surely new converts were won. Senior food editor Andy Baraghani, a world-renowned yogurt connoisseur (he is known for putting yogurt into every single recipe he develops) is a fan. “It is super silky, with good richness and tang,” he says, “and you don’t need to thin it as much for sauce as you do with thicker yogurts.” Try it in one of his yogurt-forward dips: He recommends it in this minty number, or this colorful sauce that is perfect alongside rice.Senior food editor Chris Morocco, man of the golden palate, had this to say: “It’s achieves the perfect synergy between tanginess, creaminess, and the complete absence of chalkiness.” I’d just like to point out that anyone who uses the word synergy in a regular sentence is not to be questioned. As if that wasn’t enough, Morocco is bold enough to compare Wallaby to the incomparable White Moustache Persian yogurt, saying it was the closest a mass-produced yogurt would likely ever get.In sum, Wallaby is the best Greek yogurt for cooking because of three key attributes: tanginess, silkiness, and not-too-thickness. Wallaby blends easily into dressings and smoothies because of its texture. Because it doesn’t have to be thinned out to be pourable or dip-able, its tartness stays undiluted—you could just add a pinch of salt and call it a sauce and no one would blink twice. I usually go for the full-fat, but even at 2%, it retains its glossy richness: a quality I have appreciated many times while eating it with a drizzle of maple syrup, standing up at my kitchen counter.Buy Wallaby Organic Greek Yogurt on Fresh Direct, $7.99Try some more recipes that make yogurt the star:Turmeric Fried Eggs with Kale, Yogurt, and BaconBreakfast bowls shouldn’t take 2 hours to make; this one is ready in about 20 minutes.View RecipeSpiced Dal with Fluffy Rice and Salted YogurtIn this dish, lentils get a double dose of tartness from lime-marinated red onion and a drizzle of tangy yogurt.View RecipeSpiced Chickpeas with Crispy Pita, Yogurt, and Brown ButterThis version of the Levantine breakfast dish, known as fatteh hummus, is all about the contrast of textures and flavors: crunchy pita chips, creamy chickpeas, and tart yogurt.View RecipeExplore Bon AppétitYogurtGreek YogurtRead Morecooking8 Reasons Why Molly Yeh Loves Yogurt More Than LIFEBy Molly YehRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Carla Lalli Music"]}