{"id": "0691659558592cbeff04a4c737548d54", "url": "https://www.bonappetit.com/story/never-fail-easy-cod-recipe", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I Make This Easy Cod Recipe Every Week, and I'm Not Stopping Anytime Soon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make This Easy Cod Recipe Every Week, and I'm Not Stopping Anytime SoonI get made fun of for bringing the same leftovers to work on the regular, but I don't care. This easy cod recipe is too good to quit.By Rachel KartenApril 12, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Every staffer at BA has a recipe that they are most associated with. Alex Delany loves these sambal skewers. Emily Schultz makes Healthyish’s yogurt flatbread on the reg. When I think of Christina Chaey, I think of this steamed fish. Carey Polis loves this sausage, greens, and beans pasta. Me? It is, without a doubt, this easy cod recipe: Slow-Cooked White Fish with Charred Cabbage.“Oh, you brought in your cod thing,” is a comment I get from nosy coworkers at least once a week as I sit down with my lunch. Because yes, I make this recipe, which was originally developed by Andy Baraghani for Healthyish’s Feel Good Food Plan, about that often. But that’s because this recipe is highly adaptable, super simple (only seven ingredients!), and exactly what I crave on a Monday when I spent the weekend eating whatever the opposite of \"Feel Good Food\" is.First, there’s the “slow-cooked” cod. I used quotation marks there because I don’t want to lose you with that term. When it comes to a firm, white fish like cod, slow-cooked really means 15 minutes in the oven. Easy! Rub the filet with olive oil, zest some grapefruit on top, season with salt then throw it in the oven. The end result is a perfectly-flaky, bright-tasting piece of fish.Next, the charred cabbage. Which is 100 percent my favorite way to cook cabbage. You tear about a quarter of a head of the green stuff (I’ve tried using purple here, it’s not as good) into pieces and cook in a pan over medium-high heat. Do! Not! Move! Them! The goal here is to really get good color on each ripped piece. Stir for a second, season, and then let them sit a little longer. Et voilà: super flavorful, sorta-smoky cabbage that only took five minutes to make. Add it to your plate. Top with some grapefruit rounds. Add the flaked cod. Drizzle the whole thing with olive oil. Crack lots of fresh pepper. And that’s it! Extreme infomercial voice: But wait! There’s more!Since I make this thing every damn week I’ve tried out a whole lot of modifications and swaps. I pretty much always add torn Castelvetrano olives, cilantro, and a sprinkle of Aleppo pepper. When the store only has sad-looking cod, I’ll swap in a handsome hunk of salmon. I’ve also been known to char some shishito peppers before the cabbage when I’m feeling spicy-ish. So many options! If I was doing a TED Talk, I’d say some inspirational line about how the possibilities are endless with this perfect recipe, and it’s up to you to take advantage of them. But I’m not. I’m just here writing about the Cod Thing. My Cod Thing.Said easy cod recipe, right this way:Slow-Cooked White Fish with Charred CabbageSometimes with cooking, the best thing you can do is leave a thing alone. In this case, let the cabbage leaves sit and get charred around the edges before you even think about tossing them in the pan.View RecipeExplore Bon AppétitBasicallyNever FailCodFishCabbageRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Rachel Karten"]}