{"id": "06a309d78c9e248d0043b84a6b6186e9", "url": "https://www.bonappetit.com/story/liev-schreiber-really-loves-broccoli", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Liev Schreiber Could Eat Bananas, Broccoli, and Baguettes Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Think You Know Liev Schreiber, Then He Tells You How Much He Loves BroccoliBut the ‘Isle of Dogs’ star would rather be eating a hot baguette.By Alyse WhitneyApril 4, 2018FacebookTwitterEmailDavid Crotty/Patrick McMullan via Getty ImagesFacebookTwitterEmailLiev Schreiber is in a sticky situation. The Ray Donovan actor is trying to teach his sons—Sasha, 10, and Kai, 9—how to make sushi, but they always end up covered in rice. “Holding a child’s attention once he’s got rice stuck all over his fingers, it ain’t easy,” he admits with a laugh.Read on to see what else the Isle of Dogs star is cooking, the prized kitchen possession he has to keep away from his kids, and what weird trio of foods he’d want to eat forever.What’s a typical meal like in the Schreiber household?Most of the food that I make is designed for boys, so it’s tricky. One of our go-to meals is just marinating drumsticks, which we really love to do because it’s finger food. I mix together olive oil, ginger, garlic, soy sauce, black pepper, and red chile flakes in a bowl with the drumsticks around 2 p.m. and pop it in the fridge. By the time the boys are done with their homework, you just bake them at 350° until crispy, about 40 minutes. Then I serve with broccoli and rice. We also love making pasta, and we’re trying to master sushi. We’re not really good at it yet, but we’ve been practicing a lot. The hard part is the rice though.How do you cook the rice?I cook it in a pot, and I do the sort of basic Jasmine rice instructions. Sometimes that simmer time gets messed up, because I’m dealing with boys. I never get it sticky enough! Maybe I should get a rice cooker. There’s a vinegar component too, right? I’ve never added rice vinegar.How did you teach yourself to roll sushi—YouTube videos?We like to sit at the sushi bar at BONDST and watch the guys there. They make it look a lot easier than it is! We’ve never had official lessons, but we looked it up when someone gave us the sushi-rolling mat as a gift. I think everything comes down to that rice consistency, and that thing you said about wetting your hands.Instagram contentThis content can also be viewed on the site it originates from.You post photos of fishing on Instagram a lot. What do you like to make with fresh catch?When the fluke are running Montauk, we have a fluke fish fry. Everyone—even Kai who doesn’t even eat fish—will eat that. We catch a whole mess of them, double dip them, deep-fry and serve with corn and sriracha mayonnaise. That’s just crazy delicious. Not super healthy, but delicious.If you were trapped on an island like in Isle of Dogs, do you think you could survive by fishing alone?As long as I had Sasha and Kai with me. They are my secret weapons. And they are amazing scavengers. Sasha dreams of being stuck on a desert island, and having to fend for himself. Between between mussels and the fish, I think we would do very well.What would be the five ingredients in your desert island toolkit?Olive oil, garlic, chile flakes, lemon, and salt. And I’d need my best knife.Do you have a favorite knife?You've gotta have a good knife. It makes cooking so much easier and so much more fun. My brother got me a really beautiful Japanese sushi knife for my birthday six years ago. It’s probably not fancy by your standards, but by my standards, it’s the best knife in the world. It's one of those knives that I can’t even take out when the kids are around. If I’m doing fish, I use this one to clean them. I can’t read the name because it’s in Japanese, but it’s the sharpest knife I’ve ever owned.Is that the most prized possession in your kitchen?No, that would be my cocotte, my little Dutch oven. Actually, that’s number two. The knife is the best. It can slice through anything. I like to make pho sometimes. And if you freeze the beef, and then you want to slice it real thin, this will go right through it.If you could only eat one food for the rest of your life, what would it be?When I was a kid, it was bananas. And then when I was about 30, it became broccoli. Now that I’m 50, I’ve learned to compromise. I think some sort of banana broccoli casserole would probably do it. Superfoods. If you don’t have a choice, if it’s to stay alive, then it’s broccoli. And if it’s absolutely anything I want, it’s probably a fresh, hot baguette. That’s probably the one thing that I find most irresistible in life.I buy mine at Parisi Bakery on Elizabeth Street. I used to walk my dog past it, and I’d smell them baking. The guy was nice to me, so he would give me a hot one. Once they’ve been out of the oven for more than two or three hours, it completely changes the flavor profile and everything. But if you can hook up with one of those immediately after it’s come out of the oven, it’s mind boggling. If it’s fresh out of the oven, it needs absolutely nothing. An hour or two out of the oven, you might want a little butter or a nice soft cheese. I think I’ll go get one now.This bakery has one of our favorite baguettes:Explore Bon AppétitCelebritiesInterviewsRead MoretechniquesA Simple Step for Wayyy More Flavorful RiceBy Amanda ShapiroCurried Chicken Drumstickssponsored5 Fish Sushi Lovers Need to KnowBy Princess CruisesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Alyse Whitney"]}