{"id": "06ba70acfe1424b5a21fd9fb49ddf652", "url": "https://www.bonappetit.com/story/hedley-and-bennett-socks", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "I'm a Sock Enthusiast, and Hedley & Bennett’s Chef Socks Are Perfect in Every Way | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m a Sock Enthusiast, and Hedley & Bennett’s Chef Socks Are Perfect in Every WayTrust me—I worked in fashion.By Adam RapoportFebruary 19, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Ellen Bennett, founder of the ever-expanding apron brand Hedley & Bennett, will tell you that its supremely comfortable and supportive Chef Crew Socks are made for the line cook who’s on his or her feet for 10 hours at a stretch.I’m here to tell you differently. For those of us holed up in an office all day, who can’t wait to get home and change into our sweats, there are no better socks to pad around the house in, from fridge to sofa to bathroom back to sofa.Richly cushioned, they keep your feet warm while walking on a cold tiled floor, but they’ve also got this mesh venting thing happening so your feet never get schvitzy. This matters to me, in that I’m just slightly particular about my socks, as I’ve noted before.And in true H&B fashion, they’re boldly colored and patterned and come with inspiring but somehow not cheesy phrases stitched into the bottoms, like “TRY TRY AGAIN” and “GO GO GO.” You know, in case you need motivation to get up off the couch to grab another pint of mint chocolate chip.Buy it: Hedley & Bennett Chef Crew Socks, $16 for a pair at Hedley & BennettAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecultureClaire Saffitz Introduced Me to My Favorite New ClogsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-19", "author": ["Condé Nast", "Adam Rapoport"]}