{"id": "06c1ac1acfa444e0688ac4b662c6d285", "url": "https://www.bonappetit.com/story/learning-from-steak-salad-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "This Steak Salad Recipe Will Teach You Everything You Need to Know About Steak and Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWant to Master Steak? Or Salad? Make This Steak Salad RecipeSearing a steak, seasoning a salad, and making a vinaigrette. All covered in today's class...errr, salad.By Alex DelanySeptember 18, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailIf you’re the kind of person that thinks that eating salad for dinner is lame, then you clearly haven’t made this steak salad recipe. This is a Dinner Salad. It will not leave you hungry or unfulfilled, wishing you had made different dinner decisions. It delivers on its promise. It is a meal. It has more than enough to offer.But like Walt Whitman and my eternal love for deli sandwiches, this recipe is not one-dimensional. It does more than silence the rumblings in your stomach. It contains multitudes.When you make this recipe for steak salad with shallot vinaigrette, you’ll learn pretty much everything you need to know about making a vinaigrette, seasoning a salad, and searing a steak. This recipe is the foundation upon which you will build your Dinner Salad castle, assuming you are the type of person who enjoys the thought of having a castle. If not, a regular home is fine by me. Do what you want.Let’s start with the steak, because when someone says “steak salad,” most people concentrate on the first word more than the last. Steak carries the reputation of being a fancy food, a red meat for special occasions, and while that can certainly be true, steak is actually a perfect, quick-cooking weeknight dinner food. There are no special techniques or pieces of cooking equipment, no long waiting periods or arduous prep steps. All you need is a cast iron pan, a steak, kosher salt, pepper, and olive oil. (Okay, a little butter and thyme in this case, too, but that's pretty NBD.)The steak technique is bare bones, concentrating on the stuff that’s important to nail for a perfect piece of red meat. That means salting every side of the steak generously and letting it come to room temperature before you start to cook it. And it means rubbing the steak with just enough olive oil and placing it in a hot, dry cast iron pan instead of pouring oil into the pan. (This reduces the amount of smoke that ends up hanging around your kitchen.) It means basting the steak in brown butter and herbs, and letting it rest before slicing it. The result is a juicy, crispy, pink steak that looks and tastes as you’ve ordered it at a restaurant.And just like you seasoned your steak, you’re going to season everything in this salad. Have you ever been served a salad that just seemed...incomplete? The components were all there, and there was dressing drizzled over it. But it was just missing something? That something was probably salt. Every part of your salad should be seasoned with salt and pepper, and in this salad the tomatoes, cucumbers, avocado, and the lettuce all get seasoned separately throughout the process. This makes the vegetables (which all contain a lot of water) and the avocado (which contains a ton of fat) flavorful and balanced. Always be seasoning. That’s the salad law.Big whisk, big reward.\nPhoto by Heidi's BridgeThen there’s the vinaigrette. You should know how to make a vinaigrette. For the longest time, I did not. I used bottled salad dressing. That’s what I grew up with, and if you use bottled salad dressing now, I won’t judge. But I will say this: The day I decided to start making homemade dressing was one of the better days of my life. Making a vinaigrette is simple, and it will ultimately give you a more balanced sauce for your salad. The shallot vinaigrette we make for this steak salad recipe is a classic, using olive oil, red wine vinegar, dijon mustard, and chopped shallots. And the real takeaway is the art of emulsification. Once you make this dressing, you’ll know that whisking olive oil into your dressing slowly and consistently is what makes a creamy, thick, homogeneous dressing. It’s all about the finesse.So, yeah: whole lot of learning going on over here. I’m not going to pretend like we aren’t taking you to school with this steak salad recipe. But guess what! At the end of class you get to devour a steak with crunchy vegetables and creamy avocado. And you get to say that you nailed it all by yourself. And you'll feel prouder and more satisfied than you ever did with the report cards you brought home as a kid. And you'll have mastered a few kitchen skills that you'll use again and again and again—which is more than anyone ever said about algebra.And here's where all that glorious information lies:Steak Salad with Shallot VinaigretteCrusty, juicy sliced steak + a fully-loaded salad = what we want to eat most nights of the week, TBH.View RecipeExplore Bon AppétitSteakSaladTomatoSalad DressingBasicallyAvocadoVinaigretteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Alex Delany"]}