{"id": "06c476cc0a6ba482e85e9a124822c39c", "url": "https://www.bonappetit.com/story/soy-sauce-desserts", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "How—And Why—You Should Be Adding Soy Sauce to Chocolate Desserts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Added Soy Sauce to My Brownies Out of Desperation—Now I’ll Never Bake a Batch Without ItSoy sauce brings a depth of flavor that salt alone simply can’t replicate.By Stephanie LooMarch 4, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The first time I paged through Hetty McKinnon’s newest cookbook, To Asia, With Love, I paused at her recipe for Flourless Soy Sauce Brownies, immediately intrigued. I had baked with miso in the past but had never considered using soy sauce in sweet applications.To Asia, With Love$43 at AmazonI shelved the idea until coming home late one night from my job, needing to bake brownies for a friend the next morning. After starting my recipe, I reached for my box of Diamond Crystal kosher salt, which I had been meaning to replace for some time, only to find that it was dangerously low. Despite living in the city that never sleeps, there was nowhere I could run out to at 2 a.m. to pick up another box. A light bulb went off in my head: soy sauce! I would substitute soy sauce for salt in the recipe and hope for the best. It could have been a disaster, but the results blew me away. I’ve made countless batches of brownies in my life, but these had a serious depth of flavor and a delicious savoriness that salt can’t achieve on its own.Since that night, I’ve been experimenting with adding a touch of soy sauce to my baked goods in place of salt—it adds an earthy saltiness that I think is perfect, especially paired with chocolate. In desserts where cocoa is an integral flavor (think brownies, chocolate cake, truffles, even chocolate chip cookies), the saltiness from the soy sauce amplifies the chocolate and brings a pleasant umami flavor to the background. Soy sauce also works great in caramel, playing off the flavor of burnt sugar for a next-level salted caramel. In any recipe where you might add a splash of dark liquor or vanilla, try substituting half of the volume with soy sauce.As a general rule for sweet recipes, 1 tsp. kosher salt can be substituted with 2 tsp. soy sauce without adversely affecting the finished product. And don’t worry—your baked goods won’t taste like soy sauce, but they will have an undetectable note that will have people coming back for seconds.My experiments made me wonder why we don’t add soy sauce to more desserts. While savory ingredients like miso and tahini have become increasingly popular in baking in recent years, soy sauce has yet to gain such traction. As someone who’s known to have a heavy hand when a recipe calls for a “pinch” of salt, I’m always drawn to baked goods with a pleasant savory taste—and the addition of soy sauce makes perfect sense. In the introduction to her book, McKinnon writes that the “secret to tasty food is umami.” It follows, then, that soy sauce, one of the most direct sources of umami, makes foods—including desserts—tastier. It simply offers what salt cannot.Since that late-night baking session, soy sauce has become my secret pantry-item weapon for providing a complex depth of flavor to otherwise-classic recipes. And now I’ll never make brownies without it.Splash of soyCocoa BrowniesView RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-04", "author": ["Condé Nast", "Stephanie Loo"]}