{"id": "06cc08e606bebce6dffd3aa4e0e9df47", "url": "https://www.bonappetit.com/recipe/brothy-pasta-with-chickpeas", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Brothy Pasta with Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrothy Pasta With ChickpeasBy Andy Baraghani and Chris MoroccoMarch 15, 20194.7(180)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintIf you don't have a can of tomatoes, tomato paste will work just fine. Cook a couple of tablespoons in a small skillet alongside the chickpeas until it darkens before adding to the chickpeas and proceeding with the recipe.Ingredients2 servings3Tbsp. extra-virgin olive oil, plus more for drizzling1small onion, finely choppedKosher salt3garlic cloves, thinly sliced1sprig rosemary¼tsp. crushed red pepper flakes115-oz. can chickpeas, drained, rinsed1cup whole peeled tomatoes, crushed by hand6oz. orecchiette or other short pasta2Tbsp. finely chopped parsley3Tbsp. finely grated Parmesan, plus more for servingFreshly ground black pepperPreparationStep 1Heat 3 Tbsp. oil in a large saucepan over medium. Add onion and season with salt. Cook, stirring occasionally, until onion is beginning to soften, about 5 minutes. Add garlic and continue to cook, stirring occasionally, until onion and garlic are both very soft and just beginning to brown around the edges, 5–6 minutes longer. Add rosemary and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Add chickpeas and tomatoes and cook, stirring occasionally, until tomatoes are slightly thickened, 6–8 minutes.Step 2Add pasta and 4 cups water. Increase heat to medium-high, bring to a simmer, and cook, stirring occasionally to prevent pasta from sticking, until pasta is al dente, 13–16 minutes depending on shape. Stir in parsley and 3 Tbsp. Parmesan; season with salt.Step 3Divide brothy pasta between bowls. Drizzle with more oil and top with Parmesan and black pepper.How would you rate Brothy Pasta With Chickpeas?Leave a ReviewTell us what you thinkReviews (106)Back to TopTriangleMy family really enjoyed this dish. I used no chicken Better than Bouillon Base instead of water. I didn't have fresh rosemary or parsley on hand so instead, I used dried Italian seasoning. The noodles did absorb the broth so after reading all these comments, I know for next time to cook the noodles separately and add them to the bowl. This will be a dish we have over and over. Note: everyone in my family are meat-eaters (besides me) and didn't even miss that at all!Melissa JLos Angeles, CA2/9/2022My husband raved about this recipe - I honestly don’t think he’s ever had so many good things to say about a dish. Guess I’ll add it to the rotation! The only change I made was to use 2 cups of chicken broth and 2 cups of water. I used rigatoni and it took a bit longer than expected to cook, but a little patience is all we needed!AnonymousDenver, CO1/26/2022I found this while scrolling through the BA chickpea collection. I used dry chickpeas from the local CSA, soaked overnight and boiled, and San Marzano tomatoes from a can instead of fresh. This is now my favorite vegetarian meal. Just the right amount of flavor and complexity to make it a perfect meal for kids and adults alike. I do not think the Parmesan is really necessary if one wants to avoid milk products.  Michael Liberty Lake, WA1/22/2022\\this recipe is a huge family favourite, easy, high in flavour and economical!!!Colleen SimpsonSt. John's, Newfoundland Canada1/20/2022This is delicious and pantry-friendly! My 2-year old loved as well. Cooked a big batch of chickpeas and it was perfect use for some of them. Great for lunch leftovers, although the pasta does soak up the broth and soften as it sits. So if you're planning on eating over multiple days, you may want to consider cooking + storing the pasta separately, in that case. We added some chopped chicken sausage during onion/garlic stage, and a few handfuls of spinach just before serving. I always add extra red pepper flakes to mine!SammiSeattle, WA1/18/2022Awesome dish that will become a staple - used what I had on hand because I wanted to make a quick meal. Didn’t have canned tomatoes so I used the tomato paste tip, dry rosemary because I didn’t have fresh and didn’t have parsley. I boosted the red pepper flakes, added a tiny splash of soy sauce maybe a teaspoon and a half, and about 3 tbsp of nutritional yeast instead of parmesan only because it was handy and easy and not  because I wanted to make it vegan intentionally. Didn’t have small pasta so broke spaghetti noodles in thirds. All those adjustments and this was so delicious - can’t wait to make it again!AngieLos Angeles 8/23/2021The only change I made to the recipe was to use black beans instead of chickpeas. It was very tasty, quick and easy. A great weekday meal with a salad on the side.\nBevMontreal7/26/2021At first, I was disappointed with this dish and I wasn't looking forward to the leftovers. But those leftovers were fantastic! I highly recommend letting this dish sit in the fridge overnight and reheating. The flavors really come together. I used dry chickpeas and instead of the water, I used the bean broth from the chickpeas (chicken stock with 1/2 lemon, bay leaf, and a serrano pepper). Also, this was easily 3 servings for me and could have been 4 with a side dish. AlyssaPhiladelphia, PA7/13/2021This is good.  It's super delicious if you use the chickpeas and broth from BA's best chickpea recipe.  I usually double the recipe.  I usually cook the pasta separately because I like the dish more brothy and the noodles less soft, but it's good as written.  KristineSanta Clarita, CA7/10/2021Love love this dish😋😋🍽🍽🍽.  I make it often. AnonymousCanada5/14/2021I absolutely loved this dish.  I used Rancho Gordo garbanzo beans and add a vegan bouillon to the water. Served with parm, a drizzle of olive oil and black pepper Cierra N. Georgia4/29/2021Fabulous and ridiculously simple meal to put together.  I used no salt in this recipe whatsoever, and subbed the water with Low-Sodium Chicken broth. All prepped hours in advance other than dropping in the Orecchiette.  This satisfying tweak on Minnestrone serves 3 easily!ChefJeffSherman Oaks, Californa4/26/2021Fast, easy, delicious! I made a few changes, half the water substituted with chicken broth, basil instead of rosemary, used Mini Farfalle and added 2 tablespoons of tomato paste.Mary AnnShelton, CT4/12/2021Really enjoyed this! I made it vegan by omitting the Parmesan cheese. To make up for this lack of salt, I used veggie broth in place of the water and also added about 1.5 tbsp of minced capers at the same time as the tomatoes. I used basil instead of the rosemary and parsley, and also stirred in some finely chopped kale at the end too. I recommend watching the recipe video for some other helpful tricks like mashing some of the chickpeas! Will be making again!KatVancouver 3/1/2021I quadrupled this for our 7 person household but didn't put quite as much water in, 12 cups was plenty. Lots of leftovers so definitely a generous recipe! This is a good basic recipe for a weeknight meal, a simpler and faster version of a Pasta e Fagioli, I love Carla's recipe for that and would recommend making that if you have more time SiiriLondon, UK2/1/2021Explore Bon AppétitPastaSoupSoups and StewsChickpeaBeanVegetableCanned TomatoTomatoOrecchiettePasta & NoodlesQuickEasyOne-Pot MealsWeeknight MealsMainVegetarianNut-FreeHealthyishSautéSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Andy Baraghani", "Chris Morocco"]}