{"id": "06da8dbf7bc5027a96f9275516e2a7c2", "url": "https://www.bonappetit.com/recipe/brothy-noodle-bowl-with-mushrooms-and-chiles", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Brothy Noodle Bowl with Mushrooms and Chiles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrothy Noodle Bowl with Mushrooms and ChilesBy Alison CarrollMarch 12, 20183.5(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Molly Baz, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintAlison Carroll, who developed this recipe, relies almost entirely on dry pantry staples to build depth of flavor in this superfood broth. Feel free to swap out the vermicelli for your favorite cooked grain or a different noodle—the recipe is designed to be customizable.Ingredients2 servingsDashi6dried shiitake mushrooms11\" piece ginger, peeled, finely grated1dried chile de árbol, broken in half3garlic cloves, smashed½oz. dried kombu (about ½ sheet)½tsp. ground turmeric or 1\" piece fresh turmeric, peeled, finely grated1Tbsp. white miso paste2tsp. low-sodium soy sauceKosher saltNoodles and Assembly2Tbsp. extra-virgin olive oil6oz. fresh shiitake mushrooms, stems removed, thinly sliced1small garlic cloveKosher salt4oz. rice vermicelli noodles2radishes, thinly sliced1cup mixed herbs, such as shiso, Thai basil, cilantro, and/or mint¼cup fermented vegetables, such as kimchiToasted sesame seeds, hot sauce, and toasted sesame oil (for serving)PreparationDashiStep 1Combine mushrooms, ginger, chile, garlic, kombu, turmeric, and 4½ cups water in a medium saucepan. Bring to a simmer over medium-high heat, cover, then reduce heat to very low and cook 25 minutes to infuse broth. Strain dashi through a fine-mesh sieve into a large bowl; discard solids. Wipe out pot, pour dashi back in, and bring to a simmer.Step 2Mix miso paste and 1 Tbsp. broth with a spoon or fork in a small bowl to loosen miso. Stir miso mixture and soy sauce into broth; season with salt. Keep hot.Step 3Do Ahead: Dashi can be made 2 days ahead. Let cool, then transfer to an airtight container and chill.Noodles and AssemblyStep 4Heat olive oil in a medium skillet over medium-high. Add mushrooms and cook, stirring occasionally, until golden brown and beginning to crisp, about 5 minutes. Remove pan from heat, grate garlic over mushrooms, and stir to combine (garlic will cook in residual heat of mushrooms). Season with salt.Step 5Drop vermicelli into very hot dashi broth. Cover and let sit 3 minutes (or cook according to package directions).Step 6Divide noodles and dashi between bowls. Top with mushrooms, radishes, herbs, fermented vegetables, and sesame seeds. Drizzle with hot sauce and sesame oil before serving.How would you rate Brothy Noodle Bowl with Mushrooms and Chiles?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleMy daughter enjoyed this. Added a bit of soy sauce at the end instead of hot sauce. RebeccaNew York City3/6/2021The soup was good  but definitely would sub a different noodle for the rice vermicelli. The rice noodle didn’t absorb the broth well. Maybe a soba or udon or wheat noodle. Amy S. Santa Monica CA12/12/2020Explore Bon AppétitRice and Grain BowlSoupSoups and StewsNoodlePasta & NoodlesShiitake MushroomMushroomVegetableRice NoodleMainDairy-FreeVeganVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Alison Carroll"]}