{"id": "06e4de7d7338048183454a8d2daa37ea", "url": "https://www.bonappetit.com/recipe/creamed-green-mushroom-and-corn-slab-pie", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Creamed Green, Mushroom, & Corn Slab Pie Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesCreamed Green, Mushroom, & Corn Slab PieFacebookPinterestTwitterEmail6 - 8 servingsActive Time: 25 minTotal Time: 120 minA classic crowd-pleasing side, creamed greens, is transformed into a meal in this savory pie. Cream of Mushroom Soup binds the filling and adds a boost of flavor without adding tons of ingredients and time. Serve with a side salad for breakfast, lunch, or dinner.PrintIngredientsThe Dish2 tablespoons extra virgin olive oil3 leeks, white and light green parts only, halved lengthwise, thinly sliced and washed well (4 cups)1 teaspoon red chili flakes1 pound kale, stems removed and leaves torn into 2-inch pieces (6 packed cups)1 pound collared greens, stems removed and leaves torn into 2-inch pieces (6 packed cups)1/2 cup white wine1 can (10 1/2-ounce) Campbell's Condensed Cream of Mushroom Soup1 10-ounce bag frozen corn, thawedKosher salt and freshly ground pepper1 recipe homemade pie crust, recipe follows1 large egg, beatenFlaky sea salt, for sprinklingThe Pie Crust2 1/2 cups unbleached all-purpose flour1 tsp. kosher salt1 cup (2 sticks) unsalted butter, chilled and cut into small pieces1/2 cup ice waterRecipe PreparationThe DishIn a large high-sided skillet, heat the oil over medium-high. Add leeks and red chili flakes and cook, stirring occasionally, until onion is softened, about 8 minutes.By the handful, add the kale and collard greens, stirring after each addition, until the greens start to wilt before adding the next. Add wine, cover and cook, stirring occasionally, until greens are just tender, about 8 minutes. Remove from heat and transfer to a colander. Let cool slightly.Using your hands, squeeze as much excess liquid as possible from greens and transfer to a large bowl. Stir in cream of mushroom soup and corn; season with salt and pepper.Preheat oven to 400°. On a lightly floured surface, roll out each piece of dough to a 14-by-10-inch rectangle. Slide one piece of dough onto a parchment paper lined baking sheet and scatter the greens mixture over the dough, leaving a 1-inch border. Place second piece of dough on top. Brush away any excess flour. Seal and crimp edges. Cut several slits in top. Freeze for 30 minutes.Brush pie with egg wash and sprinkle with sea salt. Bake, until golden and crisp, about 1 hour. Cut into slices and serve warm or at room temperature.The Pie CrustActive Time: 10 minutes\nTotal Time: 1 hour 10 minutesIn a food processor, pulse flour and salt until just combined. Add butter, and pulse until mixture resembles coarse meal, about 10 seconds.Add ¼ cup of ice water and pulse until dough just holds together. Test by squeezing a small amount together: If crumbly, add more ice water, 1 tablespoon at a time.Divide dough into two equal balls. Wrap each ball in plastic and flatten into rectangular discs. Refrigerate until cold, at least 1 hour.Recipe by Campbell'sReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}