{"id": "06e41f55571f507117c1e77ff031d82c", "url": "https://www.bonappetit.com/story/how-do-i-learn-to-live-alone", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "How Do I Learn to Live Alone? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Do I Learn to Live Alone?Is it just me or have weeks become decades?By Amanda ShapiroApril 2, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last week, I wrote about the emotional extremes that a lot of us have been going through. Since then, I feel like everything has changed. (Is it just me or have weeks become decades?) The virus, which we’ve watched like a tsunami building off the coast, is cresting. Places like New York are already in it. Meanwhile, the adrenaline surges that got us through this first transition—to WFH life, to social isolation—are fizzling out, and we’re hitting walls of exhaustion, grief, numbness, and malaise. I’ve checked off pretty much all of the above.It feels important to name it: What we’re going through is a collective, long-term trauma. Most of us have never experienced something like this first-hand. Even though I compared it to a tsunami earlier, the virus is not a natural disaster, nor is it a human-made catastrophe like 9/11. Those are acute traumas: when they happen, our fight-or-flight instincts kick in to protect us, then there’s an aftermath. We process and grieve; we recover and rebuild.What’s happening now is like a war. We’re talking about our hospitals as “the front lines,” because they are. But we’re all in this war, whether you’re in an ICU or on your couch. The threat is physical (the virus) and it’s psychological (our fear of the virus), and it’s not going away any time soon. My friend Claire sent me this episode of Brené Brown’s podcast the other day, and in it she warns that the fear of collapse will become the actual collapse unless we change our mindsets now.But what does that look like?To be honest, I don’t know. I’m trying to figure out how to take care of myself and others, how to be alone right now. One thing I think will be crucial over the next weeks and months is information. Not the kind that you get at 2 a.m. in a panicked fog while scrolling Twitter. I mean the kind of rational, supportive information that friends are sharing in email and text threads, on phone calls, and, sure, on Twitter. Like that podcast episode I just mentioned, this thread from a nurse, this video from an ER doctor, and this text from a friend when I was freaking out the other day:Of course...find a place to sit quietly.\nThink of 5 things to touch\n4 things to smell\n3 things to focus on (sight)\n2 things to taste\n1 thing to hear...quiet music, spa or water soundsYou can change any of these to fit your needs best. It's all about bringing yourself back to comfort.Call me whenever you can talk.Yesterday, in the spirit of information-sharing and connection, we launched The Healthyish Guide to Being Alone. It’s a month-long series meant to provide info and support (and laughs), and it’s for everyone, whether you’re shacked up with the in-laws or a partner or a whole lot of plants. It kicks off with a new advice column from Andy Baraghani, in which he answers a reader’s question: How do I learn to live alone in the middle of a pandemic? There’s also some true confessions from our staff about the Secret Single Cooking we do when no one’s home. A lot more will come—recipes, essays, distractions, and tips for getting through the tough time ahead.I hope you stay with us. We’ll be here for you.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishSelf CareCoronavirusHealthyish NewsletteressayRead MoreLifestyleBliss and FearBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Amanda Shapiro"]}