{"id": "06ff8add8cc7abf30fa6227d07f9af54", "url": "https://www.bonappetit.com/recipe/winter-greens-laing", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Winter Greens Laing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueWinter Greens LaingBy Melissa MirandaFebruary 9, 20214.6(24)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintUse whatever sturdy greens you have on hand to create this simple but satisfying side that pairs well with this Oven-Roasted Chicken Adobo and Garlic Fried Rice from Melissa Miranda, the chef-owner of Seattle’s Musang, a Filipinx community space and restaurant.Ingredients4 servings¼cup vegetable oil10garlic cloves, smashed, coarsely chopped1½\" piece peeled ginger, thinly sliced1large onion, thinly slicedJohnny’s seasoning salt or kosher saltFreshly ground black pepper (optional)2Tbsp. sautéed shrimp paste (preferably Barrio Fiesta ginisang bagoong)1bunch collard greens, ribs and stems removed, leaves chopped1bunch rainbow Swiss chard, trimmed, ribs and stems removed and chopped, leaves torn1bunch Tuscan kale, ribs and stems removed, leaves chopped113.5-oz. can unsweetened coconut milk5–8red Thai chiles, thinly sliced, plus more for serving if desired2Tbsp. unseasoned rice vinegarPreparationStep 1Heat oil in a large Dutch oven or other heavy pot over medium-high. Add garlic and ginger; cook, stirring, until golden, about 1 minute. Add onion, season with seasoning salt (or kosher salt and pepper), and cook, stirring often, until onion is translucent, about 3 minutes. Add shrimp paste; cook, stirring, until slightly darkened, about 2 minutes.Step 2Add collard greens and Swiss chard ribs and stems to pot and cook, stirring, until wilted and beginning to soften, about 3 minutes. Add kale and Swiss chard leaves; cook, stirring, until wilted, about 3 minutes. Continue to cook until all greens are tender, about 4 minutes more. Add coconut milk and 5–8 chiles, depending on how spicy your chiles are and your heat preference. Increase heat to high; bring to a boil. Reduce heat and simmer until laing is thickened and flavors have come together, 8–10 minutes. Stir in vinegar; season with seasoning salt (or kosher salt and pepper) if needed.Step 3Serve laing topped with more sliced chiles if desired.How would you rate Winter Greens Laing?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is great. Didn't use collards, just used more kale and chard to make up for them. My husband is allergic to shellfish so I subbed in a combo of Vegemite and fish sauce for the shrimp paste. Awesome side dishKatieChattanooga, TN2/10/2022Yummy! It was hard to gauge how big of a “bunch” to use for each green- I ended up using about half the gigantic bunch of kale. My supermarket is limited so I couldn’t get collards or the right chiles, but I subbed broccoli rabe for the collards and they worked well (did a quick blanch to make less bitter). As someone else mentioned, I was nervous about adding some many chiles (I used 1/2 a poblano and 2 jalapeños) and had to add in more jalapeños later to get more kick.MargotHollis, ME5/2/2021Made these greens to go with the adobo chicken and garlic rice, as shown in the magazine.  Delicious!  I will say, this is easily more like 8 servings, not 4 - but the leftovers were great too.  I went ahead and used all 8 peppers in the sauté, but squeezed the seeds out of most so my 10 year old wouldn't think it was too hot.  Turned out perfectly.  Glad I stopped at a specialty Asian market for the sautéed shrimp paste, as it added a huge depth of flavor to a simple dish.  Definitely will do again!LBinTXTexas3/25/2021I'm amazed at how such a simple recipe can have such exquisite depth of flavor. And uses all of those greens! It's so tasty you forget how healthy you're being. Great paired with jasmine rice. I was afraid of all those chiles so I only used one, but it wasn't spicy at all so next time I'll be braver and try a few more. GemMaryland3/7/2021Explore Bon AppétitFilipinoSoutheast AsianAsianLeafy GreensVegetableCoconut MilkOther IngredientsWinterEasyQuickWeeknight MealsSideDairy-FreeGluten-FreeHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}