{"id": "07027c61b2ef51ed10007cd725796a88", "url": "https://www.bonappetit.com/story/dining-blind-salamander-rv-park", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Dining and Dreaming at the Blind Salamander RV Park | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDining and Dreaming at the Blind Salamander RV ParkAmid the stress and isolation of the last year, I found solace in memories of my RV days.By Kaci NevesJune 7, 2021FacebookTwitterEmailIllustration by Ariel LeeFacebookTwitterEmailI stood at the kitchen sink scraping peanut butter off a spoon with my teeth. The idea of cooking an actual meal was enough to make my limbs go leaden. So my family survived on what we scooped out of jars or unearthed from the freezer’s icy crust.It was November, and in anticipation of the next disaster declaration, we let the news pipe into our living room at all hours. A stone-faced anchor rattled off COVID-19 statistics. Nanny, my husband Preston’s 91-year-old grandmother, interrogated the TV. “Now just what in the holy hell is happening?” she asked.Nanny suffered from Alzheimer’s, and this question burbled up often. When the pandemic hit, when she noticed everyone wearing face masks, when our groceries arrived at the door in boxes, when the death toll climbed—again and again, she wondered what was happening. Preston and I never came up with a good answer. “There’s a virus going around, like the flu, but worse,” we’d say.Because finding Nanny a safe nursing facility mid-pandemic was impossible, she’d moved in with us—indefinitely. We all adjusted to new routines. Work Zoom meetings were followed by denture scrubbing. Then we disinfected surfaces, answered emails, and puttered around the neighborhood with Nanny in her wheelchair. And when we climbed to the tops of particularly loathsome hills, we whooped at each other like excited geese.Six months in, though, I couldn’t help but feel swallowed up. I’d transformed from a carefree 31-year-old to a full-time caregiver combating infectious disease. Some days I wanted to bolt. Or crumple to the floor and let jagged, snotty sobs shake out of me. But I figured these responses would only amplify Nanny’s bewilderment.So instead, after all the responsibilities (aside from cooking) were done, I retreated to my small lonely space at the kitchen sink, stared out the window, and studied a creek flowing in our backyard, looking for a way to feel normal. That evening I thought about our lives seven years earlier, at the Blind Salamander RV Park—a dusty patch of Texas land, dotted with ancient pecans along the San Marcos River. Back then we were in our early 20s, not ready to become corporate cogs, eager for at least one more grand adventure. So we moved into a leaky 26-foot camper and enrolled ourselves at a nearby college.We didn’t cook much in the RV, either, but for practical reasons. Our oven was child-size, akin to the Easy Bake variety, with a temperamental pilot light. For Preston’s 25th birthday, I made a rum cake. It took three hours to bake and came out of the Bundt pan in gelatinous, boozy chunks. We ate with our hands, giggling through each bite. But privately, I noticed an anxious hum in my brain.I’d left a full-size apartment and a reliable job for a tin-can home with a hardly functioning oven. Why? Right now it was just the cake that was falling apart. But what if I never finished school, never got another job? I could practically hear the whisper of self-doubt—a silvery voice that said, “You’ll never make it here.”I was spiraling. The park’s groundskeeper, Eddie, noticed me frowning in a lawn chair at the helm of our RV. When I described my cake failure to him, he slapped my shoulder and said, with a no-big-deal rhythm, “Come by tonight. Richard’s grilling.”So at dusk Preston and I walked a short dirt path to Eddie’s trailer. Outside, a few park residents lounged on tailgates—unhinged and scratched to hell from hauling kayaks. Richard, a tattoo artist in his 40s, manned the grill. He smoked everything over split mesquite. Until that moment I didn’t realize wood had a fragrance, a flavor.Preston scooted into the circle of neighbors effortlessly, eyes glittering as he gestured the shape of a story, beer can in hand. Beside me, Richard’s wife, Argie, sprinkled Tajin on the rim of her cup and prepared a Michelada. Maybe she sensed my lingering anxiety because she filled the space between us with talk. The hum in my mind quieted as she described working at the job corps disciplining teens and how she helped Richard with his side hustle spinning records at weddings and barn parties.I mixed a jug of hurricanes and the group talked about JFK conspiracy theories (he isn’t really dead, is he?) and whether Big Red was a viable mixer for Malibu Rum, and which tattoos we wanted Richard to give us (a river, a rose, a cat gazing out a window). And we drank until the jug emptied.Selena played in the background, and soon Argie was teaching us to dance cumbia. The flower tattoos on her calves blurred into a pattern I scrambled to follow. I swung my hips in wobbly circles, my feet making divots in the dirt. Finally, I found the steps. A smile cracked me open, and for the rest of the song, I floated.When the chicken was ready, we pulled each piece apart with our hands, the red pepper and oregano and garlic melting in our mouths, brightening our palates. We ate the hot dogs without buns, along with fiery chiles pequin from Richard’s garden. Our mouths flamed green then orange then red. We licked the grease from our fingers and the paper plates, too. We ate until we finished every last bit of meat, because it would’ve been a sin to leave a pork chop cold and lonely on the racks. With our stomachs full, Preston and I headed back to the RV and fell into a velvet, dreamless sleep.We rejoined our neighbors by the grill every weekend for two years. Together, we saw 100 sunsets bloom over a nearby wheat field. We emptied Lone Star tall boys with newcomers and old timers. We danced badly, but we still danced.Nearly a decade later, my life had not assumed the downward trend I’d imagined. Preston and I eventually married, said goodbye to our friends at the park, and moved into a house with a fully functioning oven. But I was missing something—the very essence that gave The Blind Salamander its collective pulse. I needed to connect with my circle, even if that circle had dwindled to just Preston, Nanny, and me. We needed a space to be together, not out of obligation but joy—perhaps now more than ever.Suddenly, I had the urge to get out of the house, out of my head, down to the fire, into the moment. So we decided to grill. Even if it was chilly, even if cooking food outside would take four times longer. Nanny’s arthritic hand slid into mine as we stepped down the patio stairs. We watched Preston’s axe split chunks of pecan that landed on the patio with a satisfying clatter. He stacked the wood into the belly of the grill, lit a match, and puffed at the tiny orange flame, coaxing it larger until smoke rose and clung to our hair and sweaters. We put on the music. The flames sizzled mounds of ground chuck. We scooted our chairs closer to the warmth of the fire. Then we ate with our hands, licking the grease from our fingers. And when we finished, I slid out of my chair, took Preston’s hands, and together we recalled how to cumbia.Explore Bon AppétitFirst PersonTravelCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-07", "author": ["Condé Nast", "Kaci Neves"]}