{"id": "0702e7b6e9f9768a292cda8164cde9ec", "url": "https://www.bonappetit.com/recipe/braised-short-ribs-with-squash-and-chile", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Braised Short Ribs With Squash and Chile Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueBraised Short Ribs With Squash and ChileBy Andy BaraghaniAugust 13, 20194.0(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintMake this when it’s Sunday and you’re not leaving the house. One spoonful of this smoky-spicy guajillo braising liquid and you’ll understand how complex dried chiles can be. When soaked in hot water and blended with aromatics, they create a base so flavorful you don’t even need stock. The chile purée may seem like a lot of liquid at first, but don't worry: Keeping the pot slightly uncovered as the ribs cook will allow the sauce to reduce and concentrate.Ingredients4 servings2½lb. 2\"-thick cross-cut bone-in short ribs (flanken style), cut into 2x2\" piecesKosher salt2dried guajillo or ancho chiles, seeds removed1large onion, sliced into ½\"-thick rounds5garlic cloves, unpeeled1tsp. crushed red pepper flakes1tsp. ground coriander1tsp. ground cumin½tsp. ground cinnamon3Tbsp. vegetable oil, divided2Tbsp. tomato paste½acorn squash (about 1 lb.), seeds removed, sliced lengthwise into 1\"-thick wedgesPlain whole-milk Greek yogurt, cilantro sprigs, and lime wedges (for serving)PreparationStep 1Season ribs with salt. Let sit at room temperature 1 hour, or chill, uncovered, up to 12 hours. If chilling, let sit at room temperature 1 hour before cooking.Step 2Meanwhile, place chiles and 5 cups hot water in a blender and let sit while you prep onion and garlic.Step 3Heat broiler. Broil onion and garlic on a rimmed baking sheet, undisturbed, until charred on top (don’t worry if they get super dark), 8–10 minutes.Step 4Pop garlic out of their skins and place garlic, onion, red pepper flakes, coriander, cumin, and cinnamon in blender with chiles. Blend until smooth but still speckled with chiles; season purée lightly with salt. Set aside.Step 5Heat 2 Tbsp. oil in a medium heavy pot over medium-high. Working in 2 batches, cook ribs, turning occasionally and reducing heat if needed, until browned all over, 10–12 minutes per batch. Transfer to a plate.Step 6Carefully pour off oil and wipe out pot. Pour remaining 1 Tbsp. oil into pot and place back over medium-high heat. Add tomato paste and cook, stirring often, until tomato paste begins to separate and stick to pot, about 3 minutes. Stir in chile purée. Return ribs to pot and bring liquid to a simmer. Partially cover pot and cook, reducing heat to low to maintain a very gentle simmer, turning ribs occasionally, and skimming any excess fat from surface, until meat is very tender, 3–3½ hours. (Make sure there's a gap between lid and pot so liquid can reduce.)Step 7Add squash to pot and push down so it’s mostly submerged. Bring to a simmer and cook, uncovered, until squash is tender and liquid is thickened, 18–20 minutes. If squash and meat become tender but liquid isn't thickened, transfer squash and meat to a plate and continue to cook until liquid has reached the desired saucy consistency.Step 8Serve ribs and squash, topped with yogurt and cilantro, with lime wedges.Step 9Do Ahead: Ribs (without toppings) can be made 3 days ahead. Cover and chill.How would you rate Braised Short Ribs With Squash and Chile?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIts 5 cups so you can crack the lid. AnonymousUsa10/26/2020This was really really good. The flavors meld together really well and it was just a really tasty and really satisfying dish. I didn’t have yogurt so topped with a little feta cheese which did the trick. adamleclairOsaka, Japan 6/6/2020I had to make a few adjustments but it was really good! I couldn't find ancho chile's so I used  2tsp ancho powder. I baked ribs at 425 for 20min then reduced oven to 325 and baked for one hour covered and an additional hour, uncovered (following a previous Ina recipe). Removed meat from bones and set on pan while I cooked squash on top of stove. Then added ribs back in.  The yogurt and cilantro are nice touch. Although sauce did reduce and thicken some, I will use less water next time.AnonymousWisconsin5/31/2020This is very good, but...    for the cost of spare ribs (about $7/serving for moderate portions) I have more incredible recipes to use them in.  If I make this again, I might try a different cut of meat. Also, the squash is really just a nice vegetable accompaniment, not integral to the flavor of the dish.   That said, it makes a delicious, flavorful spare rib, and I liked learning the method of making the wet, seemingly weak braising liquid which actually cooks down to a perfect sauce.   Regarding spare ribs: I've found that, using boneless spare ribs, you need about 3/4 - 1 pound of meat per person.  It would be more with bone-in ribs.  The ribs cook down soooo much, but of course are an amazing meat once cooked.Jeremy FrettsAlexandria, VA3/29/2020This was good, but not outstanding to me. I felt the sauce was a little \"one-note\".Winnetka, IL12/20/2019should be 5 starsAnonymousvancouver bc11/10/2019Great recipe .Used 5 cups water plus added more potato water to thin out sauce. I am visiting the south west (from Vancouver BC) and each time I'm here try different ways to use chilies which are so plentiful in Az. Incredible flavor with so few ingredients. Used a stick blender (which I travel with) so didn't get sauce as smooth as a normal blender .Also I removed ribs when done and put sauce in fridge overnight so i could skim fat off the top .Trying to decided to go with pasta ,mashed potato or polenta .Decisions ,decisionssockeyeVancouver BC (visiting Tucson)11/10/2019This is a great recipe, a lot of flavor! I was worried after seeing people question the amount of water used, but it really does use all that water (and more when you add the squash). The 3+ hour of simmering really boils down the water into a delicious sauce. I did add a little more of each spice than it called for because we like bold flavor, but didn't deviate more than a tsp. here and there. It surprised me how expensive short-ribs were at my grocery store, so the next time I make it I will likely try an alternative cut. AnonymousOakland, CA9/30/2019I made this recipe yesterday and it was amazing.  I used 5 cups of water as it is written in the recipe.  I needed to add about 1/2 cup of water at the end so I could cook the squash.  This recipe is company worthy!!  \nAnonymousReno 9/23/2019Fantastic, 5 cups is correct, made it exactly as written and it was a huge hit.DrewLCPittsburgh9/20/2019The 5 cups of liquid is correct. Mine cooked down quite thick - I had to add a bit more liquid when adding in the squash. I really loved this braising liquid - would have never thought to put it together this way. Really flavorful!!daphnesmomNorCal9/20/2019Okay you guys I think I can shed some light on the water.  I made this yesterday using only 2 ounces of water.  And guess what - totally awesome and I'll make it again!  One other note - I used a cut that Whole Foods and Costco sells called boneless chuck short ribs.  They release a lot of moisture when cooking.  Been I while since I used bone-in but I recall they release quite a bit of moisture as well.  However, these boneless ones are not as greasy as bone-in.  I cut the meat into approximately 2-inch pieces for cooking, and toward the end, I removed them and thickened the liquid with a flour paste, then put the meat back in for finishing.  And I skipped the squash.  Blech.\n\nTry it.  Really.  Surely that 5 cups this calls for is some kind of mistake.  Between that and the liquid released by the meat (squash too if you include it), you'd have a pot of soup!TommyA2010Midwest9/9/2019I won't make this recipe the first time!  Without clarification re the 5 cups of water (!), I see no point in proceeding!!Anonymous770259/8/2019Can we get a clarification on the 5 cups of water? Shouldn't that water be drained off at some point? The water is just for rehydrating the chiles, right? Also, a video of Andy making this would be super helpful. ThanksAnonymousLos Angeles, CA9/7/2019@Anonymous 5 cups water (even 2.5) plus the liquid that comes out of the meat?  That's insane.  Braising calls for only a small amount of liquid.Anonymous9/7/2019Explore Bon AppétitRibsShort RibBeefMeatAcorn SquashSquashVegetableAncho ChileChileFallWinterMainGluten-FreeNut-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Andy Baraghani"]}