{"id": "070372bc0ec1aa89619ba4a3df9cc187", "url": "https://www.bonappetit.com/story/roast-beef-sandwich-spread", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "The Roast Beef Sandwich Recipe That Makes the Best Holiday Feast  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Big Holiday Dinner Should Be a Roast Beef Sandwich SpreadEnough with the stuffy platters and “pass the potatoes” formality. Let’s eat this rosemary-garlic roast beef on buns and party!By Alex BeggsDecember 17, 2018FacebookTwitterEmailPHOTO BY ALEX LAU, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIFacebookTwitterEmailI remember feeling very confused as a child—most of the time, all of the time—but especially at the end of How the Grinch Stole Christmas!, when the Grinch turns his attitude around and serves every Who in Whoville a slice of “roast beast.” The cartoon roast looked delicious, with its browned edges and pink inside. But how would it feed all the Whos? I wondered. What is roast beast? I wondered. Then I dreamed, as little girls do, about a fat slice of roast beast being handed to me by a smug man with four furry fingers.I assumed it was roast beef, for obvious reasons, but on closer inspection, it’s gotta be a ham or a roast goose. Food director Carla Lalli Music confirms the goose theories. Well that’s not gonna feed all the Whos in Whoville (a.k.a. the eight people I call my friends)! To recreate this scene properly, and to feed a crowd this holiday, the best meat for the job is really a huge hunk of roast beef. Specifically, this garlic-rosemary slow roast beef by Chris Morocco.You start with a 4-lb. New York strip roast, which I picked up from a butcher who had the gall to charge me $130 for it. “But it’s Christmassss!” I said with a Cindy Lou pout. “No shit,” he replied with a bloody thwack to the cutting board. “Ok-ay.” I swiped that credit card.The only thing elaborate about Chris’s recipe is the quality of that hunk of meat, the sheer size of the lad. The rest is pretty simple. A day before roasting, I seasoned it with salt and pep and rubbed it with a garlic-rosemary-oil mixture that made my kitchen smell incredible. The next day, the beast went into the oven at a mere 200° for almost three hours. Low and slow is the name of the game. During that time I made a nice salad dressing, bought some Martin’s potato buns, whipped up the horseradish sour cream, and read a novel’s worth of cheesecake recipe reviews by strangers on the internet, searching for truth. (I landed on Craig Claiborne’s, if you’re curious. It came out rich and dense; you could carve “David” from it.)By the time the was beef was resting, my friends had arrived for cocktails and a little activity we call Lookit The Meat!, where you stand around the kitchen looking at that huge roast. Mingle mingle, kris and kringle, and then when it was about time to feast, I browned the roast in the biggest Dutch oven I own (Lodge’s 7.5 quart), a couple minutes per side.DINNER TIME. Cue the Grinch-style slicing at the cutting board. Big knife, big grin, but thin slices, ideally. It was just like the cartoon, it has to be said: The beef was bright pink inside, and a general joy to behold, and the rosemary-garlic crust was deeply browned and crispy. Around the table, we loaded the sliced beef on soft buns with a slathering of horseradish cream, some mustard, and cornichons. Unlike Thanksgiving or other roast beast feasts, this isn’t a “pass the mashed potatoes, papa,” formal dinner. It’s a construction zone. Spoons stuck in mustard pots, rolls flying across the table. You get to be yourself. Load up the sandwich with four cornichons, sliced perfectly in half.The luxury of the roast beef still makes it a special occasion, but a festive one. And you eat with your hands! There’s no other way. The assembly of a roast beef sandwich is like trimming your best friend’s show-offy 8-foot tree, or holding the rickety ladder as your awkward step-brother outlines the house in lights, or sloppily decorating sugar cookies with your 14 cousins. It’s about forced interaction with those you love—even if it gets a little messy sometimes.Get the recipe:Slow Roast BeefWe've adapted the classic roast into a buffet-style, serve-yourself dish, with options: Make a sandwich (with cornichons and horseradish sauce), or eat it up as distinct components if that's more your thing.View RecipeExplore Bon Appétitholiday2018Roast BeefDinnerEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-17", "author": ["Condé Nast", "Alex Beggs"]}