{"id": "071f2f06826e0795afea986a340453c8", "url": "https://www.bonappetit.com/recipe/milk-tea-bread-pudding-with-creme-anglaise", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Milk Tea Bread Pudding With Crème Anglaise Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueMilk Tea Bread Pudding With Crème AnglaiseBy Peter SomOctober 19, 20214.9(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintMilk tea is a delicious result of Hong Kong’s melting pot history. Chinese tea drinking rarely involves dairy, but the British influence in Hong Kong created what recipe developer and fashion designer Peter Som describes as a magical elixir made by combining strong black tea and sweetened condensed milk. Sweet, bitter, creamy, and so, so good, milk tea is very drinkable on its own and is an irresistible base for this bread pudding. Melted and warmed vanilla ice cream makes for a lightning-fast, no-stress crème anglaise.For the rest of Som’s Thanksgiving menu, see his recipes for Asian Pear Salad With Peanut-Lime Dressing, Roasted Brussels Sprouts With Gochujang Brown Butter, Sweet Potato Tian, Dutch Oven No Mai Fan, and Char Siu Wellington.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron13x9\" Baking Dish$20 At AmazonSmall Sieve$8.99 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketWhisk$10 At AmazonSmall Saucepan$155 At AmazonIngredients8 Servings11-lb. brioche loaf, torn into large irregular pieces114-oz. can sweetened condensed milk2½cups half-and-half2Tbsp. granulated sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. vanilla extract8black tea bags (such as English breakfast)4large egg yolks1large eggUnsalted butter (for pan)¾cup golden raisins1pint vanilla bean ice cream or gelatoPowdered sugar (for dusting)120-oz. can lychees, drained, halved (optional)PreparationStep 1Place a rack in middle of oven; preheat to 300°. Spread out brioche on a rimmed baking sheet. Bake, tossing halfway through and reducing oven temperature if browning too fast, until brioche is very dry and lightly toasted, 25–35 minutes. Let cool.Step 2Meanwhile, bring condensed milk and half-and-half to a bare simmer in a medium saucepan over medium heat. Remove from heat and whisk in granulated sugar, salt, and vanilla until sugar is dissolved. Add tea bags and let sit 25 minutes.Step 3Remove tea bags from pan, wringing them out over pan; discard tea bags. Whisk egg yolks and egg into tea mixture until incorporated.Step 4Increase oven temperature to 350°. Butter a 13x9\" baking dish. Arrange brioche in an even layer in baking dish and scatter raisins on top. Pour custard mixture over; toss brioche to coat, then press down lightly to partially submerge. Let sit 20 minutes to give brioche time to soak up custard.Step 5Bake bread pudding until golden brown and custard is puffed and just set (it should barely jiggle when gently shaken), 35–40 minutes. Let cool 20 minutes before serving.Step 6Meanwhile, heat ice cream in a small saucepan over low heat, stirring occasionally, until melted and just warmed through (do not simmer), 5–8 minutes. Transfer crème anglaise to a small pitcher or bowl.Step 7Dust bread pudding with powdered sugar, then cut into squares and divide among plates. Drizzle crème anglaise over and arrange lychees around if desired. Serve remaining crème anglaise alongside.How would you rate Milk Tea Bread Pudding With Crème Anglaise?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI prepared this for Christmas dessert and although I followed the recipe exactly, it came out dry, more like a baked French Toast.  We all liked the flavor, though.  But the tea did not really come through.\n\nI have a much better, custardy recipe that maybe I will  adapt to the tea infusion.  As is, it is a good brunch dish, IMO, but not a decadent Holliday dessert. So 4 stars as French Toast.JodiNYC12/26/2021This was tasty but didn't really think it had a milk tea flavor. It was overly sweet and would omit the granulated sugar since the creme anglaise is plenty sweet. KLAUMidland Park, NJ12/5/2021Delicious! Made this with challah (what our store had) and earl grey tea. Shared with family for Thanksgiving breakfast. Not too sweet, just right flavor. Keeping in my repertoire!HannaMadison, NJ11/26/2021I haven’t made this yet but I guess it would be possible to use challah instead of the brioche?NancyVictoria, BC11/16/2021Could you use coconut cream or milk in lieu of condensed milk for those who are dairy intolerant?Lynne CPortland, OR11/12/2021A delicious and comforting dessert. I love milk tea and this reminded me of all the aromatics from a good cup of tea. I used 24g of loose leaf instead and strained the milk afterwards. I also used 300ml of condensed milk and it turned out perfect. Definitely making this again. Andy GVancouver, BC11/1/2021Our cooking club made this and here are our thoughts:  I could not taste the tea in this and it was overpowered by the condensed milk, but the taste was excellent!, usually don't care for bread pudding but this had a nice flavor and was great! Very mild taste, don't like bp but liked this! Loved it, Very good, not change a thing!Liz PetersonLutz, Florida10/31/2021Explore Bon AppétitTeaBread PuddingDessertThanksgivingBakeLycheeFruitBriocheRaisinDried FruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Peter Som"]}