{"id": "07323a2404aaeeedca3c65d8bf371fd9", "url": "https://www.bonappetit.com/story/dewars-taffy-chews", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "More Likely Than Not, I’ve Got One of These Taffies in My Pocket | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMore Likely Than Not, I’ve Got One of These Taffies in My PocketAnd maaaaaybe I’ll share.By Alex PastronOctober 28, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Holiday gatherings at my grandparents' house always went down the same way: Gramma cooked, Papa smoked cigars, and everybody unwrapped and ate Dewar’s Taffy Chews by the handful.To be clear, these are not the neon-colored saltwater taffies that sit in bulk bins for weeks on end. Since 1909, Dewar’s Candy Shop in Bakersfield, California, has made its chews fresh every single day. Before the candy is put into the taffy stretcher, a large dollop of marshmallow is whipped—by hand!—into the base. The result is a taffy that is totally delicious without being too sweet, and perfectly chewy without being too sticky.And unlike a saltwater taffy that relies on fake-tasting commercial flavoring and artificial color, Dewar’s uses essential oils for a more intense, undiluted flavor. And for nut-filled taffies, the shop wraps the candy around the filling, from the original crunchy housemade peanut butter to the very 2019 almond butter taffies.My go-to flavor is peppermint, which is striped with that same marshmallow base and red taffy infused with pure peppermint oil. They taste like the gooey center of a peppermint patty with some serious candy cane vibes. As a kid, I would keep a small collection of these taffy chews in my pockets and try to ration them until the next family gathering. But now that I live across the country, I just order a box to be delivered whenever I need a fix. Which is a lot more often than once a year.Buy it: Dewar’s Taffy Chews, $18 for a 1-pound box at Dewar’sAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingCandyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-28", "author": ["Condé Nast", "Alex Pastron"]}