{"id": "0756a4f51d9bdcb4c5e61639f34a00ee", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/tenkiyo-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Tenkiyo Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoTenkiyoBudget-friendly tempura below the buzz of Tokyo Station.FacebookPinterestTwitterEmailKee Byung-keunGO HERE: for tempura that won’t break the bank. Considering the obsessive attention to detail that most shops take in preparing tempura, it isn’t incomprehensible that it often commands a premium. But where the sliding scale of quality for sushi is quickly apparent as you move from low to high, Tenkiyo proves that excellent tempura can still be enjoyed without draining your savings. Conveniently located in the basement below Tokyo Station, it’s a destination in itself, not just a spot to refuel between train rides.ORDER THE: ten-don, all of the best parts of eating tempura placed over a single bowl of hot rice. You’ll get at least two big prawns, a cut of fish, and some vegetables. Don’t forget to order the extra topping of a tempura fried egg, which is one of the genre’s greatest achievements. Cracking through the crispy batter to find a still-runny yolk gush out over your rice is a wild pleasure.THE VIBE IS: a calm respite from the hubbub outside. Tokyo Station is among the top ten busiest train stations in the world (Shinjuku Station on the other side of the city is first), and the flow of people never stops. But Tenkiyo is buried deep enough that it maintains a level of peace, with little pressure to finish and vacate your table. Don’t miss your train, though—in Tokyo, those wait for no one.PRACTICAL STUFF: Open daily from 11 a.m. to 11 p.m. No reservations required. The staff does not speak English, but an English menu is available. Get off the train at the Tokyo Station stop.By Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}