{"id": "076a694b729f691759a243bff8024a7a", "url": "https://www.bonappetit.com/recipe/sheet-pan-garam-masala-chicken", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Sheet-Pan Garam Masala Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSheet-Pan Garam Masala ChickenBy Kat BoytsovaNovember 25, 20184.2(37)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintSheet-pan dinners don't have to be boring! Marinating chicken in creamy, tangy spiced yogurt gets you a juicy and super-tender result, and since you're roasting your veggies on the same sheet pan as the meat, they're going to pick up all of those delicious chicken-y flavors. All-in-one dinners like this run the risk of being kind of one-note, which is why that spicy, acidic, herby finishing condiment is key—it lends contrast, and brings the whole thing together.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMicroplane$16 At AmazonMedium Bowl$17 At AmazonZip-Top Bag$6.99 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAHeavy-Duty Aluminum Foil$10 At TargetRimmed Baking Sheet$20 At Bon Appétit MarketTongs$13 At AmazonColander$11 At AmazonSpoon$24.69 At AmazonPlatter$29 At AmazonIngredients4 servings13\" piece ginger, scrubbed2½cups whole-milk Greek yogurt, divided2lemons¼tsp. cayenne pepper3Tbsp. garam masala, divided8skin-on, bone-in chicken thighs and drumsticks (about 2½ lb.)2Tbsp. plus 1¼ tsp. kosher salt, divided1head of jumbo cauliflower (about 3 lb.)3Tbsp. vegetable oil½small onion1jalapeño½bunch cilantroPreparationStep 1Place a rack in upper third of oven; preheat to 425°. Finely grate 3\" piece ginger into a medium bowl (don’t worry about peeling it). Transfer all but 1 tsp. grated ginger to a large resealable plastic bag, reserving ginger in bowl.Step 2Add 2 cups yogurt to bag with ginger. Cut 1 lemon in half crosswise and squeeze juice into yogurt mixture. Add ¼ tsp. cayenne and 2 Tbsp. plus 1 tsp. garam masala. Seal bag and shake to combine.Step 3Season 8 chicken pieces with 5 tsp. salt. Place in bag, seal, and shake again to cover all the pieces. Squeeze out as much air as you can from the bag, which makes sure that all the chicken is covered with the marinade—this is why marinating in a resealable plastic bag is so clutch. Let marinate at least 30 minutes at room temperature, or keep in the fridge for up to 4 hours.Step 4Meanwhile, prep your cauliflower. Cut 1 head of cauliflower into quarters through stem end. Place quarters cut side down and remove most of the core. The cauliflower florets should fall apart and separate naturally, but you can slice any larger florets in half or into quarters until all florets are about 2\" in size. You want the more or less evenly sized so they're cook evenly.Step 5Transfer cauliflower to a large foil-lined rimmed baking sheet. (That foil makes for easier cleanup later.) Drizzle 3 Tbsp. oil and 1½ tsp. salt over and toss to coat. Spread cauliflower evenly all the way to edges of pan, making sure that the pieces aren't too crowded, otherwise they'll steam instead of roasting—if you ended up with more cauliflower than can fit in a single layer, take some out and save it for something else.Step 6Remove chicken from marinade, slightly shaking off excess. Arrange on baking sheet skin side up, nestling into cauliflower. It’s okay if some marinade clings to the chicken, just make sure it’s not pooling in pan.Step 7Roast chicken and cauliflower, turning pan halfway through and moving chicken around with tongs to ensure even browning, until chicken skin is blistered, meat is tender all the way to the bone, and cauliflower is nicely charred, 35–40 minutes.Step 8Meanwhile prepare your condiment. Finely chop ½ onion, place it in a colander, and rinse it with cold water. (This removes some of the onion's sharpness.) Add onion to the bowl with the reserved ginger. Finely grate zest of remaining lemon into bowl. Cut lemon in half and squeeze 1 half into bowl; reserve remaining half for another use. Thinly slice 1 jalapeño into rings and add to bowl. Coarsely chop ½ bunch cilantro (stems and all, they're tender and delicious!) and add to bowl. Season with remaining 2 tsp. garam masala and ¾ tsp. salt. Mix with a spoon to combine, taste, and add more salt and lemon juice if necessary—you want the condiment to be plenty zippy.Step 9Arrange chicken and cauliflower on a platter. Top with lemon condiment and serve with remaining ½ cup yogurt alongside for drizzling.How would you rate Sheet-Pan Garam Masala Chicken?Leave a ReviewTell us what you thinkReviews (28)Back to TopTrianglei love this recipe.  i have made it many times.  it is absolutely delicious.  thank you eesanta barbara, ca9/13/2021\" Tbs or tsp for the garam masala? Its a big difference!\n• Anonymous Denver 11/3/2020\"\n\"Question: Garam masala ingredient lists the amount at 3 tablespoons but the actual recipe\ncalls for 3 teaspoons. Is 3 tea the correct amount?\n• Pam from wayne Wayne, Pa 11/30/2018\"\nDo people actually READ the recipe ingredients and instructions before making useless comments? Everything is clearly marked here - Tsp with a capital T is Tablespoon. As for the quantity of garam massala in the recipe, in step 2 it clearly says \"2 Tsps plus 1 tsp garam massala\" for the marinade ... so, 2 Big Spoons plus 1 Little Spoon in the marinade. The other 2 teaspoons are for the garnish at the end of cooking. Clear now????JoEurope2/18/2021Tbs or tsp for the garam masala? Its a big difference! AnonymousDenver11/3/2020Good recipe. I made it with boneless breasts and gave the cauliflower a 10-minute head start. Sprinkled a bit of garam masala on that, too. Like other reviewers noted, the condiment was very spicy (my jalapeño was too large, I think). Will make again. AnonymousNew England10/12/2020I am wondering if my jalapeño was to big! The co dinner said it would be zippy but my gracious! I can handle heat but that was to much. Not sure what went wrong?? I had to adapt it a lot to make it edible.  hilary.thompson216487Indiana 7/31/2020Amazing! This is my second time making this and it turned out just as good as the first. The spice level is moderate but the yogurt balances everything else out. You don't need any rice or bread on the side, the cauliflower is enough. This has officially been added to our collection of go to recipes. datspiceOttawa, Canada6/4/2020I only made the chicken and it came out great. I took the condiment and yogurt at the end and blended them into a chutney, adjusting the cilantro, chili, lemon juice, spices and yogurt to taste. I find the chutney to be a better topping than the chopping condiments. Queens, NY5/6/2020As others have said in their reviews, I ended up using two sheet pans to give the cauliflower enough room to brown. I had a fair amount of liquid on chicken pan as well, but it seemed to cook off. I also think letting the chicken broil would be helpful for getting the chicken crispy, but nevertheless the marinade/sauce is delicious and I'll definitely be using it again! I skipped the broiling (I was hungry) and think they were just fine like that, but if you're really wanting some crispness I'm sure it'd be worth the broil. AnonymousManhattan, Kansas3/19/2020So you ever answer any of the questions.  They seem appropriate.AnonymousDarlington, MD1/27/2020I've made this recipe several times.  I ended up using a separate sheet for the cauliflower and chicken.  After removing the cauliflower I gave the chicken a broiling for 10 minutes.  It came out per the recipe after that.\nAnonymousFlorida12/2/2019So super flavorful. Yes the topping shines but I thought the chicken could have been great on its own. I used a full-sheet pan and yes there was a good amount of moisture in the pan as it cooked but it spread out cooked off. Honestly, was fine (not every roast veg needs to end up crispy) and the tops got some color AnonymousHoboken, NJ10/11/2019Like a few others have said, chicken didn't crisp up at all and lots of juices were at the bottom of the pan and needed to be poured out a couple times.  The chicken tasted delicious but the cauliflower was more steamed than roasted.  I ended up broiling chicken for about 7 or 8 minutes until top got crispy.  I wouldn't recommend this recipe due to the steamed cauliflower and soggy chicken skin, but seems like others are having some luck with it.  The condiment was amazing as a topping!jdsully8Riga10/4/2019This turned out so delicious.  I only had boneless skinless thighs, but it still worked out great!\nThe chicken was so juicy and good.  It didn't taste indian, but it was slightly spicy, and very lemony and I love it!Huntington Beach7/3/2019This was delicious. Yes, the condiment made it, so what? We only marinated the chicken for thirty minutes so it was just subtly flavored on it's own. The chicken browned up (crispy skin and all) nicely as did the caulifleur. We didn't have any pooling liquids like other reviewers and we found the califleur did end up being flavored by the residual marinade from the chicken during cooking. We made mango lassi's to go with it which cut the heat from the condiment (we didn't have jalepenos, only serranos so it packed quite a punch). I will be making it again for sure, only marinating for longer.AnonymousColumbia, MO7/2/2019It smelled delicious while I was prepping the marinade, but man did this recipe fall short. Like many others, I had a lot of liquid in the pan from the chicken (thighs) that I used, and as a result the cauliflower steamed more than roasted (only had a bit of char on a few pieces of cauliflower). The chicken was incredibly bland (which my husband and I were really shocked by! So much spice and lovely aromatic ingredients..), the skin wasn't very crispy, and I even left mine in the oven an additional 10 mins to get it a bit crisper. Ended up removing the remaining leftover chicken from the bone, as I'm sure I can use the remaining chicken for a more flavorful meal this week. The one upside? The cilantro/lemon dressing is very good and gave the meal some flavor which was very much needed. Maybe skinless chicken would absorb the marinade better?heather eatsMontreal6/12/2019Explore Bon AppétitIndianSouth AsianAsianCauliflowerVegetableChicken DrumstickChickenPoultryChicken ThighSheet-Pan DinnersWeeknight MealsMainKetoGluten-FreeNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-25", "author": ["Condé Nast", "Kat Boytsova"]}