{"id": "076eb7f71ce6e4ec6f30123df5d1ceaa", "url": "https://www.bonappetit.com/story/claire-saffitz-baking-recipes", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Adam Rapoport on Why Claire Saffitz Makes All Your Favorite Baked Goods | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Saffitz Makes All Your Favorite Baked GoodsA weekly dispatch from Adam Rapoport, Bon Appétit's editor in chief.By Adam RapoportJune 19, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Claire Saffitz makes all your favorite baked goods.Whenever I wander down to the Bon Appétit test kitchen, I’m usually looking for a nibble or a nosh. That, and to see what Claire Saffitz is up to.I think it’s fair to say that Claire is our most...erudite test kitchen editor (She went to a certain college in Cambridge, Massachusetts—ahem.) And she cooks and bakes in ways that I can’t even begin to aspire to.Take her hit series, \"Gourmet Makes,\" on Bon Appétit’s YouTube channel. From one episode to the next, millions of viewers tune it to watch Claire attempt to make Cheetos from scratch (and nearly turn orange with frustration along the way); toil for days concocting homemade Gushers (turns out a syringe is necessary); pulling sugar with the determination of The Rock while pursuing the secret to Skittles...and, well, you get the idea. To say it’s addictive viewing would be an understatement.But for those of us on staff, as well as for everyone who turns to BA for its recipes, Claire is our dessert maven.Want this letter before it hits the website? Sign up for our newsletter!Every day around 3 p.m., aka Coffee O’Clock, there is a good chance Claire will be setting out something absolutely irresistible in our test kitchen. One week it could be her moist and flavorful swirled tahini tea cake (if ever there was a loaf meant for a cup of freshly brewed coffee), the next her glistening, crispy-yet-fluffy focaccia. I feel like we should all submit our gym membership bills to Claire; she’s clearly the reason we’re carrying around a few extra pounds these days.Unlike most of us home cooks, Claire takes an exacting, nearly obsessive approach to her craft. She will test a recipe again and again and then one more time, just for good measure. She speaks in terms I literally don’t understand. On a recent episode of the Bon Appétit Foodcast, I was interviewing her about her easy sheet cake with chocolate-cream cheese frosting (which is basically the best from-scratch birthday cake your mom never made you). Thinking that “easy” was the operative word in the recipe, the next thing I knew, she’s talking about “mechanical leavening,” how certain ingredients are “hygroscopic,” and how gluten comprises “glutenin and gliadin.” Did not see any of that coming.Photo by Chelsie CraigNot that you need to be a whiz to enjoy Claire’s creations. She does the hard work so the rest of us don’t have to. Our associate social media manager Emily Schultz aptly described Claire’s rhubarb custard cake as being “somewhere between pudding and heaven.” And, I mean, really—where else would anyone want to be?Get Claire’s recipes:Swirled Sesame Tea CakeFocacciaEasy Sheet Cake with Chocolate-Cream Cheese FrostingRhubarb Custard CakeExplore Bon AppétitAdam NewsletterRead MorecultureMeet Senior Associate Food Editor Claire SaffitzBy Bon AppétitcookingThe 10 Baking Questions People Ask Me Literally All the Time, AnsweredBy Claire Saffitzeffed it up3 Reasons Why Your Baking Fail Is Probably Not Your FaultBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Adam Rapoport"]}