{"id": "07778b3fd619103163caff5082137de0", "url": "https://www.bonappetit.com/story/hot-breakfast", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "There's No Better Time to… Make Yourself a Hot Breakfast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Make Yourself a Hot BreakfastPancakes on a Monday? Sure, why not.By Sasha LevineApril 20, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Make breakfast with big weekend energy.As a get-up-and-go sort of gal, my normal mornings look like this: I wake up at 7, head to work by 8, start my (first) cup of coffee by 9, and finish a still-green office banana (thanks, big media corporation!) about thirty seconds later.But these days (yes, you know the ones), I no longer have an office to run to, or a rush hour to beat, or free bananas at my disposal. It’s unmoored me, to say the least. But it’s also given me something in return: a deeper acquaintance with the snooze button—and an appreciation for the Hot Breakfast.Standing over the stove on a Tuesday morning might sound like torture this many weeks into having to feed yourself three (plus) meals a day. But to me it’s been a revelation—and I’ve gone all in.I’m talking pancakes with generous pats of butter. Scones with whipped cream and macerated berries. Toast with poached eggs. Toast with spoon eggs. Toast with lacy, crispy fried eggs. Steel-cut oats (the decidedly not instant kind), loaded with toasted walnuts and brown sugar. Crepes with cottage cheese, all rolled up and drizzled with maple syrup like some sort of soft, sweet flauta. Farina, dashi oats, waffles! I’ve got my eye on fresh-baked breakfast cookies and shakshuka next. Whatever I can eat hot, I want.Part of the allure lies in eating something that will actually get me to lunchtime. It’s also great that picking up a whisk or cracking a couple eggs means that the first thing my hands do each day won’t involve clack-clack-clacking on a keyboard. But most of all, it feels like a luxury, like a rebellion. In the Before Times, the most important meal of the day was about efficiency. Now, it’s a way to steal back a little of my day before facing the responsibilities awaiting me at my desk.Everyday feels like Groundhog Day, but this new nourishing routine is keeping me sane and occupied. I can have something different for breakfast every morning, no green-ish bananas allowed.And that alone is worth getting out of bed for.Explore Bon AppétitCoronavirusBasicallyThere's No Better Time Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Sasha Levine"]}