{"id": "0779fe63de1ec8eb388a9eec91384418", "url": "https://www.bonappetit.com/story/3-restaurants-in-houston", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "My Ideal Eating Day in Houston | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Ideal Eating Day in HoustonWaffles for breakfast, bánh mì for lunch, and tacos all the time.By Bryan WashingtonJune 6, 2018FacebookTwitterEmailPhoto by Max BurkhalterFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.From freeway to shining freeway, Houston is a global food city, which (I get it) sounds a little cliche—until you’re actually on the ground, that is. There’s something for everyone, whether you’re craving a big, filling breakfast or a big, filling lunch. If you’re coming to visit me, these are the three spots I’d take you to.Baby Barnaby’sOn weekends there’s no place like Baby Barnaby’s (pictured above) on Fairview. Tucked behind Montrose’s gay bars, it’s a homey breakfast joint that gets dressed up for dinner. Go for the best waffle in the city: They’re plate-size and crispy yet miraculously tender inside. The clientele is as diverse a picture of Houston as you’ll ever see. Or hear. Open your ears and you’ll catch four or five different languages. Whenever I’ve got folks flying into town, this is one of our first stops because the helpings are generous (that’s important in these parts), the buttered biscuits are the softest, and the cooks fry your eggs exactly the way you like them, however you like them, just right, every time.First stop in Houston.\nPhoto by Max BurkhalterLes Givral’s Sandwich & CaféMost days my go-to lunch near downtown involves a stellar egg bánh mì from Les Givral’s on Milam Street. The hosts warn me against ordering runny yolks every time, but I do anyway and always end up splattered. It’s a neighborhood staple, cheap eats for the local set, and the sandwiches attract some of the inner loop’s biggest lunch crowds. The baguettes are transcendent. The pork is succulent. They’ve found the perfect algorithm for balancing cilantro and carrots, with just enough spice in the mix to make you wince.La Guadalupana Bakery & CaféHouston’s a taco city, and those at La Guadalupana on Dunlavy are no joke. It’s a cozy little family-run joint that shares a slip of a strip mall with a convenience store and a laundromat—drive too fast and you’ll miss it. I’m a devotee of the mole poblano, which boasts a complexity of flavors that deserves its own essay, but the charro-bean-laced tacos al carbon are incredible as well, and smoky. The owner and head chef, Trancito Diaz, will be sure to stop by everyone’s table for a quick what’s-up. The coffee, though—the coffee’s undeniable. It’s so strong that it’d wake the dead, brewed with just the barest hint of cinnamon.Bryan Washington is a writer in Houston.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsHoustonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Bryan Washington"]}