{"id": "07813fe7cacf20b1f8d3373d84e5417b", "url": "https://www.bonappetit.com/story/expensive-pasta-is-worth-it", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Expensive Pasta Is Worth It—Here's Why | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingExpensive Pasta Is Worth It—Here's WhyAnd by \"expensive\" we mean \"a couple of dollars more than the cheap stuff\"—money well spent, if you ask us.By Alex DelanyJune 14, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailHave you ever noticed that little sliver of your grocery store’s pasta section that just looks...nicer? The brands aren’t instantly recognizable. The logos seem like they were hand-drawn with a large quill pen or stamped with an antique letterpress, and the boxes are made out of some material that looks tastefully recycled. And the prices, well, they’re definitely higher than the typical dried stuff you’ve been buying. Maybe even alarmingly so, considering how cheap the cheapest versions are. But we just want to say that, by and large, that expensive pasta is worth the extra cash.But why? Are you just paying for that extra branding? Is it worth the extra change because it makes you feel fancy? Isn’t dried pasta all the same? It’s just flour and water, right? What could make it better than the everyday dried stuff? Great questions. Here's why the pricier stuff is totally worth it.The first is a low-temperature, slow-drying process. When we're talking about good dried pasta, this is probably the most important thing. Most large dried pasta brands will dry their pasta at higher temperature, so it loses moisture more quickly. This gives them the ability to make more pasta, more quickly, which means they can produce and sell more. We don’t want to get too nerdy here, but this quick-drying process traps undeveloped starch proteins inside the dried pasta. What that really means is that the texture of quick-dried pasta is inferior to that of slow-dried.Slow-dried pasta is more pleasant to eat at a perfect al dente—toothy, chewy, and delicious. The low-temperature drying allows the structure of the pasta to stay relaxed, which leaves small, breathable holes in the noodle. Holes are good. We love pasta with holes, because it means that whatever sauce we toss the pasta in will get absorbed into the noodle. It’s a more flavorful experience for everyone. It takes a longer amount of time to slow-dry pasta, which is one half of the reason it’s more expensive.Whatever sauce is going on those noodles, slow-dried pasta will help it absorb more efficiently.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiSo you can look at the box. If you see the words “slow-dried,” you’re in a good spot. But you can also tell by looking at the pasta itself. If the pasta looks shiny and smooth, chances are, it’s not going to be that great at absorbing sauce.If the pasta looks kind of rough, chalky, and a little dirty, that’s a great sign. Sauce loves to cling to that bumpy exterior texture. And if the outside looks a little worn, it's probably a sign that the pasta was shaped using bronze dies. (A die is just another word for pasta mold.)Good dried pasta should look a little rough and chalky, not smooth and shiny.\nPhoto by Chelsie CraigMost large pasta makers use teflon dies because they're cheap and durable. The jury's still out on whether or not bronze dies definitely make for better pasta, but the commitment to quality is a good sign. The softer bronze is bumpier than the slick teflon. This helps to create that rough texture on the outside of the pasta, which helps grab whatever sauce you decide to finish it in, whether it’s some eggy carbonara or a butter-roasted tomato situation. We will never complain about sauce that actually sticks to our pasta. Never.So yes, expensive pasta is worth it. The care that goes into making it actually makes for a more delicious product, and absolutely justifies the price tag. They say money can’t buy happiness. But did those people ever buy nice pasta? Probably not.Buy some high quality noodles, and do what you know is right:Creamy One-Pot Pasta with Peas and MintPantry pasta at its best.View RecipeExplore Bon AppétitPastaBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-14", "author": ["Condé Nast", "Alex Delany"]}