{"id": "0782c0b7bdf1753426f04503c9d8c9bc", "url": "https://www.bonappetit.com/story/spicy-pork-tenderloin-bowl", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "A Spicy Pork Tenderloin Bowl That's So Easy You Hardly Need This Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Spicy Pork Tenderloin Bowl That's So Easy You Hardly Need This RecipeFinally, a weeknight pork tenderloin recipe we can get behind.By Aliza AbarbanelMay 30, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailMost weeknights, recipes are banned in my kitchen. My dinner game plan is blessedly bare-bones: Take whatever vegetables are currently hanging out in my fridge, add some spicy tofu or smoked salmon,  and lay the whole thing over cooked grains. It's an admittedly slapdash strategy for dinner, but, in a world where bowls are trending at fast-casual lunch spots and all-day cafes alike, I have no shame.The secret to creating restaurant-worthy dinner bowls lies in maximizing flavor with minimum effort because you were too busy watching Westworld to meal prep on Sunday and there's no going back now. Luckily senior food editor Chris Morocco’s spicy pork tenderloin bowl with greens and carrots is both flavorful and fast-cooking.“Pork tenderloin is a very inexpensive cut of meat that’s relatively easy and fast to cook, but it’s rarely truly delicious because it has basically no fat or character,” says Morocco. “We gave it the bulgogi treatment and it actually took really well to it. With something that’s super lean like that, cooking it hot and fast is a good workaround.”The textural transformation begins by freezing the pork tenderloin until firm around the edges (about 30–45 minutes), which makes it easier to slice into thin, bulgogi-like strips. Take this time to put away your dishes or bravely attempt to clean out your inbox, then use the last ten minutes to whip up a punchy marinade made from sambal oelek, brown sugar, ginger, garlic, soy sauce, and sesame oil. The key to flavorful pork tenderloin is making sure the meat is well-coated in marinade, so don’t be afraid to get your hands messy and knead away in the name of stress relief. Finally, to ensure maximum marinade-goodness, let the tenderloin sit for ten minutes while you prep the vegetables (or up to two hours if you get lost in another episode).Once marinated, cook the tenderloin slices undisturbed in a very hot nonstick skillet with a slick of vegetable oil. Keeping the tenderloin in contact with the hot pan ensures that the meat gets nice and dark brown, so you'll want to work in two batches to maximize surface area. (To minimize splatter, remove the skillet from heat when adding more oil between additional pieces of tenderloin.) The rest of the bowl comes together fast. Cook carrots and collard greens in that same skillet until crisp-tender, and mix up a bright dressing with just a bit of seasoned rice vinegar, soy sauce, and sesame oil.Grab your finest ceramic bowl or, more realistically, an Ikea plate, and lay down a bed of rice to get this grain bowl going. Add in the pork and vegetables, and finish with some thinly sliced scallions. Finally, commit to the all-day cafe fantasy and schmear a spoonful of gochujang across the rim for maximum vibes (and easy dipping). The fermented chili paste is a staple in Korean cooking, providing a sweet heat that perfectly contrasts this umami-packed marinade. If you don't have gochujang, try a dollop of miso or another substantial, flavor-packed paste like yuzu kosho. While you're at it, drizzle some dressing across the whole thing for a final hit of brightness.Dinner is done, and you've only dirtied one pan in the process. I'd even suggest inviting over some friends to join, because this is the kind of high-impact meal you can honestly pass off as no biggie. I promise, they'll still be impressed. Throw on your vibiest playlist (or steal mine) and you could be in any airy, well-lit restaurant with some bonus at-home perks: no waiting, no debate over splitting the check, and no shoes required.Break out your dinner bowlsSpicy Pork Bowl With Greens and CarrotsGiving pork tenderloin a bulgogi-influenced makeover makes it flavorful, fast-cooking, and weeknight-friendly.View RecipeExplore Bon AppétitHealthyishPork TenderloinPorkDinnergochujangWeeknightCarrotCollard GreensRead MorecookingThis Sweet Potato Bowl Is the Best Single-Person Dinner of All TimeBy Anna StockwellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Aliza Abarbanel"]}