{"id": "07856b08d6794bc02e37f675c6c87830", "url": "https://www.bonappetit.com/recipe/pork-wontons-with-sesame-sauce", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Pork Wontons With Sesame Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssuePork Wontons With Sesame SauceBy Lisa Cheng SmithNovember 19, 20195.0(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintYou’ve never met a dumpling filling that’s as fluffy and moist as this one. The secret is whipping in extra fat to the filling to emulsify the mixture. The chile crisp drizzled on top is optional but it’s so good, why would you want to pass that up? This folding technique is easier than an elaborate pleated dumpling. Plus, quickly boiling instead of frying them is a foolproof cooking method that gives you dumplings that are just as good at room temperature as they are fresh out of the pot. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 regular or 16 small servingsWontons1lb. ground pork1scallion, finely chopped1Tbsp. soy paste (such as Yu Ding Xing)1Tbsp. toasted sesame oil1Tbsp. grapeseed or vegetable oil1tsp. finely grated peeled ginger1tsp. rice wine1tsp. kosher salt¼tsp.\tfreshly ground white pepper (optional)1large egg48wonton wrappersSesame Sauce and Assembly3Tbsp. toasted sesame oil3Tbsp. Chinese toasted sesame paste or tahini2Tbsp. soy sauce2Tbsp. unseasoned rice vinegar1Tbsp. sugar1–3Tbsp. store-bought or homemade chile crisp; plus more for serving (optional)Thinly sliced scallions (for serving)PreparationWontonsStep 1Using your hands, mix pork, scallion, soy paste, sesame oil, grapeseed oil, ginger, wine, salt, and pepper (if using) in a large bowl until thoroughly combined. Crack egg into center of mixture and stir vigorously in one direction with a wooden spoon or rubber spatula until mixture is shaggy and lightened in color, about 4 minutes. Cover and chill at least 15 minutes and up to 12 hours.Step 2Fill a small bowl with cold water. Take a wonton wrapper and lay it in your palm. Using a small offset spatula or butter knife, press about 1 tsp. pork mixture into the center of wrapper. Dip a finger into water and run it around edges. Fold wrapper in half on a diagonal and press edges tightly together to seal. Dip your finger into water again and dampen 2 bottom corners of wonton. Bring corners together and pinch to seal. Place on a parchment-paper-lined baking sheet. Repeat with remaining wonton wrappers and filling. Cover and chill until ready to cook.Step 3Do Ahead: Wontons can be assembled 1 day ahead. Keep chilled, or freeze up to 1 month. Freeze in a single layer on baking sheet until frozen, then transfer to an airtight container. Cook from frozen, about 4 minutes.Sesame Sauce and AssemblyStep 4Whisk oil, sesame paste, soy sauce, vinegar, and sugar in a small bowl to combine, then whisk in water, 1-tablespoonful at a time, until you can drizzle sauce easily but it’s not watery. If using chile crisp, stir in 1–3 Tbsp., depending on how spicy you want your sauce; set aside.Step 5Bring a large pot of water to a boil. Working in batches of up to 10 at a time, boil wontons until wrappers are puckered and tightly wrapped around filling (filling should be cooked through; slice one open to double-check if unsure), about 3 minutes. Using a spider or slotted spoon, transfer to a plate; let cool slightly.Step 6Divide wontons among bowls and spoon reserved sauce over; top with scallions and more chile crisp if desired.How would you rate Pork Wontons With Sesame Sauce?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThese wontons were so flavorful and juicy. I did half ground pork and half finely chopped shrimp and they turned out amazing. Instead of making the sauce I ate the wontons in noodle soup and they were delicious. I would definitely make these again.TayamberDaly City5/22/2020Holy crap, these are delicious!! The recipe was pretty easy if a teeny bit labor intensive on making so many dumplings - I came out with about 70 with a single recipe, but if you have someone helping you or have a good movie on then time flies. I agree with everyone else, the chili crisp is a revelation that only enhances the flavor. New go-to recipe!!rileyrose41380Philadelphia5/1/2020Fantastic! I can't imagine making this without the chili crisp, it's just a perfect addition here. I've also never whipped the filling for my dumplings, which definitely made a difference. I've made many a dumpling recipe, but this is in a league of its own!Anonymous4/24/2020This recipe is ridiculously delicious and FUN. A quarantine project I would 10/10 recommend. It yields so many wontons, I stuck plenty in the freezer and it's been so easy to plop them in some boiling water whenever I want. Just wonderful. Subbed miso and soy sauce for soy paste because what the heck is soy paste?? Ate over rice with some stir fried veg or on their own with the sauce sitch. Yumtown. colleen1029Memphis4/23/2020Oh. My. God. Took me all the way to flavour town. My boyfriend came over and we made these for my family. They were such a hit, my parents asked him if he wants to stay a few nights! \n\nMake a double batch and freeze what you don’t use. You will not regret it! \n\nAlso, make the suggested amount of crisp chilli oil. I halved the recipe and regret it. I’ve used it to fry eggs in, and drizzle over other dishes I’ve made since and I’m almost out. It makes it! SaucyyysamToronto4/5/2020made these vegan with TVP and omitted the egg. next time i think it'd be better with Impossible/Beyond meat, since TVP has zero fat and is pretty disparate and crumbly.\nabout the actual recipe though: the taste was still great (i went heavier on the ginger), and my meat-eating family enjoyed them.wheres_the_veg3/28/2020These were so good! I’ve always been intimidated by dumplings but this recipe seemed just approachable enough. I had to use some substitutes because I didn’t  have time to get to an Asian grocery store.  I used a bit of miso paste + soy sauce as a sub for soy paste, and sherry in place of rice wine. Then used some garlic, chili paste and oil to get the sauce to the right spice level. I’m sure it would have been even better with the chile crisp.  These were SO flavorful and I loved the tahini sauce so much. \n\nUsing a butter knife to get the meat onto the wonton wrapper was so much easier than in the past when I’ve used a spoon. I cooked about 28 and froze the rest. I will definitely be making these again! It’s a really impressive dish and comes together really easily. It just takes a little patience. Also used a stand mixer with a paddle for the meat to make things even faster, and that worked great. WhiskeygingerWashington12/10/2019Explore Bon AppétitDumplingChineseEast AsianAsianPorkMeatGround PorkStarterDairy-FreeSimmerLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}