{"id": "079c9b18b9bde65e013e49a08677af22", "url": "https://www.bonappetit.com/recipe/ginger-spritz", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Ginger Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueGinger SpritzBy Kat BoytsovaMarch 20, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis light, refreshing drink recipe will be your new favorite to serve at brunch or picnics.IngredientsMakes 11thin slice peeled ginger2oz. Lillet3oz. cavaSplash of ginger beerPreparationPlace ginger slice against the inside of a rocks glass, fill with ice, and add Lillet and cava. Top off with ginger beer and stir gently to combine.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Ginger Spritz?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglePerfect light cocktail, we served with appetizers ahead of Thanksgiving!OliviaBoston, MA1/30/2022Explore Bon AppétitCocktailDrinks AllSpritzGingerHerbs & SpicesLilletAlcohol & Other DrinksDrinksEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-17", "author": ["Condé Nast", "Kat Boytsova"]}