{"id": "07b1e63b3938a1a14401627fb1a5707b", "url": "https://www.bonappetit.com/story/khichdi", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Make Khichdi, A Dish That's Wholesome, Delicious, Quick, and Pantry-Friendly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKhichdi is Wholesome, Delicious, Quick, and Pantry-FriendlyIn other words, it's practically perfect.By Priya KrishnaApril 13, 2020FacebookTwitterEmailPhoto and Food Styling by Priya Krishna FacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.The first food I ever ate wasn’t an avocado slice or a roasted sweet potato. It was khichdi, a soul-warming, one-pot meal of rice, lentils, and spices. Easy to make, easy to digest, it’s a common first food for South Asian babies.Khichdi was a constant in my upbringing, mainly made when I was sick. I’d get a sniffle, my mom would take out the pressure cooker, and I knew exactly what she was making for dinner that night. The dish could clear up my sinuses in a single bite.That probably explains why, 28 years on, khichdi remains my ride-or-die comfort food, whether it’s a sick day or not. It’s hard to think of a more wholesome meal that’s also simple and delicious. It’s certainly the dish I would make if I were, you know, stuck at home for days on end, unable to go out to eat at restaurants, relying mostly on my pantry to feed myself. Oh wait…Khichdi is the ultimate pantry dinner. It requires only rice, split mung beans, various warming spices, and ghee—ingredients I always have around and that tend to keep for a while. You’ll find variations on khichdi across the Indian subcontinent — some versions may add prawns while others swap mung beans for pigeon peas. It has even been adapted beyond the borders of the country—Brits, for example, morphed khichdi into kedgeree, adding smoked fish and egg. You’ll also see it in the world of American wellness bloggers, who have co-opted khichdi, which many mispronounce as“kitch-are-ree” (it should be said like khitch-ree, with a tongue roll on the “r”), for “detoxes” and “cleanses.”Yes, khichdi is good for you—it’s got tons of fiber and protein, and all those spices are very digestion-friendly—but what makes the dish so special is the method of cooking the rice and lentils together in the same pot. The starch from the rice and the potlikker from the lentils merge to create a luxurious consistency that's creamy but with a little texture. The ghee adds richness, and the spices punctuate each bite.In the version I make at home, there are two starring elements. The first is peppercorns—I love the way they tenderize in the pot and give the dish a kick. The second is the chhonk, the ghee-sizzled spices that are poured in at the end. The finishing hit of crunch and fat is so satisfying. Sometimes I’ll add a splash of coconut milk as the dish is coming together for an even creamier texture, or a bag of frozen spinach for bonus roughage. You can crown your bowl with a fried egg, or some chopped herbs. For crunch, you can crumble up pieces of pappadum, a crispy lentil cracker, on top.It’s this one-pot-infinite-possibilities trait that makes khichdi, in times like these, the dish that I find myself returning to at least once a week. When I can’t go outside, when I can’t dine out, when the grocery store has been out of toilet paper for the last three weeks, I know that I can simmer some combination of rice and lentils and spices in a pot, and at the very least, that’s going to turn out okay.Get the recipe:KhichdiView RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Priya Krishna"]}