{"id": "07c3418089c5dcf410a3b54073f86783", "url": "https://www.bonappetit.com/recipe/bas-best-risotto", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "Best Risotto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best RisottoBy Carla Lalli MusicMarch 29, 20194.8(97)Read ReviewsTriangleEmailPinterestPrintPhoto by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsEmailPinterestPrintEmailPinterestPrintRisotto is like a clingy baby. You can’t put it down, you can’t walk away from it, and you can’t ignore it. Its needs are simple, it just wants all of you. And if you give it all of your patient attention, it will turn into a puddle of love. This simple, pure, unadulterated version stands up on its own, but it also makes an excellent canvas for seasonal ingredients—find out more about those toppings at the very end of the recipe. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane$16 At AmazonMedium Saucepan$39 At AmazonHeatproof Measuring Cup$18 At AmazonWooden Spoon$6 At AmazonIngredients8 servings1Tbsp. kosher salt, plus more6Tbsp. extra-virgin olive oil½large white onion, finely chopped (about 1½ cups)2cups carnaroli, arborio, or Japanese sushi rice, such as RiceSelect® Arborio Rice1cup dry white wine5Tbsp. unsalted butter, cut into pieces1¾cups finely grated Parmesan, dividedFreshly ground black pepperPreparationStep 1Combine 1 Tbsp. salt and 10 cups water in a medium stockpot. Bring to a very bare simmer over medium heat.Step 2Meanwhile, heat oil in a 6-qt. Dutch oven over medium. Cook onion and a pinch of salt, stirring frequently, until onion is translucent and starting to soften, 6–8 minutes. Add ½ cup water and cook, stirring often, until water evaporates and onion is sizzling in oil and completely tender, about 5 minutes. (Adding the water allows the onion to cook gently and thoroughly without taking on any color.) Taste onion; if it’s still firm at all, add another splash of water and continue cooking until meltingly soft.Step 3Add rice and stir well to coat with oil. Cook, stirring constantly, until grains of rice are translucent around the edges and they make a glassy clattering sound when they hit the sides and bottom of pot, about 5 minutes. Coating the grains with oil before adding any liquid helps the rice cook evenly so that the outside does not become mushy before the center is tender. Add wine and another pinch of salt. Bring to a simmer and cook, stirring occasionally, until wine is completely evaporated, about 2 minutes.Step 4Reduce heat to medium, then add hot salted water to rice in ¾-cup increments, stirring constantly and allowing liquid to absorb fully before adding more, until rice is al dente and surrounded by fluid, not-too-thick creamy suspension, 25–30 minutes. It should take 2–3 minutes for each addition to be absorbed; if things are moving faster than this, reduce heat to medium-low. Gradual absorption and constant agitation are key to encouraging the starches to release from the risotto, creating its trademark creamy consistency. You may not need all of the hot water, but err on the side of soup rather than sludge. The finished texture should be more of a liquid than a solid. Start checking the rice after about 15 minutes; the grains should be tender but not mushy, with a slightly firm center that doesn’t leave a chalky or bitty residue between your teeth after tasting. Do not overcook!Step 5Remove pot from heat, add butter, and stir until melted. Gradually add 1¼ cups Parmesan, stirring until cheese is melted and liquid surrounding risotto is creamy but very fluid. Stir in more hot salted water if needed to achieve the right consistency. Taste and season with salt.Step 6Divide risotto among warm bowls. Top each with a grind of pepper. Serve with remaining ½ cup Parmesan alongside for passing.TOPPINGSBA’s Best Risotto Parmigiano is good enough to serve on its own, but it’s also an excellent canvas for a whole host of toppings. Here are a few options we love, for whatever season you’re in.Photo by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsSpring: Buttered Sugar Snap Peas with MintHeat 4 Tbsp. unsalted butter in a large skillet over medium until foaming, about 1 minute. Add finely chopped white and light green parts of 5 scallions, season with kosher salt and freshly ground black pepper, and cook, stirring occasionally, until scallions are bright green and aromatic, 1–2 minutes. Add 1 lb. sugar snap peas (trimmed, cut in half lengthwise), season again, and cook, tossing occasionally, until crisp-tender, 2–3 minutes. Remove from heat and stir in ½ cup sliced mint leaves. Spoon peas and any pan juices onto BA’s Best Risotto.Photo by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsSummer: Burst Cherry Tomato SauceHeat 2 Tbsp. unsalted butter and 2 Tbsp. extra-virgin olive oil in a large skillet over medium until butter is foaming. Add 4 crushed garlic cloves, season with kosher salt and freshly ground black pepper, and cook, stirring occasionally, until garlic is aromatic and starting to brown, 1–2 minutes. Add 2 pints cherry tomatoes and increase heat to medium-high. Cook, tossing frequently and pressing down on tomatoes with a wooden spoon to encourage skins to split, about 5 minutes. Add ½ tsp. red pepper flakes and toss to combine. Taste and season with kosher salt and freshly ground black pepper, if needed. Spoon tomatoes and pan sauce onto BA’s Best Risotto. Drizzle with oil.Photo by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFall: Browned Mushrooms with ThymeHeat ¼ cup extra-virgin olive oil in a large skillet over medium-high until shimmering. Add 1 lb. mushrooms (such as shiitake, crimini, or maitake, trimmed, caps torn into 2\" pieces) and cook, tossing occasionally, until they begin to soften and release some liquid, 3–4 minutes. Season with kosher salt and freshly ground black pepper and cook, tossing occasionally, until deeply browned and tender, 8–10 minutes. Add 5 crushed garlic cloves, 2 Tbsp. unsalted butter, and 4–5 sprigs thyme and cook, tossing occasionally, until garlic softens and butter is golden brown, about 3 minutes more. Remove from heat and add 2 Tbsp. white wine vinegar or fresh lemon juice. Toss to coat, scraping up any browned bits from surface of pan. Pluck out thyme sprigs. Spoon mushroom mixture onto BA’s Best Risotto.Photo by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsWinter: Lemon and ChivesStir finely grated zest of 2 lemons, ½ cup thinly sliced chives, and 5 Tbsp. extra-virgin olive oil in a small bowl; season with kosher salt and freshly ground black pepper. As soon as BA’s Best Risotto is done, stir in 3 Tbsp. fresh lemon juice. Spoon lemon-chive mixture onto risotto.How would you rate BA’s Best Risotto?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleThanks for this lovely recipe.  Another rice  species  that's ideal for risotto is vialone nano.  It's flavor is somewhat more robust compared to carnaroli, and is, in my opinion,  ideal if you're preparing a risotto with meat or poultry inclusions.George ArnoldBoston, MA1/5/2022This is the best risotto I’ve ever made. I followed the recipe as written and used the winter add-ins\nOf lemon zest, lemon juice, and green onions (green part only) since I didn’t have fresh chives) Wow!! Even my young grandchildren couldn’t get enough. They asked for seconds. This will now be a staple in my kitchen.TommysdebiOrlando, FL1/3/2022Made the recipe as described. Worked out great. Would make againBheavyOmaha, ne12/27/2021super great risotto recipe, but I would use appropriate stock instead of salted water.Wine is everythingCharleston SC11/4/2021Why not list the traditional ARBORIO rice for this recipe?KamaJoshua Tree, CA, USA10/27/2021Best risotto recipe I've ever made, and I've many. So creamy, such a clean taste.  Important to use wonderful rice, parmesan, etc.  We topped it with grated bottarga to try to replicate a dish I had in a wonderful restaurant in NYC. Transcendent! :) AnonymousSt Petersburg, FL10/13/2021Wow, excellent.  Did the mushroom, thyme version.  Perfect outcomeTraceyDanville, CA9/13/2021Too good!  Of course a lot of time and attention,and so worth it!MaryMLatonia, Ky.7/13/2021spot on!! kept adding water and stirring, made nice soup like stew, added the butter, and 2 cups of cheese, was heaven in a bowl.  Used tomato topper, doubled the red pepper, we were thrilled with this recipe. THANK YOU :)  PS my grand parents in the US only spoke Italian.AnonymousFredericksburg VA,  originally Dearborn, MI6/2/2021Carla's instructions are spot on!! Love the buttery flavor, and adding more salted water than you think you need is key to success!! this Risotto recipe does not overshadow any main dish, it compliments it. Favorite easy, risotto recipe I've made!\nChefGigiTraIllinois5/23/2021I'm a chef (retired) living in Milano, where Risotto rules, there seems to be a concern about the amount of wine, in Italia many people don't even use wine. When I make risotto I don't really measure the wine, but I would estimate for two cups of rice I use about 1/2 glass of wine would be sufficient, you don't want to have drunken rice, you know how unruly rice gets when it's over the beveraged.  The final steps are the most important, stirring in the butter and Parmigiano vigorously to achieve a creaminess in Italian it's called (manticare) and then shaking the pan back and forth to make waves, onde.  The risotto at this point should be streamed onto a flat plate and eaten from the outer edge and inward. Buon appetito. \n\n pacepuleoMilano Italy4/19/2021Yes, this is the best risotto I’ve made. (You only have to read to the first step of the recipe to know that there’s water in the recipe.) Easily adaptable and so comforting. Emily HCalgary 2/24/2021Great recipe except you failed to listed the stock quantity. One cup of wine will not be sufficient to groom the rice or add enough rich flavor.  Perhaps an error. Mrs. KareenLondon, UK1/6/2021Made it exactly according to directions (which I almost never do) and it was excellent. I was pleasantly surprised to end up with such a flavourful risotto without using stock. Using a delicious wine is key; don’t use one you wouldn’t want to drink. And obviously freshly grated parm. I also made the burst tomatoes, but with Sambal Olek in place of the crushed pepper flakes just because. Really tasty!PierieCalgary, AB12/20/2020Perfect.  Made a fantastic neutral base risotto.  This is a new go-to.\nChef KoalaSeattle, WA12/12/2020Explore Bon AppétitRisottoItalianEuropeanRiceRice & Grains5 Ingredients or FewerSideGluten-FreeNut-FreeVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Carla Lalli Music"]}