{"id": "07c5e690b3ca8ec41a6d1faf2dc6f195", "url": "https://www.bonappetit.com/story/squatty-potty", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "The Squatty Potty, Reviewed: Have I Been Pooping All Wrong? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHave I Been Pooping All Wrong?I tried a Squatty Potty to find out.By Shaena MontanariSeptember 10, 2018FacebookTwitterEmailIllustration by Nadine RedlichFacebookTwitterEmailLate last year, as I was lazily scrolling Instagram, I came across a product review video from one of my favorite influencers. A woman who typically convinces me to buy sparkly new eyeshadows and trendy shoes was extolling the virtues of what appeared to be a step stool for your toilet that helps you poop more efficiently.Excuse me?Soon after, I saw friends—adult people whom I know in real life!—receiving these same devices as a holiday gift, holding them in smiling family photos on Facebook. I zoomed in and found out this coveted object is called the Squatty Potty, and it’s apparently the key to pooping. Feeling my first-ever toilet-related FOMO, I decided to investigate.Despite being focused around human feces, Squatty Potty’s marketing is nothing short of charming. The extra-long commercials feature regal-looking unicorns expelling rainbow soft serve over a toilet in order to demonstrate the benefits of “unkinking” your colon while you sit upon the porcelain throne. As I write this, one of their Youtube commercials has over 34 million views, which is similar to the latest valuation of the company—$33 million. I shit you not.I ordered the travel version, mostly because it folds up and I can hide it when I have guests or Tinder dates over and I don’t feel ready to discuss my bathroom habits.When it arrived and I opened the box, I was not only happy to see my new Squatty Potty, but also a cute paper crown adorned with rainbow poop emojis. I unfolded it and placed it at the foot of my toilet right away so the experiment could begin. I was almost excited when it was the first “time” to use it—but I was a bit surprised at how unnatural the position felt at first (I think my leg even fell asleep a little.)Being the evidence-motivated, regular-BM-loving person that I am, I also read up on the scientific papers that Squatty Potty cites as evidence that their contraption really works. Those of us in the Western world with our elevated latrines have two major problems where defecating is concerned: hemorrhoids and constipation. The Squatty Potty elevates your feet so you assume more of a squatting position, with your knees above your hips while still sitting on the toilet. The deeper you squat, the straighter your rectum becomes, making it easier to poop without straining. Reducing straining is good thing in general and can help flare-ups of painful hemorrhoids. In other words, comfortable pooping has a lot to do with geometry, and the Squatty Potty is here to help.I talked to Jacqueline Wolf, M.D., a gastroenterologist at Beth Israel Deaconess Medical Center and Associate Professor at Harvard Medical School, to see how the medical world views this trendy bathroom accessory. While the sample sizes of these scientific squatting studies are small, Dr. Wolf explains, she recommends a similar posture to her patients who have trouble emptying their bowels completely. She added that straightening the “angle of evacuation” in someone without any defecatory disorder isn’t necessary per say, but “...if people are in a real hurry, it may save them a minute.”“The truth is, it is an easy thing to try,” Dr. Wolf says. Years before the Squatty Potty was even a thing, she would tell her patients to use fat books to prop up their feet while on the toilet.After three weeks trying the Squatty Potty, I can say I’m a fan. I typically don’t have a terrible time going number two, so I’m not really in the target demographic, but things definitely did move quicker when I used it. Am I going to pack up my Porta-Squatty in its handy travel bag anytime I leave the house? Probably not. But if you come over and want to try it out, you’re welcome to pop a squat.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleWhat’s the Deal with Probiotics and Which Ones Should I Take?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-10", "author": ["Condé Nast", "Shaena Montanari"]}