{"id": "07c6c1a784268ed09aa0040f62cb1ae7", "url": "https://www.bonappetit.com/recipe/braised-tofu-and-chiles", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Braised Tofu and Chiles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueBraised Tofu and ChilesBy Chris MoroccoAugust 10, 20214.6(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTofu is ready to soak up anything you throw at it with the ferocity of a dehydrated marathoner. A brief hang with soy sauce, mirin, and sherry vinegar, along with a tangle of peppers and fresh chiles, means dinner is on the table in 30 minutes. Seeking out great tofu makes a big difference for the utmost in nutty-sweet taste and superior texture. Search for locally made options when possible, or keep an eye out for Hodo, which is increasingly available in many markets.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonGlass Measuring Cup$19.99 At AmazonMisen Chef's Knife$75 At AmazonIngredients4 Servings¼cup vegetable oil2red bell peppers, ribs and seeds removed, cut into 1½\"-wide strips4red chiles (such as cayenne, Fresno,jalapeño, or serrano), halved lengthwise, seeds removed3scallions, cut into 1\" pieces6garlic cloves, lightly crushed11\" piece ginger, peeled, finely chopped214-oz. packages firm or extra-firm tofu, cut into 1½\" cubes⅔cup mirin½cup soy sauce1Tbsp. sherry vinegar or red wine vinegarKosher saltCooked rice or rice noodles (for serving)PreparationHeat oil in a medium heavy pot over medium-high. Cook bell peppers and chiles, stirring occasionally, until lightly browned and softened, about 5 minutes. Add scallions, garlic, and ginger and cook, stirring often, until very fragrant, about 2 minutes. Add tofu, mirin, soy sauce, vinegar, and ¼ cup water. Bring to a simmer and cook, reducing heat as needed to maintain a simmer and basting and turning tofu often, until liquid is reduced by half and coats tofu, 15–17 minutes. Season with salt. Serve with rice.How would you rate Braised Tofu and Chiles?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleTo the anonymous reviewer whose feathers are ruffled by this... I'm not sure I follow your logic. Would it have helped if chris were Chinese? I didn't see anywhere where he claimed to invent this technique.\n\nI see value in adapting foreign dishes for ingredients and techniques more available in western kitchens (swapping the shaoxing for the mirin, the chiankiang vinegary for sherry, etc.). I think every one of my favorite chefs and recipe authors rarely come up with something completely from scratch. They are taking their ideas, interests, and favorite influences and putting their own twist on it or refining it in a way they prefer. That's basically every recipe on every single blog on the internet. \n\nTo try to gatekeep braising tofu on behalf of the Chinese people seems like a really weird way to try to posture yourself in the comments on a bon appetit article. Are you saying someone in China can't write a recipe for chili or fajitas or spaghetti for their followers? I sure hope not. Maybe if they claim to be inventing spaghetti, but that's clearly not what's happening here. Is Chris forbidden from writing a recipe that involves stir-frying in a wok as well? Do you see how quickly and systemically your logic falls apart?\n\nMaybe you were just having a bad day?John SpringerDetroit, MI12/10/2021To the anonymous reviewer: braising and marinating tofu with soy. Any more dense questions?Anonymous11/5/2021really wanna know what anonymous thinks a common Chinese technique isAnonymousNYC10/28/2021Here, Chris is pulling an Alison Roman and stealing a common Chinese recipe/technique, Westernizing it, and claiming it as his own. He has done this previously with other Asian recipes, so I'm not surprised it happened again. 1 star, because do better BA. Anonymous10/6/2021I was just looking for a quick and easy recipe one afternoon for tofu and I came across your recipe! I read through the ingredients list and realized I had everything for the recipe, so I decided to try it. I added all sorts of chilis including some dried Thai chilis, and it came come fantastic! It was so hot and spicy and quite flavorful! This is is the easiest and quickest way to add flavor to an ingredient that soaks it up like a sponge! Next time I make this, I'd like to fry my tofu first before braising. It's a definite thumbs up!T CaliRochester, NY10/1/2021Very good, easy, and efficient weeknight mealLane GriffinMontauk, NY9/8/2021Wow, so gooood. I can’t get my husband to eat tofu but I keep trying, and after 4 years, this recipe is the winner. It’s easy, pretty quick and delicious. You don’t need to change a single ingredient. Try it, it will convert those tof-haters. Genna GNew York, NY9/3/2021This was really awesome. I followed someone's recommendation of doubling the liquids and would definitely recommend that, but it comes at a cost--mainly the time it takes to reduce the sauce and then that time's effect on the consistency/coloration of the vegetables. I ended up adding a teentsy amount of a starch slurry as it wasn't reduced by half even at the 30-minute mark.\n\nWe also added some fermented red chiles from the Mala Market and were thinking, although it's not Sichuanese, the dish would be good with a myriad of Sichuanese ferments like doubanjiang or fermented black beans. You could also easily add spinach and many other things, but I think a large part of the beauty of this dish is how simple it is. Big thumbs up, Chris!\n\nThis one's definitely in the epic large-reward-to-effort-weeknight-meal rotation. \n\n\n\nJohn SpringerDetroit, MI9/2/2021Oh so yum. I'm not a tofu enthusiast but have been trying my hand at different styles to see what I like best. I usually go for fried, but this is honestly perfect. The sauce is so satisfying. I used a whole bunch of scallions because we are obsessed with scallions in our household. But other than that, this recipe is on point with it's balance of flavors. Bonus that it comes together in a snap. Perfect for an easy reheat.10/10 would make again! The KOMinneapolis, MN8/30/2021Wow. So flavorful, quick and easy. Love that you don’t have to press the tofu either. Will make this again for sure! SchmohawkDenver, co 8/22/2021Yum!  Simple, fast, and delicious! \nWhat more could you want?!! AnonymousDenver CO8/19/2021The recipe is solid. Next time I make it, I'll double the sauce, and fry or crisp the tofu before adding it.KaneDenver, CO8/17/2021Explore Bon AppétitRice and Grain BowlTofuOther IngredientsBell PepperVegetableChileSummerQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeVeganVegetarianBraiseLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Chris Morocco"]}