{"id": "07d3733ed64c6b0dcb925d0ebdaa5cf9", "url": "https://www.bonappetit.com/story/mayak-kimbap", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Mayak Kimbap Are Korean Mini Seaweed and Rice Rolls That You Can Fill With Nearly Anything You Like | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make Mayak Kimbap When I Want to Teleport to the Streets of KoreaFill these mini seaweed and rice rolls with spicy tuna, cooked Spam, or tons of vegetables.By Justine LeeApril 27, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I spent a semester in college traveling alone around South Korea. One night I was lost and wandering the streets when I somehow stumbled into Gwangjang Market. As one of the country’s oldest traditional markets, Gwangjang is the premier destination for top-notch street food. Missing home and life in the States despite being in my motherland, I was craving something carby and filling. That’s when I stumbled upon a stall piled up high with shiny seaweed rice rolls loaded with danmuji (pickled yellow radish), sautéed spinach, and shredded carrots. These, I soon learned, were mayak kimbap.Kimbap (also spelled gimbap) are rolls of cooked rice wrapped in seaweed. They’re a versatile, fail-proof snack or light meal found everywhere in South Korea from households to convenience stores. The traditional kimbap fillings include fresh or marinated vegetables, omelet-style eggs, cooked Spam, or pre-fried fish cakes, but you can also find less classic combinations. Kimchi and cheese kimbap, anyone? Heck, you don’t even have to put any fillings in at all—like bread and butter, seaweed (kim) and rice (bap) are a duo that goes a long way on their own.Kimbap can come in an array of different shapes and sizes, from the traditional kimbap rolled into long logs and cut into small slices to samgak kimbap, a triangle-shaped style. Mayak kimbap is a smaller-sized version that is said to have originated in Gwangjang Market over 40 years ago, where it was popularized at the Mo-Nyeo Woncho food stall. “Mayak” translates to “narcotic” in Korean, a testament to their reputation for being impossible to stop eating. What makes this kimbap irresistible, along with their petite size, is the sweet-umami mustardy vinegar dipping sauce it is served with. That night at the Mo-Nyeo stall, I sat there and ate one piece of mayak kimbap after another.Now I turn to making my own mayak kimbap when I’m super hungry with a fridge full of leftover bits of vegetables and proteins. It’s hearty, comes together in minutes, and instantly brings me back to Korea.To make your own mayak kimbap, take 4 nori sheets and cut them into quarters. (A pack of roasted seaweed snacks also works! Just don’t cut them.) Then grab 1 cup cooked short-grain rice prepared from your rice cooker or stovetop. Using a small spoon, place a heaping spoonful of rice onto a piece of roasted seaweed. Spread and flatten using the back of the spoon or slightly damp fingers. Lay a few pieces of julienned daikon radish, sautéed spinach, and shredded carrots side by side in the middle of the rice bed. Use both hands to tightly roll the kimbap up, starting from the shorter side, and then give it a light squeeze to shape and tuck the entire roll in place. Repeat with the remaining rice, seaweed, and fillings to get 16 mayak kimbap rolls. Once you have all of your kimbap, place on a serving plate, and brush lightly with toasted sesame oil, then sprinkle tops with a teaspoon or two of sesame seeds.To make the dipping sauce, combine 1 Tbsp. unseasoned rice vinegar, 1 tsp. soy sauce, 1 tsp. Dijon mustard, ¼ tsp. kosher salt, and 1 tsp. granulated sugar in a small bowl. Stir vigorously with a small spoon until the mixture is fully incorporated.I'll take all of these, thank you!\nPhoto by Isa Zapata, Food Styling by Pearl JonesFeel free to mix and match your fillings and have fun with them. A range of other ingredients can either accompany or replace the daikon, spinach, and carrot. Raw or pickled vegetables, like cucumbers, kimchi, or perilla leaves, will provide extra freshness or acidity.My favorite variation consists of spicy tuna, carrot, and daikon radish. I’ll buy cans of spicy gochujang-packed tuna from my local Asian grocer and crack one open come dinner time. But in a pinch, you could certainly doctor up a can of albacore tuna with a tablespoon of mayonnaise and a few dashes of your favorite hot sauce.While I truly love all types of kimbap, I am weak for all things miniature. Mayak kimbap are magical in that they’re teeny-tiny flavor bombs that can serve a crowd or simply fill a plate for one. Regardless, be prepared to make a second batch—restraint will be difficult to practice.Justine Lee is a food writer, recipe developer, and illustrator based in New York City.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-27", "author": ["Condé Nast", "Justine Lee"]}