{"id": "07e41b15ab6988c5fc11248f44a29cc1", "url": "https://www.bonappetit.com/story/were-starting-cookbook-club", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "We’re Starting a Cookbook Club at Bon Appétit, and So Can You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe’re Starting a Cookbook Club, and So Can YouHere’s how it works: Read the chosen book, cook a recipe that looks good, and eat delicious food with your friends.By Emily SchultzOctober 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn the words of Michael Jackson, “Ya gotta be startin’ somethin,” and guess what?! We’re starting a Bon Appétit Cookbook Club. Each month, we, the editors of Bon Appétit, will choose a cookbook we’re obsessed with, whether it’s one that’s hot off the press or the one that we’ve been cooking out of for a decade. On the first Monday of each month, we’ll announce that month’s cookbook, give you the low-down on what makes it a must-have, and share one of our favorite recipes from it. This month’s inaugural pick: Nik Sharma’s Season; read about why we chose it (and get the recipe for his curry leaf popcorn chicken right this way. Then, here’s how to get in on the Club:1. Find the book...from the library, from a bookstore, from your friend’s house, from one of those sites on the internet that sells things, whatever it takes.2. Find friends (or internet friends)Pass the cookbook around to all of your friends and get them amped up about Cookbook Club.3. Make a dateCraft that group text, then use a Doodle poll to pick a date.4. Decide who’s making whatCookbook Club is potluck-style. Get a Google Sheet going (to avoid duplicate recipes), and ask people to sign up for a recipe (or two) to make. You can also have a column for dietary restrictions, if you’re nice like that.5. Prep your dishIt’s the moment you’ve been waiting for, the time to cook your dish. Make sure you read the recipe a few days in advance, in case you suddenly find out you were supposed to soak almonds overnight, or something like that. Choose a recipe that you know will transport well (sorry, fried calamari) and bring your own servingware. If you need to reheat something, quickly whip cream, or chop some garnishes, ask your host if you can come over a few minutes early to prep; it’ll be way easier that way, trust us.6. PartyBreak out the triangular party hats, put on that playlist of good vibes, and open that Gamay you’ve been chilling: It’s party time. Have everyone bring a bottle of wine or the ingredients for a cocktail. (I’ve heard a pitcher of these spritzes is the move.)7. Tell us about it!Follow along right here on bonappetit.com, on Instagram (you follow us, right?), and in our newsletter (sign up for that here) for all of the updates on what our editors and readers are psyched about making from each book. Use the hashtag #BACookbookClub when you’re cooking for your party!Read more about Season right here.Explore Bon AppétitCookbookscookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Emily Schultz"]}