{"id": "07e90b55958a2ab9938fd573c7058120", "url": "https://www.bonappetit.com/story/a-case-for-vegan-filipino-food", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Making a Case for Vegan Filipino Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMaking a Case for Vegan Filipino FoodVeganized Filipino food can be a polarizing topic, but plant-based cooking is at the heart of the cuisine—and could help preserve it.By Jasmine TingOctober 6, 2021FacebookTwitterEmailPhoto by Luisa BrimbleFacebookTwitterEmailThe glossy, crispy skin and juicy meat of charcoal-roasted lechon; the charred gelatinous pork fat at the end of a barbecue skewer; the hearty marrow-enriched beef broth of bulalo: These are some of my fondest memories of Filipino cuisine. I’ve always thought of Filipino food as the ultimate comfort food. And for me that comfort always came with karne, or meat.When I first heard of vegan Filipino food—about five years ago, when I moved to New York from the Philippines—it sounded like an oxymoron. Some of our cuisine’s most popular dishes are adobo, typically made by braising chicken or pork in soy sauce and vinegar, and sizzling sisig, a mix of grilled pig’s face, pork belly, and chicken liver that’s topped with an egg. It seemed sacrilegious and inauthentic to take meat and animal products off the menu, and I’ve heard similar thoughts from friends, family, and many people in my community.Photo by Luisa BrimbleFilipino chef Jay-Ar Pugao was at the helm of a new vegan Filipino food movement when he started the Bay Area–based catering service No Worries in 2000 after his mother developed health problems related to her diet. Over the years he’s perfected his version of apritada (also spelled afritada), using soy chicken braised in a tomato-based stew with bell peppers, carrots, and potatoes. Relying on beets, black beans, and nori, he’s managed to mimic the shredded texture and briny taste of bagoong, the fermented fish or shrimp paste that’s used as an ingredient and condiment in many Filipino dishes.Pugao was excited to share this kind of food with other Filipinos, but he was met with resistance. “It was brand new to everyone, and so the transition for other people was hard,” he says. “I had to fight against my own culture for me to feed my culture.”Over the past decade vegan Filipino food has been growing as blogs like Astig Vegan, restaurants like Chef Reina in Brisbane, CA, and pop-ups like Kumare in Portland, OR, gain traction. More people, even former doubters like myself, are embracing the idea that Filipino food can be made vegan without losing its flavor or its soul. Not only is plant-forward cooking an ethos that existed before the Spanish, Americans, and Japanese came to Philippine shores, but vegan food may also be a way to keep the cuisine alive for a generation whose values are changing.Chef Mary Dee Moralita of Las Vegas–based pop-up O.G. Lola’s, which she started in 2019, observed that while the O.G. Pinoys still tend to be hesitant about vegan Filipino food, younger Filipinos—primarily millennials and Gen Z—are particularly interested in her food, like crispy lumpiang gulay (vegetable spring rolls) and vegan arroz caldo (ginger-based rice porridge) with crispy garlic and calamansi. That’s likely because younger Filipinos still want to eat the food they grew up with but have shifted their eating habits.Photo by Trina FrancoAnd then there are non-Filipino vegans looking to diversify their food options in search of more interesting flavors. A 2019 United Nations report identified plant-based diets as a major opportunity for mitigating the effects of climate change. Interest in strict veganism is rising in the United States, as is a flexible approach to plant-based eating as consumers’ priorities change. A 2021 survey by research firm Global Data found that the majority of respondents were influenced by how ethical, environmentally friendly, or socially responsible the products they purchase are.“Meat was never the star of Filipino cuisine,” says chef and cookbook author Yana Gilbuena. Instead, she says, what makes it so good are the complex layers of flavor created by sweetness, saltiness, sourness, and spice, as well as the variety of textures. At her SALO Series kamayan dinners, she serves what she calls “decolonized Filipino food.” Diners eat kamayan style, off banana-leaf-covered tables and using only their hands—a nod to the way Filipinos ate before colonization. The food includes traditionally vegan dishes like ginataang munggo, a coconut milk mung bean stew, and ensaladang lato, a fresh salad that combines a seaweed variety known as sea grapes with tomatoes, onions, and vinegar.As Gilbuena points out, before the Spanish colonized the Philippines in 1521, the people lived off the land and sea, cooking with whatever ingredients they could get their hands on. While there were undoubtedly fish, wild pigs, and chickens during that time, native crops were the primary source of nutrition. Fruits and vegetables are so integral to daily life that 18 of them—from singkamas (turnip) to luya (ginger)—are mentioned in the longstanding nursery rhyme “Bahay Kubo,” the name of which refers to the thatched homes of the Indigenous people of the Philippines.During Ferdinand Magellan’s expedition to the Philippines, Italian scholar Antonio Pigafetta wrote accounts about the Indigenous groups he encountered in the 16th century. In those entries he identifies bananas, sugarcane, and kamote (sweet potatoes) as staple foods, in addition to the many uses of palm trees: from the heart of palm extracted from its tree, to the coconut meat, oil, milk, and water from its fruit. He described rice as essential to the native diet in the same way that bread was to European culture. But with the influx of Spaniards to the Philippines came European domesticated cattle, pigs, and chickens, and the introduction of these species, taking over the native wild animals, changed how Filipinos ate forever.In a span of over three centuries, the Filipino diet came to feature meat more heavily. Gilbuena says, “Going toward the plant-forward dishes [is] a way of decolonizing the cuisine and saying, let's go back to our roots of eating literally what was growing in our backyard or in our farms.”While vegan Filipino food can honor pre-colonial culture and culinary traditions, the use of new plant-based “meat” products is also an example of the adaptation that’s at the heart of Filipino food as a whole. The layered flavors that Gilbuena thinks exemplify the cuisine are the result of a mix of foreign influences, born out of international trade and the Spanish occupation of the Philippines. Native cooks adopted and borrowed elements from Malay, Spanish, Mexican, Chinese, Japanese, and other cuisines and adjusted them to cater to local tastes and available ingredients.Filipino food historian Doreen Fernandez called this process “indigenization.” She wrote in her 1988 study “Culture Ingested” that the process starts with a foreign element but “ends with a dish that can truly be called part of Philippine cuisine.” Take the cooking method of gisa, or sautéeing, she wrote. Indigenous people cooked by sour-stewing, boiling, steaming, roasting, and serving food fresh or raw. Gisa, meanwhile, was learned from the Spanish, who sauté food in olive oil with onions or garlic, and also the Chinese, who stir-fried their noodles, vegetables, and proteins.But Filipinos made sautéeing their own. As Fernandez wrote, the garlic needs to be fragrant and golden brown before adding in the onions, which must then be turned soft and transparent before adding in sliced tomatoes. It doesn’t matter what else one adds after that as long as the garlic, onions, and tomatoes are all used and cooked in this order. “This preliminary process can Filipinize anything—cauliflower, leftover fish, scrambled eggs, noodles, paella, and even canned mackerel from Japan,” Fernandez wrote.I think this idea of making things our own applies not just to gisa but other Filipino cooking techniques. Whether you choose to make jackfruit adobo, mushroom sisig, or Beyond Meat lumpia, it can still retain the soul of Filipino cuisine. In this way, vegan Filipino food can be thought of not as the veganization of Filipino food but rather the Filipinization of vegan food.The challenge for chefs lies in finding ways to capture the same flavors to keep the sentiment and nostalgia attached to the original dishes. Pugao admits, “You can't mimic everything.” In 21 years of plant-based cooking, he’s never quite nailed a vegan alternative for dinuguan, pork offal stewed in a thick, dark, savory gravy made of pig’s blood, garlic, chile, and vinegar.Photo by Trina FrancoGilbuena says that she’s struggling to develop a vegan recipe for La Paz Batchoy, a rich noodle soup made with chicken stock, beef loin, and pork offal and topped with crushed pork cracklings. “It's so tough to think about how am I going to make that rich broth that's made of different bones that have been simmering for hours and hours?” she shares. “I've tried to make it with mushrooms. I would say it's great, but it lacks that depth and that umami.”Filipinized vegan food is still a work in progress. But all cuisines are continually evolving as chefs innovate to make use of new technologies, as diners change their desires, and as the world changes. “Being able to adapt these dishes that are so sentimental with a plant-forward lens definitely has to be the way forward, because we are now definitely experiencing the effects of climate change,” Gilbuena adds. “It's not about whether we want to, it's more like we have to at this point.”It’s a matter of human survival—and perhaps the cuisine’s as well. Undeniably, the world around us is changing, and so are we. Through vegan Filipino food, Moralita says, “We can continue to pass on our recipes and keep our culture alive.”Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-06", "author": ["Condé Nast", "Jasmine Ting"]}