{"id": "07f243c65f01741711477fff9f23ba37", "url": "https://www.bonappetit.com/recipe/caramelized-banana-pudding", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Caramelized Banana Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramelized Banana PuddingBy Kat BoytsovaAugust 28, 20184.3(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintRoasting the bananas cut side down in their skins concentrates their flavor, adding a layer of complexity to this otherwise super-simple classic.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonMedium Saucepan$39 At AmazonWooden Spoon$6 At AmazonImmersion Blender$100 At AmazonMedium Bowl$17 At Amazon8x8\" Baking Dish$15.99 At AmazonPlastic Wrap$9.84 At AmazonIngredients6–8 servings¾cup plus 2 Tbsp. sugar, divided1tsp. ground cinnamon, divided6medium bananas (yellow but not yet browning)3Tbsp. cornstarch¼tsp. kosher salt2½cups half-and-half, divided1Tbsp. unsalted butter1½tsp. vanilla extract1½cups sour cream15graham crackersPreparationStep 1Place rack in bottom third of oven; preheat to 450°. Line a large rimmed baking sheet with parchment paper. Sprinkle ¼ cup sugar and ½ tsp. cinnamon evenly over parchment.Step 2Using the tip of a knife, poke holes all over 6 bananas, then cut in half lengthwise. Arrange bananas cut side down on parchment, moving them around so cut sides pick up as much cinnamon-sugar as possible.Step 3Arrange bananas in a single layer and roast until skins are deep brown and sugar seeping from underneath bananas is deep amber, 15–20 minutes. If any liquid leaches out of the bananas, discard. Let bananas sit until cool enough to handle.Step 4Meanwhile, whisk 3 Tbsp. cornstarch, ¼ tsp. salt, and ½ cup sugar in a medium saucepan. Very slowly stream in 2½ cups half-and-half, whisking constantly, until lump-free. Cook over medium heat, whisking constantly and vigorously, until pudding is bubbling and thick enough that wires of whisk leave a trail, 7–10 minutes.Step 5Remove from heat. Stir in 1 Tbsp. butter and 1½ tsp. vanilla until smooth. Let cool slightly.Step 6Scrape 4 caramelized banana halves into pot with pudding; discard skins. (Save the remaining 8 halves for layering and decorating the top.) Purée with an immersion blender or transfer to a food processor and process until smooth and creamy. Let cool while you prepare your other ingredients. The pudding should be warm but not hot when assembling (you can also make the pudding ahead of time, chill, and assemble cold).Step 7Whisk 1½ cups sour cream and remaining 2 Tbsp. sugar and ½ tsp. cinnamon in a medium bowl until sugar is dissolved (this could take several minutes).Step 8Remove remaining 8 bananas from their skins (you may need to use a butter knife to help scrape bananas from parchment paper).Step 9Time to assemble: Lay 4–5 graham crackers in a single layer in an 8x8\" baking dish, then spoon about one-third of sour cream mixture evenly over crackers.Step 10Spread half of banana pudding over sour cream, then top with 3 banana halves.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Repeat with 4–5 more graham crackers, half of remaining sour cream, and all of remaining banana pudding (do not add more bananas).Step 12Top with 4–5 more crackers, then spread remaining sour cream mixture over, working to edges of dish.Step 13Arrange remaining 5 banana halves decoratively over.Step 14Cover and chill pudding for at least 4 hours and up to overnight to meld the flavors.Step 15Do Ahead: Pudding can be made 3 days ahead. Cover with plastic, pressing directly onto surface, and keep chilled.How would you rate Caramelized Banana Pudding?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleWow, this sounds like a Great variation on an old classic recipe\nAnd Yes, we have just recently demolished 13x9 pan of my own version ...the differences being; Whole Fat Plain Greek Yogurt(or strained plain yogurt if GY is unavailable) in lieu of yummy Sour Creamiest! ( My Mother would definitely approve of Your option although She, happily, gobbled mine🤗- but isn't that why we bake?!?)\nAlso use a easy prep baked in bar-form variation on King Arthur Flour's recipe for GingerSnap cookie recipe as the base...familial & personal preferences opt for a wee spicier Snap!\nHowever, I do Thank-you for the Banana flavou-enhancing tutorial; I shall definitely use it on! Seems the flavours are a bit wanting and I cannae abide faux-flavourings\nSince it seems Ive always macerated most other Fruits one way or another for enhancing fruits flavour & reducing their liquid content. I shall gratefully add this to my arsenal of tools and tricks-\n TYVM❣️\nHappy Baking, \nShe, who has a full-set of Sweet-Teeth\nMeConnecticut2/19/2022Really good! The sour cream and the caramelization of the bananas balances out the sweetness of the whole thing. I used graham crackers and enjoyed the slightly wheaty flavour. I didn't up the amount of pudding and thought the ratios were great. Got impatient and cracked into it after only 3 hours, and the crackers had still softened plenty. AnonymousNew York4/12/2020OMG! I just made this recipe. The sour cream gives another dimension in the classic banana pudding. My husband and I love it. It is not too sweet. I followed some advises as I read the reviews: increase 50% of the amount of the banana filling and change the graham cracker to vanilla wafers. I chopped the caramelized bananas and made another layer between everything. It is a keeper!Anonymous381221/1/2020Hot Damn. I swapped the graham crackers for classic vanilla wafers, and this was a huge hit with my fam.miabellacellaAustin6/19/2019The flavors were delicious.  I did use vanilla wafers instead of graham crackers. The \"pudding\" part of the pudding was too thick, and there wasn't enough of it compared to the other layers.  Next time I would add 1 1/2 c. milk to the pudding mixture (I would not increase the cornstarch).drfoheadPhiladelphia, PA5/22/2019This pudding was phenomenal and is officially the dessert that I’m bringing with me everywhere.  I used vanilla bean vanilla wafers from Trader Joe’s instead of graham crackers and they knocked it out of the park.  Whether you’re a fan of sour cream or not, the flavor is incredible when it melds with the pudding, wafers, and vanilla.  5 outta 5 I would definitely recommend.  AnonymousSaint Louis, Missouri 1/7/2019The take away for me are the caramelized bananas.  I found the pudding a bit too rich and that included substituting some milk instead of using all half and half.  The graham crackers added a grainy texture. I will go back to a more buttery cookie such as a vanilla wafer.  If there was an icon between the thumbs up “Yes!” and the thumbs down “No!” I’d check that.  Yes..I’ll make it again but with a lot of changes. moimoi222NY10/31/2018Ummm yes. The banana satisfied my deep southern roots, and the complexity lent from the sour cream and caramelization fed my world taste. Delicious.AnonymousTennessee9/22/2018Ummm no. Maybe it's the Southerner in me but I would never make this. I was almost with it(try something new) until they pulled out the sour cream and grahm crackers.iris1620Miam,Fl9/15/2018Very tasty dish. And this is a great way to add a rich banana flavor to puddings. However, I didn't like the graham crackers so swapped them out for Vanilla Wafers. mooreahNJ9/11/2018It looks so good, and I just made it, it is chilling in the fridge, but just from tasting it, I can already say, it is going to be really good. The serving sizes in the States must be much different from those my family considers a serving, next time I will definitely make a double batch, and also set some aside in extra containers for my kids to take to school the next day. \n\nCheers,\nCorinnaFrau MahlzahnEurope, currently living in Shanghai9/2/2018Explore Bon AppétitPuddingDessertAmericanBananaFruitGraham CrackerOther IngredientsCinnamonHerbs & SpicesEasyNut-FreeSimmerRoastMemorial DayLabor DayBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-28", "author": ["Condé Nast", "Kat Boytsova"]}