{"id": "07f481c8d3fdbac5352ce9cdb58dd9a2", "url": "https://www.bonappetit.com/recipe/almond-and-raisin-agrodolce", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Almond and Raisin Agrodolce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueAlmond and Raisin AgrodolceBy Andy BaraghaniFebruary 13, 2018EmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintSpoon this chunky condiment over baked fish, roasted veg, or pork chops.IngredientsMakes about 1 cup¼cup chopped golden raisins¼cup white wine vinegar⅓cup extra-virgin olive oil¼cup chopped skin-on almonds1small red onion, very thinly sliced, rinsed, patted dry½tsp. finely grated lemon zest¼tsp. crushed red pepper flakesKosher salt½cup parsley leaves with tender stemsPreparationStep 1Place raisins in a medium bowl and pour vinegar over (it should cover raisins). Let sit, stirring occasionally, 10 minutes for raisins to soften.Step 2Meanwhile, combine oil and almonds in a small skillet and set over medium heat. Cook, stirring occasionally, until flesh is golden brown, about 5 minutes. Transfer to a small bowl and let cool.Step 3Mix raisins, onion, lemon zest, and red pepper flakes into almonds; season with salt. Let sit 10 minutes.Step 4Toss in parsley just before serving.Step 5Do Ahead: Agrodolce (without lemon zest and parsley) can be made 3 days ahead. Cover and chill. Bring to room temperature before using.How would you rate Almond and Raisin Agrodolce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDo I have to drain the raisins or add the vinegar to the agrodolce too?AnonymousBrazil5/23/2018Explore Bon AppétitCondimentItalianEuropeanAlmondNutRaisinDried FruitFruitQuickEasyDairy-FreeGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Andy Baraghani"]}