{"id": "07f49276a0298d7ed961023bb502cb26", "url": "https://www.bonappetit.com/story/best-mandoline-slicer", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "The Best Mandoline Slicer for Perfect Gratins, Tidy Spring Rolls, and Stunning Salads | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingA Mandoline Does Things No Knife Can DoBenriner makes the best mandoline slicer, and it will change your salad life forever.By Andy BaraghaniOctober 20, 2021FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I remember the exact moment I was introduced to the Benriner mandoline slicer, a.k.a. the kitchen tool that changed the way I cook. I was 16, working on the line alongside a much wiser cook named Tamar Adler (who went on to write An Everlasting Meal). After spooning warm brandade onto toast, she braced her plastic, mint-green mandoline against her cutting board and slid a fennel bulb against the stainless-steel blade. The bulb gave way immediately into feathery, sheer wisps—the visual and textural topper I didn’t even know the dish needed. A decade, five restaurants, and three test kitchens later, I can say without a doubt that, after my chef’s knife, the mandoline is the tool I reach for most. With a swipe against the sharp blade, veggies that are otherwise a pain to prep turn easily into uniform, thin slices. Raw fibrous beets are transformed into translucent disks. Cucumbers become paper-thin ribbons. A mandoline takes your cooking to a whole new aesthetic level (now you know how chefs make salad look so good). Super Benriner Mandoline$96 at Amazon$75 at Sur La TableBenriner, which has been making mandoline slicers since the 1940s, is the best in my opinion. This Japanese mandoline isn’t just more efficient than a knife; it does things no knife can do. Benriner updated the design in 2018, and although it’s a little flashier than the one Tamar kept in her kit, it’s still easy to use—even if you’re a beginner home cook—and sharp as hell. (You can also find the old version on Amazon at bargain prices.) The new Benriner handheld mandoline—which comes in Classic, Super, and Jumbo sizes—has an adjustable straight blade. With a twist of a knob on the underside, you can tweak the thickness setting depending on whether you want razor-thin garlic or thicker potato rounds for a gratin. Also included are three julienne blades of different thicknesses so you can slice carrots into delicate matchsticks for gado-gado rolls or potatoes for french fries. When the blades gets dull, just unscrew the knobs on either side to remove and swap them out—a nice money-saving feature compared to other vegetable slicers with non-replaceable blades. Benriner Mandoline (Old Version)$34 at AmazonA note on safety: Mandoline blades are no joke, so make sure you hold whatever you’re slicing in your palm with your fingertips out of the way. Or use the Benriner’s sturdy hand guard, which grips food on one side and protects your fingers on the other. And if you’re still nervous about those blades, get yourself a pair of cut-resistant gloves.Cut Resistant Gloves$13 $11 at Amazon3 ways to use a mandoline:Rounds: Circles of cukes, beets, kohlrabi, or radishes make a crunchy salad base or chic garnish, depending on what slice thickness you select. If you want to attempt homemade potato chips, this is your cut.Ribbons: Anything oblong—carrots, zucchini—goes from unwieldy to elegant faster than a makeover montage.Matchsticks: The scary blades with teeth-like prongs are for shredding and making julienne cuts—but if you lose those extra blades, you can always just shave your veg into slices, stack, turn, and slice again with a knife.Use your mandoline to make this now:Asian Pear Salad With Peanut-Lime DressingThis sweet-tart salad gets its satisfying crisp-crunchy texture from floral Asian pears and nutty raw cauliflower.View RecipeThe other tool Andy can’t live without?This piece was originally published in 2017 and updated in 2021.Explore Bon AppétitToolsmandolineShoppingBA RecommendsStaff PicksRead MoreshoppingThe Tool That Changed the Way I CookBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-09-13", "author": ["Condé Nast", "Andy Baraghani"]}