{"id": "07fc96232a8312bc1ed5aeb4637c4470", "url": "https://www.bonappetit.com/story/dolly-parton-dinner-party", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "Dolly Parton’s Dream Dinner Party Has Lots of Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDolly Parton’s Dream Dinner Party Has Lots of CakePlus barbecue ribs, a casual vibe, and a rather iconic mix of guestsBy Dawn DavisJanuary 31, 2022FacebookTwitterEmailIllustration by Lauren TamakiFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Country music icon and 51-time Grammy nominee Dolly Parton knows how to write a moving lyric and sing a beautiful song. She also knows her way around a kitchen—and, like so many of us, occasionally swipes at frosting instead of waiting for the whole cake. Here she reveals who she’d invite to her dream dinner party and what she’d serve them—including, of course, banana pudding cake from her brand-new and already sold out collaboration with Duncan Hines.If you could have any three guests—real or fictional, deceased or alive—to your dream dinner party, who would they be?I’d have Jesus at the head of the table. And I’d also invite Dr. Martin Luther King Jr., and Elvis.That’s some gathering! What do you make for this group of mostly Southerners?For Elvis I’d make a peanut butter and banana sandwich. I’d make something good and Southern for me and Dr. King. I’m sure he’d love some collards, as would I. Of course, we’d have to have some barbecue ribs. There’s nothing I love better, especially when it comes with a good sauce, which makes all the difference. I like my sauce between sweet and vinegary. And I like my barbecue to be real tender so I don't have to gnaw on that bone. Now, Jesus, that’s another story. He may not want to eat. But just in case, I’d make sure we had some milk and honey. The others could drink sweet tea. Before we dove in I’d ask Jesus to bless the whole thing.For dessert I’m assuming you’ll serve one of your new cakes from your collaboration? Is cake your favorite dessert?Banana pudding is my favorite dessert—real banana pudding in a big bowl. That’s what inspired me to do a banana pudding cake collaboration with Duncan Hines. It’s very good; I think you’ll agree. I’d also serve the other cake in the line, our coconut cake. People in the South like to bake a coconut cake for special occasions because it looks impressive and is delicious. I’d use our buttercream frosting too. I’d serve it with coffee or milk. I love cake and milk.Speaking of your new cake line, have you ever made a cake from a box mix and passed it off as your own?We’ve all done that. The other thing I’ve done is eat more icing than cake. I’m like a kid. If there is something sweet, I’m going to eat it.What’s the ambience and topic of conversation?It’s casual. I’d want them to feel welcome in my home and wear what they’re comfortable in. I’d do the same. We’d talk about the gifts we have. What we have done so far to help people and what we can continue to try to do. I’d be asking Jesus a lot of questions. I’d be talking music with Elvis. And I’d thank Martin Luther King Jr. for all that he did and continues to do even though he’s gone. We’d have lots of good stuff to talk about.If, after the dinner, Elvis wants to go to Dollywood, where in the amusement park should he eat?We’ve got great restaurants all over the park. Restaurants that serve real Southern foods: barbecue, corn on the cob, and all of that. But we have a resort called DreamMore and there is a restaurant attached to it, Song & Hearth. People just love the food. He might like that or he might like Aunt Granny’s.Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-31", "author": ["Condé Nast", "Dawn Davis"]}