{"id": "080a3e83cdd22db3f08573f5ecee57f3", "url": "https://www.bonappetit.com/story/december-2019-horoscopes-starbucks", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Your December Horoscope: A Starbucks Order for Every Sign | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour December Horoscope: A Very Specific Starbucks Order for Every SignSometimes you’re just in the mood. By Catherine UrbanDecember 1, 2019FacebookTwitterEmailIllustration by Tiago MajuelosFacebookTwitterEmailThey say you can tell a lot about someone by their most elaborate Starbucks order (aka “diva coffee order”). It’s sort of like a star sign in that way. You were born this way! That’s why your December horoscope is a complicated Starbucks beverage, which is somehow not sponsored. We were just in the mood, probably because of the holiday cups. So get it line, enunciate your name, and stop looking for the CDs at checkout—they don’t do that anymore.AriesIf recent deep thinking has given you a headache, this month, get plenty of fresh air. Lighten up and loosen your grip. Whatever issue you’re trying to solve, don’t pressure yourself to figure it out in one swoop. And you’ll have plenty of time to mull it over when you’re in line at Starbucks waiting for your Pumpkin Spice Latte with an extra shot of espresso, which you tell the cashier twice, emphatically. The cinnamon, nutmeg, and clove vibe with your innate warmth. But that extra shot of espresso? Not gonna help you solve that problem any faster, Aries.TaurusIt’s HAPPENING, Taurus. Your romantic life is about to get heated. Hot. Passionate. But curveballs may also be on the menu for you and your partner this month. Best advice? Try to be open. Some salty surprises might turn out to be incredibly sweet... like a Salted Caramel Mocha Frappuccino (with extra pump of “mocha sauce”). Just don’t overdo it on that sauce.GeminiA full moon in your own sign mid-month is a good omen. You did it, brainy Gemini. Look at the beautiful creation (or mess) you’ve made in 2019. Remember to breathe and keep it simple this month. Order a drink that’ll help you stay level, a Nitro Flat White. There’s sweet espresso in there, and nitrogen-infused milk that creates a velvety layer of not-quite-foam on top. So stable. So in control. So in the moment.CancerIt’s the end of the year and you’re feeling DONE-ZO. Certain relationships have run their course and in fact, you’ve got a whole 2019 ditch list in the works. Nice. 2020 is going to start with a bang of introspection and self-care, which is why you’re suddenly ordering a Chestnut Praline Latte with Coconut Milk. You know what you like, secretly-highly-particular Cancer, so go ahead, ask the barista for those holiday sugar sparkles on top too.LeoYou’re super energetic and driven this month, checking off your holiday to-do list like a well-caffeinated elf in Santa’s workshop. But you’re also competitive by nature, so there’s that. Whether you’re burning the midnight oil finishing an assignment for work or composing a Tik Tok masterpiece, look alive and stay hydrated with a hot pink Hibiscus Lemonade Refresher (freeze-dried berries optional). Remember that sometimes ya gotta cool down, fiery Leo.VirgoYou take the things you love seriously, Virgo, from your favorite books to hosting themed holiday parties. But you’re also crafty and creative, and that’s where you thrive artistically and professionally. Indulge your crafty side this month by ordering the secret Off-Menu Butterbeer Latte. Toffee nut, caramel, and cinnamon dolce syrups get in there somehow. There’s extra caramel on top. You can admit it’s mostly sugar, and that you’re definitely a Hufflepuff—and that’s why we love you.LibraAs an air sign, you spend a lot of time in your own head. But this month, you’re onto something brilliant. Your work life is headed in a productive new direction because you’re learning to work smarter, not harder. You’ve heard that one before, right? Fuel that whirring brain with a Green Tea Almond Milk Latte. Like you, it’s a study in balance: sweet and bitter, herbaceous and creamy all at once.ScorpioYou’re as calculated as they come, Scorpio, but lately you’ve been more breezy—buying generous holiday gifts (for yourself), picking up the tab at the holiday office party after-party. So this month you’ll get serious again about your long-term financial goals. You might be cleaning up your act, but you’ll still need a sweet and spicy Dirty Chai Latte. That extra shot is just like you: determined to get sh*t done.SagittariusYou typically fly by the seat of your pants, but life just got real, didn’t it? You need to get focused...or at least procrastinate less. Whether you’re trying to finish a program/degree/1000-piece puzzle or sell your house, you’ll be hyper-aware of time this month. And you might spend some time waiting for the barista to prepare the fantastical off-menu “Pink Drink”—a concoction of acai, rehydrated strawberries, passionfruit, and coconut milk. We’re not sure how much it’ll help you get focused, but at least it’s a nice distraction from that serious stuff.CapricornYou’ll be feeling like a boss this month (but aren’t you always?) You’ll be “good-busy” with year-end parties and events. Whatever you put a lot of energy into this year is going to see some payoff—or some celebration. Pre-game all the parties with a Caffe Misto with cinnamon powder dusted on top. It’s just café au lait but it sounds fancier this way, doesn’t it? If you’re craving fancy this month, Capricorn, don’t shy away from it.AquariusAnxious much? You never really show it, but yes, big changes in your personal life are approaching and your gears will be constantly churning this month. If you need to blow off some steam, reach out to your friends—they’ll be there for you, as the song goes. Swap your usual cortado order for a sort of ridiculous Nitro Cold Brew with Sweet Cream. Like you, it’s much sweeter than it gives on.PiscesThis has been a big year of dreams coming true for you, Pisces. Maybe not all of them, but hey, you’re a dreamer by nature and that’s a lot to keep up with. This month, contemplate how you might like to give back so that others can get ahead too. You’ve always had elaborate Starbucks orders, but have you tried the Cocoa Cloud Macchiato? A dense layer of fluffy foam holds up a mess of three types of syrup that would impress Jackson Pollock. It’s sweet and ridiculous, just like you.Catherine Urban is an astrologer in Cleveland is the author of Your Astrological Cookbook: The Perfect Recipe for Every Sign.Explore Bon AppétitFood HoroscopesStarbucksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-01", "author": ["Condé Nast", "Catherine Urban"]}