{"id": "081bd4f877a28916bb3c519f3c58b75a", "url": "https://www.bonappetit.com/story/macaroni-and-peas-always-satisfies", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Macaroni and Peas Is the Desperation Meal That Always Satisfies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMacaroni and Peas Is the Desperation Meal That Always SatisfiesFor when your fridge is nearly empty, and you’re running on zero patience.By Maddy Sweitzer-LammeSeptember 9, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Whatever the reason—a long journey home from travel, an impossible day of work, a Thursday after your meal prep runs out—there’s a special type of desperation that sets in when you’re exhausted, starving, and can’t find a single thing in your crisper to cook for dinner. In those moments I turn to macaroni and peas.The combination of pasta, Parmesan or Pecorino cheese, and frozen peas is one that I can almost always summon from the depths of my kitchen. I was raised to believe you should always have a hunk of cheese on hand, and Parmesan is a hard, aged dairy product that can live happily in the back of a fridge for a very, very long time. I like to keep a box of tiny shells tucked into my pantry for this dish, but of course it does work with pretty much any pasta. And the bag of frozen peas that I occasionally use as an ice pack transforms it from a bowl of beige, cheesy pasta into a meal that almost feels healthy.To make enough for two, bring a pot of salted water to a boil over high heat. Throw in about a cup of small pasta and cook according to the package instructions. Meanwhile, use a microplane to grate about 1½ cups of Parmesan and/or Pecorino cheese. There’s a time for al dente pasta, but this is not that moment. Instead, cook the pasta all the way, then add about a cup of frozen peas directly to the water with the pasta and let it come back to a boil. Scoop out and reserve about a cup of the pasta cooking water, drain your pasta and peas into a colander, and then return them to the still-hot pot along with the grated cheese, a splash of pasta water, and several cracks of black pepper. Stir until the cheese is melted and coats the noodles, adding more cheese if needed and a bit more pasta water if things look too tight. Taste and add more cheese and pepper to your preference, and eat immediately for the best, cheesy, comforting, better-than-from-a-box experience.The best part of this dish is that it is endlessly adaptable. You could sub in frozen broccoli if peas aren’t your jam, or toss in whatever green thing is wilting in the back of your fridge. You could switch between Parmesan and Pecorino, or do both. A little bit of aged cheddar or another hard cheese would be a stellar addition to the mix. And if you happen to be cooking for a picky child, this is a good back-pocket deal as well.If I’m being honest, in addition to desperation, this dish is born out of a desire to eat Annie’s White Cheddar Macaroni and Cheese as often as possible without my insides turning into powdered cheese. It’s a bit like cacio e pepe (you could certainly call it cacio e pepeas if you were looking to class it up a bit), but we’re not trying to impress anyone with this one. We’re just trying to cook up something that we can put in a bowl and possibly eat in bed before completely passing out. Mission accomplished.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-09", "author": ["Condé Nast", "Maddy Sweitzer-Lamme"]}