{"id": "082d19f2c5b54f4c2ca7974736c567ab", "url": "https://www.bonappetit.com/recipe/mojo-sauce", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Mojo Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMojo SauceBy Molly BazApril 10, 20204.7(24)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis zippy chile-and-garlic-packed Cuban sauce is often used to marinate slow-roasted pork, but we’d be happy putting it on just about everything. If you’re spice sensitive, split the chiles in half lengthwise and remove the seeds; they hold much of the heat.IngredientsMakes 1 ¼ cupsJuice of 1 orangeJuice of 2 limes1serrano chile or jalapeño, stem removed, split lengthwise1garlic clove½cup cilantro springs⅓cup olive oil2tsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher saltPreparationBlend orange juice, lime juice, chile, garlic, cilantro, oil, sugar, and salt in a blender until mostly smooth but still specked with herbs. Transfer sauce to a small bowl.Do Ahead: Sauce can be made 2 days ahead. Cover and chill.How would you rate Mojo Sauce?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleAs a preface, I just found this recipe so I obviously haven't made it yet, but I have a few comments on the recipe.\n\nIt would be nice if you could give approximate liquid amounts with your orange and lime juice ingredients so I know what I'm aiming for, because as you know - oranges come in many sizes and limes are often not very juicy.  Also, you've got a typo.  It's cilantro sprigs, not springs.  Additionally, you need to review your Morton salt measurement for clarity, because I have Morton Kosher that is not in the blue box and those granules are huge.  BLSan Francisco, CA9/11/2021Can't wait to try this mojo next time I have pork loin or chicken on the menu at home.\nI only will change the juice of an orange to what most likely would be bitter oranges, the ingredient used in Cuban/Puerto Rican homes when making mojo. Thank you, BA!Carlos Prugue Rehoboth Beach, DE9/9/2021\"Mojo\" (pronounced moe joe) means a sort of magic.  But this is a Cuban sauce and like many languages there are more than one word for the same meaning.  In Cuban Spanish mojo (moe hoe) means sauce where a more common word in other Spanish dialects the word might be salsa.\n\nRicardo was right, it sounds weird to say \"sauce sauce\" but most people knows what Molly means. :)\n\nAnd this is a delicious mojo/salsa!SanaroSanta Barbara, CA6/28/2021Ricardo's linguistic comment may be accurate about Spanish, but not about English.  In English, \"mojo\" means a \"magic spell,\" \"hex\" or \"charm\" for almost a century.  The origin is thought to be African.  Here, the name implies that this sauce works magic on  the foods it touches.  Sorry, Ricardo.KennCalifornia6/1/2021Sorry guys. It's just really weird to be reading \"Sauce Sauce\" as \"Mojo\" stands for Sauce in spanish.. :/RicardoPortugal5/11/2021It might have been the orange I used, but this was way too sweet for me. I ended up doubling or tripling the other ingredients to correct for the sweetness. I recommend leaving out the sugar to start out and adding it if you think you need more sweetness.claudiaMinneapolis11/24/2020yo this ish slaps -- Christina Chaey inspired me to grain bowl meal plan for the week and I searched \"cilantro sauce\" on the BA website to go with (guess what I have a ton of) -- I'm drinking this sauce straight from the vitamix, will douse everything in this jahgurlremyPortland Ore. 9/14/2020This is the hands down best mojo sauce: it’s so phenomenal especially for how easy it is. “Throw everything in the food processor” Is my favorite sauce type. The flavors are fresh and balanced. First used it on the mojo meatball BA recipe, but now just use it on everything! The first few times we followed the recipe exact, but my family loves heat so now we use habaneros instead of seranos. The fruitiness of the pepper goes great with the sauce. Make this!AnonymousEugene, Oregon4/25/2020I don't think it can get much better than this sauce - fresh, tangy, light, but strong heat and flavor. I used an extra jalapeno for extra heat. Fantastic, thank you for this gem. AnonymousWashington, DC4/19/2020Such a good tangy sauce! Mine came out a little too sour probably from the limes but super delicious so I would taste and season accordingly (:AnonymousFountain Valley, CA4/16/2020Explore Bon AppétitSauceCubanCaribbeanCilantroHerbs & SpicesDairy-FreeNut-FreeGluten-FreeVeganVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2002-09-01", "author": ["Condé Nast", "Molly Baz"]}