{"id": "083e975c160ccf990e4b6970bad78e59", "url": "https://www.bonappetit.com/story/never-fail-buttery-german-apple-cake", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "This German Apple Cake Cured Me of My Apple Fatigue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Buttery German Apple Cake Cured Me of My Apple FatigueIt is truly easy (no equipment required!), seriously impressive, and I never get tired of making (or eating) it.By Emma WartzmanNovember 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.We’re in the midst of Apple Season, the longest season of any fruit that exists. It stretches from late summer to late winter, and is rivaled in duration perhaps only by Potato Season, but potatoes aren’t even a fruit. So...back to apples.It is easy to get frustrated at apples, to take out your I’m-so-over-this-weather and why-isn’t-there-anything-else-at-the-market energy on them. I, for one, just stuffed my face with apple pie for several days in a row, made Apple Pandowdy twice for recent dinner parties, and had slices of this guy and this guy in the test kitchen. And this is not to mention the countless apples I have sunk my teeth into as a straight-up snack. I’m over it! Or at least I thought I was over it—until I met this Buttery German Apple Cake.The recipe came to us courtesy of a BA reader, submitted among hundreds for our annual Reader Recipe Challenge. It won for a reason. Listen, those other desserts I just mentioned are fantastic. You should make them. But there’s something about this cake that stands out, and this is actually because it is so much more than a cake. It is like a cake and a cookie and a tart all in one! Tell me you’re not intrigued.The base is a dough made from sugar, lemon zest, baking powder, salt, flour, egg, vanilla, and butter. You mush it all together in one bowl with a fork and then your hands. No equipment required. It should be a large, soft mass, almost of sugar cookie consistency. You press that down into a buttered springform pan with a removable bottom. Next spread a thin layer of apricot preserves over the surface, which is a genius way of giving a subtle, slightly different taste and ensuring a glossy look to the finished product.Don't get mad at apples! Just make this tart!!\nThen comes the topping, quartered apples sliced into shingles up until the very bottom so that each piece holds together. Shingles are beautiful! They make the dessert look fancy without much effort. You arrange those on top, pressing down slightly, and bake it. The dough puffs up a bit around the apples from the baking powder and what results is a crisp, golden brown bottom, a chewier middle from the release of liquid in the preserves and the fruit, and then slightly softened (but not mushy!) apples as the crown of the cake. It is a delight of textures (especially when served with whipped cream), and is the best way to cap off a cold weather dinner party that I know of.This is all to say: Next time you think you’re done with apples, think again.This way, to German Apple Cake bliss!Buttery German Apple CakeThis gorgeous cake uses a surprisingly simple method to slice the apples just so.View RecipeExplore Bon AppétitAppleNever FailCakeRead MorecookingWhy I’ll Never Buy Applesauce AgainBy Carla Lalli MusicApple PandowdyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Emma Wartzman"]}