{"id": "083f388f0595e50d294221210d080a09", "url": "https://www.bonappetit.com/recipe/roast-chicken-thighs-with-peas-and-mint", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Roast Chicken Thighs with Peas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueRoast Chicken Thighs with Peas and MintBy Katie Jackson, Nick Perkins, and Aaron CrowderMarch 19, 20194.2(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe’d go to our graves defending low-maintenance, quick-cooking, always-flavorful chicken thighs as the best part of the bird. This recipe harnesses their power by using the fat that renders when they’re seared on the stove to soften thick rounds of leeks and spring peas for a built-in side. Leave the chicken uncovered when it goes into the oven so the skin crisps up while cooking.Ingredients4 servings6skin-on, bone-in chicken thighs (about 2½ lb. total)1Tbsp. ground corianderKosher salt2Tbsp. extra-virgin olive oil3large leeks, white and pale green parts only, sliced ½\" thick4garlic cloves, thinly sliced52x1\" strips lemon zest2bay leaves⅓cup dry white wine1½cups low-sodium chicken broth1cup fresh (or frozen, thawed) peas1cup mint leaves, torn if largePreparationStep 1Preheat oven to 350°. Pat chicken thighs dry; sprinkle flesh side with coriander. Season generously all over with salt.Step 2Heat oil in a large high-sided or cast-iron skillet over medium. Cook chicken, skin side down, undisturbed, until thighs release easily from pan, about 4 minutes. Continue to cook, scooting chicken around occasionally for even browning, until golden brown, about 5 minutes more. Transfer chicken to a plate, skin side up.Step 3Pour out all but 2 Tbsp. fat from skillet and return to medium heat. Add leeks and garlic and cook, stirring occasionally, until slightly softened, about 3 minutes. Add lemon zest and bay leaves and cook, stirring, until fragrant, about 20 seconds. Pour in wine, scraping up any brown bits stuck to bottom of pan with a wooden spoon. Cook until wine is almost completely evaporated, about 3 minutes. Add broth and bring to a simmer. Return chicken to skillet, arranging skin side up. Transfer skillet to oven; roast chicken until cooked through and juices run clear when poked with a paring knife, 15–20 minutes. Transfer chicken to a plate.Step 4If using fresh peas, cook in same skillet over medium heat until tender and bright green, about 3 minutes. If using frozen, cook just until warmed through, about 1 minute. Toss in mint; season with more salt if needed. Arrange vegetables and chicken in a large shallow bowl or on a platter.How would you rate Roast Chicken Thighs with Peas and Mint?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleDelicious. Cooking for one here so I only made 4 thighs, used two leeks, and one cup broth. Came out better than expected and my thighs cooked through perfect with 25 minutes in the oven after pan-browning the skin. The sauce left in the skillet goes well over a starch (I had roasted potatoes but could easily see it over rice or farro). Definitely being saved to my recipe bookmarks.ChelseaTempleLosAngeles1/15/2021I love the combination of flavors in this recipe and will definitely be cooking again, but I’ll likely cook the chicken longer (10 to 15 minutes) in the oven for it to absorb the flavor from the sauce since the chicken was lacking taste.lanacnNorth Carolina 6/6/2020Really easy and delicious dish - flavours were super bright and fresh. Used asparagus instead of leeks because that's what I had in the fridge and it turned out great. Next time I would use slightly less chicken stock (maybe a cup instead of 1.5 cups) since the final result was a bit soupy. After everything was cooked I mixed a cup of cooked rice into the veggies and liquid.freshquinoaOntario, Canada5/8/2020Wow. Amazing dish! My husband and I gobbled that up paired with the white wine (really nice Sauv Blanc). The peas mix with the savory leeks and chicken broth soooo well. I used less liquid like one person suggested (1 cup instead of 1 1/2) and thought it was perfect. Also, like many other reviews I had to bake for about double the amount of time. I think in total it was in the oven for about 40 minutes after pulling it out and testing twice (probs depends on thigh size). I also added some asparagus because they are growing everywhere right now and it was a nice touch! Would make again!!AmyEckDetroit5/10/2019This was the first recipe I made from my subscription and it came out fabulously. I was hosting friends that were picky eaters and they even took a second helping. I suggest cooking a little while longer before oven transfer and giving the thighs a bit more coriander.AshleeeatsDetroit 4/24/2019Super easy and perfect for spring! I used chicken legs and frozen peas. I skipped the white wine and instead just added more chicken stock. Remember to remove lemon peel from the skillet (not in instructions).\n\nschweeze4/23/2019Too much liquid and not enough cooking time for the chicken. I think the amount of chicken stock could be reduced by 1/2 to 3/4 cup and that would be sufficient. I put the pan in the oven for 20 minutes and the leeks were perfect  but the chicken was undercooked. Ended up putting the thighs on a baking sheet to finish cooking - another 20 minutes or so at 350.AnonymousNew York4/23/2019I made this last night and it was an extremely tasty dish.  I found the cooking time for the chicken was perfect and I found it to be an extremely tasty dish and plan on making this again very soon.AnonymousMichigan 4/9/2019I plan on making this... cooking time looks off.  I find home ovens take 40min cooking time for thighs already skillet browned.  Excited!AnonymousChicago4/8/2019Something was off with this recipe. Surprisingly bland and the chicken cooking in the broth needed way longer. My mouth was watering when I saw it in print so I was really disappointed. I was triple checking the ingredients to make sure I didn’t leaving anything out! AnonymousNew York4/4/2019Explore Bon AppétitChicken ThighChickenPoultryLeekVegetablePeaMintHerbs & SpicesOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Katie Jackson", "Nick Perkins", "Aaron Crowder"]}