{"id": "0842d2a236815429f5d3a38e275bd6e4", "url": "https://www.bonappetit.com/story/feng-shui", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "5 Feng Shui Tips for Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Feng Shui Tips for Your Home, Because We're Not Going Anywhere Soon Feng shui master and interior designer Thierry Chow shares how to refresh a home, no expensive reno required.By Marianna CeriniOctober 1, 2020FacebookTwitterEmailIllustration by Joey YuFacebookTwitterEmailAfter seven months of getting way too closely acquainted with my apartment’s interiors, I decided to give it an overhaul. As I am renting, I didn’t opt for an expensive makeover. Instead, I turned to feng shui.The ancient Chinese discipline, which literally translates as \"wind water,\" focuses on how objects’ positioning and features can improve one’s health, prosperity, and luck. It also charts a space’s energy—known as qi—and, through a series of calculations, maximizes its positive flow to harmonize individuals with their surroundings.In Hong Kong, where I live, a lot of people consult feng shui masters to design their homes or offices. It’s even common for skyscrapers to be built following feng shui principles, with floor plans designed to ensure the best flow of qi throughout the building (Soho House); or round shaped windows, synonymous with coins and the sun, to symbolize prosperity (Jardine House). The practice relies on an intentional approach to one’s environment rather than grand and pricey design concepts. For anyone on a tight or not so generous budget (i.e. most of us this year) it provides a low-cost/ big returns opportunity for change.I was drawn to the idea of bringing better energy into my apartment—as well as simply freshening things up. To guide me, I sought the advice of Thierry Chow, a second generation feng shui master and interior designer known for blending the centuries-old practice with a contemporary aesthetic. “A good space should allow you to stay present,” she told me. Her tips have already helped my one bedroom apartment feel neater and more structured, with bursts of color making each room more vibrant, a bunch of new, inexpensive plants that seriously uplift my mood whenever I look at them, and a slightly different layout that gives it an airier look. Here, Chow shares five key elements for a feng shui redesign.Play with the elementsFeng shui divides the world into five elements: earth, wood, fire, water, and metal. Earth represents stability and security; wood symbolizes new life, growth and creativity; and fire is associated with action, passion, and fame. Water is tied to abundance, prosperity, movement, cleansing, and the flow of emotions; while metal assists with focus and clarity, health, wealth, and love. An ideal feng shui home should have each element equally distributed across all rooms to help release positive energy, and create balance, “the most important principle of feng shui,” as Chow explains.Bring in earth with stones, marbles, crystals or clay items. Wood can be introduced through plants—of which Chow is a big fan—and fire with candles and soft lighting. Water can be represented by a fish tank, fountains, or even photos (my computer’s desktop background now features a scenic picture of the Andaman Sea from my last pre-pandemic beach holiday. For the metal element, turn to anything that’s metallic, from bowls and small decorations to a new toaster.Have fun with colorsColors also express the five elements and, according to Chow, are one of the easiest ways to shift the qi and improve the vibes of your space. “Use colorful cushions and pillowcases, bed covers, prints, rugs, and even kitchen appliances to add vitality,” she says. “Flowers work, too.” While the philosophy recommends certain hues based on the space’s “energy map” (called bagua) and the direction each room is facing, Chow suggests just following your instinct. “Ask yourself, how does this color make me feel? Be mindful of what speaks to you, and really set different intentions for each area, then decorate it accordingly.”If you’re not quite sure where to start, Chow has a few general pointers: yellow (earth) can aid digestion and, being associated with gold, it’s great to have in the kitchen or at your dining table to signify abundance. Living rooms in soothing tones like beige (also earth) and brown (wood) can help create a relaxed atmosphere which can in turn promote good health. Bedrooms should have a “fiery” touch or two for a good sex life (red, purple, orange and pink). For your office corner go for white and gray (metal) to enhance focus, blue (water) for calm and green (wood) for new beginnings.Declutter“Decluttering is key to positive feng shui,” Chow says. “It opens up room for yourself.” To have good qi, she explains, it’s essential to release any stagnant energy by regularly purging and keeping things tidy—starting with your entryway.“The entryway is the first space you step in, and sets the tone for the rest of the apartment,” Chow says. “If you’re tripping over socks or shoes, the qi is going to be compromised from the get-go.” She suggests investing in a shoe rack, coat hanger, and storage units for your umbrellas, but also a plant or two (with round leaves, not pointy, as those are considered uninviting to good energy), to make the whole area more welcoming.If your front door opens straight into the living room or a hallway, try to create a faux foyer. Make sure the furniture and accessories around the area point to a clear path into the rest of your apartment and buffer the outside energy by placing a rug, a chair or artwork by the entrance. “The space should give you and your guests the chance to pause and collect yourselves before coming in,” Chow says.Additionally, clean up your workspace and clear out under your bed to let the qi circulate more freely and nourish you as you sleep. If, like me, you deem your under-bed storage space pretty essential, try to stock it with things that are energetically neutral: soft pillows and bed linens, seasonal clothing and blankets.Rearrange and assess your command positionsIf you always bump into a chair or the corner of your sofa, those items are likely hindering the house energy flow. “Imagine a river flowing through your apartment,” says Chow. “If it’s getting obstructed, something has to change.”Chow also suggests checking your command positions—essentially, the anchor points of each room, which best enable you to “control your energy and feel in charge of the space,” she says. Command positions are always farthest from the door, not in a direct line with it (though they should have a clear view of it), and with strong backing behind them—a wall, a cabinet, a bookshelf. Your bed, sofa, and desk should ideally be in a command position, so move them around, even just a little, if the layout allows.Lastly, and especially if you live in a small or open-plan apartment, add separations between spaces, so as to create clear energy pathways. I placed a second-hand IKEA Kallax between my tiny kitchen and living room, then filled it with books and storage baskets. Tall plants, rugs, and screens work, too.Hide your knives but show off your foodThe kitchen is a feng shui symbol of wealth and prosperity. For optimal qi, stow away anything that’s sharp—including your kitchen knives and utensils. “Having anything sharp on display is considered bad luck,” Chow says. Food, on other hand, should always be on display. Keep colorful fresh fruit in a bowl, store your rice, grains, and pasta in clear glass jars, reorganize your spice rack, and make it a focal point of your space.Explore Bon AppétitHealthyishInterviewsRead MoreLifestyleThe Little Doodad That Turns My Apartment into a Fancy HotelBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-01", "author": ["Condé Nast", "Marianna Cerini"]}