{"id": "0848da14be4b88fa85a8bf30eb18f9f6", "url": "https://www.bonappetit.com/story/botanica-restaurant-column-1", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Botanica Restaurant Column: We Left Our Dream Jobs to Open a Restaurant Across the Country | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Left Our Dream Jobs to Open a Restaurant Across the Country. What Could Go Wrong?A new column from the co-owners of Botanica chronicling the ups and downs of opening their first restaurant.By Emily Fiffer and Heather Sperling November 27, 2018FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailEmily Fiffer and Heather Sperling are two editors-turned-restaurant-owners in L.A. Their first restaurant, Botanica, is an airy all-day cafe in Silver Lake and a strong contender for most healthyish restaurant in America. We'll catch up with Emily and Heather regularly for stories, recipes, and dispatches from the front lines of a women-led, vegetable-first kitchen.The power went out during our first-ever New Year’s Eve dinner. Our restaurant Botanica was a mere six months old, and we were booked solid and eager to please (NYE = high expectations). Suddenly the emergency lights flicked on, turning the low-lit dining room into a fluorescent box. Music stopped mid-beat. The kitchen was cloaked in complete darkness, and equipment whirred to a halt. Before we had time to panic, our staff sprang into action: Line cooks seared lamb kabobs on a small backup stove. Spouses and partners brought dozens of balloons to cover the emergency lights’ obnoxious glare. One friend dropped his holiday plans to play guitar on our patio; another brought her stereo to stream music inside.As co-owners of an ever-growing, always-changing, beautiful beast of a restaurant in Silver Lake, Los Angeles, we are often asked why we did it. Why did we leave our “dream jobs” (we’re both former food and lifestyle journalists) for the heavy-lifting, micro-managing, and sleeplessness of the restaurant industry? In this column, we’ll try to answer that question by giving you a peek into our crazy lives, from how we deal with power outages to how we stock our market to our favorite cooking techniques.When we first decided to open a restaurant back in 2014, the food world hardly resembled what it is today. Vegetables had just begun to take hold of America’s hearts, the #metoo movement didn’t exist, and aggression, addiction and perversion weren’t just acceptable, they were proof that you had what it took. We made the jump from writing about restaurants to building one because we wanted to create something that celebrated what we thought was important, not what was already there.We wanted to change things from the inside out by proving that health, wellness, and nourishment could be incorporated into every aspect of an ambitious restaurant. We wanted to lavish vegetables, fruits, and grains with the attention and respect we thought they deserved (while showering some love on Pacific seafood and sustainably raised meat, too). We wanted to build a business that would respect and support its staff and care genuinely and personally for its guests via hugs and wholesome cookies and copious pours of natural wine.And, as two women in a male-dominated industry, we wanted to do it on our own and in our own way: by sheer force of will, energy, and optimism (and a lot of hard-ass work).So: We moved from Chicago to LA, talked friends and strangers into giving us money, built a website to share our recipes, gut-renovated a decrepit 1940s liquor store, pulled together an intensely wonderful crew of staff, makers, and purveyors, and brought Botanica to life.The scene at Botanica's market.\nPhoto by Brandon HarmanToday we’re just beyond our year-and-a-half birthday, and Botanica is legitimately thriving. We’ve made it through the insanity of the opening months (nonstop maximum output; self-care regimens down the toilet; living off granola and cold six-minute eggs pulled straight from the walk-in) and now, thanks to our incredible 50-person dream team, have occasional moments to pause, breathe, and eat actual meals.Perspective is hard to come by in this business. We often get mired in the minute-to-minute drama of broken refrigerators, rancid cashews, and AWOL everything, from dishwashers to dairy orders. Much of our time is spent putting out fires (literally, we’ve put out three), all while maintaining a sense of cool, calm collected-ness so our dining room full of guests feels cared for. Sidenote: On that first New Years, no one complained. Midnight came and went, and the lights were back on for daytime service.But the upside to owning our own restaurant? It’s huge. It’s no exaggeration to say that we spend every day among the most delicious and beautiful products around. We work with a team of fiercely creative, passionate people devoted to making things—food, natural wine, cocktails, coffee, tea, ceramics, floral arrangements, music—that bring joy.When we actually stop to think about it, we feel like the luckiest people in the world. (And then we think: Oh man, we need a massage. And we need to follow up with the plumber! And we should add curry leaves to the vadouvan cauliflower dish. And damn, did we order more matcha? And…)Our goal for this column is to share it all with you: stories, lessons, obsessions, favorite things and, of course, plenty of colorful, healthyish, vegetable-centric recipes. We hope you’ll enjoy (and come see us next time you’re in LA!).xo, Emily and HeatherExplore Bon AppétitHealthyishLos AngelesRestaurantsBotanicaessayRead MorerestaurantsClaudette Zepeda-Wilkins on What It Means to Open a Matriarchal RestaurantBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Emily Fiffer", "Heather Sperling"]}