{"id": "085324a618e7bcbc5b305968fb703b4a", "url": "https://www.bonappetit.com/story/zoom-snack-feud", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "I Used Up Random Rice and Made BA’s Best Risotto | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Used Up Random Rice and Made BA’s Best RisottoPlus more bits and bobs from the week at Bon Appétit.By Alex BeggsApril 11, 2020FacebookTwitterEmailPhoto by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.My own ancient grainsThere used to be a tiny restaurant in New York called Risottoria. They served approximately 37 different varieties of risotto and a pretty good squid salad. (No relation to Rice to Riches, the place that sells 37 flavors of rice pudding.) We ordered takeout risotto, lol, from that place all the time. But this week we wanted to recreate the mushy magic—and use up a cup and a half of years’ old arborio rice—and so we made BA’s Best Risotto, recipe by Carla Lalli Music. Unlike my previous experiences making risotto, you cook the topping, crispy mushrooms, separate. And instead of slowly hydrating the rice with stock, you use salty water (easy!). It ended up being the creamiest risotto I’ve ever had. The crispy-okay-sorta burnt mushrooms (I used dried mushrooms, they cooked faster than I expected) kept it from having that congealed wobbly mush texture of the takeout risotto we loved dearly. Now what do I do with half a pint of split peas?Get the recipe: Risotto with Mushrooms and ThymeWant this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie Craig, Food Styling by Kate BuckensI alsoMade Molly’s spinach-artichoke dip with a box of frozen spinach that’s been perplexing me for some time. Dinner dip. Hop on the train.Get the recipe: Stovetop Spinach-Artichoke DipPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioThe flexibility of hipsTwo great things happened to me this week. First, I averted someone’s unnecessary shopping trip by ordering seven GIANT, perfect avocados from “avocado guy,” an avocado delivery man. Second, I ran into my favorite two gentlemen on our building’s roof. When I’m doing my day’s end yoga (me, laying on a mat, taking a nap), they’re watching the sunset and drinking cold vodka martinis. From a seven foot distance, we talk movies, recipes, the flexibility of hips. This week Raoul was making stuffed cabbage and suggested the 1942 film To Be or Not To Be, a ...comedy….about Nazis...with Carole Lombard. Added to my list!We have a wonderful new stuffed cabbage recipe, by the way (pictured above).Photo by Laura MurrayWho is this fat daddioWhen Basically ran a story about Fat Daddio cake pans I couldn’t stop wondering, who is Fat Daddio? But then I got distracted by the detail in the story that Sohla El-Waylly made her own 40 LAYER, 8-tier wedding cake. “It was s’mores flavored,” Sohla told me. “Graham and chocolate cakes, graham cracker streusel, chocolate ganache, and marshmallow fluff buttercream.” Damn, Sohla!!Read more: You Need a Better Cake Pan—Specifically, A Fat Daddio's Cake PanMood of the weekPhoto by H. Armstrong Roberts/ClassicStock/Getty ImagesReader mail of the weekLee in Maine writes in: “In response to the mention of ‘ask for help’ in the article on advice to newbie chefs, I have a cautionary tale. Some years ago, during my struggling attempts to begin to cook, the term ‘al dente’ was new to me. I called a good friend and asked her, ‘who is Al Dente?’ To this day, probably 25 years later, both she and my wife still tell the story.”(Letter has been edited for space.)Unnecessary TikTok of the weekSuddenly craving Ortega tacos.Unnecessary meme of the weekUnnecessary food feud of the weekUnnecessary food feud of the weekYou’re either a person who has no qualms snacking on a video chat because a person’s gotta snack—or you’re a person who wouldn’t dare chomp on raisins during a staff-wide meeting. We have a big Wednesday meeting and this week, everyone was instructed to bring a snack so I could take a screenshot. Jesse Sparks had a thick slice of peanut butter toast made with homemade honey wheat bread, and he took one loooooong, dramatic bite because he’s a TEAM PLAYER. Obviously he’s pro-snack. “Snacking makes it feel more like tea time and less like work,” said Christina Chaey, who had to leave the Zoom temporarily because she was CHOKING ON A RAISIN. “If you hold the meeting during lunching hours (12-2),” warned Emily Schultz, “expect me to come with food!” Molly Baz had thoughts: “Depends on the company you keep! If you wouldn’t walk up to someone’s desk whilst snacking then you have no biz snacking in their Zoom.” Alex Delany lives by the “no talking with your mouth full of food” law, which is reasonable on Zoom and beyond. But philosopher Hilary Cadigan has feelings worth chiseling in stone: “Life’s hard; snack if you wanna.”Read more: Is It Ever Okay...To Hide Special Treats From Your Roommates in Isolation?Now I’m gathering etiquette questions on the theme of PICNICS for a very future issue, hopefully, for a time when we have picnics again. Send your questions to staff.bonappetit@gmail.com please!Explore Bon AppétitBeggs NewsletterRead MorecultureWhere to Order Your Favorite Pantry Staples OnlineBy MacKenzie Chung FegancookingI Dread Making Dinner Every Night, But It’s Also the One Thing I Look Forward to Each DayBy Carla Lalli Musiccooking8 Tools to Make Washing the Dishes a Little Less MiserableBy Sarah JampelcultureIs It Ever Okay...To Hide Special Treats from Your Roommates In Isolation?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-11", "author": ["Condé Nast", "Alex Beggs"]}