{"id": "085bec1708bbee97bcd79ba2829b2b09", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/nemesis", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Nemesis Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverNemesisNerd out on coffee in this luminous Gastown spaceFacebookPinterestTwitterEmailGrant HarderGO HERE: for Nemesis’ stellar coffee; lovely options for breakfast, lunch, and sweets; and a Scandinavian-inspired cafe design that makes the most of two huge walls with floor-to-ceiling windows.ORDER: a coffee from the current lineup (Five Elephant out of Berlin, if you see it); mushroom toast; and anything carby from pastry chef Daniel Munoz, like the million-layered kouign-amann.THE VIBE IS: stay-in-your-own-lane chill. The minimalist coffee mecca is popular for lunch, drinking solo with a book, or people-watching on a weekend morning as the Gastown crowd passes by.PRACTICAL STUFF: Open every day: Monday to Friday, from 8 a.m. to 6 p.m. (kitchen closes at 4 p.m.); and Saturday and Sunday, from 9 a.m. to 5 p.m.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEThe DiamondProhibition-era glam (and meticulously made cocktails) in GastownEarnest Ice CreamGet the scoop on Vancouver’s young, ambitious ice cream empire Alibi RoomVancouver’s original craft beer bar in a quiet corner of GastownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}