{"id": "085f901e3bfabce2852c8ab5de3a120b", "url": "https://www.bonappetit.com/recipe/pan-roasted-romanesco-with-hazelnuts-and-crispy-bits", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Pan-Roasted Romanesco with Hazelnuts and Crispy Bits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssuePan-Roasted Romanesco with Hazelnuts and Crispy BitsBy Carla Lalli MusicJune 1, 20194.3(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintRomanesco shows up in the late fall, tastes like a cross between cauliflower and broccoli, and is studded with fractal-shaped florets that make it look like a magical mythical structure. The slabs get super-tender, and the loose pieces of florets get browned and crunchy. If the pan is dry, you’ll risk burning instead of browning. Add oil as needed to keep things sizzling. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients4 servings1medium head of Romanesco or cauliflower (about 2 lb.), trimmedKosher salt2Tbsp. extra-virgin olive oil, plus more for drizzling2Tbsp. unsalted butter¼cup skin-on or blanched hazelnuts, coarsely chopped2garlic cloves, thinly sliced½cup chopped parsley2tsp. white wine vinegarFlaky sea saltLemon wedges (for serving)PreparationStep 1Preheat oven to 400°. Stand Romanesco on its stem and cut it from top to bottom into 1\"-thick slabs. Don’t worry about the outer edges that may crumble or smaller florets that break away; nudge those into a pile along with any nice-looking leaves. Cut loose bits into ½\" pieces; season bits and Romanesco steaks with kosher salt.Step 2Heat a large cast-iron skillet over medium-high. Add 2 Tbsp. oil and slip Romanesco steaks into pan—puzzle them together so they don’t overlap; work in batches if needed. Cook, rotating skillet periodically for even browning, until dark brown underneath, about 5 minutes. Turn and drizzle a bit of oil over second sides and into empty areas of pan. Scatter chopped pieces of Romanesco into spaces between steaks and toss gently to coat with oil (add more if needed).Step 3Transfer pan to oven; roast Romanesco until a tester inserted into stems slips through without much effort, 15–18 minutes. Steaks should be firm enough to still hold together without being crunchy.Step 4Transfer steaks to a platter. Return pan with loose pieces of Romanesco to medium-high heat. Add butter, hazelnuts, and garlic, and cook, stirring, until everything is toasted and crisp around the edges, about 4 minutes. Add parsley and vinegar and stir up any browned bits. Spoon over steaks and season with sea salt. Serve with lemon wedges.How would you rate Pan-Roasted Romanesco with Hazelnuts and Crispy Bits?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleMy store didn't have hazelnuts so I used macadamias.  I otherwise followed the recipe and served on a bed of rainbow chard tossed with lemon, honey, and olive oil.  Absolutely delicious, and I bet even better with hazelnuts.AnonymousNew York, NY1/12/2022Best BA recipe. Minus a star because instructions omit important ingredient: foolproof Rx for burned hand that results from grasping 400 degree pan while tossing crispy bits. Please add: cold prepared yellow mustard to slather on palm and fingertips.AnonymousBaltimore12/24/2021This sounds DELICIOUS but I only gave 3 stars because I need nutritional breakdown on all the things I make. Have to discontinue my BA subscription because this info isn’t given <sad face>OlliePort Townsend, WA9/25/2021I bought some romanesco on a whim, simply because it was beautiful. I had never cooked or eaten it before but I figured it would be similar to broccoli or cauliflower. I cooked it for the first time using this recipe. So fricken delicious. I like it better than broccoli or cauliflower now. I saved this recipe for future use because it’s so gotdang good. DevSanta Clarita2/23/2021This is SOOOOOO good! Best vegetable/plant-based dinner ever. Comes together quickly, and bursting with flavor and texture. Sweet and salty -- could add some pomegranate on top too for a nice bright garnish. I was so pleasantly surprised at how delicious this was!!! JanisIrvine, CA2/5/2021Everybody loved it! I didn’t have hazelnuts or White wine vinegar , used pistachios and red wine vinegar insteadLjeanCChicago, IL12/13/2020Swapped the hazelnuts for some pancetta which I rendered before browning the romanescoAnonymousMoscow, Russia5/28/2020This was great. I cooked some purple onion with the crispy bits and the sweetness added a nice contrast and balance to the savory flavors. sprokolopolisLos Angeles, CA6/18/2019Great recipe. Add some raisins plumped up with hot water. Even kids were eating it.Anonymous3/4/2019Explore Bon AppétitCauliflowerVegetableHazelnutNutRomanescoFallWinterQuickEasyOne-Pot MealsWeeknight MealsMainSideGluten-FreeVegetarianKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}