{"id": "0861f96222309e35df7df1c739430f0b", "url": "https://www.bonappetit.com/story/outdoor-dining-design-inequities-in-nyc", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Different Blocks, Different Outdoor Dining Scenes, One Deep Economic Divide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDifferent Blocks, Different Outdoor Dining Scenes, One Deep Economic DivideIn one affluent neighborhood, well-designed—and insulated—setups are drawing customers and keeping restaurants afloat. A few blocks away it's a different story. By Priya KrishnaJanuary 21, 2021FacebookTwitterEmailThe outdoor dining setup at Spicy Shallot in the Elmhurst neighborhood of QueensPhoto by Laura MurrayFacebookTwitterEmailThis past summer, on any remotely pleasant Saturday night, Vanderbilt Avenue in Brooklyn’s Prospect Heights neighborhood was a full-on block party. The street was shut down to vehicular traffic. People laid red-and-white-checked picnic blankets on the streets. Others lazily sipped gin cocktails outside Weather Up. The restaurants along the avenue, places like Olmsted, Alta Calidad, and Chuko, served plates of glistening spareribs and oversize bowls of miso ramen to packed tables of customers on sidewalks, under the glint of string lights, surrounded by umbrellas, snake plants, and beds of artificial turf.A few blocks over, on Nostrand Avenue in Crown Heights, it was a different story. There were plenty of open restaurants, but none were busy. Cars zoomed up and down the street. Chairs and tables were minimally stationed outside but with few decorative accents. No string lights, no artificial turf, but the food spoke for itself, from the thickly crusted jerk chicken at Peppa’s to the grilled shrimp skewers stained with tamarind sauce at La Ñapa, a tapas bar.“It does feel pretty dead,” Francisco Anton, chef-owner of La Ñapa, messaged me one August evening. He added that his neighbors were heading to Vanderbilt to hang out.Last June, New York City’s mayor, Bill de Blasio, announced an outdoor dining program that’s now become a permanent fixture of the city despite the fickle opening and closing of indoor dining. For many struggling restaurants, it's been a lifeline. But not for Anton. The $10,000 he was quoted by an architect for an outdoor build-out is more than his small family-run restaurant can afford. And in November, the city sent out new guidelines requiring roadway barriers and at least two open sides for outdoor booths. Anton says the cost of an insulated, well-designed outdoor dining setup is the same as opening a second restaurant.There are other factors too: Anton says street cleaning doesn’t happen frequently on his block, resulting in clogged storm drain grates and dirty sidewalks. And during the heightened tensions in June, the city removed trash cans from his block and other neighborhoods in the city to prevent people from throwing them into storefronts, which has caused an increase in street waste. Nostrand is also a major avenue with tons of traffic, and its express Select Bus Service route would make it ineligible for Open Streets, the program that allowed restaurateurs along Vanderbilt Avenue to expand their business beyond the sidewalk. “No one is going to want to sit outside with a bunch of gray snow to eat at my restaurant,” he says. “They will go to neighborhoods that are better kept by the city.”Restaurants are an aesthetics-driven business. Design and atmosphere set the tone for a meal before any food arrives at the table. But hiring a designer means ponying up for fees and materials in an industry with single-digit margins. And in New York City, where socioeconomic divisions run deep, rents are sky-high, and one-third of small businesses are expected to close because of the pandemic, many restaurants lack the infrastructure and financing that their high-end counterparts do. And many of those restaurants are run by immigrants and Black and brown communities and are located in under-resourced neighborhoods. Outdoor dining—and the winter—has made these inequities even worse.In the 10014 zip code, which covers the affluent and nearly 73 percent white Greenwich Village, an estimated 64 percent of restaurants are open for outdoor dining (according to data calculated by dividing the number of restaurants open in a zip code, per the Department of Transportation, over the number of restaurants in that zip code, per the NYC Department of Health). By contrast, in the 11213 zip code of Crown Heights—a majority Black neighborhood where the average salary is $35,000—just 16 percent of restaurants are open for outdoor dining. This speaks, in part, to the lack of access to design resources that would allow owners to make their restaurants compliant with city regulations and reopen, says Sreoshy Banerjea, the assistant vice president of urban design for the New York City Economic Development Corporation.Banerjea helped start Design Corps, a recent partnership between NYCxDESIGN, a global design festival in New York City, and the New York City Economic Development Corporation to offer pro bono design assistance to restaurants. So far, 50 restaurants have applied to the program—many seeking help with weatherproof setups—and there aren’t enough volunteer architects to meet the demand.Other organizations doing similar work include the Van Alen Institute’s Neighborhoods Now, which connects design firms with businesses in neighborhoods hardest hit by the pandemic, and Design Advocates, an organization of architects offering pro bono design services to small businesses in New York City in need, including restaurants like La Ñapa, whose setup is still in process.Michael Chen, one of the cofounders of Design Advocates (and the founder of his own architecture firm, Michael K Chen), says there’s a huge gap in understanding of government regulations around outdoor dining, especially among restaurateurs who can’t afford lawyers but also can’t afford to temporarily close. Often, these are small restaurants in under-resourced neighborhoods operating day-to-day, without elaborate business models. A big part of Chen’s work is just translating the legalese and coming up with solutions to help restaurants avoid receiving violations (Design Advocates is currently working on plans for plastic partitions, heated seats, and overhead electric heaters that can be made affordably and installed easily). Other barriers include language, technology, and physical street space available, adds Val Hoffman, the program director for NYCxDESIGN.The outdoor dining setup that Design Advocates is currently working on for La Ñapa will definitely be a game changer, according to Anton. With 31 seats, it’ll help him to hire back many of his workers, largely immigrants who he says were unable to receive unemployment. But it’s taking time to design, and it keeps getting more expensive as winter creeps in, with the cost of heaters and air curtains. He’s not sure when the outdoor installation will be up and running and must rely on takeout and delivery in the meantime.Photo by Laura MurrayMouna Thiam, the owner of Le Paris Dakar, a French Senegalese café with three locations in Bed-Stuy, says that if Design Advocates hadn’t offered to help, she wouldn’t have any outdoor dining. She was initially quoted $8,000 without the furniture for a build-out by another design firm, and her restaurants are making half the revenue they were before the pandemic. Her outdoor setup, which includes pale pink umbrellas and big bunches of daisies, brought in meaningful business over the summer, though she can’t afford heat lamps right now. But access to design resources like these don’t resolve existing inequities in these communities. Even if she were offered help, Cassandre Davilmar, who owns Lakou Café, a Haitian-American restaurant in Weeksville, Brooklyn, isn’t sure she could make outdoor dining work in her neighborhood.“We are on Utica, which is a pretty congested area, and we are not one of those streets with a huge sidewalk,” she says. She initially saw outdoor dining as “a hindrance in the neighborhood, taking up parking spots in an already congested area.” Like on Nostrand, there isn’t much street cleaning along Utica. “There is a lot of trash rolling down the street,” Davilmar adds.On top of this, her neighborhood was one of those hardest hit by the COVID-19 virus. “Do I really want to encourage folks to sit outside when we were a coronavirus hot spot?” she asks. Still, she set up four tables on the sidewalk with umbrellas, plants, and tents. “We are one of the few places in the neighborhood that was a sit-down spot, so I don’t want us to just do takeout,” she says. But the wind knocked over the plants and broke the umbrellas and tents. She put in a request with Open Streets to get her street shut down to traffic on weekends, like Vanderbilt Avenue, but it was denied because of the location along a major bus line. “I was like, ‘There are bus lines on Vanderbilt,’” she says.“It is hard, because we deserve nice things, too,” Davilmar explains, “but at the same time all those structural inequities cause things to hit us harder and make us be more cautious. It is a lose-lose situation.”James Lam’s restaurant, Spicy Shallot, which he co-owns with his wife, Inthira Lam, is situated in Elmhurst in Queens, another area devastated by the virus. He was able to set up outdoor dining with partitions, thanks to a friend who is a contractor. But he says many people in the area aren’t able to do much more than some outdoor tables and chairs, and the neighborhood hasn’t fully recovered from being a virus epicenter. Customers outside the neighborhood are hesitant to visit. Still, the restaurant’s basic setup has been helpful—revenue is up 30 percent.Some restaurateurs fear that setting up outdoor dining might open themselves up to unwanted scrutiny. Abigail Coover Hume, a board member at Design Advocates, has noticed that enforcement of outdoor dining guidelines has been inconsistent among different neighborhoods. Restaurants in under-resourced neighborhoods are receiving violations that she doesn’t see those in more affluent neighborhoods getting. (Joseph Yacca, the Director of Operations for the Department of Transportation’s Highway Inspections & Quality Assurance unit, refuted this.)At La Ñapa, Anton has put up a chain-and-post barrier to separate his restaurant from the lengthy line at the UPS store next door and to prevent people from blocking the door of his restaurant. He hasn’t even set up outdoor dining, yet the restaurant has received three violations.To drum up business, he collaborated with other restaurants in the neighborhood to run a 10 percent discount across the board. Other places are discussing sharing resources such as heat lamps. But the challenges seem greater than what grassroots initiatives can accomplish.“I haven’t seen anything large-scale that would really alleviate those pressures on a systemic level,” Chen says, referring to the unequal distribution of city resources across neighborhoods, the barriers to capital and funding that restaurateurs without Rolodexes of investors face. “We are cobbling together the resources we can on a case by case basis.”Anton agrees, fearing that without government funding for small businesses and better unemployment benefits for the general public, small independent restaurants like his, which make up the backbone of the industry, will not be able to survive. And with a slumping economy, he adds, “Even if we have a beautiful, warm, and cozy structure outside, even if we have no COVID, people will not come out and spend.”“People like me, like my family, this is all we have,” he continues. “We don’t have money behind us, pushing a brand or pushing a book deal or pushing a TV show. We just like working every day and making the money, so we can have a decent life or whatever we can afford.”Outdoor dining has become more than a way to seat more guests and make more money—it’s become a symbol of systemic inequity long ingrained in the city. And it’s no longer a design solution but a burden in itself.“Right now, we are not caring about aesthetics,” Banerjea says, “because it is about survival.”Explore Bon AppétitRestaurantsNew York CityDesignRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-21", "author": ["Condé Nast", "Priya Krishna"]}