{"id": "086d73241626b519a690607a71bb7718", "url": "https://www.bonappetit.com/recipe/fried-lemon-and-radish-salad", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Fried Lemon and Radish Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueFried Lemon and Radish SaladBy Rebekah PepplerMarch 15, 20224.5(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joann Pai, food and prop sryling by Rebekah PepplerEmailPinterestPrintEmailPinterestPrintAccording to Rebekah Peppler, a solid vinaigrette makes an average salad great and a great salad unforgettable. And the vinaigrette from her book À Table is decidedly solid. Spiked with earthy capers, bright with acid, and barely tempered with honey, it makes this already great salad truly memorable. Tempting as it might be, don’t skip blanching the lemon slices before frying. It takes only a few more minutes and stamps out unwanted bitterness in the lemon pith.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWhisk$10 At AmazonCitrus Juicer$7 At AmazonSmall Skillet$40 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonIngredients6 ServingsDressing2medium shallots, thinly sliced¼cup sherry vinegar or red wine vinegar2Tbsp. fresh lemon juice1Tbsp. plus 1½ tsp. finely chopped drained capers1Tbsp. Dijon mustard1tsp. honey¾cup extra-virgin olive oilKosher salt, freshly ground pepperSalad and assembly½cup raw pistachios1large lemonKosher salt¼cup extra-virgin olive oilFlaky sea salt3oz. tender salad greens (such as arugula or mâche; about 3 cups)2cups coarsely chopped parsley leaves with tender stems1cup mint leaves, torn if large1bunch red radishes, trimmed, thinly slicedPreparationDressingStep 1Whisk shallots, vinegar, lemon juice, capers, mustard, and honey in a small bowl; let sit at least 10 minutes and up to 1 hour. Whisk in oil and season dressing with salt and pepper.Do ahead: Dressing can be made 2 days ahead; cover and chill.Salad and assemblyStep 2Toast pistachios in a dry small skillet over medium heat, tossing occasionally, until golden brown in spots, about 4 minutes. Transfer to a cutting board and coarsely chop.Step 3Thinly slice lemon crosswise into rounds; pluck out seeds and discard. Cook lemon slices in a medium saucepan of boiling salted water until just barely tender, about 2 minutes. Drain and pat dry with paper towels.Step 4Heat oil in a large skillet over medium-high. Working in batches, cook lemon slices, turning occasionally, until golden brown, about 5 minutes. Transfer to paper towels and season with sea salt; let cool. Set aside a few lemon slices for serving. Transfer remaining lemon slices to a cutting board and coarsely chop.Step 5Drizzle half of dressing in a large bowl. Add greens, parsley, mint, radishes, and chopped lemon slices; toss to coat. Top with pistachios and reserved lemon slices. Serve remaining dressing alongside.Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Fried Lemon and Radish Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleVery interesting and novel, but also a lot of work. Didn’t love it enough to put it on repeat.Diane 3/24/2022Such a pretty and brightly flavored salad!  I added some dried cherries, and it was delicious. Will definitely make again.AnonymousIrvington, NY3/22/2022Explore Bon AppétitDinnerLunchSideDairy-FreeGluten-FreeVegetarianSaladSalad DressingLemonCitrusFruitRadishVegetableArugulaLeafy GreensMâcheParsleyHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}