{"id": "0871a1d419f29263d329d69b40673067", "url": "https://www.bonappetit.com/recipe/grilled-chicken-wings-with-summer-berry-agrodolce", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Grilled Chicken Wings With Summer Berry Agrodolce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Chicken Wings With Summer Berry AgrodolceTurn your bag of frozen berries into a sour-sweet sauce for crispy wings. By Bill ClarkMay 23, 20214.2(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintA grilled chicken wing is essentially a vehicle for sauce, whether that’s Buffalo, sweet chile, or, in this case, agrodolce, a sour-sweet Italian glaze (literally, “sour-sweet” is the direct translation) that’s made by simmering vinegar with honey (or sugar) and often chiles or crushed red pepper flakes. Here, developer Bill Clark also adds frozen berries for jamminess, color, and even more tart-sweetness. While these wings are great cooked on the grill for the most char, you can also bake them under a broiler, where they will take about 30 minutes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronInstant-Read Thermometer$35 At Thermoworks8-Inch Chef's Knife$47 At AmazonTongs$13 At AmazonCutting Board$10 At IKEAMedium Saucepan$39 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketLarge Bowl$18 At AmazonSmall Bowl$13 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWooden Spoon$6 At AmazonPlatter$29 At AmazonIngredients4 servings3small handfuls any combination mint, cilantro, and/or parsley1lemon1shallot2Tbsp. vegetable oil, plus more for baking sheet (optional)3tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more1tsp. freshly ground black pepper, divided, plus more¼tsp. crushed red pepper flakes110-oz. bag frozen mixed berries¼cup honey3Tbsp. (or more) apple cider vinegar2lb. chicken wings, drumettes and flats separatedPreparationStep 1Coarsely chop 3 small handfuls any combination mint, cilantro, and/or parsley to make about ⅓ cup chopped herbs. Transfer to small bowl, cover with a damp paper towel, and chill until ready to use. Cut 1 lemon into wedges; set aside. Thinly slice 1 shallot into rings. Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Heat 2 Tbsp. vegetable oil in a medium saucepan over medium. Cook shallot, stirring occasionally, until translucent, about 2 minutes. Stir in 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, ½ tsp. freshly ground black pepper, and ¼ tsp. crushed red pepper flakes and cook, stirring, until fragrant, about 1 minute.Step 3Add one 10-oz. bag frozen mixed berries, ¼ cup honey, 3 Tbsp. apple cider vinegar, and ½ cup water to shallot mixture in pan and cook, stirring often to prevent sticking and burning, until berries are completely softened and falling apart and agrodolce is thickened, 15–20 minutes. Taste and season with more salt, pepper, and/or vinegar if needed. Remove from heat and set aside.Step 4Prepare a grill for medium heat. (Or, if you don’t have a grill, heat broiler with rack in upper third of the oven.) Pat 2 lb. chicken wings, drumettes and flats separated, dry with paper towels and arrange on a rimmed baking sheet. Sprinkle wings all over with remaining 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt and ½ tsp. freshly ground black pepper, pressing to adhere. (Lightly coat baking sheet with oil if broiling wings.)Step 5Grill chicken, turning occasionally with tongs to prevent excessive charring (some is delicious, a lot is not), until crisp and deeply browned and an instant-read thermometer inserted into thickest part of a wing registers 165°, about 15 minutes. (If using broiler, broil about 25 minutes, turning over after 15 minutes.) Transfer wings to a large bowl. Step 6Reheat agrodolce over medium until warmed through and loose, about 1 minute. Pour over wings and toss to coat. Step 7Transfer wings and agrodolce to a platter and top with chopped herbs. Squeeze juice from 1 reserved lemon wedge over wings. Serve wings with remaining lemon wedges for squeezing over as desired.Do ahead: Agrodolce can be made 4 days ahead. Transfer to an airtight container; cover and chill. Reheat over medium before using.How would you rate Grilled Chicken Wings With Summer Berry Agrodolce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWould not make again but gave 3 stars because the agrodolce was delicious - just not with wings. Gave off a very turkey and cranberry sauce vibe. AnonymousLas Vegas, NV11/4/2021This was a fun summer meal. A twist on the normal wings. It was delicious. A lot of layers of flavor (smoke grilled wings,  Agrodolce, cilantro and mint, lemon. Really cool. Definitely can't wait to try it out on friends. Very easy to make. Made it on a weekday night. I am not a cook in any way. I love the videos! Thank you!!Chris McManamanSugar Land Texas6/10/2021Explore Bon AppétitChicken WingChickenPoultryBerryFruitSummerMainStarterDairy-FreeGluten-FreeNut-FreeGrillingSimmerBroilDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-23", "author": ["Condé Nast", "Bill Clark"]}