{"id": "087afc63f7d99de0b447c1ed14121985", "url": "https://www.bonappetit.com/recipe/stuffing-biscuits", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Stuffing Biscuits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueStuffing BiscuitsBy Kendra VaculinOctober 19, 20214.0(61)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintAll the herby and aromatic flavors of a classic Thanksgiving stuffing—sage, rosemary, fennel seed, oniony scallion–are packed into this tender biscuit. Stacking pieces of dough before rolling out ensures plenty of tall, buttery layers. If you have any extra biscuits after The Big Meal, store them in an airtight container at room temperature overnight and prepare to have the most festive biscuits and gravy (featuring leftover Thanksgiving gravy, of course!) for breakfast the next morning.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronPastry Brush$9 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxLarge Bowl$18 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketChef's Knife$34.53 At AmazonIngredientsMakes 121Tbsp. Diamond Crystal kosher or 1¾ tsp. Morton kosher salt1Tbsp. baking soda¼tsp. baking powder1tsp. sugar1½tsp. freshly ground black pepper4cups (500 g) all-purpose flour, plus more for surface1cup (2 sticks) chilled unsalted butter, cut into small pieces4scallions, thinly sliced3Tbsp. finely chopped rosemary3Tbsp. finely chopped sage1(heaping) Tbsp. fennel seeds1½cups chilled buttermilk, plus more for brushingPreparationStep 1Place a rack in middle of oven; preheat to 425°. Whisk salt, baking soda, baking powder, sugar, pepper, and 4 cups flour in a large bowl. Add butter and, using your fingers, work into dry ingredients, smashing and flattening and tossing to coat with flour, until you have some flat quarter-size pieces and some smaller pea-size pieces. Add scallions, rosemary, sage,and fennel seeds and toss to evenly distribute. Add 1½ cups buttermilk and stir mixture with a fork just until a shaggy dough forms. Turn out dough onto a lightly floured surface and knead once or twice to incorporate any loose pieces.Step 2Pat dough into a 10x8\" rectangle. Using a large knife, cut in half crosswise, then stack 1 piece on top of the other. Turn rectangle so a long side is closest to you and cut dough in half crosswise again. Stack 1 piece on top of the other. (This process will build layers into your biscuits.) Turn dough and pat again into a 10x8\" rectangle. Cut into 12 even pieces (you should have a grid of 4 on the long sides and 3 on the short sides). Place biscuits on a parchment-lined baking sheet, spacing evenly, and freeze 10 minutes.Step 3Brush top of each biscuit lightly with buttermilk and bake, rotating baking sheet halfway through, until golden brown, 22–26 minutes.How would you rate Stuffing Biscuits?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleBasically very dry savory buttermilk biscuits. I used half the flour, baking soda and powder and the full amount of herbs and buttermilk. They look lovely and taste fine but are very dry. Don't recommend for the celebratory feast (especially if you are looking to replace actual stuffing) but this is a good recipe for leftovers. Michie11/27/2021i made these biscuits into stuffing aka stuffing biscuit stuffing and wow what a way to level the heck up !!gfariminneapolis11/26/2021They are alright. Better off either making stuffing or plain biscuits.AnonymousArlington, VA11/26/2021I threw away the first batch due to the salt error in recipe-happy I made them early and did a taste test. Drove to Safeway for more supplies, remade the biscuits with about 3/4 tsp of Morton's Kosher Salt. MUCH improved, and just the right amount of salt.NancyEverett, WA11/25/2021Made these biscuits for thanksgiving and they’re delicious and fluffy! The whole gang loved them. I mostly followed the recipe, but also added just a bit of chicken stock to the buttermilk brushed on the top before baking as I wanted that stock flavour. I might try trading celery salt for the kosher salt in the future as I love the celery taste in stuffing.A HerronLondon, UK11/25/2021These are amazing!  I made these the day before Thanksgiving and fluffiest biscuit I have made to date, and I have tried a lot.  In fact, I may use this recipe sans the herbs for biscuits in the future.  I used Morton's iodized salt and everything was spot on.  Everyone in my family tasted the biscuits today, but I made them for Thanksgiving.  I closed them in an airtight container with a couple slices of bread and I hope they are soft for tomorrow.  My dough was perfect.  A little too moist actually.  I want to try the dough with cheddar shredded finely and some garlic or even with the herbs for the stuffing biscuits.  Kerry C.Beckley, WV11/25/2021I made these tonight and they were inedible. I have compared this to other biscuit recipes and no other calls for 1T baking soda. Maybe there is an error? It should be 1T baking powder? The New Basics Biscuit recipe is delicious. Why would I ever try something new? I was swayed by the flavoring ideas.AnonymousArlington, VA11/25/2021Yum! I made some adjustments by adding some finely chopped carrots, and subbing the fennel seed for celery seed to mimic mirepoix. (Also I just don't care for fennel). I did the layering twice over, and I still don't really get the layers. Also added some chicken stock to the buttermilk for the brushing on top. Delicious, and unique!Holly NotoMiami, Florida11/23/2021Yum yum! Did a test run today in advance of Turkey Day. Weighed the flour, wasn’t dry at all, an issue other reviewers had. I’m going to make smaller next time (maybe even 24), hopefully get a bit more rise. Likely was just my oven, but the tops browned much faster than the sides, so I put it on convection for an extra few minutes.Anonymous11/21/2021Wanted to test out this recipe as a make-ahead so I made it on a Tuesday, wrapped them up and froze them, and the baked straight of the freezer on Saturday. Turned out perfectly! Only note is that I did only bake about half of the dough, and the butter melted out onto the baking sheet. Not sure what would could have contributed to it, but it still came out great and golden and tasty. Looking forward to making this for the holiday! Lauren K. CA11/21/2021Completely wrong salt amounts.  1 teaspoon of Diamond Crystal is equal to 1 3/4 teaspoons Morton KosherAnonymous11/21/2021For those saying it was a really dry dough, look into getting a scale for your flour, or just in general for baking. Different humidities can vastly impact the amount of flour needed. AnonymousFlorida11/19/2021They really do taste like stuffing! My husband wasn't a huge fan of the fennel seeds, (he also doesn't like stuffing anyway lol) but I used dried portions of the herbs and they were great.I  felt like the salt level was fine and I used Morton kosher. Flaky, deliciously soft on the inside and buttery crispy on the bottom. Some of my smaller ones I took out at 18minutes, the larger ones went til 22. Happy Thanksgiving back! MicoleCharlottesville, VA11/18/2021I am assuming these can be made ahead, like in the morning, and kept in the fridge?Anonymous11/17/2021Always makes a great biscuit! My tip: For brushing the biscuit tops, slightly warm the buttermilk (or melt butter) and add a small spoonful of chicken flavored Better Than Bouillon, and whisk to dissolve. It's... really good. AmyPortland, OR11/16/2021Explore Bon AppétitThanksgivingBiscuitBakeSageHerbs & SpicesEasySideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}