{"id": "08832e3f6b99797e31691a35bef6d546", "url": "https://www.bonappetit.com/story/olympia-provisions-pepperette", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Olympia Provisions’ Pepperettes Belong in the Salty Meat Snack Hall of Fame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’d Like to Induct Olympia Provisions’ Pepperettes Into the Salty Meat Snack Hall of FameThey are like Slim Jims, but wayyyyyyyy better.By Rachel KartenAugust 12, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If there’s one thing you should know about my personal brand when it comes to snacking, it’s this: I love salty meat products. In college, I would scour best beef jerky dot org (a real and amazing website) in search of the best regional jerky from places like Florida and Arizona. These days, if you’re looking for me at a party, you’ll probably find me near the charcuterie board, eating all the salami. My devotion runs deep. Which is why I am pleased to report that I have a new inductee to my Salty Meat Snack Hall of Fame: Olympia Provisions’ Pepperettes.They’re like Slim Jims—you know, that mystery meat stick you always spot near the cash register at the gas station—but the ingredient list doesn’t read like a scary science experiment. Instead, these pepperettes are made of just pork, pork fat, sodium nitrite (a necessary and common preservative in cured meats), potassium sorbate (another natural preservative), dextrose (a.k.a. sugar, which helps with fermenting sausages), lamb casing (this gives the pepperettes their signature snap), and spices—depending on the flavor you get.There’s the sophisticated Petite Pierre, which has juniper, white pepper, and red wine. Kleine Schweine gets its kick from caraway, coriander, and chile flakes. The most aggressive of the bunch, Flaco Paco, packs heat with paprika, oregano, and garlic. You see those real ingredients, Mr. Jim? Plus, the pepperettes don’t require any refrigeration, making them ideal for road trips or to keep in your purse for Hanger Prevention.Now if you’ll excuse me, I need to get back to presenting my Very Official salty meat snack trophy—it’s shaped like a sausage, thanks for asking—to Olympia Provisions’ Pepperettes.Buy it: Olympia Provisions Pepperette Sample Pack, $32All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendSausageSnackRead MorerestaurantsMy Favorite Tacos in Mexico City Come Out of a Meat JacuzziBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-12", "author": ["Condé Nast", "Rachel Karten"]}