{"id": "088a709c3a8f7a7ef8f4904e09568581", "url": "https://www.bonappetit.com/recipe/chocolate-almond-pear-tart", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Chocolate-Almond Pear Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueChocolate-Almond Pear TartBy Kristen HallSeptember 14, 20214.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintPastry chef Kristen Hall of Bandit Patisserie in Birmingham, AL, swears by fraisage, a classic French technique she uses to create the flaky crust of this rich chocolate-almond pear tart. Fraisage uses the heel of your hand to smear the tart dough across your work surface to create a smooth dough that rolls out with minimal cracking.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonSilpat Roul' Pat$88 At AmazonRolling Pin$13 At AmazonBench Scraper$8 At AmazonWhisk$10 At AmazonIngredientsMakes one 9\" tarttart shell1Tbsp. Dutch-process unsweetened cocoa powder¼tsp. kosher salt1⅓cups (167 g) all-purpose flour, plus more for surface5Tbsp. unsalted butter, room temperature⅓cup (67 g) granulated sugar1large egg, room temperatureFilling and assembly1cup (121 g) almond flour or meal3Tbsp. (23 g) all-purpose flour2Tbsp. (12 g) Dutch-process unsweetened cocoa powder½cup (1 stick) unsalted butter, room temperature½cup (100 g) granulated sugar3large eggs, room temperature3oz. bittersweet chocolate, melted, cooled1tsp. vanilla extract½tsp. almond extract¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt2firm but ripe pears (such as Anjou, Bartlett, or Packham), thinly sliced¼cup sliced almondsPowdered sugar (for dusting)Special equipmentA 9\"-diameter tart pan with removable bottomPreparationtart shellStep 1Whisk cocoa powder, salt, and 1⅓ cups flour in a medium bowl. Beat butter and sugar in the bowl of a stand mixer fitted with the paddle attachment on medium-low speed until combined, about 2 minutes. Beat in egg. Reduce speed to low; with motor running, add dry ingredients. Mix just until a soft dough forms. Using a rubber spatula, fold in any remaining dry streaks of flour.Step 2Transfer dough to a surface; gather into a ball. Using the heel of your hands, smear dough straight out across surface by a full arm’s length, then using a bench scraper, gather dough back up into a ball. Smear and regather dough 2 more times; flatten into a disk. Wrap tightly in plastic and chill until firm, at least 2 hours.Step 3If dough is very firm, let sit at room temperature 10–15 minutes to soften slightly. Roll out dough on a lightly floured surface to about a ¼\"-thick round, dusting with flour as needed. Carefully transfer dough to tart pan and gently press into bottom, corner, and sides of pan, letting excess hang over edges. Run rolling pin over top of pan to shear off excess dough. Prick bottom of dough all over with a fork. Chill in freezer 1–12 hours.Step 4Arrange a rack in middle of oven and preheat to 325°. Bake tart shell until firm and dry to the touch and starting to pull away from edges of pan, 14–18 minutes. Transfer to a wire rack and let cool.Do ahead: Dough can be made 1 week ahead. Keep chilled, or freeze up to 1 month.Filling and assemblyStep 5Increase oven temperature to 350°. Whisk almond flour, all-purpose flour, and cocoa powder in a medium bowl. Beat butter and sugar in the clean bowl of a stand mixer fitted with a clean paddle attachment on medium-low speed until fluffy, about 5 minutes; scrape down bowl. With motor running, add eggs one at a time, incorporating completely before adding the next one. Reduce speed to low; add dry ingredients and beat to combine. Add chocolate, vanilla extract, almond extract, and salt and beat until smooth.Step 6Spread frangipane evenly across bottom of tart shell. Top with pear slices to cover, fanning out to make an attractive pattern (you might have some left over—snack away!). Scatter almonds around edges of tart and bake until pears are tender and frangipane barely jiggles when pan is gently shaken, 40–45 minutes. Transfer tart to wire rack; let cool.Step 7Just before serving, dust edges of tart with powdered sugar.Do ahead: Tart can be baked 2 days ahead. Store tightly wrapped at room temperature.How would you rate Chocolate-Almond Pear Tart?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI made this for Thanksgiving (2021) and it was a big hit!!! We had a guest who is a French chef and he was very complimentary of the end result. I used gluten free flour in place of regular flour and that is the only change to the recipe I made. Having never made anything this complicated before I followed the instructions and technique exactly. It was SO GOOD. So. Stinking. Good. Enjoy :)ErinSan Diego, CA12/30/2021I made this first (as a trial run) and it is fabulous!  I did add about 1/2 c of almond flour to the tart shell to give it a little more structure ... I added 4oz of almond paste to the filling (in small dice size pieces as the filling was mixed in a stand mixer on high speed) ... I will bake the next tart a little longer and will make it a day before I will be giving it (to my Dr) so I can refrigerate it ... it is better after being refrigerated.  Like I said, the first one was a trial run.Donna Charleston SC11/29/2021Absolutely fabulous. A friend brought this to Thanksgiving and it stole the show. The filling is extremely rich & decadent but balanced by the crisp light pears. I will be making at Christmas hoping it turns out just as elegant & delicious. EmilyLos Angeles11/26/2021I followed the ingredients, but not the techniques and had good results. I made the tart shell in the food processor, pressed it in, and aside from having way too much dough, it came out fine. I also made the filling in the food processor and it came out very good. Although the recipe says you may have extra pear slices using only 2 pears, I used almost 3 pears. It really needs the pears to cut the richness of the tart. Other than using the food processor to make the shell and filling and using a few slices from one more pear, I thought the tart was delicious. Mine looked exactly like the photo. People loved it. Marlene's CuisineFoster City, CA10/3/2021Worst frangipani tart I have ever made.  And I have made many.  I did not try the tart shell recipe, so I can not comment on that. It's not that I just did not like it... the filling was dry and not edible.  Had to through the whole thing in the trash after trying a few bites of a slice.  Followed the filling instructions exactly and did not make any changes.  Baked for 40 minutes.  I went back and compared the ratios of almonds, sugar, butter, flour, eggs, and extracts to other recipes.  The ratios in this recipe are off, especially after adding the dry cocoa powder.  I'll go back to the tried and true recipes of Mary Berry and Maggie Beers. Rick WPalm Springs9/28/2021Explore Bon AppétitTartDessertChocolateOther IngredientsAlmondNutPearFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Kristen Hall"]}