{"id": "08906ddec77e676bec0325abad1b1d98", "url": "https://www.bonappetit.com/story/large-format-tiki-cocktails", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Large-Format Cocktails Are Back, So Gather All Your Friends | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSend the Group Text Now, Because Large-Format Tiki Cocktails Are BackYou know what they say: Go big or go home. Here are the cartoonish cocktails you’ll want to swim in.By Jesse SparksSeptember 14, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailUnless you’re fresh out of college, it’s likely been a while since you plunged straw-first into a scorpion bowl with five of your closest friends. But we’ve seen a return to the large-format cocktail at bars across the country recently. It seems like bartenders are having a ton of fun bringing back the comical classic. And while our coed days may be behind us, we have ambitious intentions of enjoying these gaudy giants at every available opportunity.Maybe it’s the tower of garnishes that threaten to topple at any moment, maybe it’s the exciting combinations of classic and completely unexpected ingredients. Does the idea of slurping a drink the size of your head make you cringe? “Steer into the skid and embrace it,” says Owen Thomson, owner of D.C. bar Archipelago. “Ninety-nine percent of the time people will look at your drink with jealousy. People usually see someone’s flashy bowl on fire and say, ‘I don’t even need the menu—just give me that.’”Check out the mini lime island—spotted at Archipelago in D.C.\nPhoto by Rey LopezWe love Archipelago for slinging monstrous cocktails like their Dr. Moreau’s Vacation Retreat, named for the sci-fi film The Island of Dr. Moreau, which blends white and spiced rums with Chinese orange, honey, and fassionola (a traditional tiki cocktail syrup with bright notes of pineapple and hibiscus).Just up the coast in New York City, bartender Brian Miller of The Polynesian offers a group-sized Exotica Bowl for six to eight people. The giant punch bowl is filled with lime juice, green curry and coriander-infused rum, and swirls of lemon and lime juice, lemongrass and ginger syrups, and coconut cream. But if the sound of it isn’t enough, the presentation more than makes up for it. The drink is served on a two-foot-long clam shell with smoke from dry ice pouring over the edges. Exhibit A:The Exotica Bowl at The Polynesian: Look, don’t touch!\nPhoto by Chelsie Craig“All of my bartenders have to tell people not to touch or drink the dry ice, which seems like common sense, but we still have to say it,” says Miller. “To paraphrase the Jeff Goldblum character in Jurassic Park, ‘Just because you can, doesn’t mean you should.’”The bartenders at The Polynesian aren’t the only ones shelling out (sorry) whimsical serving vessels. In Detroit, Mutiny Bar serves their drinks in large glasses shaped like owls. At Navy Strength in Seattle, one drink that serves seven to nine people is presented in a massive conch shell sprouting straws and edible flowers. Exhibit B:Navy Strength knows that the vessel is 50 percent of the fun.\nPhoto by Chona KasingerBut bartenders often offer an important piece of advice: The glasses may be fun, but the drinks are seriously spiked. “Ask about ABV (alcohol by volume) when ordering,” says Chris Elford of Navy Strength. “Some people are trying to get their swerve on; some just want to enjoy the night.”There’s an infectious glee that comes from leaning into the ridiculous, embracing the kitsch, and ordering the cartoonish cocktail. So throw on some sunnies and fire up the group chat, because you’re gonna need backup.Now for something else, turn a cocktail into a pie:Explore Bon AppétitCocktailRead MoreLifestyleHow Drinking CBD Cocktails Really Makes You FeelBy Kelly DobkincookingIf You’re Going to Make a Tiki Drink at Home, Make This OneBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-14", "author": ["Condé Nast", "Jesse Sparks"]}