{"id": "0891328d4a774f6dfc864dea98620748", "url": "https://www.bonappetit.com/story/what-the-heck-is-honey", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "What Even Is Honey?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHoney: Not Exactly Bee Vomit. Or Is It?Your most pressing questions about honey, answered. By Alex BeggsMay 12, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI have a honey guy, and his name is Jay. (This is a brag.) Jay, who looks like he wrestles on the side, sells his local honey at my farmers market. I buy big jars of his raw honey, which he slow-churns to give it an airy, foamy texture that dissolves on the tongue. And honestly, it has a barnyard stank. When people come over, I make them sniff the jar. I eat a spoonful of honey before I exercise (nature’s Gu) or when my throat itches, and I mix it with butter to top biscuits. I love the stuff.You can scrape honey off a honeycomb and eat it right there on the spot. It’s ready to go. But because honey is an animal product, any stuff that’s imported has to be heated (pasteurized) before it’s sold in the U.S. This makes it shelf-stable and beautifully clear (there’s no reason it needs to be clear), while also killing any potential bacteria.The more the honey is heated, the more straight-up sweet it tastes because the heat cooks off some of honey’s flavor compounds. “Good quality honey has flavor,” says honey sommelier and beekeeper C. Marina Marchese. “It shouldn’t just be sweet. You should be able to pick out a minimum of two flavors in it, and a really complex honey can have three or four.” “Raw” honey is usually honey that hasn’t been pasteurized, and it has a more dynamic, delicate flavor.All the honey at the grocery store has one thing on the ingredient list: honey. But some might be made from honey sourced from thousands of hives all over the world.Which to buy?! And wait a second, what even is honey? Is it bee vomit? Marchese says no. I say: kinda. Read below and decide for yourself.What even is honey?Gloopy, sweet, naturally antibacterial honey is made by the tireless work of thousands of female bees who suck up nectar into a special stomach called the honey sac. They create an assembly line and regurgitate that nectar into each other’s sacs (sorry) until it thickens into honey. The bee nearest the honeycomb then spits it into one of those tiny perfect hexagons. The bees flap their wings and some of the water evaporates out of that honey, thickening it. Then another worker bee caps it off with some beeswax.(If you’re wondering what the male bees are up to, they exist only to get it on with the queen. “Once they have mated,” writes Stephen L. Buchmann in Letters from the Hive: An Intimate History of Bees, Honey, and Humankind, “the males fall off the queen and onto the ground, paralyzed and dying.”)Where can I buy good honey?Your best bet is to find local or regional honey at your market. The mass-produced stuff is usually a cooked-down (pasteurized) blend of hundreds of different honeys and not nearly as delicious.What should I look for (or avoid) on the label?Honey jars usually list one ingredient: honey. But that doesn’t tell you a whole lot about what you’re getting. Here’s how to decode a few other words you might encounter:RawThis is an unregulated term that refers to honey that’s either straight from the honeycomb or minimally heated. It can be cloudy (a sign it hasn’t been overly processed) and retains many of its good-for-you enzymes. Because it’s precious and expensive, save raw honey for when you can taste it front and center: spread on peanut butter toast, drizzled over a pound cake, eaten by the spoonful before a run. You might notice a whiff of hay or notes of apricot, things like that. Use the inexpensive clear and runny honey when you’re cooking or baking.UnfilteredAnother unregulated term. This generally means the honey has been strained to filter out dead bees (RIP) and/or their wings but not enough to remove other smaller, perfectly edible particles. Between you and me, it’s mostly a marketing term to make people feel like they’re getting a purer product.OrganicIt turns out it’s extremely hard to make organic honey. (YOU try telling bees to pollinate only certified-organic bushes.) Right now most organic honey comes from Brazil, Mexico, and Hawaii.Imitation Run away! This is syrup made with fake sweetener. It’s meant for those on sugar-free diets, but the mysterious filler ingredients make it suspect for all.What determines how honey tastes?Honey’s natural taste depends on what, and where, bees pollinate. (This is different from “flavored honey,” which is honey mixed with added flavors, such as blueberry.) Some common varieties include:Wildflower and clover: these commonly found honeys have a mild sweetnessBuckwheat: dark, earthy, nutty, and molasses-likeLavender: creamy and delicate, with subtle floral notesTupelo: tastes like green apples dipped in caramelChestnut: bitter, bracing, sometimes smoky, and almost savoryOnce I have it, how should I store it?Keep honey in a cool dark place. It will never spoil if kept free of moisture, but it might start to taste off in about two years. Because honey is basically sugar and water, the glucose molecules will separate from the water, causing it to crystallize and look sort of like rock candy. In fact, Marchese tells me that “crystallization is a sign of quality”—it means you’ve got real-deal honey. When your honey crystallizes, just run the jar under warm water and it’ll reliquify. Marchese spreads her crystallized honey on toast.Honey + garlic + time = fermented garlic honey.\nPhoto by Alex LauHow can I stop honey from getting stuck in the measuring cup?The next time you’re cooking with honey, coat your measuring spoon or cup with a little neutral oil before adding the honey; it will slide right out. Very satisfying.About that honey bear…In 1957, Ralph and Luella Gamber decided to package their honey in a plastic bear inspired by Winnie the Pooh and by reality: Bears love snacking on honey, beehives, and bees. What was once a side hobby in their Pennsylvanian backyard became a million dollar business called Dutch Gold Honey. They never patented the design, which is why so many other companies have adopted the cute container. (Fun fact: The bear has a name. It’s Nugget.)What’s the deal with $$$Mānuka$$$ Honey?Mānuka honey is a popular (and pricier) “monofloral” honey from bees that pollinate the Mānuka tree, grown in Australia and New Zealand. It has a higher concentration of antibacterial properties than regular honey. Make sure it’s the real stuff by checking to see if it has a UMF (Unique Mānuka Factor), NPA (non-peroxide activity), or MGO (methylglyoxal) rating on the label (each is a different measure of the antimicrobial content). Phewph!Explore Bon AppétithoneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-12", "author": ["Condé Nast", "Alex Beggs"]}