{"id": "08a492996a5e1ae43063ede7a20a21ea", "url": "https://www.bonappetit.com/recipe/beef-stroganoff", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Beef Stroganoff Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBeef StroganoffBy Beth NguyenMarch 16, 20214.2(144)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintThis classic 1950s staple of American cooking with Russian origins has been enhanced with a splash of fish sauce for depth and umami. “You can’t taste it, but you need it,” says developer Beth Nguyen, author of Stealing Buddha’s Dinner. Nguyen’s recipe is inspired by a memorable meal at a classmate’s house in the predominantly white Midwestern town she grew up in. (Read Nguyen’s essay about it here.) One thing to look out for: Sour cream can split if added directly to hot liquid, so premixing with a small amount of warm sauce will keep it smooth and creamy.Ingredients4 Servings4Tbsp. extra-virgin olive oil, divided2Tbsp. unsalted butter, divided8oz. crimini mushrooms, halved, quartered if large (about 2 cups)Kosher salt1lb. skirt steak, cut into 4\" sectionsFreshly ground black pepper2shallots, finely chopped4garlic cloves, finely chopped1Tbsp. double-concentrated tomato paste2Tbsp. all-purpose flour¼cup dry white wine2cups (or more) low-sodium beef broth1tsp. (or more) fish sauce¼cup sour creamButtered cooked egg noodles and sliced scallions (for serving)PreparationStep 1Heat 2 Tbsp. oil and 1 Tbsp. butter in a large skillet over medium-high until butter is melted. Cook mushrooms, tossing occasionally, until browned and tender, about 5 minutes. Season with salt, then transfer to a plate.Step 2Combine 1 Tbsp. oil and remaining 1 Tbsp. butter in same skillet. Season steak generously with salt and pepper. Cook until well browned, 3–4 minutes per side for medium-rare, depending on thickness. Transfer to another plate; wipe out skillet.Step 3Reduce heat to medium and pour remaining 1 Tbsp. oil into pan. Cook shallots, stirring often, until softened, about 2 minutes. Add garlic; cook, stirring, until softened, about 1 minute. Add tomato paste and cook, stirring constantly, until slightly darkened in color, about 2 minutes. Add flour and cook, stirring often to coat shallots and garlic, until toasty smelling, about 3 minutes. Add wine; cook, scraping up browned bits, until evaporated, about 1 minute. Add broth, fish sauce, and any liquid from mushrooms (leave mushrooms behind). Bring to a boil over high heat, then reduce heat; simmer, stirring occasionally, until sauce coats a spoon, 12–15 minutes.Step 4Slice steak against the grain. Place sour cream in a small heatproof bowl and gradually whisk in 1 cup sauce. Stir back into sauce in skillet. Taste and season with more salt or fish sauce if needed. Stir in mushrooms. Serve sauce over noodles, topped with steak and scallions.How would you rate Beef Stroganoff?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleThis dish was amazing! I am Celiac, and cannot find gluten-free egg noodles, (unless I make my own), so I just made mashed potatoes. The potatoes soaked up all the sauce, and it was very good. The spices were perfect. Would definitely recommend this dish. \nThank you Beth Nguyen!!Amigo100Edmonton, Alberta, Canada2/9/2022This was the best!  Beef stroganoff was a childhood favorite.  Very heavy on sour cream and low on flavor, but I loved it as a kid.  This is so much better.  Fish sauce is the secret ingredient to so many things.  The recipe calls for a small amount, but it is a big boost.  I am confident with it, so add a little more.  But just as when anchovy is the secret ingredient, you don't want the flavor to be indentifiable.  Also, with the small amount of sour cream, you get a little richness, but not a heavy sauce.JanaBoulder, CO1/13/2022Try a dollop of Minor's Mushroom Base and maybe a bit of their Beef Base. Minor's bases are the secret ingredient of many restaurants. Just cut down on the salt to compensate.StuKCT1/4/2022Anyone who grew up in America eating the Hamburger Helper version of this dish will love this transformation. Nostalgic and new all at once, very easy to make.PatrickSan Francisco12/21/2021Average. I don’t know what would make it better. AnonymousAmarillo, TX12/5/2021Good recipe. Tweaks to make a little more flavorful: Add a hefty pinch of salt and pepper with each step. Added a tsp of dried thyme, and a tsp of white pepper, and a couple bay leaves during the simmer. Really good stuff.Anonymous7/18/2021What happened to the Cognac?RoyUK6/24/2021I made the sauce first and then the steak just before serving. Huge hit amongst my eaters.AnonymousNew York NY5/13/2021It was very good , just missing something. Marsala maybe?LKDSpringerville, Az5/9/2021I will echo what other reviewers have said, this dish is perfectly nostalgic but in a fun, elevated way. It satisfied my craving for beef stroganoff perfectly. I used Bella mushrooms as that was all that I had available, and would double them next time. The fish sauce was a very nice addition. McKenzie McCarthyMilwaukee, WI4/29/2021This meal was delicious.  Followed the directions to the tee.  Added a little sriracha to the sauce for a little spice.  This meal was excellent!ALEXMiami, fl4/24/2021I have been thinking about this meal since we made it last week. The best I've had since Grandma's. And don't tell her, but I think this one is better. So flavorful. When I tasted the sauce alone I thought it might be too salty but over noodles it was fantastic. SaraRichmond, VA4/22/2021So good...AnonymousBrooklyn 4/19/2021Excellent recipe. I followed exactly, except for substituting the cremini with oyster mushrooms fresh from my friend’s farm. It took a bit of time, but it definitely paid off.Tedward C.San Marcos, TX4/19/2021delicious! i ended up using beef stew meat because that's what i had - and just let it simmer with the sauce (@30 min instead of 12-15). doubled the mushrooms. side of simply steamed green beans. super satisfying on a cold and rainy night.marcy robertsthe lighthouse4/16/2021Explore Bon AppétitBeefMeatEgg NoodleNoodlePasta & NoodlesCrimini MushroomMushroomVegetableMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Beth Nguyen"]}