{"id": "08a765274f5be2367563389b837a9b5e", "url": "https://www.bonappetit.com/story/fall-entertaining-never-looked-so-good-and-easy", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Fall Entertaining Never Looked So Good (and Easy!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredFall Entertaining Never Looked So Good (and Easy!)The key to stress-free fall entertaining? An empty dishwasher, according to Bon Appétit Executive Chef Mary Nolan.By MIELESeptember 4, 2018FacebookTwitterEmailFacebookTwitterEmailBon Appétit’s Executive Chef Mary Nolan knows a thing (or three) about home entertaining for any occasion, but fall ushers in a particularly special time for hosting guests around a menu that’s ripe for the celebratory season. Rather than stressing over what and when to prep, so that you’re mingling as often as you’re mincing, we’ve tapped Nolan to give her best time-saving tips for entertaining with ease during the holidays and beyond.Start with an empty dishwasher. This, Nolan insists, is a must, as it will only benefit quick cleanups as you go. A Miele dishwasher is as stylish as it is durable and efficient, and your guests will hardly notice how hard it’s working behind the scenes (seriously, it’s quiet). They will undoubtedly compliment its streamlined, luxurious design, however. Especially for a cook, the Miele dishwasher’s 3D+ cutlery tray is a brilliant feature for safely storing knives to clean, and the Knock2open feature offers touchless access when your fingers are covered in a day’s work.“I always have a bowl of nuts and crudités for guests to munch on.” Nolan’s go-to snacks are perfect for curbing hunger while she and her crew wait on the main dishes of the night. The Miele warming drawer effortlessly keeps those courses toasty while apps are being passed and praised, plus the 4-hour timer feature with automatic shutoff gives Nolan complete control when her attention is elsewhere.Take advantage of the earthy flavors of the season. Nolan loves fall menu planning for the seasonal flavors of woodsy mushrooms, pungent Brussels sprouts, and bright apples and squash. Throw in some fall-appropriate rosemary, thyme, and sage, and your guests will be salivating before the food even hits their mouths.Save that soufflé you’ve never made for another night. “Don’t try something for the first time when entertaining!,” Nolan insists. “If you can’t help yourself, have a plan B ready to go.” Stick to those tried-and-true recipes that you already know your guests will love that you can easily execute with little stress.“Setting the timer on my oven is key when entertaining!” Just as a meat thermometer lets you know when the roast is superb, an oven timer is a no-brainer when it comes to perfecting temperatures, hues, and crusty textures. Nolan loves Miele’s MasterChef automatic programs that allow for perfectly cooked, brilliantly timed, restaurant-quality meals–all at the click of a button. “Especially when entertaining, never count on a mental timer–you will get distracted!” Miele’s wireless roast probe is all the supervision one needs to cook meat, and even fish, to perfection, by measuring the core temperature with Miele’s countdown indicator for the most precise cook times. Even for a seasoned chef, the smartest appliances offer a fool-proof strategy for an exquisite meal.Now that the meal is complete, that empty dishwasher will definitely come in handy. Chef Nolan suggests running a load after the first course is finished, even if the dishwasher isn’t full. This step cuts down on the larger cleanup after your guests have left for the night, and waking up to a tidy kitchen in the morning is almost as enjoyable as dessert was the night before. It’s even better when that dishwasher has an AutoOpen drying feature in place. Because there’s no time for spots when you’ve got your next party to plan.No matter what timing snafus you encounter during your next entertaining event, go with the flow of it, and enjoy the good company. Take it from Nolan as she insists, “If you’re relaxed and having a great time, your guests will follow suit!” We collectively say “cheers” to that.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast"]}