{"id": "08aaa122a6316c7bcdb2977b943003f3", "url": "https://www.bonappetit.com/story/korma-sauce", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "How to Make Korma Sauce at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Wouldn’t Have Dreamt of Making My Own Korma—Until I Figured Out This Shortcut When no one is looking I just…By Varu ChilakamarriSeptember 15, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As with every great relationship, I’ve come to expect a lot from my plate. Sometimes I want it all—comfort and sustenance, but with a little spark too. That’s when I make korma, the quintessential North Indian gravy that checks every box. Korma defies strict definition, but this Mughlai dish typically involves meat or vegetables braised in a relatively mild velvety yogurt sauce that’s seasoned with aromatic spices. It often carries a nutty undertone from blended almonds, cashews, coconut, or poppy seeds. This sauce tastes good with just about anything—vegetables, paneer, or even just roti to sponge it up (you know, for when you’re in a restaurant and actual plate licking is frowned upon).There was a time when I wouldn’t have dreamt of making my own korma. Without fail, every recipe I came across contained words like “desiccated almonds” and directed me to blanch, soak, and peel the skins off each nut before grinding them into a smooth paste. Peel each individual almond? How demanding! Inevitably, I’d settle for those microwavable pouches of korma. Quick, yes, but not nearly as satisfying as freshly made.But then I discovered a game changer: nut butter. Instead of prepping and grinding nuts, all you need to do is scoop a few spoonfuls of nut butter into your pot and suddenly, you’ve transformed a generic can of tomatoes into a decadent korma sauce. Okay, so the nuts in nut butter may be dry-roasted and unskinned, which is a little different from traditional korma, but it’s barely noticeable, and did I mention, you’ll have korma in minutes?When making korma, I start by slicing and sautéing 1 onion along with 1 Tbsp. each minced garlic and ginger paste. (In my house, bottled garlic and ginger is just fine.) After this pungent trio begins to brown, I build the rest of the korma sauce in the same pot. I stir in ¼ cup water, 1 small can diced tomatoes (whole tomatoes would also work), 1 Tbsp. madras curry powder (look for one produced in India—I purchase the brand Nirav online—or, for maximum flavor and freshness, make it yourself), and 1 tsp. each garam masala, ground red chile (I like Kashmiri chile powder), and salt.And then, when no one’s looking, I pull out the nut butter. Creamy almond butter will bring you closest to a classic korma, but cashew butter works great too. Try to choose a natural, single-ingredient product where you’re only getting the nuts. Surprisingly, most brands fit the bill. But this korma is forgiving, so if you only find toasted, no-stir almond butter with sea salt, then go for it. (I wouldn't reach for one swirled with maple or chocolate.) I spoon out 2–3 Tbsp. nut butter into the pot and give it a good stir. If your nut butter is hard and clumpy—as it tends to be at the bottom of the jar—soften it up in the microwave or with a splash of hot water, or take the time to smash it with the back of a spoon once it’s in your pot, and really mix it into your sauce as it all starts to cook together. Otherwise, someone’s gonna bite into a glob—it isn’t the end of the world but it will give away your secret! If you like a smooth restaurant-texture, now’s the time to break out that immersion blender and give it a few whirls in your pot. And that’s it—that’s the sauce!After the sauce has cooked for five minutes, gently fold in the main ingredient of your choice and simmer until everything is cooked through. My favorite version is vegetarian “chicken” korma, made with frozen meatless-chicken strips, but you can swap in almost anything: Crisped-up paneer or tofu works great, or you can make a variation of navratan korma by adding in your favorite combination of vegetables, like parboiled potatoes, peas, cauliflower, broccoli, mushrooms, carrots, or even frozen mixed vegetables. Really anything you like in a creamy curry will taste great. For the unifying finale, turn off the heat and stir in 3–4 tablespoons of coconut cream, heavy cream, or yogurt, to taste.The nut butter may go undetected, but it is the subtle star of this dish. You may never go back to ready-to-eat packets of korma again and, at the very least, you’ll enjoy a much-needed break. As every nut butter fanatic will tell you, a little separation is natural.Varu Chilakamarri is a writer and attorney who loves creating easy recipes influenced by the cooking of her Indian immigrant parents. Find more of her recipes and writing in her cookbook, Indian Cuisine for the Busy Vegetarian.Explore Bon AppétitIt's That SimpleIndianCoconut CreamCurryRead MorecookingMy Mom Was Wrong About The Secret To CevicheBy Patricia AzzeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-15", "author": ["Condé Nast", "Varu Chilakamarri"]}