{"id": "08ad66c47bb617ea1cf526f4f8acf552", "url": "https://www.bonappetit.com/story/trader-joes-pumpkin", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "What’s New at Trader Joe’s: Pumpkin Stuff, Duh | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat’s New at Trader Joe’s: Pumpkin Stuff, DuhIt’s the season of the witch at Trader Joe’s. Here’s what’s good and what’s frightening.By Alex BeggsOctober 7, 2021FacebookTwitterEmailFacebookTwitterEmailI will never understand the cinnamon broomsticks. Every year Trader Joe’s sells these unsweepable decorative cinnamon-scented brooms that this witch would never use to fly outta town. There’s something unnerving about the illustration on them, an old-timey woman sweeping the yard (?) while a human-size turkey (!) lurks behind her shoulder, ready to kill.So I didn’t buy a haunted broom on this trip. But they’re in stores now, stinking up the place, which means it’s fall and the pumpkin stuff is here too. On to it!Cake MixesGluten-Free Pumpkin Bread MixPretty neat that this is made with sorghum flour, a naturally nutty-sweet flour made from a resilient ancient grain. (Make these cookies plz!) The cake was tender and moist with a spongy crumb, but it leaves a very delicate sandy texture in your mouth and a slightly bitter aftertaste. Add chocolate chips to fix that and generally every other problem.Chocolate Mochi Cake MixYou know your corporation is doing something right when your new food products have reputations. Like this cake, which I heard was bad before I even bought it. However, innocent until proven guilty and all that, so I made the cake and ate a warm slice of it and it was mildly chocolaty with bonus—chocolate chips!—and it had that delightful mochi spring in its step. Bounce bounce bounce. I skipped making the peanut butter buttercream (it comes powdered? suspect) out of laziness and a need for warm cake. Maybe the frosting’s the bad part. On day two  my cake was dried out and stale, and I chewed it like a cow in a field snacking on grass after three weeks of drought. Mooooooving on.Baking Stuff, Cont’dCaramel Sea Salt Baking ChipsMmm, is that palm kernel oil? These not-chocolate chips taste like caramel-flavored coffee. There’s a hint of salt, but do NOT assume that means you shouldn’t salt your cookies after baking. Never, ever stop. I don’t care what phase of cookie trend we’re in, KEEP ON SALTIN’.Vanilla Bean PasteSO COOL this exists and is at Trader Joe’s, in a smaller jar than I would like but whattyagonnado. When you bake with vanilla bean paste in place of vanilla extract, the flavor’s basically the same, but you get this rustic speckle in whatever you’re making. Love that.Pumpkin SpreadA pumpkin jelly thing you serve on your autumnal cheese plate, along with some twigs from the yard for a touch of authenticity (and is that dog pee?). But here’s an idea: Use this in place of sugar to make a pumpkin spice old-fashioned: 1 Tbsp. of “spread” in the bottom of your mixing glass + a few shakes of bitters, muddle that up, + 2 oz. bourbon, add ice and stir, strain over a glass of ice and garnish with orange peel.Brightly Packaged ThingsSpiced Pumpkin Madeleine CookiesThese are great; dip them in coffee. Not too pumpkin-y, and apparently the pumpkin is dried pumpkin flakes? Had no idea that existed. Oh, interesting, you can buy it for dogs who have diarrhea. Poor fellas.Crispy Thai Chilies & Sesame SeedsThese crispy, wispy, spicy snacks with a subtle sesame flavor are very entertaining to eat out of the bag, or you can top bland stuff with them for a WHOOSHBANG taste bud attack. The downside is that eating chile pepper skins, like tomato skins, is like eating wax paper. Even when they’re fried and filled with sesame seeds. So when your saliva hits them the chiles melt and soften, but they don’t shatter. Hey, I’m just giving you the tools you need to make informed purchases.Tricolor SpaghettiYou know it’s really fall when even the pasta is changing colors. I drive along the desolate country roads of the American Midwest in search of the changing pasta colors, seeking out the sage green and pumpkin-hued spaghetti, blasting Fleet Foxes and sweating in my flannel. Isn’t this the greatest season? The pasta, though, tastes like pasta.Kintamani Small Lot CoffeeForgettable!Jasmine RiceRice, but branded!Pumpkin AtrocitiesPumpkin Spice Hummus I read somewhere that in an early draft of Frankenstein, Mary Shelley has the monster roaming the aisles of Trader Joe’s—turns out, he’s vegan—and he smashes on some pumpkin spice hummus before continuing the angsty search for his papa. Editors thought it was “too spon con” so she cut it. But that’s why we see pumpkin spice hummus at Trader Joe’s during this spooky time of year. Like the monster, it’s deeply misunderstood. It tastes kind of like carrot cake frosting, and it’s great for dipping graham crackers in. It is not, however, savory or good with savory dippers, like baby carrots or chips—that’s when things get weird. Sample at your own risk.Pumpkin Four Cheese DipWe’ve got lightly spiced puréed pumpkin with cream cheese, Greek yog, and shredded Monterey jack in a dip you’re supposed to HEAT up before serving. I tried it cold—gag, gag, gag. Then I microwaved it as recommended. Now I will say, with a salty enough chip, your taste buds can pick out the melted cheese and disregard the pumpkin, and they say humans have survived on this for years in some remote parts of Alaska. But look too close and you’ll notice that the dip oozes off the chip not unlike a deep-winter booger. Which reminds me, gotta schedule a flu shot!Cheeses & Non-CheesesCheddar Cheese with Scotch Bonnet Chili PeppersVery sweet and not spicy at all? Has corn flour in it?? Creamy? I was not expecting any of this.Green Goddess GoudaCreamy, garlicky, herby. Tastes like ravioli filling.Vegan Cream Cheese AlternativeImpressed! It’s got that tangy cream cheese flavor, cloaked in shiny coconut oil. Like dairy cream cheese, it’s very hard to spread, and this stays solid even when it’s room temperature. No biggie.Shredded Parmesan Cheese AlternativeNa na na na na na na nope. This ambitious cheese alternative has an off-putting sweetness. I think if I were vegan looking for a pasta topping alt, I’d go with nutritional yeast over this flavored potato starch. But I do believe impressive progress is being made in the world of cheese alternatives, and that’s called “ending on a high note.”Jars o’ StuffIndian Garlic AchaarSuuuper garlicky—yum—rounded out with tangy red pepper. I ate it with the spicy pumpkin samosas and veggie bites, reviewed below.Kalamata Olives Oops, there’s a new version of these olives that’s spicy but I got the boring one. Boring.Green Goddess Seasoning BlendToo much onion, not enough goddess.Brown ButterNutty grease.High-Oleic Sunflower OilHigh oleic, high smoke point, high hopes. Turns out it’s just oil!Green Frozen BagsApple Cinnamon Oatmeal BitesBreakfast arancini! Portable! These are lil’ oatmeal bombs with a crispy breadcrumb-and-sugar crust. I air-fried them, of course. Note: They WILL leave greasy sugar fingerprints all over your steering wheel, keyboard, or crime scene.Organic Veggie BitesThese look like beaver scat, but don’t judge a book by its cover etc etc etc! These are a space-age snack of mushed vegetables, probably a lot of potato plus three carrot cubes, formed into a dense “bite.” You bite the bite, it’s very meta. I watched as my partner spooned sour cream straight from the container, set a bite on top, and ate that, bite-after-bite. What a fright!Frozen Orange BoxesMini Pumpkin Spicy SamosasPumpkin isn’t always pumpkin spice, okay?! Sometimes it’s SPICY. PUMPKIN. Which is even better. There’s a nice heat to these crispy samosas and more importantly, there’s salty creamy paneer in the filling.Butternut Squash Mac & Cheese BitesWhenever I eat finger foods from Trader Joe’s I picture myself as a wedding planner helping the lovely bride/groom decide which apps to pass around their cocktail hour. Because if I were the type of person to want to get legally bound to another human, I’d want to kick off the party with some Trader Joe’s passed apps. No one does it better!* So I’d tell the happy couple, serve the butternut balls with a compostable fork because they fall apart on the first bite, not unlike the fate of this marriage. They’re still wonderful, don’t get me wrong, just don’t forget the fork, and a good attorney.*maaaybe Cheesecake Factory doesSweet Cinnamon Filled Korean PancakesHello, hotteok! The key to preparing these from frozen is to let them defrost for 30 minutes or so, then fry them in a dry skillet for 3 to 4 minutes, but don’t overdo it or they’ll dry out and you won’t get that pillowy, chewy texture that yields to a sweet cinnamon goo inside. Love these.Hatch Chile QuicheOkay, so it’s a spicy quiche with a corn tortilla chip crust. Creative! The second bite brought the heat; the third brought the malaise. The center of the crust was unfortunately soggy due to the plastic tray it bakes in. Overall: really, really decent.Eggwich Breadless Breakfast SandwichesThe perfect square of frozen American cheese, bright, plasticky yellow circles of egg-cornstarch-milk patties—is this Lego food? The turkey sausage cooks to this gorgeous gray that only turkey can pull off. Delicious. As satisfying and greasy as a McMuffin, sans muffin. Still not sure why people are so scared of bread, but if you know, don’t tell me.Explore Bon AppétitCultureFallTrader Joe'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-07", "author": ["Condé Nast", "Alex Beggs"]}