{"id": "08b2a0189351e9bd1d62331dbe53b71c", "url": "https://www.bonappetit.com/recipe/grilled-mushrooms-and-root-vegetables", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Grilled Mushrooms and Root Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueGrilled Mushrooms and Root VegetablesBy Maricela VegaJanuary 12, 20214.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“My great-grandmothers were Indigenous and mostly nomadic, which means lots of fungi foraging,” says Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora. “When I serve lion’s mane mushrooms to vegans they sometimes mistake them for chicken, but they’re more affordable, better for the planet, and help strengthen your immune system! They grow wild during Georgia winters, but at-home cultivation kits are easy for those without forest access. I use pumpkin hot sauce, oil, and fresh herbs as a marinade, then bust out a baby grill or cast-iron skillet to get them nice and crispy.” This is a multistep recipe but perfect for long winter days when you want to flood the house with toasty, irresistible aromas. When you chop the mixed herbs, save the stems and throw them into the blanching water for the vegetables to add flavor.Ingredients4 ServingsSesame Sauce1cup Sesame Crème2Tbsp. Allium Confit2Tbsp. finely chopped mixed tender herbs (parsley, oregano, and/or mint), stems reservedfor blanching vegetables2Tbsp. apple cider vinegarKosher salt, freshly ground pepperassembly1cup finely chopped mixed herbs (parsley, oregano, and/or mint), stems reserved for blanching vegetablesKosher salt4medium carrots (about 1 lb.), preferably rainbow, scrubbed, halved lengthwise, cut crosswise into thirds4lb. baby potatoes, halved1head of radicchio, coarsely chopped, divided1lb. lion’s mane, king trumpet, or oyster mushrooms, cut into 2\" pieces½cup Pumpkin Hot Sauce½cup grapeseed or vegetable oilFreshly ground black pepper1cup Spiced Pecans1lemon, halvedPreparationSesame SauceStep 1Purée Sesame Crème, Allium Confit, chopped herbs, and vinegar in a blender on high speed, adding ice water by the tablespoonful as needed to achieve a pourable consistency, until smooth and creamy. Season sauce with salt and pepper.AssemblyStep 2Fill a large pot three quarters full with water, add reserved herb stems, and season heavily with salt. Bring water to a boil, then add carrots and cook until just tender, about 3 minutes. Using a slotted spoon, immediately transfer carrots to a large bowl of ice water and let cool.Step 3Place potatoes in same pot and return to a boil. Cook until tender (flesh should be easy to pierce with a fork), about 10 minutes. Using slotted spoon, transfer potatoes to bowl of ice water and let cool. Drain carrots and potatoes; place in a clean large bowl and add half of the radicchio. Place mushrooms in a medium bowl.Step 4Whisk Pumpkin Hot Sauce, oil, and chopped herbs in another medium bowl. Pour half of mixture over carrots and potatoes and the other half over mushrooms; toss each to coat. Season with salt and pepper.Step 5Prepare a grill for medium-high heat. (Alternatively, heat a large cast-iron skillet over medium-high.) Grill mushrooms, turning occasionally, until deep golden brown and crisp around the edges (or cook in batches, stirring often, if using a skillet), 12–14 minutes. Transfer mushrooms to a large shallow serving bowl.Step 6Grill carrots, potatoes, and radicchio, turning occasionally, until deep golden brown all over (or cook in batches, tossing often, if using a skillet), about 4 minutes. Transfer vegetables to bowl with mushrooms and toss to combine.Step 7To serve, drizzle generously with sesame sauce; top with Spiced Pecans and remaining radicchio. Squeeze juice from each lemon half over.How would you rate Grilled Mushrooms and Root Vegetables?Leave a ReviewTell us what you thinkExplore Bon AppétitRice and Grain BowlNative AmericanAmericanMushroomVegetablePotatoMainVegetarianDairy-FreeGluten-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}