{"id": "08ba8bc3348ee8279a15263023099339", "url": "https://www.bonappetit.com/recipe/chicken-and-rice-with-leeks-and-salsa-verde", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Chicken and Rice With Leeks and Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueChicken and Rice With Leeks and Salsa VerdeBy Deb PerelmanAugust 18, 20204.1(75)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie THEODOROUEmailPinterestPrintEmailPinterestPrint“After a draining day juggling work, homeschooling, and urging children to stop using their masks as slingshots, the ideal food for me isn’t perfectly prepared food that’s been tweezered into position, but a meal that’s simply comforting,” writes the Smitten Kitchen’s Deb Perelman. Right now, it’s this deeply cozy pot of tender chicken thighs, jammy leeks, and broth-soaked rice.Ingredients4 Servings1½lb. skinless, boneless chicken thighs (4–8 depending on size)Kosher salt, freshly ground pepper3Tbsp. unsalted butter, divided2large or 3 medium leeks, white and pale green parts only, halved lengthwise, thinly slicedZest and juice of 1 lemon, divided1½cups long-grain white rice, rinsed until water runs clear2¾cups low-sodium chicken broth1oil-packed anchovy fillet2garlic cloves1Tbsp. drained capersCrushed red pepper flakes1cup tender herb leaves (such as parsley, cilantro, and/or mint)4–5Tbsp. extra-virgin olive oilPreparationStep 1Season chicken with salt and pepper. Melt 2 Tbsp. butter in a large high-sided skillet over medium-high heat. Add leeks and half of lemon zest, season with salt and pepper, and mix to coat leeks in butter. Reduce heat to medium-low, cover, and cook, stirring occasionally, until leeks are somewhat tender, about 5 minutes. Remove lid, increase heat to medium-high, and cook, stirring occasionally, until tender and just starting to take on color, about 3 minutes. Add rice and cook, stirring often, 3 minutes, then add broth, scraping up any browned bits. Tuck short sides of each chicken thigh underneath so they are touching and nestle seam side down into rice mixture. Bring to a simmer. Cover, reduce heat to medium-low, and cook until rice is tender and chicken is cooked through, about 20 minutes. Remove from heat. Cut remaining 1 Tbsp. butter into small pieces and scatter over mixture. Re-cover and let sit 10 minutes.Step 2Meanwhile, pulse anchovy, garlic, capers, a few pinches of red pepper flakes, and remaining lemon zest in a food processor until finely chopped. Add herbs; process until a paste forms. With motor running, gradually stream in oil until loosened to a thick sauce. Add half of lemon juice; season salsa verde with salt.Step 3Drizzle remaining lemon juice over chicken and rice. Serve with salsa verde.How would you rate Chicken and Rice With Leeks and Salsa Verde?Leave a ReviewTell us what you thinkReviews (45)Back to TopTriangleThis is really 3.5 stars, closer to 4. It was easy to prep and put together. The taste was only ok for the chicken and the rice, the but salsa verde elevated the meal entirely. After reading the reviews about the lack of color vs the photo (which is what led me to the recipe to begin with), I decided to brown the chicken first. I had 2 bone-in skin-on thighs to round out the weight. They browned very nicely, and cooked in just the right amount of time, as opposed to the skinless thighs which were not nearly browned and were verging on overcooked by the time the rice was done. Also, where was that \"jammy leeks\" taste? I thought I had 2 large leeks but what constitutes large? How about 2 large leeks to equal x cups? If I make this again, I will increase the leeks, use bone-in, skin-on thighs, browning them first, increase the salt and pepper in the rice and double the salsa verde. Nice for a weeknight meal in terms of ingredients and time, but lacking in the flavor department- except for the salsa.SuzanneDaly City, CA12/14/2021I made this tonight for dinner. Great flavor and  pretty easy meal to put together. My only complaint (I rarely have them with BA recipes), is that the picture shows the chicken has a nice brown skin. You cannot achieve this look if you follow this recipe. The chicken is essentially boiled so you get that unpleasant boiled chicken look. It’s definitely not like the picture. You would have to sauté the thighs in the butter first to achieve that look. I love a good browned skin with a slight crisp to it. That being said, the rice and chicken cooked  thoroughly within the 20/30 minute timeframe. I used mint, parsley and cilantro in the salsa verde. It was delicious. I love a one pan meal. ShanFlorida9/25/2021I made this last night. Flavor was fantastic but it didn’t turn out like the picture. I had to extend cooking time because rice was still crunchy and the chicken was not browned. I had to take the chicken out of the dish and brown it in another pan stovetop. How did Deb get that beautiful brown top on her chicken?BarbaraLittle Rock, AR5/22/2021Cozy deliciousness is right. I love this dish and make it all the time. When I make the salsa verde I make a double batch because it’s so yummy. Highly recommend. ilanaVermont4/26/2021Delicious recipe but disappointed in BonApp for a photo that definitely does not represent the finished product if made according to directions. The chicken in the photo is browned and looks like it has the skin on it. KKGPDXPortland, OR4/5/2021i think browning the chicken thighs first is a MUST. It tastes strange otherwise. The salsa's delicious. godsyllaLos Angeles, CA3/13/2021SO GOOD! cooking the rice in the chicken broth makes it superrr flavorful and delicious!Anonymous2/14/2021Comforting, easy to make bowl of chicken & rice with v. delicious salsa. I omitted the anchovy filet and added basil that I had on hand. Used jasmine rice which worked fine, just ended up pretty soft. Definitely would recommend/make again.L YenSan Francisco, CA2/12/2021Great recipe but read carefully because a number of ingredients get split (butter, zest, lemon juice). I would double the salsa verde, and no the thighs won’t get browned/crispy unless you brown them separately but they’ll still taste great. I used a mix of boneless and small bone-in thighs and they cooked in the same amount of time. Don’t skip the 10 minute rest at the end! Next time I’ll add more stock because my Jasmine rice came out a bit al dente. AnonymousBrooklyn, NY2/1/2021Why write a recipe like this? Step 1 has about 10 steps within it. Makes it very hard to follow along while cookingAnonymous1/6/2021Turned out better than expected! Browned the boneless thighs in butter first for some color and used anchovy paste instead. Very comforting and flavorful meal! Will definitely make again. Lindsey 12/13/2020Super easy and so flavorful!\nSVRPismo Beach, CA12/3/2020This was gorgeous!  I cooked the thighs sous-vide BC I wasn't sure when we were going to eat (watching the elections!), the seared them and put into the reserved amazing rice and topped with the fantabulous salsa verde.  An amazing, simple and comforting meal that we needed.  Thank You BA!James MPalm Beach FL11/7/2020Delicious! Brown the chicken if you want or not - this dish is wonderful. Make more of the salsa verde.\nPhiladelphia, PA11/4/2020My best friend, best Foodie friend highly recommended this.... can't wait to try!  HOWEVER, the pic does not begin to display the recipe.  Those thighs are NOT skinless and I'm pretty sure not boneless.  SOOOO, which should I use?  comments seem that the chicken is poached, not browned so kind of deceptive.  Will try based on reliable friend and comments!  Sangre de Cristo Mountains, Colorado10/29/2020Explore Bon AppétitChickenPoultryChicken ThighRiceRice & GrainsLeekVegetableSpringWeeknight MealsOne-Pot MealsEasyMainGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Deb Perelman"]}