{"id": "08bca371b8c9f9c4b31f6adb293342c8", "url": "https://www.bonappetit.com/story/callies-fiery-pimento-cheese", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "The Only Thing Better Than Pimento Cheese? Extra Spicy Pimento Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Only Thing Better Than Pimento Cheese? Extra-Spicy Pimento CheeseThe fiery pimento cheese from Callie’s Hot Little Biscuit is a taste of home.By Megan WahnMarch 3, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My mom was never a whiz in the kitchen. As a mother of five, caring for and carting kids to play rehearsals or soccer practice gave her limited spare time to refine her culinary skills, so most Mom-made meals and snacks were relatively straightforward. And my favorite of her simple, homemade snacks was a pimento cheese sandwich, which I ate constantly as a teenager. After I moved to New York, I didn’t eat pimento cheese for a bit, mostly because it wasn’t readily available at my local grocery store the way it had been back in Georgia. So when I found this fiery pimento cheese from Callie’s Hot Little Biscuit online, it felt a bit like coming home.Photograph by Isa Zapata.  Food Styling by Kat BoytsovaFiery Pimento Cheese$28 at Callie's Hot Little BiscuitPimento cheese is a spread made using cheddar, mayonnaise, pimento peppers (you can also use roasted red bell peppers or piquillo peppers if you don’t have pimento on hand), and hot peppers or hot sauce, but the exact contents can vary depending on the recipe. Traditional pimento cheese (which Callie’s makes as well) has a subtle, very tolerable undertone of spice, but for heat fiends like me, Callie’s fiery pimento cheese incorporates a bit of extra kick thanks to the addition of cayenne. It’s that creamy sort of spicy that settles on the tongue so you can run it around your mouth for a bit before the spice hits the back of your throat.Down South we like to say that if something isn’t good enough, just add butter. Personally, I think that adage also applies to pimento cheese spread. Most anywhere I’d use regular old cheese, I swap in Callie’s fiery pimento cheese instead: Of course it pairs well with crackers and biscuits (make your own or add them to your pimento cheese order), but I especially like to make ham, egg, and pimento cheese bagel sandwiches. The spread warms up when packed in between a toasted bagel and fried egg, turning it slightly runny.There’s not a lot about New York that reminds me of home. But no matter how I use it, Callie’s pimento cheese instantaneously makes me feel like I’m back in the kitchen with my mom, even when she’s over 900 miles away.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-03", "author": ["Condé Nast", "Megan Wahn"]}