{"id": "08c09d796a55e270e0f0278154b0d303", "url": "https://www.bonappetit.com/story/peoples-kitchen-collective", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "The People's Kitchen Collective Is Bringing Activism to the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe People's Kitchen Collective Is Bringing Activism to the TableThe Oakland-based group is serving food with a political message, and their meals are some of the hottest tickets in town.By Abigail BereolaJune 19, 2018FacebookTwitterEmailPhoto by Sana Javeri KadriFacebookTwitterEmail“Restaurant spaces from their beginning were never meant to serve everyone,” says Saqib Keval, a chef, activist, and community organizer. “Restaurants are inherently colonial projects.” As an alternative to these spaces, he formed the People’s Kitchen Collective (PKC) in Oakland along with Sita Kuratomi Bhaumik, and Jocelyn Jackson. The three of them use their backgrounds in food, fine arts, education, and the law to look at how food, art, and justice intersect. “People’s Kitchen has always looked at how recipes tell the stories of who we are,” Keval says. “If we look at a recipe as a primary source document, you’re also passing down everything that generation’s gone through.”PKC is committed to bringing people together to enjoy a home-cooked meal, using local and organic ingredients to feed as many as they can. They also run educational programs to spread knowledge and engage with the history and politics of food. For the past year, they a ran a four-part series aimed at bringing together the food stories and practices of a community, called “From the FARM to the KITCHEN to the TABLE to the STREETS!”Peoples Kitchen Collective cofounders Jocelyn Jackson, Saqib Keval, and Sita Kuratomi Bhaumik.\nPhoto by Sana Javeri KadriOn Sunday, May 20 (the birthday weekend of Malcolm X and Yuri Kochiyama), that series culminated in a free community meal for 500 people at one long table in West Oakland. Artists, performers, activists, and musicians facilitated conversations about movement-building, cultural preservation, and self-determination. In October, they will be hosting their annual Free Breakfast Program inspired by the Black Panther Party for Self-Defense at the Life is Living Festival. A few days before The Streets, the members of People’s Kitchen Collective told me more about their work and their most recent series.How did People’s Kitchen start?Saqib Keval: I started People’s Kitchen about 11 years ago. I was working in a lot of fine dining and then my other life was doing a lot of activist work—a lot of community-based organizing, a lot of social justice work, and civil rights work. I was working in these restaurants and working in these dining spaces that 1) were taking me away from these meetings and 2) I was cooking and serving food in places that were really exclusive. I knew there could be more. I wanted to create an alternative to that, and that’s how People’s Kitchen started.We did a meal every month and the meal told a story. The menu told a story of a different political movement and there was no price on the menu. You’d come, you ate, and you paid what you could. Whatever you gave went directly to the political project that the meal was geared toward. There’s no publicity, there’s no PR. It was very community organized and very grassroots. You’d get houseless people coming, teachers, families, couples out on dates—it was a very unique dining experience.And then word got out about it, and the dynamics started shifting. We got a lot more self-described foodies and people who were looking for the new dining fad. I found out that people were selling reservations on Craigslist and that really threw me for a loop. Like who’s selling these $50 reservations for a free community meal? [Sita, Jocelyn, and I] turned it into a collective. We kept doing large-scale free community meals, we started doing the Black Panther Free Breakfast programs. We kept doing a handful of things, but stopped the monthly meals.Tell me a little bit about your background.SK: I’m from a really large immigrant family. I grew up where it was normal to cook for 200 people at our family functions and that equally pushed me as a chef in my restaurant life but also in my life around organizing and food and building community.Sita Kuratomi Bhaumik: I’m an artist and I actually started cooking as a way, really, to encourage people to come to organizing meetings at my house. I have never worked professionally in a restaurant. I always tell people I’m authorized only to make art and I have no license to make food. But I come to it as part of my art practice.Jocelyn Jackson: I feel a real draw to continuing to tell the stories of my ancestors and that being a crucial part of my own survival—remembering these flavors, remembering these recipes, remembering the stories and experiences, as an individual, and as a person who takes a sincere and deep responsibility for the community that I am a part of.Why the kitchen, specifically?SK: The first thing that a colonizer does to control the population is to divorce them from their food and their food sources. By changing a people’s diet, you change who they are, and you change their access to their own sense of self and their histories. That made me want to do food justice work and organizing work. A recipe puts a community in a time in a place, because by looking at a recipe, you know what ingredients they had access to.SKB: Food is not without its pitfalls. I think there’s a lot of times that we can think, oh, you know, how wonderful we all just sat down together and broke bread, but to me, it’s actually much more complicated than that. What are you serving? Whose table is it? How are you eating? Who’s invited? All of those questions actually can create and have created a lot of divisions, but I think the promise of food, for me, is where it’s a place where people can see each other.Can you talk about “From the Farm to the Kitchen to the Table to the Streets?”JJ: When we say ‘farm,’ it is not only the fact that there’s beautiful produce propagated and cultivated on these pieces of land—the farm also means that for some people in their ancestry, including my own, that it used to be ‘plantation.’ It used to be a place of deep trauma and struggle. With Kitchen, we had this chance to collect people’s stories around what your elders, your family, gave you to find healing in your life. We’re talking about physical ills, but we’re also talking about social ills. We need to tend to the health of our social communities.SKB: We had two collaborators, one from Mexico and one from India, and we asked them to bring a suitcase with the flavors of home. We didn’t know what they were going to bring. When they arrived in the kitchen before the event, we cooked a dish made out of those ingredients. I think so often, even when language doesn’t get passed down, flavors do. I don’t speak fluent Bengali, but I know those flavors of mustard and of coconut.JJ: With Kitchen, we had this chance to collect people’s stories around what your elders, your family, gave you to find healing in your life. We’re talking about physical ills, but we’re also talking about social ills. We need to tend to the health of our social communities.SKB: The Table meal was a really personal experience for me in that it commemorated Executive Order 9066, which also fell on President’s Day this year. [That’s] the order that [Franklin D.] Roosevelt signed, incarcerating Japanese-Americans during World War II. We wanted to think about how that history can connect with the Muslim ban and registry, with incarcerated peoples, and also with undocumented folks.JJ: [With the Streets,] there is a marked difference of having a meal inside and then having a meal on your stoop, you know what I mean? It is that moment for everyone to take notice and to really acknowledge the issues that we are presenting.SK: We need to demand that the voices that we don’t hear are the ones that we give priority to. You know the saying, “There’s too many cooks in the kitchen?” That’s the exact opposite of what we’re going for. We try to fill the kitchen with as many cooks as possible, and that’s intentional.What sustains you in this work?SKB: People. For me, it’s absolutely the relationships that are built in the meals that we produce. Something about this feeling of if you are in collaboration with someone, what you can do together is more than what you can do alone.JJ: When we’re in the kitchen, we are doing the work of honoring our ancestors by enjoying the process. At the end of one of these events, I’m tired, but I’m also visibly enriched. There is such a giddiness to being able to create this kind of space for community to share.SK: I’ve been doing People’s Kitchen for years now and I’ve stepped away, I’ve taken breaks, but I can’t leave. Growing this project and discourse around food and activism and politics is very, very important. There are more people having these conversations in the mainstream food spaces—more food writers of color, food writers in general, I think—approaching these questions and asking them. And that’s exciting for me. It makes me feel like we’ve been doing something right.Explore Bon AppétitHealthyishOaklandBay AreaEventsInterviewsRead MorecultureAileen Suzara Is Flipping the Script About 'Unhealthy' Filipino FoodBy Melissa Pandika Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Abigail Bereola"]}