{"id": "08ce745ff277f4d0232d619eb619adf0", "url": "https://www.bonappetit.com/story/wellness-should-be-more-inclusive", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Wellness Should Be More Inclusive, and Here's What You Can Do to Help | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWellness Should Be More Inclusive, and Here's What You Can Do to HelpThere is no one-size-fits-all when it comes to being well.By Jessica Jones, MS, RD, CDE of Food Heaven Made EasyMay 11, 2018FacebookTwitterEmailPhoto by Jessica JonesFacebookTwitterEmailEvery time I scroll through headlines or feeds promoting healthy eating and living well, the wellness representative always has a look. She’s typically a she, almost always white, usually thin, conventionally attractive, and young. Her fitness regimen predictably alternates between burpees and bikram yoga. Don’t believe me? Do a Google image search of “wellness woman” and see what comes up.I have worked as a Registered Dietitian in community clinics, universities, private practice as well as public health institutions and hospitals, and the majority of my clients don’t embody the media’s personification of wellness. They are from a variety of ethnic backgrounds, and run the gamut in terms of age, body shape, size, and physical capability.The message being delivered in the media, however, is that we’re all just an acai bowl away from toned arms, a six-pack, and our best life. Many folks who don’t fit the narrow definition of what wellness looks like are left feeling either invisible or incredibly insecure. The options they’re left with are either 1) reject the idea of wellness altogether because it’s not for them, or 2) develop a set of unsustainable, disordered behaviors in an attempt to get “well.”But it doesn’t have to be this way. There is no one-size-fits-all when it comes to being “well.” Take exercise, for example. Not everybody has to do HIIT (or even yoga) to make exercise work for them and to improve their health. We need to expand our idea of what pleasurable, sustainable physical activity looks like on an individual basis. It may not even involve stepping into a gym, and that’s okay. Walking, taking the stairs, and even gardening all count as exercise, and they don’t require you to cough up $35 for a class to do it.Indeed, money should not be a barrier to entry. As a dietitian, I love me an almond milk matcha latte, but that’s not what wellness looks like for everyone. It also may not be accessible for many. For example, this green tea is typically only found in specialty stores, and it’s also incredibly expensive (usually upwards of $15 for a 5.5 ounce container). Many of my clients from all backgrounds have told me that they can’t afford to regularly add avocado to their meal because it’s just too pricey. Upgrading wellness for some can be as simple as replacing sugar-sweetened beverages with water.If you work at a media outlet, knowing your audience, what they can afford, and what they want to see requires being proactive. Some mainstream publications are taking a stand when it comes to who and what is featured on their platforms. SELF, for example, has been vocal about making it a priority to highlight more diversity in the content that it features. This goal is bound to require some self-examination. Do your fitness models come in all shapes and sizes? Is there a diversity of representation on your social media feed? Are you inviting people from people of color, and people from marginalized communities, to speak at your events and on your panels? If the answer is no and you represent a mainstream media outlet, you need to do better.And if you feel that you aren’t being reflected in the media you’re consuming, it’s time to start consuming other media. I recommend that my patients do “social media scrubs” when it comes to accounts that have a one-dimensional portrayal of wellness. This means going through your social accounts and unfollowing platforms that don’t make you feel empowered and truly good about yourself. It’s also a great opportunity to discover wellness accounts that can motivate you without making you feel like you have to change the way you look. Some examples I love include @cherrybombemag, @thebodypositive, @jarrymag, @bodyposipanda, and @blackgirlinom.The good news is that the wellness world is changing. My hope for the (near) future is that wellness continues to look more and more like everyone: diverse, accessible, inclusive, and broad. People should be able to see themselves represented in the wellness space, no matter where they come from or what they look like. And everyone deserves the opportunity to be healthy in whatever way works for them.Explore Bon AppétitHealthyishessayRead MoreLifestyleI Helped Turn Wellness Into a Luxury Good. Now It's Out of ControlBy Rachelle RobinettRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-11", "author": ["Condé Nast", "Jessica Jones", "Ms", "Rd", "Cde Of Food Heaven Made Easy"]}