{"id": "08d0c480c382bb906d60fa73fa88285e", "url": "https://www.bonappetit.com/story/how-to-clean-kitchen-sink", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How Often Do You Really Need to Clean Your Kitchen Sink? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAre You Cleaning Your Kitchen Sink Often Enough?It's the second most germ-filled place in your kitchen. Here's how to kill those germs.By Alyse WhitneyJanuary 8, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailAfter roasting a chicken, the last thing you want to do is wash dishes. But your mom taught you well, so you clean them up and then immediately get in your pajamas and turn on Black Mirror. However, you forgot one important step: You need to clean your kitchen sink. You don't want to know how many germs are just starting the party after you leave them alone in the sink with bits of food and a moist—sorry!—environment.The sink is the second germiest spot in your kitchen, according to studies by NSF International, a public health and safety inspection and certification company. (The No. 1 is your sponge—more on that later.) To keep microorganisms from populating your sink, you should wash and disinfect the sides and bottom at least one a week, says Lisa Yakas, microbiologist and Senior Certification Project Manager of Food Equipment at NSF International. However, if you work with raw meat or are scrubbing dirt off of potatoes, don't wait—wash it immediately.There are a few ways to clean. The first line of defense should be simple hot water and dish soap. Take a clean sponge and scrub off any chunks of food or pieces of residue you see in there, getting every nook and cranny. Yakas explains you cannot disinfect a surface unless it's already clean, so soap and water should be your first step always. Afterward, you could use a disinfectant wipe—Yakas recommends checking for cleaning products with an EPA Safer Choice seal, like Clorox Green Works—white vinegar diluted with a little water, or diluted bleach. This works for any surface in your kitchen, but if something will touch food, use vinegar over bleach. If you really want to use bleach, use a 1:50 ratio (a cap of bleach to one gallon of water) and then rinse thoroughly with water afterward.Hey, you gotta clean your sponge, too!\nAlex LauFor an extra deep clean, sanitize your drain too. Pour 1 tsp. of bleach and 1 quart of water down the drain, and also clean any food traps, strainers, or drainers you have over your drain with bleach, too. This should be done at least monthly. If you have a dishwasher, you can clean food traps in there on the top rack.The last, and most important, part about cleaning your sink is cleaning your sponges. \"There are so many cracks and crevices for germs to hide in, and germs love moisture,\" Yakas explains. If it smells or looks filthy, throw it away. The sponge is the number one germiest spot in your kitchen, so all that sink cleaning will go to waste if what you're \"cleaning\" it with is horrifyingly gross. What are you waiting for? Go clean your sink.Here's a DIY cleaner you can use too:Explore Bon AppétitCleaningHow-ToRead MorecultureHow to Clean the 6 Most Neglected Places in Your KitchenBy Alyse WhitneycultureThe 7-Day Kitchen Cleaning Plan That You Can Actually ManageBy Alyse WhitneycultureWait, Should You Be Diluting Your Dish Soap?By Alyse WhitneycultureScrub Daddy's New Product Is Even Better Than the OG SpongeBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-08", "author": ["Condé Nast", "Alyse Whitney"]}