{"id": "08d543d0cd8fd29b6e8d457d6e3393bf", "url": "https://www.bonappetit.com/story/linen-napkins", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "These Linen Napkins Make Me Feel Way Fancier Than I Am | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Linen Napkins Make Me Feel Way Fancier Than I AmThey're big enough to handle a messy, saucy meal without being unwieldy—and easy to throw in the hamper when you're done.By Emma WartzmanMay 20, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Until recently, when I hosted a dinner party, I would set out paper towels as napkins without thinking twice. They’re effective! Just wipe the food off your face and throw them away. But then someone gifted me a set of these hand-stitched, rosy pink linen napkins and, well, I’ve never looked back.Chances are my guests never thought twice about the paper napkins either, but they certainly notice the cloth ones now, which come from Gjusta Goods in Venice, CA. (It’s the shop attached to the all-day cafe Gjusta, where the L.A. vibes are on point.) Their linen napkins are super soft and the perfect size—big enough to handle a messy, saucy meal without being unwieldy—and easy to throw in the hamper when you're done. Best of all, they make my table look thoughtfully put-together, whether I've cooked dinner for six or ordered pizza to go. — Emma Wartzman, editorial assistant.Buy it: Gjusta Goods Linen Napkins, $62.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-20", "author": ["Condé Nast", "Emma Wartzman"]}