{"id": "08d62c357ab3ba115f14884a9f0e19d0", "url": "https://www.bonappetit.com/recipe/detroit-style-pepperoni-pizza", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Detroit-Style Pepperoni Pizza Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDetroit-Style Pepperoni PizzaBy Bryan FordNovember 1, 20203.0(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintSo you want to make pizza, but it’s your first time. This Detroit-style pizza from Bryan Ford, which uses a half-batch of his Master Bread Dough, is perfect for beginners because you don’t have to shape the dough or wrangle a hot pizza stone. If you don’t have a Detroit pizza pan (its deep sides and black anodized aluminum help achieve a crust that’s fluffy on the inside but crisp all around), that’s okay: Use a 13x9\" baking pan or two 8x8\" baking pans.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMetal Baking Pan$22 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonIngredientsMakes 1 large or 2 smallExtra-virgin olive oil (for pan)Bread flour (for surface)½batch (360 g) Master Bread Dough8oz. low-moisture mozzarella or brick cheese¾cup store-bought marinara sauce4oz. pepperoni, sliced½tsp. dried oregano½cup (lightly packed) basil leavesPreparationStep 1To make this recipe, start by preparing a half-batch of the Master Bread Dough.Step 2Lightly brush Detroit-style pizza pan, 13x9\" baking pan, or two 8x8\" pans with extra-virgin olive oil. Lightly flour work surface with bread flour and turn ½ batch (360 g) Master Bread Dough out onto surface. If using a Detroit-style pizza pan or a 13x9\" pan, pull edges of dough into the center, then turn over and hold opposite sides of the dough with your hands so the sides of your pinkies are touching the surface and rotate dough, gently working it into a round as you go. If using two 8x8\" pans, divide dough in half and form using the same method as above. Gently transfer dough to prepared pan. Rub dough with oil and cover with a kitchen towel. Let rise in a warm, draft-free spot until dough expands a bit and is smooth and more pliable, about 1 hour.Step 3Meanwhile, cut 8 oz. low-moisture mozzarella or brick cheese into small cubes. You should have 2 heaping cups.Step 4Place a rack in middle of oven; preheat to 450°. Dimple dough with your fingers, gently pushing out to edges of pan. Scatter cheese evenly over dough all the way to the edges. Spoon ¾ cup store-bought marinara sauce over pizza in three even rows. Next, distribute 4 oz. pepperoni, sliced, evenly over sauce. Sprinkle with ½ tsp. dried oregano.Step 5Bake pizza until crust is deep golden brown, 35–40 minutes. (You can also check doneness with an instant-read thermometer. It should register 190° when inserted into a thick part of the crust.) Remove from oven and top with ½ cup (lightly packed) basil leaves. Let cool in pan 5 minutes before slicing.How would you rate Detroit-Style Pepperoni Pizza?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI haven't actually made this yet but it sounds pretty good.  It sounds very much like directions I have that came with a \"Chicago Style\" pizza pan for a Chicago pizza which also puts the cheese on the bottom.  \nIf not making homemade sauce, our absolute favorite is Rao's Margherita style pizza sauce, and we have tried many.  \nWhat I wonder about though is the length of baking time at 450°.  I bake my pizza at about 500° and it's done in 11-12 minutes.  I'm sort of afraid to cook it for that long but also afraid not to - the dough may be uncooked in the middle.  GG2/12/2021Marinara Sauce\nI find it much easier to make the pizza dough using this wonderful recipe, but I lack of extra spare time to make sauce since I am busy chopping or cutting up other ingredients for toppings, Trader Joes makes a wonderful pizza sauce, not in a can, but in a jar. I purchase it, along with their pesto sauce, both can be used as pizza sauce sub for the \"canned Marinara \nsauce\" in this recipe. Any left over, I place the jar in the freezer and thaw the leftovers for the next pizza.  You will never know the difference once you have the toppings and cheese on this pizza, it's the crust you are eating it for!!!!AnonymousPortland Oregon2/6/2021The reason this recipe has such a low rating is just because of the semantics. This was THE BEST pizza I have ever had or made. I will never order pizza again knowing I can freeze some portions of the master dough and put them in my 8x8 once thawed to rise again. Super customizable too. Having a bunch of extra marinara sauce means you can make some pretty sweet dips too. Don't listen to the <4 star reviews. This is actually a fantastic and easy pizza recipe. StephenToronto1/31/2021Why would this be \"Detroit Style\"? And why would it take 30 minutes for it to cook?\nI cook a pizza @ 500degrees, in 8 min to perfection....\nBTW I grew up in Detroit, and never heard of \"Detroit Style\"AnonymousOrigionally from Detroit12/7/2020I made this a few weeks ago and it was perfect!BBBakerProvo, UT12/4/2020Can you please post a recipe that takes advantage of Bryan's skills and uses sourdough. From a Detroiter, if people want a good, easy recipe that uses homemade sauce, just go get the Zingerman's Bakehouse cook book.SpencerDetroit, MI11/17/2020I just want to say to everyone complaining about the canned marinara sauce and the fact that this is not \"Detroit-Style\" Pizza.  This is called Basically, usually its for recipes with basic ingredients.  For the Detroit Team Members, many times I have been to states that say NY cheesecake or NY bagels etc, never have I gone somewhere and had anything that tasted like NY (whatever its suppose to be).  Lets all learn to be gracious for the recipe.  NY girlVirginia via NY11/12/2020Might be a tasty pizza. But it's not Detroit Style...Anonymousmetro Detroit11/8/2020I stopped reading the recipe when you listed, as an ingredient, jarred marinara sauce. If bon appetit has a recommendation for a “good” jarred sauce, please let your readers know.\nVictorAtlanta Georgia 11/8/2020I agree with the other commenters, not a Detroit style pizza, maybe call it weeknight pizza if you're going to phone it in this hard.CollegecookingDetroit 11/8/2020This is fine but it's not really Detroit style. Making it in the pan doesn't make magically transform it. Detroit style is best because the dough is fluffy and light. It rises undisturbed and the sauce goes on after it is done baking. AnonymousDetroit11/3/2020@Anonymous in Las Vegas You could just use the internet to find a homemade marinara sauce recipe? Seems simple enough!Anonymous11/2/2020I never made this recipe and I probably never will. Why would I go to the trouble of making pizza dough, even if I e made it in advance, and then use canned marinara sauce?AnonymousLas Vegas11/2/2020Explore Bon AppétitPizzaAmericanMozzarellaCheeseYeastOther IngredientsBread FlourFlourEasyMainNut-FreeSuper BowlFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-01", "author": ["Condé Nast", "Bryan Ford"]}