{"id": "08d6e2e13dfcd96397758992e6fc4cfc", "url": "https://www.bonappetit.com/story/jackrabbit-filly-lunar-new-year", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "At Charleston’s Jackrabbit Filly, Here's How to Eat Your Weight in Luck | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAt Charleston’s Jackrabbit Filly, Here’s How to Eat Your Weight in LuckChef Shuai Wang ushers in the Year of the Ox with a very lucky Lunar New Year feast.By Jenny LiaoJanuary 13, 2021FacebookTwitterEmailPhoto by Tim RobisonFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.As a third-culture kid, I felt an instant connection to Jackrabbit Filly, a new Chinese American restaurant in Charleston helmed by owners Shuai and Corrie Wang. Here Lunar New Year is celebrated with a special menu that pays homage to family celebrations full of food, fireworks, and mahjong. Traditionally, Lunar New Year meals involve several dishes that are meant to bring luck, happiness, and prosperity in the upcoming year. For chef Shuai Wang, that means a lineup of childhood classics that are inspired by his mother and grandmother. Here’s a breakdown of the significance behind each dish on the menu.Photo by Tim RobisonThe NoodlesDuring Lunar New Year, long noodles represent longevity and happiness. Wang stir-fries his lo mein with beech, oyster, and shiitake mushrooms grown by local farmers, topping them with a generous dollop of butter and crispy garlic aonori—an unseasoned seaweed powder that gives the noodles a deep green-tea flavor. “Never bite down on the noodle,” Wang instructs. Eating each strand in one slurp without breaking it is believed to maximize your good fortune.Photo by Tim RobisonThe Pork Trotters“Trotters are about wealth,” Wang says. “My mom always told me they’re meant as another foot or hand to grab more money for next year.” Traditionally, for Lunar New Year pork trotters are served whole, but the chef ’s reimagined version involves braising, shredding, and shaping them into cakes that get breaded with panko and fried to form a crispy katsu.Photo by Tim RobisonThe DumplingsDumplings also symbolize wealth due to their likeness to yuanbao, an ancient form of Chinese currency. Wang fills his with Napa cabbage and rich Mangalitsa pork (sustainably sourced from Holy City Hogs on nearby Wadmalaw Island) seasoned with Chinese cooking wine and soy sauce. Once boiled they’re garnished with vinegar, chili oil, cilantro, and peanuts.Photo by Tim RobisonThe FishFor continuous prosperity in the new year, Wang says you have to serve a whole fish: head-on, bone-in. Here he opts for flounder caught off the coast of Mount Pleasant, South Carolina, by local fishery Abundant Seafood. Steaming brings out the fish’s natural sweetness, so seasoning is kept light: Chinese cooking wine with a bit of soy sauce and fermented black beans. Raw julienned leeks and ginger finish off the dish, with a ginger-scallion chimichurri on the side.Explore Bon AppétitDish DecodedPhiladelphiaChineseLunar New YearRead MorerestaurantsHow Do I Love Thee, Chinese Sponge Cake? Let Me Count the LayersBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-13", "author": ["Condé Nast", "Jenny Liao"]}