{"id": "08d70338fd7a29690d20c27808426cad", "url": "https://www.bonappetit.com/recipe/chicken-and-rice-soup-with-garlicky-chile-oil", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Chicken and Rice Soup with Garlicky Chile Oil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken and Rice Soup with Garlicky Chile OilBy Kat BoytsovaFebruary 17, 20194.7(312)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Rhoda BooneEmailPinterestPrintEmailPinterestPrintThis comforting chicken soup tastes like it took hours to make but comes together in a flash. Simmering a handful of uncooked rice directly into soup is a great trick for giving a quick, broth-y number like this one lip-smacking body and richness; as the rice cooks, it releases starches that thicken the cooking liquid. And a finishing drizzle of spicy oil and crunchy fried garlic chips takes the whole thing to the next level. About that garlicky chile oil: Go ahead and double it, because you're going to want to put it on everything this week. You'll thank us later.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASieve$18 At AmazonLarge Saucepan$60 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketForkIngredients4 servings1small onion6garlic cloves⅔cup white rice, preferably short grain¼cup plus 2 Tbsp. vegetable oil2tsp. crushed red pepper flakes1lb. skinless, boneless chicken thighs2½tsp. kosher salt, divided1large bunch Tuscan kale1lemon3sprigs dillFreshly ground black pepperPreparationStep 1Get some prep out of the way. Peel and finely chop 1 small onion. Peel and thinly slice 6 garlic cloves. Rinse ⅔ cup white rice in a fine-mesh sieve until water runs clear.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Time to make the garlic-chile oil! (Doubling or tripling it wouldn't be a bad idea, just saying.) Heat ¼ cup plus 2 Tbsp. vegetable oil in a large saucepan over medium. Add garlic and cook, swirling pan often, until golden brown, 3–5 minutes; the garlic will continue to cook and darken slightly after it's off the heat, so be conservative here. Transfer to a small heatproof bowl, leaving 1 Tbsp. garlic oil in pot. Stir 2 tsp. crushed red pepper flakes into garlic oil in bowl; set aside.Step 3Add the onion to the 1 Tbsp. of garlic oil that remains in the in saucepan and cook over medium heat, stirring occasionally, until onion is translucent and beginning to take on some color, about 5 minutes.Step 4Pour in 8 cups water and stir to combine. Stir in rice, 1 lb. skinless, boneless chicken thighs, and 1 tsp salt. Bring to a boil, then reduce heat to low and bring to a gentle simmer. Simmer, uncovered, until chicken is cooked through, about 20 minutes.Step 5Using tongs, transfer chicken to a plate and let sit until cool enough to handle. Shred meat with two forks. Continue to simmer soup while you’re prepping the rest of your ingredients (this will concentrate the flavor of the broth).Step 6Strip kale leaves off of thick center ribs from 1 bunch Tuscan kale, discarding ribs. Rinse kale thoroughly in cold water, shake off excess water, then thinly slice leaves crosswise.Step 7Add kale and shredded chicken to pot. Continue to simmer, stirring occasionally, until kale is bright green and chicken is warmed through, about 4 minutes.Step 8Remove pot from heat. Squeeze in lemon juice (being careful not to let any seeds fall in), season with 2 tsp. salt (or more to taste), and stir to combine.Step 9Divide soup among bowls. Drizzle with reserved garlic-chile oil. Tear 3 sprigs dill over, then top with a few grinds of black pepper.How would you rate Chicken and Rice Soup with Garlicky Chile Oil?Leave a ReviewTell us what you thinkReviews (178)Back to TopTriangleInstead of salt at the end I thought the soup needed a more chickeny flavor so I used Better than Bouillon. Otherwise it was good.Jill RSacramento, CA3/12/2022I was skeptical that this soup would be tasty given there are so few ingredients but I was so wrong!!! Came together quickly and with minimal mess, can’t wait to make again. AnonymousToronto2/28/2022This is Arroz Caldo. The Filipino dish. AnonymousChicago2/15/2022So comforting and so simple! Had to use chicken breast so the cooking time was reduced. Also used basmati, lemon zest, and thyme. The flavors work so well together and the garlic oil is amazing. Will definitely be making this recipe again. noor New York2/10/2022This soup is insanely yummy. Will make this over and over again.AnonymousSwitzerland2/6/2022Made this by the recipe, except I had \"organic wild rice blend\" from whole foods on hand, so used 2/3 cup of that instead. We generally avoid white rice. It was delicious, though I think a bit less cloudy than white would have been. I thought the fresh dill flavor really stood out with the lemon - this was an interesting combination of flavors overall. James RicheOrlando, FL2/2/2022Delicious!  Doesn't come together as \"quickly\" as I hoped from reading the directions (peeling and slicing all that garlic took me a bit, as did chicken shredding) but it was my first time of what will I'm sure be many.  I'm sure I'll get faster! AndreaOakland CA2/2/2022This was exactly what we needed after a week away and two days of traveling. My husband actually made his own chili oil so I used some of that to cook the garlic then the onions. Our store didn’t have the right kale so I used collard greens, which was an excellent substitute. Salted and peppered the chicken for a few minutes before adding to the soup on top of the 1 tsp of salt it called for. Everything was delicious. We added healthy doses of the oil and it just perfectly elevated the dish. Keeping this recipe for sure.BriOhio2/1/2022Julia Child has a chicken soup recipe that starts with sweating onions, adding a little rice and broth for about 20 minutes. Once it’s very soft, she uses an immersion blender to pulverize the rice, thickening the soup base and eliminating the mushy rice issue. The rest of the recipe includes, leeks, carrots, celery, aromatics and chicken breast poached on top of the brew, then slicing it into bite sized pieces. It’s healing.Leslie B.The Heartland1/30/2022I used a rotisserie chicken to make this soup, removed the meat and put aside while making stock from the bones (covered w water, added peppercorns & bay leaf).  Strained the stock once done then added in the garlic, onions & rice.  Returned chicken when the rice was almost ready and finished w lemon, parsley and chili oil!  Delish!!Tricia NYCNew York, NY1/30/2022This is a great soup but I added baby spinach and used left over cooked rice. Since I didn’t have dill I added a dill pickle finely diced after switching off the heat. This is something I tasted in a Belarusian soup and it was delicious. Little bursts of sourness with dill flavor!! Karen San Jose 1/30/2022Soup should not be thick. This soup has too much rice, it shouldn't be put in right at the start, but much later so it cooks and thickens the broth some, but not that much. Mushy rice isn't appetizing to me. I make soups several times a week, and make chicken rice soup monthly, but it doesn't look like this. Digna Irizarry CassensYucca Valley, CA1/30/2022Delicious!! And easy!Studmuffin Oklahoma City 1/25/2022THIS RECIPE IS THE BEST. I keep coming back to it time and time again. Always use chicken broth instead of water for more flavor. \n\nThis most recent time I wanted to make it I didn’t have every single ingredient, but this proved to be a very good shell of a recipe to take your own twists on as well. I had chicken breasts instead of thighs so I just cooked the chicken for a shorter time. Didn’t have rice so I used couscous - just followed cooking time on the couscous box and it was perfect. Lastly, didn’t have dill, which is an amazing addition to this, but can confirm the garlic chili oil is enough taste for you to skip the dill if you are in a pinch! Anonymous1/20/2022SO good. My chicken was done in about 10 and I had the heat a little above a simmer. I used 4c of chicken stock and 4c of water. Loaded it up with chili crisp too. My short grain white rice did no overcook. 11/10GraceTruckee, CA1/10/2022Explore Bon AppétitSoupSoups and StewsChickenPoultryKaleLeafy GreensVegetableGarlicChileQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-17", "author": ["Condé Nast", "Kat Boytsova"]}