{"id": "08d75b77b95117214573dd0eb5bb4c09", "url": "https://www.bonappetit.com/story/party-bikes", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Are You Even Having a Good Time If It’s Not on a Party Bike? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAre You Even Having a Good Time If It’s Not on a Party Bike?You’ve definitely witnessed them, these pedaled bars on wheels. But where did they come from?By Priya KrishnaAugust 8, 2019FacebookTwitterEmailIllustration by Nadine RedlichFacebookTwitterEmailChances are you’ve seen one. They look like old-timey trolleys, or those tour shuttles at Universal Studios—but with a long bar setup in the middle and bicycle seats surrounding it. They occupy quite a bit of road space, more often than not carrying noisy bachelorette parties who pedal lazily and drink furiously, with “Die Young” by Ke$ha or “Despacito” by Luis Fonsi (the Justin Bieber remix, of course) playing on full blast.They’re called party bikes, and they’ve been around since the ’90s. But lately I’ve been seeing them everywhere. It’s pretty much impossible to go to a city like Nashville or Raleigh without spotting at least one. They’re the biggest thing to hit group gatherings since the Escape Room.The gist of the party bike is this: two-hour tours, 15 of your closest friends, BYO beer and wine (no hard liquor; Solo cups are usually provided), plus stops at multiple bars along the way. It’s everything someone might want in a group activity: reasonable price tag ($20-$50 bucks a person), casual drinking, sightseeing without the talky tour guide, and mild, very doable exercise.Whatever you think of party bikes—a fun outing or traveling noise pollution machines—they are here to stay. And we have Zwier van Laar to thank (or curse).He claims to have invented the contraption in 1996 in the Netherlands for the parade held every year on King’s Day (also known as Queen’s Day). An Amsterdam pub owner he knew asked him and his brother, a welder, to build a pub on wheels that could be part of the festivities. After its debut, Van Laar was inundated with requests from people to rent it out. He ended up building upward of 350 bikes, which he now ships all over the world. People have gotten married on his bikes, he says. One time a prince in the United Arab Emirates bought one from him, just FYI. The majority of the bikes you see in America, he says, are manufactured by his company, Het Fietscafe.Here in the U.S. the trend started picking up steam in the 2010s, after videos of Van Laar’s bikes hit YouTube. They featured men in rainbow wigs shouting inaudibles as they passed through an otherwise quiet block, and drunk Santas throwing candy into the street as they pedaled.“I thought it was the coolest thing in the world,” Robert Mayer says of a video he saw in 2011. He spent months designing a party bike that had custom-built upgraded features: an electric motor system (so the vehicle didn’t have to rely on pedal power), turn signals (because traffic rules), and flashing LED lights (for fun!). Later that year, Mayer started Trolley Pub along with Kai Kaapro and Andrew Cole, and then launched Pedal Crawler, which sells custom bicycles to party bike tour companies across the country, in 2013. (Kaapro and Cole now own Trolley Pub.)Mayer’s bikes have squishy bike seats, beer holders, and a roof that looks like a large surfboard. Other party bikes have more idiosyncratic features, like a large nonfunctional barrel at the front, or roofs lined with straw. The various bike companies have names like Sprocket Rocket, Sprock n’ Roll, Pedal Saloon, or Cowtown Cycle Party (in Fort Worth, Texas, naturally).But the industry did not take off immediately in the U.S. While many city liquor laws have open-container exemptions for vehicles for hire (e.g. limos, buses), that didn’t explicitly include party bikes. The laws have changed to include these bars on wheels only when people—including Kai Kaapro of Trolley Pub, which now operates in six cities—have lobbied for them. (Though Kaapro was successful in Durham, North Carolina, and Wilmington, Delaware, he’s failed in places like New Orleans, Charleston, and Chicago.)And as the laws changed, party bikes proliferated in urban centers (they are already permitted in about 70 cities), and interest in the activity skyrocketed. Young professionals and middle-aged adults were all too eager to (literally) hop aboard the trend, whether it was a work celebration, a birthday party, or a festive Tuesday afternoon.Mayer sees it as an exhibitionist experience, which is particularly powerful in the Instagram era. Nobody can see your sparkly bachelorette tiara in a party bus with darkened windows, but on a party bike, “everyone can see you singing and dancing. People like to be seen having fun.”And while the overhead cost is high—bikes can cost as much as $60,000, and Mayer says his insurance per bike per month is several hundred dollars—both Mayer and Kaapro say their businesses are profitable. As long as it’s not raining (and in some cases, even if it is), people can’t wait to celebrate their impending nuptials by drinking lukewarm Bud Light while pedaling past an Olive Garden.To make a little extra money to supplement his day job running a hydroponic farming company, my buddy Mitch Hagney started driving a party bike in San Antonio. He told me that most people average six drinks in two hours since they’re drinking on both the bike and the bars where they stop along the way. “The result is madness,” he said. He drove around a group of correctional officers celebrating one of their own having just beat cancer: “They listened to a lot of Drake. They danced a great deal, but very badly, and they drank like fish. But it’s the best I’ve ever been tipped as a driver.”And even though most party bikes only travel slooowly, around three to five miles an hour, accidents happen. In 2015 a Minneapolis party bike was struck by another vehicle and tipped over, trapping passengers underneath. Last year in Memphis a trolley slammed into a party bike, injuring the driver. Hagney told me that he has gotten stranded several times because party guests got too drunk and stopped pedaling, and the bike’s battery died.Those accidents, and the public displays of tipsy commotion, have invited plenty of complaints across the internet. “I sympathize and understand the criticism of our business,” Kaapro says. “But we are not the only one making noise in these cities. We are just the ones drawing the most attention.”Meanwhile, he’s already onto the next generation of the party bike: the pedal party boat, essentially the exact same set up built atop a pontoon. Just when you thought the trend was “everywhere” enough already—think again.Explore Bon AppétitTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-08", "author": ["Condé Nast", "Priya Krishna"]}