{"id": "08e2fa4615e3e12b16fc8ea386f09277", "url": "https://www.bonappetit.com/recipe/ginger-almond-florentines", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Ginger-Almond Florentines Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueGinger-Almond FlorentinesBy Nadiya HussainNovember 23, 20214.0(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintThe Great British Bake Off winner and Netflix star Nadiya Hussein describes these crunchy ginger-almond florentines as “brandy snap meets cookie meets toffee” in her book Nadiya Bakes, a cookbook companion to her Netflix series of the same name. Based on a simple batter full of almonds and crystallized ginger, these cookies bake into lacy rounds and are dipped in swirls of white and dark chocolate. For the most even spread, don’t forget to press down on the cookies before baking.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall #70 Cookie Scoop$15 At AmazonSilicone Spatula$13 At BA MarketWire Cooling Rack$17 At Bon Appétit MarketSmall Saucepan$155 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes about 164Tbsp. unsalted butter, room temperature¼cup (packed; 50 g) light brown sugar2Tbsp. light corn syrup½cup (75 g) crystallized ginger slices, finely chopped½cup (50 g) sliced almonds⅓cup (45 g) all-purpose flour2tsp. finely grated orange zest1tsp. Diamond Crystal or ½ tsp. Morton kosher salt6oz. bittersweet chocolate (preferably 65%–75%), chopped2oz. high-quality white chocolate, choppedPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Heat butter, brown sugar, and corn syrup in a small saucepan over medium, stirring often with a heatproof spatula, until butter is melted and brown sugar is dissolved, about 2 minutes. Remove from heat and stir in ginger, almonds, flour, orange zest, and salt.Step 2Using a #60 or #70 cookie scoop (about 1 Tbsp.), portion out batter on 2 parchment-lined baking sheets, spacing at least 3\" apart (8 cookies per sheet). With dampened fingers, press each cookie into a 2\" disk.Step 3Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until golden brown, 10–12 minutes. Using the rim of an inverted glass, nudge edges of cookies into neat circles and separate any if needed. Transfer cookies, still on parchment, to wire racks and let cool.Step 4Melt bittersweet chocolate in a small heatproof bowl set over a small saucepan of barely simmering water (do not let bowl touch water), stirring occasionally, until glossy and smooth. (Alternatively, melt in a microwave-safe bowl in the microwave in 20-second increments, stirring after each, about 1 minute total.) Repeat process with white chocolate.Step 5Drizzle about one third of white chocolate over bittersweet chocolate and mix together with a skewer or chopstick to create large swirls (don’t overmix or swirls will disappear). Working one at a time, dip one third of each cookie into swirled chocolate, then transfer to a parchment-lined baking sheet. As you work, swirl in more white chocolate as needed to maintain a distinct pattern. Let cookies sit until chocolate is set, 30–45 minutes.Do ahead: Cookies can be made 2 days ahead. Stack in an airtight container, separating layers with parchment paper, and chill.Recipe Excerpted From ‘Nadiya Bakes’, by Nadiya Hussain (Clarkson Potter). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Ginger-Almond Florentines?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThese are delicious - crispy and chewy like a good brandy snap, but more flavoursome from the orange and ginger with added crunch from the flaked almonds.  So good! I followed the recipe carefully - allowed lots of room for spreading - and had no issues.  8 mins on the dot was perfect.  Like any brandy snap they take a while to set.  Huge hit in my house and perfect for Christmas.MelHSydney, Australia12/22/2021I really like these cookies. They are crispy and light, and the balance of ginger, orange zest, and almonds is great. I also used a smaller scoop (a tsp) and came away with more cookies than when I tried the tbls previously. But the real key to making these cookies is to keep an eye on them in the oven. As the recipe notes, you need to \"nudge\" the cookies away from each other to keep their shape. This is just a bit more labor-intensive than your average cookie. I used a water glass. I noticed right around the 5-minute mark is when they start to stretch, so shape them up when you switch the shelves, and then maybe one or two more times before they're done cooking. In my experience, they needed a few minutes longer than the recipe said to reach a golden brown. All that said, I'm excited to give some away as Christmas cookies to friends and family!AnonymousMA12/22/2021My cookie scoop broke so I used a tablespoon. Seemed like a lot, so dropped by tsp instead.  Even spaced so just 12 on a standard size cookie sheet, they melted into one giant mass. Tried to separate when done but it was still a mess — more like giant cookie chips than shaped cookies. Next batch made them even smaller but same result.  And they came out kind of greasy.  Needed to bake them 15 minutes to get them goldenbrown — 1st batch was paler and seemed even greasier. Didn’t bother w chocolate dip — would be embarrassed to put these on a cookie plate. Won’t make again.  JbBrooklyn ny12/17/2021Explore Bon AppétitGingerHerbs & SpicesAlmondNutDark ChocolateWhite ChocolateDessertCookieBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Nadiya Hussain"]}