{"id": "08e555035bf2bda9e84ccda5c4dfbe19", "url": "https://www.bonappetit.com/story/sharona-franklin", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Sharona Franklin Is Making Psychedelic Jelly Worlds to Explore Disability | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Artist Is Making Psychedelic Jelly Worlds to Explore Disability We talked with Sharona Franklin about wellness culture, tree sap, and the power of domestic practices for the chronically ill.By Adrienne MateiOctober 21, 2019FacebookTwitterEmailPhoto by Rhonisha FranklinFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is artist Sharona Franklin, who uses gelatin to create otherworldy botanical sculptures.Growing up at the edge of the British Columbian wilderness gave 32-year-old artist Sharona Franklin an elemental connection to nature. “I would just wander in the woods all the time and pick up plants like wild asparagus and burdock,” she says. “We’d hunt rabbits, catch crawfish, collect freshwater clams, go fishing…”In her teens, Franklin, who lives with over 20 rare complex systemic diseases, moved alone to Vancouver for medical care, and has since been developing an artistic practice integrating her love for nature with her experience of chronic disability. Among her current projects is @Paid.Technologies, an Instagram account where she posts images of her entrancing gelatin sculptures—slick, semi-translucent works of varying edibility that can take days to create and begin to degrade the moment they’re complete.“When I started making art I wanted to show the more human aspects of living, and less this facade of design or aesthetics,” Franklin says of her work. “I really wanted to start talking about disability, biotechnology, pharmaceuticals—a lot of my gelatin work is a shrine to cellular use of animals.”Instagram contentThis content can also be viewed on the site it originates from.Filled with prickly thistle, chrysanthemum, or hovering masses of champagne grapes, Franklin’s psychedelic jelly worlds may seem thoroughly botanical. Yet by using animal-derived gelatin as her medium she protests one-size-fits-all wellness culture and references her own dependence on transgenic and stem cell-derived medication. “I’ve been met with a lot of pushback on gelatin, especially from vegan friends,” she says, but “everyone has different needs.”In addition to exhibiting her work at galleries including Vancouver’s 221A and Unit 17, Franklin writes about bioethics (her latest zine project, titled Mechanisms of Action, Injustice In Biopharm, was released by Cassandra Press at MoMa PS1’s bookstore this fall) and runs Instagram accounts dedicated to disability awareness and fostering personal connections among the differently-abled.“I feel empowered when I see other people sharing their experiences, and when people tell me my art or my experiences have helped them,” says Franklin. “I want to expand people’s ideas of what disabilities entail, and I want to [encourage] a generative and collective community.”Instagram contentThis content can also be viewed on the site it originates from.We talked to Franklin about the limitations of wellness culture, the sticky ingredient she’s most excited to work with, and the power of domestic practices for the chronically ill.The era with the aesthetics I appreciate the most is… the seventies. And then I love the seventies revival in the nineties, because I grew up during that time and my older sisters were anarchist hippie punks and we would stitch smiley face patches on our jeans. I think I am drawn to the vocalness of that time.I love working with gelatin because… it’s a medium I haven’t seen experimented with enough, and it offers a lot of flexibility for three-dimensional sculpture and two-dimensional painting that doesn’t damage the immediate environment.  Gelatin is biodegradable and it does not emit VOCs (volatile organic compounds) or asthmatic toxic chemicals, plus it doesn't end up in landfills or waterways and harm wildlife.My dream gelatin is… definitely interdimensional. I want it to be very large with a lot of different pockets and openings. And I want to make an extremely complex paper maché candelabrum to be inside of it.It is important to make art from my home...  because on top of the ill being stigmatized as \"un-useful in the home,\" we are often trapped there, seemingly further from a sense of professional accomplishment. So many people think, \"oh you’re disabled you can’t make things,\" or \"you can’t produce,\" so it’s kind of subverting that within disability. The fridge where my injections are kept is the same fridge where the jellies are kept.Right now I’m learning about… perfumes. I really like essential oils so I’ve been using lots of  frankincense, vetiver and clary sage lately. I got this Thierry Mugler perfume, its name in English translates to ‘furious fern,’ and it’s kind of spicy and floral and powdery, but woodsy. It’s my first perfume.I’ve been listening to… binaural beats a lot. They’re just really soothing.I find it helps with pain —it’s not a treatment or anything, but I find it just helps me focus and calm down my thoughts.I’ve been watching… this show on Netflix called Girls Incarcerated. I think underage incarceration is an under-discussed issue.When it comes to strategies for coping with illnesses… I think community is the number one thing—realizing you’re not alone even if you feel isolated. I talk a lot with people online and we check in on each other if we know we have tests or we start a new medication or we have new symptoms.Watching wellness culture become a status signifier…   has been very difficult for me. People with disabilities can get silenced [by the wellness complex]. People think, \"oh meditate and you’ll be fine, do yoga and you’ll be fine,\" when really those are just skills that make the pain easier to manage. They don’t make your disease go away, not in my experience anyway.If I could give my young self one piece of advice… it would definitely be to believe in myself. Don’t second-guess and doubt things, but continue to be open and find the right places and people that want to have the same conversations that I did.My skincare regime involves… a lot of snail gel! The CosRx 96% snail mucin is so soothing. I have redness, inflammation, so I use that. I really like yogurt masks with licorice root powder. I put rosemary oil or tea tree oil in my shampoo. I take a lot of baths with magnesium salts. And facial massage! I find that is really good for headaches and tension; it’s surprising how much tension you hold in your face.The seasonal botanical I’ve been really excited about is… sap.  Pine, birch and balsam sap are anti-inflammatory, anti-fungal, and anti-bacterial, so I use them in a soothing topical balm I make. You can eat them, too. I’ve been really wanting to make birch sap cookies and a gelatin. Sometimes I make jelly gummies with vitamin D, so I might make something like that.I want … a garden, very bad. I’ve been wanting to grow edible flowers and hyssop for a really long time, because you can’t really buy it for some reason. You can use hyssop  in tea but it’s really good in jelly because it has a sweetness to it.I always crave … chocolate! I really like the Endangered Species chocolate. They donate to the Amazon Rainforest, and they have eco-friendly packaging and are fair trade. It’s kind of a treat but they have a chocolate-mint one that I really like.Some artists whose work I admire… are Martine Symes and Kandis Williams.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestylePoet and Novelist Elizabeth Acevedo Fights Writer's Block With CurryBy Leigh-Ann JacksonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-21", "author": ["Condé Nast", "Adrienne Matei"]}