{"id": "08e87a980d101bbf9e973634346fe984", "url": "https://www.bonappetit.com/story/cynthia-nixon-bagel-order-review", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "We Tried Cynthia Nixon’s Controversial Bagel Order and Here’s the Professional Review | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Tried Cynthia Nixon’s Controversial Bagel Order and Here’s the Professional ReviewLox, cream cheese, tomatoes, red onion, and capers, on a ....cinnamon raisin bagel?By The Bon Appétit StaffSeptember 11, 2018FacebookTwitterEmailPhoto by Emily SchultzFacebookTwitterEmailYesterday Gothamist reported New York gubernatorial candidate Cynthia Nixon’s bagel order at the Upper West Side establishment Zabar’s. She requested plain cream cheese, lox, tomatoes, red onion, and capers on a CINNAMON RAISIN BAGEL. In her words: “a full load.”New Yorkers, raging Internet commenters, and most of the BA staff reacted in horror. “Oh no. It’s like her version of the Howard Dean scream,” said Basically editor Amiel Stanek, going on to add, “Do you think Cuomo orchestrated the whole thing?” “This is honestly illegal,” said associate social media manager Emily Schultz, “I’m calling the police.” Senior social media manager Rachel Karten kept it short and sweet: “I am nauseous.” Nixon defended her bagel choice, telling reporter Jimmy Vielkind, “Don’t knock it ‘til you try it.” So we did.“If the first time I had a cream cheese and lox bagel it was served like this, I wouldn't question it. But growing up eating other bagel combinations, yeah, it’s a little weird.” —Alex Delany, associate editor“I wouldn't ORDER it, but if it showed up on my desk, for free, like it did today, I’d eat the whole thing. It’s not bad, people. The smoky lox overshadows the sweetness of the bagel—sort of like this news overshadows the larger issues at stake—only a little cinnamon comes through. Politics are weird.” —Alex Beggs, senior editor“This is the only way you will ever convince me to eat a cinnamon raisin bagel without gagging.” —Christina Chaey, associate editor“The warm spices of the cinnamon raisin WITH the onions and capers is very strange. It’s like if a toddler decided to make me a bagel sandwich. But it was not disgusting, defying my expectations.”  —Elyse Inamine, digital restaurant editorWe got ours from the Tribeca bagel shop, Zucker’s.\nPhoto by Emily Schultz“I think it’s about time we let go of our cinnamon raisin bagel baggage. There’s nothing wrong with the bagel itself, people just use it to do questionable things. This bagel order is certainly that: questionable, but not an atrocity.” —Jesse Sparks, editorial assistant“A cinnamon raisin bagel with cream cheese and lox (excluding capers, onions, and tomatoes) is my go-to bagel order. It has the delightful combination of sweet and salty that I crave on a weekend morning, especially after I’ve gone on a long run and my body is craving salt (lox), carbs (bagel), and a little something sweet (raisin).”—Elaheh Nozari, e-commerce editor“I was really hungry. It tasted fine? Better than I thought it would, but I thought it would taste really bad, so that’s not saying too much. I spent the whole time wishing the raisins weren’t there.” —Emma Wartzman, editorial assistant“It grows on you. If someone accidentally gave this to me instead of my typical everything with smoked salmon, I wouldn’t throw it away, but I also wouldn’t be happy.”—Alyse Whitney, associate editor“Would it be fair to call it a progressive bagel for a progressive candidate? It’s still a bagel so it’s not terrible, but it’s a bad bagel. I won’t order it again.”—Aliza Abarbanel, editorial assistant, Healthyish“I did not understand why everyone was so upset about this because I knew it would be good before I even tried it, and I was correct. It brings me the same sweet-savory joy as a chocolate-covered pretzel but with the added depth of fishiness + creaminess + cinnamony-ness. Live your dreams, Cynthia. Break us free from the chains of tradition.” —Hilary Cadigan, associate editorIf you live in New York, don’t forget to vote on Thursday, September 13. Then go get a bagel.Explore Bon AppétitTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "The Bon Appétit Staff"]}