{"id": "08eb460916d72056829216fe4e30f3cc", "url": "https://www.bonappetit.com/story/what-is-aioli", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "OK, What Is Aioli, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOK, What Is Aioli, Anyway?Is aioli...mayo? Or is it something else entirely? What the heck's the deal?By Alex DelanyMarch 22, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailYou’ve walked into a restaurant, looked at a menu, and thought, \"Oh, nice: aioli!\" You know it's going to be creamy, and rich, and delicious, and you're probably going to order whatever it comes with. But what is aioli? Isn't it just...mayo? But fancier? It sounds more regal (or at least more French or something), and there always seems to be something cool happening in terms of added flavor. Approximate knowledge isn’t good enough though. We need to really know what the deal is. Your aioli education starts now.OK, here's the big thing that mayo and aioli have in common: They're both emulsions. But...what’s an emulsion? The process of emulsification happens when two substances that don’t want to mix are forced to mix. In cooking, this usually refers to oil being mixed into something water-based. See, oil doesn’t disperse into water-based sauces or solutions (think of oil floating on top of water), so it needs to be broken up into a bunch of little droplets to be spread evenly throughout the mixture. In the case of mayo, oil is emulsified into a mixture of lemon juice or vinegar, mustard, egg yolk, and salt by whisking it in gradually—drop-by-drop at the very beginning—and vigorously. The droplets never truly become one with the mixture, but they become tiny and evenly suspended in the water, creating a creamy, almost fluffy texture.Aioli + Sando = Excellence\nMichael Graydon + Nikole HerriottIn some Mediterranean cultures, aioli refers very specifically to a sauce made from olive oil that has been emulsified into mashed garlic, usually with a mortar and pestle—and that's it. (Well, salt too, natch.) No egg yolk, no acid, just a shit-ton of garlic mashed up with oil to form a fluffy, vampire-repelling emulsion. It's not that often that you see this hyper-traditional version in restaurants these days, partially because it's labor intensive and breaks easily. (A \"broken\" emulsion is one in which the droplets of oil have fallen out of suspension, leaving you with a greasy, separated sauce.)But, as they do, things change. Nowadays, the word aioli is pretty much synonymous with mayo, and is often just a simple mayonnaise (store-bought or homemade) that is flavored generously with garlic—a nod to its origins. But you'll also see it used to refer to any variety of elaborately-seasoned mayo, whether it's one kicked up with sambal, dried chiles, ginger, paprika, black garlic, roasted shallots, or fish sauce. It kind of ends up being a catchall term that means, \"mayo, plus something else.\" Which we can't really get mad about, because it tastes good as hell. It brings a deeper appeal to just about any bread you could spread it on, French fry you could dip it into, or veggie you could drizzle it all over.So, yeah. Aioli can be a few different things. It can be mayo. It can be traditional. It can be experimental. It can be made with olive oil. It can be made with garlic. But if there’s one thing aioli should always be, it’s that it should be spread with a heavy, loving hand. Because aioli is a true light in this dark world we live in.Stir some paprika into Hellmann's and call it aioli—we're not gonna stop you.Jammy Eggs with Paprika AioliLike deviled eggs—but faster, easier, more delicious, and fancier-sounding.View RecipeExplore Bon AppétitBasicallyMayonnaiseAioliRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-22", "author": ["Condé Nast", "Alex Delany"]}