{"id": "08f459486b380299018ab10d65a68705", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/mesa-b", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Mesa B Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityMesa BExpect the unexpected (and lots of natural wine!) at chef Jair Téllez’s monthly dinner seriesFacebookPinterestTwitterEmailPhoto by Matt Taylor-GrossGO: for Tijuana-born chef and winemaker Jair Téllez’s intimate “fine dining hack” known as Mesa B, a supper club that’s actually cool and features innovative dishes cooked right in front of you alongside natural wine pairings.ORDER THE: ...oh, no, no. Ordering is not an option here, so toss any notions of control aside. At Mesa B, every dish and wine is a surprise right up to the moment it’s presented to you—the “menu” for the night is nothing but a photocopied sheet of chicken scratch chef’s notes (example menu item: “carne”). As Téllez stands in the wide open kitchen behind you, flipping a sizzling skillet with a crazed, mad-scientist look in his eyes, all you can really expect is the unexpected. Well, that and a glass or two of the funky stuff from Téllez’s own highly acclaimed natural wine label, Bichi.THE VIBE IS: intimate, candlelit, underground supper club. Dinners are housed in a small concrete room attached to the wine storage facility for Téllez’s restaurant Amaya, decorated with a large pastel painting, some wood furniture, and a few potted palms. Being there feels like you’re in on a secret, or initiated into the coolest of cool kid clubs.PRACTICAL STUFF: The dinners occur monthly; email mesabmex@gmail.com to reserve your spot at the next one.—Hilary CadiganWE ALSO LOVEAmayaStar chef Jaír Telléz’s most recent opening, boasting the country’s first all-natural wine listContramarGrilled fish, palomas, and good vibes for any occasionCicatrizBig salads (and a killer fried chicken sandwich) in a city where such things aren’t easy to findExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Hilary Cadigan"]}