{"id": "08f518d0f414f378f152aa4dcd4016aa", "url": "https://www.bonappetit.com/story/moment-of-joy", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Moment of Joy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMoment of JoyWe asked Bon Appetit staffers and Feel Good Food Plan contributors about their biggest winter comforts.By The Healthyish TeamJanuary 2, 2018FacebookTwitterEmailFacebookTwitterEmailI take off all my sweaty clothes, blast jazz music, and interpretive dance around my apartment in the most expansive way that I can. – Sara Elise, co-founder of Blind SeedMy plants’ fresh green life and different personalities bring me daily happiness and inspiration to keep on growing. – Rachelle Robinett, holistic health practitionerThe Poets Laureate Anthology will make you slow down and be grateful that it's too cold outside to go anywhere or see anyone.  – Mackenzie Wagoner, writerI perform a Feldenkrais body scan—by simply paying attention to every part of my body that bears weight, I release the hardships of my day. – Meredith Talusan, editor of themScented candles like “Baies” and “Peyote Poem” are the key to mastering the fine art of hibernation. – Carey Polis, Bon Appetit digital directorI am generally of the belief that a meal should have a vegetable, but there is nothing more comforting than plain buttered noodles.—Rachel Sugar, writerNothing besides watching my five-month-old baby sleep brings me more joy these days than finding a jar of homemade ginger lemon syrup in my fridge. – Julia Kramer, Bon Appetit senior editorI arrange my entire crystal collection in a circle by chakra/color on the duvet, from selenite to kunzite to smoky quartz. – Faye Chiu, senior business managerTwinkly lights may be hygge-lite, but they’re cheerful and definitely less of a fire hazard than a million scattered candles. – Aliza Abarbanel, Healthyish editorial assistantI'm typically cold from October through May, so nothing brings me more winter joy than a scalding hot shower at the end of a long day – Amanda Shapiro, Healthyish editorI give myself a little foot rub with oils before bedtime. There are so many reflex points in the feet that connect to your organs and other parts of the body so when you massage them it’s almost like you’re giving love to your whole body. —Alaina Sullivan, Bon Appetit senior designer.During the winter months (and, really, actually, all the time) all I want to do is stay in and cook dinner for the people I love.—Emily Eisen, Healthyish visuals editorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "The Healthyish Team"]}