{"id": "08f642d47024acc42e91062b2897fec1", "url": "https://www.bonappetit.com/story/zero-waste-restaurants", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Can A Zero-Waste Restaurant Succeed in New York? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCan Zero-Waste Restaurants Succeed in New York? Some restaurants are taking radical steps to be climate-friendly, whether or not their patrons are ready. By Aliza AbarbanelJanuary 28, 2020FacebookTwitterEmailPhoto by Nitzan RubinFacebookTwitterEmailThis story is part of The Healthyish Guide to Eating for the Climate...Without Stressing Out, a collection of our best tips for living sustainably and eating well while doing so.When the after-dinner crowds finish their kombucha cocktails and filter out the doors of west~bourne, a LA-inspired all-day cafe in New York’s trendy Soho neighborhood, a manager snaps a picture of the compost, recycling, and trash accumulated throughout the day. Each bag is weighed and added to a spreadsheet that’s been carefully updated for over a year in pursuit of one goal: to become the first certified zero-waste restaurant in New York.In the U.S., the restaurant industry is estimated to generate 22–33 billion pounds of food waste each year. But as anxieties about the environment and calls for a more ethical industry coalesce, climate consciousness is becoming the newest buzzword since “CBD.” We’re less than a month into 2020, and already this decade has been awash with talk of sustainability in food—but not much in the way of definition. Is sustainability making burgers with plant-based meat or using the whole, meat-based animal? Cutting down on single-use plastics or using “biodegradable” containers?Now, a handful of New York City restaurants like west~bourne and Rhodora, a natural wine bar in Fort Greene, are upping the ante. They’re using a zero-waste philosophy to overhaul supplier networks and traditional restaurant dynamics in hopes of building a transparent, sustainable system.In February, west~bourne owner Camilla Marcus plans to file their application with Green Business Certification Inc., an organization best known for the pioneering LEED green building certification. Businesses are required to submit a year of data proving that 90 percent of waste has consistently been diverted from a landfill or incinerator, and earn additional points for actions like providing staff with sustainability training and establishing zero-waste relationships with suppliers. A third-party assessor inspects the business, which pays a $1,200 to $1,500 registration fee, plus a certification fee priced per square foot. If all goes according to plan, west~bourne will be the first restaurant in New York to complete the program.“Everyone is throwing around the word ‘sustainability’ and the word ‘zero-waste,’ but if we have this certification from a certain board, someone who dines with us can look that up and understand what that means,” says west~bourne’s chief of staff Jamie Fass, who spearheads the restaurant’s participation in the certification program.In Brooklyn, Rhodora’s zero-waste mission is printed right onto the (recyclable) menus. The natural wine bar doesn’t have a chef—instead, each member of the small staff greets guests, pours wine, and assembles food in equal measure. In another departure from traditional kitchen dynamics, there’s no trash can on the premises. Instead, an on-site composter turns diners’ leftovers into mulch for the mini gardens bordering the sidewalk, which also helps fertilize the rooftop gardens at Brooklyn Grange.But in dense Soho, there’s no room for a composter. Instead west~bourne pays a private hauler to bring their organic waste to McEnroe Organic Farm in upstate New York, between 1,400 and 1,700 pounds each month. Marcus says neighbors without access to composting programs ask to drop off their own food waste at the restaurant, but they can’t afford to pay to haul away organics from the whole community too.But compost is just the end game—real waste reduction begins with the menu. west~bourne is strictly vegetarian to avoid stepping in meat’s carbon footprint; Rhodora’s menu, which largely consists of easily prepped conservas like mussels escabeche and cheese, is governed by what can be delivered by its network of largely local suppliers. The tinned fish is shipped in compostable packaging, the cheese is picked up at the farmers’ market, and cargo bikes messenger over shipments of bread and pickles from She Wolf Bakery and Marlow and Daughters three times a week.“We’re one tiny wine bar in a very large system, and it’s only through thinking creatively in partnerships that this becomes a broader mission,” says Halley Chambers, deputy director of The Oberon Group, the umbrella restaurant group containing Rhodora. “Our ultimate goal is to be more than just working sustainability in the food space but envisioning a sustainable future and economy.”After months of radically reimagining operations, zero-waste restaurants are faced with a new challenge: customers. Rhodora doesn’t have a dumpster to accommodate gum wrappers, juice boxes, and other flotsam often left behind by guests. Anything that can’t go into the usual recycling bin gets sent to TerraCycle, a New Jersey-based company that transforms hard-to-recycle materials. It’s meant to be a last resort, not a new landfill, but convincing customers to carry out their trash has a learning curve.“How do we relay this to customers without sounding aggressive, like you can't enjoy your time here?” says Rhodora staffer Calla Camero.At a time when the word “vegan” has been replaced by the friendlier-sounding “plant-based” and burgers made from soy protein are prized for their ability to “bleed,” chefs and restaurant owners are loath to come across as overly didactic. Both restaurants negotiate a delicate balancing act, explaining the sheer amount of effort that goes into sustainability while trying to prove that radical can feel normal—and provide customers with all the typical amenities you’d expect from a “normal” restaurant. But negotiating customer expectations can spark a myriad of new problems.Rhodora’s limited, conservas-based menu was designed to be carbon conscious, but the original offerings were expanded when vegetarian and vegan guests requested more fish-free options. Currently, west~bourne  is searching for a climate-conscious way to meet another common customer expectation: delivery services.It took four months to secure west~bourne's compostable to-go packaging, which isn’t assessed by the TRUE Certification. Their bowls and utensils are made from bioplastics derived from plants like sugarcane— a pricier yet increasingly popular alternative to plastic that’s recently faced criticism for being less sustainable than it may appear. Bioplastics can only be processed by industrial composting facilities, many of which reject the material because it takes much longer to break down than other waste and creates poorer quality compost. Customers who don’t have city-provided brown bins or other access to industrial compost facilities end up tossing those bowls in the trash, so west~bourne is trying to start a conversation with their delivery platforms about a reusable solution.“I think in a city like New York, not offering to-go or delivery isn’t really meeting your guests where they have needs so I didn't really think that [eliminating takeout] would be a possibility,” says Marcus. “We have to be a profitable business to be able to do the things that we do and make that impact.”Of course, the hope is that being visibly sustainable in the age of climate anxiety will ultimately be a profitable move. west~bourne offers a robust zero-waste catering service to mission-driven (and optics-driven) clients like AllBirds and Vogue, serving grain bowls and coconut chia pudding on ceramics that get returned to the restaurant after service.“We have a huge events and catering business and do a lot of interesting partnerships on that end,” says Marcus. “To see people seek us out because of our food philosophy and sustainability goals for me has been the bigger surprise and something I’m really proud of, because that allows us to expand our reach and impact.”Being an early adopter can also give restaurants a head start on adapting to new operational standards initiated by local government, like the plastic bag bans coming into effect in March. Currently, New York City only requires organics recycling for restaurants with 15,000+ square feet or those part of a chain with 100 or more locations in the city, but in late 2019 the sanitation department announced a proposal to expand the mandate to smaller restaurants. Should the rule change take effect, thousands of restaurants across the city will have to follow in Rhodora and west~bourne’s footsteps, training employees to sort compost and setting up contracts with organic waste haulers.It’s possible to imagine a not-too-distant future where organics collection is universal and cooking with food scraps is expected. But the reality is that these practices are still far from mainstream.“I hear it a lot: ‘It’s just restaurants, that’s just the way it is,’” says Marcus. “I think [this certification] is just to prove that it is very doable. I think if this industry is going to survive, we constantly have to innovate and be responsible in what we’re doing.”Explore Bon AppétitHealthyishNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-28", "author": ["Condé Nast", "Aliza Abarbanel"]}