{"id": "0909f8ce1ccb23ec4eae51baabbd1247", "url": "https://www.bonappetit.com/story/lesser-evil-popcorn", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "I Love Everything About Lesser Evil Popcorn...Except the Name | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Love Everything About This Popcorn (Except the Name)Lesser Evil’s branding makes me bristle, but I can’t find a flaw with what’s inside the bag.By Carla Lalli MusicApril 28, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I love popcorn. I love it as a snack, but I also love it as a meal. I love it when I’m sad, mad, drungry, happy, or bored. At a certain point in my life, it usurped cheesy pasta as my ultimate comfort food. I love that it’s a whole grain, which is a thing I tell myself when I am popping a giant portion all for myself. Because I thoroughly enjoy making popcorn at home and seasoning it with nutritional yeast, chile flakes, salt, and freshly ground pepper, I’m often disappointed by the store-bought versions. But one night when I found myself ravenous while shopping for dinner, I impulse-bought a bag of Lesser Evil Organic Himalyan Pink Salt Popcorn to tide me over on the subway ride home. (Remember pre-corona times, when picking up groceries on the way home from work and using mass transit daily was a thing?)I’ll be honest—I didn’t even notice the brand name on the front of the bag, which featured an illustration of a Buddha-esque figure. I was too focused on the very short ingredient list on the back: organic popcorn, organic coconut oil, and pink salt. I sometimes use coconut oil to make my homemade recipe, but I don’t often see it on packaged brands. I was intrigued! Bag secured, within minutes I was standing on the subway platform, attempting to look nonchalant with one hand shoved inside a ripped-open snack bag inside of a brown paper shopping bag. There, gazing across the New York City train tracks, I experienced Lesser Evil popcorn devoid of any brand messaging at all. It was sort of like a blind taste test! Let me just tell you—any popcorn that tastes absolutely fantastic when you are waiting for the blast of warm tunnel air that announces your train is entering the station will be even more fantastic when you’ve arrived at your destination. I ate most of the popcorn on the subway. It wasn’t cute, especially when pieces of popcorn started clinging to my jacket, but I didn’t care. This was superior popcorn. Properly, generously salted and in balance with the natural sweetness of the coconut oil it was (presumably) popped in. It boasted fluffy, crunchy, and intact popped kernels, and left just enough fat on my fingers to make me feel like the coconut oil was actually doing something. I was thrilled with this impulse buy and thanked myself for the decision.When I got home and started unpacking the groceries, I was immediately surrounded by the hungry jackals I live with–that’s my husband and sons—who were thrilled to find a half-eaten bag of popcorn among the otherwise ho-hum items. Their reaction confirmed my suspicions. It wasn’t just that I was hungry or that the Buddha-ish signaling had done a mind trick on me. It was just that this popcorn was good.The next time I was buying groceries, I made a point of seeking out the same bag, looking to repeat my joyous snacker’s commute home. That’s when I realized the popcorn I had so enjoyed was called “Lesser Evil,” which makes it sound both dietetic and potentially guilt-inducing at the same time. Less evil than what? Than the recipe I make at home? Or a bag of ordinary chips? If this popcorn claims to be less evil, that’s a subtle way of saying that it’s still a little bit evil, which confused me more. I don’t think food is evil. Dictators are evil. Hidden surcharges are evil. The WiFi going out when you’re about to watch the next episode of “Insecure”—that’s evil. Popcorn is a delight, and I’m choosing this one because it’s made well, with minimal processing, and I enjoy it very much. I might take umbrage with the branding, but I can’t find a flaw with what’s inside.Buy it: Lesser Evil Organic Himalayan Pink Salt Popcorn, $3 for five-ounce bag at Thrive MarketAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingHighly RecommendRead MorecultureThis Spice Even Makes Salt Taste BetterBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-28", "author": ["Condé Nast", "Carla Lalli Music"]}