{"id": "091363194c97ab6253c7ab46596f7dd3", "url": "https://www.bonappetit.com/recipe/vegetarian-matzo-ball-soup-with-caramelized-cabbage", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Vegetarian Matzo Ball Soup With Caramelized Cabbage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian Matzo Ball Soup With Caramelized CabbageHearty and packed with caramelized cabbage, this vegetarian matzo ball soup doesn’t miss the chicken.By Sarah JampelMarch 29, 20214.1(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma FishmanEmailPinterestPrintEmailPinterestPrintMatzo ball soup is typically a first course during Passover, consisting of matzo balls, chicken broth, and some carrots and celery. But this (vegetarian! dairy-free!) matzo ball soup is more than a starter (and might enter your rotation all year round). Instead of relying on store-bought vegetable broth, which can be hit or miss, the flavor foundation comes from cooked-down cabbage. Be patient—you want the cabbage to caramelize not burn, and the lower and slower you go, the greater your reward. We recommend heating only as many cooked matzo balls in the soup as you’re going to eat and storing the leftover balls separately. Otherwise, they may get waterlogged and fall apart.Ingredients6–8 servings4large eggs, beaten to blend½cup extra-virgin olive oil, divided, plus more for serving¼cup finely chopped chives, plus more for serving2½tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more2½tsp. freshly ground black pepper, divided, plus more1cup (120 g) matzo meal1small savoy or green cabbage (about 2 lb.), thinly sliced1medium onion, thinly sliced4garlic cloves, crushed2large leeks (about 1 lb.), white and pale green parts only, thinly sliced8oz. peanut or other very small potatoes, halved½cup (packed) coarsely chopped parsley, plus more for serving1–2tsp. fresh lemon juicePreparationStep 1Whisk eggs, ¼ cup oil, ¼ cup chives, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, 1 tsp. pepper, and ¼ cup water in a medium bowl to combine. Add matzo meal and mix until no dry spots remain. Mixture will be loose. Cover and chill at least 30 minutes and up to 3 hours.Step 2Heat ¼ cup oil in a large Dutch oven or other heavy pot over medium. Add cabbage, onion, garlic, and 1½ tsp. pepper and cook, tossing (tongs help here!) until coated in oil and starting to wilt. Reduce heat to low, cover pot, and cook, stirring every 10–15 minutes, until cabbage is dark and starting to stick to pot, 45–60 minutes. (If cabbage is starting to stick too much before it’s done, add 1–2 Tbsp. water and scrape up brown bits stuck to bottom of pot.) Scoop out about ½ cup cabbage and set aside.Step 3Meanwhile, working with damp hands, divide matzo mixture into 20 pieces and roll each into about a ½\"-diameter ball. Bring a large pot of salted water to a boil. Gently drop in matzo balls and reduce heat so water is at a simmer. Cover pot and cook until matzo balls puff, rise to the surface, and are tender throughout (cut one open to check), 15–20 minutes. Using a slotted spoon, transfer to a large plate or rimmed baking sheet.Step 4Mix leeks, potatoes, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt into cabbage mixture and add 6 cups water. Increase heat to high and bring to a boil. Reduce heat and simmer gently, adding any matzo balls you will be eating in the final 5 minutes, until potatoes are tender, 10–12 minutes. (Any matzo balls that you’re not serving should be stored and reheated separately.) Remove from heat and stir in ½ cup parsley and 1 tsp. lemon juice. Taste soup and season with more salt and add remaining 1 tsp. lemon juice if needed.Step 5Ladle soup into bowls, then top with more chives and parsley and reserved cabbage. Season with pepper and drizzle with a little oil.Do ahead: Matzo balls can be cooked in water 5 days ahead. Cover and chill. Reheat in soup just before serving.How would you rate Vegetarian Matzo Ball Soup With Caramelized Cabbage?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis was easy to make and had beautiful flavor. Please note: caramelizing the cabbage takes a LONG time. It took me 2.5 hours just to get the cabbage to that perfect brown color. It’s not difficult, but it does take up a lot of time. My recommendations are to make this when you have a day off and to start earlier in the day. Do not quit before the cabbage caramelizes or you will lose out on all of the flavor. J GagePhiladelphia10/28/2021Delicious. Could maybe use another clove of garlic butter nice balance of vegetables don’t leave out the lemon juice. I didn’t make the matzoh balls and it was still tasty I use some meatless meatballs by GardineMary9/21/2021Reeeeally not worth the effort. It took a really long time to make a soup that wasn't that great. I would've rather used a packet and just added some veggies.... Would've tasted better, been cheaper, and significantly quicker. I'm not against recipes that take hours, but they need to be worth the effortAnonymous8/7/2021Wow! This is seriously delicious. I chopped my veg then stirred cabbage for an hour while half paying attention to a work phone call hahha - it worked perfectly! It does take time to get the caramelization but wow it's a flavor bomb! Made exactly as-is only addition was I added a carrot cause I had it, went really well though. This is incredible and makes a really good amount of soup. Psyched for leftovers!kmarxmarxchicago, il4/21/2021The soup has no flavour! It also took hours to make and you can’t even tell that the cabbage is caeamilized! I would not do this recipe again. Also this was supposed to be 0-1 star but the website only let me have 5 stars. Izzy LCanada 🇨🇦 4/18/2021Made this for my Jewish vegetarian wife this passover. It was my first attempt at Matzo balls. They came out great! The soup truly does not \"miss the chicken\". It can take a long time to achieve good caramelization on the cabbage. I cooked it on quite a low temperature to avoid burning. I could have added more water but chose some veggie stock to make it a bit soupier. \nThe Matzo balls came out great! They will expand quite a bit. I made half the recipe (soup and Matzo balls) and it fed 2 of us for 2 meals. WaverLake Tahoe CA4/2/2021Explore Bon AppétitSoupSoups and StewsJewishMatzoOther IngredientsSavoy CabbageCabbageLeafy GreensVegetableGreen CabbageStarterVegetarianNut-FreeHealthyishSimmerPassoverHanukkahRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-29", "author": ["Condé Nast", "Sarah Jampel"]}