{"id": "091d1796a8cc0b427de5c7861f926bcc", "url": "https://www.bonappetit.com/story/blackout-chocolate-banana-bread-recipe", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Make This: Blackout Chocolate Banana Bread  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat to Bake This Weekend: Blackout Chocolate Banana BreadIf you've ever had banana bread and thought it could be vastly improved with lots of chocolate, this is your recipe.By Alex BeggsJanuary 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, styling by Claire SaffitzFacebookTwitterEmailThis chocolate banana bread is actually cake, but you knew that, so let’s not speak of it ever again. A cross between banana bread and blackout cake, it’s a beautiful creation and we’re so lucky to have it in our lives. It’s also the perfect way to procrastinate whatever chores you had planned this weekend, which may or may not include: finally cleaning your shower curtain, commenting on celebrity Instagrams until you feel a human connection, or returning that thing you bought online that’s easier to return in person.Cake is so much better than those things! Chocolaty, chocolaty cake. It looks like chocolaty is spelled wrong but nope, that’s how you do it. And in this new recipe, recipe developer Molly Baz said that what began as chocolate banana bread “turned into blackout cake when I decided to double down on the chocolate factor and use both cocoa powder and chopped chocolate.” Double. Down. Plus, a dash of whole wheat flour brings out the nuttiness of the chocolate. Clever, clever.Get the recipe:Blackout Chocolate Banana BreadThis recipe as a cross between your very favorite banana bread and a chocolaty blackout cake.View RecipeThe sliced banana on top isn’t just for Instagram, it’s “a thing of beauty because essentially it gets ‘brûléed’ in the oven,” Baz said. “The entire top surface of the cake is sprinkled with raw sugar, which melts and caramelizes in the oven and lacquers the banana.”That said, it’s a super flexible recipe and if you don’t have whole wheat flour, you can use AP in its place. If you’d prefer chocolate chips or your favorite wafers, sure. If you’re more of a yogurt instead of sour cream, fiiiine. But you might be missing out on that one.A final note from Baz, if you’re still on the fence: “The recipe is a straightforward quick bread, but I will say that the aroma that comes from the oven while this thing bakes is freaking intoxicating. People were swooning all week during development.”Sold.Exhibit A: Please note the chocolate chunks, which are important.\nPhoto by Chelsie CraigExhibit B: What it looks like when you're about to dive in.\nPhoto by Chelsie CraigStock up: The Test Kitchen’s favorite cocoa powder and baking chocolate are Guittard. You can find the cocoa powder for $10 on Amazon and either buy a single baking bar on Jet ($3.61) or a pack of 4 on Amazon ($25) or at your local grocery.1 / 30ChevronChevronCaramel Ice CreamView RecipeExplore Bon AppétitBakeCakeBanana BreadChocolateDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-12", "author": ["Condé Nast", "Alex Beggs"]}