{"id": "092387638fedac031d3c65ef8b163d59", "url": "https://www.bonappetit.com/story/undocumented-workers-restaurants-covid-19", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "What It’s Like to Be an Undocumented Worker (and Unemployed) in the Restaurant Industry Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat It’s Like to Be Undocumented and Unemployed in the Restaurant Industry NowAn undocumented sous-chef and a chef-owner weigh in.By Leah MenniesApril 17, 2020FacebookTwitterEmailPhoto by Jimmy FontaineFacebookTwitterEmailIf you’ve gone out to eat, basically, ever, then you have benefitted from the labor of  undocumented immigrants. According to the Pew Center, 9 percent of workers in the leisure and hospitality industries are undocumented. They run restaurants. Build restaurants. Clean restaurants. Grow and harvest ingredients. Order, prep, cook, and plate those ingredients, then serve, clear, and wash those dishes.Following the mass shutdown of restaurants in response to COVID-19 and in the middle of one of the largest unemployment spikes in American history, undocumented workers have become some of the most vulnerable people living in the U.S. They’re cut off from their source of income yet denied access to government benefits like unemployment, SNAP, or Medicaid despite, in many cases, having paid taxes to the government for years.To better understand what’s at stake for undocumented restaurant workers amid the COVID-19 crisis, I spoke, separately and on the condition of anonymity, to an undocumented sous-chef through an interpreter as well as the chef-owner who employs him (and several other undocumented cooks at his restaurant). In their own words, they explain the open secret of undocumented immigrants in the restaurant world, how life has dramatically changed following the shutdowns, and what that means for them and the industry in the future.\"I have this desire to create—it comes from deep inside. But outside of work, you are not really free.\"Sous-chef, 27 years old, East Boston: In Colombia, it was hard to find work without an education. I grew up on my dad’s farm, helping milk cows and process coffee beans, trying to study and work at the same time. I only went to school through fifth grade. My dad ended up having to sell the farm because our family needed the money, so I worked as a mover in Medellín until my sister convinced me to come to Boston. I was 19 years old.My sister’s husband introduced me to a chef, and the same day I arrived in Boston, he hired me to work at his restaurant a few days a week. I also got a second job at a car wash. It was hard—I only worked there for nine months. My country is warm, but here the winter was wet and so cold that it hurt my bones. I’d never worked with food before. Growing up, my mom was always the one who cooked. On my first day at the restaurant, I had to shuck oysters. I’d never seen them before, and I kept cutting myself with the shucking knife. Still, it was a good experience, something new to learn. After a few months of doing this, I started to get into a routine, but I wanted to learn more. I moved to the salad station and, eventually, I left to go somewhere else with the chef.My boss was good to me. He gave me the chance to create dishes, and he helped me, answering my questions and bringing in books for me to look at recipes. I’m now the sous-chef and I run the kitchen, you could say. Four of my dishes are on the menu. In my country, I never thought that I could do something like this, but here I’ve had the freedom to do that. I have this desire to create—it comes from deep inside. But outside of work, you are not really free.I live with my girlfriend and our 14-month-old daughter in a small studio apartment in East Boston. I was at home when I received the text from my boss that the restaurant would close until further notice. It was March 15th. The other cooks and I were expecting this. We could all see it was getting slower. We received our normal paychecks. I usually worked five days a week, double shifts from 9 a.m. until close, between 9 and 10:30 p.m. I made $6,400 a month, $4,800 after taxes. It’s been eight years since I’ve been here, and I haven’t received anything in return on those taxes. My boss gave us a little extra money, then told me that this would be the last payment and that he would let us know when we would reopen. It was very sad.Since the restaurant closed, I’ve been in the apartment with my family. We haven’t left. I’m worried. We’ve always lived paycheck to paycheck but never needed any outside help. I have enough money, until rent is due next month. We pay $1,100 for rent, but with utilities, it’s about $1,500 a month. I don’t have that money and I can’t find work. Say I tried to get a job at a delivery company, dropping off meats, vegetables, things like that. I would need a driver’s license and have to fill out lots of paperwork, which isn’t possible in my situation. If there is no work, there is no way to survive here. So I may need help from WIC or the hospital to get my daughter diapers or some food. My friends and coworkers, we are all in the same situation.My boss just reached out to let us know that he was applying for a loan and would be able to pay us for a couple of months. I’m not sure what that amount is exactly and I’m not sure when we’d get it, but it’s helpful so that we can support ourselves and survive this crisis.Would I work here legally if I could? Of course. My daughter was born here, and then I could visit my family in Colombia. It’s been a long time. And I would still work in a restaurant, maybe even open my own restaurant, something just for me. The food would be American, and I would be able to give work to the neediest: people who share my experience. Cooking is important to me. It’s what I have learned to do to support myself and make a life here.\"If you went down a list of the top 50 restaurants in Boston, all 50 restaurants would have an undocumented employee.\"Chef-owner, 34 years old, Boston: I met my current sous-chef when I needed an oyster shucker. He had never worked at a restaurant before but picked it up very quickly. Somebody who is inquisitive and interested will stand out a lot. I watched him build his palate up, learning what raw fish tastes like, what soy sauce is. He went from having never worked in the kitchen to feeling comfortable on the line within about a year. So when I decided to open my own restaurant, I said to him, “Why don’t you come and step up into a more significant role?” He was hesitant because he was young and didn’t have any management experience. But he went with it, and now it’s gotten to the point where people just talk to him, and not me, if they have a question.Literally every restaurant kitchen I’ve ever worked in had a fair share or majority of undocumented workers. I recognized that early on, from helping out as a dishwasher when I was 14 to working with a whole kitchen crew in a major hotel for a large restaurant group in New York City. It’s that common and mainstream. If you went down a list of the top 50 restaurants in Boston, all 50 restaurants would have an undocumented employee. Every restaurant in Boston would be closed without them.Then there are restaurant-adjacent businesses: people who are working at the produce company, the seafood company, the linen company. The dirty rags from a restaurant that disappear and then come back clean—who is washing those? There’s a huge amount of need for employees for these “undesirable” jobs that are hard labor and not great pay.For years, the whole industry has been screaming about a line-cook shortage. It wasn’t that there weren’t any line cooks; it’s that no one wanted to train them. I’ve been fully staffed for years. I probably have 35 or 40 undocumented employees. Of that, about 85 percent work in the kitchen. In my opinion, anybody can cook on the line. I don’t think that a douchebag kid who went to culinary school and is probably going to leave after two weeks on the sauté station is better than a hard-working Brazilian guy with no cooking experience and two kids to feed at home.Compensation-wise, we pay undocumented employees what we pay anybody. Per month, total back-of-house payroll for both of my restaurants is about $35,000 to $40,000 for about 20 people that are a mix of full- and part-time. 90 percent of that, maybe more, goes to undocumented workers, and somewhere between $7,000 to $8,000 of that is withheld from them each month for taxes. I try to pay well, but it's not great in general. Undocumented employees are usually happy to take the work, though, because they’re usually coming from an even worse environment. A farm worker in Colombia, for example, could make as little as $12 U.S. dollars for an 8-hour shift picking coffee beans. So if they work a double shift at a restaurant for $12 or $13 an hour and have a second job, they pull in almost what they make in a month in Colombia in one day. That’s what blows my mind. That’s why people will risk their lives to come here and do this.But there is no help for undocumented workers right now. They are just getting totally overlooked. We closed the restaurants on March 15th, which was a Sunday. Before that, I was calling other chefs and asking them what to do, then I talked to my partner and said ‘Hey, we need to pull the plug.’ I had to tell my staff who has worked at the restaurant for several years, “We’re closing. I don’t know when we are reopening. I’m sorry.” We told everyone to file for unemployment but obviously not everyone could. My server who has worked for me for two months, they’re collecting an unemployment check. But my line cook who has worked for me for five years, they’re getting nothing. Zero dollars. These people have been working for years and years and paying taxes for years and years, and they're getting fucking screwed. But they still had a paycheck coming the next Friday, so I told all of my kitchen staff I’d bring their checks to East Boston and gave them some extra cash.Fundraising with GoFundMe has helped a little bit. I’m allocating that to the back-of-house staff. The front-of-house staff is receptive to that. They’ve been asking me, “How can I Venmo some money to X person in the kitchen? I want to send them a little bit of cash.” This week, I’m going to start paying everybody on Venmo. I’ve never used GoFundMe before, but they pay you the funds in installments, so it will be staggered. It ends up breaking out to about $350 to $400 per person, which is not that much money when rent per person in Boston is $750 or more, even if you have three roommates.The Payroll Protection Program (PPP) that’s part of the CARES Act is actually a win for undocumented workers, in theory, because it pulls people out of the unemployment system and puts them back on the payroll system. If your restaurant is closed and the only option is unemployment, undocumented workers get nothing. But if your restaurant is closed and this system is in play, then undocumented workers get their full payroll for two months. However, the PPP system is not functioning as advertised. (Ed Note: As of this morning, the PPP ran out of funding due to the overwhelming demand from small businesses.) We tried to apply for it at our main bank at first and they said they weren’t going to be ready for 30 days. So we went to our other bank and started going through the process with them. It’s an insane amount of paperwork, a really tedious process. We found out recently we've been approved for the loans, but now we are waiting for the money. I don't know how long that will take. As it stands, I think the program right now is kind of a shit show. But if the program works, it’s stupid not to do it. It’s essentially free money to give your staff for two months and some extras, like helping you pay for rent for the restaurant.But if it’s not ready soon, then undocumented employees are really in limbo. Even if it is, it doesn’t change that the whole system is still unjust. We can’t pretend that we don’t need undocumented workers. The whole economy runs on them. And the people that end up getting screwed the worst during this time are the people who are actually doing the work. It’s a complex thing. I don’t want my employees to be undocumented, and they don’t want to be either. They would be happy to pay more taxes and go through more paperwork to work here legally and get the benefits they should be getting. Sure, a lot of people are opposed to legalization, in my opinion, stupidly. Because, guess what? You’ve benefited from undocumented employees all the years you’ve gone out to eat.Interviews have been condensed and edited.Read MorerestaurantsThe Undocumented Chef Behind Kansas City’s Most Inclusive RestaurantBy  Eric GinsburgRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-16", "author": ["Condé Nast", "Leah Mennies"]}