{"id": "0932b0db67b75ecca7e9acc42fa32d36", "url": "https://www.bonappetit.com/story/what-is-ghee", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "What Is Ghee, the Clarified Butter We Could Eat by the Spoon? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Ghee, the Clarified Butter We Could Eat by the Spoon?We can't get enough of this nutty tasting, cooking-friendly fat.By Aliza AbarbanelApril 5, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.Ghee is easy to love. It’s unbelievably delicious, like ultra-rich French butter (aka the good stuff), that's been gently caramelized and transformed into a smooth spread. It's also shelf-stable and has a generously high smoke-point, making it pretty much the ideal cooking oil. And the distinctly flavored fat has deep roots in well-established Ayurvedic practices. It's a lot to love, but what exactly is ghee, and what’s the best way to maximize its goodness? Read on.Okay, what is it?Ghee is clarified butter, a.k.a. butter that has been simmered and strained to remove all water. In France, clarified butter has uncooked milk solids, yielding a product with a very clean, sweet flavor. In comparison, ghee is cooked over low heat until the milk solids have a chance to start to brown lightly, creating a slightly nutty, caramelized vibe. It is shelf-stable, with a high smoke point and deeply nutty flavor. Ghee has played a key role in Ayurveda for centuries, where it's prized for its anti-inflammatory, digestive, and therapeutic properties. It even appears in the Vedic myth of creation, when the deity Prajapati created ghee from nothingness and poured it into the fire to form his offspring.Why we love it:Clarifying butter by removing water creates a higher smoke point—about 465º F compared to butter’s 350º F. The clarifying process also removes casein and lactose, making ghee suitable for the dairy-sensitive. The absence of water even makes ghee shelf-stable, meaning it can be stored without any refrigeration for extended periods of time. Just be sure to keep the jar away from steaming stoves, food, and anything else that can introduce bacteria. (If you start to detect an off flavor, scrape off the top level, and store it in the fridge instead.)Ghee is high in Omega-3s and butyric acid, a short-chain fatty acid thought to be good for your gastrointestinal tract. But, above all else, we swoon over ghee’s grassy, nutty flavor—some ghee even tastes like cajeta (caramalized goat milk). This rich depth of flavor has won the support of our food editors, who use ghee to top creamy drinks, bloom spices, and finish lobster rolls with an extra drizzle of goodness.Ancient Organics ghee\nPhoto by Alex LauWhat to look for:To make ghee at home, start by simmering a saucepan of butter until the milk solids sink, then cook over a very low heat until they turn golden brown. (A pound of butter needs at least 45 minutes, and bigger batches need even longer.) Butter is around 20% water, so removing water through simmering creates an 80% yield. In other words, one tablespoon of butter is lost per every five tablespoons of ghee, which is why ghee can get pricey. The jarred stuff is even more expensive because of the labor that goes into making it!Skim off rising foam, then strain the remaining liquid through a fine mesh strainer until only the browned solids remain. You should be left with a golden-hued liquid: ghee. If you’re reluctant to go down the DIY route, there are also many excellent ghee products available for purchase. BA senior food editor Claire Saffitz is devoted to Ancient Organics, writing, “this stuff is so fragrant and flavorful that I went through about a third of the jar in a week.” Other brands we love include Pure Indian Foods, Tin Star Foods, and Deep Pure Cow Ghee. Whatever brand you buy, know that grass-fed milk will produce the most fragrant and delicious-tasting product. You can find ghee at Indian grocery stores, Whole Foods, and online.How to use it:Ghee cooks without much splatter or burning, making it ideal for high-heat cooking. Rub down a batch of vegetables before roasting, use a dollop to sautée garlic and ginger, or drop a spoonful into hot drinks like chaider for a mid-morning energy boost. Ghee can be used like any other cooking fat, but using it as a finishing oil really allows that rich, grassy flavor to come through. Just be warned: ghee's unmistakable taste is hard to quit.Cook with ghee:Quick Tomato Chicken CurryThe honey lends a sweet, caramelize-y twist to this quick curry, but if you want to up the heat, add a big pinch of cayenne pepper. Have some thick, crusty bread handy to scoop up all the extra sauce, or serve alongside a pile of rice for a low-maintenance comfort food dinner.View RecipeMoon MilkSleepy? This warm milk recipe will help usher you off to dreamland.View RecipeOvernight Oats with Cashews, Seeds, and TurmericThis sizzled seed and cashew mixture is delicious sprinkled over dip and soups, so you might want to make extra.View RecipeSimple KhichariThis restorative stew, from Divya’s Kitchen, features a rotating cast of hard and soft vegetables.View RecipeExplore Bon AppétitHealthyishGheeRead MoreLifestyleWhat Is Cacao, And How Does it Relate to Chocolate?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-05", "author": ["Condé Nast", "Aliza Abarbanel"]}