{"id": "09433253f85ac0900ea42558c733b084", "url": "https://www.bonappetit.com/story/brad-leone-favorite-knife-merch", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Brad Leone's Favorite Knife Is Back in Production | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBrad Leone's Favorite Knife Is Back in ProductionAnd lots more new “It’s Alive” merch drops today in our shop!By The Bon Appétit StaffMay 27, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailPerhaps you’ve seen Brad make giardiniera with it. Perhaps you heard him call it “probably my favorite knife that I own.” Perhaps you’ve even read a little story about this “one weird knife” in New York mag? Perhaps you’ve even attempted to find this elusive tool, which, up until now, has been challenging, to say the least. Well, here’s a very small piece of good news: Brad Leone’s cleaver/slicer of choice has officially been brought back into production by Lamson Products, a Massachusetts company since 1837. It’s now stocked in our shop, along with a whole slew of It’s Alive–themed merch.The man and his knife.\nPhoto by Laura MurrayWhat, you ask, is so special about this knife? Let’s ask the man himself: “I love the knife so much because of its lightweight and thin, large blade,” says Brad. “It’s a bench scraper and a knife.” The folks at Lamson added a few details: The full-tang blade (meaning, it runs the full length of the handle), in a Santoku shape, is made from tempered American high-carbon stainless steel that is flat-ground for precision and then hand-sharpened and finished for a razor-sharp edge. The ergonomically designed, contoured handle is made from durable walnut. The knife can be purchased as a set with a custom-made leather sheath, made from Wickett & Craig English bridle leather with double hand stitching, extra-strong brass rivets, and a brass snap that keeps the sheath firmly in place for storage. Whew! Lot of information. Shop for it here.Three more new items made for It’s Alive fans and pretty much no one elseThe Black Garlic Fan ShirtLoud. Distorted. Vigorous. Fermented. Inky. Sticky. Intense. This tee marks a rare if not singular convergence of fermentation enthusiasm and heavy-metal culture.Photo by Laura MurrayThe Black Garlic Fan HatSame concept, on a hat.A Shirt That Explains How to Speak BradIt’s self-explanatory. Kind of?Explore Bon AppétitShoppingBrad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-27", "author": ["Condé Nast", "The Bon Appétit Staff"]}