{"id": "09467cac806f9902bc4a866fc3fed1ca", "url": "https://www.bonappetit.com/story/preheat-oven", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "How Long Does It Take to Preheat An Oven? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Long Does It Really Take to Preheat an Oven?And why do you need to preheat anyway?By Shilpa UskokovicMarch 3, 2022FacebookTwitterEmailIllustration by Anamaria MorrisFacebookTwitterEmailIn Baking Hows, Whys, and WTFs, Shilpa Uskokovic will answer your burning baking questions and share her tips and tricks for perfect sweets. First up: How long are you supposed to preheat your oven?If you’ve got an oven that alerts you when it’s finished preheating, lucky you. For the rest of us, it’s a little bit of guess-and-check, a lot of patience, and some fancy oven envy. The whole situation is even more fraught if you don’t have an oven thermometer yet. (Yeah, you should probably get on that.) Whether you’re trying to budget time before dinner, have a less-than-flashy oven, or just don’t trust your machine’s calibration, we’ve got answers.How long should you preheat the oven?Instead of waiting around and wondering if your oven is at temperature, remember that the magic number for preheat time is 20 minutes—that’s the ideal time to cover a vast variety of preheating needs. You could certainly preheat for more time depending on the needs of what you’re baking (more on that later), but for most baking projects, preheating for longer than 30 minutes isn’t doing added good and won’t accomplish much beyond driving up your utility bill.A couple of factors affect the preheating time. The higher the desired temperature, the longer it takes to get there (say 450° F vs. 350° F); a bigger oven may also take a touch more time because there’s more air to heat up. But because the majority of baking projects usually happen between 350°F and 375°F, 20 minutes is a good average time to get your oven up to speed.The exception to the rule…While 20 minutes of preheat time is a good rule of thumb for most everyday cooking, some situations may require longer. If you’re sliding pizza or pie crusts onto a heavy steel or lowering a sourdough boule into a Dutch oven or cloche, you need to preheat long enough for the vessel itself to heat all the way through. This ensures it’s hot enough to hold on to and transfer heat to the food via conduction (for you students in the front row). In these cases, account for about 45 minutes for your preheat time.Why is it important to preheat your oven?Maybe you’re the sort of person who is asking yourself the existential question: Why do I even need to preheat the oven anyway? Let’s back up a little. Your oven is essentially a metal box with a pocket of air in the center. When you turn it on, gas or electricity kicks in, firing up the heating elements until the air reaches whatever temperature the oven is set to. It’s the languid circulation of this hot air that cooks the food. (Well, the heat pinging off the sides of the oven also plays a small role, but that’s a physics lesson for another time.) The time it takes for the air to reach the desired temperature is your preheat time.When food hits a hot oven, a near-instantaneous series of reactions and transformations occur due to the heat. The natural sugars in your vegetables start to caramelize; the yeast in that loaf of sourdough bread (are we still doing that?) goes into overdrive; cookies set around the edges; and butter melts and steams, puffing up the rapidly setting layers of pie dough. Without that immediate blast of heat, none of this would happen effectively.Think of putting batter or dough in a cold oven like cooking a batch of pancakes without heating the pan or griddle first. You’ll get there eventually but the pancakes will likely be unevenly cooked, completely misshapen, and devastatingly flat. You need that immediate kiss of heat to set the batter and kickstart the leavener into airy bubbles.When do you not need to preheat the oven?Here’s a secret: You don’t always have to preheat your oven (even if the recipe says to). Any dish that doesn’t involve any rising or leavening like, say, baked mac and cheese can go into a cold oven—it will turn out just fine because it doesn’t rely on those initial chemical reactions. Dishes with a lot of moisture (think lasagna or casseroles like piñon or shepherd’s pie) and dishes with a long cook time (such as a braise, like my Burnt Orange and Coriander Roast Pork) can also withstand the extra 20 or so minutes you’ll need to tack on if you didn’t preheat the oven first.And in some cases, skipping the preheat will actually enable you to get a more even cook. My favorite example is oven-toasted nuts. Starting them off in a cold oven gives the natural fat in the nuts enough time to gradually warm up and come to the surface, resulting in a more even, tawny roast.Armed with this knowledge, go forth and bake, my preheating Padawans.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-03", "author": ["Condé Nast", "Shilpa Uskokovic"]}