{"id": "0948eb2cfe889568ceace80deb6d7a65", "url": "https://www.bonappetit.com/recipe/chana-masala", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Chana Masala Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueChana MasalaBy Yasmin KhanMay 11, 20214.5(30)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWhen cookbook author Yasmin Khan was growing up, this was a regular midweek dinner that her Pakistani dad would cook. So when researching recipes for her book, Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, she says it was a delight to find the dish at Nan restaurant on the Greek island of Lesbos, and to hear that the recipe came from a Pakistani refugee cook who had worked there. For the ultimate comfort dish, the chickpeas should become so soft that they simply melt in your mouth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMortar and Pestle$25 At AmazonLarge Saucepan$60 At AmazonSmall Skillet$40 At AmazonOXO Good Grips® Smooth Edge Can Opener$22 At AmazonIngredients4  Servings3Tbsp. vegetable oil1medium onion, finely chopped1tsp. coriander seeds1tsp. cumin seeds4garlic cloves, finely chopped12\" piece ginger, peeled, finely chopped1tsp. garam masala¼tsp. ground turmericPinch of cayenne pepper or crushed red pepper flakes1medium tomato, peeled, chopped214.5-oz. cans chickpeas, rinsed1Tbsp. double-concentrated tomato pasteKosher salt, freshly ground pepper1tsp. cornstarch2Tbsp. extra-virgin olive oilChopped cilantro and rice and/or flatbread (for serving)special equipmentA spice mill or mortar and pestlePreparationStep 1Heat vegetable oil in a large saucepan or small pot over medium-low. Cook onion, stirring occasionally, until golden brown and very tender, 15–20 minutes.Step 2Meanwhile, toast coriander seeds and cumin seeds in a dry small skillet over medium heat, tossing occasionally, until slightly darkened and fragrant, about 2 minutes. Transfer to spice mill or mortar and pestle and let cool; finely grind.Step 3Add spice mixture, garlic, ginger, garam masala, turmeric, and cayenne to pan with onion. Cook, stirring, until fragrant, about 3 minutes. Add tomato, chickpeas, tomato paste, and 2 cups very hot water; season with salt and pepper. Cover pan; simmer, adding up to 1 cup more hot water if chana masala looks dry, until chickpeas are very tender and sauce is flavorful, 45–60 minutes.Step 4Stir cornstarch and 2 tsp. water in a small bowl, then stir into chana masala. Simmer just until thickened, about 1 minute. Remove from heat and stir in olive oil. Season with more salt if needed.Step 5Top chana masala with cilantro and serve with rice and/or flatbread.Nutrition Per Serving 4 servings 1 serving contains: \rCalories (kcal) 220 \rFat (g) 9 \rSaturated Fat (g) 1 \rCholesterol (mg) 0 \rCarbohydrates (g) 29 \rDietary Fiber (g) 7 \rTotal Sugars (g) 12 \rProtein (g) 8 \rSodium (mg) 800How would you rate Chana Masala?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI've made this several times now, and I love it. People saying it's bland: you really have to let it reduce for as long as the recipe says to. That does make it kind of time-consuming for a weeknight dish though. Sully1/7/2022It really was bland.  Follow the advice of others to double the quantity of spices and other ingredients such as ginger and tomato paste.  I would also recommend the following:  Some green or black cardamon, a pinch of cinnamon, one or two teaspons of apple cider vinegar or lemon juice and using vegetable broth rather than water.  Jane DOntario, Canada8/31/2021This turned out really bland - will try the suggestion to double the spices next time. Might be better with drained canned tomatoes.AnonymousMexico City8/13/2021I have made this half a dozen times now, slightly obsessed. I double+ the spices, add cardamom and white pepper for punch. Also, if you used canned tomatoes make sure to omit the can’s liquid... Makes it a sloppy mess. All in all, this is a really great dish!AnonymousVermont5/31/2021It was pretty good. I've had more flavorful channa masala.  Forty-five to sixty minutes cook time is long for using canned beans.  KristineLos Angeles, CA5/22/2021This was... amazing. I made it with dried chickpeas so instead of adding 2 c hot water I just added 2 c of the bean cooking liquid which maybe boosted the flavor a bit but either way this was absolutely incredible! Served it with store bought naan and can't wait to make it again!SarahIN5/14/2021Explore Bon AppétitPakistaniSouth AsianAsianIndianChickpeaBeanVegetableTurmericHerbs & SpicesGingerTomatoEasyMainSideDairy-FreeGluten-FreeNut-FreeVegetarianVeganSimmerSautéRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2013-08-26", "author": ["Condé Nast", "Yasmin Khan"]}