{"id": "0961cf839e3bff0a4c69aaa6504125eb", "url": "https://www.bonappetit.com/story/rose-vodka-hangar-1", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Hangar 1 Rosé Vodka Is Here, Just in Time for Valentine's Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRosé Vodka Is Here, Just in Time for Valentine's DayIt's millennial pink and 60 proof—a dangerous combination. But how does it taste?By Alyse WhitneyFebruary 1, 2018FacebookTwitterEmailCourtesy of Hangar 1FacebookTwitterEmailIf every Friday night you ask yourself: \"Should I have a glass of rosé or a vodka soda?\" then we have great news for you. Hangar 1 combined your two vices into rosé vodka, meaning all of your cocktails can be millennial pink and you can have rosé shots all day (well, maybe don't). The latest iteration of the trend brings a little summer to the dead of winter, hitting stores today (February 1) for $32.Unlike Wölffer Estate's rosé gin, Hangar 1's rosé vodka actually tastes like rosé. When we sipped some straight, it was \"less sharp than a standard vodka\" and had an \"appealing roundness of flavor with a bit of crisp fruitiness and floral notes.\" It goes down smooth with a faint bubblegum-like aftertaste, and has more body than a lot of vodka we've tried. The best description is that it tastes exactly like it sounds: rosé with higher proof from vodka, or vodka watered down slightly with rosé.Hangar 1 head distiller Caley Shoemaker used grapes and grains to distill the vodka and combined it with a blend of Northern California Petit Verdot and White Meritage wines for a \"full-bodied, flavor-forward vodka inspired by the Bay Area.\" It took a little time to find the right blend with a local winery, but the result was a smoother vodka with a vibrant color. \"It smells like Burnett's pink lemonade vodka and tastes... pink,\" remarked one Bon Appétit staffer. But definitely much better than anything we drank in college.It wouldn't hurt to add more booze to your rosé-Aperol spritz...\nLaura MurrayRosé vodka can make \"the most basic vodka soda,\" a higher proof rosé-Aperol spritz or frosé, spiked lemonade at a picnic, or a shot that doesn't burn going down. Also ideal for a Bachelor-watching drinking game during rose ceremonies, or as a last-minute Valentine's Day gift when all the actual roses are sold out.Buy Hangar 1 rosé vodka for $32 online at Reserve BarThen make rosé-Aperol spritzes:Explore Bon AppétitRoseVodkaCocktailAlcohol & Other DrinksWineTrends + NewsShoppingTrendsRead MorecultureRosé Gin Is Here, But Does It Taste Like Rosé?By Alex BeggscultureThe Rosé-Aperol Spritz Is Your Drink of SummerBy Alex Beggscooking5 Rosé Cocktails to Keep the Summer Water ComingBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Alyse Whitney"]}