{"id": "0971f9faa2b7d4904965aa29dd9f9e47", "url": "https://www.bonappetit.com/story/senegalese-rof", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "This Senegalese Rof Recipe Is the Best Use for a Bunch of Parsley | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Senegalese Sauce Is the Best Use for a Bunch of ParsleyI always thought of parsley as boring—until I tried Rof.By Ozoz SokohApril 21, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.One December day in 2015, my friend Folakunle Oshun, a Nigerian-born sculptor, organized an Around West Africa in Jollof cook-off as part of his exhibition and installation called “Wolof/Jollof.” Each volunteer, of which I was one, got assigned a version of jollof rice, the spiced red rice beloved in every country south of the Sahara. I drew Senegal, and so began my journey.The base of thiéboudienne, Senegal’s national rice dish and, some say, the mother of all jollof, is fish and seafood that’s slashed and stuffed with a thick, spiced herby paste-slash-sauce called rof. The thiéb was so good, it changed my mind about parsley, for good and forever. Before rof, Greek salad was the only dish where I allowed parsley to feature—where sweet and tart tomatoes meet intense Kalamata olives, crisp lettuce, and crunchy cucumbers, a sprinkling of fresh parsley works well. Otherwise, though, I’d look over this herb in favor of others.In the city of Thiès in western Senegal, there is an area called rof, but I’m not a hundred percent sure if this is where this sauce gets its name. While my research continues, this bright green sauce made me fall in love with Senegal and parsley all at the same time—and it might have you doing the same.How to make Senegalese rof:Traditionally, parsley, onions, scallions, a mix of hot chiles (which we call peppers in West Africa), and stock cubes are pounded in a mortar and pestle to create a bright assertive paste. Unfortunately, short of making a chopping board version, my blender is the only piece of processing equipment in my rental apartment.To make it, add ½ small red or white onion, chopped, the whites of 2 scallions, chopped, 1 bunch parsley, roughly chopped (about 2 cups), 2 cloves garlic (or more, to taste), 1–2 small green chiles (like Thai chiles), ½ tsp. freshly ground black pepper, ½ tsp. crushed red pepper flakes, and ¼ tsp. salt to a food processor or blender. (If you’re worried about the heat levels, hold off the green chiles until the end and add them gradually to taste.) Pulse until coarse or pound in a mortar with a pestle.If you’re using a blender, as I do, you may have to add a touch of water or oil to get the ingredients to meld. But if you’re using a food processor, you might not need any additional liquid. The result is a multi-textured paste that resembles finely chopped greens and onions with specks of red from the red pepper flakes. It’s a bright assertive mixture that reminds me of pesto, without any graininess from nuts and hard cheese.Rof’s flexibility is another thing I love. I like to use it in its original applications—to stuff fish and to season seafood—but also as a dip, especially for tostones. I’ll also thin it with oil and citrus juice to dress my salads (tomatoes are a favorite), stir it into yogurt, or fold it into hot pasta.And while my version may not be certifiably classic, it approximates the deliciousness of the first time I tried it and provides a very good reason to purchase a bunch or two of parsley.Ozoz Sokoh, The Kitchen Butterfly, is a Nigerian-born exploration geologist turned food-obsessive who uses foodways to explore personal narratives of history and heritage, culture, identity, and belonging.Explore Bon AppétitParsleyherbSauceAfricanIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-21", "author": ["Condé Nast", "Ozoz Sokoh"]}