{"id": "0971279cab54e874abe61cbaa8e5f4b9", "url": "https://www.bonappetit.com/story/lavender-ranch", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "Culinary Lavender is the Ingredient Your Ranch Dressing Has Been Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Have Unlocked the Secret to Perfect Ranch DressingGive it your best guess.By Chala Tyson TshitunduJanuary 31, 2022FacebookTwitterEmailAlex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.What’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, lavender ranch.Buttermilk ranch is the most perfect dressing ever created, and I cannot be convinced otherwise. Green goddess is great, but I’m not drizzling my pizza with it; honey mustard slaps, but I’m not slathering it on my kale salad; and I love raspberry vinaigrette, but there’s just no way I’m using it for dipping chicken tenders. The fact of the matter is, ranch reigns supreme.What if some madman took it upon himself to try to improve upon perfection? Would they be flying too close to the sun? If so, call me Icarus because I have unlocked the secret to making the most mind-blowing ranch dressing at home: culinary lavender. You might be thinking, “Flowers in my precious ranch? Chala, you are a madman!” But hear me out: The brightness of lavender is an amazing complement to fatty ingredients like buttermilk, and its subtle piney-ness pairs well with the other herbs traditionally found in ranch.Ultra-Blue Premium Lavender Flower Buds$9 at The Spice HouseThink of it as a delicious cultural exchange between the south of France and the southern United States—herbes de Provence meets buttermilk dressing. The result is a rich, tangy, delicately floral ranch sure to impress even the most ornery of ranch purists. Don’t just take my (incredibly biased) word for it—make lavender buttermilk ranch yourself!Here’s how: In a small bowl, whisk together ½ cup Greek yogurt (or sour cream), ½ cup mayonnaise (preferably Kewpie), ½ cup buttermilk, and 1 tsp. lemon juice. Then chop 1 tsp. fresh dill and ¼ teaspoon dried culinary lavender (chopping your lavender is crucial as the flavor of whole buds can be overwhelming) and add to the yogurt mixture. Now for the other herbs and spices: Add ¼ tsp. dried rosemary, ¼ tsp. dried oregano, ¼ tsp. freshly ground black pepper, ¼ tsp. garlic powder, and ¼ tsp. onion powder to the mixture. Whisk everything well, and let it chill in the refrigerator for at least 15 minutes for the flavors to meld. Garnish with more fresh herbs, like thinly sliced chives or additional dill, if you’d like.Photograph by Isa Zapata, Food Styling by Cyd McDowellNow you’re ready to use it anywhere you would use the bottled stuff. As a pizza topper, a dip for vegetables on a crudités platter, or a dressing for hearty salad, this lavender ranch can do it all.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-31", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}