{"id": "097bc54bd993fe813aeb10edcc065127", "url": "https://www.bonappetit.com/story/wim-hof-method", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Wim Hof Method Promises Happiness Through Controlled Suffering | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Tried the Wim Hof Method to Find Happiness Through Suffering  What kind of inner peace can possibly come from controlled hyperventilation and being really cold?By Rachel Sugar October 28, 2019FacebookTwitterEmailIllustration by Igor BastidasFacebookTwitterEmailIn I Did The Thing, Rachel Sugar sacrifices her time and her sanity in the name of wellness \"research.\" Up next: a day of ice baths at a Wim Hof Method class.I’m sitting in a blow-up birthing pool filled with bags of bodega ice on an industrial street in Brooklyn, trying very hard to regulate my breath, because this is the method of Wim Hof, a.k.a., the Iceman.If I sit here for 90 seconds, I’ve been told, I will be on the path to reclaiming an earlier, better version of myself: me, but with the vitality of a prehistoric caveperson. The comforts of modernity have made us weak and sad and sick, but we can heal ourselves, the Iceman says. By getting in synch with the elements we can reclaim our inner power. We can become stronger and happier and healthier; thinner and better at sleeping. In fact, there seems to be no ailment Wim Hof’s method—the Wim Hof Method—does not claim to at least partially address: stress, arthritis, cancer, migraines, canker sores, fibromyalgia, Crohn’s Disease, ALS, MS, and HIV. Coincidentally, these are also the exact benefits I would advertise if I were running a scam.The thing about the method, though, reported not just by acolytes but by some number of actual research physicians, is that it appears to work.The Wim Hof Method (WHM) has attracted what is now a veritable army of followers, fans, and trained disciples dedicated to maximizing their own potential via breath and controlled suffering. One of them is kneeling in front of me as I sit in the ice bath, setting the pace of my breath by example. Like the Iceman, he is ferally handsome, blue-eyed and wild-bearded. We breathe in. We breathe out.We are breathing at a CrossFit gym, which is directly across from an axe-throwing bar, which is next to a fencing studio, and down the street from a bouldering gym. It is a street that specializes in recreational violence. A few days earlier I’d been sent a waiver for the “Wim Hof Method Fundamentals Workshop” that read: “I acknowledge and understand that by participating … I may be injured, physically or mentally, or may die.” I agreed. Yes, that sounded fine.For a practice built on vigorous semi-nude feats of endurance, the WHM is also unexpectedly warm and fuzzy.This workshop, presented by Innerfire, the organization that handles the business of the WFM, is designed to introduce us to the Iceman’s ways. First, we will learn breathing. By using a pattern of deep and rapid inhales—controlled hyperventilation—paired with extended periods of no breathing at all, we can trick our minds into the stress response that will allow us to endure unfavorable temperatures, like extreme cold. Then, we will learn cold exposure, which is supposed to challenge the cardiovascular system, boost energy levels, and bolster the immune system. Technically, the third prong of the method is “commitment,” but it’s hard to practice that in a four-hour workshop, so we don’t. With these three principles, Hof says, you can hack your body in ways that are theoretically not possible.He is his own best evidence. Hof has a resume of superhuman achievements that should have killed him. He climbed to 20,000 feet on Mount Everest naked, except for shorts and shoes. He ran a marathon in the Arctic Circle barefoot. He holds the world record for longest ice bath (almost two hours). He holds the world record for fastest half marathon barefoot in the snow (two hours, 16 minutes).. He holds so many world records, who can count them all? Mostly they have to do with ice.In the last few years, Hof’s work has transitioned from high-profile stunts to peer-reviewed science. The stunts may have made him famous, but they also suggested he was special, and the whole point is that he’s not. He’s simply proof of what the human body was meant to do.Researchers injected 24 study participants with E. coli—half who’d first trained with Hof, and half who hadn’t—and found that the Hof trainees had markedly more effective immune responses. Last year, a different group of scientists put Hof into an MRI machine and then exposed him to cold water so that they could get a concrete view of what happens in his mind. They found that he was able to consciously and intentionally induce a stress response that allowed his body to resist the cold. “We are able to get into any cell and change the chemistry,” Hof has said. “We are able to get into the DNA.”Beyond the physical benefits of the Method are the emotional ones: the self-love, calm, compassion; the sense you are connected to other humans. For a practice built on vigorous semi-nude feats of endurance, the WHM is also unexpectedly warm and fuzzy.Like pretty much everything Hof says, the hard line between what is science and what is sophistry is slippery. Early research suggests that maybe he’s onto something. But also: every cell?Before he became a global phenomenon, Wim Hof was just a regular Dutch guy with a weird penchant for plunging into Amsterdam’s frozen canals. When he was in the water, time slowed down, and afterwards the endorphins lasted for hours. Soon he’d developed a breathing technique to extend his sojourns and an otherworldly ability to control his immune system and regulate his internal thermostat.For 15 years, Hof trained in relative obscurity: less “health guru” and more “neighborhood weirdo who could really use a sweater.” Then two things happened. The first was total devastation: In 1995, his wife died by suicide. Hof felt that his method could have saved her. “I can bring people back to tranquility,” he told journalist Scott Carney who’d set out to write a takedown of the WHM and ended up with a book about becoming an accidental fan. “My method” Hof said, “can give them back control.”The second thing to happen was an accident: A local TV crew came to film Hof swimming in his favorite frozen lake, and in the process happened to capture him saving a stranger’s life. The footage went viral, and not long after he was performing feats of impossible endurance on international TV. Then he started training others, and, with his certification, those others started training even more others, and soon people in Brooklyn were grunting in birthing pools.At the CrossFit gym, a dozen  extremely fit-seeming people and also me sit on yoga mats, waiting to harness our long-dormant inner fire. Mostly, we are white. Mostly, we are male. Entirely, we are young. All of us have paid $123.67 to be here. “Nature has provided us with all the tools we ever need to activate and optimize our truest selves,” the workshop’s welcome email had told me.In the back corner, I contemplate the ways I may be injured physically or mentally, or may die.Our instructor—a 35-year-old Hoffer named Michael Christoforo who would later coach me through my introductory ice bath—opens with a PowerPoint on the merits of the WHM, although everyone is already at least $123.67 convinced. Then it’s time to breathe. We are told we could pass out, but as long as we aren’t under water, which we aren’t yet, it’s fine. It is athletic, all this breathing. The inhales are huge. “Fill the belly,” Christoforo says. Our bodies undulate like waves. On the final exhale, we hold until it is unbearable and then we inhale and hold again, just for a second. Then we do it all over again. “Now you’re going to do it on your own for thirty minutes,” Christoforo says. I think: That is too much breathing.I begin to feel an overwhelming cold. Christoforo assures me this is normal. I will learn it is also normal to feel very hot, or tingly, or euphoric. It is normal for your hands to freeze up into lobster claws, or to cry.\"I may do nothing else today,\" I’d think, \"but at least I have suffered!\"I do not feel euphoric. I do cry. The day of the workshop was a bad day for me, personally, which is only relevant because I would highly recommend encountering the WHM in a state of extreme emotional distress. There is a certain openness that comes from misery, which is an asset if you are going to submit yourself to rhythmically gasping for air in a CrossFit gym of better-muscled strangers. Even the hot people just want to feel better, I think, weepily.The second half of the workshop is devoted to the virtues of extreme cold. In preparation, I’d spent the last week taking icy showers, a key component of practicing the WHM. Turns out I did not take enough cold showers to have any impact on my immune system, or my spirits. I never felt profound joy, but as the days went on I began to emerge with an invigorating sense of accomplishment. I may do nothing else today, I’d think, but at least I have suffered! It is nice to check something off the list.The pièce de résistance of the workshop is the group ice bath, which turned out to be a solo ice bath but with an audience. One by one we took turns plunging into the birthing pool filled with bags of bodega ice.I am not what I would call a “physical person,” but the great thing about the ice bath is that you don’t have to be. We’d been told not to fight the cold, and I am great at not fighting things. Also, sitting. In many ways, the ice bath plays to all my strengths. Initially I’d resented everyone at the workshop for being the kind of people who'd voluntarily and for non-professional reasons attend a workshop like this—one that peddles this unlikely cocktail of hyper-machismo and hard-core sensitivity. But now, after we’d watched each other ice bathe, I loved them all. We all felt stupid! We all just wanted to be happy and not in pain!I get one more email after the post-workshop. It includes a packet reminding us the method is not a “cure,” and it’s not a “magic pill.” Hof has said he doesn’t want to “give any false hope to any person in this world.” Maybe this is just how the Method covers itself legally, but it does seem to openly acknowledged that you can do your best—breathe and chill and be committed—and still get sick. “I'm never a proponent of panaceas,” Christoforo tells me. He’s a fan of modern Western medicine “to a very strong degree.” You take the pill, and you breathe. “We’re not trying to cheat death here,” he says. “Good luck with that. But what we are trying to do is optimize our life for better living.” Christoforo says that, in the breathing, he’s able to find a sense of “vast stillness.” He’s noticed his reactions becoming “much more even-keeled.”My reactions have stayed the same amount of keeled. Mostly because I gave up. I really like hot showers, and I do not like suffering, even if it will make me stronger and less cancerous. I have always seen myself as exactly the kind of person who, in some virile caveman past, would have been devoured by a wolf. (I am very slow.) I know that the Method, as it is writ in the third tenet, only works when the Method is adhered to, and one emotional ice bath on the sidewalk isn’t enough.And yet. Sometimes I still crank the shower as cold as it can get it, because I can’t quite let go of the idea that a little sustained suffering, even if erratically imposed, is good for me. That my pleasant, climate-controlled lifestyle can be positively impacted by even just a few minutes of immune system-bolstering cold. I am attracted to the idea that discomfort is in itself productive. For all of its real and purported benefits, what I like best about the WFM is the reassuring promise that, however miserable you are, there is always something to be done. And all you need is a little more controlled misery, some ice, and a few deep breaths.Explore Bon AppétitHealthyishTrendsI Did the ThingessayRead MoreLifestyleI Got Stretched By a Professional Stretcher at a Boutique Stretching StudioBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-28", "author": ["Condé Nast", "Rachel Sugar"]}