{"id": "09950af80169064e5e884093232bd212", "url": "https://www.bonappetit.com/recipe/black-lentil-and-harissa-roasted-veggie-bowl", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Black Lentil and Harissa Veggie Bowl Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueBlack Lentil and Harissa-Roasted Veggie BowlBy Dimitri MoshovitisJanuary 8, 20194.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis filling, endlessly riffable bowl is perfect with roasted sweet potatoes, but any hardy vegetable you have on hand would be just as delicious. Try delicata squash, cauliflower, or eggplant. This recipe is from Dimitri Moshovitis of Cava.Ingredients4 servings 2tsp. kosher salt, plus more2cups black beluga lentils, rinsed½tsp. ground coriander7Tbsp. extra-virgin olive oil, divided2Tbsp. harissa paste, divided½tsp. freshly ground black pepper, plus more2large sweet potatoes (about 1½ lb.), scrubbed, cut into ½\" pieces2pint cherry tomatoes, halved3Tbsp. red wine vinegar1Tbsp. honey½cup chopped cilantroPreparationStep 1Preheat oven to 425°. Bring a medium saucepan of salted water to a boil; add lentils. Adjust heat and simmer until just cooked through, 25–30 minutes. Drain lentils and transfer to a large bowl; let cool slightly.Step 2Meanwhile, whisk coriander, 3 Tbsp. oil, 1 Tbsp. harissa paste, 2 tsp. salt, and ½ tsp. pepper in a small bowl. Arrange sweet potatoes and tomatoes on a rimmed baking sheet and drizzle with harissa oil (reserve bowl for dressing). Roast, tossing once, until sweet potatoes are tender and browned on some sides and tomatoes burst, 25–30 minutes.Step 3Whisk vinegar, honey, and remaining 1 Tbsp. harissa in reserved bowl. Stream in remaining 4 Tbsp. oil, whisking constantly until emulsified; season vinaigrette with salt.Step 4Add half of vinaigrette to lentils and toss to combine. Taste and season with salt and pepper. Divide among bowls. Top with roasted vegetables and cilantro. Drizzle with remaining vinaigrette.Step 5Do Ahead: Lentils can be cooked 3 days ahead. Let cool; cover and chill.How would you rate Black Lentil and Harissa-Roasted Veggie Bowl?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis is a great mouthful. Creamy lentils, crisp potatoes, and juicy tomatoes are a great texture combination, but the big punch is the flavor: an acidic dressing sweetened with honey and fiery harissa that converts the pleasant blandness of beans and potatoes into a zesty dish that just happens to be nutritious as well. Putting this one into heavy rotation.KimRoseThe West3/23/2021Very tasty and makes a lot of food. I didn’t have harissa so I used an equal amount of salsa, it worked great.  Meticulous KJersey City 12/29/2020This was very tasty.  I couldn't find black lentils locally, so I used green.\n\nI also added the slow roasted harissa salmon recipe from this site, and it sang.\n\nI'll definitely make this again.daubie77Boston, MA5/26/2019Super duper good. I added homemade pickled onions to to give it some crunch and some acid.  \nThe recipe makes a ton of food. But I am sure you will enjoy [all of] it. AnonymousSeattle4/11/2019Easy, flavorful, and adaptable.  Doubled the vinaigrette recipe; used as a dressing for beets and  drizzled over grilled shrimp. Psychedelically colorful meal. AnonymousCalifornia3/11/2019Seriously, this was SO delicious! What an easy and uniquely flavored vegetarian meal to have! Really quick to prepare and we have tons of leftovers for lunch the next couple of days. Great combination of flavors. We added more harissa dressing to the roasted veggies and also added a bit of shredded cotija cheese on top and it was AMAZING. We're adding this to our regular rotation! Black lentils are so much better than green or red so make sure to use either black or green.AnonymousCincinnati2/27/2019This was SO GOOD and extremely easy. I am absolutely adding this into the rotation of favorite meals.\n\nI'll have to start putting Harissa paste in other stuff now because this was the first time I've used it.snafuquaMinneapolis2/24/2019Easy and flavor forward. I used mild harissa which worked well. Green lentils worked as well. decafpls2/14/2019Delicious!  I didn’t have beluga lentils and used green.   Added carrots to sweet potatoes and was so yummy!!!SDMomSan Diego2/12/2019Phenomenal and super easy! Used white sweet potatoes from my CSA share and spicy Harrissa paste. I tossed all the vinaigrette with the lentils and topped with thinley sliced radish and cilantro.AnonymousOhio2/2/2019Explore Bon AppétitRice and Grain BowlSweet PotatoPotatoVegetableHarissaCondiments, Sauces & PastesCauliflowerBlack LentilLentilDelicata SquashSquashWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeVegetarianHealthyishSimmerRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Dimitri Moshovitis"]}