{"id": "099e2cc510f612d9af20c70ac0e8698b", "url": "https://www.bonappetit.com/story/a-short-list-of-good-things", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "A Short List of Good Things | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Short List of Good ThingsThe things keeping me happy—or at least distracted—right now.By Amanda ShapiroMarch 12, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I don’t need to tell you it’s an intense time. Between the churn of virus-related news, the unsettlingly warm weather in NYC, and a bunch of uncertainty and malaise around the presidential election, the ambient stress out there is REAL. So far, my preparedness plan has involved the following: stress-eating beans, binge-watching Love Is Blind and hating myself for it, researching healthy meal-prep recipes, and taking my temperature at random intervals throughout the day (97.9, in case you were curious). I’ve also been asking my Tinder matches what they’re doing to stay vigilant. Best answer so far: “I use Crisco instead of Purell. It’s a personal choice.”Speaking of which, Buzzfeed reports that Tinder usage is up, but based purely on, um, anecdotal evidence, I think it’s because people are sending flirty messages in lieu of meeting IRL. (Did anyone else not know about the “virus” emoji until now?). On the plus side, “social distancing” seems to be just the excuse my generation has been waiting for to cancel all our plans.The entire BA staff trying to figure out how to do a Zoom meeting.\nAnyway, here is a short list of stuff that’s making me happy—or at least distracted—right now. It was a good relaxation exercise, putting this together. I hope it helps you too.HEALTHYISH FRIED CHICKEN. In case this week’s new Healthyish recipe got lost in your feed, let me remind you: Sohla El-Waylly developed a gluten-free fried chicken recipe that’s hot, sweet, and impossibly crunchy. Also, for some BTS intel, I can attest that she nailed this recipe on pretty much the first go-round. Sohla, we salute you.Andy Baraghani made one of my favorite Healthyish recipes on From the Test Kitchen this week. Go for the brothy pasta, stay for the Winona Ryder stanning.I don’t think Sarah Jampel planned for The Basically Guide to Better Baking to happen at a time when people across the country are stuck in their apartments but,well, here we are, making Camo Chocolate Fudge Brownies and chit-chatting in the forum. Special shout out to reader MCC who’s planning to “~St. Paddy’s-ize~” that brownie recipe with Guinness and whiskey.Astrologer Chani Nichols read Lily Tomlin’s and Jane Fonda’s star charts and it’s my favorite thing on the internet right now.International Womxn’s Day was last Sunday, and I got to see Abena Boamah, founder of Hanahana Beauty, lead a conversation with four other amazing POC entrepreneurs at One Sunday at a Time, a Brooklyn boutique that I’m now obsessed with. Naj Austin, who founded the social and wellness space Ethel’s Club for people of color, talked about how “diversity and inclusion” is not the same as “equity and stakeholdership,” and I’ve been thinking about that a lot since then.Cabbage. It’s making me very happy. First I thought it was just an Andy thing: He developed the Caramelized Cabbage for Healthyish, the Stuffed Cabbage with Lemony Rice in the March issue, and a Cheesy Cabbage Gratin back in the fall. (How’d we let him get away with all that?). But there’s also the cabbage-heavy menu at NYC’s latest hotspot Veronika, the wood-fired cabbage with salsa verde I had at Reveler’s Hour in DC a couple weeks ago, and Start Simple author Lukas Volger’s recent “Soup!” Instagram Story starring a white bean and cabbage soup I can’t wait to make. I gotta hand it to Jaya Saxena, who called it back in December: Cabbage is our new current vegetable crush.Here is an incredibly soothing GIF of cake.Reminder: We’re all in this together.Until next week,Amanda ShapiroHealthyish editorP.S. If an important part of your wellness routine (your therapy sessions, your support groups, your access to medications or other care) has been affected by coronavirus, I’m curious to know about it. Email healthyish@condenast.com or talk to us on Instagram...and let me know if there’s anything else you’d like to see covered on Healthyish right now.Explore Bon AppétitHealthyishHealthyish NewsletterCoronavirusessayRead MoreLifestyleWhat Does It Mean to Be Prepared?By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-12", "author": ["Condé Nast", "Amanda Shapiro"]}