{"id": "09b17ca379d6abce41611bd4984a746b", "url": "https://www.bonappetit.com/recipe/basically-buffalo-wings", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Basically Buffalo Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Buffalo WingsBy Kat BoytsovaJanuary 27, 20193.9(80)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintWant crispy-spicy chicken wings without having to deep-fry at home? We got you. A few tricks guarantee oven-baked wings that are every bit as irresistible as the ones you get at the bar. First, adding baking soda to the dry rub does something...science-y to the chicken skin that facilitates extra crispiness. And starting the wings at a low temperature before blasting them with high heat helps to render out some of the fat from the skin as well, which gets them brown faster. Want to double or triple this recipe for a crowd? You can bake them all at the lower temperature before guests arrive, pull them out, and crisp them up one batch at a time so everyone gets piping hot wings.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketRimmed Baking Sheet$20 At Bon Appétit MarketHeavy-Duty Aluminum Foil$10 At TargetWire Rack$23 At BA MarketLarge Bowl$18 At AmazonWooden Spoon$6 At AmazonPaper Towels$13.45 At AmazonTongs$13 At AmazonSmall Saucepan$155 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAPlatter$29 At AmazonIngredients4–6 servings3lb. chicken wings, flats and drumettes separated½tsp. baking soda½tsp. garlic powder4¼tsp. kosher salt, divided1½tsp. freshly ground black pepper, divided1¼tsp. onion powder, divided½cup hot sauce (preferably Frank’s Red Hot)3Tbsp. unsalted butter2Tbsp. light brown sugar½cup crumbled blue cheese½cup plain whole-milk yogurt6stalks celeryPreparationStep 1Place a rack in upper third of oven; preheat to 250°. Line a rimmed baking sheet with a double layer of foil, then set a wire rack over foil. That wire rack ensures that hot air can circulate all around the wings, which helps to get them super-crispy—if you don't have one, do yourself a favor and pick one up, because they're useful for so many different things. That said, if you don't have one, you can lightly oil the foil and place the wings directly on it; they'll still get really crispy on the top side.Step 2Mix ½ tsp. baking soda, ½ tsp. garlic powder, 4 tsp. kosher salt, 1 tsp. black pepper, and 1 tsp. onion powder in a large bowl. (Just so you know, we measured that quantity of salt with Diamond Crystal kosher salt; if you're using Morton, which is finer, it'll be more like 2¼ tsp.)Step 3Pat 3 lb. chicken wings dry with paper towels—as dry as you can!—and add to bowl with spice mixture. Toss with your hands until evenly coated.Step 4Arrange wings on prepared rack, spacing evenly apart. Don't crowd them! If you're doubling or tripling this recipe, you're going to need separate racks for all of them.Step 5Bake wings 25 minutes; they’re going to be pale but will begin to look dry, which is what you want. Increase oven temperature to 500° and continue to bake, turning wings halfway through with tongs, until bubbly and golden, 25–30 minutes. (This is a good time to set a timer and move on to Step 6 while the wings cook.) When the wings are where you want them, take them out and allow them to rest for 5 minutes so they cool slightly, which will allow the skin to crisp up even more.Step 6While wings bake, bring ½ cup hot sauce (preferably Frank's Red Hot), 3 Tbsp. unsalted butter, and 2 Tbsp. light brown sugar to a simmer in a small saucepan over medium heat. Cook, swirling occasionally, until slightly reduced and thickened, 6–8 minutes.Step 7Using a spoon, mix ½ cup crumbled blue cheese, ½ cup plain whole-milk yogurt, and remaining ½ tsp. black pepper, ¼ tsp. kosher salt, and ¼ tsp. onion powder in a small bowl until just combined. Cover and chill until ready to use.Step 8Wash and trim 6 celery stalks. Slice on a diagonal into 3\"-long sticks. Arrange on a platter.Step 9Transfer wings to a large bowl, pour buffalo sauce over, and toss until evenly coated.Step 10Transfer wings to platter with celery, serve with blue cheese dressing and a roll of paper towels alongside. Game on!How would you rate Basically Buffalo Wings?Leave a ReviewTell us what you thinkReviews (48)Back to TopTriangleDefinitely need to reduce the salt, but the wings were nice and crispy when they came out of the oven. Unfortunately, when you you add the sauce, the crispiness all but disappears. The blue cheese sauce was also bland. Needs some tweaks, for sure.Colly OTucker, GA8/7/2021Horrible! I didn't even add salt, the baking soda was enough. Awful flavor, awful looking, horrible! I don't trust these recipes anymore. AnonymousYoungstown, Ohio8/2/2021This was waaaaaaaaay too salty. Better with 1/2 teaspoon of table salt. As the recepie is it is sickenly too salty.JeffyCobourg, ON5/7/2021Ay-yi-yi - I agree about the smoke factor! And what a mess this made of my oven!\nWondering if this is for a gas oven and needs to be adapted for electric?\nTasty and I agree a bit too salty as well. I do like the baking soda  element - it helped make the wings a bit less watery, I think.\nQuantity of sauce is bit much  - 1/3 cup and 2 Tbs. butter  would be better - and what I usually use.\nThinking I won't be doing this again. Bon Appetit has another recipe for crispy wings with 2 sauces that is much less problematic.\nBut I will use baking soda again and the prep is pretty effective too.\nJust not 500F - yikes!AnonymousFL4/16/2021The baking soda technique is great but the recipe needs adjustments.  \n\n1).  500 degree oven is begging for a house filled with smoke and a smoke detector driving the dogs crazy during the high temp bake time.  I baked for 25 minutes at 250 as suggested then baked 450 degrees 35 minutes.  \n\n2).  Too salty.  I used Diamond Kosher and 4 teaspoons was about twice as salty as it should have been.  I thought other reviewers had incorrect poundage or used table salt.  I should have listened.  LOL 1 teaspoon of diamond per pound of bones is more than enough salt.  The oversalting is less noticeable with an unsalted creme fraiche blue cheese dip\n\n3).  2 tablespoons of brown sugar is too sweet.  I added to taste and stopped before 1 tablespoon.  \n\nI would make this again but I would definitely make the adjustments above.AnonymousCleveland, Ohio3/30/2021Made these for the Daytona 500 feed.\nI used corn starch in lieu of baking soda, and got nice crispy wings.\nBaked them @ 450 for about an hour, and didn't have to turn them.\nI substituted Old Bay Hot Sauce for the Frank's Red Hot and got an I'll make this sauce again sauce.\nCaptainkjYork, PA2/15/2021The secret to crisp baking is corn starch. Baking POWDER is about half corn starch, baking SODA has none. Both of the latter are full of sodium and worse, just use pure CORN STARCH.\n\nRight on the Frank's, right on bleu cheese vs \"ranch.\n\nKosher salt is too coarse to coat the wings well, use fine sea salt like Baleine. Kosher salt is not a premium product, it's just coarse.Ted CrumOakland CA2/10/2021Great chicken wings even the next day! I reduced the salt by half and used baking powder instead of baking soda.  They are crispy and flavorful. My super bowl crowd loved them. Will make it again. Hot CocoRichmond VA2/8/2021Tried this for Super Bowl Sunday.  We are not usually buffalo sauce fans but we loved this.  I added a half teaspoon of brown sugar for a little more sweetness and it was perfect.  AnonymousNashville, TN2/8/2021The recipe is very salty and I used a bit less than the called for amount of Diamond Kosher salt.. not that part is not user error.\nAlso, you can cook wings at 500 if you want to smoke out your house... or you can not and still get them to be crispy.\nIve made oven baked wings that are better.KccS1/25/2021I use baking powder instead of baking soda and bake at 475 degrees for an hour - no need to turn the wings.. Shatteringly crispRolltideCharlotte NC1/16/2021Basically I have found it!!! This is by far and away the \"Best Baked Buffalo Wing Recipe\" EH-VA!!\nThis was easy to make, the wings turned out \"Krispy\" and \"Krunchy\", just the right amount of heat and the chicken was done to perfection. Excellent seasonings, wonderful aroma in the kitchen this is a panacea for my Keto diet.  Thank you so much for sharing...I went out of my way to dry the wings completely before seasoning as I think this coupled with the Baking Soda was a key.  Anonymous774791/12/2021I used the blue cheese sauce from the deep fryer recipe, but otherwise liked this recipe a lot. I will try it again, but cut back on the two bake times by 5 mins each. Maybe has to do with my use of my Breville Smart Air Fryer oven even though I used the bake function and followed directions (except that I was limited to 480), the wings could have been just a little less charred for my taste. I did take them out of the last bake at 25 mins.North Texas10/26/2020Great recipe but way too salty.  Will make again but cut salt in half.AnonymousWisconsin 10/25/2020My wife, the chicken wing aficionado, said these are the best she’s ever had. I did cut the salt back to 2 teaspoons of Morton’s kosher. After baking for the 30 minutes and sitting for 5 minutes, I brushed the top side with the hot sauce, broiled them for about a minute (watch they don’t burn!), flipped them, brushed the other side with the hot sauce, and broiled for another minute. The best ever!Pennsylvania10/12/2020Explore Bon AppétitAmericanChicken WingChickenPoultryStarterMainNut-FreeGluten-FreeSuper BowlFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-27", "author": ["Condé Nast", "Kat Boytsova"]}