{"id": "09b83a730205c5af5aa5f949e70ca3c4", "url": "https://www.bonappetit.com/story/focaccia-success-story", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "An Easy Focaccia Recipe That Anyone Can Master | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt Should Be Against The Law for a Focaccia Recipe to Be This EasyThis is my bread success story. By Hilary CadiganFebruary 24, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.I am not a baker. I don’t just flit home after work to make Earl Grey yogurt cake, like some of my colleagues. I don’t take on pastry projects over the weekends or post naturally-lit side angles of my laminated crumb structures on Instagram. There was a minute, last spring, when someone gave me a sourdough starter, sparking halcyon dreams of my brave new future as a bread bro; months later, I found it in the back of my fridge—dead.Luckily, I live in a neighborhood full of old-school Italian bakeries, so I told myself I could purchase all my carbs pre-baked and still live a full life. But the feeling lingered. The ghost, perhaps, of that neglected yeasty goo-boy still slumbering with the fishes in his refrigerated prison cell. I wanted to bake; I just didn’t think I had it in me.Then one day, in the no man’s land of the BA shared Google drive, I happened upon this recipe for no-knead focaccia.“It’s easy!” said Sarah Jampel, the recipe’s creator, who very much is one of those casual weekend laminators. I didn’t fully believe her, but the ingredient list looked pleasingly simple: dry yeast, flour, butter, honey, olive oil, garlic, and salt. Literally, that was it. Seven things. And besides the yeast, I had everything in my ill-equipped kitchen already. So one rainy Saturday, I decided to put my baggage aside and give it a try.Go slow. I told myself, recalling failed cookie attempts past where hasty prep work led to the unfortunate exclusion of key ingredients like sugar. But the steps here were so easy I found myself flying: whisk yeast, honey, and water and set it aside. Watch the yeast foam—it’s alive! (Not dead!) Add flour and salt and mix, mix, mix. Coat it with oil, stick it in the fridge, and...wait, what? You’re done for the day. It can sit and chill for 8–24 hours.Come Sunday, I returned to the fridge to find my dough blob had expanded to twice its original size—exciting! Its bubbly surface assured me that I had not yet murdered it. So into a buttered, oiled baking pan it went. You can opt for a baking sheet as well, but the pan’s taller sides, Sarah told me, beget a thick focaccia that’s perfect for sandwiches, and I’m all about that. Just let it sit somewhere warmish while you watch 1.5 to 4 hours of Cheer on Netflix. (JERRY!)Time to rock out.\nPhoto by Laura Murray, Food Styling by Susan Spungen Then comes the fun part: pretending you are Samin Nosrat in the best scene of Salt, Fat, Acid, Heat. You know, the one where she makes focaccia in Liguria, pouring approximately one gallon of olive oil onto a slick of pale dough and using her fingers Liberace-style to poke holes all over it, each of which then turn into little thimble-sized oil pools. She is beauty! She is grace! She is me! She is you!Or is this the fun part? Sticking that baby into the oven and dancing around the apartment for half an hour as it fills with the unfamiliar scent of TRUE HEAVEN. “What is that?” your husband may ask. But you’ll say nothing as you pull your focaccia child fresh from the oven, all golden brown and glistening. You’ll melt some butter in a pan, grate in some garlic, drizzle it on top of the perfectly pocked surface. You won’t wait until it's cool because that’s too hard. Instead you’ll slice right into the blazing surface to pull out a steaming square. And suddenly you’ll realize that every focaccia you’ve eaten up until this point was totally stale compared to this.It will taste like creamy cotton. It will taste like a cloud full of hot rain, heavy and light all at once. It will taste like sweet, sweet success. Because look at you! Look at me! I made bread from scratch, and I didn’t even have to knead.Get the recipe:Shockingly Easy No-Knead FocacciaIf you want to fill your kitchen with the smell of fresh-baked bread but you're nervous about shaping a boule or working with a starter, focaccia is the best place to begin. We're not exaggerating when we say it requires zero skill and provides ample opportunity to be amazed by yourself and by the wonders of yeast. View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Hilary Cadigan"]}