{"id": "09bf8ef456b4d83f1180505c93f18547", "url": "https://www.bonappetit.com/story/squash-caviar-tastes-like-summer-in-a-jar", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Squash Caviar Tastes Like Summer in a Jar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSquash Caviar Tastes Like Summer in a JarNothing makes me more nostalgic for my Russian childhood than this silky purée.By Irina GroushevaiaJuly 15, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Kat BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I associate summer with the abundance of squash: Zucchini, calabazita, and yellow squashes are at every farmers market, in every CSA box, and overflowing from crates at fruit stands all over New York City. But more specifically, I associate summer with the taste of kabachkovaya ikra, Russian squash caviar, a silky and flavorful dip made from summer squash that have been cooked down with tomatoes, carrots, and other veggies until they reach a state of jammy perfection. The caviar is often canned or frozen during the summer and fall to enjoy during the long winters—a taste of sunshine when our daylight hours are shortened to a skimp five.The simplest way to enjoy it is slathered on a slab of toasted and buttered borodinsky khleb (a dark rye sourdough bread)—a breakfast or after-school snack I often shared with my mother in our tiny kitchen in Moscow. While she opted for the store-bought canned product, popularized during the Soviet Union, I grew to love making my own, often inspired by my aunt’s lush garden on the outskirts of Moscow and those at my high school friends’ dachas, where their babushkas tended their vegetable rows and processed their own compost.It’s the perfect way to use up squash and can be endlessly modified to your taste. More modern recipes now have added roasted red peppers (which I really enjoy), apples, and even mayonnaise. This recipe is as versatile and flexible as you want it to be—and is always a crowd-pleaser. (Bonus: It’s vegan and gluten-free!) Here's how to make it:Peel and thinly slice 1 large yellow onion and heat 3 Tbsp. neutral oil in a heavy pan with a lid or Dutch oven over medium heat. Add the onion to the oil and cook until starting to brown and caramelize, about 15–20 minutes. While the onions are cooking, char 1 red bell pepper directly on a gas burner or under the broiler until blackened on all sides, then set aside to cool in a resealable plastic bag. (This step will ensure easy peeling. Peeling all the vegetables is key to a smooth dip!)While the pepper cools, peel and finely chop 3 large garlic cloves and 2 small carrots. Add to the onions and cook until soft. Peel and chop 1 medium tomato and 2 medium zucchini and add both to the pan. Peel, seed, and chop the cooled-off pepper and add to the pan.Stir in 2 Tbsp. tomato paste and season the vegetables with salt, freshly ground black pepper, and some fresh chopped dill. Then lower the heat and cook it all down until the vegetables are soft and jammy. Let the mixture cool slightly, then purée until smooth using an immersion blender or high-speed blender. (Don’t add water; the vegetables’ water content should be sufficient.) Adjust salt, pepper, and dill to taste. The squash caviar can then be stored in the fridge for up to seven days, but also freezes extremely well, a great option when you have a ton of squash to use up.My favorite thing to do with the caviar while it’s still hot is to toss it with just-cooked pasta—it makes for the perfect summer sauce, light but boldly flavored. After a night in the fridge, it makes an excellent dip for all manner of crudités, crackers, and breads. In Russia, it’s also commonly layered with fried or boiled potatoes, added to an omelet, or simply dolloped atop rice for a boost of flavor and nutrients. Many of us who grew up in Russia were fed squash caviar in school canteens, a vitamin-packed dish beloved by even the most finicky eaters.Every summer I yearn for the nostalgic taste of this dish, one that every Russian knows like the back of their hand. I hope someday to pick my own squash on the soil of my motherland again, but for now, I share my childhood memories with my partner in our Queens apartment, eating homemade kabachkovaya ikra by the spoonful.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-15", "author": ["Condé Nast", "Irina Groushevaia"]}