{"id": "09c24cd76d17c691c35656ab2c30a15a", "url": "https://www.bonappetit.com/recipe/cherry-biscuit-cobbler", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Cherry Biscuit Cobbler Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueCherry Biscuit CobblerBy Claire SaffitzMay 21, 20195.0(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWhy choose between shortcakes and cobbler when you can have one dessert that combines the best of both? The lemony cherry filling is topped with shortcake-inspired cream biscuits (so tender, so light!) that soak up all of those fruit juices without getting soggy.Ingredients8 servings Biscuits¼cup granulated sugar1Tbsp. baking powder2tsp. finely grated lemon zest1tsp. kosher salt2cups all-purpose flour, plus more for surface½cup (1 stick) chilled unsalted butter, cut into pieces1⅓cups chilled heavy creamFilling and Assembly2lb. fresh (or frozen) sweet cherries, pitted½cup granulated sugar¼cup fresh lemon juice3Tbsp. cornstarch½tsp. ground cinnamon1tsp. vanilla extract¼tsp. almond extract¼tsp. kosher salt3Tbsp. unsalted butter, melted, slightly cooled2Tbsp. raw sugarVanilla ice cream or softly whipped cream (for serving)Special EquipmentA 1½\"-diameter cookie cutterPreparationBiscuitsStep 1Whisk granulated sugar, baking powder, lemon zest, salt, and 2 cups flour in a medium bowl. Add butter and toss to coat. Quickly smash butter into flour mixture with your fingers, working until the largest pieces are about the size of a pea.Photo by Alex Lau, Food Styling by Sue LiStep 2Gradually stream cream into bowl, tossing flour mixture constantly with a fork to distribute. Using a flexible bench scraper or a hard plastic spatula, fold dough over and onto itself several times, scraping bottom and sides of the bowl, to bring together into a mass (dough will feel very wet and sticky).Step 3Turn out dough onto a generously floured surface. Pat into a ¾\"-thick rectangle or square with floured hands, using bench scraper or spatula to lift up dough and dust underneath with more flour as needed to prevent sticking. Dust surface with more flour, then cut dough into 4 equal pieces and stack on top of each other. Dust with flour and press down on stack with a rolling pin to flatten to a workable height. Roll out to ½\" thick, dusting with more flour as needed.Photo by Alex Lau, Food Styling by Sue LiStep 4Use cutter to punch out biscuits as closely as possible, dipping cutter in flour often. Transfer biscuits to a plate. You should have about 40. Gather up dough scraps, reroll, and punch out more biscuits if needed. Chill until ready to use.Photo by Alex Lau, Food Styling by Sue LiStep 5Do Ahead: Dough can be made 1 day ahead; wrap tightly and chill.Filling and AssemblyStep 6Place a rack in middle of oven and preheat to 400°. Mix cherries, granulated sugar, lemon juice, cornstarch, cinnamon, vanilla extract, almond extract, and salt in a large bowl. Scrape filling into a 2-qt. baking dish or 9\"-diameter cake pan with 2\" sides and press down on it firmly to compact. Place on a foil-lined baking sheet.Step 7Arrange chilled biscuits over filling, fitting snugly so they’re touching with only a few gaps. Brush generously with butter; sprinkle with raw sugar.ChevronChevronStep 8Bake cobbler 10 minutes. Reduce heat to 350° and continue to bake until biscuits are golden brown and juices are bubbling, 50–65 minutes more. Let cool slightly. Serve cobbler with ice cream.Step 9Do Ahead: Cobbler can be baked 1 day ahead; store tightly covered at room temperature.How would you rate Cherry Biscuit Cobbler?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleI stole this cute biscuit idea for my chicken pot pie!! Sub in Dried Porcini mushroom powder for lemon zest and it’s amazing!! DylanNashville, TN9/18/2021Delicious! I used three pounds of frozen cherries and it came out perfect. The biscuits are sublime.Sharon C. Phoenix, Az6/19/2021So delicious! I definitely overstuffed the cherries and paid the price with a boil over. Thanks to Claire saying to lay down the foil underneath I didn’t have to clean quite as much! This recipe is delicious and I can’t wait to cook my leftover biscuits for a snack or afternoon tea. AnonymousSan Jose, CA6/17/2021I love this recipe. I've used it multiple times for family or school events. Any bag of frozen fruit works great, but peach works exceptionally well. I've even baked it in a Traeger smoker, and it adds a really nice flavor.WILLPortland, OR4/30/2021This is one of Claire's best recipes and I'm sad that it basically belongs to Bon Appetit. The creme biscuits are incredible; I can't even describe how good they are - this is one of my staple recipes now. Please try this recipe, and you can use any fresh fruit for this recipe. I've done peach and mixed berries and both were delicious. Cheers to Claire and her talent.ScarlettSagaCincinnati, Ohio12/25/2020I’d love to see a peach mod for this recipe. Claire mentioned in the BA video that they’re a bit wet and the biscuits may soak up some of the juices, which could affect baking, texture, etc. shyneSan Diego CA9/6/2020Delicious and relatively easy recipe! I'm a novice-intermediate cooking person, and this dish was whipped up in a pinch. 2 lbs (roughly 1.5-2L) of pitting cherries took about 30 minutes and like mentioned below, was quite therapeutic. The biscuits are DIVINE: rich, buttery, and the lemon zest gives it incredible flavour; I also used a small glass to cut the biscuits, about 2.5\" diameter yielding around 25 biscuits. For next time, I would probably use 18% MF cream; I found the heavy cream flavour over-powering. The cherries become jammy and I added an extra 1/4 tsp of almond extract which I absolutely recommend. Definitely tastes best with whipped cream or ice cream. Looking forward to trying this with other seasonal fruits!vatrinhToronto, Canada7/14/2020We have made this with a mod...we used a crumble topping instead of the biscuits. It is quite delicious. I am going to give it a go with the biscuits too. I am sure it will be amazing.AnonymousPleasanton, CA7/10/2020Question, will refrigerating the cobbler before baking affect the outcome? \nI wanted to prepare the night before (With biscuits on top of filling & bake the next day). Will the filling compromise the biscuit?mimi_roses6/29/2020I was nervous about getting tough biscuits because pastry and I are mere acquaintances as of now.  They turned out perfectly!  It was worth all of the time I spent pouring over the recipe to make sure I did it just right.  I served it to my family at a cookout and everyone thought it was amazing!  Will be making this again for sure!GrcisgoneGreenville, WI6/19/2020This is the BEST cobbler recipe I have ever tried, and easily the best tasting. The almond extract pairs perfectly with cherries (I used fresh), and the biscuit texture & flavor in this recipe is perfect. I used a 9\" cake pan and after sorting my cherries I had well under 2lbs, which just covered the bottom of the pan in 1 roomy layer, but I didn't change a thing to the recipe and the ratio still was great. The leftover biscuit dough was a bonus and I was glad I had plenty to pack into the top of my cobbler. My go-to recipe for life!AnonymousSeattle, WA6/9/2020The recipe is amazing! It was my first time making a cobbler and working with cherries. It’s an easy recipe that tastes great. I can’t wait to make it again!AmintaVirginia6/2/2020IT TASTES AMAZING.  This was my first cobbler and first time working with cherries.  I pitted the cherries by hand and it was not bad for 2lbs. it was actually relaxing.  The biscuits were easy.  I ate the whole thing by myself for breakfast, lunch, and dinner.  Health-wise it's not the smartest decision I made, but it was so worth it.  Ivonne ValenzuelaShreveport, LA6/1/2020This recipe is amazing! The cherries at the store didn't look great, so I used a mixture of blackberries and raspberries and left out the almond. Also, I eat a vegan diet, so I subbed in Miyokos butter and coconut cream in the biscuits and it turned out amazing! The tartness was just right! I can't wait to make this for friends!stefaniejeanBuffalo5/29/2020I should have made two!! This recipe is fool proof. The little biscuits are a hit in my house and are also good stand alone if you wanted to use them for something else. Is it weird that I loved how soft and delicate they felt as I cut them out?? I used frozen peaches and cherries. Came out a perfect constancy off gooey deliciousness. nephyCanada5/4/2020Explore Bon AppétitCobblerFruit DessertDessertAmericanCherryStone FruitFruitSummerNut-FreeBakingFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}