{"id": "09c70dcd629aebe5acdbdb4d2f198e3f", "url": "https://www.bonappetit.com/recipe/pico-de-gallo-2", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Pico de Gallo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPico De GalloBy Rick MartinezSeptember 2, 20215.0(12)Read ReviewsTriangleEmailPinterestPrintLaura MurrayEmailPinterestPrintEmailPinterestPrintMade with just a handful of ingredients, this pico de gallo recipe is fast and simple to make—just as it should be. Selecting the right tomatoes is the key: Opt for the firmest heirlooms you can find, which balance flavor with the right texture and help avoid a watery salsa. The finished pico de gallo is far better than store-bought—use it to top our Tex-Mex enchiladas or spoon it over a layered queso. It’s best used the day it’s made, but will hold in an airtight container in the refrigerator for a day or two.If you’re looking to experiment a bit more, remember that nearly any vegetable or fruit can be turned into a salsa, just follow this formula.Editor’s note: This recipe was originally published on January 12, 2017.IngredientsMakes about 2 cups2large tomatoes, preferably heirloom, chopped¼onion, chopped2jalapeños, finely chopped1garlic clove, finely grated⅓cup cilantro leaves with tender stems, finely chopped3tablespoons fresh lime juiceKosher saltPreparationGently toss tomatoes, onion, jalapeños, garlic, cilantro, and lime juice in a small bowl; season with salt. Let sit, uncovered, to let flavors meld, about 10 minutes.How would you rate Pico De Gallo?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleA classic recipe!!  I'd suggest 1-1/2 jalapenos and 1/2 serrano. Serranos are hotter, but they also add \"late heat\" whereas jalapenos are more \"early heat.\" Makes a wonderful combo. You can wait to add the peppers until the end, and then taste as you add a bit at a time so you get what you want in the way of heat.\n\nAlso, consider adding a tablespoon or so extra-virgin olive oil if you'd like to add that to the texture.  \n\nFinally, if you have a small salad spinner, chop the tomatoes first and give them a light bit of salt and set aside. Then finish the rest of your chopping. Now spin the tomatoes to pull some of the water and seeds out before adding them to the other ingredients.SteveHouston, TX9/2/2021Perfect. The best pico recipe out there.Anonymous481768/29/2020Classic recipe. I used sweet onions which worked great. Next time, will chop the tomatoes more finelyAnonymousMontreal6/7/2020Explore Bon AppétitDipSalsaCondimentMexicanLatin AmericanTomatoVegetableQuickEasySnackStarterGluten-FreeNut-FreeVeganVegetarianDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-01-12", "author": ["Condé Nast", "Rick Martinez"]}