{"id": "09c94a82fd531d3fb9653b1d67b5834d", "url": "https://www.bonappetit.com/recipe/yuzu-kosho-deviled-eggs", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Yuzu Kosho Deviled Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueYuzu Kosho Deviled EggsBy Alex RaijMarch 16, 20215.0(1)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrint“When I’m cooking for Passover,” says chef Alex Raij of Txikito in New York, “karpas (a green vegetable, often parsley, representing spring) is always my inspiration—it was my first taste of the seder plate. I grew up in Minneapolis without a religious education—my parents are immigrants from Argentina, where they had a very secular lifestyle—but when I was in first grade, a generous family in our neighborhood invited us over for my first seder. What I remember most was dipping the parsley in the salt water (to symbolize the Israelites’ tears in Egypt)—and it was delicious. I’m still attracted to those flavors, on display here.” Raij’s recipe includes a silky homemade mayo (using raw egg*), but you can use 1 cup of store-bought mayo in its place. And when it comes to presentation, Raij recommends arranging the eggs on a plate covered with shiso leaves—she likes to wrap the leaves around the eggs for a delicious, easy-to-hold bite.* Raw egg is not recommended for infants, the elderly, pregnant women, people with weakened immune systems...or people who don’t like raw eggs.IngredientsMakes 182Tbsp. Champagne vinegar or white wine vinegar1tsp. sugar2tsp. finely chopped shallot3small radishes, trimmed, very thinly sliced18large eggsKosher salt1Tbsp. S&B hot mustard powder or 1 Tbsp. plus 1½ tsp. Colman’s mustard powder1large egg yolk*2Tbsp. fresh lime juice1Tbsp. (or more) green yuzu kosho1cup grapeseed oil or vegetable oil2tsp. finely chopped cornichon2Tbsp. finely chopped tender herbs (such as parsley, chives, shiso, or chervil), plus more for servingPreparationStep 1Mix vinegar and sugar in a small bowl. Add shallot and let sit until softened, 5–10 minutes; drain.Step 2Meanwhile, place radishes in another small bowl and pour in very cold water to cover (radishes should curl).Step 3Place eggs in a medium pot and pour in water to cover by 3\". Add a large pinch of salt and bring to a boil over high heat. Immediately cover, remove from heat, and let sit 8 minutes.Step 4Run 1 egg under cold water; crack and peel. Yolk should be bright yellow and texture more chalky than fudgy. Let remaining eggs sit longer in water if needed, checking in 1-minute increments until done. Drain and rinse eggs under cold running water. Transfer to a large bowl of ice water and let sit, stirring every minute or so, until mostly cool, about 5 minutes. Carefully peel eggs, then trim a very small amount of white from top and bottom of each egg so they can stand on an end. Slice in half crosswise. Separate yolks from whites, transferring yolks to a small bowl. Place whites on a large plate.Step 5Mix mustard powder and 2 tsp. cold water in another small bowl to make a paste. Scrape into a food processor; add raw egg yolk, lime juice, and yuzu kosho; pulse until smooth. Let sit 1 minute.Step 6With motor running, pour in ½ cup oil, starting with a few drops at a time, then increasing to a very thin stream. Process until incorporated, then add 1 tsp. cold water. Stop processor and scrape down sides, then, with motor running, add remaining ½ cup oil in a very slow stream. Process until incorporated. Season mayonnaise with salt or up to 1 Tbsp. more yuzu kosho. Add cooked yolks to mayonnaise and pulse, scraping down sides as needed, until a very thick paste forms. Add shallot, cornichon, and 2 Tbsp. herbs to egg mixture and pulse to combine. Taste and season with more salt if needed.Step 7Transfer egg mixture to a pastry bag fitted with pastry tip of choice, or a resealable plastic bag (snip one corner off to pipe), and chill.Step 8When you’re ready to serve, arrange egg whites cut side down on paper towels and let drain. Turn over and pipe in a generous amount of filling. Drain radishes, pat dry, and place a slice on top of each egg, then sprinkle with more finely chopped herbs.Do ahead: Eggs can be cooked and mayonnaise can be made 1 day ahead. Cover and chill separately.How would you rate Yuzu Kosho Deviled Eggs?Leave a ReviewTell us what you thinkExplore Bon AppétitEggYuzuCitrusFruitStarterVegetarianGluten-FreeDairy-FreeKetoPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Alex Raij"]}