{"id": "09f4d64b9ef4ff835d98959d7a04d6a9", "url": "https://www.bonappetit.com/story/tcm-spring-health-routines", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "7 Wellness Tips for Your Spring Routine, According to Traditional Chinese Medicine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Ways to Reinvigorate Your Spring Routine Using Traditional Chinese MedicineThis season we’re all about good sleep, gentle exercise, and lots of veggies.By Lisa Wong MacabascoApril 22, 2021FacebookTwitterEmailIllustration by Jiayue LiFacebookTwitterEmail“Treat an illness first with food—only if this fails should medicines be prescribed,” famously advised Sun Simiao, the prolific seventh-century Chinese physician and writer. Centuries later, this tenet remains central to traditional Chinese medicine (TCM) practiced today, which is all about creating harmony within the body.We’re all made up of yin (cool) and yang (hot) elements, according to TCM, and their balance is what keeps us healthy. If yang is dominant, yin-promoting foods should be eaten to stave off illness—a hallmark of imbalance—and vice versa. Whether you need more yin or yang in your diet changes with the season; an idea the West has embraced with the rise of seasonal eating. But eating what’s growing near and now isn’t just about savoring ripe produce; it also restores your body’s equilibrium. “Nature will give us what we need to balance out,” notes Adrian Chang, a Chinese American cook and food writer who often grounds his meals in TCM principles.As we gently shed the hibernation energy of winter, Chang says we should be consuming a range of in-season foods, especially those that help clean out the liver—vegetables like leafy or bitter greens, spring carrots, and radishes. The liver needs special attention during this season since it’s working overtime to deliver the vital life force, qi, throughout the body. But Chang cautions that, while food is certainly a central pillar in TCM, lifestyle practices are equally important (and seasonal!) aspects in balancing the mind, body, and spirit; exercise, sleep, and stress reduction all play a role. TCM is “less about a quick fix—and more about nourishing that which is lacking or reducing that which is in overabundance,” he explains.Here, Chang shares seven TCM-backed tips on how to transition from winter and reenergize your spring routine:Get a good night’s rest—but don’t sleep in too late.This means going to bed by around 10 p.m.—definitely before midnight, Chang explains—and rising with the sun. Our bodies don’t need to hibernate anymore like we did to save energy in the winter, but we also want to make sure we are rested for the longer spring days ahead.Take it easy on the exercise.Remember: The seasons are going through a massive change and that affects us energetically and physically. During the spring, it’s best not to shock your system by hitting the ground running (pun intended). Warm up first with gentle exercises that get your heart pumping but are low impact and low stress. “I do a lot of yoga and pilates, and have recently started incorporating tai qi and qi gong into my routine, something my grandfather used to do every morning,” Chang says. “I also do a lot of hiking because I love the mindfulness aspect of being outdoors while getting my blood flowing.”Eat locally and seasonally.“During winter we were eating warming foods, like garlic and ginger, but we can now start to eat cooler foods to balance us out,” Chang says. Stick to what nature offers up: cool-weather spring greens like pea sprouts, mustard greens, and kale, including the flowers as they start to bolt with the warming weather. Check with your local farmers or farmers markets, if you have access to them, and keep to what they are currently growing. If in doubt, opt for leafy greens, lots of vegetables, and whole grains, and you’ll be off to a good start.Eat wild.If you are lucky enough to live somewhere with a lot of greenery, foraging for wild herbs is a great way to reap the benefits of what’s free and abundant all around. Nettles and mugwort emerge at this time of year, and both are used in TCM for treating your liver. Chang also loves to use wild growing yerba buena, an immune-boosting and antioxidant-rich herb with a flavor profile similar to oregano, in pastas and teas. Not confident foraging wild plants? You can also buy herbs from Bay Area shop Herb Folk.Incorporate warm water, tea, or soup at mealtimes.This applies all year-round. Chinese and many other East and Southeast Asian cultures agree that ingesting warm liquids balances your body’s physical and energetic temperature. Cold water is too much of a jolt to the body, but teas and soups (like the Cantonese slow-simmered lo foh tong) are said to balance a meal and aid in digestion.Make rice porridge.Jook, as we call it in Cantonese, is a rice porridge made by slow-cooking rice with chicken stock or water for hours, until it reaches a risotto-like consistency. Typically, it’s served with any number of toppings and sauces, like cilantro, scallions, and chili oil. Chang turns to jook in spring as a way to make rice easier to digest and considers it a perfect vessel for raw or cooked vegetables. (Spinach namul, for example, would be excellent on jook!)Go easy on the booze right now.“Protect your liver at all costs!” Chang reiterates. “We all know how booze can destroy it, so resist the urge to drink all day in the sun on the weekends.” (A tall order, we know.) While not a cocktail replacement, ju hua chrysanthemum tea—the variety typically served with dim sum—is great for your liver. Goji berries too!Explore Bon AppétitHealthyishInterviewsSelf CareSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-22", "author": ["Condé Nast", "Lisa Wong Macabasco"]}