{"id": "0a1b449f4a9f78f9978b318652a463ca", "url": "https://www.bonappetit.com/recipe/peanut-butterpaprika-cookies", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Peanut Butter–Paprika Cookies from Sister Pie in Detroit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssuePeanut Butter–Paprika CookiesBy Lisa Ludwinski, Sister Pie, Detroit, MIOctober 30, 20184.3(10)Read ReviewsTriangleEmailPinterestPrintPhoto by E. E. BergerEmailPinterestPrintEmailPinterestPrint“It was my civic duty to come up with new cookie recipes,” writes owner Lisa Ludwinski in the Sister Pie cookbook, “and my dad’s peanut butter cookie cravings had some influence on the direction I took. Knowing I’d never make just any ol’ peanut butter cookie, my dad teased me with a few ideas. Mission accepted. This cookie’s soft, salty-sweet, chewy center is spiked with smoked paprika and topped with a big pinch of flaky sea salt, raw sugar, and even more smoked paprika. The Peanut Butter Paprika Cookie represents our style at its best: familiar yet new, comforting with a side of adventure.”Reprinted with permission from Sister Pie, copyright © 2018. Photography by E. E. Berger. Published by Lorena Jones Books, an imprint of Penguin Random House.IngredientsMakes 202cups all-purpose flour⅓cup whole wheat flour1½tsp. baking powder1½tsp. kosher salt1tsp. baking soda3tsp. smoked paprika, divided1¼cups creamy peanut butter1cup (2 sticks) unsalted butter, room temperature¾cup (packed) light brown sugar¾cup plus 1 Tbsp. granulated sugar2large eggs, room temperature2tsp. vanilla extract1Tbsp. raw sugar1½tsp. flaky sea saltPreparationStep 1Gently whisk all-purpose flour, whole wheat flour, baking powder, kosher salt, baking soda, and ½ tsp. paprika in a medium bowl.Step 2Using a stand mixer fitted with the paddle attachment, cream peanut butter, butter, brown sugar, and ¾ cup granulated sugar on medium speed until homogeneous and paste-like, about 4 minutes. You will see the mixture change from grainy and wet to fluffy and voluminous.Step 3Add eggs and vanilla and continue to beat until combined, about 2 minutes. Scrape bowl thoroughly with a silicone spatula, being sure to reach underneath the paddle.Step 4Slowly add dry ingredients and beat on low speed until incorporated. If you notice any flour at bottom of bowl, use spatula to fold into batter.Step 5Scrape dough onto a big piece of plastic wrap. Wrap dough tightly and chill at least 24 hours.Step 6Let dough sit at room temperature 2–3 hours before you're planning to bake.Step 7Preheat oven to 350°. Line 2 rimmed baking sheets with parchment. Once dough is pretty darn soft, use a ¼-cup measuring cup or #20 (yellow) scoop to portion dough into 2\" balls. Arrange on prepared pans. Slightly flatten each ball with your palm, then use a fork to create that classic peanut butter cookie design.Step 8Combine raw sugar, sea salt, and remaining 1 Tbsp. granulated sugar and 2½ tsp. paprika in a small bowl. Top each round with about ½ tsp. paprika mixture.Step 9Bake cookies until edges are beginning to turn golden brown and tops no longer look wet, 16–18 minutes. Transfer cookies to wire racks and let cool.Step 10Do Ahead: Dough can be made 3 days ahead. Keep chilled, or freeze up to 3 months. Let thaw overnight before proceeding. Cookies can be baked 5 days ahead. Transfer to an airtight container and store at room temperature.How would you rate Peanut Butter–Paprika Cookies?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThese were amazing! I made a quick batch of peanut butter with dry roasted and salted peanuts I had in the pantry. And I doubled the paprika as per reviewers suggestions. They were so unique. Rich and deep and sweet and salty. I dream about them! LaraNashville, TN1/14/2021Hi, I have a question. What kind of PB should I plan to use for this? the natural stir to enjoy kind or a jar of JIF?ChaseMN12/4/2020Not sure if this breaks a cardinal baking rule, but I only chilled for four hours.  Then rather than wait for the dough to soften before forming, I formed the little patties while it was still cold and firm.  A lot easier and less messy than trying to form without a proper scoop.  Cookies turned out great, in my opinion.  Very possible they could have been exponentially better if I followed the technique to the letter, but for those desperate for a quarantine cookie in less than 30 hours, I think you can get away with it.  AnonymousDC4/17/2020For quarantine/lockdown these unique, delicious cookies come as a sweet relief. They are the perfect balance of salty, sweet, warm, and smoky. All the things. I had to use what we had in the pantry and fridge. That meant white whole wheat instead of APF and bread flour instead of whole wheat. I also subbed crunchy peanut butter instead of smooth, and finely chopped palm sugar instead of raw. It worked! So delicious.AnonymousHerndon, VA3/29/2020Great recipe! I took them out a few min early and they were perfect!!! \n\nI would love to try them again!! I agree that you could push the paprika a bit further if you like. AnonymousRochester NY3/18/2020I switched this recipe up just a bit. I creamed the butter sugar and eggs together for 10-15 minutes than continued on with the recipe. This was a trick I learned to elevate my cookies and it worked perfectly in this recipe. I also added more paprika to the recipe. I would absolutely make this again but add more even more paprika to the recipe and skip the salt on top.AnonymousSan Francisco CA12/2/2018I just made these and they were fantastic!  My friend loves peanut butter cookies and she actually hid the bag of cookies from her husband so he wouldn't eat them all!  I followed the recipe exactly even chilling the dough for 24 hrs. and letting the dough sit for 2-3 hrs. before baking, which was the hardest part because we wanted the cookies NOW!!! :D  I used the kind of peanut butter that you make yourself from one of the machines in the grocery store that simply grinds the peanuts into peanut butter.  No sugar or anything else was added to the peanut butter, just peanuts.  This will be the go-to peanut butter cookie recipe from now on.  As a side note: my friends and I are going to trying to add chocolate chunks to the cookies since we like the chocolate/peanut butter combo.  Fingers crossed they come out delicious!AnonymousWildomar, California11/15/2018I was so excited to try (and taste) this recipe and made them as soon as I had a free weekend! They didn't turn out exactly as expected and I'm not sure what I did wrong. Both the flavor and texture seemed different than described in this article and the instagram stories the Bon Appetit team did about the recipe. The flavor was weaker than expected and the texture seemed \"powdery\" (can't think of a better word to describe it) rather than sticky like cookie dough usually is. They were very oily feeling, but when bitten into they crumbed very easily. I wonder if it's the peanut butter I used? Trader Joes brand — perhaps I should have gotten a classic like JIF? I will be trying this bad boy again cause the flavors just seem fabulous.AnonymousElkridge, MD11/6/2018Explore Bon AppétitCookieDessertPeanut ButterCondiments, Sauces & PastesPaprikaHerbs & SpicesBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Lisa Ludwinski", "Sister Pie", "Detroit"]}