{"id": "0a1df92d7ed66d3054084a6dadf605c8", "url": "https://www.bonappetit.com/recipe/pork-chops-with-broccoli-salsa-verde", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Pork Chops With Broccoli Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssuePork Chops With Broccoli Salsa VerdeBy Andy BaraghaniApril 20, 20215.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintBroccoli stems have radish-like crunch and sweet flavor but all too often get discarded. Here they get charred just until they’ve slightly softened, then finely chopped and tossed with briny olives, herbs, vinegar, and olive oil to make an assertive sauce for pork chops (or halibut, cod, or steak).Ingredients4 Servings3small heads of broccoli (about 1½ lb. total)2tsp. fennel seeds1½tsp. sugar21\"-thick bone-in pork rib chopsKosher salt2–3Tbsp. plus ¼ cup extra-virgin olive oil1small garlic clove, finely grated½cup Castelvetrano olives, crushed, pitted, coarsely chopped¼cup finely chopped parsley2Tbsp. white wine vinegar1tsp. finely grated lemon zestFreshly ground black pepperSpecial equipmentA spice mill or mortar and pestlePreparationStep 1Trim 1\" from bottom of broccoli stems, then peel. Remove stalks from crowns; set crowns aside for another use. Cut stalks in half lengthwise and set aside.Step 2Finely grind fennel seeds in spice mill or with mortar and pestle. Transfer to a small bowl and mix in sugar.Step 3Season pork chops all over with salt, then rub with fennel mixture. Let sit at room temperature 30 minutes, or, if you have the time, chill overnight.Step 4Pour 2 Tbsp. oil in a large cast-iron skillet over medium-high. Cook pork chops, without moving around but pressing down with tongs to ensure meat is in direct contact with pan, until golden brown underneath, about 2 minutes. Turn pork chops over and cook until other side is golden brown, about 2 minutes. Continue to cook, turning about every minute or so, until chops are deep golden brown on both sides and an instant-read thermometer inserted into the thickest part registers 135°, 6–8 minutes. Transfer pork chops to a cutting board and let rest 10 minutes before serving. Reserve skillet.Step 5There should still be some oil in reserved skillet; if not, add 1 Tbsp. oil and place skillet over medium-high. Add broccoli stems and cook until lightly charred, about 2 minutes per side. Transfer to a cutting board and let cool 3 minutes, then coarsely chop (about ½\" pieces).Step 6Transfer broccoli pieces to a medium bowl and add garlic, olives, parsley, vinegar, lemon zest, and remaining ¼ cup oil. Toss well to combine and season broccoli salsa verde with salt and pepper.Step 7To serve, carve pork chop meat away from bones, then slice meat against the grain ½\" thick. Divide slices among plates and spoon some broccoli salsa verde on top.How would you rate Pork Chops With Broccoli Salsa Verde?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSomewhat confusing.\nDo you trim the 1\" cut off?\nTWAV8Rcoastal Alabama11/13/2021Explore Bon AppétitPork ChopPorkMeatBroccoliVegetableWeeknight MealsMainNut-FreeDairy-FreeGluten-FreeKetoSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Andy Baraghani"]}