{"id": "0a2ef2c71f54dadb944f20ab44c40e92", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/33-acres-brewery", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "33 Acres Brewery Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouver33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryFacebookPinterestTwitterEmailGrant HarderGO HERE: for 33 Acres Brewery’s finely crafted beer (and food) in a bright minimalist space that wouldn’t look out of place in Venice, California.ORDER THE: beer, of course. Brewmaster Dave Varga makes clean, nuanced original beers, like the beautifully hopped Ocean (a west coast pale ale) or the ripe and fruity Euphoria (a Belgian Tripel). Once you’ve downed a pint or two, get the pan-fried pierogies, kettle chips and dip, “Loaded” (a.k.a. ham, egg, and smoked cheddar biscuit sandwich), the crispy cauliflower and mango salad, and a plate of waffles, if you’re there on the weekend.THE VIBE IS: far more L.A. than Vancouver, where everything is sunlit and white, with just the right number of plants. Owner Joshua Michnik is a photographer and designer, so you’ll see a lot of 33 Acres merch proudly worn throughout the city.PRACTICAL STUFF: Open every day: Monday to Friday, from 9 a.m. to 11 p.m.; and Saturday and Sunday, from 10 a.m. to 11 p.m. (brunch ends at 2 p.m.). No reservations.—Lindsay AndersonGrant HarderGrant HarderExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-14", "author": ["Lindsay Anderson"]}