{"id": "0a2e17e859834ce1ef56fa4d3af06ab6", "url": "https://www.bonappetit.com/story/chani-nicholas", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Chani Nicholas Falls Asleep to Whipped Cream and Cricket Sounds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhipped Cream and Cricket Sounds Help Chani Nicholas Fall AsleepThe cult astrologist also isn't immune to the charms of The Great British Baking Show.By Kristin BraswellJanuary 25, 2019FacebookTwitterEmailPhoto by Graham WalzerFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Chani Nicholas was only 12 years old when she got her first astrology reading. “I felt like the woman reading my chart was speaking a language I knew but had never heard before,” says the Los Angeles-based astrologist, now 42. “I’ve been learning about astrology ever since.”Today, reading your horoscope is less about flipping to the back pages of glossy magazines in search of insight into your crush and more about joke memes and discussions about how your sign will affect your mental health in any given month. In this trendy, online cosmic playground, Nicholas has taken astrology in an even new direction, using horoscopes as a call to action for social justice and compassion.“To me everything, every occupation, every interaction is a call to love, which is justice. Socially, if we aren’t trying to create spaces where love, and therefore justice, can occur we are doing the opposite. And we don’t need anymore hate, intolerance, or injustice here.”Chani Nicholas’s horoscopes have celebrated the appointment of Alexandria Ocasio-Cortez and other women in Congress and called on readers to support transgender communities. She also believes in making astrology accessible beyond the internet, providing free or low-cost readings and workshops for people who need support but may not have the means. “Art and care should be part of our everyday lives, accessible, and integrated into all we do,” she says.This belief in uplifting community is a family affair. Her wife, Sonya Passi, runs FreeFrom, which works to make safety affordable for all survivors of domestic violence so that they can build lives free from violence for themselves and their children. Later this year, HarperCollins will publish Nicholas’ book, You Were Born for This: Astrology for Radical Self-Acceptance, on how people can understand their life purpose through an astrological lens. Besides working on the book, Nicholas still posts horoscopes and calls to action daily. Here’s what she does when she gets some much-needed down time.Nicholas' truly balanced skincare routine.\nPhoto by Graham WalzerPillow TalkMy wife and I usually have a long talk before bed. It’s relaxing to sort through the day with each other, making sure that we have some quality time to connect once the business of the day has passed. If something is bothering one of us, we’ll generally stay up until it’s sorted through as much as possible. We also tend to wake up and talk about the dreams that we had the night before if we have time. I feel like sleep and dreaming is such an important place to process the events of our waking lives. We both have a very active dream life and are constantly referring to them as the events of the day unfold.Netflix and PopcornWhen I’ve had a hard day I watch The Great British Baking Show on Netflix until it asks me “Are you still watching?” When my wife leaves for long stretches of time I usually lose my will to eat a grown-up dinner and instead have popcorn with butter and Spike seasoning salt. When she’s gone, I also lose all sense of an appropriate bedtime and end up watching too many Beyoncé clips on Instagram.  If I’m really wound-up, I end up making memes, most of which are too bad to see the light of day. My go-to comfort food is whipped cream. If I’m run down and ragged I need fat. Lots of it. I could probably live on English trifle.Hydrate, Hydrate, HydrateMy pre-bedtime skin routine is a must. In my twenties I never paid much attention to what my skin needed but now I feel like a desert monster if I don’t hydrate. I use Coconut and Rose soap to wash my face, Rose Hydrating Mist to hydrate it and Pure Passion to moisturize.  If I’m stressed I’ll put on Keep Calm. All products are handmade, completely natural, and made by entrepreneurs at Gifted by FreeFrom.The colorful bookshelves that line Nicholas' L.A. home.\nPhoto by Graham WalzerThe Reading ListIf I’ve got the head space, I’ll read before bed. Right now I’ve got a bunch of books going. If They Come For Us by Fatima Asghar, Decolonizing Wealth by Edgar Villanueva, Little Fires Everywhere by Celeste Ng, and Bright Lines by Tanwi Nandini Islam.Hypnosis by CricketsI’ve recently started to not eat after 6 or 7 p.m., and I feel like it’s helping me to transition from my day to night routines. There’s less work for my body if I stop eating before I sleep and I’m a big night snacker so it’s been a big change for me. I drink a lot of water after I stop eating and take magnesium and melatonin before bed. I’m super sensitive to sound so we put on “Crickets by the Ocean” by Cricket Sounds on repeat to drown out some of the city noise and generally signal to our bodies that it is time to wind down. It’s kind of like hypnotizing ourselves.Explore Bon AppétitHealthyishGoing to Bed withprofileRead MoreLifestyleAmy Quichiz Makes Her Bedroom Into a Dance Floor Before Going to SleepBy Neha KulshRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-25", "author": ["Condé Nast", "Kristin Braswell"]}