{"id": "0a4769cfe9139d4489cd2e2627893fc4", "url": "https://www.bonappetit.com/story/caffeine-free-tea", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "The Caffeine-Free Tea That Helps Me Focus More Than Coffee Ever Could | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Caffeine-Free Tea That Helps Me Focus More Than Coffee Ever CouldTotal focus, zero caffeine hangoverBy Claire MargineApril 2, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI can drink a dangerous amount of coffee. After the third cup, it just tastes like piping hot, freshly roasted brown water and gives me nothing but the promise that I will jump halfway across the room if you tap me on the shoulder. After hitting a coffee wall for the zillionth time, I knew I had to explore some caffeine-free tea options. So I embraced focus teas, a genre of beverages that promise to make your brain dangerously sharp and able to retain and recall data like a sponge with a MacArthur Genius grant. I was expecting the hyper-caffeinated options to stick out when I waded into this world of tea. But a caffeine-free stunner, with an extremely on-the-nose name, demolished my distractions and stole my focus-craving heart.Get Smart from The Republic of Tea tastes like a boiled slice of that dried cranberry loaf cake that everyone crushes on around Thanksgiving. It’s not sweet but it’s definitely fruity, with tea bags that smell like a flavored drugstore lipgloss or a very pungent Bath and Body Works lotion. I know none of this sounds appetizing (though, honestly, boiled cake could be a solid flavor), and I’m giving you this warning because I am not a huge fan of teas that taste like much more than, well, tea. But I’m hooked, perfumey scent and cranberry-spiked flavor aside. This is a tea tailor-made for 2:00 p.m., when every link becomes enticingly clickable and every snack seems like an equally brilliant and urgent idea.A few cups of Get Smart turns off the volume on my distracted internal monologue by taking the opposite approach of coffee or energy drinks. The blend of circulation-boosting, memory-improving, and stress-reducing ingredients encourages you to relax your way into focus instead of trying to gulp lightning and up your heart rate to get you to the finish line. If you’re already a distractible sort, like me, sometimes you don’t need more energy. You need to calm the energetic storm that can lead you straight to exhaustion.Gentle, toasty rooibos is the backbone of Get Smart. It drinks more like a black tea than your average tisane. Next up is eleuthero, one of those enticing adaptogens you’ve been reading about that’s used in Chinese medicine to increase energy and strengthen stamina. Gotu kula can increase circulation and is used in ayurvedic medicine to treat anxiety and fatigue. Ginkgo and rosemary are linked to improved memory, while earthy hibiscus is known for reducing blood pressure.Two months of afternoon Get Smart sessions have sharpened my mental edges and given me a boost when I’m already flowing. They’ve gotten me to do the seemingly impossible task of turning brain fog into a stack of completed work. And they’ve given me yet another opportunity to reduce my absurd coffee intake so that a cup or two in the morning becomes effective again. It’s like a weird productivity Christmas. Bottoms up.Buy it: Get Smart tea, $11 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishTeaShoppingRead MoreshoppingThe Drink That Helped Me Quit Coffee Once and For AllBy Claire MargineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-02", "author": ["Condé Nast", "Claire Margine"]}