{"id": "0a64c434661817c3e3b33b2ff0a5be3e", "url": "https://www.bonappetit.com/story/crispy-english-roast-potatoes", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "These English-Style Roast Potatoes Are Impossibly Crispy on the Outside, Creamy on the Inside | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese English-Style Roast Potatoes Are Impossibly Crispy on the Outside, Creamy on the InsideWe call them golden potato nuggets, and they are our favorite Thanksgiving recipe this year.By Alex BeggsNovember 6, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmail“Best food that ever came from England.” That was Brad Leone’s review of Chris Morocco’s Thanksgiving recipe for burnished potato nuggets, our, um, jazzed-up name for English-style roast potatoes, a classic dish served with a big roast, Yorkshire pudding, a roasted vegetable of some kind—the whole spread. They’re perfect because they take on an impossibly crispy coating on the outside while remaining steamy-creamy and light inside.Whatever you choose to call them, not enough Americans are cooking their potatoes this way. And Chris, whose wife is from Somerset, England, (and makes her potatoes by heart, something we should all aspire to) knew he needed to bring them to BA. What better occasion to do so than Thanksgiving? After all, the same thing that makes them ideal during a roast (you know, the fluffy insides for soaking everything up) makes them a perfect pairing for gravy. “There's something about that rich, smooth gravy on top of a crispy potato—you'll see.” They immediately became the entire staff’s favorite Thanksgiving issue recipe. “GOLDEN NUGGETS!” was the internal office nickname.To get ‘em right, it’s all about technique, which has three parts. Let’s talk about them.1. Par-Boil the TatersFor around 10 minutes. This gives the potatoes a head start in the cooking process and means we’ll get a delightfully light and fluffy interior later.2. Rough Them UpAfter you drain the water, you toss the potatoes about to “rough them up,” aka rubbing starch all over the exterior. That starch will be like flour in the oven, and when it soaks up the oil, it’ll create that thick, crispy coating with a “pronounced crunch,” as Chris puts it.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen Kaminski3. Sauté Them…in the OvenIn a roasting pan, you combine olive oil (or something extravagant like duck fat!!), which adds flavor, and vegetable oil, which lowers the olive oil’s smoke point, and heat it in the oven for 10 minutes. A HOT oven, people. 425°. Some commenters noticed that their potatoes weren’t browning, which means their ovens needed a crank up. Ovens can be tricksters, running higher or lower than what we set them to, a good case for an oven thermometer—or use your instincts and keep a close eye to adjust accordingly. (You can also use the convection mode on your oven, if you have it, which will circulate the heat more and cook them faster.)The roughed-up potatoes go into the hot oil, get tossed to coat (CRISPY SECRETS, REVEALED!), and then roast for around 40 minutes. During that time, keep tossing continuously, every 10 minutes. If it feels like you’re sautéing and you’re wondering why we’re even doing this in the oven, well, let me tell you: browning the potatoes slowly in the oven lets their flavor develop, the oven also allows you to roast a TON of potatoes and get an even, steamy heat that results in that light, creamy interior. (See also: Basically’s crispy roast potatoes). Doing this on the stove would also be a splattering mess.In the final 10 minutes of roasting, Chris adds in garlic and rosemary to flavor the potatoes even more—it’s Thanksgiving, after all. Then serve and eat them right away. Unlike many of our other recipes for the holiday this year, this is not a make-ahead recipe, and the French Fry Law very much applies: A cold fry is never preferable to a hot-out-of-the-oil one. So plan accordingly.Get the recipe:Burnished Potato NuggetsBehold, your new standard for roasted potatoes: puck-size oven fries with creamy insides and unimaginably crunchy exteriors.View RecipeExplore Bon AppétitThanksgivingPotatoEnglishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Alex Beggs"]}