{"id": "0a68bff0709d43315c5c3ba4a5bc6e70", "url": "https://www.bonappetit.com/recipe/roast-beef-tenderloin-with-garlic-and-rosemary", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Beef Tenderloin Roast With Garlic and Rosemary Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2016 IssueRoast Beef Tenderloin With Garlic and RosemaryBy Chris MoroccoMarch 5, 20214.7(27)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIn this beef tenderloin roast recipe, the meat is seasoned with a garlic and rosemary paste, then seared in a cast-iron skillet (we like this one), and finished in a low oven. High-heat searing builds deep flavor by browning the well-seasoned exterior, while low-temperature (250°) roasting creates an evenly cooked, juicy interior with little risk of overcooking. It’s truly the best of both worlds. But it gets even better when you top off these thick slices of medium-rare beef with a tangy horseradish yogurt, a drizzle of rosemary infused butter, and a hearty sprinkle of salt. Luxurious as is, might we suggest pairing with a side of our very best, extra creamy mashed potatoes?With minimal prep but some patience required, this simple recipe is perfect for a leisurely weekend or special occasion dinner. That said, make it an ambitious weeknight dinner by planning ahead and taking care of the bulk of work in advance. From there your beef tenderloin will be ready in 40 minutes or less.Editor’s note: This recipe was originally published on November 15, 2016.Ingredients8  servings2garlic cloves2tablespoons rosemary leaves, plus sprigs14-pound trimmed center-cut beef tenderloinKosher salt, freshly ground pepper1tablespoon vegetable oil1cup plain whole-milk Greek yogurt⅓cup sour cream2tablespoons prepared horseradish½teaspoon finely grated lemon zest3tablespoons unsalted butterFlaky sea salt (for serving)PreparationStep 1Thinly slice garlic, then mash into a paste using the side of a chef’s knife. Scatter rosemary leaves over garlic; finely chop and mix into garlic. Slice tenderloin in half crosswise to create 2 smaller roasts. Season generously with salt and pepper; rub with garlic-rosemary paste. If your butcher didn’t already tie the roast for you, this is the time to do it: Place tenderloin onto lengths of precut kitchen twine spaced about 1\" apart and tie closed snugly. Place on a rimmed baking sheet and chill uncovered 12 hours.Step 2Let tenderloin sit at room temperature at least 1 hour and up to 2 hours before cooking.Step 3Preheat oven to 250°. Heat oil in a large ovenproof skillet over medium-high. Add tenderloin and cook, turning occasionally, until well browned all over, 8–10 minutes. Transfer skillet to oven and roast tenderloin, turning every 10 minutes or so, until an instant-read thermometer inserted into the thickest part registers 120°, 25–30 minutes. Transfer tenderloin to a cutting board and let rest 15 minutes before removing kitchen twine and slicing. Reserve skillet.Step 4Meanwhile, mix yogurt, sour cream, horseradish, and lemon zest in a small bowl to combine; season with salt and pepper.Step 5Cook butter and rosemary sprigs in reserved skillet over medium heat, scraping up browned bits on the bottom, until butter is melted and very fragrant, about 4 minutes. Transfer sliced tenderloin to a platter; drizzle with rosemary-infused butter and sprinkle with sea salt. Serve with horseradish yogurt.Do Ahead: Tenderloin can be seasoned and chilled 2 days ahead; wrap in plastic wrap after 12 hours. Horseradish yogurt can be made 1 day ahead; cover and chill.Nutrition Per ServingCalories (kcal) 640 Fat (g) 50 Saturated Fat (g) 21 Cholesterol (mg) 160 Carbohydrates (g) 3 Dietary Fiber (g) 0 Total Sugars (g) 2 Protein (g) 42 Sodium (mg) 150How would you rate Roast Beef Tenderloin With Garlic and Rosemary?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleSorry! i made a mistake! I don't know how to fix it! i meant to give it 5 stars not 4!Godzilla9/21/2021Excellent recipe.  My husband and I seared the meat on our barbecue to avoid splattering our stovetop and then a big cleanup.  After the sear, we placed the meat on a rack in a disposable  aluminum foil pan to roast and it turned out perfect.  The smaller piece was a little more well done which was perfect because some people at our dinner table have that preference.AnonymousBucks County, PA12/26/2020250F is not going to cook beef tenderloin to an internal temperature of 120F in 30 minutes, even after browning.\nYou need to cook at a higher temperature.SKHarvard, MA12/25/2020Just made this and it was fantastic! Definitely cut the meat into two pieces and take the time to brown properly. The only thing is that cooking the tenderloin to 120 degrees internally left the meat quite raw. We had great medium-rare results at 130-135 degrees internally.Anais HayesWashington, DC12/25/2020I made this recipe for Christmas dinner and it was fantastic!  Most tenderloin recipes call for roasting on a rack.  I've tried many variations but this recipe beats all of them.  Cutting the tenderloin into two separate roasts and searing them in the skillet first before roasting really made the beef very tender.  There was enough flavor with the garlic, rosemary and salt and pepper, so I didn't need the horseradish sauce.  I made an au jus from the pan drippings.  The beef was so tender, we could cut it with a fork. ABHouHouston1/2/2020Tried this recipe yesterday. It was fabulous. So tender with lots of flavor ShirleyPOhio12/26/2019My fiancee and I made this recipe when we came across some un-trimmed beef tenderloin on sale at our local store. It turned out absolutely fantastic! We didn't have a skillet so we used a pre-heated oven dish as mentioned in the video and it worked wonderfully. This dish scaled down well, 400g piece, as a dinner for two. Nick_allenOntario, Canada11/28/2019I made this for 8 guests on Christmas and it came out awesome!  Most of my guests likes medium rare to rare and a couple medium well so I cooked 1/2 of the tenderloin a bit longer.  I ended up skipping the infused butter as the steak already had so much flavor.  I’ll be using this recipe again 👍AnonymousSt Louis 12/28/2017Explore Bon AppétitBeef TenderloinBeefMeatYogurtOther IngredientsEasyMainGluten-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-11-09", "author": ["Condé Nast", "Chris Morocco"]}