{"id": "0a6a73e11d293947b585e000b66569c4", "url": "https://www.bonappetit.com/recipe/chocolate-buckwheat-cake", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Chocolate Buckwheat Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueChocolate Buckwheat CakeBy Roxana JullapatJanuary 12, 20214.2(50)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“This is my favorite gluten-free cake,” writes Roxana Jullapat in her cookbook Mother Grains (out April 2021). “I always make it when I’m cooking for friends who avoid wheat. The crumb is light and airy, and its intense chocolate flavor shines alongside buckwheat’s earthy tobacco undertones.” Serve as a warm or room-temperature dessert with a sprinkle of confectioners’ sugar and a generous dollop of whipped cream.Ingredients8 - 10 ServingsSponge1tsp. instant yeast½cup (63 g) buckwheat flour1Tbsp. honey, preferably buckwheatCakeNonstick vegetable oil spray4large eggs¾cup (135 g) bittersweet chocolate chips½cup (1 stick) unsalted butter, cut into pieces¼cup (25 g) Dutch-process unsweetened cocoa powder, sifted1Tbsp. vanilla extractPinch of kosher salt½cup (100 g) granulated sugar, divided2Tbsp. powdered sugarspecial equipmentA 9\"-diameter springform panPreparationSpongeStep 1Place ¾ cup lukewarm (98°–105°) water in a medium bowl and sprinkle yeast over. Whisk in buckwheat flour and honey. Cover with a kitchen towel or plate. Let sit at room temperature until surface of sponge looks frothy with big and small bubbles across the top, about 1 hour.CakeStep 2Place a rack in middle of oven; preheat to 350°. Coat pan with nonstick spray. Separate yolks from eggs over a large bowl to catch egg whites. Place yolks in another small bowl; set egg whites aside. Combine chocolate and butter in a medium heatproof bowl and set over a medium saucepan of simmering water (do not let bowl touch water). Melt chocolate, stirring occasionally, until smooth. Remove from heat and whisk in cocoa powder, vanilla, salt, and ¼ cup (50 g) granulated sugar. Add egg yolks one at a time, whisking until smooth after each addition. Stir in sponge.Step 3Add remaining ¼ cup (50 g) granulated sugar to bowl with reserved egg whites. Using an electric mixer on medium-high speed, beat until soft peaks form, about 4 minutes. Fold half of egg whites into batter until smooth, then fold in remaining egg whites until just combined. Scrape batter into prepared pan and smooth surface.Step 4Bake cake, rotating pan halfway through, until a tester inserted into the center comes out clean, 40–45 minutes. Let cake cool in pan. Run a paring knife around edges of cake, then unmold and place on a plate. Dust with powdered sugar just before serving.Do ahead: Cake (without powdered sugar) can be made 1 day ahead. Store tightly wrapped at room temperature.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Chocolate Buckwheat Cake?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleThis was fabulous. I made half the recipe in a 6 inch springform. I probably over baked a tad and next time would start to check at 25 min instead of 30. It is moist and chocolate-y without being too heavy, just dense  enough\nAmyBoston, MA3/6/2022Possibly the best BA recipe so far! I followed the recipe and got a super tasty, light and airy cake. I just bumped up the chocolate chips to a full cup \"by accident\" ;-), and accidentally spilled one egg white in my yolks while separating. Will make again, and again, and probably some more!Alain GauthierNepean ON3/3/2022Not reviewing yet, but getting ready to bake. Just checking before I get started:  1/2 cup buckwheat flour is the entire flour amount in the cake??? Is this really correct? Chicago bakerChicago1/7/2022Best GF cake!  It was a big hit even with people who eat gluten.  I was a little concerned about making the sponge but it turned out exactly as described in the recipe.  Used Guittard chocolate and Ghirardelli cocoa.  In think cooking time cook be 35mn instead of 40.Laurence PMiami, FL11/21/2021I followed the suggestion to add a little finely ground coffee. I don't know if that was the reason, but contrary to many people's comments, we found it had plenty of chocolate flavor. Used Whole Foods dark chocolate chunks and TJ's cocoa powder. Definitely a keeper. DavidTucson, AZ10/12/2021great recipeAnonymousMorganville, NJ5/27/2021After reading the reviews, I decided to make this cake and add a tablespoon of espresso and 1/4 tsp of salt to bring out the chocolate flavor and I have it say I think it was delicious! Being an avid baker, I wasn’t deterred by all the steps. It wasn’t difficult, it just took a bit of time. I thought I might have burned the cake because the edges seemed pretty dark when I took it out, but it was perfectly baked. A GF winner for sure!EbanasRhode Island 4/5/2021I made this for friends and can’t stop eating the leftovers for every meal. The cake is light with a lovely not too rich chocolate flavor. I used 1/2 unsweetened bakers chocolate and 1/2 bittersweet chocolate with almonds to melt with the butter. The chopped almonds added a nice crunch. To serve I made whipped cream with cherries mixed in for a Black Forest variation! StephanieSanta Fe 2/22/2021This was a fun recipe to make (ie, glad I did it once, as someone who enjoys baking), though the end product did not wow. I used Guittard semisweet chips + dutch-process cocoa and thought the chocolate flavor was a little muted, though not bland, and I was so excited for the buckwheat flavor to come through (there's an incredible aroma when you mix the sponge -- I had my family gather around to smell it), but you can't taste that very much either in the final cake. If you're used to fudgy rich chocolatey desserts, this is not it. The texture of the cake is pretty delightfully airy and light and soft and moist, like a cake-mousse cross. I baked mine for 42 minutes and saw that the edges of the cake had pulled away from the pan and were a little burnt. Once it cooled, it had collapsed and slumped. LinSacramento, CA2/18/2021The deep chocolate, combined with the nuttiness of the buckwheat made this light-textured cake a winner. It is a multi-step, involved recipe, so it’s not one I’d choose to whip up quickly, but on days when I want to put on music and lose myself in measuring and mixing my way to a warm chocolate cake, this is a winner.MichelToronto2/15/2021I really enjoyed this cake and love what buckwheat can do in baked goods. Other reviewers complained that this was not chocolatey enough, but I used 70+% dark chocolate and dutch process cocoa and found the chocolate flavor to be really deep and pronounced. This is a grown up cake - sleek, classy, rich, unadorned. I've been enjoying it alone or with some coffee mascarpone cream and it's great. HOWEVER, I gave this 3 stars for a couple reasons.. first, this was a pretty complicated recipe for a fairly plain cake. Don't get me wrong, I love a good project, but I was a little miffed by the amount of bowls I had to clean.. the sponge, the egg whites, the drys, the wets.. just to have a fairly simple chocolate cake. Second, the cake is not as great the next day.. the delicate souffle-like texture turns kind of dry that was a little disappointing.KamLos Angeles2/11/2021I loved this cake but I think that had I used straight buckwheat flour it would have been too bitter.  I used buckwheat pancake mix which is all I had. I used one bar of Lindt 70% chocolate and 35 grams of Ghirardelli bitter sweet chocolate chips. Great moist chocolatey cake easily lasting 2 days.AnonymousIthaca NY2/2/2021You would never know you are missing gluten in this cake.  It is a bitter dark chocolate cake and it is delicious.  I need to make some whipped cream, as I didn't have that, or powdered sugar but it is still a beautiful cake.  Bravo!Nancy ISanta Barbara, CA1/27/2021Excellent, interesting texture but flavor was meh at best. Overall, pretty disappointing.BrookeOmaha, NE1/26/2021MMMM! Okay, so if you love the flavor of real chocolate- that earthy bitterness with some slight sweetness, matched with the flavor of buckwheat flour and yeasty flavor, this cake is for you. It WAS a crowd pleaser and sooooo good on its own. I served it with ice cream but most preferred it on its own. also had some with coffee for breakfast and so so good. MAKE IT. Leslie CEverett wa1/24/2021Explore Bon AppétitCakeDessertBuckwheatFlourCocoaOther IngredientsYeastGluten-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}