{"id": "0a72a9e39a9582e2e66065a5ef9854e7", "url": "https://www.bonappetit.com/story/taking-care-of-dad", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "I’m 25 and Taking Care of My Sick Dad. I’ve Never Felt Less Alone. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI’m 25 and Taking Care of My Sick Dad. I’ve Never Felt Less Alone.Other people my age are realizing, suddenly, that their parents are mortal too. By Chace BeechMay 5, 2020FacebookTwitterEmailIllustration by Sofie BirkinFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.Like a lot of people in their early twenties, I’m at my parent’s house right now. I’m sleeping in my childhood bedroom surrounded by well-worn Harry Potter books, dusty stuffed animals, and vintage posters I tacked up in high school. And, like most 25-year-olds I know, I’ve spent the past month listening to reports about this novel coronavirus that is deadliest for those over 65 and worrying about my parent’s health.But unlike those who just moved home to wait out COVID-19, I’ve been home for the last two years. I’m taking care of my dad, who has brain cancer. Despite the trappings of childhood around me, the roles in my house are reversed. And it’s strange, but the pandemic has offered me something unexpected. As it’s unfolded, as people my age have fled home, anxious about their own parents’ health—I have often felt less alone than I have in a very long time.I knew my childhood was over when I got the call from my mom two years ago. “Daddy is in the ICU,” she said. “He has a brain tumor.”Youth, unbridled freedom, a life without deep anxiety: When I hung up the phone I thought, “All that is over.” And it was.I was 23 years old and living in New York City. I had a promising job at a big TV network, which I hoped would begin a brilliant career in media. I ate big lunch salads and walked around Midtown feeling self-assured and optimistic. I had an apartment and a boyfriend, and I believed, like most people do at that age, that my parents would live forever.After I got the call, I left New York and went directly home to Los Angeles to see my dad. He was in the intensive care unit at UCLA. I didn’t know how long I'd be home.For the next few months, as I visited hospitals and rehab centers with my dad, my New York life dissolved piecemeal. I went back to pack up my apartment. All my coats, sweaters, and winter shoes—useless in California’s perennial, deluding sunshine—went into a far corner of a closet, not to be touched again.Chace and her dad in 1996\nPhoto courtesy of Chace BeechMy leave of absence from work turned into a resignation. My boyfriend and I broke up after six years, over the phone. At that point, my heart was already so fractured that I barely felt anything. I hung up, cried, and drove to pick up my dad from his weekly physical therapy appointment.Over the course of the first year, my dad’s condition worsened. Brain cancer can affect everything. In my dad’s case, it has. Nothing is the same. Once a steady, solid man who could fix roofs, rewire a burst fuse, and bike for miles, he now uses a wheelchair and his speech is slurred. At 69 years old, even his regular movements are jolty, and his vision is distorted. Eating is difficult. He had a feeding tube for a while, but it got infected, a side effect of his medications.My mom and I look after him along with a rotation of caregivers. My sister, who is still an undergrad in college, comes home to help over breaks. Two days a week, I drive my dad to physical therapy. Three times a month, we go to the hospital for treatments and checkups. I spend a lot of time moving him from his wheelchair to an armchair to the car.Chace and her dad at the Getty Villa in Los Angeles in 2019\nPhoto courtesy of Chace BeechI have developed many new skills over the last two years. I know how to measure tube feeding formula by pouring the pink, sticky, predigested liquid into a funnel so it won’t splash. I know how to inject heparin shots without leaving a bruise. I know what questions to ask if a medical problem arises: Are you in pain? Can you squeeze both my hands? Can you count to ten? What’s your name? What’s my name?I wasn’t very concerned about COVID-19 at first. Generalized anxiety can have a numbing effect. The flu was always a risk for my dad, as were colds, cuts, a cough, a bruise. Everything is scary. COVID-19 didn’t feel particularly special.And, at first, the world seemed to feel the same way. Classes continued. My peers, most of whom don’t live with their parents, seemed unconcerned.In early March that changed. It was clear by then who was most at risk. According to the CDC, 80 percent of people who have died from coronavirus were aged 65 or above. Those at the highest risk of complications associated with the disease are “older adults with serious underlying medical conditions like diabetes, lung cancer, or heart disease.” Weakened immune systems, cancer patients. My dad ticked every box.Around the same time, I noticed that the dialogue coming from people my age had shifted. They were worried. They were going to their parent’s homes to “ride out” the pandemic. Some on Twitter complained that their parents weren’t taking proper precautions and wouldn’t listen to warnings. Others were doing the shopping to keep their parents off the streets. They were distancing in order to keep the “adults” safe.I wanted to talk to them, to hear how it was for others to realize, suddenly, that their parents were mortal. I reached out to 20-year-old Mia Bongardino. I’d read about her “social-distancing-style” dinners with her dad after one of her Tweets went viral. The college junior had quarantined herself in her bedroom after spending a (truncated) semester abroad in Italy.She told me how COVID had changed the dynamic between her family. “Usually they are the ones protecting me from everything,” she said. “Even the idea of [COVID-19] being a fatal illness to them wasn’t something I had thought about before.”When I called my friend Hannah, she was waiting in a grocery store line to buy her parents food. She said COVID-19 had changed how she saw her role as a daughter. “I’m 25 and I feel like I absolutely have to start taking care of my parents now,” she said.A lot changes in our brains in our mid-twenties. “Twenty-five is the tipping point for consequential thinking,” Dr. Julie Cederbaum, a professor of Social Work at USC, told me. “The majority of humans before that age just don’t have a ton of consequential thinking,” she said. “For some young people, this [worrying about parents during the pandemic] is the first high-level consequential thinking they have had to do. All of a sudden people are looking at their parents and seeing their behavior as risky.”This role reversal, when young people begin taking care of and protecting parents, is strange and uncomfortable and deeply formative. After my dad got sick I felt unprotected, like a turtle without a shell; like a turtle who didn’t know the shell had been there until it wasn’t.Sometimes I feel like a victim. Friends and extended family like to look at me with pity or amazement. “I’m so sorry,” they say, or “you’re so brave” or “this must be so hard.” Sometimes I believe them. But I'm not a saint (as anyone who has met me will attest—including my dad!). My decision to move home and care for him was driven by fear as well as love. The two get muddled.Since the quarantine began, my dad’s life hasn’t changed too much. Every day we take the same walk as always. He wears the same wide-brim straw hat. I wear my quarantine uniform: an oversized sweatsuit, bright stripy socks and old grey sneakers. We make quite a pair. When neighbors see us coming they make an effort to swing well away, even more than the suggested six feet.This gesture, the way our neighbors step away, is a small example of this puzzling reality we’re all facing: in order to stay safe we must stay away; we stay away in order to remain, in a way, together. If we are afraid enough of one another, or for one another, we may be able to save each other. Love and fear, distance and solidarity have never been more obviously conjoined.Which is why I feel closer to other people my age than ever. We are experiencing the same fear, the same particular type of love. The kind you don’t often fully understand until loss bumps up against it.I worry about my parent’s health because I love them. I feel alone on this island of parental anxiety because I can’t bear the thought of losing them.I never wanted anyone to arrive at my specific port of anxiety earlier than they had to. I wouldn’t wish it on anyone. Right now, though, I can see several boats on the horizon. And even if they pass, which I hope they do, I admit it’s been nice not feeling quite so alone here.Explore Bon AppétitHealthyishCoronavirusessayRead MoreCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomBy Phillip PicardiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-05", "author": ["Condé Nast", "Chace Beech"]}