{"id": "0a7deb9b212c387d0227bd069a5ad434", "url": "https://www.bonappetit.com/story/white-stuff-on-salmon", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "That White Stuff on Salmon...Is it OK to Eat, or Nah? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingUmmm, What's That White Stuff on Salmon?Is it safe to eat? Or nah?By Alex DelanyAugust 1, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailThat white stuff coming out of the salmon fillet you're cooking won’t kill you. You’re not going to come down with a case of Salmon Goop Poisoning (which, to be honest, would be a pretty lame way to kick the bucket). But what is that white stuff, anyway? And why is it there? Well, to start, let’s learn its name. The white stuff on salmon is called albumin.Albumin is a protein that exists in the fish in liquid form when it's raw, but coagulates and becomes semi-solid when you subject the salmon to heat, whether that's in the oven, on the stove, or on the grill. As the meat cooks, the coagulated albumin gets squeezed out and appears in the form of the weird, slimy, white substance that you are probably familiar with (and weirded out by). Science is wild, huh?But why does the amount of albumin that comes out of a salmon fillet never seem to be consistent? Sometimes, you’ll end up with a piece that’s absolutely covered in the stuff, and sometimes you won't see any at all. That discrepancy has nothing to do with the type of salmon you're cooking, but rather how you're cooking it. The more aggressively you cook your salmon, whether it's wild or farm-raised, the more albumin will appear on its surface.Think of what happens when you wring out a wet towel. The water inside the fibers of the cloth is pushed out as you squeeze the fibers closer together. The same principle applies to salmon. As salmon cooks, the flesh contracts, pushing out albumin to the fillet’s surface. The higher the heat, the more quickly the flesh contracts, and the more albumin becomes visible.Speaking of slow-roasting salmon, our friends at Healthyish have a pretty great recipe.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiAlbumin always exists inside your salmon fillet. The proteins will always be there. That being said, the goal is to have as little as possible on the outside of your fish, and there are three ways to make sure that happens. 1. Cooking your salmon at a lower temperature for a longer amount of time is gentler on the fillet, resulting in a super-tender piece of fish with less nasty white stuff. 2. If you are searing salmon (and fish in general), always do so with the skin side down. The skin acts a protective barrier between the fish and the hot metal pan. Even if you plan on taking the skin off, cook your fish skin-side down for 90% of the way, turn off the heat, and then flip the fish so the skinless side cooks on the pan’s residual heat.And 3: Don’t overcook your salmon. This sounds obvious, but most home cooks overcook their fish. (You want it medium to medium-rare in the center, still a bit translucent.) And overcooking salmon is the easiest way to get albumin everywhere. A quick tip: When you can push on the top of your salmon with a fork, and the the layers of flesh separate easily and seem moist, your fish is finished cooking.Take it off the heat immediately. It’s fine. Please, don’t keep cooking it. The only thing grosser than a whole bunch of albumin is a whole bunch of dry, overcooked salmon. Again, neither will kill you. But still...gross.Now that you know about albumin:Summer Salmon NiçoiseWe love a classic Niçoise salad made with fancy oil-packed tuna, but using warm, slow-roasted salmon instead makes the whole thing feel a little more special.View RecipeExplore Bon AppétitBasicallySalmonFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast", "Alex Delany"]}