{"id": "0a97cbbadd664a31857b0eb1da020074", "url": "https://www.bonappetit.com/story/dash-mini-toaster-oven", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "The Dash Mini Toaster Oven Proves That Everyone Needs an Office Toaster Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Never Knew I Needed an Office Toaster Oven Until This One Came Into My LifeThe Dash mini toaster oven revives leftover Buffalo wings, busts out bubbly Bagel Bites, and inspires joy.By Annalee SoskinMarch 11, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.As the self-appointed social chair of BA’s art department, I possess the distinct power to anoint one joyous-for-some, disappointing-for-others office happening each year: the white elephant gift exchange. I take my gifting seriously. Case in point: this Dash mini toaster oven, with its powder yellow exterior and diminutive size that inspires Easy Bake-esque nostalgia. I knew it would be the hot-ticket item of the exchange, but I didn’t know that the lucky recipient, my colleague Christa, would keep it at her desk—and forever elevate my office snack oeuvre.Instead of eating too-ripe bananas or pitiful fruit snacks from the office kitchen, I can reheat leftover Buffalo wings until they’re back to their crispy, finger-licking state or bust out a box of Bagel Bites to fully embrace the small-scale culinary experience. I have even made pigs in a blanket. The sky (or 3-inch clearance above the tray) is the limit!Let me be clear: This toaster oven isn’t just cute; it really works! It heats up to a sizzlin’ 400 degrees and lets out an elegant ding when time’s up. While it would be ambitious to cook an entire meal with this little guy, the Dash oven is perfectly engineered to warm up a batch of afternoon snacks. It breathes new life into leftovers and is a friend of all frozen foods. It is as versatile and competent as it is precious. And with that, I say: Purchase it lovingly, use it frequently, unplug it after using.Dash Mini Toaster Oven$25 $24 at Amazon$30 at Bed Bath & BeyondExplore Bon AppétitHighly RecommendShoppingRead MorecultureThe Only Sheet Pan You’ll Ever Need Costs $20 and Will Last a LifetimeBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-11", "author": ["Condé Nast", "Annalee Soskin"]}