{"id": "0a9abbf9542a54338d34d1012efa1026", "url": "https://www.bonappetit.com/story/bragg-apple-cider-vinegar", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Bragg Apple Cider Vinegar Is the One Hippie Food That's Never Let Me Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Mysterious Hippie Food Brand That's Never Let Me DownPaul and Patricia Bragg, I see you.By Kyle BeecheyJune 27, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt began with a coleslaw recipe. I gave my mother the task of picking up some vinegar for the dressing and she returned with a big bottle of Bragg apple cider vinegar. When I tasted it, the experience was revelatory. It was strikingly different from the crystal clear, throat-burning substance I was used to. I used it to give my slaw a little extra boost, and, before I knew it, I was throwing it in everything from cake batter to a homemade facial mist.It was only a matter of time before more bottles bearing the faces of Paul and Patricia Bragg dotted my pantry. Anytime I’d walk down an aisle at my local mom n’ pop health food store, I’d discover another jar of something with the iconic yellow and red packaging: Sea Kelp Delight Seasoning (a blend of 24 herbs and spices), Braggberry Dressing (an antioxidant heavy mixed berry vinaigrette), Braggzymes (a dietary supplement with coenzyme Q10), Bragg Boost (if 5-hour Energy had an organic caffeine-free cousin). My shelves overfloweth with Bragg.What makes Bragg different from the endless other healthy brands that fill the supermarket aisles these days? I love it for the nostalgic tagline on their bottles—“Health Crusaders Since 1912.” And because it isn’t a celebrity-established or venture-capital-backed “wellness brand.” And because they haven’t hired a branding specialist to create a font to lure millennials. Bragg just does Bragg.These are a few of my favorite things.\nPhoto by Emma FishmanFor all the pioneering that Paul and his daughter Patricia have done in the health world, very few sources about the family exist. Founder Paul Bragg was born sometime between 1880 and 1895 in either Virginia or Indiana. His quest for health began after being diagnosed with tuberculosis at 16. Unsatisfied at the American doctors’ prognosis that he wasn’t going to survive, he traveled to Switzerland for alternative care. Apparently, in two years, he was cured by “sunshine, exercise and a diet of natural foods.” Just like Heidi! Upon his return to the states, he  started his “global health crusade,” doing country-wide speaking tours and writing a weekly newspaper column that praised the benefits of following a healthy lifestyle, working out, and eating raw food.In the late 1920s, Bragg founded the “Bragg Health Center,” a restaurant and health food store in downtown Los Angeles. One website cites a bit of controversy—a lawsuit, questionable academic credentials—but nothing I could confirm. Bragg’s daughter-in-law, Patricia, now runs the business. She’s 89, loves hats, collects dolls, is wrinkle-free, and, as of 2015 anyway, wakes up “full of energy”—maybe because of all that ACV.So what about all the health claims? According to their seminal tomb Bragg Healthy Lifestyle: Vital Living to 120!, their range of products will help you live longer, be thinner, and become the very best version of you by helping you find your personal “Garden of Eden”. Studies have shown that apple cider vinegar could be beneficial in lowering blood sugar, aiding in slight long term weight loss, and as a prebiotic to ease digestion. (Just don’t drink it straight—it’s tough on your teeth—and stick to just a couple of teaspoons a day because it can have adverse effects, like lowering potassium levels.) Soy and coconut aminos include building blocks like tryptophan and arginine that are essential to the formation of muscles and that supposedly remove toxins from our bodies.But the truth is that I could care less if my condiments cure cancer. All I know is that a little spritz of soy aminos on my romaine is sometimes exactly what the salad doctor ordered. I turn to the apple cider vinegar first thing in the morning for the supposed metabolic boost. For the sweltering Southern California afternoons, there’s nothing better than one of their apple cider vinegar drinks. (I’m partial to the Limeade, maybe Ginger Spice in a pinch.) I can’t stop sprinkling their Sea Kelp Delight and nutritional yeast on everything from roasted cauliflower to sliced avocado.I feel about Bragg the way some people feel about Coca Cola: I love it whether it's good for me or not. I’m not really into “removing body sludge toxins” as Bragg's ACV fact sheet promises, but I am into the taste, the iconic branding, and the fact that I can find it at just about every grocery store in LA, from Ralphs down the street to the indie natural foods store in the San Fernando Valley. And I love looking Mr. & Mrs. Bragg in the eye first thing in the morning as I put a teaspoon of their ACV into hot water and drink it down. Cheers, you two.All products featured on Bonappetit.com and Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishApple Cider VinegarShoppingRead MorecultureMoosewood, the Restaurant that Taught Americans to Eat Healthyish, Has a New CookbookBy Leah MenniesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-27", "author": ["Condé Nast", "Kyle Beechey"]}