{"id": "0ac5a7e9744993b174445b5a77a48fbf", "url": "https://www.bonappetit.com/recipe/chocolate-matcha-butter-mochi-cake", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Chocolate-Matcha Butter Mochi Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueChocolate-Matcha Butter Mochi CakeBy Christina ChaeyFebruary 8, 20224.6(47)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintThis dessert could grace a pastry shop window, but its elegance masks its ease (just as the shiny chocolate glaze covers up the bouncy-cushiony-chewy middle). The mochiko, or sweet rice flour, is what gives the cake its unique texture, and the earthy matcha and bittersweet chocolate make it not too sweet. In the spirit of the Hawaiian butter mochi that inspired the recipe, it requires minimal equipment and comes together in the time it takes the oven to heat up. Do take the time to sift the matcha, however—it ensures that there aren’t any dry bits in the final cake—and splurge for ceremonial-grade matcha if you want the most vibrant color possible.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRound Cake Pan$12.99 At AmazonScale$25 At AmazonSmall Offset Spatula$6 At AmazonWhisk$10 At AmazonMesh Sieve$13 At AmazonWire Cooling Rack$17 At Bon Appétit MarketCake Tester$3 At AmazonIngredientsMakes one 8\"- or 9\"-diameter cake6Tbsp. unsalted butter, melted, slightly cooled, plus room-temperature butter for pan1½cups (227 g) mochiko (sweet rice flour; such as Koda Farms or Bob’s Red Mill Sweet White Rice Flour)1tsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt2Tbsp. matcha, sifted, plus more for serving2large eggs114-oz. can sweetened condensed milk1tsp. vanilla extract1⅓cups heavy cream, divided4oz. bittersweet chocolate, choppedPreparationStep 1Place a rack in middle of oven; preheat to 350°. Generously butter an 8\"- or 9\"-diameter cake pan. Whisk mochiko, baking powder, salt, and 2 Tbsp. matcha in a large bowl just to combine. Vigorously whisk eggs and melted butter in a medium bowl until pale and emulsified, about 30 seconds. Add sweetened condensed milk, vanilla, and 1 cup cream and whisk until mixture is smooth. Scrape into dry ingredients and whisk vigorously until smooth and very thick. Scrape batter into prepared pan and smooth surface.Step 2Bake cake until it starts to pull away from sides of pan, top and edges are golden, and a tester inserted into the center comes out clean, 35–45 minutes (cake in the smaller pan will take longer to bake than one in the larger pan). Transfer pan to a wire rack and let cake cool 5 minutes. Turn cake out onto rack; let cool completely.Step 3Place chocolate in a small heatproof bowl. Bring remaining ⅓ cup cream to a boil in a small saucepan. Immediately pour over chocolate; let sit 15 seconds. Stir until ganache is smooth.Step 4Evenly pour ganache over top of cake. Using a small offset spatula or spoon, spread ganache to edges of cake (drips down the sides are encouraged!). Let sit until ganache is set, about 2 hours. (If you are in a hurry, you can chill cake until glaze is set, about 30 minutes.)Step 5Just before serving, dust top of cake with more matcha with a fine-mesh sieve.Do ahead: Cake and glaze can be made 2 days ahead. Store cake tightly wrapped in several layers of plastic at room temperature. Let glaze cool, then chill in an airtight container. Gently reheat glaze in the microwave or a double boiler over a pan of simmering water (do not let bowl touch water) until just melted before using.How would you rate Chocolate-Matcha Butter Mochi Cake?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleGreat! Cake! I sifted the matcha, but sifting all the dry ingredients is what dreams are made of :) It came out so dense, I was worried it was dry, but thankfully nope! I doubled the ganache and it didn’t disappoint to have a thick layer chocolate on top. Ate it in a hotspring and celebrated a dear friend with sake. Easy peazy 💚MadelineReno, NV3/22/2022Has anyone used a 9\" Springform Pan for this?\nBeckyMooseRiver Hills, Wi3/19/2022So fun! This cake is super easy to make once you have all the ingredients. We really liked it. Anonymous3/13/2022I’m not really a cake person, and I’ve never baked with Matcha before. But OMG I loved this. Great texture and not too sweet. My partner has already had three pieces and had to stop himself from having a fourth. Always a good sign. 😂 Perfect as written. Will definitely make again.SadiePortland3/13/2022This cake totally failed for me. While it mixed up fine (I weighed and did not use the cup measurements), it baked terrifically unevenly, cracked a Grand Canyon while baking, stayed so moist inside that I had to leave it in until it was distressingly brown on top. Then the ganache mixed up so thick that it did not run down the sides. \n\n\nThe flavor was good, but the whole thing was a claggy mess. I have no idea whether I over-mixed or maybe my scale malfunctioned? It didn’t work. It’s worth a do over, for sure though. Rachel S.New York, NY3/13/2022One of the best cakes I’ve made, and I bake A LOT. It’s so unique and we honestly can’t stop eating it. If you want more sweetness, you can add 1/3 cup of sugar, but it’s so floral and grassy with the cake and the chocolate that it’s really perfect. Jake BakesSaint Paul, MN 3/5/2022I was tasked with making a chocolate post-apocalyptic cake for a friend's birthday just as I pulled the latest magazine from my mailbox. This cake, featured on the cover, appeared to be the perfect solution, and it was! I will try it again as many liked it though I thought it was a bit too dry. I will try measuring the mochiko by weight. I used a 10 x 2\" aluminum fluted tart pan and it gave the cake more presence. This was fun to make.AnonymousNew York, NY2/28/2022I really enjoyed this cake—I used tapioca flour instead of sweet rice flour because that's what I had on hand. The middle of the cake sunk, which upon googling I found is a common problem with gluten free desserts (Don't use a stand mixer and over mix the dry ingredients). All this being said, it reminded me a lot of mochi donuts, which as a gluten free person, is my favorite dessert. Everyone at the dinner party had seconds and agreed this cake is fabulous. Thank you Christina! AllynBrooklyn, NY2/28/2022The texture of this cake is really fun - dense, moist, and fluffy all at the same time. Definitely one of the best gluten-free cake textures I've encountered. It might be new to someone that is unfamiliar with mochi or rice flour desserts, but it was a hit in my family. I really enjoyed the combination of matcha and chocolate and think the amount of matcha recommended by the recipe is perfect. I will likely add some sugar the next time I make it, as it was slightly bitter between the matcha and the chocolate. I also plan to use a wider cake pan to get a flatter cake, as mine sank a lot when it cooled down. I will absolutely be making this again, with a few adjustments. Don't be deterred by the negative reviews! Also thank you to the person from \"I can't believe these people\" for the LOL's.SashaJersey City, NJ2/28/2022Added 1/3 cup granulated sugar with eggs & melted butter step. Most mochi recipes are only delicious the day of, but this one lasts as it was still really good on day 2 with a soft 10 second microwave warm up. I stored in glass airtight container.MunchieChicago, IL2/25/2022I thought it was pretty good despite the few negative reviews. It’s definitely not too sweet, just as the description says. I didn’t think the matcha was TOO strong, that’s the point of the cake. I thought the bittersweet chocolate was enough to counter the earthy flavor from the matcha. The texture of the cake is soft and dense but not dry, and a bit chewy (in a good way). It’s very easy to make, I would give it a try if you know you like matcha and desserts that are not super sweet and decadent. MaddoPhiladelphia, PA2/24/2022I was skeptical given the divided reviews, but I love matcha and wanted to give this a shot. This turned out delicious. The matcha cake was just sweet enough and had a perfect bouncy, chewy texture. The chocolate ganache complimented the cake well. I passed on dusting the top with matcha, just didn't love the appearance of it. Aan easy and impressive cake that I will certainly make again. Alex B. Seattle, WA2/20/2022It's telling that the worst ratings for this cake are from people in the literal middle of Nowhere, USA, whose reviews make it painfully obvious that they have never eaten anything other than Kraft macaroni & cheese or Oreos. Do the rest of the world a favor: if you have the food habits of a Midwest toddler, don't bother commenting. You're embarrassing yourself.I Can't Believe These People2/19/2022This was requested as an 11th birthday cake and was a big hit among the family. Big Sis and I opted to add in some powdered sugar to the dry ingredients (just eyeballing, less than1/4 cup) and resifted everything. We used semi-sweet chocolate for the ganache and chose not to dust with matcha, and it was not too bitter, not too sweet for us. We liked the texture of the cake a lot and will make again. It was a very vibrant green!AnonymousVirginia2/19/2022I just started getting Bon Appetit magazine for my two teens, as they have become pretty good bakers and cooks. They took one look at the photo of this cake and wanted to know why it had moss growing on it. That is one unappetizing photo. The cake was weird tasting, although the one they baked looked just like the unappealing photo. JustMeTri Cities, Wa2/16/2022Explore Bon AppétitDessertCakeEasyNut-FreeBakingChocolateOther IngredientsMatchaGlutinous Rice FlourFlourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Christina Chaey"]}