{"id": "0ac8930fbd6a66b772bfef20c29a6f6d", "url": "https://www.bonappetit.com/recipe/easiest-ever-grilled-veggie-burgers", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Easiest-Ever Grilled Veggie Burgers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEasiest-Ever Grilled Veggie BurgersBy Chris MoroccoJune 20, 20184.4(22)Read ReviewsTriangleEmailPinterestPrintPhoto Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintIt sounded like an impossible assignment: a recipe for a from-scratch veggie burger that can go right from the mixing bowl onto the grill without falling apart? Lo and behold, we found a way.Ingredients8 servings2Tbsp. extra-virgin olive oil, plus more for greasing114-oz. block extra-firm tofu, drained214.5-oz. cans black beans, rinsed, drained well¼cup almond butter¼cup mayonnaise (vegan, if you are vegan)2garlic cloves, finely grated4tsp. chili powder (make sure it’s salt-free)4tsp. Diamond Crystal or 2 tsp. Morton kosher salt2cups cooked quinoa (we prefer red or black), cooled¼cup flaxseed meal2Tbsp. cornstarchToasted buns, pickled onions, tomato, lettuce, pickles, and chipotle yogurt (for serving)PreparationStep 1Prepare a grill for medium-high, direct heat. Clean and oil grate. Shred tofu using the large holes of a box grater. Firmly squeeze tofu in between paper towels to drain as much excess liquid as possible.Step 2Heat 2 Tbsp. oil in a large nonstick skillet over medium. Cook tofu and beans, tossing occasionally, until beans look slightly dried out and their skins are darkened, 10–12 minutes.Step 3Meanwhile, whisk almond butter and mayonnaise in a medium bowl until smooth. Whisk in garlic, chili powder, and salt. Add tofu-bean mixture and cooked quinoa and stir well to combine.Step 4Stir flaxseed and ¼ cup cold water in a small bowl. Let sit until a thick paste forms, about 1 minute. Add to tofu-bean mixture along with cornstarch and stir well to combine.Step 5Using oiled hands, form mixture into 8–10 patties about ½\" thick (about a scant ¾ cup each). Grill until lightly charred around the edges, about 2 minutes. Turn carefully using a metal spatula to cleanly lift off grate and grill until lightly charred on second side and warmed through, about 2 minutes more.Step 6Place burgers on bottoms of buns. Pile high with pickled onions, tomato, lettuce, pickles, and chipotle yogurt. Close with top bun and serve.Step 7Do Ahead: Patties can be formed 3 days ahead. Tightly wrap each in plastic and chill.How would you rate Easiest-Ever Grilled Veggie Burgers?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleWe LOVE this recipe! Incredibly good burgers & equally delicious ‘scrambled’ after thawing from freezer. Jessica TaylorNew York 2/8/2022Great recipe. The burgers were perfect. Also, I ended up having 12 patties - but that is a small problem to solve :-)AnonymousNew York, NY9/12/2021I haven't made this yet but look forward to as it looks delicious but this doesn't seem like a \"veggie\" burger as there aren't any vegetables in it .\n\nTofu (bean curd) - Legume\nBlack Beans - Legume\nFlax seed - Grain\nQuinoa - Grain\n\nI made a veggie burger a few years ago that took about 5 hours as I had had to roast off a lot of vegetables, chop them in the food processor to a fine paste essentially, then form the patties and then bake them before actually cooking them to eat.\n\nThis seems much easier.RyanCalifornia8/19/2021I've made this recipe many times because of the taste of the burgers - delicious (omnivore here, making them for dinner).  I make it as written and we don't find it to be too salty.  I haven't tried these on the grill; as previous reviewers have noted they are way too \"loose\".  I cook them on a griddle and flip gently.  for the person below who asked about freezing, we typically will eat some for dinner, then freeze the rest.  I lay them out uncovered on a parchment-covered sheet pan until frozen, then wrap individually and store in a reusable bag. they are great to take to work for lunches.  Freezing does not help with the consistency, but doesn't harm the taste.AnonymousNWPA9/22/2020Great flavor and texture, and the color LOOKS  meaty. We also had fragility issues — does making them in advance help with this? Next time we’ll do that and also mash the black beans. \nHas anyone frozen these? \nDefinitely definitely make again, great flavor and burgery-ness (even in a skillet), just a pain to flip and eat AnonymousRaleigh9/16/2020Texture was great. Held together well on the gas grill and when eating. I halved the salt based on reviews and because my chili powder had salt. I think maybe 3/4 would have been better...a little too bland alone, but with chipotle yogurt, avocado, lettuce and the perfect summer tomato- delicious! Will definitely keep it in rotation. Even my six year old ate them!Connecticut9/15/2020Delicious. Made these for 4th of July exactly per instructions. Although replaced garlic with ginger (wife’s not into the garlic) and used cumin instead of chili powder.  Cooked them on the gas grill and they stayed together through the grilling process.  Topped with vegan cheese (Field Roast Chao Slices - very good), mayo, tomato and avocado. Best - and easiest - veggie burger recipe I’ve tried so far.  Didn’t fall apart and wasn’t too salty as some reviews note.  Just wish I knew how to get them to more of a firmer, meat-like consistency.  They’re a bit mushy, as almost all homemade veggie patties are. Don’t matter - 5 stars anyway, easily. Cook King MonsterSan Francisco 7/5/2020These rule and taste fine after several substitutions too. I had no almond butter so I threw in a little pb and tahini (why not), and I swapped out the quinoa (which I can’t eat without suffering massive gi issues) for millet. Grilled up beautifully and didn’t fall apart. Yay! AnonymousOregon7/4/2020This is one of my absolute favorite veggie burger recipes! I make it all the time, alternating with Chris's lentil burgers recipe. It's more nutritious than recipes that use flour and breadcrumbs as filler. It has a lot of flavor so you don't need a bunch of toppings. I haven't tried to grill them but instead prepare like all my other veggie burgers, pan-frying. A few notes:\n1. Grating the tofu is totally unnecessary! You can just break it up in the pan and achieve the exact same texture\n2. Like the recipe says, you HAVE to check if your chili powder already contains salt. Between the beans, almond butter, and chili powder there are a lot of salty ingredients!\n3. Veganaise works greatcapaBoston4/1/2020The texture of this burger worked as promised — sturdy and didn’t fall apart. But, it was far too salty. I’d recommend cutting recipe quantity in half. I’ll try making it again just to see how the flavor shines through without so much salt (and I like salt...just not this much.). Might add some onion powder to it as well.\nThanks BA for thinking of us vegetarians!JojohohoMaine7/2/2019This was pretty effing tasty, and the pickled onion goes well with it. I found that the mixture came together nicely once I added the flax paste and cornstarch, and in fact the consistency reminded me of ground beef. The mixture felt pretty sturdy. I did not grill these, however. The patty remained intact through the pan-frying process but got a bit crumbly as I was eating it, no big deal. I followed Cook's Illustrated recipe for the quinoa which makes a nice, not-too-wet batch--maybe helped the mixture to stick together better?IhatemuffinsWaco, TX5/13/2019These burgers are delicious. Mine did not fall apart. I formed them into patties the night before and cooked them on my grill pan, and sandwiched them with brioche buns. Even my 6 year old ate them. My husband cooked the leftover patties the next day on a baking sheet with melted cheddar. Meatless, weeknight family recipes are much appreciated— thank you! audra_brechSeattle11/30/2018I tried this recipe after hearing about it on the burger podcast.  Great flavor, VERY easy to make, but disappointing (sadly).  These burgers are very fragile, so I ended up grilling them on a sheet of heavy duty foil and they remained intact.  However, they immediately fell apart when I bit into my burger.  I ended up eating most of my meal with a fork.  The good news is that they were delicious. Kimberly HutchinsonMassachusetts9/24/2018Listening to the pod cast (which I recently stumbled upon and Im completed obsessed with it on my morning commute) and got excited about these burgers. I have tried to make grillable veggie burgers, with a million ingredients and freezing, and mixed success. I am excited to try these but I think it would benefit readers to explain how Chris cooks his quinoa in the description or hyperlink to it. Thanks ❤ you BAAnonymousBorn and raised in Brooklyn 9/21/2018I'd love to make this but I cannot do soy.  What are your suggestions?  I'm thinking on substituting refried black beans for the whole black bean and soy (tofu).KateMcGooSan Antonio, TX6/25/2018Explore Bon AppétitBurgerVeggie BurgerTofuOther IngredientsBlack BeanBeanVegetableQuinoaRice & GrainsFlaxseed MealFlourEasyWeeknight MealsQuickMainVegetarianHealthyishGrillingFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Chris Morocco"]}