{"id": "0acff7d82116e5c0f1b3eb1b6b5bade8", "url": "https://www.bonappetit.com/story/muffin-feud", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Admit It: You Love Muffins | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAdmit It: You Love MuffinsA muffin food feud reveals which BA staffers are cranks and which ones just love a good muff.By Alex BeggsJuly 20, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Oh be-haveWho’s that over there, sticking her toothpick in bite after bite of peach samples at the farmers’ market? Not you, because you know the rules—one sample per varietal! This caused a rift in my household, where someone named Bill thinks samples are unlimited and plentiful to all who are snackish. But he’s used to being wrong! Read more questionable farmers’ market etiquette right this way and remember to send me your laments at staff.bonappetit@gmail.com!Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiPotato potentialOver 3 MILLION people have watched Amiel Stanek cook potatoes 63 different ways, including electrocution. But I appreciated the throwback to scalloped potatoes, which we ate once a week when I was a kid. (My body is 63 percent heavy cream.) Now I’ve moved on to crispier fronts: Hello, potato nugs.Want this letter before it hits the website? Sign up for our newsletter!Peden & MunkFava foreverI went to the trouble of cooking with buttery fava beans for the first time in my LIFE this week—shelling them from the pod, blanching, peeling the bean from the thick bean skin. By the time they were peeled (mangled, really), I was too lazy to make a vinaigrette or do anything else, so I melted butter and ate the beans right there at the counter, with lemon and salt. If you see high maintenance fava beans at a restaurant, ORDER THEM.Get (a) recipe: Flatbread with Fava Beans, Cucumbers, and BurrataIn a bookI just finished reading Jennifer Weiner’s Mrs. Everything. The book’s about two sisters’ diverging paths, beginning in the 1950s in Detroit and through the following decades. Lots of stuff about figuring out what you want in life, what you need, domestic burdens and joys, and facing difficult truths. (Vague enough?) The main character also subscribes to ye olde Bon Appétit, so that’s fun. I’ll go ahead and claim it right now for having the best food scene in fiction this year. There’s a Thanksgiving dinner that captures all of the emotional stressors of that holiday, and how we bury them in stuffing and cranberry sauce. Until we can’t any longer. 💥Photo by Chelsie CraigIt’s the pitsIt’s cherry season and I have a fondness for sour cherries, the best to use when baking. (My beloved clafoutis!) But say you don’t feel like baking. I had a pint of cherries that were too sour to snack on, so I threw them in a saucepan with a lemon peel and some sugar, cooked them down for eight minutes, and blammo, jam. However, I couldn’t have done it without my trusty $8 OXO cherry pitter, pulled from my Ziploc bag of “tools not used very often.” But right now, it’s in the cutlery drawer, READY FOR ACTION.The next big appleIn California Sunday, an in-depth look at the making of (and million-dollar marketing of) the next big apple—the Cosmic Crisp. But I have a lot of questions about the WA 2.Unnecessary food meme of the weekUnnecessary food feud of the weekSarah Jampel didn’t know what she was wading into when she asked our Slack group, “what is the best muffin recipe?” Muffins, which Molly Baz calls “mediocre small cakes,” don’t usually make it to the top of the development pile in the Test Kitchen. “They’re sad,” said Adam Rapoport, who referenced “your average commuter muffin carb bomb”—something that brings sustenance, not pleasure. Carla Lalli Music, taking a break from filming [REDACTED] with muffin-maligning Molly, complained “they’re somehow wet and dry at the same time!” “But you know what,” Molly replied, “a morning glory muffin, sliced in half, with butter, griddled until crispy on one side—that’s how I want my muffin.” Nodding, Carla approved of this method, but make it a corn muff. By the elevators, I ran into Sarah Jampel and a frowning Andy Baraghani and watched as Sarah, by the power of description, convinced Andy that a muffin can be great: “If it’s baked right, it has a fluffy, not cakey, inside, and a very crunchy top.” “That’s RARE,” conceded Andy, who’s more of a scone guy. Anna Stockwell feels a muffin should meet it’s expectation of being a breakfast food: “whole grains, nuts and fruits, almond flour…” Sounds familiar. Speaking of Healthyish, Amanda Shapiro loves a bran muffin. Jesse Sparks and Aliza Abarbanel are on team “some muffins are okay.” But Emily Schultz stands firm: “If I’m going to eat a breakfast pastry, it’s gonna be a croissant.” Same.Get the recipes:Extra-Corny Cornbread MuffinsGluten-Free Apple and Oat MuffinsExplore Bon AppétitBeggs NewsletterRead MorecookingThese Extra-Corny Cornbread Muffins Are No JokeBy Jesse SparkscookingHow Interesting That This Tomato Galette Could Serve 8...or 1By Alex BeggscultureA Summer Mood BoardBy Alex BeggscultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-20", "author": ["Condé Nast", "Alex Beggs"]}