{"id": "0ad383b81f1d61f6d3246ae8e08acb0c", "url": "https://www.bonappetit.com/recipe/green-garlic-roast-chicken", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Green-Garlic-Rubbed Buttery Roast Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueGreen-Garlic-Rubbed Buttery Roast ChickenBy Andy BaraghaniMarch 17, 20204.1(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintRoasting a whole chicken quickly at high heat is optimal for the crispiest skin but risks overcooking the meat. This method of going low and slow is much gentler on the meat, keeping it juicy yet shreddable underneath skin that crackles. The green garlic has a mild, fresh flavor (much less bite than regular garlic, but you can use that here too). As the chicken cooks, the green garlic dries out and turns into a crispy crumb topping.Ingredients4 servings13½–4-lb. whole chicken,  patted dryKosher salt, freshly ground pepper8green garlic stalks, dark green tops removed, divided6Tbsp. unsalted butter, room temperature1Tbsp. finely grated lemon zest¼cup extra-virgin olive oilPreparationStep 1Season chicken all over inside and out with salt and pepper (make sure to get in and around every nook and cranny; about 4 tsp. Diamond Crystal or 2½ tsp. Morton kosher salt). Place on a wire rack set inside a rimmed baking sheet and let sit at room temperature while you make the garlic butter, or chill, uncovered, up to 1 day. If chilling, let sit at room temperature 1 hour before roasting.Step 2Place a rack in middle of oven; preheat to 325°. Coarsely chop 4 green garlic stalks; transfer to a food processor. Pulse until very finely chopped. Add butter and zest and pulse until almost smooth. Cut remaining 4 green garlic stalks in half lengthwise; set aside.Step 3Pat chicken dry again with paper towels (this will help the butter adhere and get the skin nicely browned). Smear garlic butter all over chicken. Gently lift the skin on the breast away from the flesh and rub some butter inside.Step 4Toss reserved green garlic and oil in a large cast-iron skillet or 13x9\" baking dish to coat; season with salt. Tie chicken legs together with kitchen twine and tuck wings underneath back. Place chicken, breast side up, on top of garlic in skillet.Step 5Roast chicken, rotating pan halfway through for even browning, until skin is golden and an instant-read thermometer inserted into the thickest part of breast registers 155° (don’t worry; temperature will climb to 165° as the chicken rests), 80–90 minutes. Let chicken rest at least 20 minutes and up to 45 minutes.Step 6Transfer chicken to a cutting board and carve as desired. Serve with roasted green garlic alongside.How would you rate Green-Garlic-Rubbed Buttery Roast Chicken?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleVery lovely recipe, especially since I really love garlic, i also really loved the hints of lemon that the zest gives the chicken AxelMalta3/11/2021After hearing Andy and Adam talk about this recipe on the podcast I was inspired to try it even though I didn't have green garlic. I did 3 scallions and 3 large cloves of garlic in the butter and then threw a few more scallions in the pan. Came out great! Husband especially loved the buttery garlicky pan sauce we ended up with.AnonymousFlorida5/31/2020This recipe was outstanding using wild ramps instead of garlic.  Will make the ramp butter for use on potatoes or green beans.AnonymousDuluth MN5/17/2020Made this with chicken thighs instead of a whole chicken, and the butter and milder flavor of the green garlic made a well-balanced dish. The lemon zest lifts it nicely. Will definitely make again while green garlic is in season. \nAnonymous below seems to have missed the fact that this is a food site, not a kosher food site. I understand that many Jewish people feel justifiably overlooked and mistreated in society, but the mere existence of non-kosher recipes is not a symptom of that problem. Especially not on a site that over the last weeks has run numerous traditional Passover dishes. \nAnonymous, might I point out that you are totally free to:\na) peruse websites that specialize in kosher cooking and \nb) use a non-dairy alternative to butter in this dish?Pasadena, CA4/14/2020Really?  Buttery chicken for Passover?  How about learning the most basic of kosher rules. No meat and dairy shall ever meet!\nI think many of your recipes are suspect because kosher for Passover products do not exist for many invredientsAnonymousCanada4/5/2020yes! enjoyed thisAnonymous3/31/2020We loved this chicken. I keep searching for the best roasted chicken and this is my favorite so far. I did add too much oil to the cast iron skillet. With the butter rub, I should have followed the recipe instead of my usual “eye balling” method.  Served with the Ramen Noodles on page 70. They were incredible. alisonjbennettNew Hampshire 3/29/2020Explore Bon AppétitChickenPoultryGarlicVegetableSpringOne-Pot MealsSheet-Pan DinnersEasy5 Ingredients or FewerMainGluten-FreeNut-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Andy Baraghani"]}