{"id": "0ada280e55ee4655788b019aa9702b07", "url": "https://www.bonappetit.com/story/weeknight-braising", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "3 Cozy Braises That Don't Take Forever—Or Even an Hour | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Cozy Braises That Don’t Take Forever—Or Even an HourBraises don’t have to take all day, and these recipes are proof.By Nico AvalleSeptember 10, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioFacebookTwitterEmailFall is almost here, and while lots of folks are getting excited about pumpkin flavors, apple picking, and crispy foliage, I’m just stoked that it’s braising season again. See, slowly cooking a protein in a flavorful sauce, letting it soak up flavor along the way until it reaches fall-apart tender perfection is my idea of culinary heaven. I like braising so much that, when I take a bath, I like to imagine that I’m a chunk of short rib getting nice and loose with a generous pour of red wine. (Too personal?)I love braising because it’s pretty much foolproof. There’s no poking chicken breasts with meat thermometers, no stressing about whether the veggies will be flavorful enough, and—once my leftovers are tucked away in the fridge—there’s usually only one pot to worry about cleaning. And braised dishes are the epitome of comfort food—think tender oxtails, the juiciest possible chicken wings, and coconutty carrots with an unbelievable amount of flavor. It’s pretty much universal: giving ingredients that much time to mingle nearly guarantees a delicious outcome.Of course, that time demand can be a pretty serious barrier to braising every night. Lots of braised recipes can stretch into hours, and while most of that time is usually spent waiting, I’m not always down to have dinner at 10 p.m. on a Wednesday. That’s why, when a new series of weeknight-ready braising recipes dropped in our September issue, my excitement reached an all-time high. This fall, I’m done choosing between my impatience and perfection. Catch me braising my nights away with these recipes, all of which take an hour or less.Spicy Braised TofuThis riff on Korean dubu jorim from senior food editor Christina Chaey is easily the fastest of the bunch. Pan-fried tofu is given a massive flavor boost from a quick simmer in a bath of soy sauce, mirin, sesame oil, and gochugaru, creating something truly marvelous in about half an hour. Be sure to use extra-firm tofu so it doesn’t fall apart and give it a good press to get rid of excess moisture before browning it. (You can do this with a couple of sheet pans, but a tofu press takes the hard work out of the process.) That also means more room to absorb flavor from the sauce and less stress about a jiggly mess.Spicy Braised TofuYou’ll find a version of this quicker-than-quick dish on many Korean tables as a banchan, or small plate. But with rice and a side of greens, it’s dinner exactly when you need it: right now.View RecipeWeeknight RagùNot your nonna’s ragù—as in the kind that spends hours simmering on the range while the family helps her roll out fresh pasta by hand—this sauce takes a shortcut to tender town by employing ground meat rather than big hunks. It also takes advantage of double-concentrated tomato paste to build a thick sauce in a fraction of the time. Finishing al dente pasta in the sauce is almost always a good call, and it’s a no-brainer in recipes like this one—two minutes in the ragù and your noodles will be extra tasty and ready to serve straight out of the pot.Weeknight RagùWhen you want the comfort of a meaty, cooked-all-day ragù but don’t have all day to cook one, reach for this speedier version.View RecipeSpiced-Tomato-Braised FishCooking whitefish like cod or haddock to tender, flaky perfection is a famously quick affair, so delicate fillets are perfect candidates for weeknight braising. “Since fish cooks relatively quickly, the challenge is packing it with lots of flavor without overcooking it,” says associate food editor Rachel Gurjar. The solution is packing the pot with sweet tomato purée, whole spices like cumin seeds and cinnamon sticks, and a healthy scoop of garam masala for good measure. Rachel recommends serving with big wedges of crusty fried sourdough, but any starch or grain you have on hand will do a fine job soaking up all that sauciness.Spiced-Tomato-Braised FishStore-bought tomato purée cooked with lots of warm spices such as cumin and garam masala packs tons of flavor into this simple fish curry.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-10", "author": ["Condé Nast", "Nico Avalle"]}