{"id": "0ae5a549a07a4cc1b17cee3b35dd2ce5", "url": "https://www.bonappetit.com/recipe/peach-plum-galette", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Peach-Plum Galette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssuePeach-Plum GaletteBy Carla Lalli MusicAugust 13, 20194.7(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintUse any stone fruit that looks good to you, or combine two or three types—say, a mix of plums, or peaches and nectarines, or apricots and cherries. As long as the total weight is 2 lb. you’re good to go. You can also play around by adding 2 tsp. fresh spices (think cinnamon, nutmeg, coriander, fennel), 1 tsp. citrus zest (lemon, lime, orange, grapefruit, added to the fruit filling), or a touch of heat (1 tsp. black pepper, 2 tsp. Tajin or Aleppo-style pepper, or ½ tsp. crushed red pepper flakes). For more galette inspiration, check out our Any Berry Galette and Fall Fruit Galette.Ingredients8 servingsDough1½tsp. sugar¾tsp. kosher salt1⅓cups (180 g) all-purpose flour, plus more for surface¾cup (1½ sticks) chilled unsalted butterFilling and Assembly2tsp. cornstarch1tsp. finely grated lime zest1tsp. kosher salt⅓cup sugar, plus more for sprinkling1lb. peaches, cut into ¾\"-thick wedges1lb. plums, cut into ¾\"-thick wedges1Tbsp. fresh lime juice1tsp. vanilla extract1tsp. finely grated peeled ginger (optional)1Tbsp. heavy creamSoftly whipped cream or vanilla ice cream (for serving; optional)PreparationDoughStep 1Whisk sugar, salt, and 1⅓ cups flour in a medium bowl. Cut butter into 6 rectangular pieces (if using ½-cup sticks, cut them in half crosswise, then in half again lengthwise). Toss butter in dry ingredients to coat, then dump mixture out onto a work surface. Most recipes start by pulverizing fat into small bits, but here you’ll use a rolling pin to flatten flour-coated butter into sheets that will puff into layers when baked.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 2Roll butter into flour until it is in long flexible strips, using a bench scraper to scrape butter off rolling pin or surface as needed.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 3Use bench scraper to gather mixture into a loose pile, then drizzle 4 Tbsp. ice water over.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 4Using your hands and the bench scraper, toss mixture until water is distributed, then gather into a rectangular pile.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 5Roll out dough to a long rectangle with short ends about 8\" wide, then use bench scraper to fold dough into thirds, like folding a letter. It will be very crumbly and loose; don’t panic. This turns the floury mass into a cohesive unit while creating flaky-making stacks of fat and flour.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 6Using bench scraper to help, turn rectangle 90° and repeat rolling and folding, gathering loose bits of dough from outer edges into the center and flouring surface as needed.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 7Repeat rolling and folding a third time. Dough should be somewhat homogenous and creamy-looking with some dry bits around edges. Squeeze a bit in your palm; it should loosely hold together. If not, repeat rolling and folding.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 8Wrap folded dough in plastic, then press it into a compact disk about 1\" thick. Chill 30 minutes.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 9Roll out dough on a lightly floured surface to a 12\"–14\" round or oval about ⅛\" thick (don’t worry about cracks around perimeter). Dust surface and rolling pin with flour as needed and rotate dough often to prevent wider cracks. If dough sticks to surface, lift on one side and scatter flour underneath before continuing. Roll dough onto your pin, then unfurl it on a sheet of parchment paper. Slide onto a rimmed baking sheet and chill while you prep the filling.Step 10Do Ahead: Dough can be made 3 days ahead. Keep chilled, or transfer to a resealable plastic bag and freeze up to 3 months. Thaw overnight in the refrigerator before rolling out.Filling and AssemblyStep 11Preheat oven to 400°. Combine cornstarch, lime zest, salt, and ⅓ cup sugar in a medium bowl. Toss with your hands to combine, then add fruit and toss to coat. Add lime juice, vanilla, and ginger (if using); toss gently.Step 12Arrange fruit mixture in the center of chilled dough (still on parchment on baking sheet) and spread out evenly, leaving a 3\" border. Fold edges of dough up and over fruit, pleating as needed and being careful that folded edge of dough doesn’t tear (if it does, patch with dough scraps and pinch to seal). Pour cream into a small bowl and brush all over dough. Sprinkle sugar evenly over dough.Step 13Place galette in oven and immediately reduce heat to 375°. Bake, rotating halfway through, until crust is deep golden brown everywhere, fruit is softened, and juices are bubbling, 45–50 minutes. Let galette cool 2 hours before serving.Step 14Serve galette with whipped cream or ice cream if desired.How would you rate Peach-Plum Galette?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIt’s been said before but it bears repeating - this crust technique led to the best and flakiest crust I have ever made! I always struggle with pie dough but this was my best ever. I will continue to use this technique but will decrease the water next time, as my crust was a bit too moist. I also lost almost all of the juice from inside my galette and felt as though it could have used a bit more sugar (maybe due to peaches not being very sweet or the loss of juices). Either way, 5 stars for the crust alone!DanielleSan Francisco, CA9/13/2021Delicious.  Made with all peaches, and the grated ginger. Mind the salt in the filling—recipe calls for 1 tsp kosher; I used1/4 tsp Diamond Crystal kosher and any more would have been too salty. Crust technique is easy and very good (albeit messy) will use again for other galettes.  I thought 4 Tb ice water was going to be too much, but it was just right. (Very dry climate at the moment; I’d start with less if it was a rainy winter day.). Filling was too juicy and leaked out; I should not have added the liquid from the bowl of sliced peaches. (Could reduce that on the stove, with other flavor if desired [such as rosemary, per Ottolenghi], then “glaze” the peaches with it toward the end of baking.) Bake on rack low in oven.  Good with lime zest whipped cream. AnonymousOregon7/25/2021My hubby was craving a peach cobbler, but I decided to try something different. Followed the directions, except used only peaches. While I struggled with the crust (seemed too moist), the results were fantastic. The crust was the best I have ever used and will be my go-to from now on. Flakey, tender, and buttery. A very rustic yet beautiful presentation. Will most certainly make over and over again. AnonymousDetroit, MI 10/11/2020Amazing! I was skeptical about this unusual process but it turned out beautifully. Extremely flaky crust and nice, tart filling. It was also lots of fun, so I'll be using the pastry process again for all kinds of baking. Anonymousottawa9/2/2020Fabulous recipe!! Easily my favorite, as the filling isn't overly sweet and has a zesty flavor thanks to the lime juice! The crust was easy to make and oh so flakey. A definite winner! AnonymousPortland, OR 8/17/2020This recipe was easier than I thought! I ended up with a lot of extra filling, but otherwise this worked perfectly. I initially thought the dough instructions were confusing, but once I got into it, it worked great! AnonymousBrooklyn, New York 8/16/2020This was absolutely delicious--the ginger was a particular standout that received compliments from my entire family. The dough, to my delight, was perfectly flaky and buttery, and I would definitely use the process for other recipes. Next time, I may just use all peaches (my plums weren't great), but overall, I highly recommend this galette!Anonymous8/16/2020I loved making this dough.   It was easy, creative and I watched the butter become a part of the dough without disappearing.  I am making the rest tomorrow, peach and nectarine.   I didn't find the dough wet at all and it came together exactly as written.  thanks BA\nToronto, OntarioAnonymousToronto, Canada7/28/2020I really liked this recipe, but found that the crust was wayyy too wet and would suggest adding a bit at a time until it just comes together. I ended up remaking the crust and only used 2 Tbsp of water. I weighed  the flour, too so not sure what happened. \nEither way, the filling was delicious and the remade crust was sooo buttery and flaky!Anonymousbk7/21/2020This CRUST! Oh my, it was the most buttery, flaky crust I've ever made! The instructions and pictures were SO helpful. I'll be using this method for my crusts from now on! I made it a day ahead and it worked out perfectly. I used just peaches for it and it was so fresh and tasty! We had a little bit of \"leakage\" on the crust so next time I think I will drain off some of the natural juices of the peaches before adding to the cornstarch mixture and make sure the crust is well crimped. But man, it was still sooooo tasty! Perfect Memorial Day dessert!MollsLundBeaumont, TX5/26/2020Loooooooved this as usual. Tasted it both warm and completly cool and have to agree that the flavour shine much more through when it's cold. Was inspired by the Peach and Sesame Crumble and sprinkled some sesame seeds on top. Absolutley loved the sweet flavours of the fruit with the nuttiness of the sesame!kykra9/22/2019I’ve struggled with pie crusts for over 30 years.  Using this method, I made my first ever flaky, tender crust.  Thank you!  (The filling was pretty good, too.  I’d use candied ginger next time.)AnonymousCanada9/7/2019Subarashi da na! Or, Spettacolare! \n( ͡ᵔ ͜ʖ ͡ᵔ )AnonymousLong Beach, CA9/4/2019This pastry recipe, using the suggested process was difficult for me.  The butter and flour stuck to the rolling pin.  It was so “short” that I had to press it onto the sheet pan after cooling the dough.  Turned out more like a crumble after baking.  But delicious!  I may use my preferred pastry technique the next time, however.  (Use “Anonymous) for my name, please.)AnonymousNew Mexico9/1/2019I used all peaches for this recipe, could not recommend it enough! The pastry is very flakey and tender, the ginger and lime in the recipe make everything taste super fresh and delicious. Would make it again! If anyone is having trouble with the pastry techniques, Carla has a video for an apple tart where she uses the same pie dough!AnonymousKingston,ON8/28/2019Explore Bon AppétitGaletteDessertFruit DessertPeachStone FruitFruitPlumNectarineCherryApricotSummerNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Carla Lalli Music"]}