{"id": "0ae6a5b16ea5e0ed81de38329716d2a9", "url": "https://www.bonappetit.com/recipe/french-toast-casserole", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "French Toast Casserole Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrench Toast CasseroleBy Molly BazDecember 18, 20184.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis French toast recipe is the ultimate hands-off entertaining brunch dish. Set this up the night before and all you’ll have to do in the morning is brush it with butter and bake.Ingredients6 servings11-lb. challah, brioche, or Pullman loaf, sliced 1\" thick3Tbsp. unsalted butter, melted, plus more for pan6large eggs1¾cups heavy cream1¾cups whole milk⅓cup (packed) light brown sugar1½tsp. ground cinnamon½tsp. ground cardamom¾tsp. kosher salt½tsp. finely grated orange zest (optional)1Tbsp. demerara sugar½cup crème fraîcheMaple syrup (for serving)PreparationStep 1Preheat oven to 325°. Spread bread on a rimmed baking sheet and bake, turning bread halfway through, until dried out and lightly golden brown, 20–25 minutes.Step 2Meanwhile, butter a 13x9\" baking dish. Whisk eggs, cream, milk, brown sugar, cinnamon, cardamom, salt, and orange zest (if using) in a medium bowl.Step 3Arrange bread in overlapping rows in prepared dish. Pour custard over, pressing bread down into custard to help soak it up. Let sit 5 minutes, then press down once more. Cover and chill at least 2 hours or up to overnight.Step 4Place a rack in top third of oven; preheat to 325°. Let bread sit out at room temperature while oven preheats, at least 30 minutes. Uncover pan, tilt, and ladle custard back over tops of bread. Press down once more to submerge. Brush tops of bread with 3 Tbsp. melted butter. Sprinkle with demerara sugar. Bake bread until it is lightly golden, puffed, and pulling away from edges of pan, and butter is bubbling, 30–40 minutes.Step 5Let cool slightly. Serve with crème fraîche and maple syrup alongside.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate French Toast Casserole?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleHave made this every Christmas for 3 years.  This yer I served it the day after Thanksgiving for the family and it was a hit.  I used Brioche this time and it was equally delicious.  Unfortunately, I’ve forgotten the crème fraiche every time I’ve made it but it’s super delicious without it for sure.  I always serve it with peppers maple bacon to cut some of the sweetness.  You’ll love it!DarlingPhiladelphia, PA11/26/2021Delicious and pretty simple. Challah bread is a great choice! And definitely don't forget the creme for this one! The cool subtle tang is the perfect balance to the rich sweetness of the french toast.TahliaAustin, TX1/10/2019This was super delicious and easy. Assembled on Christmas Eve and baked it Christmas morning. Perfect! AnonymousAtlanta, GA12/25/2018This is a wonderful recipe but a few cautionary notes as a Registered Dietitian.  Eggs can have Salmonella on the outside and inside of the shell.  Letting them sit, even refrigerated overnight can cause Salmonella poisoning as they multiply.  Letting them sit again for 30 minutes makes it even worse and is very risky.  I would suggest only using pasteurized eggs to prevent the overgrowth if Salmonella bacteria.barbrd242Florida 12/21/2018Explore Bon AppétitCasseroleCinnamonHerbs & SpicesCardamomEasyVegetarianNut-FreeBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Molly Baz"]}