{"id": "0aec4c7d34734cfe8d5171ab091e75e6", "url": "https://www.bonappetit.com/story/pork-floss-rolls", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "These Pork Floss Rolls Are a Savory Bun Lover’s Dream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Pork Floss Rolls Are a Savory Bun Lover’s DreamThink salty, porky cinnamon rolls. These buns from Kristina Cho’s new book, Mooncakes and Milk Bread, are completely irresistible.By Christina ChaeyOctober 15, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Flipping through Kristina Cho’s incredible new cookbook Mooncakes and Milk Bread: Sweet and Savory Recipes Inspired by Chinese Bakeries, it felt impossible to pick the recipe I wanted to make first. I quickly found my kindred treats in chapter three—“Pork Buns and Beyond”—which is filled with both iconic and new-school savory snacks like char siu bao filled with crimson barbecued pork, a jaw-dropping deep-dish pepperoni bread, and beautiful hot dog flower buns that are as miraculous to gaze upon as they are to pull apart, one “petal” at a time. Savory buns are my favorite Chinese bakery delicacy, so I was delighted to find an entire chapter featuring twists on nostalgic favorites.Mooncakes and Milk Bread$30 $27 at Amazon$30 $28 at Bookshop.orgBut it was the Pork Floss and Seaweed Pull-Apart Rolls that I and everyone I baked them for could not stop raving about. We had seconds and thirds, fought over the squidgiest (and arguably best) bun in the center of the pan, and ate all the leftover pork floss straight from the container.The bun itself is made from Cho’s master milk bread recipe, which she incorporates into all kinds of recipes throughout the book. It’s bouncy and light and employs tangzhong, a quick roux of milk and flour that gets mixed into the yeasted dough, which keeps the resulting bread super moist. Once you roll out the dough into a rectangle, you spread on a layer of sweet Kewpie mayonnaise, top with a generous sprinkling of seaweed-savory furikake, and finish it all off with a thick layer of pork floss before the dough gets rolled up and sliced into buns (think savory cinnamon rolls). Once baked, these tall and fluffy buns have a touch of sweetness from the mayo, savoriness from the furikake, and a punch of salty richness from the pork floss in every bite.Pork floss will be a familiar sight to anyone who’s poured over the display cases at any Chinese bakery, where you’re likely to find it as a coating on tall, bouncy sponge cakes, in Swiss-roll-style cakes, or tucked into buns. (It’s also a very popular topping for jook or congee.) Also known as pork sung or rou song, among other names, pork floss is perfectly named: It’s finely shredded pork seasoned with sweet and salty ingredients such as sugar and soy sauce. The pork is then dehydrated until wispy and cotton candy-like. These sweet-salty morsels of dried pork are absolutely irresistible, melting on the tongue and leaving you wishing you had a big spun cone of the stuff whilst walking around a county fair.Kimbo Pork Floss$4 at Umamicart$4 at Weee!Pork floss is most readily available at Chinese and Asian markets, but if you haven’t shopped for it before, let Cho walk you down the aisles of the Asian grocery store—the book dedicates several pages to breaking down all the wonders you’ll find in the aisles, from myriad sauces to dried mushrooms and beans to the vast world of cured, salted, and dried meats. And if you’re lucky enough to come upon pork floss, don’t think twice—buy the biggest container you can find, and make these savory buns before you eat it all straight from the jar.Get the Recipe:Pork Floss and Seaweed Pull-Apart RollsThese pillowy milk bread buns are filled with an irresistible combo of sweet-and-salty pork floss, mayonnaise, and savory furikake.View RecipeExplore Bon AppétitcookingCookbooksShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Christina Chaey"]}