{"id": "0b0c9fdc29284d601f5e85c17cfda4d5", "url": "https://www.bonappetit.com/story/restaurant-gifts-that-give-back-2020", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "11 Charitable Gifts That Give Back to Restaurants in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertClose11 Gifts for People Who Want to Support Restaurants (Who Doesn't?)ShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopUnder $35Under $100 (And a Few Splurges!)CookbooksRestaurant MerchHealthyish FavesMarcus's PicksGift Guide 202011 Gifts for People Who Want to Support Restaurants (Who Doesn't?)From chili-illustrated T-shirts to mail-order salted honey pie, here’s our guide to gifts that give back to the restaurants you love.By Alex DelanyNovember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This holiday season you may not be able to dine with your loved ones at Seattle or Detroit or Washington, D.C.’s best restaurants. But you can still show them you care while also supporting your favorite spots by buying their merch and house-made pantry items—all things that conjure up memories of sitting at a table filled with food, friends, and family. From spice rubs to jackets to sauces, these are the gifts that give back in 2020—they help the restaurants we love because they’re made by the restaurants we love.Tacos 1986 Coach’s JacketWant to look like you coach a taco-eating team? (Yes.) Los Angeles mini chain Tacos 1986’s jacket is the place to start. Whoever wears this bright red outerwear is clearly experienced in downing adobada tacos and mushroom quesadillas.Photo by Jessica PettwayCoach’s Jacket$69 at Tacos 1986Sea Creatures Smoked HerringScan any menu from chef-owner Renee Erickson’s Seattle restaurants and you won’t find a fish-less one among them. Her Sea Creatures restaurant group knows their fish, which makes snapping up a tin of their smoked wild-caught Alaskan herring a no-brainer. The fillets are the perfect salty, buttery additions to toast. If that doesn’t sell you, the illustration of a herring smoking a pipe should. (FYI: The actual tins and labels may vary, but it’s all the same smoked herring inside.)Sea Creatures Smoked Herring$10 at Sea CreaturesNong’s Khao Man Gai SauceYou know what all great marinades can do besides marinate? They can be used to dip or drizzle. And this sauce from chef-owner Nong Poonsukwattana of Nong’s Khao Man Gai in Portland, OR, is just as good to marinate your chicken in as it is to dip your (cooked) chicken in. The combo of fresh ginger, local soy sauce, chiles, and garlic gets just about any job done.Aaron LeeNong’s Khao Man Gai Sauce$12 at Nong’s Khao Man Gai$17 at AmazonBen’s Chili Bowl Classic Yellow T-ShirtA bowl of chili from Ben’s is a timeless D.C. classic. And while you might not be eating a half smoke at Ben’s, you can don a T-shirt with an illustration of a bowl of Ben’s chili on it, which is also a timeless classic.Photo by Jessica PettwayBen’s Classic Yellow T-Shirt$18 at Ben’s Chili BowlXi’an Famous Foods Chili OilWe can’t imagine life without this spicy, tongue-tingling condiment on hand at all times. It’s the thing that made us fall in love with Xi’an Famous Foods in New York City, a small chain of western Chinese noodle shops run by owner Jason Wang. And we’re here to remind you to stock up, in case you and your loved ones are running low on packets.Chili Oil Sampler Pack$16 at Xi’an Famous FoodsMusang Wild Cat BlanketHere is a short list of situations where you could use this blanket: Sitting next to a festive bonfire, drinking a hot toddy. Standing in front of the fridge at 1 a.m., deciding on which Tupperware of leftovers to open. Or maybe eating lumpiang Shanghai and roast chicken slathered in adobo on the patio of Musang in Seattle, where this blanket that feels like your favorite hoodie comes from. That last option sounds pretty good to us.Photo by Jessica PettwayWild Cat Blanket$35 at Musang SeattleHell’s Backbone Grill Spice RubBuying gifts for a person is one thing. But buying gifts for someone and their steak? That’s next level. And this spice rub—packed with chiles, cumin, and coriander and made by Hell’s Backbone Grill & Farm in Boulder, UT—falls into the category of being a gift for both.Photo by Jessica PettwayDesert in a Jar Spice Rub$14 at Hell’s BackboneLil’ Deb’s Oasis CandlesIf you’re sitting in a dark, vibe-less room, may we suggest lighting some candles? Perhaps a couple that Lil’ Deb’s Oasis—a BA favorite restaurant, bar, and party zone in Hudson, NY—produced in collaboration with candlemaker Essentially Charlie? Made from beeswax and coconut oil and fragrant with frankincense, cedar, and eucalyptus, these scented candles deliver both light and vibes.Essentially Charlie Gay Candle$25 at Lil’ Deb’s OasisEssentially Charlie Luck Candle$25 at Lil’ Deb’s OasisThe Grey Salted Honey PieChef-owner Mashama Bailey and pastry chef Natasha Gaskill know pie crust. At The Grey, in Savannah, it’s a supremely flaky, buttery, golden vessel for whatever gets placed into it. And in this case, it’s salted honey, which tastes like the gooey bottom layer of pecan pie but without the pecans.The Grey Salted Honey Pie$62 at GoldbellyRose’s Fine Food SweatshirtChef-owner Molly Mitchell’s family-run spot, Rose’s Fine Foods, is our go-to for a couple mugs of coffee and made-from-scratch diner classics whenever we find ourselves in Detroit. The pierogies and pancakes from Rose’s will warm your soul and body—and so will this cake sweatshirt.Photo by Jessica PettwayCake Sweatshirt$35 at Rose’s Fine FoodsLos Poblanos Green Chile JamWe can’t stop dipping into this fire-roasted green chile jam from Los Poblanos, a beautiful plot of land that’s home to floral gardens, an organic farm, Campo Restaurant, a boutique inn, and a farm shop in Los Ranchos de Albuquerque, NM. It’s sweet, spicy, smoky, and floral—best spread on toasted sourdough, served on a cheese plate, or hidden in a stocking by the fireplace.Green Chile Jam$16 at Los Poblanos Farm ShopExplore Bon AppétitGift GuidesRestaurantsShoppingHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Alex Delany"]}