{"id": "0b12807f55062696086ad3831211c284", "url": "https://www.bonappetit.com/story/paul-bocuse-chefs-remembrance", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Paul Bocuse Dies at 91: How Chefs Are Remembering the Revered French Chef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePaul Bocuse Dies at 91: How Chefs Are Remembering the Revered French ChefPaul Bocuse's influence has spanned generations of chefs, from all over the world.By Bon AppétitJanuary 20, 2018FacebookTwitterEmailChef Paul Bocuse in 2012.JEFF PACHOUD/AFP/Getty ImagesFacebookTwitterEmailPaul Bocuse, perhaps the most well-known contemporary French chef, has died at 91. He was known for his high-end cuisine at Auberge du Pont de Collonges, especially for such dishes as truffle soup with a dramatic dome of puff pastry and Bresse chicken cooked in a bladder. Bocuse began cooking when he was 15, and won his first Michelin star in 1958 (and his second in 1960, third in 1965). In 1975 he was awarded the French Legion of Honor. He was the author of several cookbooks and founder of the Bocuse d'Or, the international culinary competition in which teams from different countries create extravagant platters featuring a range of complicated cooking techniques.Chef Riad Nasr, previously of Balthazar and the upcoming restaurant Frenchette which opens in February in New York, visited Bocuse's restaurant in Lyons last September. Bocuse's French Cooking was one of the first cookbooks Nasr received, and the trip was something of a pilgrimage:\"In your mind, you have this larger than life image, you think you're walking into this massive chateau, but it's a pretty humble dining room, and humble restaurant, with a small kitchen that's been virtually unchanged for how many years,\" he remembered. \"It was an incredible experience. We got there at 12:30, and left at 4:30, because we ordered everything. Three carts of cheese come by. The same thing with desserts: the fruit desserts, tarts, custards. The dishes you learned to master in culinary school are there, breathing and alive.\"Instagram contentThis content can also be viewed on the site it originates from.The famous truffle soup, above, lived up to every expectation of grandeur: \"There's squab, duck, I don't know how many different birds are in there, in this rich consommé, with a fistful of truffles,\" said Nasr, \"You think you're going to get 2 or 3 slices, but in every spoonful there's like six slices of truffle and diced foie gras, julienned vegetable. It sets the table for what's to come. It's homey and luxurious all at once. Everything that his cuisine embodies.\"Chef Paul Bocuse (and truffle soup) in his kitchen in Lyon, France in February, 1976.\nMichel ARTAULT/Gamma-Rapho via Getty ImagesMore chefs and people in the food industry remember his influence:Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Explore Bon AppétitChefsFrenchRead MorecultureJulia Child, Like You've Never Seen Her BeforeBy Alex BeggscultureJacques Pépin on His Unabashed Love for New York City Street FoodBy Christina Chaeyrecipes43 French Recipes That Are Basically the Same as Hopping on a Plane to ParisGallery43 SlidesBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-20", "author": ["Condé Nast", "Bon Appétit"]}