{"id": "0b1e4740b37fd43f9942c54026582923", "url": "https://www.bonappetit.com/story/bamboo-picnic-plates", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "With These Bamboo Plates, the World Is My Picnic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWith These Bamboo Plates, the World Is My PicnicWhen it comes to packable dishware, bamboo does it best.By Aliza AbarbanelSeptember 11, 2020FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!In this era of outdoor dining, my picnic basket (read: oversized tote bag) is always ready to go. Whether I’m eating takeout tetelas in a shady park patch or sipping sours on a concrete-covered roof, I’m going to need a few essentials: bug spray, a bottle opener, and some bamboo plates to divvy up the bounty.For decades melamine has been the de facto material for lightweight picnic tableware. But a new crop of bamboo offerings from Toronto-based design brand Xenia Taler and L.A.-based design hub Poketo make a compelling case for branching out into new textures. The cheery patterns—tangerine terrazzo, peachy gingham, indigo triangles—instantly upgrade any alfresco situation, even if your picnic spot is just your fire escape.My newfound devotion to bamboo goes far beyond aesthetics: The fast-growing grass is more sustainable than plastic-derived melamine but just as crack-proof. Unlike my precious ceramic shallow bowl, which I live in constant fear of shattering, I can use these plates all day without a single heart palpitation. If I had a dishwasher, I’d toss them in there without blinking an eye. And if they do break, the biodegradable bamboo is ideal for the compost bin.Picnic purists may point out that Labor Day is behind us, but I won’t let the calendar dictate my social plans—I’ll keep a stack of these bamboo plates in my bag through October, though I’ve already migrated a few favorites to my kitchen cabinets. This winter I’ll pile potato salad on a pastel gingham plate...then head straight to the couch.Photo by Laura MurrayPoketo Bamboo Dinner Plates, Set of Four$48 at GarmentoryPhoto by Laura MurrayBamboo Side Plates, Set of Four$40 at Xenia TalerExplore Bon AppétitHealthyishHealthyish Loves ItFashion PlatesShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-11", "author": ["Condé Nast", "Aliza Abarbanel"]}