{"id": "0b26f48f84b63477ecd6cf35f51d0767", "url": "https://www.bonappetit.com/recipe/saucy-spiced-cod-with-corn", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Saucy Spiced Cod With Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSaucy Spiced Cod With CornBy Chris MoroccoAugust 18, 20204.3(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintWhen chopping an onion and a couple cloves of garlic and maybe a knob of ginger is going to take 15 more minutes than you feel like spending on dinner, sizzling whole spices into hot fat delivers big flavor in a fraction of the time. Inspired by Indian chhonk, we throw whole spices into hot fat, which dials up their flavor and makes them crispy and fun to eat.Ingredients4 Servings5Tbsp. unsalted butter2garlic cloves, crushed1½tsp. coriander seeds¾tsp. cumin seeds¾tsp. mild red pepper flakes or ½ tsp. crushed red pepper flakes½tsp. ground turmericKosher salt, freshly ground pepper1tsp. soy sauce3ears of corn, husked, kernels removed from cobs (about 3 cups)45–6-oz. cod or other flaky whitefish filletsMint leaves and toasted sesame seeds (for serving)PreparationStep 1Melt butter in a large skillet with a lid over medium heat. Add garlic, coriander seeds, and cumin seeds and cook, swirling pan often, until butter is foaming and spices are very fragrant, about 2 minutes (reduce heat if butter is starting to brown). Add red pepper flakes, turmeric, a big pinch of salt, and several grinds of pepper. Cook, swirling pan, until very fragrant, about 30 seconds. Add ½ cup water (careful, it may spatter a bit), then soy sauce.Step 2Add corn to skillet. Season fish lightly with salt and nestle into corn and broth; bring to a simmer. Reduce heat, cover, and simmer gently until fish flakes easily with a fork, 7–9 minutes.Step 3Divide fish among bowls. Taste broth and season with more salt if needed. Divide corn and broth among bowls and top with mint and sesame seeds.How would you rate Saucy Spiced Cod With Corn?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleDelicious, although one guest thought too much turmeric. I used FROZEN ( no need to defrost) cod filet and baked for 20 minutes at 375. Wild frozen individually wrapped cod filets are in the frozen seafood section of Safeway. Prepare corn per recipe, nestle frozen filets into corn. Bake.suzanne sommerNapa, CA11/29/2021Superb recipe with wonderful flavors. It is very easy to make and is ideal for a fast meal that tastes like you spent hours in the kitchen. Rick GriffithNantucket, MA7/16/2021A great weekday dinner. I was looking for a recipe for a defrosted fish. This worked out well. Only the second time, I used double amount of spices and water to make more of that delicious sauce. And to make it more healthy I used olive oil with a little bit of butter.RasaNew York6/2/2021Amazing recipe, SO fast and delicious. I used defrosted frozen corn. If you don’t like the texture of the spices whole, use ground instead but reduce the quantities a bit. A weeknight staple from now on. AnonymousBrooklyn4/14/2021This is great. It will join the regular rotation. I had my doubts about the corn cooking in that time frame but it didLisaCarrollton, TX3/4/2021We love this meal! Make it all the time so simple and comes together rather quickly.AnonymousNY12/3/2020deeeeeeeee licious. I changed nothing, I'd change nothing. Make it, eat it.AnonymousAustralia 10/20/2020Loved the spiced corn, the cod was so-so for me.  I added halved cherry tomatoes and a squeeze of lemon for brightness.AnonymousSEATTLE, WA9/29/2020Yes!!!  OMG, loved this easy delicious dish.  gingersnap1Lawrenceville GA9/1/2020Made this tonight and the spices and corn were fabulous. I loved the hits of whole coriander and cumin. Granted, the cod was overwhelmed since it's so delicate and, frankly, lacking in flavor of its own (and I had some beautiful wild pieces from a fish share). I would absolutely make this again, but would use a different protein. My take: this would be better with mackerel or lamb. I served it on leftover jasmine rice that I'd cooked with white miso and a little soy sauce a couple days ago. Didn't have plain white sesame seeds, but had black. I'd skip those in the future.AnonymousMinneapolis8/27/2020We thought this dish was flavorsome and simple. The cod was not overwhelmed by the corn but, like a Goan fish curry, the sweetness of the corn curry enhanced the distinctive flavor of our cod. We used only half the butter and might tone down the chili flakes a tad. Dave and Lisa, CincinnatiDavid MooreCincinnati, OH8/27/2020These negative reviewers don’t know what they’re talking about. This was delicious and so easy! Shout out out to the fabulous Sea Breeze Fish Market in Hell’s Kitchen!AnonymousNYC8/27/2020It’s the use of ethnic flavors and not standing with your POC creators for me \n\nNot a good balance of flavors, overwhelms the delicate white fish AnonymousNew York8/26/2020These flavors (and proportions of spice) did not make a whole lot of sense together to my palate. I found the amount of whole spices much too heavy. The strength of the spices also did not seem a good match with delicate flaky white fish. The sweetness of corn, the saving grace of the dish, was also mostly overpowered. (I made a side of basmati rice and it diffused it somewhat.)  Some nice elements but not a happy marriage overall. Anonymous8/26/2020Easy and delicious! I love a “one pot” recipe!AnonymousNewport Beach, CA8/26/2020Explore Bon AppétitFishSeafoodCodCornVegetableSummerEasyOne-Pot MealsQuickWeeknight MealsMainGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Chris Morocco"]}