{"id": "0b285a70fb9b3320e28303a086e98e67", "url": "https://www.bonappetit.com/recipe/candied-cucumbers-with-vanilla-whip", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Candied Cucumbers With Vanilla Whip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCandied Cucumbers With Vanilla WhipBy Lani HallidaySeptember 3, 20202.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Tami HardemanEmailPinterestPrintEmailPinterestPrintCucumbers are transformed into candy-like bites in this unexpected dessert inspired by Eton mess, a British summer classic typically featuring layers of strawberries, broken meringue, and whipped cream. This homage swaps out the macerated berries for candied cucumbers, flavors the whipped cream with lime zest, and uses toasted almonds to provide the texture and bite typically provided by the crunchy meringue. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.Ingredients4 ServingsCandied cucumbers2cups sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt6medium Persian cucumbers or 1 large English hothouse cucumber (about 1 lb.), peeled, cut into 1\" pieces2tsp. vanilla extractWhipped cream and assembly1cup sliced almonds2cups chilled heavy cream½cup sugar, dividedZest of 1 lime1vanilla bean, split lengthwisePreparationCandied cucumbersStep 1Preheat oven to 350°. Bring sugar, salt, and 2 cups water to a boil in a medium saucepan. Reduce heat, carefully add cucumbers, then vanilla and simmer gently 10 minutes.Step 2Using a slotted spoon, transfer cucumbers to a parchment-lined baking sheet; spread out in a single layer. (Save the infused syrup! It’s great in cocktails or any drink you want to add a subtle cucumber flavor to and will keep airtight up to 3 months.) Bake cucumbers until almost tacky (you don’t want them to be too wet), 12–15 minutes. Let cool on baking sheet.Whipped cream and assemblyStep 3While the cucumbers are cooling, toast almonds in a small skillet over medium heat, stirring often, until golden brown, about 5 minutes. Transfer to a plate and let cool.Step 4Whisk cream and 2 Tbsp. sugar in a chilled medium bowl until soft peaks form (chilling the whisk so it’s cold is a good idea too!).Step 5Add lime zest and scrape in seeds from vanilla bean; discard pod. Add remaining sugar and whisk until firm peaks form.Step 6To assemble, set 4 candied cucumber pieces and a generous tablespoon or two of almonds aside. Layer lime whipped cream, remaining cucumbers, then remaining almonds in tall glasses, ending with lime whipped cream. Top each with a reserved piece of candied cucumber and some of the reserved almonds.How would you rate Candied Cucumbers With Vanilla Whip?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was just weird. The limey whipped creme was good thoughAnonymousSan Francisco 10/5/2020I liked this unique refreshing dessert! It was quick and easy to make. My guests were pleasantly surprised. I added just a touch of lime juice to the whipped cream. AnonymousColumbus Ohio9/27/2020I really wanted to love this but it was among the worst desserts and bon appetit recipes i've ever made! The candied cucumber was a horribly unpleasant texture, and the taste was strange and terrible. They brought down everything else they touched- I wasn't able to stomach whip cream or almonds for days after just from the association. I've never seen my entire family fail to finish dessert before. That said, every other component besides the cucumbers was delightful! SaladFriendsBoston9/18/2020Explore Bon AppétitDessertCucumberVegetableVanillaHerbs & SpicesSummerVegetarianGluten-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Lani Halliday"]}