{"id": "0b2c0e0f0fccdf41958e74030b0356d9", "url": "https://www.bonappetit.com/story/hanya-yanagihara-dream-dinner-party", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Hanya Yanagihara’s Dream Dinner Party Is One Big Performance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHanya Yanagihara’s Dream Dinner Party Is One Big PerformanceThe beloved author is all about dinner and a show.By Dawn DavisJanuary 17, 2022FacebookTwitterEmailIllustration by Lauren TamakiFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.At many a dinner party I attended a few years back, talk would inevitably turn to author Hanya Yanagihara’s sweeping (and heartbreaking) novel A Little Life, a Man Booker Prize–short-listed best seller exploring the relationships between four friends as they move from college to middle age. So I couldn’t help but wonder who the author would have at her dream gathering—and what they’d talk about. What’s your philosophy when composing a dinner party guest list? And which three people do you invite? I love planning parties, and I especially love doing seating charts. When you’re hosting a large party, you want to have anchors every four seats or so: people who understand that they’re there to work, to make conversation and include shyer guests. But since this is a small party, I’d be indulgent and instead invite entertainers—people who know how to tell a good story. People who probably don’t know one another but are separated by just one or two degrees. So I’d invite comedian Bowen Yang and playwrights Tony Kushner and Jeremy O. Harris. Playwrights make good guests because they know how to make conversation. What is on the menu?It’s best to serve food that has emotional meaning and reveals something personal about you. Whenever I go home to Hawaii, I always ask my mother to make kook soo, a Korean dish she makes with rice noodles in a pork broth. She tops it with chun (in Hawaii this is mostly made with vegetables like zucchini versus everywhere else, where it’s made with meat), shredded pork tossed in shoyu and green onions, and cucumber namul. I’d also try to trick her into making her mandoo: I folded 500 of them this summer and developed a tic in my hand.Where do you host this gathering? Your home?No, I’d host it at the Park Avenue Armory in New York: a vast space with high ceilings and a table for six in the middle (rectangular, not round). It would be lit with hundreds of black taper candles but still quite dark. There’s no soundtrack, no music. The waiters will wear all black, with black shrouds over their faces like the puppeteers in Bunraku theater. The plates will be the snake pattern by Laboratorio Paravicini. I think the food should be humble and the space grand, or the space should be simple and the food very elevated. What’s the talk of the night?If you invite the right people, you get to just sit back and listen to them.You also get to invite one character from your new novel, To Paradise, a three-part epic taking place in alternate past, present, and future versions of NYC. Who?Dr. Charles Griffith, from the third section of the book, which takes place in the year 2093. He’s a virologist in a time of pandemics and has had to make certain moral compromises—I’m always interested in people who in good faith make decisions they later live to regret.To Paradise by Hanya Yanagihara$32 $20 at AmazonWhere would you dine the next day, to reward yourself for all the hard work?I’d go to Pho Tô-Châu in Honolulu’s Chinatown—it’s the best pho I’ve ever had in America. The restaurant is run by three elderly siblings, and they always remember my order: the No. 1, with raw steak on the side and extra culantro, plus spring rolls and their house-made lemon soda.Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-17", "author": ["Condé Nast", "Dawn Davis"]}