{"id": "0b32c93d48188fbf2ad93046a83bb7f4", "url": "https://www.bonappetit.com/story/ortiz-bonito-del-norte-canned-tuna", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "The Canned Tuna I Bring to the Beach (Yes, the Beach!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Canned Tuna I Bring to the Beach (Yes, the Beach!)It’s that good. But also, bring some home, because we’re making niçoise toast with it.By Molly BazMay 22, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Anna BillingskogFacebookTwitterEmailI first caught sight of the primary-colored can of Ortiz Bonito del Norte in a small grocery in Menorca, Spain. I was there with my husband, and we were stocking up on supplies before heading out for a day at the beach. But a day at the beach in Menorca meant we’d endure a long and rocky trek along the seaside cliffs until we found the perfect crystal-clear cove. The kind of place where you wouldn’t be surprised to see a mermaid swimming around; these beaches were that majestic.But enough with my fairytale. The point is, we needed to pack a picnic. And I needed that picnic to be epic. Which in my book almost always means some combination of the following: a can or two of high quality tuna, a jar of olives, some pickle-y snack—cornichons or pickled peppers—and a head of little gem lettuce. This equips me with all of the essential elements to create a beachside lettuce wrap.  If ham and cheese sandwiches at the beach have always been your thing, give this picnic lineup a try. It has never failed me.I learned that day that Bonito Del Norte is NOT your average tin of Starkist. The two have nothing in common besides their containers. Ortiz oil-packed white tuna is beautifully poached and perfectly seasoned, never too salty. The fish gently flakes apart revealing lovely blush pink flesh—not that overcooked gray mushy stuff you might be used to hiding in mayonnaise. It comes submerged in buttery yellow olive oil—good enough to be drizzled onto your next niçoise salad. Tuna of this caliber doesn’t yearn to be swathed in mayonnaise and studded with celery. It shines most when simply dressed with a few drops of lemon juice and a pinch of flaky sea salt, which makes it perfectly suited for the low maintenance beach picnic. It is a high reward product that is truly worth the splurge.This is also the tuna I used for this new niçoise toast recipe, aka TOTES toast.\nPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenA few tuna and olive stuffed lettuce cups later I was hooked. Now back stateside, I am thrilled to see this product available in my local Whole Foods, at higher end markets, and even on Amazon. I’m telling you this is the good stuff, and it’s not just because I first tasted it on a white sand beach swirling with mermaids.Buy it: Ortiz Bonito Del Norte, White Tuna in Olive Oil, $30 for a pack of 4 on AmazonGet the recipe:Niçoise ToastFried bread, with buttery oil-packed tuna on top. This is what you call dinner toast.View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitTunaShoppingWere Into ItPrep SchoolRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}