{"id": "0b35bbea4cfd63b9dd6f81e2cd06cc18", "url": "https://www.bonappetit.com/story/how-to-support-restaurants", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "How to Support Restaurants and Their Workers Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusHow to Support Restaurants and Their Workers Right NowFeeling helpless? Here are several ways to help your favorite restaurants—and their staff—get through this unprecedented time, updated frequently. By MacKenzie Chung FeganSeptember 30, 2020FacebookTwitterEmailEmpty streets, restaurants and cafes make up the business area in the one mile containment zone on March 11, 2020 in New Rochelle, New York.Photo by Spencer Platt/Getty ImagesFacebookTwitterEmailEditor’s note: This page is being updated regularly to reflect new opportunities to support or get involved.We spend a lot of time writing about, thinking about, and, of course, eating at restaurants. So, as city and state governments impose curfews, limit the capacities of establishments, and close bars and restaurants entirely, we’re asking a lot questions: Will the restaurants we know and love be able to reopen in a post-COVID-19 world? How will the cooks, servers, bussers, and bartenders who staff those restaurants make it through the coming weeks and months with no income?The people who have fed us when we’ve needed comfort, popped bottles for us when we’ve had cause to celebrate, and brought pizza to our doorstep every other night of the week need relief— and fast. So we’ve put together this list of resources for anyone who wants to support restaurants, bars, and their staff during this unprecedented time. We want to be clear—it will take more than buying a T-shirt to save the restaurant industry. Whether or not you have the resources to make a donation or buy a gift card, contact your elected officials and tell them not to forget about the restaurant industry. Here’s what else you can do to help:Donate to an Existing NonprofitIf you want to support service workers whose livelihoods have been disrupted, there are several existing organizations—both regional and national—that provide aid to those in the restaurant industry. Many of these nonprofits have set up specific COVID-19 funds, and they have infrastructure and administration already in place.Restaurant Workers’ Community Foundation COVID-19 Emergency Relief Fund (national)One Fair Wage (California, Colorado, Florida, Illinois, New Jersey, New York, Maryland, Massachusetts, Michigan, Pennsylvania, and Washington, D.C.)Big Table (Seattle, Spokane, and San Diego)Restaurant Association of Metropolitan Washington Educated Eats / Hook Hall Helps (D.C.)Southern Smoke Emergency Relief Program (Houston)The Giving Kitchen (Georgia)The LEE Initiative (Louisville)The James Beard Foundation Relief Fund (national)The United States Bartenders’ Guild COVID-19 Relief Campaign (national)CORE: Children of Restaurant Employees (national)TX Restaurant Relief Fund (Texas)Colorado Restaurant Association Angel Relief Fund (Colorado)Restaurants Care (California)Golden Rule Charity (national)Detroit People’s Food Co-op (Detroit)Heart of a Dinner (New York City)New philanthropic cookbooks from Serving New York (left) and Family Meal (right)\nServing New York Illustration by Jordan Awan, Family Meal Illustration by Pete GamlenBuy a Recipe or a T-Shirt or a...Artists, spirits brands, and other companies are collaborating with individual restaurants to create a litany of products with proceeds benefitting relief funds.inHouse at Home Serving New York Cookbook: 48 pantry-friendly recipes from New York restaurants with proceeds going to ROAR x Robin Hood Foundation’s restaurant worker relief fund.Family Meal Recipes: Help one (or more!) of your favorite restaurants by downloading a recipe from this beautiful digital collection featuring designs from different illustrators.Buy This T-Shirt: Custom merch with sales benefitting restaurant partners.Merch Aid: Limited-edition tote bags and T-shirt tributes to small businesses (including many restaurants), each designed by a different artist.Feed Frontline Workers While Supporting RestaurantsMany hospital cafeterias are closed, and health care workers are too slammed to figure out how they’re getting their next healthy, sustaining meal. Donate to an organization that connects restaurants to hospitals—frontline workers get fed, and restaurants stay in business.Frontline FoodsWorld Central Kitchen #ChefsForAmericaFrontline Food TrucksJunzi’s Share a Meal programBuy Merch!This is a great time to show your support for your favorite restaurant, bar, or coffee shop by buying some merch. If you’ve been wearing the same ratty shirt for five days in a row, switch it up with this tee featuring Prince astride a Luck Dragon. Maybe you need a new tote bag to carry your belongings from one room of your apartment to the other room of your apartment. Wear this Dad hat to your next Zoom meeting and your boss need never know that you’re not wearing pants. Paint your nails Cafe Roze pink and remember that outside, it’s nearly spring! We also love the merch at these spots:Talat Market - AtlantaLongoven - Richmond, VALe Comptoir du Vin - BaltimoreHunky Dory - BrooklynRolf and Daughters - NashvilleWalrus and the Carpenter - SeattlePorta - New Jersey, NYC, and PhillyRose Foods - Portland, MEHeirloom Rustic Ales - TulsaRuss and Daughters - NYCManresa - Palo AltoElske - ChicagoTiconderoga Club - ATLLula Cafe - ChicagoKismet - L.A.Lorne Wine - MaineTired Hands Brewing - PhillyRose’s Fine Foods - DetroitBuxton Hall - AshevilleDiner - NYCHomage Brewing - L.A.McGuire-Moorman Restaurants - AustinMamaleh’s - BostonKopitiam - NYCTurkey and The Wolf - New OrleansBad Saint - D.C.Maketto - D.C.Fish Cheeks - NYCBuy Your Favorite Restaurant’s Products OnlineSome of your favorite restaurants sell their sauces and relishes online. You’re cooking at home, and they need some income; it’s a win-win. Think: Nong’s Khao Man Gai Sauce, 886’s Sze Daddy Chili Sauce, No 7 Subs Hot Sauce, Le Comptoir du Vin’s wine, everything in Khao Noodle Shop’s Khaovenience Mart…but there’s So. Much. More.Order a Gift Card...and Save It for LaterGift cards! Not just for awkward office holiday gift exchanges. Show your favorite restaurants some love now and cash in later when we’ll all be relearning how to dine in public. Give restaurant gift cards to all your friends with spring birthdays in the hopes that they’ll eventually take you out to dinner! If you don’t see the option to purchase a gift card on your fave restaurant’s website, slide into their DMs and demand they take your money.Restaurants participating in the Dining Bonds Initiative are offering gift certificates that work like a savings bond. You buy a bond for less than the face value, redeemable at some point in the future.Rally for Restaurants is a campaign to encourage diners to buy gift cards, and it will donate one dollar for every social media post to the Restaurant Workers’ Community Foundation and World Central Kitchen.Take ActionEvery gift card helps, but what the restaurant workers and the hospitality industry really need is the kind of large-scale relief that can only come from the government. A movement is starting to build across the country to agitate for everything from stimulus packages to rent forgiveness. A few emerging coalitions and activist organizations are below, but you can also contact your elected representatives directly and tell them that restaurants and their employees need help as much as the airlines and large corporations.America’s TableIndependent Restaurant CoalitionNew York Hospitality CoalitionAmerican Chefs PetitionDonate to a Relief FundDozens of ad hoc coalitions and relief funds have sprung up to address the immediate needs of workers in specific cities and regions. These efforts range from GoFundMe pages with in-depth descriptions of how funds will be distributed to spreadsheets with Venmo usernames of restaurant workers in need. Some of these more informal fundraising networks are partnering with larger organizations—including ones mentioned above—to disburse funds while some are creating their own models.Relief Opportunities for All Restaurants (ROAR)Restaurant Strong FundSonoma Family Meal Restaurant Network ResponseCharlottesville Restaurant Community FundService Workers’ Coalition (Brooklyn)Seattle Hospitality Emergency FundStock—which is also selling shirts (Chicago)Ohio Service Industry COVID-19 ReliefCOVID-19 Rhode Island Hospitality Relief FundBoston Area COVID-19 Restaurant Emergency FundLeveler.info (national, mobile access only)Eko Kitchen (San Francisco)Longevity Fund (New York City)Photo by Visual China Group via Getty Images/Visual China Group via Getty ImagesReach Out DirectlyMany small family-owned restaurants have neither merch nor digital gift cards to sell, and they might not be in the extended networks of the organizers of GoFundMe campaigns. How do we help the most vulnerable workers at, say, shuttered restaurants in Chinatown? Kevin Finch, the executive director of Big Table, recommends contacting the manager or owner of a favorite neighborhood restaurant and asking, “Who on your staff is most in need? Can I help that one person?” Finch says, “If you’re trying to make sure the most vulnerable don’t slip through the cracks, it’s not rocket science. It’s old-fashioned connection, person to person.”Explore Bon AppétitCoronavirusRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}