{"id": "0b3af1bbdf409fde34e308cd05ff9ecd", "url": "https://www.bonappetit.com/recipe/honeydew-salad-with-ginger-dressing-and-peanuts", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Honeydew Salad with Ginger Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueHoneydew Salad with Ginger Dressing and PeanutsBy Anna StockwellMay 21, 20194.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintJust the side your barbecue ribs are looking for, this all-green salad gets a kick from serrano, ginger, and just a hint of fish sauce. Keep the melon ice-cold for maximum contrast.Ingredients4–6 servings 6Tbsp. white wine vinegar1tsp. fish sauce1tsp. finely grated peeled ginger (from one 1\" piece)1tsp. light brown sugar1serrano chile, thinly sliced½medium honeydew melon (about 2 lb.), seeds and rind removed, flesh cut into wedges, wedges halved crosswise3small Persian cucumbers, sliced on a diagonal ¼\" thick1avocado, peeled, thinly sliced¼cup mint leaves¼cup salted, dry-roasted peanuts, coarsely choppedFlaky sea saltPreparationStep 1Whisk vinegar, fish sauce, ginger, and brown sugar in a large bowl to combine. Add chile and let sit 10 minutes.Step 2Add melon, cucumbers, and avocado and toss gently to coat. Transfer to a platter; top with mint and peanuts and sprinkle with salt.How would you rate Honeydew Salad with Ginger Dressing and Peanuts?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleAbsolutely addictive! Light, fresh, SO much flavor coming at you from all directions. MAKE THIS.AnonymousVirginia7/26/2021I love this salad! Few and simple ingredients, put together in a way that isn't fussy and makes a lot of sense. I cut all my pieces at the beginning of the week and assemble at lunch time. I feel like a super hero after eating this. So fresh and nutritious and filling!josiesappWY5/11/2020What a fantastic salad.  I used cilantro as I forgot the mint.    The heat from the chilli with the sweetness of the melon.....I really can’t say enough about this except my husband doesn’t like honeydew melon and while I was eating a smaller version of this salad all I could think was good more for me as I bit into a creamy avocado.   Who over developed this recipe is a Flippn genius.    .    AnonymousToronto Ontario Canada 9/3/2019This salad is delicious.  So light and refreshing.  It's a keeper and a recipe I'll go back to again and again.AnonymousSeattle8/7/2019This was delicious! We doubled the recipe, but on behalf of my kids, I regret doubling the serrano. It was just a bit too spicy for them. Everyone else loved it, and it was both simple and beautiful. AnonymousSF Bay Area7/7/2019Absolutely YES. I made this tasty salad for a summer bbq and everyone was asking for the recipe. I doubled the recipe and it served 12-15 as small side salads. Fresh, green and packs a punch. Definitely a new summer go-to!AnonymousSan Francisco 6/23/2019Great salad, will definitely make again. I substituted chopped flat parsley for mint. Could also use cilantro. Make sure melon is sweet and juicy. AnonymousSaranac Lake NY6/5/2019Explore Bon AppétitSaladHoneydewMelonFruitGingerHerbs & SpicesSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}