{"id": "0b657da4ce88f1c6f20cc1018c83e416", "url": "https://www.bonappetit.com/recipe/nan-e-berenji", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Nan-e Berenji Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueNan-e BerenjiBy Andy BaraghaniDecember 1, 20204.4(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“Nan-e berenji, a Persian rice flour cookie, is delicate and light,” says Andy Baraghani. His version cuts the sugar by a third and tops the cookies with poppy seeds, black sesame, finely ground pistachios, and freeze-dried raspberries for color. Traditionally eaten alongside bitter bergamot tea, this version is slightly less sweet so that it can stand on its own.IngredientsMakes about 501tsp. baking powder1tsp. ground cardamom¼tsp. kosher salt2¾cups (320 g) rice flour (preferably Bob’s Red Mill), plus more for dusting1cup (2 sticks) unsalted butter, room temperature1cup (110 g) powdered sugar1large egg1large egg yolk1Tbsp. rose waterPoppy seeds, black sesame seeds, finely ground pistachios, finely ground freeze-dried raspberries, and/or colored sanding sugar (for decorating)Special equipmentA 2\"-diameter cookie cutter; cookie stamp (optional)PreparationStep 1Whisk baking powder, cardamom, salt, and 2¾ cups (320 g) rice flour in a medium bowl. Process butter and powdered sugar in a food processor until very smooth and creamy. Add egg, egg yolk, and rose water and pulse until smooth. Add about half of dry ingredients; pulse just to combine. Add remaining dry ingredients and pulse until a soft dough forms. It should be moist but firm. Pat into a disk about 1\" thick. Wrap in plastic and chill at least 4 hours and up to 1 day.Step 2Let dough sit at room temperature 20 minutes. Place racks in upper and lower thirds of oven; preheat to 300°.Step 3Roll out dough on a lightly floured piece of parchment paper to about ¼\" thick, dusting with more rice flour as needed to keep from sticking. If using stamp, dip in flour and press into dough, then punch out cookies with lightly floured cutter. Arrange on 2 parchment-lined baking sheets, spacing 1\" apart. Sprinkle with toppings as desired.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until set around the edges, 8–10 minutes. Let cool on baking sheets.Do ahead: Cookies can be baked 1 day ahead. Store airtight at room temperature.How would you rate Nan-e Berenji?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThese cookies were light and delicate. The rose water is a bit strong and though I found it pleasant I think others found it off putting and the comment I got was they would be good with tea. This is the first time\nI worked with rice flour. I had no problems with Rolling or cutting the cookies. I would make again. Very gourmet   Chicago cooksChicago4/13/2021I have made this twice so far and I'm very pleased with the results.  \n\nThis was my first time using rice flour so I was a little uncertain, however, the first batch I made was vegan style cookies, which was well received.  My second batch I made according to the recipe and turned out very well.  \n\nThe change I made to both baking batches was the temperature on the cookies.  I wasn't pleased with the results at a low temp. and maybe because I am not familiar with the way rice flour bakes, but I changed the temperature to give the cookies a light golden brown \"bake\" look.  \n\nI was very happy to share these cookies as gifts to my coworkers and friends and I was asked to make another batch for my boss's brother.  \n\n\n\nAnonymouscalifornia12/29/2020This is the first time I've made a delicate cookie with rice flour. Despite using measurements in grams my dough did not come together well. I left the dough in the refrigerator for 18 hours. The dough was very difficult to roll out and quickly got too warm. I could only bake one batch at a time and had to put the door back in the freezer.  Since I did not have a cookie stamp I used a meat mallet to provide some texture and that was difficult as well because the cookies were so thin. The results were a bit better when I made them thicker. The taste is lovely but I would not make this again. AnonymousNew York, NY12/22/2020This is the second Nan-e Berenji cookie recipe that I've tried.  This one is much simpler, and quite frankly better, than the last one I tried.  I used brown rice flour because that was what I had.  The cookies have a great flavor - the cardamom really comes through!  They are quite delicate.  I had difficulty using the cookie press, so I just used cookie cutters, and that work fine.  I wasn't sure they would be sweet enough for me, so I baked them with a sprinkling of cardamom-laced sugar, and they were definitely sweet enough.AnonymousVirginia12/7/2020Explore Bon AppétitCookieDessertPersianMiddle EasternIranianRice FlourFlourGluten-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Andy Baraghani"]}