{"id": "0b65cfb4c16bd3e78ef730799c0b5e13", "url": "https://www.bonappetit.com/story/make-spaghetti-with-ramps-right-now", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Make Spaghetti With Ramps Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Spaghetti With Ramps Right NowBecause the shortest season of the year is ramp season.By Adam RapoportApril 23, 2019FacebookTwitterEmailTed CavanaughFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.There are two things on repeat this week in the RapoBuck household: One is the Billy Ray Cyrus remix of “Old Town Road” (thanks to our 11-year-old son), and the other is ramps.I can’t quit either.With ramps, though, I at least can offer a bit of insight and advice. To start, if you see some, buy some. They’re hard to miss. With their floppy green leaves and white-to-purple stems, they pile up at farmers’ markets and better grocers this time of year. And, as you know, food-media types like me can’t help but go on and on about them.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiIntoxicatingly fragrant, they’re technically wild leeks. But I like to think of them as the working man’s white truffle. They’re much more accessible and affordable, but like truffles, the less you do with them, the better.Want this letter before it hits the website? Sign up for our newsletter!You can’t go wrong with ramp pasta. You basically just sauté the bulbs and then the leaves in a combo of butter and olive oil; hit them with a splash of starchy, salty pasta water to create a saucy emulsion; and then finish the mixture with a blizzard of finely grated parm.And, if you’re smart like Alison Roman, you top off your limited-engagement springtime pasta with a shaving of lemon zest, to help cut through all that butter and cheese. I regretfully neglected this crowning step Saturday night, but I did top the pasta with a flourish of crunchy homemade breadcrumbs, because carbs plus carbs always equals awesome.Danny KimYou can do all sorts of other things with ramps—like pickle them and deep fry them and pesto them and pair them with softly scrambled eggs, which I’ll probably do because I love scrambled eggs. But mostly, like singing loudly along to “Old Town Road” over and over and over again, I’ll just make a lot of ramp pasta. The latter of which, at least, I know won’t make my 11-year-old cringe.Get the recipe:Spaghetti with RampsView RecipeExplore Bon AppétitAdam NewsletterRampRead MorecookingThis Perfect Baked Potato Was the Best Part of DinnerBy Adam RapoportcookingI Learned Some Lessons Spatchcocking a ChickenBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-23", "author": ["Condé Nast", "Adam Rapoport"]}