{"id": "0b8958cf80d62ee31c297c900315b816", "url": "https://www.bonappetit.com/recipe/pasta-with-mushrooms-and-cashew-cream", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Pasta With Mushrooms and Cashew Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssuePasta With Mushrooms and Cashew CreamBy Devonn FrancisJanuary 1, 20213.9(122)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintRecipe developer DeVonn Francis first came across nutritional yeast at a restaurant job, when chef Gerardo Gonzalez used the nutty yellow flakes to make homemade vegan Dorito dust. It's an inexpensive, shelf-stable ingredient that lends a distinct cheesiness when you don’t want or have the real thing. To create the creamy sauce for this pasta, Francis hydrates the yeast by blending it with cashews and pasta water until smooth. Might you mistake it for actual alfredo sauce? Maybe. Maybe not. It’s delicious either way. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 Servings1cup cashews4Tbsp. (or  more) extra-virgin olive oil, divided6oz. maitake mushrooms, torn into  bite-size pieces6oz. shiitake mushrooms, stems removed, torn into bite-size piecesKosher salt1medium leek, white and pale green parts only, halved lengthwise, thinly sliced crosswise2medium shallots, finely chopped2garlic cloves, thinly sliced12oz. spaghetti or other long pasta2Tbsp. nutritional yeast2Tbsp. finely chopped parsley½lemonFreshly ground black pepperPreparationStep 1Preheat oven to 350°. Toast cashews on a rimmed baking sheet, tossing halfway through, until golden brown, 7–9 minutes. Let cool.Step 2Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Arrange half of mushrooms in a single layer in pot and cook, undisturbed, until edges are brown and starting to crisp, about 3 minutes. Give mushrooms a good toss, then continue to cook, tossing occasionally, until all sides are brown and crisp, about 5 minutes more. Using a slotted spoon, transfer mushrooms to a plate; season with salt. Repeat with remaining 2 Tbsp. oil, remaining mushrooms, and more salt.Step 3Reduce heat to medium-low and return all of the mushrooms to same pot. Add leeks, shallots, and garlic and cook, stirring often and adding another 1 Tbsp. oil if pan looks dry, until leeks and shallots are translucent and softened, about 4 minutes. Remove from heat.Step 4Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about  2 minutes less than package directions (the pasta will finish cooking in the pan). Drain pasta, reserving ¾ cup pasta cooking liquid.Step 5Blend cashews, nutritional yeast, and pasta cooking liquid in a blender until very creamy. Set cashew cream aside.Step 6Return drained pasta to pot with mushroom mixture and add reserved cashew cream. Place over medium heat and cook, stirring well to coat, until pasta is al dente, about 3 minutes. Remove from heat. Add parsley and squeeze in juice from lemon half. Toss well to incorporate.Step 7Divide pasta evenly among shallow bowls or plates and top with several grinds of pepper.How would you rate Pasta With Mushrooms and Cashew Cream?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleDecent recipe but as others said, requires tweaks to make the sauce have any flavor. I added Parmesan and bouillon paste. Would try adding roasted garlic as another person suggested.  The sauce dries up quickly so you’ll need at least a cup of pasta water. I used the mushrooms I had on hand: baby bella and king oyster. Added a lot of salt. In the end, enjoyable dish. Would make again with the tweaks.Kim2/25/2022This recipe is delicious. It takes me back to the Alfredo pastas I loved as a little kid. Would definitely play around with the water ratio next time and likely add some salt or white wine just to see if I can improve on something that’s already great!!\n\nMade with shells 💖Devon WilliamsonToronto, Ontario 1/27/2022BLOWN AWAY!! My bf just said it’s the best thing I’ve ever made after rolling his eyes this am when I told him we were having creamy vegan pasta for dinner lol.\n\nAfter thoroughly reading the reviews I made some adjustments. First I boiled my cashews with tons of salt and a veggie bouillon cube (trick I learned from another recipe). I also added half a container of silken tofu and two large cloves of roasted garlic to the drained cashews, pasta water, nutritional yeast mixture as well as tons of pepper. The roasted garlic really elevated the cream. \n\nI used 4 large cloves of garlic instead of two with the leeks and shallots and I sautéed all the veggies together with some vegan butter for a bit before adding the pasta and cashew cream. \n\nMy pasta water was very salty and I set all of it aside, prob ended up using about 2.5-3 cups of it to bring it all together. \n\nAdded fresh cracked pepper, tons of lemon zest and chopped parsley on top and CHEF’S KISS!!!!!Laura XBrooklyn, NY1/16/2022It's alright, but fairly bland. It really needs more to brighten it up and add more flavor. We had to add pesto, but I bet lemon and a splash of white wine would probably really help. Suz FMontana10/2/2021I LOVED this meal and it's Daniel fast friendly! I would definitely double the garlic and salt generously if you're using raw cashews verses salted ones to bring out the flavor but overall it was super easy to make and tasty! Haleigh MarieDallas,TX 4/29/2021Tried this and utilized many of the suggested changes --and very glad I did! It was OK, but not really worth repeating as I felt the cashews do not have enough flavor to justify their use. Almonds or sesame maybe. My first time using the yeast. I found it interesting and may use it in other dishes. Liz CuskeyLargo, FL3/28/2021I would double the shallots and garlic for more balanced taste and use more pasta water.  Mine ended up being a bit dry and flavors didn't come throughAlanClaremont, CA3/15/2021I added an additional tablespoon of nutritional yeast, few splashes of sherry at the end and English peas. I’m not vegan, but I would hands down make this again.DGWashington, DC2/24/2021As a lactose-intolerant dairy lover, I was pleasantly surprised how delicious this was.  I added a touch of fresh thyme with the parsley which I suspect brightened up the flavour a bit.  My sauce wasn't dry but I added a little more pasta water.  ArielVancouver BC2/6/2021Meh it’s ok - was intrigued by the cashew cream but agree not enough water or flavor. This needed A LOT of tweaking. More salt, more lemon, agree with other review that zest of the lemon would be nice. Glad I tried it bc I was intrigued by the nutritional yeast & cashew cream....but this one won’t see a repeat in my kitchen. Lisa Atlanta, GA2/3/2021Exactly the point of this beautiful recipe. Some of us DO have milk/dairy allergies, or are eating a Vegan diet. Thanks for the sensitivity.idaHouston2/2/2021I guess I don’t really understand the point of this? Unless you have a dairy allergy or are vegan?  Mushrooms, heavy cream, Parmesan, lemon, and you have a terrific sauce in a couple of mins. So why would you do this?Cheesesteak in Paradise 2/2/2021I was really surprised to see the negative reviews. We loved this! I did not roast the cashews as I am programmed to make a cashew cream with raw unsalted cashews. You need to blend it really well in the blender.LetaCalifornia2/1/2021This was our least favorite out of the rotation. The sauce (which is so amazing on all the other recipes in the group) just didn't work. So, I tried the vegetables again, this time without the cashews and nutritional yeast. Leaving everything as is, we had a nice, light pasta sauce, sans cashews. You can't go wrong with leeks, mushrooms, and shallots. With a little reheated roast chicken, then this became a good dinner.AnonymousSan Francisco, CA1/30/2021Just made this and it was so easy and so good, at this point, if DeVonn Francis told me to use Fancy Feast as an ingredient I would at the very least consider it. The man does not miss. This will become a go-to in my comfort food rotation, and I am extremely not vegan. That's how much I liked this. Truly cannot understand the negative comments left on this recipe. As others suggested, I made some tweaks. That's the amazing thing about recipes! You can make them your own to achieve the desired result that YOU personally would like to eat! Incredible! Anyway, tweaks I made:\n\n- Used all shiitakes, and REALLY let them brown - this is key to getting the umami flavor you want in this dish\n- Roasted the hell out of the cashews, like a really nice golden brown, for depth of flavor\n- Made my pasta water as salty as the Mediterranean (a must in general IMO but especially if you're using your pasta water for a sauce)\n- Blended nutritional yeast + cashews alone first, then added pasta water, blended, and added more bit by bit to get the consistency I wanted. Ended up putting a bit more nutritional yeast and a pinch of salt in. Probably used 2 cups pasta water\n- Used closer to the juice of 1 lemon, just taste it and do what feels right to you. I think lemon zest would actually be a great add as well.haileyBrooklyn1/24/2021Explore Bon AppétitPastaMushroomVegetableCashewNutSpaghettiPasta & NoodlesNutritional YeastOther IngredientsWeeknight MealsMainVeganVegetarianDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}