{"id": "0b911663bccc6d33872b8cda7cfb56e7", "url": "https://www.bonappetit.com/recipe/chicken-sausage-gumbo", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Chicken and Sausage Gumbo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2012 IssueChicken and Sausage GumboBy The Bon Appétit Test KitchenPhotography by Jennifer MayFebruary 25, 20224.2(86)Read ReviewsTriangleEmailPinterestPrintPhoto by Jennifer MayEmailPinterestPrintEmailPinterestPrintNo matter what you’ve heard, there is no one definitive or best gumbo recipe out there. Gumbo is a deeply personal dish and there are as many versions of it as there are cooks in Louisiana, perhaps even more. There are Cajun gumbos, Creole gumbos, and numerous variations, like the one served at New Orleans restaurant Turkey and the Wolf with tamarind paste and potato chipsThis rendition keeps things fairly classic with the “holy trinity” of onions, celery, and green peppers, a roux, and chicken stock. Andouille sausage adds smokiness that’s balanced by the chicken, and okra helps thicken the stew. Some argue that there’s no gumbo without filé powder, so we’ve made it optional. Made from sassafras leaves that are dried and ground, it further thickens the dish. It’s crucial that it’s added at the end of the cooking, just before serving, and never allowed to boil, which makes it bitter.If you prefer gumbo with tomatoes—a nod to Creole tradition—give this one a try, and if you’re not a fan of okra, this rendition is made without. No matter the recipe, rice is a good accompaniment.Editor’s note: This recipe was originally published in our January 2012 issue.Ingredients8 to 10 Servings1tablespoon kosher salt plus more1teaspoon freshly ground black pepper1teaspoon paprika1/2 teaspoon cayenne pepper3pounds skinless, boneless chicken thighs1/2 cup (or more) vegetable oil1pound andouille or other spicy smoked sausage, cut into 1/2' rounds1cup all-purpose flour2medium onions, finely chopped4scallions, thinly sliced (white and pale parts separated from dark)2celery stalks, finely chopped2green bell peppers, finely chopped2tablespoons chopped garlic8cups low-salt chicken broth2bay leaves1teaspoon chopped fresh thyme2cups 1/2”-thick slices fresh (or frozen, thawed) okra, divided11/2 teaspoons Worchestershire sauce1teaspoon hot sauce (preferably Crystal)1teaspoon filé powder plus more (optional)Steamed RicePreparationStep 1Combine 1 Tbsp. salt and next 3 ingredients in a small bowl; sprinkle all over chicken. Heat 1/2 cup oil in a large heavy pot over medium heat. Working in batches, sear chicken until golden brown, about 5 minutes per side. Transfer to a plate. Add sausage to pot; cook until browned, about 4 minutes per side. Transfer to plate with chicken.Step 2Strain drippings from pot through a fine-mesh sieve into a 2-cup heatproof measuring cup; reserve 1 cup drippings, adding more oil if needed to measure 1 cup. Wipe pot clean; return drippings to pot.Step 3Heat drippings over medium heat. Whisk in flour. Whisk constantly until roux is the color of milk chocolate, 15–20 minutes. Reduce heat to low; add onions. Cook, stirring occasionally, until soft, about 10 minutes. Stir in white and pale-green parts of scallions and next 3 ingredients. Cook, stirring often, until soft, about 10 minutes.Step 4Slowly whisk in broth. Add bay leaves, thyme, and reserved chicken and sausage. Bring to a boil; reduce heat to low and simmer gently, skimming fat from surface and stirring occasionally, about 45 minutes.Step 5Stir in 1 cup okra, Worcestershire, and hot sauce. Simmer until chicken is very tender and flavors meld, about 45 minutes. Stir in remaining 1 cup okra; simmer until okra is crisp-tender, about 5 minutes. Remove from heat. Season to taste with salt. DO AHEAD: Can be made 2 days ahead. Let cool slightly; chill uncovered until cold. Cover and keep chilled. Rewarm gently before continuing. Add 1 tsp. filé powder, if using.Step 6Serve gumbo over rice. Garnish with dark-green parts of scallions. Sprinkle with more filé powder, if desired.Nutrition Per Serving10 servings; 1 serving (without rice) contains: Calories (kcal) 510.4 %Calories from Fat 57.4 Fat (g) 32.8 Saturated Fat (g) 8.2 Cholesterol (mg) 118.2 Carbohydrates (g) 16.4 Dietary Fiber (g) 2.1 Total Sugars (g) 4.2 Net Carbs (g) 14.3 Protein (g) 36.7 Sodium (mg) 600.3How would you rate Chicken and Sausage Gumbo?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleIt made my house smell so delicious all day... because that’s how long it took to cook. Don’t make this if you are hungry, whip up a jambalaya in a tenth of the time. That being said, this is a truly delicious and indulgent dinner. You don’t even have to use fancy ingredients, the depth of flavour is remarkable. nicoloisonSeattle, WA5/31/2020Explore Bon AppétitStewSoups and StewsCajun & CreoleAmericanSausageMeatChickenPoultryChicken ThighMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2011-12-13", "author": ["Condé Nast", "The Bon Appétit Test Kitchen", "Jennifer May"]}