{"id": "0bab7aa8563677635a658f3192777edb", "url": "https://www.bonappetit.com/recipe/chocolate-buttermilk-pie", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Chocolate Buttermilk Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChocolate Buttermilk PieBy  Deborah VanTreceMarch 16, 20214.1(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Noah Fecks. ©The Twisted Soul Cookbook: Modern Soul Food with Global Flavors by Deborah VanTrece, Rizzoli New York, 2021. EmailPinterestPrintEmailPinterestPrintAlthough this pie’s roots are in the United Kingdom, it is considered a traditional pie of the South. My first introduction to buttermilk pie was in the home of Grandma Richey, my roommate’s grandmother in Texas. She constantly overindulged us with good Southern meals that always included dessert. This pie, which I included in The Twisted Soul Cookbook, was the perfect ending to Sunday supper. It’s mildly sweet with deep chocolate flavor, smooth, and custardy, with a great tang from the buttermilk.IngredientsMakes one 9\" diameter pieCrust1Tbsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1¼cups (156 g) all-purpose flour, plus more for surface½cup (1 stick) chilled unsalted butter, cut into ½\" pieces½cup chilled buttermilkFilling and assembly4large eggs1½cups (300 g) sugar1cup buttermilk½cup (1 stick) unsalted butter, melted, cooled2tsp. vanilla extract⅓cup (39 g) Dutch-process cocoa powder, preferably Ghirardelli¼cup (31 g) all-purpose flour½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltWhipped cream (for serving)PreparationCrustStep 1Whisk sugar, salt, and 1¼ cups (156 g) all-purpose flour in a medium bowl to combine. Using a pastry cutter or a fork, work butter until mixture resembles coarse crumbs. Make a well in the center and pour buttermilk into well. Using a fork, stir mixture into buttermilk a little at a time until an evenly moist dough forms. Transfer dough to a lightly floured surface and flatten into a thick disk. Wrap in plastic and chill at least 1 hour and up to 2 days.Step 2Let dough sit at room temperature 5 minutes. Unwrap and roll out on a lightly floured surface to a 12\"-diameter round. Drape dough over rolling pin and transfer to a 9\"-diameter pie dish. Unfurl and press gently into dish. Using kitchen shears or a small, sharp knife, trim dough so you have about ½\" overhang. Fold overhang under and crimp edges as desired. Chill 30 minutes.Filling and assemblyStep 3Place rack in bottom third of oven; preheat to 375°. Whisk eggs and sugar in a large bowl to combine. Add buttermilk, butter, vanilla, cocoa powder, flour, and salt and whisk until smooth.Step 4Pour filling into chilled crust and bake 15 minutes. Reduce oven temperature to 350° and continue to bake pie until a tester inserted into the center comes out clean, about 45 minutes. Transfer to a wire rack and let cool. Slice with a serrated knife to create clean edges. Serve topped with whipped cream.Do ahead: Pie can be baked 2 days ahead. Cover and chill. Let sit at room temperature 10 minutes before serving.©The Twisted Soul Cookbook: Modern Soul Food with Global Flavors by Deborah VanTrece, Rizzoli New York, 2021.\n\nBuy from Amazon or Bookshop.How would you rate Chocolate Buttermilk Pie?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleGreat flavor and very easy. The crust was too wet. I had to add more flour to prevent it from sticking.AnonymousSeattle 2/8/2022I used the filling recipe but ditched the pie crust and used a chocolate cookie crust premade from the store, because CHOCOLATE, lol. Plus it was easier. \nIt came out great 🤎Biscuitboogie Montgomery, AL8/3/2021I made this with my mom when she was visiting and while it was a fun process to bake together this pie kind of went awry. I'm not sure if my pan was too small (although it was labeled as 9\"), but the filling almost overwhelmed the pie area and then the butter from the crust started to ooze out causing a lovely smoke situation in my kitchen. :) I was really excited to see how the tangy buttermilk would shine against the chocolate, but I couldn't really detect it. The custard in the end turned out weirdly gummy too. All in all though, I think these issues must have been user/baker-related and I'll may try it again another time, definitely with a larger pie dish.Sarah A.Arlington, VA6/7/2021Definitely wrap the pie crust with aluminum foil after the 15 minutes at 375!KatherineSacramento, California4/14/2021Looooved this pie. Beautiful chocolate flavour, not too sweet and the buttermilk adds the perfect tanginess. The crust had a nice level of crispiness and chewiness. Whole family loved it. Will definitely make again.StellaAuckland, New Zealand3/28/2021I made this pie for my husband and his family. They are from Arkansas and do a lot of cooking with buttermilk, although I never have. They loved it! I generally struggle with making pie crusts but this one was very simple. I also found the fact that I didn't need to blind bake the crust to simplify the recipe nicely as well. My husband has already requested that I make this again in the future!Molly Hurff PriceNew York, NY3/26/2021Wow, this was really an outstanding recipe. I didn't think it would have a great chocolate flavor using only cocoa powder but it did in spades. I used Guittard which was outstanding. The crust was very easy to roll, moist and perfect for this pie. I found that 170 degrees was the prefect temperature to remove from oven. Andrew Rodney Santa Fe3/21/2021Explore Bon AppétitPieDessertSouthernAmericanButtermilkOther IngredientsCocoaNut-FreeVegetarianBakingJuneteenthRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Deborah Vantrece"]}