{"id": "0bac69f439dfec55c53e48e4f7960e35", "url": "https://www.bonappetit.com/recipe/mbahal", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Mbahal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueMbahalBy Pierre ThiamJanuary 4, 20223.1(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranEmailPinterestPrintEmailPinterestPrintIf you’re looking for a big bowl of West African comfort, look no further than Mbahal, a popular Senegambian rice dish made with peanuts, black-eyed peas, and okra. “It’s the dish that every single [Senegalese] household has a recipe for,” says chef Pierre Thiam, cofounder of Yolélé Foods. Mbahal—whose name comes from the Wolof verb for boiling—gets its creamy risotto-like texture from simmering rice in a spicy tomato-peanut sauce until it thickens.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMedium Pot with Lid$155 At AmazonWooden Spoon$6 At AmazonWhisk$10 At AmazonSlotted Spoon$13 $10 At AmazonIngredients6 servings1cup jasmine rice½cup dried black-eyed peas, soaked overnight, drained, or one 15.5-oz. can black-eyed peas, drained3tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more2Tbsp. peanut or vegetable oil8oz. boneless lamb shoulder, cutinto 1\" pieces1large onion, coarsely chopped1cup cherry tomatoes1Tbsp. tomato paste4cups low-sodium chicken or beef broth1small Italian eggplant (about 8 oz.), cut into 1\" pieces1habanero or Scotch bonnet chile2bay leaves2–3Tbsp. fish sauce2Tbsp. tamarind paste (optional)10okra pods, trimmed1cup creamy natural peanut butter2tsp. freshly ground black pepperLime wedges (for serving)PreparationStep 1Place rice in a medium bowl and pour in water to cover. Let sit 30 minutes.Step 2If using dried black-eyed peas, place in a medium pot; add 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and 1 quart water. Bring to a boil, then reduce heat and simmer until peas are tender, 30–40 minutes. Drain; set aside.Step 3Heat oil in a large Dutch oven or other heavy pot over medium-high. Add lamb in a single layer and season with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Cook, undisturbed, until browned underneath, about 3 minutes. Turn and cook until browned on the other side, about 3 minutes longer. Reduce heat to medium. Add onion and cook, stirring often, until softened, about 3 minutes. Add tomatoes and tomato paste and cook, stirring occasionally, until tomatoes are blistered and softened, about 3 minutes. Using spoon, gently press on tomatoes until they burst. Continue to cook, still stirring occasionally, until tomatoes have released some of their juices and a light sauce forms, about 3 minutes more.Step 4Pour in broth and bring to a boil. Reduce heat to a simmer; stir in eggplant, chile, bay leaves, fish sauce, tamarind paste (if using), and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Cook, stirring occasionally, until eggplant is softened, 7–10 minutes. Add okra and cook, stirring, until softened, about 5 minutes. Using a slotted spoon, transfer eggplant, chile, and okra to a medium bowl; set aside.Step 5Add peanut butter to broth; whisk until incorporated. Drain rice, then stir into pot. Reduce heat to low, partially cover pot, and cook, stirring often, until rice is tender and mixture is thickened to the consistency of a risotto, 20–25 minutes. Discard bay leaf and stir in pepper, reserved chile, and reserved black-eyed peas (or canned black-eyed peas). Taste and season with more salt if needed.Step 6Transfer to a large bowl and top with reserved eggplant and okra. Serve with lime wedges.Do Ahead: Mbahal can be made 3 days ahead. Let cool, then transfer to an airtight container. Cover and chill.How would you rate Mbahal?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWow...worst recipe I think I've ever tried.  I guess if you like peanut butter rice, this is for you.  Lamb gets totally lost, no point in even adding it.  I can see maybe making this without the peanut butter but adding chopped peanuts?wdAnn Arbor, MI3/7/2022Way too much peanut butter. The flavor combination of lamb, fish sauce, and peanut butter did not taste good. Kind of made me feel sick.  This was disappointing and felt like a waste of ingredients and time.MUCSan Francisco, CA2/1/2022Way too much peanut butter. Not enough liquid to cook the rice. There are major flaws with this recipe. What a waste.JoeSt. Louis, MO1/27/2022If you're looking for a recipe that will have your family begging you not to make dinner for awhile, this is it.Christine Brooklyn, NY1/24/2022Despite the other reviews, I really liked this recipe!\nThe tanginess of the tomatoes balanced the heavy peanut butter.\nBUT I do agree, too much peanut butter. I only added in 3 tablespoons.Sol halifax1/23/2022Somehow I missed in the recipe that this should have been made with cooked rice?  And agree- too much peanut butter Alison1/23/2022I have like or loved every dish on this website except for this one. The peanut flavor was overpowering; recommend to cut it in half.ScottBoston1/20/2022Explore Bon AppétitDinnerWest AfricanAfricanDairy-FreeGluten-FreeOkraVegetableLambMeatLamb ShoulderRiceRice & GrainsPeanutNutBlack-Eyed PeaBeanEggplantHabanero ChileChileScotch BonnetSimmerMainSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Pierre Thiam"]}