{"id": "0bb14b29c88e7fecc63f5ebf847ea0a7", "url": "https://www.bonappetit.com/story/this-crispy-skin-salmon-is-all-i-want-to-eat-right-now", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Crispy Skin Salmon Is All I Want to Eat Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Crispy Skin Salmon Is All I Want to Eat Right NowIt's super fast, and super delicious. If you’ve been afraid to cook salmon, this is a foolproof way to get started.By Alyse WhitneyNovember 6, 2018FacebookTwitterEmailPhoto by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirFacebookTwitterEmailOne of my 2018 goals was to cook more fish at home. (It also happened to be the year that I moved into a studio apartment, so my kitchen is only about 10 feet away from my bed. Nothing like the scent of halibut on your pillow when you lie down to sleep!)I was dragging on my resolution a bit, but then I made our new crispy-skin salmon with miso-honey sauce, and now it’s all I want to eat. The cook time is also just about 10 minutes, and if I open my window and have some a candle going, I can usually combat any wafting fish smells. (I promise that the recipe is a lot more appetizing than this description. Let’s get onto that, shall we?)The trick to not overcooking salmon is to only cook it on one side for most of the way. This is a technique also used for my favorite pork chop recipe—residual heat is really neat!!!! You also start it in a cold pan without any oil so the salmon skin can gently render its own fat and crisp up without aggressively cooking the flesh. You’ll know it’s time to give the salmon a flip once you look at the side of a fillet and it’s cooked about halfway up. And if you want to set yourself a timer, it’s about five minutes of skin-side down until you can sing “whoa, we’re halfway there, whoa, livin’ on a prayer.”Here’s the thing, though—five minutes isn’t an exact number. It depends on if you’re actually using a cast-iron pan (which holds heat better than nonstick), if your heat is on true medium or a little lower or higher, and the thickness of the fillet. I used my favorite Made In stainless steel pan because it conducts heat well and I don’t own a cast-iron (I gave it away when I moved because it was too heavy and I’m lazy about seasoning it, so sue me!) and it turned out great. Nonstick would be fine, but the skin won't get quite as crispy.Instead of smoked salmon, I love making rice bowls with cold leftover roasted salmon.\nAlex LauThe important thing is to not flip your salmon until it releases on its own—if the skin is stuck, it needs more time. Let the salmon tell you when it’s ready to move on. Once you flip it (preferably with a flexible fish spatula), turn off the stove and take the pan off the heat. The residual heat will finish cooking it while you grab a platter, spoon the tangy, sweet and salty miso-ginger-honey sauce on a platter. Or, if you’re dining solo like I was, just swoosh some sauce on the plate, add salmon, and sprinkle with scallions and toasted sesame seeds.A pro tip that we’d never print in a recipe but I wholeheartedly endorse: Take the crispy skin off the other three fillets of salmon and eat them dipped in miso-ginger sauce if you’re not cooking for a crowd. They will get soggy in the fridge anyway, so might as well have a little extra snack for yourself. I used cold leftovers in a crispy rice salad with mushrooms the next day, and for breakfast the following morning on top of toast with whipped cream cheese and scallions. I have one fillet left and I’m not sick of salmon, my apartment smells like my favorite Cider Lane candle from Bath and Body Works, and I’m already thinking about how I’ll add salmon into my weeknight dinner lineup next week. Join me, won’t you?Get the recipe:Crispy-Skin Salmon with Miso-Honey SauceQuick cooking, not-too-expensive, and super satisfying, salmon fillets are a weeknight dinner slam dunk—and our go-to method for making them is pretty much un-mess-up-able.View RecipeExplore Bon AppétitBasicallySalmonMisoGingerhoneyWeeknightRead MorecookingThis Sheet Pan Salmon Recipe Is Everything We Crave in a Weeknight DinnerBy Chris MoroccocookingThe Luxuriously Roasted Salmon That’s Restored My Faith in a Boring Old FiletBy Elyse InaminecookingUmmm, What's That White Stuff on Salmon?By Alex DelanycookingThis Salmon Niçoise Salad Is a Weeknight Dinner Party DunkBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Alyse Whitney"]}