{"id": "0bb4de30edab648a3d18f64932ac254a", "url": "https://www.bonappetit.com/recipe/turnips-with-spicy-meyer-lemon-dressing", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Turnips With Spicy Lemon Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueTurnips With Spicy Meyer Lemon DressingBy Konbi, Los Angeles, CASeptember 17, 20194.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThese roasted turnips from Konbi in Los Angeles (No. 1 on our 2019 Hot Ten list!) are dressed in a sweet, salty, slightly spicy togarashi-spiked sauce that keeps you coming back for more. Make extra, and then try the dressing tossed with cold noodles or spooned over fish.Ingredients4 servings2cups bonito flakes½cup sugar½cup usukuchi (light) soy sauce¼cup mirin (sweet Japanese rice wine)1Tbsp. ichimi togarashiZest and juice of 4 Meyer lemons or regular lemons (about ½ cup juice)2bunches hakurei turnips with tops2Tbsp. vegetable oilKosher saltToasted sesame seeds (for serving)Ingredient InfoIchimi togarashi, a red-pepper-forward seasoning mix, can be found at Japanese markets, in the Asian foods section of some supermarkets, and online.PreparationStep 1Preheat oven to 425°. Grind bonito flakes in a spice mill or blender until finely ground (you should have about 2 Tbsp.). Bring ground bonito, sugar, soy sauce, mirin, and togarashi to a boil in a medium saucepan. Reduce heat to medium and simmer, stirring often, until reduced by a third, 12–15 minutes. Pour dressing into a small bowl; cover and chill until cold, at least 30 minutes and up to 3 days. Stir in lemon zest and juice.Step 2Meanwhile, separate tops from turnips. Trim stems from leaves; discard. Coarsely chop leaves. Cut turnips into 1\" wedges. Toss turnips and leaves with oil on a rimmed baking sheet; season lightly with salt (the dressing is salty). Roast, tossing halfway through, until leaves are wilted and turnips have taken on a touch of color, 12–15 minutes.Step 3Transfer turnips and leaves to a platter; spoon some of the dressing over (you’ll have extra). Sprinkle with sesame seeds.How would you rate Turnips With Spicy Meyer Lemon Dressing?Leave a ReviewTell us what you thinkExplore Bon AppétitJapaneseEast AsianAsianTurnipVegetableMeyer LemonLemonCitrusFruitSideStarterDairy-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Konbi", "Los Angeles"]}