{"id": "0bbb097326bcbfec18c5c4e2394b871b", "url": "https://www.bonappetit.com/story/how-to-work-vents-and-lid-of-charcoal-grill", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "How to Work the Vents and Lid of Your Grill: A Quick, Necessary Explainer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Work the Vents and Lid of Your Grill: A Need-to-Know GuideMake your vent and lid work for you.By Alex DelanyJune 21, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailVentilation is one of summer's great conversation topics. But we’re not talking about screened porches or linen pants. We’re talking about the most important warm weather ventilation there is: grilling ventilation.That's right, the air flow around that toasty charcoal lining the bottom of your grill. In order to control how your food cooks (hot and fast, low and slow), you need to control the heat and circulation of your grill. And you do that by manipulating its lid and vents.The first question you need to answer is: Should I have my grill lid on or off? All you have to remember is that a lid essentially turns your grill into an oven. It traps heat so that your food cooks from every side instead of exclusively from below. As a general rule, you should leave the lid off when you’re looking to quickly char vegetables or cook thin pieces of protein, like pancake-skinny smash burgers or boneless chicken thighs, but put the lid on when you’re cooking larger items that require more time to cook through, like bone-in chicken or whole sweet potatoes.The next question that needs answering is: Where the hell are the vents? See that weird little portal on the top of your grill lid? And that slide-y thing at the bottom of the grill basin, under your charcoal? Those are the vents! Both control the flow of air inside of the grill, which changes the heat level and direction.Quick-cooking foods should be cooked with the grill lid off!\nPhoto by Chelsie Craig, Food Styling by Pearl JonesThe vent on the bottom of the basin controls how much oxygen gets inside the grill, while the vent on the top determines how much heat exits the grill. Even when you're grilling with the lid off, you need to think about the bottom vent. The more open it is, the more oxygen is supplied to the charcoal, which makes it burn hotter. When the lid is on, you also need to consider the top vent. When that top vent is open, heat escapes through it, meaning that whatever food is placed underneath will be subjected to more heat. If you want to give your food a break from a high temp, lift the lid and spin it so that the vent is on the opposite side as the food.Regardless of which vent you're messing with, remember that open vents mean hotter and faster-burning charcoal. Closed vents mean less oxygen, which in turn means less heat and slower-burning charcoal.Now that you know about vents, the world—or at least your grill and the small area surrounding it—is yours.But wait! You've got to know your charcoal too:How to Pick the Right Charcoal for Your Summer GrillingThere are two types of charcoal (yes, two!) and two totally different uses.View StoryExplore Bon AppétitBasicallyGrillCharcoalRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Alex Delany"]}