{"id": "0bcc06a922cf8a40a3d931f9c2795604", "url": "https://www.bonappetit.com/story/best-food-and-drink-gifts-under-35-dollars", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "14 Food & Drink Gifts Under $35 for Everyone in Your Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseGifts Under $35 for Your Neighbor, Your Mailman, and the Urban Homesteader in Your LifeShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopUnder $35Under $100 (And a Few Splurges!)CookbooksRestaurant MerchHealthyish FavesMarcus's PicksGift Guide 2020Gifts Under $35 for Your Neighbor, Your Mailman, and the Urban Homesteader in Your LifeThe best food and drink gifts, from design-y chocolates to mushroom-growing kits, at pretty great prices.By MacKenzie Chung FeganNovember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Even though holiday budgets may be tighter this year, there are still plenty of ways to take care of everyone on your list without breaking the bank. If you’re not in the mood to wrap homemade peppermint bark in cellophane or bust out the pipe cleaners and popsicle sticks for a DIY-athon, look no further—all of these gifts are under $35 and guaranteed to please. (And if you’re looking for big-ticket items for someone special in your life, check out our Under $100 gift guide here.)For the person on dish dutyAfter graduating from design school in 2018, Alexandria Pak landed a job at Coming Soon, a New York City boutique that’s a favorite of BA editors. Not too long after, her bosses convinced her to start selling the scrubby sponges she crocheted as a hobby. “It’s something my grandma taught me to do when I was little, and I started gifting them to friends and family—also a typical Korean granny move,” Pak says. The sparkly neon sponges are nimble enough to squeeze inside delicate glassware, sturdy enough to tackle pots and pans, and will convince whoever is on holiday dish duty that they’re the luckiest guest of all.Sponge.NYC Kitchen Sponge$8 at Coming SoonFor the PB&J sophisticateIf we want sugar that tastes like fruit, we’ll open a bag of Haribo gummies, but for fruit with just a hint of sugar, we turn to Trade Street Jam made by founder and CEO Ashley Rouse. She doesn’t add any pectin or preservatives, which means her low-sugar jams are bursting with unadulterated fruit flavor that prove once and for all that PB&J isn’t just for kids. Healthyish assistant editor Aliza Abarbanel especially loves the smoked peach flavor, which tastes like late-summer yellow peaches lightly kissed by a charcoal grill.Trade Street Jam$14 at Trade Street Jam Co.$13 at CatbirdFor the mom who always saves the wrapping paperWhat can’t you do with tenugui? In Japan, people wrap gifts and carry bento boxes using these rectangular cotton cloths, but you’ll also find them worn as scarves and adorning dining tables. After scrolling through Kamawanu’s tenugui, which are handcrafted using a traditional resist-dyeing technique known as chusen, we’re ready to up our gift wrap game. We’re partial to the tamago print, a polka-dot pattern infiltrated by cute little hard-boiled eggs.Akiko TohnoKamawanu Komon Modern Tenugui$22 at JinenFor the person who’d rather drink spritzes than bake spritz cookiesThere is a singular disappointment in being bewitched by a bottle’s chic label, only to find the contents...underwhelming. Thankfully, these three new entries in the aperitif scene deliver on both style and substance and are a welcome addition to the bar cart of any low- or no-ABV fan. Faccia Brutto’s aperitivo is perfect in Americanos, combining the citrusy bitterness you’d expect from a red aperitivo with just a hint of cherry cola. Ghia’s satisfyingly bitter, nonalcoholic aperitif is delicious with tonic or mixed into a cocktail—virgin or otherwise. And Mommenpop’s line of aperitifs pairs California wine with California citrus for a sunny, juicy bev begging to be spritzed.Faccia Brutto Aperitivo$35 at Leon & Son Wine and SpiritsGhia Nonalcoholic Aperitif$33 $26 at GhiaMommenpop Grapefruit$34 at MommenpopFor your brother’s new boyfriendStumped by someone on your gift list? Not only is high-quality chocolate a safe bet, but this 10-bar sampler box from jcoco has something for everyone. For dark chocolate purists, there’s an 85 percent single-origin bar made with beans from Quillabamba, Peru, that starts fruity and ends with a bright acidic kick. Salted caramel fans will love the Bali sea salt toffee in milk chocolate. But the sleeper hit is the cayenne Veracruz orange in white chocolate, a complex salty-spicy delight that will convert even the most hardened white chocolate skeptics. As a bonus, the Seattle chocolatier makes a donation to partner food banks for every three ounces of chocolate sold, meaning one of these sampler boxes provides three meals to people in need.jcoco Chocolate Prism Gift Box$35 $28 at Seattle ChocolateFor the coworker who brings their own mug to the coffee shopInka’s silverware was designed to replace plastic utensils for dining al desko, but in 2020 we’ve used them for park picnics and BYOEverything backyard hangs. Made of stainless steel with a brushed gold finish, they’re slightly smaller than normal silverware—think the size of a salad fork rather than a dinner fork—but bring a touch of class to even the most improvised dining situation.Inka Travel Silverware$15 at InkaFor the urban homesteaderIs there a German word for when a recipe calls for two sprigs of thyme so you buy a whole bundle for $3 and a month later find the other desiccated 23 sprigs in the back of your fridge? Give the gift of never doing that again with this starter herb kit, which comes with seeds for basil, cilantro, dill, thyme, parsley, chives, oregano, and mint. Germinate them in the included dehydrated soil pucks, and in two to four weeks, transplant them to pots or an outdoor garden.Urban Leaf Herb Starter Kit$19 $16 at Urban LeafFor the power clasherYour friend who mixes paisleys and plaids with confidence will love Sunday/Monday’s sunny cotton napkins, which can be paired with their table runners for maximum dining table pattern play. All of the company’s offerings are designed by Nisha Mirani—whose family is from Gujarat, a state in India known for its textiles—and her husband, Brendan Kramer, then block-printed by artisans in Rajasthan. BA executive editor Sonia Chopra came for the napkins and stayed for the scrunchies, which have taken up permanent residence on her wrist and would make an excellent stocking stuffer for any current or former tween.Sunday/Monday Mosaic Napkins$28 at Sunday/MondayFor the person you love a halva-a-lotSure, you could make your own halva to package up as holiday gifts, but maybe you don’t have a candy thermometer or are busy homeschooling your children or whatever—your reasons are your own! Thankfully, Seed + Mill, which produces some of BA senior food editor Andy Baraghani’s favorite tahini, has you covered with this gift set featuring 8-ounce cartons of flaky pistachio, raspberry, and sea salt dark chocolate halva.jill fergusSeed + Mill Halva Trio$35 at Seed + Mill$45 at AmazonFor the chocoholic design snobWe first heard about Casa Bosques through chef and artist Laila Gohar, who created an edible installation of surrealist busts using its chocolate. Cool, we thought. Then we tried them. “YUM,” we exclaimed. The bean-to-bar chocolate company was founded by Rafael Prieto, who, when he’s not tinkering with new flavor combinations in Mexico City, is busy helming his NYC-based design practice, Savvy Studio. “We have these ancient traditions of eating and drinking cacao in Mexico,” says Prieto of the inspiration behind Casa Bosques, “so why, when you think ‘chocolate,’ do you think of Belgium and Switzerland?” Casa Bosques frequently collaborates with chefs like Enrique Olvera and Elena Reygadas to pair single-origin chocolate from across Latin America with flavors like roasted blue maize, hoja santa, pink peppercorn, and—Gohar’s favorite—cardamom.Casa Bosques Chocolate$13 at Casa Bosques ChocolateFor your goth nieceThe problem with flowers is that, like youth and Girl Scout cookie season, they don’t last forever. You go to the trouble of arranging your blooms and buds in that one nice vase, and three days later the petals are brown and the stems are slimy. This is why we’re so taken with artist and floral designer Tosha Stimage’s arrangements—they’re already dead! The Everlasting Mini showcases exuberant dyed pink blooms, magenta leaves, and fuchsia grasses, all dried and ready for display in your niece’s bedroom, next to her taxidermy diorama. “The minute you cut a flower, it is dying,” Stimage says. “My bouquets are a reminder to maximize the time you have.”Saint Flora Everlasting Mini Dried Bouquet$28 at Saint FloraFor the fun guy in your lifeIn 2020, we stockpiled beans and babied our sourdough starter, but nothing changed us quite like growing our own mushrooms. We unpacked bricks inoculated with millions of spores, giddy with the promise of self-sufficiency. We watched with fascination as, after a week of faithful misting, mushroom spawn poked their tiny capped heads out from under the plastic covering. We shifted uncomfortably as the fungi multiplied and grew exponentially, sometimes literally doubling over the course of a workday. We panicked as the largest ones reached the size of an Eggo waffle and we realized we were no longer in control. We harvested them quickly. And then we ate them, sautéed in butter and soy sauce.deirdre lewisSmallhold Mushroom Kits$34 at SmallholdFor the Glossier obsessiveSmoothie or skin-care product? You’d be forgiven for not knowing after reading the ingredients in Golde’s face masks. The Clean Greens mask is made of mango, marshmallow root, spirulina, and chlorella, while the Papaya Bright mask contains lucuma, papaya, sea buckthorn, and marshmallow root. What you see is what you smell; no fake fragrance means that the latter has the aroma of an earthy tropical smoothie and the former smells, let’s be real, a little like fish food. All the ingredients are organic and dehydrated into a powder—just add water for a creamy face mask that will delight the person on your list chasing that dewy glow.ISSEY_KOBORIGolde Clean Greens Superfood Face Mask$34 at GoldeISSEY_KOBORIGolde Papaya Bright Superfood Face Mask$34 at GoldeFor the friend who misses her mom’s home cooking but doesn’t own a cutting boardWhy, sisters Vanessa and Kim Pham wondered, are there so many types of pasta sauces that they command an entire grocery store aisle but virtually no prepackaged shortcuts for Asian cuisine, except perhaps for a lone jar of Thai curry paste? They took matters into their own hands and created Omsom, a line of saucy starters that will help your friend who can barely boil water get classics like Filipino sisig and Korean bulgogi on the table in about half an hour. We’re fans of the Southeast Asian sampler, in particular the Vietnamese lemongrass barbecue starter developed in partnership with chef Jimmy Ly of Madame Vo.Photo by Mischelle MoySoutheast Asian Omsom Sampler$29 at OmsomExplore Bon AppétitShoppingGift GuidesHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-17", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}