{"id": "0bcfe7b804cb8b4710dd39d91f0e4784", "url": "https://www.bonappetit.com/story/how-to-make-applesauce", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Why I’ll Never Buy Applesauce Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy I’ll Never Buy Applesauce AgainIn her weekly newsletter, food director Carla Lalli Music shares the only way to make applesauceBy Carla Lalli MusicOctober 11, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The only way to make applesauceAttention leaf peepers! I see you out there, exercising your rights to participate in the annual apple harvest, showing the kiddies that apples do indeed grow on trees, eating still-warm cider doughnuts and pretending you can detect actual apple cider flavor contained therein.It’s a beautiful day, the one you spend apple picking. The last time I went, I had to wrestle an incredibly sticky caramel apple away from my then-3-year-old before we got into the car because I was afraid his baby teeth would be torn right out of his head if he tried to take another bite. He screamed for 45 minutes afterward, and I spent that time trying to come up with ways to use the 15 pounds of apples we somehow managed to pick and pay for. Of course, there’s pie. But let’s be real: Even a deep dish pie only requires about six apples. Not even going to make a dent. You could make a second pie, I suppose, if you feel like competing with yourself (I can relate).You can make apple-cheddar pie, but it won't use up that many apples.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensBut after a day or two of apple salads, apples and cheese, and apple cake, you’re still going to be staring down a giant sack of apples. And there’s only one thing to do at that point: make applesauce.Want this letter before it hits the website? Sign up for our newsletter!The only applesauce to make is the one inspired by Julia Child, because duh what else do you need to know? The other reason to make it Julia’s way is because it requires the most minimal amount of effort. This recipe works with any type of apple, and it works if you mix and match all the ones you happen have on hand. Even better, you don’t even have to peel them! Just cut them in half, put them in a big pot with a cinnamon stick, some lemon juice, and a vanilla bean (or vanilla extract), then cover the pot and cook on medium-low. Et voilà: 35 minutes later, you’ve got mush. As an extremely intelligent reader sums it up on our recipe page: “Wow. That was shockingly easy. Five minutes of prep (including climbing the stepladder to dig up the cinnamon sticks) and 30 minutes later I had applesauce!”Shockingly easy. Are there two more beautiful words to a home cook’s ears? The thing I have to climb the stepladder for is my food mill, which I use only a few times a year, and this is one of the recipes that helps it earn its keep. Once the apples have surrendered to the cooking process, morphing from a solid to a semi-solid state, I scoop them into my food mill and crank away, which efficiently purees their flesh and skins and holds back the seeds and tough bis of core. The finished sauce has a beautiful color (and added nutritional value) thanks to those skins, but you’d never know they were there. I also truly enjoy the fact that I don’t have to scoop out the seeds before cooking, because—again—the pies have exhausted me.A food mill is your best friend for making applesauce.\nAlex LauIf you don’t have a food mill, go buy one. If you don’t want to buy one, use a melon baller to scoop out the cores from the raw apples prior to cooking, which is pretty easy, especially if you offer a child 25 cents per apple to do this for you. (After cooking, you can use a potato masher, a food processor, or a blender instead of the food mill.)When this process is done, several amazing things will have happened. First of all, your house will smell incredible. If you are trying to sell your house, make applesauce an hour before the open house and I guarantee you’ll get multiple offers and then there will be a bidding war. The giant satchel of apples that you thought was going to be in a corner of the kitchen for the rest of your life will be gone, and instead there will be a few quart containers of warm applesauce on your countertop. Before you even put any of it in the fridge, dish up a bowl and drizzle over a little cold heavy cream and give that a go, because it is an insanely good combo. If you thought applesauce was only for children, this warm-cool cinnamon meets dairy fat situation will make you rethink it, bigly.Applesauce will keep in the fridge for at least a week and quite possibly longer. It makes a thoughtful hostess gift but it also makes a great breakfast (with Greek yogurt!). On the off chance that you feel like baking again next weekend, you can simmer it until it is concentrated and jammy and use it in this apple cake recipe.I also love apple cake.\nI don’t think I’m going apple picking this fall, because I don’t want to have another fight with my kid about caramel-coated apples. Instead, I’m going to devote an entire tote to some of this season’s apples from the farmers’ market. I tried the Snapdragon variety the other day—snappy, juicy, a little spicy! Last year I fell in love with the rough-skinned Golden Russet, a hardy type whose tough exterior can withstand nasty whipping winds. I love the flavor of an Empire, but the texture is meh—a great candidate for sauce. There’s concentrated flavor in the Pippin and the Winesap, and even if I find myself with a bruised or mealy one, I know it will end up in a good place.Get the recipe:Classic ApplesauceExplore Bon AppétitCarla NewsletterAppleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Carla Lalli Music"]}