{"id": "0be11474485bca250bdfcfd2074e6257", "url": "https://www.bonappetit.com/story/covid-restaurant-etiquette", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Is It Ever Okay...to Sip a Vaccinated Friend’s Drink Just to Try It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIs It Ever Okay...to Sip a Vaccinated Friend’s Drink Just to Try It?Questionable etiquette for a new, slightly fraught era of dining out.By Alex BeggsJuly 1, 2021FacebookTwitterEmailPhoto by Harold M. Lambert/Getty Images FacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can we share plates/utensils/drinks again? Can we do that thing where you and a friend each order a cocktail and you’d say, “ooh what’d you get?” and you’d have a sip of their drink and they’d sip yours and you wouldn’t give each other a life-threatening virus? —Intrigued IagoYes, but I don’t share my martini with anyone, so please don’t ask me for a taste. It tastes like cold gin and it’s mine. Also a rule: You can’t “share” fries if you didn’t discuss the sharing before the fries were ordered. So if your friend ordered a burger that came with fries, and you had the nerve to order a garden salad with secret intentions to eat all of those fries, crawling your hand over to the plate like a midnight cockroach—no. None of that shall be tolerated, and since we haven’t seen each other in a while, I’m going to snap at you and blame it on my pandemic loss of social skills.However! All along, germs were lurking. Remember the cold? Mono? Cold sores? CROUP? (I know three parents with kids who have croup right now and gave it to the whole family. It’s going around!) There’s a speckle of risk when we decide to share, and most of the time, I’m willing to take it. Wash your hands before you eat, for goodness’s sake! And remember that you’re not invincible. When a friend supposedly “has allergies,” don’t get the nachos. Play it safe.I know this is, like, so cheap of me…but when can we go back to tipping a normal 20 percent? Is it acceptable that I’ve been doing that for a couple months?! Lol –Whiny WandaIf you’re feeling an icky guilt when tipping 20 percent, something in your brain is acknowledging that the server and the restaurant deserves the extra five (or 15!). They’ve gotta bounce back; the servers have to deal with ornery, unsocialized, impatient, entitled diners, and clearly the federal minimum wage isn’t gonna catch up in this lifetime. How embarrassing was the “debate” over Chipotle raising its hourly minimum to $15! What’d people worry they’re going to do when they make $20/hour, buy HEALTHCARE?Anyways. Dining in a restaurant is a luxury—no dishes! Seltzer on tap!—so if your budget is too tight to justify tipping a tiny tiny bit more, which is really just making sure someone is paid a liveable wage, maybe stay in tonight.\"Can I impose a (no-sweats) dresscode on the rest of my party or is that insane?\" —Formally FranHa, I love this audacity. I say go for it and call it a “theme.” In fact, go all out and tell everyone to get dressed up and pretend it’s the pre-Prom dinner where you get your makeup done, put in $80 for a Hummer limo, eat pot brownies in the bathroom for the first time, and spend all dinner trying to remember how to use a fork. FUN!What’s up with the rule of needing to wear a mask on the way to the bathroom, but you can spend hours in a restaurant shouting and yucking it up? Is that really necessary? —Yukky YolandaYeah the wear-a-mask-to-the-bathroom was a charade once we got vaccinated, but there was that small window when some people were and some weren’t yet vaxxed and we were just MAKING SURE. But now, per the CDC*, the only people who need to wear masks to the bathroom in the restaurant, in Costco, and at the Q rallies are the unvaccinated so that they don’t get the new COVID variant and DIE. That’s still what’s at stake here, for them, and yet, not enough people are shouting the word DIE if you ask me. If the restaurant has a mask policy for when you’re away from your table, it doesn’t hurt to wear a mask for 30 seconds. A small inconvenience for steak tartare and seltzer on tap.*The WHO, on the other hand, suggests everyone still wear a mask indoors because of the extra-contagious variant going around. Seems like wearing a mask to the bathroom is playing it safe.Pre-vax, I would pull up my mask whenever a server was near; it just felt like the polite thing to do. Now that I'm vaxxed, I don’t want to mess with that (and I don’t think I need to, like, scientifically), but usually the server is wearing one so I feel like a bit of a jerk not putting on my mask when they’re wearing one. Am I? —Overthinking OllieI don’t know if you’re a jerk, like, at your core. That’s up to other people’s grandmas and strangers on Twitter to decide—the true moral compass of the nation. I’ve experienced both masked and unmasked waitstaff when I’ve gone out because the CDC says if you’re vaccinated, you don’t need to be maskinated. Private businesses can make their own mask guidelines, so check to see if they request wearing masks at the table, or just ask. Ask! Get it out there in the open. If a server’s wearing a mask, that’s to protect them from unwanted germs, COVID or otherwise. Maybe they’re unvaccinated, or just don’t want to catch stupid. There’s a lot of stuff going around, remember croup??Is it acceptable to storm out of a restaurant and not pay for food because of a mask requirement? —Stormy StanleyNever acceptable to not pay for food. That price has a trickle-down effect that directly correlates to peoples’ livelihoods. However, you can be angry at whatever you want, that’s an (often irrational) emotion you’re entitled to as a human being who may or may not need therapy. Is it polite to storm out of any restaurant and cause a scene for something so trivial? Nah. But it is entertaining to me personally to see adults behave like children. You wear pants, too, and remember how hard that was to get used to? But we got there, we got there.I have a bunch of gift cards I bought during the pandemic but haven’t used them yet since my income didn’t change during the pandemic. When is a good time to start using the gift cards? I still feel like restaurants are struggling even though things are opening up. —Stagnant SonyaThis relates to the big tip question. You seem to know the cost of going out to eat, the meal and service, and what that represents: several people’s ability to pay for high deductibles for crappy insurance. So either be willing to pay more than you used to (habits are hard to break, I get it!), or don’t take on this financial burden. Many/most restaurants are still struggling, yep, and they were struggling before the pandemic because it’s an insane industry with really small profit margins BECAUSE they have to keep costs down BECAUSE customers are unwilling to pay more. Wages have been stagnant for decades, so that makes sense too—we don’t have the money to high roll at The Cheesecake Factory the way we want to, but damn are those avocado eggrolls good. We’re in a tough spot, aren’t we? And that ends my summary of the state of the American middle class. Back to the gift cards.If you bought a gift card, use the gift card—that’s what it was for—and remember that the tip is separate and meaningful, so tip on top of the card, and tip well. Then, if you can, come back and back and back to show that restaurant how much you love it.Should I ask if my friends are vaccinated before I go to dinner with them? —Inquisitive IzzyI thought it was LOL when New York Times columnist Ben Smith asked Tucker Carlson if he was vaccinated and he refused to answer because it’s like asking someone when’s the last time they had sex and what position it was in. He was halfway there, though, wasn’t he? If we’re close enough to exchange aerosols, isn’t that like making sure the person you’re about to bang doesn’t have STDs? It’s about protecting both parties. It’s intimate!So yeah, ask your friends before dining indoors together. Because if they’re vaccinated, cool, we’re all comfortable to hang out maskless and share nachos. If they’re not, this could be putting THEM at risk for COVID. The CDC still doesn’t know how likely a vaccinated person is to transmit it to others, but if you’re bringing an unvaccinated friend to an indoor bar with not-so-distant maskless people, they’re at a serious risk if they’re unmasked, too. I’d hang out outdoors in that case.Restaurant service is so bad! Everywhere is understaffed. I tried to be patient last weekend, but I was somewhere for three hours and got two drinks and apps. I paid and left to get dinner elsewhere. What do you do?? —One-Star OmarI experienced this recently. Gorgeous place, wonderful food, laughably bad service (server forgot to bring us plates...then brought two...for four people). Post-pandemic staffing issues are real. A friend of mine can only take bartending shifts when her husband’s home from his job because the cost of childcare is so high she can’t afford to work. There are a ton of valid reasons restaurants are understaffed right now, argue with your uncle about that on your own time.So. In the event that you have bad service, remember that you are merely mortal, and not entitled to being waited on hand and foot every time you dine in a place that spells Grill with an e. You’re capable of empathy and forgiveness. Show these untrained, overworked, underpaid, terrible servers some grace. Tip as you would if the service was great (I know, I know) because people are out here trying to LIVE. And if that sounds hard or challenging for you, maybe explore why that is with anyone other than me lol. The short answer here is: Give ‘em a break. One day, you might need one, too.Explore Bon AppétitIs It Ever OkayRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-01", "author": ["Condé Nast", "Alex Beggs"]}