{"id": "0be6bc8c6c0404d268b3e4ed8817fd8d", "url": "https://www.bonappetit.com/story/alison-roman-baked-pasta", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Alison Roman Made a Creamy, Cheesy, Spicy Baked Pasta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAlison Roman Made a Creamy, Cheesy, Spicy Baked PastaWhen she couldn’t find one she liked, she created one she did.By Alison RomanFebruary 12, 2020FacebookTwitterEmailPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaFacebookTwitterEmailAs a critic of unfortunately soft and too-saucy foods, the concept of baked pasta has never appealed to me. The whole “dump ingredients into a baking dish and hope for the best” thing feels like the food equivalent of wearing sweatpants to run errands (please don’t do it!). When it comes to carbohydrate consumption, you can have your baking dish full of cheese pulls and overcooked penne and I’ll take my skillet of al dente just-glossed strands of spaghetti.But then again, if I’m making pasta for a crowd, I’d prefer to have something that can be assembled, say, ahead of time. Something that doesn’t require my attention while guests arrive, can feed up to eight people, contains more cheese than should be legally allowed, and has an almost so-retro-it’s-cool-again feel. So I guess what I’m trying to say is: I want baked pasta.But I want a really good version.I go the greens-and-cheese route, which to me seems a little more elevated than the tomato route. It reminds me of broccoli-cheddar soup (a taste I enjoyed as a child and have pretty much been chasing for the better part of my adult life), but better and with lots of texture (my top priority).Loads of wilted leeks and greens (I like the bitterness of broccoli rabe) get tossed with heavy cream (which negates the need for a béchamel here—I will do anything to avoid making a béchamel), grated cheese, and very al dente pasta. You can use any tubular shape you enjoy, but I will say there is an unspoken hierarchy, with, obviously, rigatoni at the top and penne at the bottom. (And okay, casarecce is a good one too if I’m feeling fancy and at a nice shop.) Please do not cook this pasta past al dente—as the pasta bakes it continues to cook and soften, and if the pasta is past al dente, then, well, you’ll end up with mush and that’s not what we signed up for. Breadcrumbs—which I would describe as extremely not optional here—provide much-needed crunchy bits (my favorite bits).After it bakes for longer than you think (you’re crisping and browning!), you have a crunchy, still-saucy, veg-forward dish of pleasingly al dente pasta with browned breadcrumbs, wispy greens, and bits of cheese. A baked pasta even I can love.Get the recipe:Spicy Baked Pasta With Cheddar and Broccoli RabeAlison Roman couldn’t find a baked pasta she liked. So she made one she did. View RecipeExplore Bon AppétitPastaRead MorecookingAlison Roman Doesn't Make Brisket Like Her Grandma—and That's a Good ThingBy Alison RomancookingTuck Your Thanksgiving Leftovers into a Cozy Turkey Pot PieBy Alison RomancultureHow to Host a Dinner Party Without Losing Your Mind, According to Alison RomanBy Alison RomancookingWhen a House Full of Hungry Friends Calls, Alison Roman Makes Brothy MeatballsBy Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-12", "author": ["Condé Nast", "Alison Roman"]}