{"id": "0c081efa9820ec9cf5317fbf910a724c", "url": "https://www.bonappetit.com/recipe/radish-and-white-onion-slaw", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Radish and White Onion Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopAugust 2019 IssueRadish and White Onion SlawBy Chris MoroccoJuly 9, 20193.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis method works so well for a few reasons: First, salting draws water out of the vegetables, so they’re more flavorful. Then squeezing expels more water and relaxes them into a crunchy-but-silky state. A final seasoning then has even more impact: The veg have been primed to absorb the rice vinegar and salt.Ingredients4 servings6cups thinly shaved or sliced radishes¼white onion, very thinly slicedKosher salt¼cup seasoned rice vinegar2Tbsp. extra-virgin olive oilPreparationStep 1Combine vegetables and onion in a medium bowl; season generously with salt. Let sit until they start to release their water, 8–10 minutes, then begin to massage, gently at first so they don’t break, then harder as they begin to expel their liquid, until softened to about the texture of coleslaw. Pour off all excess liquid and add vinegar and oil; toss to coat. Taste and season with more salt if needed.Step 2Do Ahead: Slaw can be made 3 days ahead. Cover and chill.How would you rate Radish and White Onion Slaw?Leave a ReviewTell us what you thinkExplore Bon AppétitSlawSaladRadishVegetableOnionSpringQuickEasySideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}