{"id": "0c10338be228bd9b905a9546aa542d57", "url": "https://www.bonappetit.com/recipe/buffalo-chicken-pizza", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Buffalo Chicken Pizza Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBuffalo Chicken PizzaBy Brad LeoneMarch 9, 20183.4(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintA few tips: Letting the cast-iron pan preheat in a blazing hot oven will help ensure a crispy bottom crust, just be careful getting it in and out of the oven. You can use rotisserie chicken or your own leftovers. But what really makes this recipe stand out is the blue cheese dressing, which is mild enough to convert the blue cheese adverse. We used Lodge’s 17\" cast iron skillet because we like the ease of the double handles.Ingredients4 servings1lb. homemade or store-bought pizza dough1Tbsp. extra-virgin olive oil, plus more for drizzling1cup hot sauce (preferably Frank’s)½cup prepared marinara sauce¼cup (½ stick) unsalted butter2Tbsp. heavy cream2cups cooked chicken, torn into bite-size pieces½cup whole-milk plain yogurt (not Greek)½tsp. fresh lemon juice¼tsp. celery salt¼tsp. garlic powder2½oz. mild blue cheese, crumbled (about ½ cup), divided½tsp. freshly ground black pepper, plus moreAll-purpose flour (for dusting)9oz. mozzarella cheese, shredded (about 2 cups)2celery stalks, thinly slicedPreparationStep 1Place a rack in upper third of oven. Place a large cast-iron skillet on rack and preheat oven to 500° (or as high as your oven will go). Place pizza dough in a large bowl, pour a little oil over, and turn to coat. Cover bowl with plastic and let dough proof at room temperature while pan and oven heat up.Step 2Meanwhile, cook hot sauce, marinara sauce, and butter in a medium saucepan over medium heat, stirring occasionally, until butter is melted. Stir in cream, reduce heat to low, and simmer, stirring occasionally, until slightly thickened and warmed through, about 10 minutes.Step 3Heat 1 Tbsp. oil in a large skillet over medium-high. Add chicken, toss to coat, then add ¼ cup Buffalo sauce. Cook chicken, tossing occasionally, until heated through, about 2 minutes. Reduce heat and simmer, stirring often, until chicken is well coated and sauce is slightly thickened, about 5 minutes.Step 4Meanwhile, whisk yogurt, lemon juice, celery salt, garlic powder, ¼ cup blue cheese, ½ tsp. pepper, and 2 Tbsp. water in a small bowl, adding more water if sauce seems too thick (it should be pourable); set aside.Step 5Turn out dough onto a lightly floured work surface. Shape with your hands into a round that’s slightly larger than the cast-iron skillet you’re using. Take hot skillet out of oven (watch that handle!) and place on a heatproof surface. Add a little flour to pan. Lay dough in skillet, then work edges of dough up sides of skillet with your fingertips (use a rubber spatula or wooden spoon if you’re nervous about touching the hot pan). Drizzle a little oil around inside edge of pan so that it trickles behind and underneath dough, which will encourage browning and help it release.Step 6Spread about ⅓ cup Buffalo sauce over dough. Arrange mozzarella over, then top with remaining ¼ cup blue cheese. Arrange chicken mixture on top.Step 7Bake pizza on top rack until crust and cheese are nicely browned, 15–20 minutes. Transfer skillet to stovetop (again, watch that handle!) and let pizza rest a few minutes. Using a spatula, slide pizza onto a cutting board or platter.Step 8Arrange celery over, then top with reserved blue cheese dressing. Season with pepper, then drizzle with oil.Step 9Do Ahead: Buffalo sauce can be made 5 days ahead. Transfer to an airtight container and chill. Blue cheese dressing can be made 1 week ahead. Transfer to an airtight container and chill.How would you rate Buffalo Chicken Pizza?Leave a ReviewTell us what you thinkReviews (2)Back to TopTrianglePlease answer quickly- Preparing this tonight to cook tomorrow.\n “... then top with reserved blue cheese dressing.” makes me think I need to use some before this final step. There is no mention of this, and there seems to be a lot of dressing. Thoughts? \nAlso, hot/marinara adds up to almost 2 cups. Directions only use about 1/2 a cup. What gives?\nFinally, every time I try to give a star rating it defaults to 5 stars. That’s not right. \nThanks!\nBobBobReno4/9/2021Amazing! Absolutely delicious and not crazy spicy. SierraMontréal, QC12/5/2020Explore Bon AppétitPizzaAmericanChickenPoultryBlue CheeseCheeseYogurtOther IngredientsMainNut-FreeSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-09", "author": ["Condé Nast", "Brad Leone"]}