{"id": "0c1cd0c386f1f98e27761f8cd966e99d", "url": "https://www.bonappetit.com/recipe/salsa-macha", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Salsa Macha Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSalsa MachaBy Daniela Soto-InnesJanuary 8, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThink of this as a chile-laced peanut butter you’ll want to put on everything, from tacos to fried eggs. It’s delicious and not at all as intimidating as it sounds. Cilantro is an obvious and perfectly suitable garnish for serving, or you could use a riot of colorful herbs like red shiso, delfino cilantro, and even peppermint.IngredientsMakes about 2 cups1¼cups grapeseed oil6garlic cloves, peeled1cup raw peanuts4dried pasilla chiles, seeds removed4dried ancho chiles, seeds removed10dried chiles de árbolKosher saltPurple corn tostadas, avocado wedges, tender herbs, and lime wedges (for serving)PreparationStep 1Cook oil and garlic in a large saucepan over medium heat until garlic is golden brown all over, 6–8 minutes. Spoon out garlic with a slotted spoon; save for another use or discard. Add peanuts to oil and simmer until golden brown, about 2 minutes. Transfer to a small rimmed baking sheet with spoon. Cook pasilla chiles in oil just until slightly puffed and darkened, 30–60 seconds. Transfer to baking sheet with peanuts. Repeat with ancho chiles, then chiles de árbol. Let oil cool slightly.Step 2Transfer peanuts and chiles to a food processor and pulse until coarsely chopped. With the motor running, stream in oil and purée until peanuts and chiles are finely chopped, about 1 minute. Season salsa with salt and let cool.Step 3Serve salsa macha with tostadas, avocados, herbs, and lime wedges.Step 4Do Ahead: Salsa can be made 2 months ahead. Cover and chill.How would you rate Salsa Macha?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDelicious but lethal if you're not careful. Go easy on the hot peppers and don't burn the peanuts. If you make it right, you can use it on anything. I'm roasting a spatchcocked chicken right now that I smothered inside and out with the sauce. Will be done in about ten more minutes. Fingers crossed!Scott CitronNew York City12/9/2020@HalGuy: Are you stirring the salsa before serving? If not, the oil will separate from the peanuts & chilies due to the difference in density. Don't leave a metal spoon in salsas, I would further advise against using less oil (I would actually do 2 cups oil + add 1 - 2 tbsps. of sesame seeds); however if you feel you have achieved the desired consistency with less--that's entirely up to you & your palate. You can get away with using roasted unsalted peanuts with this, but when you're putting the chilies in the oil DO NOT WALK AWAY. Once they go beyond the toasty stage which happens really fast if your oil is hot, they will burn and taste very bitter. Source: I'm MexicanlavodnasMexico/IL4/8/2019This did not turn out for me. I think I overcooked the peppers and I also used raw peanuts with the skins on. Both of which I can correct on the next attempt. I have a question about the volume of oil to be added into the food processor. Should the entire volume (1.25 cups) be used or just enough to achieve the desired consistency? I added it all and now there is a liquid layer and a grit layer (consisting of the chopped peanuts and peppers). I'm thinking I should just added enough oil to make a slightly runny paste. Thanks in advance!HalguyCanada4/4/2019Explore Bon AppétitSalsaCondimentMexicanLatin AmericanPeanutNutAncho ChileChileVegetablePasilla ChileChile de ÁrbolDairy-FreeGluten-FreeVegetarianVeganHealthyishFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}