{"id": "0c2ba1f09606bee542a2d5bf508d4f74", "url": "https://www.bonappetit.com/story/i-won-a-house-in-detroit", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "I Won a House in Detroit Then Cooked My Way into a Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Won a House in Detroit Then Cooked My Way into a HomeAfter years of reporting stints in and out of the country, I had a home and kitchen of my own.By Liana AghajanianJune 5, 2018FacebookTwitterEmailIllustration by Tiago MajuelosFacebookTwitterEmailTwo years ago, I got a call that changed my life: I had won a house in Detroit. I had applied in the spring of 2015 through a non-profit program called Write A House, which awards permanent writing residencies to rebuild neighborhoods and increase the literary community in the city. The residency included a two-year trial period, after which I would receive the deed.Several months later, I packed a suitcase and moved to a city with a well-known reputation. Detroit had given the world Motown and put it on wheels, but was also notorious for its high crime rates and government mismanagement, which drove the city to bankruptcy. I learned to filter out both the look of shock on people’s faces when I told them where I was moving and the polarizing online comments left on every piece ever written about Detroit. I was determined to discover the complicated yet vibrant city on my own terms.Born to Iranian parents of Armenian descent in Tehran, I came to the U.S. as a refugee in 1988. A familial history tied up in genocide, war, and political turmoil helped redefine my concept of home into one that was ambiguous and constantly changing. Now it was my turn to contribute a new chapter to this staggered past in yet another unfamiliar place. I arrived in Detroit in winter as snow fell, illuminating the hollowed-out buildings that dotted the landscape. They were a stark contrast to a rapidly developing downtown at the center of a constant debate, straddling revitalization and gentrification. Detroit was in transition, and so was I.After years of reporting stints in and out of the country, I had very few possessions. All I brought with me were my clothes and a tightly wrapped package of fresh bread and salt, a traditional housewarming blessing in the Middle East and Eastern Europe. The walls were freshly painted, the windows had no blinds, and the only thing I’d had enough foresight to order was a mattress, minus the bed frame. I ripped off a piece of bread, dipped the tip in the salt and christened the kitchen, which would be the first cooking space of my own.In the winter I made lentil soup with just the right amount of paprika, and learned how to properly dice onions. I mastered the art of dolma, hollowing out tomatoes and peppers to stuff with rice cooked with parsley, vegetable stock, and tomato puree. I bought a cast iron skillet and attempted to replicate a dish I knew better as my dad’s omelette breakfasts, but what turned out to be a version of shakshuka. I called my mom constantly to ask for advice on how to properly cook things like Iranian rice, which includes an essential layer of “\"tahdig,” a bread or potato pan-fried crust. I never got the consistency quite right and, after resorting to a rice cooker, gave up cooking it altogether.The house is on the eastern border of Detroit in an enclave known as Hamtramck, which bills itself as the world in two square miles. With 30 languages spoken and over 40 percent of its population foreign-born, it is considered to be the most diverse city in the state. Though it was settled by German farmers, a large influx of Polish migrants looking for work at the Dodge Brothers automotive plant in the early 1900s took the population from 3,500 to 48,000 in a decade. The city has since become home to immigrants from Yemen, Iraq, Bangladesh, Bosnia, and other Eastern European countries, all of whom maintain businesses, restaurants, and grocery stores in the city’s main thoroughfare.Every time I went to the Arabic supermarket, which carried the essential spices and herbs I needed for making dishes like kuku, an Iranian frittata made with eggs and parsley, chives, spinach, coriander, and dill, I felt like I was a kid again, tailing my mom on her weekly visits to the labyrinth of ethnic supermarkets near our house in the eastside Los Angeles county communities between the San Gabriel and San Fernando valleys.I boiled pounds upon pounds of local tart cherries in sugar for hours to make jam, a nod to a staple of my childhood. Following directions from Armenian cookbooks, I made Adana kebab, a spicy minced meat kebab with cumin, sumac and red pepper. This spicy kebab was named after a city of the same name in Turkey, which Armenians historically called home before they were killed in what is now widely known as the Armenian Genocide. Making the dish over a century after their erasure and using the wisdom of the genocide survivors who sought to preserve these recipes felt like a tangible manifestation of resilience, a way to say, “Yes, we’re still here.”In my second year in Detroit, inspired by my Bengali neighbors who turned their backyards into lush vegetable gardens teeming with chili peppers and squash, I planted dozens of vegetables and waited to see which ones would take. Soon, I had so many green beans, radishes, eggplants and tomatoes, that I had to can them or start giving them away. This year, I finally received the deed to the house. To celebrate, I made a batch of Anoush Abour or “Noah’s Pudding,” an Armenian dish made of wheat berries soaked overnight and then boiled in the morning with raisins, apricots, currants, almonds, pine nuts and rose water.I made the mixture in one of the first pots I had ever owned, and found myself adding ingredients from memory. The recipes I collected after a couple of years, cooked consistently in one place, had traveled over long distances, borders that had changed and empires that no longer existed. The cookbooks that carried them now were assembled on my shelf. The spices, sauces and grains occupied the kitchen cabinets, where I am increasingly running out of space. I ate a couple spoonfuls, and felt like I was home.Explore Bon AppétitHealthyishDetroitessayRead MorecultureI Ditched Everything for My Dream Life, Then I Did It AgainBy Diana SpechlerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Liana Aghajanian"]}