{"id": "0c322ea0124f0ef4e4d87ef7bcae7e24", "url": "https://www.bonappetit.com/story/garlic-prep-feud", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Make Black Bean Soup and Then (Easily!) Clean Your Dutch Oven This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake Black Bean Soup and Then (Easily!) Clean Your Dutch Oven This WeekendI vowed to be better at stain removal in 2020 and I’m sharing two great tips with ya.By Alex BeggsJanuary 18, 2020FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Stains and beansI made the New Year’s intention to be better about stain removal in 2020 and to eat more beans. Both of which came to a head last weekend when I made a pot of Basically’s black bean soup in my cute white Milo dutch oven (you should...buy the black one). The soup was great, 10/10 would cook again, even though I made the fatal mistake of using old [BRAND NAME REDACTED] grocery store beans that never fully softened. I blended it to smithereens to cover that up. Then I had a pot tye-dyed purple-black from the beans. Until I remembered a tip from an old bonappetit.com article. You sprinkle baking soda in the pot, fill it with water to whatever level your stain reaches, boil it for 5-10 minutes, and let it sit overnight. The next morning I was able to scrub all of the bean grime out.Unrelated but another life-changing stain tip for me: red wine stain on your tablecloth? Make a 1:1 mixture of dish soap and hydrogen peroxide, pour it on the stain, let it soak in, then launder per usual and learn how to pour properly.Get the recipe: Basically Black Bean SoupGet the knowledge: How to Clean Your Dutch Oven (Without Ruining It)Want this letter before it hits the website? Sign up for our newsletter!Slive and let slive“Sometimes a QUEEN has to remind everyone why she’s QUEEN.” That sassy quote is on a pristine kitchen towel on the set of “Cooking with Paris,” Paris Hilton’s new cooking show on YouTube. “I am an amazing cook,” says Paris holding a tiny dog in a Chanel sweater. She goes on to reference her mother’s “amazing pastas, lasagnas, and...Thanksgiving” before showing us how to make lasagna. In fingerless gloves (!), she “steams” lasagna noodles in a pot of water, complaining that she prefers the already-cooked noodles, and that she wished the mozzarella was already shredded too. “I’m making this a lot more work than it is,” Paris sighs. It’s almost as if she wishes the lasagna were already cooked, by someone else, in a restaurant maybe? “Cooking with Paris” will make you question what it means to be an amazing cook, or at least make you question why there’s an essential oil diffuser on the kitchen island. I admire a show that pushes the boundaries like that.You thought Molly Baz loved salt???Big cream cheese plansPhoto by Chelsie Craig, Food Styling by Kate BuckensThis weekend I’ve got big cream cheese plans. In a Test Kitchen cleanout I scored a few boxes of Philadelphia cream cheese, which scandalously originated in New York, btw. And I could only think of one thing I wanted to do with it. Bake Molly Baz’s Basque burnt cheesecake a second time, remembering the heavy cream this go-around. It’s so jiggly creamy perfect and extremely easy.Read more Philly cream cheese fun facts here.Get the recipe: Basque Burnt CheesecakePhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenSpeaking of jiggleI loved this essay about panna cotta over at Taste. “I’ve served it to people I was wooing and to kids and to nice people and to jerks,” writes Sadie Stein. Can relate!Read it: Panna Cotta Is Whatever You Want It to BeHere’s the recipe for Claire Safftiz’s Ricotta Panna CottaTikTokin’For 20-57 minutes before bed, I watch TikTok videos until my eyes cross and my brain turns to jiggly mush, like leftover burnt cheesecake. In the food arena of TikTok, there’s a whole genre of people/mostly teens who work at fast food restaurants and reveal secrets like how one beloved place makes mashed potatoes from an add-water mix. Check out the Taco Bell cheese grater! It’s RIVETING stuff. There’s also Claire content, like this.Unnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Chelsie Craig, Food Styling by Pearl JonesIn the new Basically recipe for vegetarian chili, Sarah Jampel smashes and then chops garlic, which caused a minor stir around the snack table on Thursday. Alex Delany refuses to smash; he prefers to thinly slice or microplane garlic. Upon hearing that Adam Rapoport smashes and puts whole cloves of garlic into pasta sauce, Delany screamed: “That’s the most ILLOGICAL thing you can do! Someone’s going to get a whole clove of garlic in their sauce! It should be spread throughout the sauce to make every bite more garlicky. That’s a more democratic system.” A quick poll of the office revealed microplaning to be the most common way staffers “deal with garlic.” But Jampel has no time for microplaning when a recipe needs multiple cloves: “You can only grate one at a time!” She’s a smasher. “These are different means to the same end,” said peacemaker Rachel Karten before Delany took the last word: “We can all agree Adam’s way is the worst way.” Whispers: I do it the Adam way.Get the recipe: Vegetarian Chili with Lots of FritosWait, before you go! Send me your dubious etiquette questions on the theme of...room service!…to staff.bonappetit@gmail.com. This will be for the Questionable Etiquette column in our May travel issue. Don’t worry, I’ll change your name so no one will know how high maintenance you are!Explore Bon AppétitBeggs NewsletterRead MorecultureHow Philadelphia Cream Cheese Took Over the WorldBy Priya KrishnaVegetarian Chili With Lots of FritosRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-18", "author": ["Condé Nast", "Alex Beggs"]}