{"id": "0c36fc7c1d68317667f64085ed96b538", "url": "https://www.bonappetit.com/recipe/chickpea-and-chorizo-tostadas", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "Chickpea and Chorizo Tostadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChickpea and Chorizo TostadasBy Lauren SchaeferMarch 29, 20184.5(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintCrunchy, creamy, chorizo-y—these quick tostadas hit all the notes. If you normally throw the stems from a bunch of cilantro or parsley straight into the garbage...DON'T! They're delicious, and can be diced finely and stirred into all kinds of things—like the lime yogurt in this recipe—to add herb-y flavor and crunch.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketColander$11 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASpoon$24.69 At AmazonMedium Skillet$60 At AmazonWooden Spoon$6 At AmazonIngredientsMakes 4115-oz. can chickpeas1lime¼cup plain whole milk Greek yogurt1tsp. kosher salt, divided8sprigs cilantro2links fresh chorizo (about 8 oz. total)4tostada shellsPreparationStep 1Rinse and drain 15 oz. chickpeas in a colander. Measure out ½ cup; reserve remaining chickpeas for another use.Step 2Finely grate zest of 1 lime with a microplane or grater into a small bowl.Step 3Cut lime in half and squeeze juice from one half into bowl with zest. Cut remaining half into 2 wedges; set aside for serving.Step 4Gather 8 cilantro sprigs on cutting board. Starting at the stem end, finely chop stems until you get to the leaves; reserve leaves for serving. Add stems to bowl with lime.Step 5Add ¼ cup yogurt and ½ tsp. salt to bowl and mix with a spoon to combine.Step 6Remove casing from 2 chorizo links; discard. Heat a medium nonstick skillet over medium-low. Cook chorizo, breaking it up with a wooden spoon, until partially cooked, about 3 minutes.Step 7Add reserved chickpeas and remaining ½ tsp. salt and mash together with back of spoon until chorizo is cooked through and crispy, 7–10 minutes. Remove from heat.Step 8Spread reserved crema over 4 tostada shells.Step 9Top crema with chorizo mixture.Step 10Top with reserved cilantro leaves and serve with reserved lime wedges alongside.How would you rate Chickpea and Chorizo Tostadas?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThese are so good! Was pleasantly surprised with the short and humble ingredient list. Really liked the way they jazzed up the base. OmarNew York, NY11/9/2021I've made this multiple times and it always tastes SO good. It's very easy and straight forward and such a great meal to have in your back pocket. Not sure why but it feels more appropriate to make this during spring and summer than during fall and winter, but that's just me. \n\nEither way, try it. You won't regret it. MJToronto4/21/2021I've made this 3x -- it's amazingly delicious.AnonymousAnn Arbor, MI4/21/2021I've made this a few times, but today really nailed it. I generally use TJ's soyrizo, and am going to start making my own. I usually add some roasted sweet potatoes, and had a Japanese yam that I cut up and seasoned and added to the mix. I cut the serving size to three, and also topped with pickled red onions, queso fresco, and cucumber to up the veggies in this. dalex27Pittsburgh, PA8/11/2020I was going through some old copies of Bon Appetit when I ran across this recipe. It sounded good and we hadn't decided what to have for dinner, so I zipped to the market and bought what we needed. Boy, what a delightful surprise when we took our first bite. I expected good, but this was great! Definitely adding it to our rota.Mark JacobsonBethesda, MD7/25/2020A perfect meal for a lazy, hot summer evening, or for an easy weekday lunch. Comes together in maybe 20 minutes. Just remember to spring for nice chorizo, not the mass-marketed stuff. We made tostados and cooked the chickpeas from dried in an Instant Pot and added pickled red onions and shredded cabbage to the mix. Still came together in a snap.monobrownVancouver,BC7/20/2020Tasty!  Was looking for something different to do with the homemade tortillas we get at local farmers market (thank you Katelic I followed your process with the tortillas).  I subbed black beans for the chickpeas because I had lots of them and no chickpeas.  Loved the yogurt sauce.  Good showpiece for the chorizo.  Anonymous190637/20/2020Now that we are home a lot for quarantine we have been cooking way more, we made these for a quick lunch, and they were a big hit! We really enjoyed the fresh yogurt sauce against the chorizo! I had leftover corn tortillas that I rubbed down with a little oil and baked at 400 F, and I used ground chorizo instead of links, since I had some in my freezer, and still turned out supberb!KatelicArizona4/13/2020I am so obsessed with this!!!!!k.scottNew York3/27/2020Fantastic!!! Followed the recipe exactly. Everyone raved over the flavors! I used beef chorizo, though I plan to experiment with other proteins (ground beef, chicken, shrimp, scallops), I will first exhaust all the available chorizo options. This will become a new summer staple (absolutely perfect with ice-cold beer!!)AnonymousKeaau, HI3/14/2020We’ve made this twice now. We used the soy chorizo from Trader Joe’s and Uptons Seitan chorizo. Both were AMAZING but The soy chorizo from TJs was a better substitution in my opinion. All in all this is quick and delicious!! AnonymousBoston, MA1/23/2020It was soooooo easy to make! I had most of the ingredients at home to begin with but since I did overdo it during the holidays, I’m tryin to cut back with indulging this January. I ended up swapping out the sour cream for plain Greek yogurt! And the chorizo was subbed by an oregano turkey sausage I found at my local  market.AdriellePSanto Domingo1/11/2020This was fine I guess. The sauce was really strong, and I couldn't get the same crumbly texture in the chorizo.AnonymousColumbia, SC1/11/2020Really good! I used regular corn tortillas instead of tostadas. Very simple and effective recipe.trebhan1645Michigan4/8/2019Super good! I heavily modified the chickpeas and chorizo to my tastes and to add volume. I added diced tomatoes, onion, all the chickpeas instead of just a 1/2 cup, garlic, paprika, and cayenne. This definitely made it more of a paste than the crumble seen in the pictures, but I wanted it that way. I paired this with the easy flatbread from the feel good food plan. AnonymousBerkeley, CA1/20/2019Explore Bon AppétitTostadaChorizoSausageMeatChickpeaBeanVegetableQuickEasyWeeknight MealsMainGluten-FreeNut-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Lauren Schaefer"]}