{"id": "0c517b9f8bab8ce683d0058ebb662304", "url": "https://www.bonappetit.com/story/how-to-use-herb-stems", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "How to Use the Herb Stems You Definitely Shouldn't Be Throwing Away | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Use the Herb Stems You Definitely Shouldn't Be Throwing AwayHerb stems don't belong in the compost—they belong in your dinner. Here's how to use these leftover bits to their full potential.By Alex DelanyMarch 29, 2018FacebookTwitterEmailFacebookTwitterEmailIt's OK: We get it. Almost every recipe ever says to pick the leaves and tender stems from a bunch of herbs and trash the rest. You’ve been conditioned to think that the remainder of the plant is compost. But the truth is that, while those leaves may be pretty, the stems that they grow on are packed with flavor and shouldn't go to waste.Yep! The stems of soft herbs—think parsley, dill, cilantro, and basil—taste just like the leaves. (This isn't really the case with tougher, woodier herbs like rosemary and oregano.) The flavor isn't quite as bright and pronounced, but it’s very much there. The reason they get cast aside so often is because they tend to be a bit more fibrous than the tender, leafy parts, which means that they're not great for sprinkling and garnishing. But if you show them the love they deserve, the payoff can be huge. You paid for the whole bunch, right? You might as well get your money's worth. Here’s how to use herb stems to boost your salads, soups, and pastas to new heights:Alex LauPesto and Salsa VerdeAny green, herby sauce makes a good home for those leftover herb stems. They can help to fill out a blended sauce like pesto—it's kind of all the same when you buzz it up like that—and when chopped finely they add flavor and a bit of crunch to looser sauces, like a simple salsa verde. Get 'em in there!Boost the flavor in your bean broth with some parsley stems.\nPhoto by Gentl & HyersBroths and SoupsWhen building a quick broth, you need as much help as you can get in the flavor-building category. Parmesan rinds, miso, and alliums like garlic and onions are all great, but herb stems belong in that pot too. They'll lend an herby depth to your finished product, and since you're straining the stuff anyways, you don't even have to chop them up—just toss them in and simmer away. You can also chop them finely and stir them into pretty much any soup right at the end of cooking to add a pop of brightness and texture. Think of everything soup has done for you. It’s time you do something for soup. This is that thing.Dress your salad with a herb stem vinaigrette to blow people's minds.\nTED CAVANAUGHSalads and VinaigrettesHerbs in salad? Very good. Herb stems in salad? Also very good. You probably don't want to make a whole salad out of herb stems, but incorporating finely chopped stems into your salad—whether it's a simple green salad or a more elaborate, veggie-packed situation—is a pro move. Herby complexity: always welcome. And while you can certainly just toss them with the other vegetables in the mix, you can also chop them up and stir them into the vinaigrette you're using to dress that salad with. Listen, we don't care how those herb stems end up in your salad. We just care that they do.But first you need to make something with herbs in it...Chickpea and Chorizo TostadasCrunchy, creamy, chorizo-y—these quick tostadas hit all the notes.View RecipeExplore Bon AppétitBasicallyherbCilantroBasilParsleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Alex Delany"]}