{"id": "0c547168e39866338b73072ba0ed2fb9", "url": "https://www.bonappetit.com/recipe/chicken-piccata-2", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Chicken Piccata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueChicken PiccataBy Chris MoroccoMay 7, 20214.7(194)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintWhen it comes to boneless skinless chicken breasts, people tend to either love ‘em or hate ‘em. For those in the latter group, this chicken piccata recipe is here to convert you. A few simple steps create a dish every bit as good as restaurant versions, ready to serve alongside a towering green salad and a simple pasta or good loaf of crusty bread to soak up the sauce.A quick note on the technique: Lightly flouring the cutlets lets them brown quickly without overcooking and helps thicken the sauce. And if you don’t have capers at hand, now is the time to buy a big jar—your kitchen will never be the same. Toss them into this roasted cauliflower number with parmesan or verdant linguine with green olive sauce. If you buy capers in brine, make sure to drain the liquid before adding them to a recipe; and if your capers are packed in salt, give them a rinse and a soak in water for 15 minutes.Editor’s note: This recipe was originally published February 7, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeat Tenderizer$17 $14 At AmazonLarge Skillet$84 At AmazonCitrus Juicer$13 At AmazonIngredients4 servings2large skinless, boneless chicken breastsKosher salt½cup all-purpose flour3Tbsp. extra-virgin olive oil, divided4garlic cloves, smashed⅓cup dry white wine1Tbsp. drained capers, coarsely chopped4Tbsp. unsalted butter, cut into pieces2Tbsp. fresh lemon juiceChopped parsley and lemon wedges (for serving)PreparationStep 1Slice chicken breasts in half crosswise into 4 cutlets and lightly pound each piece between sheets of plastic wrap until an even thickness (about ½\" thick or less). Season lightly with salt. Place flour in a medium shallow bowl. Working one at a time, place cutlets in bowl and toss to coat in flour. Knock off excess flour and transfer to a plate.Step 2Heat 2 Tbsp. oil in a large skillet over medium-high. Working in batches if needed to avoid overcrowding the pan, cook cutlets, without moving them, until deeply browned underneath, about 2 minutes. Turn over and cook on the other side just until chicken is nearly cooked through, about 30 seconds. Transfer to a clean plate.Step 3Add garlic and remaining 1 Tbsp. oil to the skillet and cook, stirring often and reducing heat if needed to keep garlic from scorching, until golden brown, about 2 minutes. Add wine and capers and cook, swirling pan and scraping up any browned bits stuck to the bottom of skillet, until liquid is almost completely evaporated, about 3 minutes. Add ½ cup water, followed by the butter. Swirl pan vigorously while butter melts to help it form an emulsion with water, about 1 minute.Step 4Return chicken to skillet and simmer until chicken is cooked through and sauce is thick enough to coat a spoon, about 2 minutes. Remove from heat and stir lemon juice into sauce; season with salt. Transfer chicken and sauce to a platter and top with parsley; serve with lemon wedges.How would you rate Chicken Piccata?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleEasy, tasty, healthy 😘😊😁WendyWellington, NZ2/17/2022Still fantastic, and proves there is no need for a flour/egg/bread crumb treatment.BeviVermont12/18/2021Quick, easy and delicious!Danielle  MColorado Springs, CO12/11/2021This recipie was fantastic. My Italian boyfriend loved it. Marti GoldNewPort Richey, Florida10/21/2021Wow this chicken was freaking delicious and relatively simple to make! 10/10 would recommend Anonymous9/30/2021Fantastic! Tasted good on my first try but even better after changed it up a bit for my second time where I  1) Doubled the amount of lemon juice and capers 2) Instead of using water, used chicken broth and doubled that amount as well. Absolutely Addictive!Michelle PCottonwood Heights, UT9/27/2021The recipe was simple but just good. It was missing something. Afterwards, I cross-checked the recipe with other highly-rated ones and it’s clear that this one is skimpy on the capers. Other recipes call for 1/4 cup, whereas this one calls for just 1Tbsp. Definitely using more capers next time! AnonymousLos Angeles, CA8/27/2021I must preface this by saying I am new to cooking! \nSo I browned the chicken (not fully cooking it like the recipe says) after dredging it in flour then made the sauce then added the chicken back to the sauce in the pan. The flour made the sauce thicken which was good but it felt like it made the chicken kind of soggy. What am I doing wrong? Any suggestions would be appreciated. The sauce is soooo yummy. Thanks!ShaunaVancouver, BC8/3/2021I made this the first time I cooked for my partner and now they have a great impression of my cooking skills. \n\nThis is one of the best meat recipes I've made! Purchase every ingredient!! They're all essential. The lemon and parsley as the finishing touch is just *chefs kiss* 10/10. If you're just scrolling deciding if you should make it, this is your sign to. You won't regret it :)Too TallDFW, TX7/28/2021This dish is amazing and it’s so easy!AnonymousWilliamsport, Pa7/21/2021Great recipe ,a definite favorite!  just thought I'd mention that you forgot to add the 1/2 cup of water to the list of ingredients !\nCheers !BeverleyWhite Rock, British Columbia7/21/2021Great recipe - thank you for posting it.  I put in a tad more butter than it called for, and also a tad more wine.  I also thicken the sauce by adding prepared Alfredo sauce instead of flour.  It’s all in the sauce, and you have great latitude to experiment with it.  FrankDallas Texas6/29/2021Absolutely delicious. I changed nothing, went by the recipe and it was absolutely fabulous. My partner said it tasted better than restaurant-level. I will be making again many times.  Olivia New York, NY5/14/2021This was AMAZING! I highly recommend using this recipe! Great job Chris. I followed all the steps exactly except I didn’t have any white wine in the house so I used beer (hoegaarden) as a replacement and it came out great. My boyfriend was so impressed. I served it over pappardelle pasta (from Trader Joe’s) with chopped sautéed baby broccoli mixed with the pasta. AnonymousQueens NY2/15/2021Wow wow wow 🤩 super delicious and easy recipe. Nice fancy meal to serve yet really easy to make. I recommend this and will be making it again. I tell you Bon Appettit does it again 🥳 JessOQueens, NU1/13/2021Explore Bon AppétitItalian AmericanAmericanChicken BreastChickenPoultryLemonCitrusFruitWeeknight MealsMainNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Chris Morocco"]}