{"id": "0c5fca615616fa6a353dc0e53abe568e", "url": "https://www.bonappetit.com/recipe/maiale-al-latte-milk-braised-pork", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Maiale al Latte (Milk-Braised Pork) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMaiale al Latte (Milk-Braised Pork)By Andy BaraghaniNovember 27, 20184.6(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis traditional Italian braised pork roast may not be one of the most photogenic dishes you’ll ever make, but it sure is one of the tastiest. The milk slowly caramelizes during cooking, and at the end it will look as though the sauce is broken; however, the milk curds that form are the most delicious part of the sauce.Ingredients8 servings4lb. skinless, boneless pork shoulder, cut into two 2-lb. piecesKosher salt3Tbsp. extra-virgin olive oil2heads of garlic, cut in half crosswise6cups whole milk4bunches sage (about 20 leaves) or a mix of rosemary sprigs, thyme sprigs, and/or bay leaves2chiles de árbol or ¾ tsp. crushed red pepper flakes42\" strips lemon peel2Tbsp. very finely chopped parsleyFreshly ground black pepperPreparationStep 1Season pork generously with salt all over. Let sit at room temperature at least 1 hour, or preferably chill overnight, then let sit at room temperature 1 hour before cooking.Step 2Preheat oven to 300°. Heat oil in a large Dutch oven or heavy wide saucepan over medium-high. Add garlic, cut sides down, and cook until golden brown, about 1 minute. Transfer garlic to a plate. Add pork to pot and cook, undisturbed, until golden brown, 3–5 minutes. Turn and cook, reducing heat to medium if needed so it doesn't burn, until golden brown on all sides, another 3–5 minutes.Step 3Return pork and garlic to pot. Add milk, sage, chiles, and lemon peel. Transfer pot to oven and bake, uncovered, turning pork every 30 minutes, until meat is very tender and can easily be pierced with a paring knife and milk has reduced and formed curds, 2½–3 hours. Transfer meat to a cutting board and let rest 15 minutes.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 4Using a spoon, skim off most of the fat from the braising liquid; discard sage and lemon peel. Taste sauce and season with salt, if desired.Step 5Slice pork and transfer to a platter. Arrange roasted garlic alongside pork, if desired. Spoon sauce over. Top with parsley; season with pepper.How would you rate Maiale al Latte (Milk-Braised Pork)?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleThis recipe is the real deal. Don't deviate from it, and don't try to \"fix\" the sauce when it breaks. It's supposed to break! theoAtlanta6/23/2021There's nothing better than pork or veal braised in milk. Veal breast especially.Dom delli CarpiniBeaverdam, VA1/22/2021OMG, the number of reviewers who destroyed the curds by blending them out!!  This is a crime against rustic cooking. The curds are integral, velvety chunks of deliciousness. Please don’t destroy them — enjoy the dish as an Italian grandmother intended, lovely & lumpy. AnonymousToronto8/2/2020I made this last night, after planning ahead the day before. Cut the recipe in half as that was the size of roast I had. I bashed some grains of paradise in with the salt that the roast marinated in, for an extra bit of zip. I also didn't have any fresh herbs (haven't made it to the grocery store lately because, quarantine) so I tied up the lemon zest with dried sage, rosemary and thyme in some cheesecloth so I could remove it after braising. This was FABULOUS. The milk sauce is heaven. Served it with fondant potatoes and balsamic broccoli ( roughly inspired by BA's Broccoli Strascinati recipe with dried fruit and almonds). Being self-isolated ain't so bad when you finally have the time to create elaborate feasts! jessivyHamilton, ON3/21/2020Really amazing recipe. Tasted amazing and really simple. I had to make it in a crock pot on high since I was at my in-law’s house and didn’t have my Le Creuset, but it worked out really well. ashleyjHouston11/30/2019This looks like a winner!  I mistakenly made another version that I had also book marked and with the exception that the meat simmered in white wine first, the quantities of the goodies (garlic, lemon peel, sage from my garden!) were so small that they lent only a very, very subtle flavor. I will prepare this version next time!AnonymousBainbridge Island, WA11/21/2019This recipe was full of great ideas and inspiration. I was looking for a new approach to preparing pork belly and this worked out really well.  Modifications to the recipe? I used a bunch of fresh rosemary, a few bay leaves and a little fresh time for the herbs. Also, after 2 1/2 hours of cooking at 300°, I took out the meat, let it sit for a bit and then dried and broiled the skin for about 5 minutes.  That achieved the crackling I was looking for and kept the meat still super tender.  After removing the garlic, Iemon strips, the bay leaves and the rosemary sprigs (still leaving quite a bit of the rosemary leaves), I did end up blitzing and then straining the sauce to get rid of the milk clumps but then added a tablespoon of butter to the hot sauce to make the whole thing silky and even more decadent.  It was really delicious.  Can't wait to try this again! I'm giving this 4 out of 5 stars only because of the extra effort I think most people will end up going through to deal with the milk curds. Canadians in CarolinaCharlotte, NC10/24/2019@anonymous I don’t understand how anyone could read the name of this recipe and think it could in any way be kosher, but okay.\n\n\nThis dish was delicious. I served it with crusty bread and an arugula salad. The braising liquid was fragrant and flavorful. As for the bland reviews, I would recommend seasoning and “marinating” for longer. I muddled together fresh rosemary, salt, and pink peppercorns and let the pork sit in that mixture at room temp for an hour. The result was perfectly salted, bursting with flavor pork. Anonymous12/27/2018Wow. I don't know how the \"bland\" reviewers made this, but it was one of the most tasty pork dishes ever to hit our house. Any my wife makes some awesome tenderloin recipes. The shoulder was as tender as the most tender meat I've had. The smell while roasting in the oven filled the house with herbal yumminess! I used rosemary and thyme sprigs with bay leaves and only 1 head of garlic and my kids and I found the flavors to be outstanding and well-balanced while still letting the pork flavor show its colors. The curds also came out perfect and added a fun, tasty texture to the finished dish. Finally, I love when it's easy to make it look just like the picture in the article both while cooking and on the serving platter!  :-)   martincDexter, MI12/19/2018Agreeing with others that liked the recipe, season the meat!  Don't be scared to use a little pepper too.  Also, much of the flavor comes from the hard sear.  I strained the curds, but reserved some of the liquid, used an immersion blender to make the curds smooth, and thickened the sauce with a cornstarch slurry.  Looking forward to making it again for New Years.  imcisaacIndiana, PA12/17/2018Made it and very succulent.  It took time, but the pork was delicious.  My guests LOVED it!!\nYou should liberally salt the meat before cooking, which I think address \"comments\" from other reviewers.\nI would definitely make this again!dukey88Washington, DC12/13/2018Not sure why people are saying it was bland. Need to salt pork well and get a heard sear on pork. I would make again but leave rosemary out. Maybe use smaller pieces of pork so less milk was needed as well. I put the pork under the broiler while it was resting to get a crispy skin. AnonymousCentreville Va12/4/2018Ahh I also found this to be quite bland. Did I send up slathering it in BBQ sauce? Maybe..... Without it, it just didn't taste like anything. Since I won't leave this without a compliment, the meat was obviously very tender from braising. :)AnonymousLos Angeles12/4/2018Bland. Very bland. If you're from England this might be the dish for you. I used 3 chili's instead of 2. Used the sage plus rosemary, bay leaves and thyme. Used immersion blender for the sauce, thin and bland. If it wasn't for the garlic to spread on each bite there wouldn't have been any flavor at all. Pork was tender enough and the leftovers will make great Carnitas tacos. Did I mention it was bland?jackiehardie1726Eugene, OR12/3/2018I enjoy serving Jamie Oliver's Chicken in Milk, which is very similar.  When done cooking, remove the meat and garlic for serving.  Spoon out the herbs and lemon peel from the braising liquid and toss.  Insert an inversion blender wand into the pot of milk to take care of those pesky curds.  This creates a luscious sauce you can proudly pass around the table.  And definitely serve that garlic—it's delicious.  I look forward to trying this Maiale soon.AnonymousAustin TX12/1/2018Explore Bon AppétitItalianEuropeanPork ShoulderPorkMeatMainNut-FreeGluten-FreeKetoBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Andy Baraghani"]}