{"id": "0c60dfbad8aedf8149e59bda294f2914", "url": "https://www.bonappetit.com/story/how-to-make-frittata-for-a-crowd", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "How to Master Frittata for a Crowd | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Master Frittata for a CrowdEditor in chief Adam Rapoport shares his frittata game plan for entertaining in his weekly newsletter.By Adam RapoportOctober 16, 2018FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.How to master frittata for a crowdMan, I had a carby Sunday.It all started with brunch. We invited our friends Pac and Katherine over, along with their kids, Frankie and Mary Rives.I bought a dozen bagels. Simone suggested a frittata. And I thought, sure, no problem. Crack some eggs, sauté some of this and that, throw it in a pan. How hard could it be?Want this letter before it hits the website? Sign up for our newsletter!But not until I called up this veritable frittata treatise did I realize that I actually had no clue what I was doing. Like, did you know your frittata needs dairy? Well, it does. Whether it’s heavy cream, crème fraîche, or sour cream, you want ½ cup for a dozen eggs.And what temperature do you set your oven to? 350°, thank you very much. And it’s always better to slightly undercook by a smidge, rather than overcook. You want a tender frittata, not a rubbery one. So, for 12 eggs, start checking at no more than 15 minutes. If the frittata is no longer wobbly, it’s done!And did you even consider what size pan you’re going to use? I mean, come on! (Hint: Always one size smaller of a non-stick pan than you think. Better a thick frittata than a flat one.)So I ended up caramelizing a mess of onions and sautéeing a big bag of spinach with garlic. Into the pan this all went with a handful of grated Parm, crème fraîche, and 15 beaten eggs. And, man, did it turn out well!I should’ve built my plate around the frittata and a simple green salad I made, but of course I couldn’t resist multiple toasted bagels—with butter and cream cheese. I know, I’m crazy like that. And to round things out, Katherine showed up with a just-baked banana bread, because you can’t come empty-handed, right?Once everyone cleared out, I escaped to the gym because I had an unusually booked Sunday evening. Normally, I like to stay in. But Fabián von Hauske and Jeremiah Stone, chef-owners of Hot 10 winner Wildair and Contra, were celebrating the release of their new book, A Very Serious Cookbook’ at Una Pizza Napoletana, which they also run. I couldn’t not go, and I couldn’t not indulge in some natural wine and Anthony Mangieri’s renowned, pillowy soft Neapolitan-style pies.Photo by Adam RapoportFortunately, dad that I am, I was literally the first one there, at 6:15pm sharp. This allowed me to take in the scene and make it to our friend Natasha Pickowicz’s birthday party down the street at Scarr’s, home to BA’s pick for the best slice in all of New York City.So, yeah, I couldn’t not eat more pizza—this time a superb pepperoni grandma slice and an off-the-menu white clam slice. So, so, so good.Did I mention I went to the gym yesterday?Explore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Adam Rapoport"]}