{"id": "0c6e6e565949e8fefc448b91b24f9372", "url": "https://www.bonappetit.com/story/indian-ish-shrimp-quinoa-pulao", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Indian-ish Shrimp and Quinoa Pulao You Can Make in One Pot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Indian-ish Shrimp and Quinoa Dish You Can Make in One PotThe weeknight meal I always thought was meh, until I realized what I was missing.By Priya KrishnaMay 6, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailI recognize that it’s not hip to actively love quinoa. To want it in lieu of starchy, snow-white rice. To eat it because you like the taste, and not because it’s probably a healthier decision.But I’ve always had a soft spot for the grain. It’s wholesome and nutty. I like the chia seed-esque texture. This is an unpopular opinion among most of my friends, who think quinoa tastes musty. Until they try my aunt Sangeeta’s Quinoa Shrimp Pulao.Some background on my aunt Sangeeta: She is a highly practical, bespectacled pediatrician who loves her two Instant Pots almost as much as she loves quinoa. She and her husband Hemant have long been the biggest health nuts of our extended family. She discovered quinoa when she was diagnosed with prediabetes a few years ago and looking for a grain with a low glycemic index to eat with dal in place of rice. Quinoa ticked lots of health boxes: It was high in fiber, high in protein. She became not just a quinoa fan, but a quinoa ambassador.Soon, she was substituting it in any recipe that called for any grain. In Indian cuisine, rice is the backbone in many dishes, both sweet and savory. Sangeeta has found a way to sneak quinoa into khichdi (a lentil and rice porridge), a Mulligatawny-like soup (typically containing rice), and even kheer (a cardamom-y rice pudding).  Some of these choices don’t make much sense to me (khichdi should ALWAYS be made with rice. Period!), while others have been surprise wins (quinoa kheer! It’s like chia seed pudding without the sliminess). But the greatest hit in Sangeeta Mami’s quinoa canon is the quinoa shrimp pulao.Pulao is eaten across much of South Asia. It’s rice cooked quickly in water with a few spices and vegetables (very similar to a pilaf)—the kind of thing Indian parents know they can pull out of nowhere when dinner needs to be on the table sooner rather than later. When I was growing up, pulao was one of the few dishes my dad knew how to make. He’d throw rice, water, turmeric, cumin seeds, a cinnamon stick, dal, and the contents of a packet of frozen veggies (the ones with the cubed carrots, peas, and green beans) into a casserole dish, microwave the whole thing for 30 minutes, and serve it to us with a side of yogurt (and occasionally, ketchup). It was a complete meal in one: rice, veggies, dairy. It was nourishing, but not that exciting. A little one note. A little mushy.Then, one afternoon, I was hanging out at Sangeeta’s, and she put out leftovers for lunch—dal, paneer, green bean sabzi, and her pulao. Instead of rice, it had quinoa, crunchy bell peppers, and plump pieces of shrimp. It was seasoned with garlic, ginger, turmeric, and green chiles. I took a bite. This was the most interesting pulao I had ever eaten. There were colorful, crisp vegetables that didn’t come out of a packet. The garlic, ginger, and green chiles brightened the dish. The shrimp—along with the quinoa—absorbed the seasonings exceptionally well. The grains were fluffy. The quinoa didn’t taste bitter, or overly earthy.I asked Sangeeta to show me how to make her pulao for my cookbook, Indian-ish, and the technique, I learned, is to cook everything on low heat. Well, you start by sweating a chopped yellow onion in some oil over medium-high heat in a Dutch oven, then you turn the heat down to low and add two chopped Serrano chiles, four minced garlic cloves, a pinch of ground turmeric, and 2½ tablespoons of ginger. Add a pound of shrimp, cook those for five minutes, then add two diced peppers and a pinch of salt, and cook for a few more minutes. The shrimp will turn light pink, and the peppers will become slightly soft. The low heat is how the shrimp stay juicy and not rubbery, and how the peppers maintain their crunch. After the shrimp and peppers cook, you fold in three cups of cooked quinoa. The final trick is patience. Once you finish cooking everything, you turn the heat off, and let the dish sit for 15 minutes before serving. This allows the liquid to evaporate, making the grains light and cheerful.Sangeeta’s quinoa shrimp pulao contains the best parts of pulao—it’s timesaving, filling, and requires only one pot—but without any of the limp veggies and homogeneity (no knock on dad!!! He did his best!) I have come to associate with the dish. It looks and tastes impressive. It’s not something I have to settle for on a weeknight; I make it all the time, and happily.And for a good number of my friends and family members, it’s the only way I can get them to eat quinoa.Priya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, is now out from Houghton Mifflin Harcourt! Follow her on Instagram @PKgourmet.Explore Bon AppétitIndianishQuinoaWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-06", "author": ["Condé Nast", "Priya Krishna"]}