{"id": "0c72c7fd62288f9ae235c449415d70f4", "url": "https://www.bonappetit.com/story/learning-to-love-spaghetti-squash", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "I've Learned to Love Spaghetti Squash | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’ve Learned to Love Spaghetti SquashAnd you can too!By Sarah JampelJanuary 6, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailI feel the same way about spaghetti squash that I do about zucchini, its summer sister: Do I look forward to it? No. Do I crave it? Rarely. And yet, do I find myself, once a season, unpacking it from my tote, wondering what the heck I was thinking while simultaneously holding out hope that with enough salt, fat, and devotion I can turn it into its most delicious self? Absolutely.I’ve at last found a way that I love to eat spaghetti squash—smothered in a concentrated oven-roasted tomato sauce, topped with lotsa mozz, and baked until bubbly. Okay, I haven’t fooled you: It’s essentially baked ziti. And while it might be gimmicky to treat spaghetti squash like pasta simply because, when cooked, its flesh unfurls into noodle-like strands… it actually works. Spaghetti squash, like its namesake, isn’t exactly exciting on its own. It needs embellishment—usually in the form of sauce—to taste great. Here’s how to do it:1. Don’t undercook it.When it comes to preparing the squash, you’ve got options: Bake it whole or halved, steam it in the microwave or InstantPot, or implement a hybrid model (a brief steam will soften it up so that it’s easier to cut in half before roasting). But whatever route you choose, be sure to allow yourself plenty of time to cook it completely—otherwise the strands will retain the watery crunch of, well, raw squash, rendering null any suspension of disbelief (“hey, this could be carbs!”).You’ll know that your squash halves are fully cooked when they’re tender enough to pierce with a cake tester or paring knife and nearly collapse under the pressure of your tongs. Keep in mind that the exact cook time will vary based on the size and water content of your particular squash.I’ll come out and say it: Some spaghetti squash (squashes?!) are better—read: more flavorful and less watery—than others. I cannot prove this scientifically, but I have had better luck with smaller, yellower squash. If you’re at the farmers market, I recommend asking the squash purveyor to pick one out for you—if only so that when it’s not that great, you don’t have yourself to blame. (Kidding!)2. Cut it crosswise.Instead of hacking apart your squash down its length to create two long boats, take a cue from blogger and cookbook author Alexandra Stafford and cut it through its equator to make two narrower halves that stand tall on your baking sheet. While slicing the squash across its belly may seem as counterintuitive as pouring your milk in your bowl before your cereal, it results in longer strands that are ultimately more satisfying to twirl around your fork. (I’d also argue that a shorter cut presents less opportunity to hurt yourself, a non-trivial concern when slicing rotund produce like watermelon and kabocha.)For the noodliest noodles possible, use a fork to tease the squash flesh away from the skin rather than scooping it out with a spoon.3. Add a flavorful sauce.Even the best spaghetti squash is mild (to put it nicely), so take advantage of the time it spends in the oven to make a bold accompaniment. In Spaghetti Squash That Fancies Itself Baked Ziti, it’s a roasted tomato sauce that burbles away in a baking dish while the vegetable cooks—the two are able to join forces in about 40 minutes and with minimal cleanup.But it doesn’t have to be tomato! Try tossing your cooked squash with sage-spiked brown butter, pesto made with any number of greens, mashed garlic confit, or puttanesque olives and capers. Or spread the noodles into a shallow baking dish, douse them in cream infused with chile and rosemary, top with sharp or tangy cheese, and bake it gratin-style.No matter your sauce, don’t be worried if it tastes slightly too salty or punchy on its own—it’s about to season a whole lot of squash. I would steer clear of anything too thick, however—since spaghetti squash is flimsier than actual noodles, it can’t stand up to a sauce that has a tendency to glom.4. Introduce textural variation.Soft squash + lots of sauce = mush. To give your teeth something to do, lean into toppings that will add textural interest: toasted nuts, crunchy bread crumbs, fried shallots or onions, crumbled cheese like feta or queso fresco. Personally, I like to serve the baked ziti squash with lots of crusty bread for sopping up any extra tomato sauce.5. When in doubt, add real pasta.Sounds like a joke, but I’m serious. My favorite way to eat the leftovers of this saucy spaghetti squash casserole is to mix them with hot noodles and shower with more Parmesan. The al dente pasta becomes tangled with the tender, subtly sweet squash and the bright sauce for a delightful array of textures and flavors. If your whole intention is to avoid pasta, the squash would also make a great addition to toothsome cooked grains, like farro or wheatberries. The point is that the squash does not have to stand alone as the bulk of the dish—let another ingredient do some heavy lifting.And perhaps the most important tip of all? Once you find a spaghetti squash recipe you like, save it. There will always be another winter (well, God willing), and there will always be another spaghetti squash, stowing away in your grocery bag and challenging you to make it taste great.Get the recipeSpaghetti Squash That Fancies Itself Baked ZitiSpaghetti squash sheds its reputation for being bland and watery in this baked-ziti-inspired dish, in which it’s smothered in flavorful tomato sauce and blanketed under a layer of melty cheese.View RecipeExplore Bon AppétitSpaghetti SquashRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-06", "author": ["Condé Nast", "Sarah Jampel"]}