{"id": "0c730a2ec9a2a4181fb6bc3c4827a5ba", "url": "https://www.bonappetit.com/story/how-to-slice-meat-thinly", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "How to Slice Meat Thinly for Lightning-Fast Meals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Slice Meat Thinly for Lightning-Fast MealsHere's the lo-fi answer to not owning a deli slicer.By Alex DelanyJune 4, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailReal talk: Cooking steak or pork or lamb doesn’t have to take a long time. You don’t have to slow-roast or grill or pan-sear and baste a big ol’ piece of meat that takes forever to cook. There’s another way, a way to prep your proteins so cooking them doesn't feel like such a thing. Here's what you do: You slice it really, really thinly.Thinly slicing a boneless steak or a pork chop or a chunk of lamb leg is the easiest way to make sure weeknight dinner isn’t some daunting, time-consuming event. Thinner slices mean more surface area which means a quicker cook time, and searing slim slices in a high-heat skillet or on a ripping-hot grill delivers tasty, tender meat in minutes. But if you’ve ever tried to slice a raw piece of meat thinly, you’ll know it isn’t the easiest task.Raw meat is soft and slippery, and not exactly the easiest thing to hold, especially when you’ve got a sharp chef’s knife in the other hand. If a deli slicer was a luxury that we all had access to in our kitchens, this wouldn’t be a problem. But that’s not the case. So we—the people without deli slicers—use a workaround that’s as low-tech as it as effective.Before slicing your meat, throw it on a rimmed baking sheet and place the whole thing in the freezer. Leave the tray uncovered, and remove it from the freezer after 15 minutes. Those 15 minutes are a good time to do any other kind of prep work that your dinner calls for. Chop some vegetables. Wash some greens. Start steaming some rice. Don’t just hang around wasting time! (Also: Set a timer. You're not trying to freeze it solid!)A chilled steak is an easily sliceable steak.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesOnce the steak comes out of the freezer, it will have firmed up and be a lot more manageable. Slicing the steak thinly should be no problem at all. You’ll want to get slices that are no more than ¼” thick. The thinner the better.Once you’ve sliced through all of your steak, go ahead and season it with kosher salt or whatever type of marinade you’re feeling and throw it into an almost-smoking skillet with olive oil. Leave those slices undisturbed for about 3 minutes, until the outside takes on a deep brown color. Then flip them over and cook them for another minute. (You can do the same on a hot grill!)Bam. Done. Four minutes in the pan. Tender, perfectly juicy, manageable pieces of meat ready to be devoured on a Tuesday night. No deli slicer or trips to the ER required.Slice some meat. Make some lettuce wraps. Live your life.Spicy Steak Lettuce WrapsLettuce wraps might be our all-time favorite weeknight summer dinner—minimal cooking, maximum flavor and freshness.View RecipeExplore Bon AppétitMeatBasicallySteaktechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Alex Delany"]}