{"id": "0c7666cee990dba85aa6a0a0588b462b", "url": "https://www.bonappetit.com/story/margaret-atwood-dinner-party", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Margaret Atwood's Dream Dinner Party Features a Crystal Ball and Hammer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMargaret Atwood’s Dream Dinner Party Features a Crystal Ball and HammerThe Handmaid’s Tale author’s invite list includes Graeme Gibson, Charlotte Brontë, and Toni Morrison.By Dawn DavisMarch 19, 2022FacebookTwitterEmailIllustration by Lauren TamakiFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.She’s broadly known for her critically acclaimed novels (17 of them!), including The Handmaid’s Tale and Alias Grace, but Margaret Atwood is also a poet, essayist, cartoonist, environmental activist, and inventor (of the LongPen, a robotic arm that paved the way for remote document signing). Here she tells whom she’d invite to her dream dinner party and why.You get to host any three people, fictional or real, dead or alive. Who’s invited?I’ll stick to dead people. If I fail to invite some living people, they’d be very annoyed. (Not to say other dead people wouldn’t be. I’d expect to hear from Samuel Johnson and Oscar Wilde, who prided themselves on their dinner conversation.) But here’s my invite list: Graeme Gibson, my partner for many years; he loved a dinner party. He always cooked the main course and I did the starters, salad, and dessert. Charlotte Brontë and Toni Morrison would be my other guests. Both of them wrote novels with uncanny, weird stuff in them. Jane Eyre hears a spirit voice calling her over time and space and she answers it. I reviewed Beloved in the New York Times and have always been interested in Morrison’s technically varied way of approaching subjects. So pairing her with Brontë, who gave us the first open-ended novel, would be fascinating, especially since one of them is from the 19th century and the other is from the 20th.What’s on the menu?We’d begin with a salad that involves oranges, avocados, and endive. Then Graeme would make this chicken dish that involves putting a lot of legs and thighs, a huge amount of garlic, an onion, a bouquet garni, and some cloves into a big Le Creuset. You make a dough out of flour, water, salt, and oil, roll it out like a sausage, and wrap it around the pot’s rim. As it bakes, it forms a seal and the chicken steams in all that garlic.Do you bring it to the table in a dramatic fashion?The dough gets quite hard. It’s a ceremonial moment when you crack it with a hammer. We’d serve it with potatoes and green beans. For dessert I’d make the fluffy baked lemon custard from The Joy of Cooking. I’d set out white china with red trim (which belonged to Graeme’s grandfather), candles, and either some florals or a crystal ball—which, yes, I have in my possession.The conversation centers around one essay in your new book, Burning Questions—which is it?These days it would probably be one of the environmental essays. Maybe the one on Rachel Carson and how prescient she is. When it comes to talking about the environment, I’m interested in solutions. If you want some hope, go to drawdown.org, which has a lot of data and ideas about how to draw down greenhouse gases from the atmosphere.Who’s the better dining companion, a scientist or a poet?I know quite a lot about poets, so for a learning experience, I’d pick scientists—but it depends what kind. Not physicists. They can’t really explain to other people what they’re doing. I could hang out with ornithologists. They’re somewhat generalists because they have to know something about habitat, bird biology, migration patterns. And they need to go off the beaten track to find birds, so they’re often quite adventurousExplore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-19", "author": ["Condé Nast", "Dawn Davis"]}