{"id": "0c7dc8fa839c70c468156915c6f473ac", "url": "https://www.bonappetit.com/story/how-to-stop-eating-sugar", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "How to Stop Eating Sugar? Don't Even Try | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI’m a Dietitian and I’m Here to Tell You You’re Not Going to Stop Eating SugarYou need to limit added sugar for the sake of your health, but if you're trying to cut it completely, it's time to relax.By Dana NahaiDecember 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailLet’s start by admitting you like sugar. Perhaps you’re hardcore and into Skittles, Lemon Drops, and Pixy Stix. Or you’re a lesser devotee who just won't let a doughnut pass you by. Or maybe you’re the delusional type who says, “I completely gave up sugar; I only use honey now.”It’s okay; you’re not alone. One thing I’ve learned from my twenty years as a dietitian is that everyone needs a dietary villain, an ingredient to rail against, a way to rationalize other questionable food choices by saying, “At least it’s not that other bad thing.” And, these days, sugar is that villain. But let me be clear: You’re not going to stop eating sugar entirely, nor should you. And the sweet stuff is totally okay in moderate quantities.First let me clarify that sugar is no health food, and not just because it leads to weight gain. Chronically refueling a sweet tooth keeps your blood sugars high, highjacking how cells process food energy and, as some studies have shown, increasing the risk of getting cancer.But, thanks to misinformation in every direction of the internet, many people’s fears about sugar are overblown and misdirected. By definition, sugar is a general term for the variety of carbohydrate compounds that make up your body’s preferred source of fuel. This family of sweet carbohydrates includes the naturally occurring sugars in plant and dairy foods and the processed sugar additives used as sweeteners. If a food tastes sweet, then sugar is involved, whether it’s considered “healthy” or not.But sugars from plant and animal foods are organically interwoven with fiber and fat. This structure essentially creates a dietary speed bump, slowing digestion and the rate at which dietary sugar gets converted into blood sugar.The type of sugar to worry about comes in the form of the sweeteners you add to food. Sucrose and fructose are the king concerns, the most common variants being white and brown sugar, maple and corn syrup, and honey. Without that interwoven structure of naturally occurring sugars, your body rapidly converts these added sweeteners into cellular fuel, causing unhealthy spikes to blood sugar and laying the groundwork for sugar cravings.When it comes to sugar, the poison is really in the dose: The more sugar you eat, the more you need. If you choose the doughnut every time, your blood sugars will get used to running high, turning your cravings ironclad. But there is a danger to picking on ingredients, especially ones you enjoy. Few people have enough unrelenting restraint to exile entire categories of food, and a lapse in discipline often leads to guilt and failure. A brownie once a week will not send you into a metabolic tailspin, but it’s important to keep a check on how much added sugar you are actually eating.Breakfast foods like sweetened yogurt, granola, oatmeal and acai bowls can deliver a sugar load equal to a cookie or more. Salad dressings, whole-grain crackers, and even gluten-free bread can have a surprising amount of added sugar, as can nut butters, pre-made sauces, and marinades.So what’s a realistic quantity of added sugar to eat? It all depends on you. If you’re serious about dessert, you’re likely eating more sugar than someone who prefers the cheese course. Instead of forcing yourself to skip the after-dinner treat, get intentional about removing added sugar when you don’t need it, and, if it has to be there, work to reduce the volume. Your morning cup of coffee or tea is often a good place to start.Intense sugar addicts, you benefit from a firm line in the sand: For every hefty dose of added sugar imbibed, you need to take the next three meals off. Using this 1:3 formula gives my clients license to enjoy sweet favorites while still achieving their wellness goals. Is this a “perfect” way to eat? No, but neither are we. It’s far better to compromise when it comes to sugar than hide from the truth. And the truth is: Our bodies loves sugar, whether we like it or not.Explore Bon AppétitHealthyishSugarRead MorecookingWhat Is Coconut Sugar, the Alt-Sweetener Taking Over Baking?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Dana Nahai"]}