{"id": "0c87eed105e2c9c6da6eb8c94197bbf5", "url": "https://www.bonappetit.com/story/oofos-kitchen-slides", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "I Found the Best Kitchen Slippers to Ease My Aching Feet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Found the Best Kitchen Slippers to Ease My Aching FeetIf you spend as much time standing as I do, you need these plush (machine washable!) sandals.By Stephanie LooOctober 28, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.A few months ago, while in culinary school, I quit a day job where I spent nearly all my working hours staring at a screen through countless Zoom calls, endless Outlook emails, and frustrating standoffs with inscrutable Excel sheets. For this kind of work, I had all the support I needed: a fancy desk, new laptop, and double monitor. But after I quit I suddenly went from hours of sitting to hours of standing on my feet in my small apartment kitchen: baking for pop-ups, testing recipes for a cookbook, making custom cakes for people who would DM me on Instagram, and, inevitably, constantly cleaning up after myself.The internet is home to plenty of debate about the “best” shoes for restaurant industry professionals. Danskos, Birkenstocks, or Blundstones—everyone has a preference. But consider the home cook. The daily grind of standing to prepare meals, lifting heavy pots or sacks of flour, and tackling multiple full dish loads really takes a similar toll on your body. At the end of the day I would flop down on the couch with throbbing feet and aching joints, yearning for a solution.That’s where my OOFOS OOahh Slide Sandals came in. I first heard about these foam slippers on a podcast and ordered a set immediately. They have a slight rocking motion that helps improve balance and posture, enabling more stable footing while standing, and they’re available in basic colors as well as patterns like blue snakeskin and Y2K daisy. According to the brand’s website, they absorb 37% more impact than traditional footwear, which, after a full day on your feet, really adds up. Multiple commenters on Instagram and their website refer to these OOFOS slides as “recovery sandals” because they help prevent wear and tear injuries and relieve foot pain. I can attest: I’ve found them to be the perfect balance of soft, stable, and supportive—a combo deal that cushions my feet and takes the pressure off my knees and joints.OOFOS Slides$54 at Amazon$60 at Nordstrom$60 at OofosAesthetically, they definitely give off slight grandma vibes—in a kind of cute way? I probably wouldn’t wear them out on a date, but they’re just fine for running errands and dropping off my cake orders. Best of all, the patented footbed and proprietary foam is machine washable(!). Once a week I chuck them in with my regular laundry without having to worry about removing any insoles or scrubbing at them with a damp cloth.OOFOS does give you the option to send your sandals back within a month if you’re not totally satisfied with them. But trust me, you won’t want to take them off once you get a pair. I’ve been shuffling around the kitchen in mine for 10 months and they’ve totally changed my cooking game. I can stand comfortably for way longer, and now I channel all of that former sore feet angst into whisking eggs and frosting cakes. Plus, they feel like a little hug for my feet, which is just what we all need right now.Get the socks:Turnip The Beet Veggie Socks$10 at AmazonExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-28", "author": ["Condé Nast", "Stephanie Loo"]}