{"id": "0c897f64c262d1e1c33edb7b1527c414", "url": "https://www.bonappetit.com/recipe/quick-pickled-onions", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Quick Pickled Red Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2012 IssueQuick Pickled OnionsBy Oliver StrandMarch 8, 20213.7(1055)Read ReviewsTriangleEmailPinterestPrintPhoto By Christopher Testani EmailPinterestPrintEmailPinterestPrintThe strategy for these pickled red onions is (as one astute reviewer noted) pretty much just “mix everything together and wait.” One more boon for the recipe? It’s entirely made up of pantry staples. The pickling liquid is just a mix of water, salt, sugar, and vinegar—we’ve opted for apple cider, but white wine vinegar, red wine vinegar, sherry vinegar, or rice wine vinegar would all be fine. After letting your quick-pickled red onions sit for at least an hour to soften and marinate, drain them, and then put them to good use brightening up a juicy pile of ribs, sub them into your favorite breakfast sandwich, or scatter them atop a lunchtime grain bowl. They might be simple to make, but these pickled red onions have layers.Editor’s note: This recipe was originally published on May 15, 2012.IngredientsMakes about ½ cup Servings½cups apple cider vinegar1tablespoon sugar1½teaspoons kosher salt1red onion, thinly slicedPreparationWhisk first 3 ingredients and 1 cup water in a small bowl until sugar and salt dissolve. Place onion in a jar; pour vinegar mixture over. Let sit at room temperature for 1 hour. DO AHEAD: Can be made 2 weeks ahead. Cover and chill. Drain onions before using.Nutrition Per Serving7 Servings 1 serving contains:  Calories (kcal) 10  Fat (g) 0  Saturated Fat (g) 0  Cholesterol (mg)  0  Carbohydrates (g) 3  Dietary Fiber (g) 0  Total Sugars (g) 2  Protein (g) 0  Sodium (mg) 280 How would you rate Quick Pickled Onions?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleDefinitely missing the water part! 1/2 cup of apple cider barely covers a whole onion. I'm not sure why they don't update the recipe, it's been like this for years.C-eatsLouisville, KY1/18/2022Quick & easy. Had only a half red onion so I also sliced a half yellow onion. The combo worked fine; colorful and tasty. Charles Pascual Palm Harbor, FL1/14/2022Quick, perfect, and versatile. We use as a topping that absolutely makes the dish for everything from street tacos to a mixed greens salad w/ strawberries & balsamic vinaigrette.AnonymousColorado12/29/2021Awesome recipe, if water not listed as an ingredient is confusing to you, please let someone else do the cooking lol. JPTEXAS12/26/2021The recipe doesn't say water as ingredient but recipe says add water . Confused Deedeej45Louisiana12/2/2021So good! Set timer for one hour and they were perfect! Made exactly as instructed (including water) One question, do I store IN the liquid, or remove and store separate from the “pickling” liquid?? I want them to last so we can enjoy them!!Ellen McKeeFalmouth, Maine11/30/2021One cup of water is an ingredient.Anonymous11/25/2021Just right for a quick topping.  And as long as you read through the ONE step, you know to add all the ingredients to one cup of water. Lasts about a week in the fridge. Have made it as is, and with subbing about 1/4 of the kosher salt with brining salt (I.e. Prague pink salt) just to see if the flavors change - both goodJen10/30/2021I made this with 4 lb. of skinless boneless breast chicken. I cooked on low for 3.5 hours and followed the recipe except reduced the salt to one tablespoon. It turned out great! The best slow cooking chicken recipe I’ve ever tried. It takes a little longer to put together than other slow cooker recipes due to all the juicing that has to occur, but it is well worth it. You end up wit moist, flavorful chicken; it’s perfect for feeding a crowd, tacos, burritos, salads, etc. AnonymousSan Diego9/18/2021I usually have some of these in the fridge. Often, when I have extra onion after a recipe, I'll just throw it into the brine to avoid waste. A. Nonymous9/5/2021Ok people, it says in the instructions add ingredients to one cup of water. \nThat being said, it’s delicious and basic. One could certainly add to it!JtChicago 9/5/2021WHY WOULD YOU OMIT THE WATER FROM THE INGREDIENTS LIST???Tucker8/3/2021Hey there - put your reading glasses on .. STEP 1 states 1 cup WATER..\nRecipe easy and delicious..Reading RuthieGloucester, MA. 7/22/2021Easy peasy and fabulous!! Great on sandwiches, salads, charcuterie board most anything. My boyfriend even cleans the kitchen when he knows I’m making pickled onions!! MonicaWestPasadena, CA7/17/2021Wait! Recipe is incomplete. \nHow much water do you use???ClaireMusic City, USA7/12/2021Explore Bon AppétitCondimentPickleRed OnionOnionVegetableEasyQuickDairy-FreeGluten-FreeVeganVegetarianNut-FreePickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2012-05-15", "author": ["Condé Nast", "Oliver Strand"]}