{"id": "0c9ba981e2b9b4d7132eebc25805238b", "url": "https://www.bonappetit.com/story/julie-mehretu-keep-rising", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "How Artist Julia Mehretu's Art Inspires Marcus Samuelsso | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020Keep RisingGuest editor Marcus Samuelsson looks back on 2020, and to a brighter future ahead.By Marcus SamuelssonDecember 1, 2020FacebookTwitterEmailJulie Mehretu, ‘Hineni II (E. 3:4),’ 2019-2020, ink and acrylic on canvas, 96 x 120\". Photograph by Tom Powel Imaging. Courtesy of the artist and Marian Goodman Gallery, New York. © Julie Mehretu.FacebookTwitterEmailI wanted to end this year’s Holiday Issue with gratitude for those who make it possible, and with art for our soul and mind. So I chose this amazing piece by Julie Mehretu, an incredible artist and a friend of mine. It was inspired by the California wildfires, and it reminds me of fireworks, boiling pots, emotions running high. I see so much of the year in this painting, including its bright spots: my block becoming a community center with parents pitching in to give our kids a sense of normalcy, line cooks and servers passing out food to protesters, the strength of the Black Lives Matter movement. And I see a brighter, better future. I know now more than ever: We must keep rising. Happy Holidays. Explore Bon AppétitHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}