{"id": "0c9f2fa5d360f7a51434b3326469024e", "url": "https://www.bonappetit.com/recipe/khao-niao", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Khao Niao Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueKhao NiaoBy Leela PunyaratabandhuJuly 6, 20215.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintDelightfully soft yet chewy, warm sticky rice—a staple of northern Thailand and Laos—is a must-have accompaniment to cookbook author Leela Punyaratabandhu’s Grilled Pork Shoulder Steaks With Green Pepper Relish. For the best results, try to seek out rice that’s been imported from Thailand, as there are many varieties of East Asian short-grain rice that are often labeled “sticky rice” but will not cook to the right consistency in this preparation. Traditionally, khao niao is soaked and drained then steamed in a cone-shaped bamboo basket set atop a metal pot of boiling water, but the saucepan and a heatproof fine-mesh sieve with pan hooks combo here works exceptionally well. When ready to serve, keep the rice in a lidded communal container (even at the table) to prevent it from drying out, and always serve it warm. The best utensil for sticky rice is your hand! Pull off a bite’s worth of rice and knead it lightly with the tips of your fingers before eating, the way it’s done in Thailand and Laos. Do your best to let the rice get soaked in saucy or brothy food, as the moisture will break apart the stickiness that holds the grains together.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan with Lid$39 At AmazonFine Mesh Strainer With Arms$17 At AmazonGet It Right Spatula$13 At BA MarketLarge Bowl$18 At AmazonIngredients4 - 6 Servings2cups Thai glutinous riceSpecial equipmentA heatproof fine-mesh sieve with pan hooksPreparationStep 1Place rice in a large bowl. Fill with cool water and swish rice around a few times with your hand to release starch. When water becomes cloudy, drain rice in sieve; repeat process several times until water runs clear. Pour in water to cover rice by 3\" and let soak at room temperature at least 6 hours and up to 12 hours.Step 2Fill a large saucepan with water to come 2\" up sides and bring to a boil. Drain rice in sieve, then gently make a well in rice (be careful because grains will be brittle and you want to keep them intact). Set sieve over boiling water, cover (lid will not fit tightly, and that’s okay), and steam 15 minutes. (Add more water to pot if needed and return to a boil.)Step 3Uncover and turn rice over in large pieces with a heatproof rubber spatula. Cover and continue to cook until rice is translucent and soft but not mushy, about 15 minutes more. Transfer rice to a bowl to serve. (If rice starts to harden at the table, sprinkle with water, cover with plastic wrap, and microwave on high 1 minute.)How would you rate Khao Niao?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMy family loves Sticky Rice but I only have tank water and cannot be as extravagant with it as this recipe requires. Is there an alternative method to prepare the rice?Maggie MTasmania, Australia.8/8/2021Explore Bon AppétitLaotianSoutheast AsianAsianThaiRiceRice & GrainsEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}