{"id": "0c9fe9e175b5202d9ac0c412e1f858d0", "url": "https://www.bonappetit.com/recipe/meal-prep-roasted-vegetables", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Roasted Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMeal-Prep Roasted VegetablesBy Chris MoroccoDecember 26, 20184.3(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintRoasted vegetables are the perfect, hands-off way to prep healthyish lunches for the week. Use asparagus, brussels sprouts, onions—whatever vegetables you're craving. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients8 servings1bunch carrots, cut into thick rounds1head of cauliflower or broccoli, separated into florets3Tbsp. extra-virgin olive oilKosher salt4–6sweet potatoes, scrubbedPreparationPlace racks in upper and lower thirds of oven; preheat to 425°. Toss carrots, cauliflower, and oil on a large rimmed baking sheet. Season with salt and toss again. Place sweet potatoes on a small foil-lined rimmed baking sheet. Roast veggies, tossing once, until browned and tender, 25–30 minutes for carrots and cauliflower and 35–40 minutes for potatoes.How would you rate Meal-Prep Roasted Vegetables?Leave a ReviewTell us what you thinkReviews (2)Back to TopTrianglePerfect! Just what I needed to know.AnonymousFlorida12/28/2019Which vegetables go on the upper rack; which on the lower rack?AnonymousMontreal, Canada1/4/2019Explore Bon AppétitCarrotVegetableCauliflowerBroccoliSweet PotatoPotatoEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}