{"id": "0ca2ae646a5d55063ffe5d7664c7ca6f", "url": "https://www.bonappetit.com/story/my-life-in-rice", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "From My Grandmother’s Kitchen to NYC’s Best Restaurants, My Life in Rice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFrom My Grandmother’s Kitchen to NYC’s Best Restaurants, My Life in RiceRice can be so many things to so many people. For me, it’s a constant reminder of where I came from.By Miguel de LeonMarch 17, 2021FacebookTwitterEmailIllustration by Sophi Miyoko GullbrantsFacebookTwitterEmailYou have to commit to a bag of rice. And I’m not talking about the small microwaveable single-serving disasters in a pouch—I mean the big 50-pounders that are always near the registers at grocery stores like Seafood City or 99 Ranch, the ones that you have to put in a rice dispenser, a de rigueur piece of furniture in Asian households.Growing up in the Philippines, we ate rice with every meal. Every day we had to decide what to eat with it. Heady aromas of the grains cooking in the pot suffused the kitchen whenever my grandmother cooked, supported wonderfully by whatever she found in the wet market that morning, whether it was dílis, small anchovies she would fry with chile and sugar, or ampalayá, bitter melon sautéed with pork and fish sauce. Some days just a bowl of rice was sufficient.When I was about eight years old, my grandmother taught me how to cook rice on the stove, fearing for my future independence and self-sufficiency: “God forbid the rice cooker blow up!” She took me to the bright green plastic barrel where we kept the grains. I could barely see over it; I ran my hand through the rice. She encouraged me to feel how cool the rice was on my fingers, how my hands were covered in a powdery silt that smelled musty and sweet. “This,” I remember her saying, “is all you need.”She had shown me how to clean the dry rice, removing leftover husks and small pebbles, and how to clean the rice when wet, rinsing it again and again until the water runs clear and it feels like big grains of sand that just barely hold together. She drained the pot, set it on top of the stove, and gifted me the magic cooking method: pour water over the rice until it’s a knuckle’s length above the grains (no matter the amount of rice below) and couple that with patience.As bigás transformed into kánin, and as my excitement for the crusty tutóng mounted, something clicked and I felt connected to my bloodline.Tagalog has about as many words for rice as there are stars in the galaxy. As bigás transformed into kánin, and as my excitement for the crusty tutóng mounted, something clicked and I felt connected to my bloodline. I grew up in my grandmother’s eyes. With a simple vessel, she taught me how to turn humble rice into a porridge called lúgaw, how to fry it with garlic for sinangág, and, most important, how to cherish something deceptively mundane as a source of such comfort. She had nothing to worry about.I moved to the United States without papers when I was 10, accent heavy and loaded with culture shock. From metro Manila to the insidious wholesomeness that was suburban Orange County, California, I maneuvered my newly found American-ness through my Jesuit upbringing, apologizing at almost every turn for how Filipino I was presenting. My palate shifted and grew as I ate increasing amounts of Very American Food, things that I grew up seeing in movies and magazines: peanut butter and jelly sandwiches, chocolate milk, square pizzas, ranch dressing.Illustration by Sophi Miyoko GullbrantsAlmost every immigrant kid has the shameful food experience of unpacking lunch that at home is treasured culturally but to other kids smells weird or looks bad. To avoid that shame I would buy Lunchables, cheeseburgers, and french fries at school, careful to navigate my adolescence by keeping my Filipino food and rice at home. Despite my efforts at assimilation, I didn’t feel fully American because I still ate Very Filipino Dinners, where rice was always present. Though rice became a reminder of a place that I would never again call home, I also never felt more like myself eating it. A warm bowl tastes like how a hug feels, the nostalgic fragrance placing me in my grandmother’s kitchen, thousands of miles and too many years away.My mother and I would study American history together, she for her citizenship test and myself for my civics classes, our sessions fortified by Filipino food as the orange light of the rice cooker glowed in the background. After my mother earned her citizenship, I also became naturalized but still felt uncomfortable at the prospect of having to describe my future self as an American.Eventually, I applied to colleges. I was worried about having to introduce myself over and over again to people, and about disappointing my grandmother by only eating the unlimited breakfast cereal offered at the dining commons and gaining the full Freshman 15 in a month. Fueled by these fears of pending collegiate life, I asked my mother to teach me how to cook. I learned there were no precise details, nothing recorded down to the ounce. She never lingered over measurements such as quarter-cups and eighth-teaspoons. Like my grandmother before her, she had her own lessons to impart about rice, encouraging me to listen for when the rapid bubbling subsided before I opened the lid of the pot. Not a spot of ink was spent on the minutiae of cooking—just use your senses to make sure that your cooking doesn’t become waste, or worse, something that is work to eat. Trust, it turns out, lives in your gut.Whether jasmine, basmati, or myriad other grains, rice at every restaurant I’ve worked doesn’t just look different. It tastes different, feels different.Throughout college, I lived off of rice—it was cheap and easy to dress up, and I could make a ton of it—until I miraculously got a job as a reservationist at a small restaurant in Berkeley called Chez Panisse. Cooks from different cultures lovingly made the family meal using leftover rice from the previous service, so coupled with my ever growing curiosity and appetite, I explored the grain’s textures, the myriad ways to cook it, the memories it evokes. The ethereal texture of the dreamiest risottos, the cozy feeling of enjoying rice in broth when there’s a chill outside, the earthy flavor coating each grain when stuffed into juicy squab, my sense of nostalgia when as pudding, rice is bathed in cream and sugar.My career led me even further afield. At Momofuku, there was a dish that tipped its hat to halal cart chicken and rice. At Casa Mono, we offered a take on paella as croquetas. These days at Manhattan’s Pinch, where I am the wine director, I see countless bowls of rice fried Shanghainese-style, glossy from a touch of oil, hiding succulent bites of octopus and scallop. Whether jasmine, basmati, or myriad other grains, rice at every restaurant I’ve worked doesn’t just look different. It tastes different, feels different. I take solace in celebrating these differences.Rice nourishes me in as many ways as there are grains in a bowl. It connects me to my island ties, and understanding how to make it, how to enjoy the simplest versions, honors the memory of my grandmother and her lessons in independence. I’ve only recently become comfortable calling myself an American despite living here for more than 25 years, and even more recently become comfortable in my Filipino-ness, though it’s always been a part of me. I’ve worried so much about my own assimilation that sometimes I’ve forgotten why I worried in the first place. I still rinse my rice the same way, still measure the water with my knuckle just like my grandmother instructed. I still listen to the pot like my mom taught me. I still revel in the comfort of the first bite from a warm bowl. And I still commit to the big bag of rice.Miguel de Leon is a wine professional in New York City and editor in chief of ‘Disgorgeous,’ a zine and podcast about wine.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-17", "author": ["Condé Nast", "Miguel De Leon"]}