{"id": "0cb3989257abddcde42048603e4ffa71", "url": "https://www.bonappetit.com/recipe/mala-fried-peanuts", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Mala Fried Peanuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueMala Fried PeanutsBy Lisa Cheng SmithNovember 19, 20194.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintIt’s very hard to stop eating these mouth-numbing, sweet, salty, and crunchy peanuts. They’re an ideal drinking snack, or chop them up and use as a garnish on salads or noodles. Shelled raw peanuts are easy to find at Asian markets, health food stores, and other specialty food stores. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8–10 servingsFive-Spice Powder2½4\"-long cassia or cinnamon sticks20whole star anise1Tbsp. plus 1 tsp. whole cloves20slices dried sand ginger (optional)2Tbsp. plus 1½ tsp. Sichuan peppercorns2½tsp. sliced dried licorice root or fennel seeds1tsp. black peppercorns1tsp. white peppercorns (optional)Peanuts and Assembly2cups raw peanuts, preferably blanched¼–½cup peanut oil18dried Sichuan chiles or other red Chinese chiles, 8 with seeds removed, cut into strips, 10 left whole1tsp. Sichuan peppercorns1½tsp. kosher salt1tsp. sugar1tsp. ground Sichuan peppercorns (from 1½ tsp. whole)Pinch of freshly ground white pepper (optional)Special EquipmentA spice mill or coffee grinderPreparationFive-Spice PowderStep 1Toast cassia, star anise, cloves, sand ginger (if using), Sichuan peppercorns, licorice root, black peppercorns, and white peppercorns (if using) in a small skillet over medium, tossing once, until fragrant, about 3 minutes. Let cool; grind to a powder in spice mill or coffee grinder.Step 2Do Ahead: Five-Spice Powder can be made 1 month ahead. Store airtight at room temperature.Peanuts and AssemblyStep 3If using unblanched (skin-on) peanuts, place in a medium bowl and pour in water to cover. Let soak at least 6 hours and up to 12 hours. Drain peanuts, then rub off skins with paper towels if needed.Step 4Arrange peanuts on a rimmed baking sheet and freeze at least 2 hours and up to 12 hours (this will dehydrate the nuts so that they crisp faster when fried). If using blanched peanuts, skip the soaking and freeze directly.Step 5Place frozen peanuts in a wok or medium pot and pour in oil to cover by ¼\". Bring to a simmer over medium heat and cook until peanuts are golden brown and float to the surface, 15–20 minutes. Using a spider or slotted spoon, transfer to paper towels to drain. Let oil cool. Transfer all but 1 tsp. oil to an airtight container; save for another use.Step 6Add sliced chiles, whole chiles, and whole Sichuan peppercorns to skillet with oil and heat over medium-high, stirring constantly, until fragrant, about 2 minutes (don’t let the chiles brown—you want them to stay red). Mix in peanuts, salt, sugar, ground Sichuan peppercorns, white pepper (if using), and 1 tsp. Five-Spice Powder. Transfer to a small bowl; let cool.Step 7Do Ahead: Peanuts can be made 3 days ahead. Store airtight at room temperature.How would you rate Mala Fried Peanuts?Leave a ReviewTell us what you thinkExplore Bon AppétitSichuanChineseEast AsianAsianPeanutNutSichuan PeppercornHerbs & SpicesChileVegetableSnackDairy-FreeGluten-FreeVeganVegetarianLunar New YearSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}