{"id": "0cd5ebcd62f7e7937de6b894f0c60be2", "url": "https://www.bonappetit.com/story/plaza-fiesta", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "I Went Looking for My Mexican Identity and Found It at Atlanta’s Plaza Fiesta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureI Went Looking for My Mexican Identity and Found It at Atlanta’s Plaza FiestaGrowing up in the South, I struggled to locate my Mexican roots. Then, Mexico came to me.By Jennifer ZymanFebruary 13, 2020FacebookTwitterEmailPhoto by David CrawfordFacebookTwitterEmailNo one is in a rush on Sunday afternoons at Plaza Fiesta. But that’s not to suggest that things at this sprawling indoor mall move slowly. As I stand in line at Las Recetas y Antojitos de la Abuela waiting to order my usual—a box of 10 suadero tacos so small they fit in the palm of my hand—I’m grateful for all the bustle around me. Kids running on the playground while their parents hold their caramel-filled churros. A family of five laughing loudly as they make a mess of a tlayuda, a Oaxacan pizza-tostada hybrid topped with chorizo, avocado, pickled jalapeños, and strings of chewy cheese. Grandmothers exchanging secrets as they watch the mariachi band playing its weekly show. A beaming teen twirling for her parents in the crinoline mille-feuille of her garnet quinceañera dress.Atlanta was very different when I was her age.When my parents, both of whom were born and raised in Mexico City, moved our family to Georgia’s capital in 1979 from Connecticut, (and before that, Rio de Janeiro, where I was born) finding anything Mexican was an arduous task. Tortillas and canned chipotles were not the norm at our local A&P. Taquerias were few and far between. The butcher never carried the marinated pork we needed to make our Sunday night al pastor tacos. We depended on trips back to Mexico or my grandmothers’ visits for a taste of home. They’d arrive with worn suitcases overstuffed with chicharrones, chiles to make mole poblano to eat with our Thanksgiving turkey, and the bloodred chile piquin and limes my dad would smuggle into the movie theater to sprinkle over popcorn.Clockwise from left middle: A jarrito loco cocktail, a plate of devoured rosca de tacos from Las Recetas y Anotjitos de La Abuela, a piña loca from La Espiga Dorada, and a bag of Dorilocos.\nPhoto by David CrawfordAt the time, the Mexican community in and around Atlanta was small and fragmented. We had no center and nowhere to find the comforts of home. It was hard for my parents, who missed what they knew and loved as they made a life in America. But for me—a Jewish Brazil-born kid who’d never actually lived in Mexico—it made finding my identity even more complicated.Among Mexicans, I spoke Spanglish, albeit with an excellent accent that confused them. With my frizzy brown hair and freckled translucent skin, I looked more like Punky Brewster than my own sister, the Latin stunner with an olive hue and a mane like a black stallion. She soaked up all of my mother’s Latin blood, while I was a carbon copy of my Ashkenazi father, whose parents immigrated to Mexico from Poland well before he was born. Ballet practice was just as ostracizing; my mom used to joke that she could always find us because we were the only dark-haired kids in a sea of blonde Southern girls. Blending in was not an option for my painfully insecure self. And my childish need to fit in made me feel even more like an outsider: A person from everywhere, but who belonged nowhere.Food became my way into my culture. And, aside from family, food was the most important thing to my parents. During our visits to Mexico City, we’d sneak out early from weddings and bar mitzvahs so my dad could whip us around town in a suffocating rental car with stops for tacos, gorditas, and churros. It was an exciting tutorial on our Mexican-ness, and the power of discovery stoked something inside of me. Food was something that could give you credibility. If I could know Mexican food, maybe that would make me Mexican enough. And if I were Mexican enough, perhaps I’d belong somewhere.One of Plaza Fiesta’s many entrances.\nPhoto by David CrawfordAfter years of longing for Mexico, Mexico came to me. Work at nearby chicken processing plants and construction sites for the 1996 Olympics caused a surge in Atlanta’s Mexican population. My mother tongue popped up everywhere, in written signs and overheard conversations. Carnicerias, mercados, and taquerias too started opening as a happy consequence of the growth. Soon, we only had to go as far as Buford Highway 20 minutes northeast to get everything we needed. That nearly 30-mile-long stretch of road eventually became home to 1,000 immigrant-owned businesses and more than 100 international restaurants representing Bangladesh, Cambodia, China, Colombia, Ethiopia, Korea, Malaysia, Mexico, and Vietnam. I learned the proper way to eat pho, the joy of Hainanese chicken rice, the superiority of charcoal-fired Korean barbecue. Everything was there, and eventually, Plaza Fiesta would be too.The Buford-Clairmont mall reopened as the Latin-focused emporium in 2000. Today it has around 280 retail and specialty stores, 30 food businesses, dentists, insurance companies, cell phone shops, hair salons, barbers, and a bus company that will drive you all the way to Mexico. There’s a whiteboard filled with facts and terms to become a U.S. citizen. Insurance companies where you can weigh your options. Hair salons to get your roots done. Northern-style lamb, goat, and beef barbacoa at La Generala. La Guelaguetza’s cemita, a Puebla-style fried beef cutlet torta on a sesame-seed-studded roll. Quekas (slang for quesadillas) from Mexico City.Photo by David CrawfordPaletas in all the flavors from La Niña Michoacana Pop.\nPhoto by David CrawfordI remember watching as the transformation took place. As discount clothing gave way to World Cup jerseys. As Mexican shaved ice took the place of corporate fro-yo. Even as the new grand entrance, with its park benches emblazoned with Mexican state emblems and the blue-and-yellow tiled fountain, started to resemble the downtowns we used to visit with my parents to renew their visas.I was finishing university and curious about my heritage in that annoying-college-student way. Plaza Fiesta was where I went to cross-reference the lessons my food-obsessed parents taught me. And it was where I went to expand on their syllabus too. I bought a tortilla press and learned how to make tortillas. I tried as many different regional dishes as I could find. I visited stall after stall to ask about religious figurines and specialty Aztec garb I’d never seen before. No one questioned my presence as I wandered the halls filled with the food I grew up eating, the language my parents spoke, the dishware my grandmothers used. The community had created a home for itself, and inside of it, I found a home for me.Just one corner of Plaza Fiesta’s food court.\nPhoto by David CrawfordThe mix of vendors at Plaza Fiesta is always reflective of the migration to the city, and whatever is trending on the other side of the continent, some two thousand miles away. Things like Dorilocos, a beautifully bastardized dish of nacho cheese Doritos, carrots, celery, cucumber, jicama, pickled pork rinds, Valentina hot sauce, chamoy (a sweet-sour sauce made from pickled fruit), fresh lime, crema Mexicana, and gummy candies. Things straight from Mexico that I tasted for the first time in Atlanta. Turnover is rare and there are no true vacancies when it does happen. Word gets around the Plaza quickly when someone is about to shutter—another concept waiting for the opportunity to meet the demands of such a vibrant local community.Mexican sweet treats and candies.\nPhoto by David CrawfordMy mother used to comfort my tween cries that I didn’t fit in by telling me I already belonged because I was a citizen of the world. It’s a lesson I’ve passed along to my eight-year-old daughter, because in addition to understanding our complicated migration story and her own Mexican-ness, it’s a notion that will serve her well.I take her on the same food tours my parents did when we go to visit family, along with some updates that I’ve learned about since dedicating my professional life to food. But when we return, our bags are light because there’s plenty to continue her education in Atlanta. Plaza Fiesta is her classroom, and I suspect she’ll be more connected to her roots than I was at her age. After all, she’s already told me, her favorite lime paleta in hand, “Mommy, this feels like home.”Jennifer Zyman is a food writer and restaurant critic living in Atlanta.Want More Stories From Taco Nation? Right This Way...In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.And so much more!!Explore Bon AppétitTaco NationAtlantaMexicanFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Jennifer Zyman"]}