{"id": "0cd767569fa9239f28bff964e4506427", "url": "https://www.bonappetit.com/recipe/potato-tomato-gratin-with-horseradish", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Potato-Tomato Gratin With Horseradish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPotato-Tomato Gratin With HorseradishBy Christian ReynosoNovember 11, 20214.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintTraditional cream-based potato gratins might be scandalized to know that this lighter olive-oil--based version dares to call itself a gratin as well. While it might not have the over-the-top indulgence of the original, this approach is still plenty rich and delicious. Tomatoes add intensity and jammy sweetness, brightened by the pungency of that winter underdog, fresh horseradish. The generous snow-like dusting of tangy grated horseradish on top adds a sinus-clearing peppery zing to the dish. The knobby cream-colored root looks similar to a parsnip, and you can find it in the refrigerated section of well-stocked supermarkets—though grated Parmesan would make a fine substitute. Serve the gratin as a side to a rich holiday meat like prime rib or simply on its own as a vegetarian main. —Christian ReynosoAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonLarge Skillet$84 At Amazon2-Quart Baking Dish$8.65 At AmazonCast Iron Skillet$30 At AmazonIngredients4–6 servings4Tbsp. extra-virgin olive oil, divided; plus more for serving (optional)1large onion, thinly sliced4garlic cloves, thinly sliced2½tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, divided3Tbsp. drained prepared horseradish1Tbsp. double-concentrated tomato paste½tsp. crushed red pepper flakes or 1 tsp. freshly ground black pepper2Tbsp. thyme leaves, divided1cup low-sodium vegetable or chicken broth or 1 tsp. Better Than Bouillon reconstituted in 1 cup water1½lb. Yukon Gold potatoes (about 4 medium), scrubbed, sliced into ¼\"-thick rounds1½lb. plum tomatoes (7–8), ends trimmed, sliced into ¼\"-thick rounds1(2\"–3\") piece fresh horseradish, peeled, or 1 oz. Parmesan, finely grated (for serving)Flaky sea saltPreparationStep 1Arrange a rack in middle of oven; preheat to 350°F. Heat 1 Tbsp. oil in a large skillet over medium-low. Add onion, garlic, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and cook, stirring often, until onion and garlic are softened and translucent but without taking on any color, 5–7 minutes. Remove from heat and stir in prepared horseradish, tomato paste, and red pepper flakes, and 1 Tbsp. thyme leaves. Transfer to a large bowl.Step 2Combine broth and remaining 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a small bowl or measuring cup, stirring to dissolve salt; set aside.Step 3Add potatoes to bowl with onion mixture and toss to combine. Arrange groups of 4–5 tomato slices and 4–5 potato and onion slices in alternating stacks in a 2–2½ qt. baking dish or medium cast-iron skillet so edges are aligned vertically, working your way around perimeter of dish before moving into center. The pieces should be very tightly packed; tuck leftover onion filling into any gaps.Step 4Pour reserved broth over vegetables and drizzle with 3 Tbsp. oil. Cover tightly with foil and bake until potatoes are tender and tomatoes are juicy, 40–50 minutes. Increase oven temperature to 425°, uncover baking dish, and continue to bake until liquid is reduced by about half, tomatoes are concentrated and jammy, and potato edges are golden brown and crisp, 30–45 minutes more. Let cool 15 minutes.Step 5Drizzle gratin with a little more oil if desired and sprinkle with sea salt and remaining 1 Tbsp. thyme leaves. Finely grate as much fresh horseradish over as you’d like.How would you rate Potato-Tomato Gratin With Horseradish?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleA little on the broth-y side, but nice, mild flavor (which may be due to the fact that I didn't have prepared horseradish, so I grated 3 tbsp of fresh horseradish). Despite adding more horseradish once cooked, I'd probably increase the onion mixture ingredients to intensify the flavor and coat the potatoes better (maybe along with 1/2-1 tbsp of olive oil), and perhaps decrease the amount of broth by 1/4-1/2 c as it does seem to coagulate a bit as it cools, and the broth ended up being quite delicious itself. All in all, will make again.SamanthaChicago, IL12/2/2021This is already one of my favorite recipes. I love gratin, but sometimes it is just too heavy. This perfectly combines light flavors and somehow transforms simple ingredients (potatoes and tomatoes) into luxurious flavor bombs. Also, who knew that horseradish was such a delight? Can't wait to bring this to Christmas dinner and surprise everybody.Tim TLos Angeles, CA11/30/2021Pretty good- however there ended up being a bit too much liquid from the tomatoes and broth.  The flavor was nice though.AnonymousSeattle, WA11/27/2021Explore Bon AppétitHorseradishHerbs & SpicesPotatoVegetableTomatoDinnerSideVegetarianRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-11", "author": ["Condé Nast", "Christian Reynoso"]}