{"id": "0cda5b9872ba55edd9ebe30b3d1b9f60", "url": "https://www.bonappetit.com/story/meatloaf-feud", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "Short Weeks Call for Big Enchiladas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureShort Weeks Call for Big EnchiladasPlay pretend restaurant and cook something elaborate. Plus more bits from the week at BA.By Alex BeggsMay 30, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The big enchilada“Pretend you’re at a restaurant,” I asked the fam. “What would you order?” And a special request came in: Enchiladas. (Phewph, good thing no one wanted Il Timpano.) So last week, we made a tray and a half of Rick Martinez’s chicken enchiladas with charred salsa verde. They were astounding! ALSO you can adapt this recipe to fill it with whatever your heart desires: squash, sweet potato and black bean, leftover carnitas?! etc. It’s flexible like that. When Wednesday rolled around, I had the last enchilada for breakfast with a mug of black coffee. 10/10.Get the recipe: Chicken Enchiladas VerdesWant this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie Craig, Food Styling by Pearl JonesMany meatsContinuing the theme of uh, large foods, we also made Basically’s big-ass beach hoagie for lunch with a score of deli meats from the great Metro Detroit grocery store Papa Joe’s. But instead of eating it at the beach, we ate it around the coffee table watching the neighbor across the street trim the grass around the No Parking sign in his lawn WITH SCISSORS.Get the recipe: Big-Ass Beach HoagieYAYY CARLAThis week, our own Carla Lalli Music won a James Beard Award for her excellent cookbook, Where Cooking Begins. I’ve been making her dead-simple recipe for coconut cabbage slaw a lot lately (it makes a ton and stores well), worth buying the entire book for IMO. The best thing about this award is the video Carla’s son took of her when she found out she won, doing the Elaine dance in a flowing caftan. Iconic!Preview the book—with recipes: 10 Fundamental Lessons That Will Make You a More Confident CookPhoto by Michelle HeimermanGood ideas: make wine cubesSeveral days after reading this tip from Eric Kim my mind is still blown. I knew I shouldn’t have dumped that Yellow Tail Merlot.Must read: There's No Better Time to… Save Every Last Drop of WineBeautifulI’m enthralled with elaborate focaccia art. The dough is your canvas, be free!Unnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Chelsie Craig, food styling by Pearl JonesThe humble meatloaf! So maligned and misunderstood. But not by Chris Morocco, whose Bulgogi Meatloaf Sandwich combines two loves: Korean bulgogi marinade and ye olde meatloaf. But we wondered, would the word “meatloaf” be a turn off to readers? “I feel like pop culture had a big meatloaf smear campaign in the 2000s,” noted meatloaf historian Jesse Sparks, and when it comes to the sandwich versions, he prefers eating it “more than I like thinking about it as a concept.” Hilary Cadigan did the Slack equivalent of ducking under her desk by cloaking her opinion in sideways umbrellas: (I love meatloaf.) Carla wrote a movie poster tagline, “Meatloaf: it’s not great.” “Balls are better than loaves,” declared Cristina Martinez, arguing they have more surface area for sauce. That got a quick reply from Molly Baz: “To all the haters, meatloaf is just large format balls so you can’t say you like one and not the other!!!!” She added: “The best thing is re-fried meatloaf. Slice it up, fry it ‘til crispy.” WOW. “It’s my favorite American food, not gonna lie,” said truth-teller Joseph Hernandez. “My mom would make two on my birthday, so I’d have leftovers for a few days.” Alex Delany waxed poetic for a bit, concluding that “people just don’t give meatloaf enough of a chance flavor-wise...That meatloaf Moroccs developed is UNREAL. So much flavor.” Kinda makes you want to try it...no?More importantly, get the recipe: Bulgogi Meatloaf SandwichExplore Bon AppétitBeggs NewsletterRead Moreculture32 Highly Achievable, Totallllllllllly Normal Quarantine Cooking ProjectsBy Alex BeggscookingI Gave In and Got the Reusable Paper TowelsBy Alex BeggscookingThis Pink Drink Is My Favorite Way to Consume RhubarbBy Alex BeggscultureAll ‘Gussed Up and Nowhere To GoBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-30", "author": ["Condé Nast", "Alex Beggs"]}