{"id": "0cdcf69e12b4fad1ff0aebb6de003b4d", "url": "https://www.bonappetit.com/story/chicken-cobb-salad", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Why This Cobb Salad Has Me Dancing In My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy This Chicken Cobb Has Me Dancing In My KitchenThe bacon dressing might have something to do with it.By Jesse SparksAugust 6, 2018FacebookTwitterEmailFacebookTwitterEmailThis brand spankin’ new Chicken Cobb Salad improves on the classic. How? It’s baconier, for one. The mustard vinaigrette turns glossy bacon fat into a shimmering emulsion that tempts you to bathe in it. Plus, there’s crunchy torn frisée to liven up the lettuce situation. Loads of peak-season tomatoes. The hardest part is waiting for water to boil for your jammy eggs. Knowing that, why waste your time with anything else?The recipe comes from the weeknight dinner repertoire of senior food editor Claire Saffitz. One second it offers mouthfuls of ripe tomatoes, the next a creamy bite of a perfect 7-minute egg. It combines hints of acidity from the red wine vin and tomatoes with rich bacon fat and avocado. Top it off with big crispy pieces of bacon and supple shreds of rotisserie chicken that you didn’t even have to roast yourself.Learn how to make the jammiest eggs ever here.\nPhoto by Ted CavanaughThis Cobb manages to do it all without asking for anything in return. Tearing the frisée (or whatever crunchy lettuce you prefer, like romaine or radicchio) and shredding the chicken is a breeze. Slicing tomatoes and avocados takes less than two minutes. Boiling the eggs? Turn on the stove, set a timer, and ease those babies into the water. (The trick here is to make sure your ice bath is as cold as possible in order to easily peel the shells.) The bacon? Split those strips into a medium skillet and let them go. But hold that fat! Don’t throw the liquid leftovers away. Toss mustard, sugar, and red wine vinegar into the skillet and whisk away. Watch everything come together into a vision in gold.Lay the frisée as your base, season with salt and pepper and start layering. Wanna plate like a pro? Scatter each of the ingredients into “artfully haphazard” sections, as Claire would say. Eggs in one corner, bacon in another, chicken on the diagonal. You get the idea. Before you know it, your tomatoes, avocados, and shredded chicken will make the foundations of a Bob Ross-worth masterpiece. Drizzle with the dressing and sprinkle with salt and pepper and behold: a salad so bright and peppy it’ll make you dance. Just don’t knock over your plate when you do.Get the recipe:Chicken Cobb SaladStep one: Crisp bacon. Step two: Turn bacon fat into an addictive warm vinaigrette. Boom.View RecipeExplore Bon AppétitWeeknightChickenSaladBaconRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-06", "author": ["Condé Nast", "Jesse Sparks"]}