{"id": "0cf67eb7f52cd235509b530bf7c3ea9b", "url": "https://www.bonappetit.com/story/diy-face-mask", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Make a DIY Face Mask from All-Natural Ingredients to Fit Your Skin's Needs  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis DIY Face Mask Recipe Is Perfect for Every Type of SkinAn endlessly customizable mask recipe from our latest Beauty + Chill sessionBy Aliza AbarbanelAugust 28, 2018FacebookTwitterEmailPhoto by Josephine SchieleFacebookTwitterEmailAt last week's Beauty + Chill, co-hosted by Healthyish and Hanahana Beauty's Abena Boamah, we got the lowdown on DIY face masks—how they're the easiest, cheapest, and most flexible way to take care of your skin.“It’s not just about making a mask but creating something—and for women of color, creating these masks is part of a tradition,” says Boamah, who spoke on a panel alongside beauty advocate Sophia Roe, Byrdie editor Maya Allen, Golde Turmeric founder Trinity Mouzon, and Brooke DeVard of the Naked Beauty podcast. “These are things we’ve always been known to do. Why not customize them and make them for yourself?Panelists Brooke Devard, Trinity Mouzon, Abena Boamah, Sophia Roe, and Maya Allen.\nPhoto by Wanessa YajureTake Abena's own favorite mask, an ultra-moisturizing, skin-nourishing blend of activated charcoal, rosehip power, rosewater, honey, and jojoba oil. \"I love to use jojoba oil because it's the closest oil to our own skin,\" says Boamah. \"Charcoal is great because it's cleansing but not as harsh as bentonite clay, and rosehip powder is great for replenishing but not too overpowering for sensitive skin.\"But this is no one-size-fits-all situation. Before you go full Bill Nye the Science Guy and wildly experiment with your DIY face mask, do a patch test on an out-of-the-way area like behind your ear or on the inside of your elbow to ensure you don't have any allergies. Then listen to your skin! Do you have dry patches? A stubborn zit on your chin that’s ready to claim squatter’s rights? Assess where your skin is at, then customize this mask to meet those needs. We give you three great options after the base recipe below:Hanahana Fresh MaskMoisturizing masks work well for a variety of skin types, and they can be tweaked in endless ways. This Hanahana Fresh Mask balances and cleanses the skin with the help of Vitamin C, lifting agents, humectants, antibacterials, and antifungals.Ingredients1 Tbsp charcoal1 Tbsp rosehip powder3–4 Tbsp rosewater2–3 Tbsp. honey3–4 drops lavender or tea tree oil¼ tsp. jojoba oilUse a brush or your fingers to spread mask evenly across your dry face. For extra impact, add a half a teaspoon of bentonite clay to a dab of the mixture and brush onto problem areas area. Allow mask to dry for 10 to 15 minutes, then place a heated towel on your face and rinse off. End with cold water to seal pores and a dab of shea butter, or your favorite moisturizer.For extra-moisturized skin:Honey + hemp oilFor a good deep clean:Jojoba oil + activated charcoal powder + bentonite clay + apple cider vinegarFor a next-level glow:Tea tree oil + rosewater + rosehip powder + Diaspora Co turmericAnd look out for our next Beauty + Chill, coming to Chicago in late September!Explore Bon AppétitNatural BeautyHealthyishRead MoreshoppingThese Photos Show the Women Behind the Shea Butter in Your Beauty ProductsGallery5 SlidesBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-28", "author": ["Condé Nast", "Aliza Abarbanel"]}