{"id": "0cfa18cc22997d93311ee50752fd8955", "url": "https://www.bonappetit.com/story/vietnamese-coffee-phin", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "How to Make Vietnamese Coffee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEverything You Need to Make Vietnamese CoffeeIt all starts with a phin.By An UongOctober 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I never drank coffee growing up—my parents thought it would make me short—but they did allow me pieces of their toast to dip into their morning cups. If I was awake early enough, I often watched, mesmerized, as my mom balanced a can of sữa đặc over the mouth of her cup to draw out the last of the thickened, sweetened milk. When hot coffee hit the condensed milk, the clinking of her spoon would begin, a tiny symphony. But more often than not, my mother’s ritual took place in solitude while the rest of our family was still asleep. These slow moments were the few she could have to herself.For a long time, my own coffee consumption looked very different from my parents’. For me, as an adult, coffee was almost always taken on-the-go: between the subway and work, on a lunch break, or among a crowd of strangers moving through the day. But after years of waking up and grabbing coffee on the way to something, I’ve recently started embracing the coffee phin—the Vietnamese coffee-making device often described as a crossover between a pour-over and French press—as a way to pause and engage in a coffee tradition that makes me feel connected with my family. This intentional slowness, while not new to the artisan coffee scene, is what so many emerging Vietnamese coffee brands are hoping to bring to coffee drinkers of all sorts. A number of Vietnamese and Vietnamese American entrepreneurs are working to put the phin on our collective coffee radar and give Vietnamese coffee its long overdue moment in the spotlight. Their phins are sourced from Vietnamese manufacturers or personally designed, and their beans are grown in partnership with farms in Vietnam. For these brands, it’s not just about getting caffeine from cup to brain—it’s about carving out a place for a coffee tradition that’s largely been overlooked in artisan coffee culture.It all starts with a phinThe phin, the device traditionally used to brew Vietnamese coffee, is comprised of four stainless steel parts: a plate, the body, a press disk, and the lid. Coffee, and the phin, were both introduced to Vietnam in 1800s by French colonialists, and France’s cafe culture as a whole took hold not long after. Since fresh cow’s milk wasn’t accessible in Vietnam, sweetened condensed milk became the dairy of choice to have with coffee. This combination of bitterness and sweetness has become a hallmark of the drink: the punch of strong coffee counterbalanced by honey-like condensed milk. Over the years, Vietnam has developed a coffee culture all its own, and bustling coffee bars and quiet cafes alike are an important part of the country’s culture.Photo by Isa Zapata, Food Styling by Cyd McDowellBlue Phin Coffee Filter$10 at Fat MiilkTammy Huynh, founder of Omni Bev, grew up sneaking sips of coffee from her dad’s cup when her mom wasn’t looking. Now, she’s building a brand around Vietnamese coffee, and has designed a phin with her team that is as beautifully designed as it is functional. “Why does French cuisine get to be luxurious but not Vietnamese?” Huynh asks. The Omni Bev Classic Vietnamese Coffee Starter set comes in a sleek, padded box that contains a phin, a bag of premium Vietnamese robusta beans, and a can of condensed milk. One special feature of their phin is that it comes with an attached body and plate. “I used to always lose the plate!” she laughs. “So we engineered a three-piece version based on my experience.”Phin coffee is a ritualMaking coffee with a phin is extremely simple, and once you’ve done it a few times it begins to feel like muscle memory. To make coffee with a single-serving phin, you put the device over a mug, and add about two tablespoons of coffee grounds to it. Then, you place the press disk over the coffee and pour in a bit of hot water, just enough to cover the grounds by about half an inch, and wait for 30-40 seconds. This process is known as blooming, which gives the grounds some time to release carbon dioxide, making the resulting coffee more flavorful. After that, you fill the phin to the tippy-top with water and wait. As the coffee drips into your mug, you can do a few stretches, look out the window, or play a few of your favorite tunes. Within five minutes, your coffee will be ready.Want a strong brew? You can sip the thick coffee as-is. But if you want a lighter, longer cup you can simply add another round of water to the phin. Since there’s no need for paper filters, this method is a sustainable option for coffee drinkers looking to make their morning ritual a bit more eco-friendly. Plus, since phins are made with stainless steel, cleanup is always a breeze.Copper Cow Coffee Pour Over Set$15 at Bon Appétit MarketThey can also be easily packed up for travel, so you never have to miss a good cup of coffee when you’re away from home. But now, you actually don’t even have to bring along your trusty phin to enjoy a proper brew. Copper Cow Coffee, founded by Debbie Wei Mullin, takes the phin experience on-the-go with what the brand calls Vietnamese coffee “latte kits.” Each kit comes with individual coffee filters packed with coffee sourced from Vietnam and sweetened condensed milk packets. The compostable filters have paper handles that pull apart to hang over the sides of a mug or glass. “I want to meet my customers where they’re at,” Mullin shares.What makes Vietnamese coffee, well, Vietnamese?While you can use a phin with any type of coffee, to make the real deal you need beans sourced from Vietnam. The truth is, if you order Vietnamese coffee at a cafe, chances are you aren’t actually drinking Vietnamese coffee. “Condensed milk does not make Vietnamese coffee,” says Lan Ho, founder of Fat Miilk. “Vietnamese coffee beans from Vietnam make Vietnamese coffee.” While you might have had a drink in the States that was in the style of Vietnamese coffee, rarely are the beans themselves from Vietnam. For the second-largest exporter of coffee beans, Vietnam has historically struggled against the assumption that its beans are cheap, low-quality, or downright bad. The country primarily grows robusta beans, which are easier to grow in larger quantities and at lower altitudes, compared to the arabica beans that most mainstream coffee drinkers are used to, which have a lower yield and are generally more expensive. Robusta beans also have twice as much caffeine, so they’re often used in grocery store blends or are processed into instant coffee. Single-origin robusta coffee beans have been inaccessible to the general coffee consumer until now. Ho’s team has made it their mission to address the overwhelming bias against robusta beans in the coffee industry as a whole. “I want them to be part of everyone’s homes in the same way that arabica beans are.”Nguyen Coffee Supply Original Phin Kit$36 at Bon Appétit MarketSahra Nguyen, founder of Nguyen Coffee Supply, which sells a wonderful 24-oz. jumbo phin that I use at home, says that seeing the vitriol against robusta beans lit a fire under her to do something. “It takes a community to shift the narrative,” she shares. “When I started, self-professed coffee experts would tell me they’d never had robusta beans before. I wanted to change that.” The demands of the market have historically forced farmers in Vietnam to compromise the quality of their beans, but Nguyen, along with other Vietnamese founders in the coffee space, are working to break that cycle by investing in the production of organic grade, ethically farmed robusta beans.Phin to winThe perfect balance of bitterness from the robusta beans and sweetness from the condensed milk creates an intricate push-and-pull of flavors. Want the full cà phê sữa đá experience? Fill your phin over a glass of ice and swirl in some condensed milk to make a drink that will wake up any lethargic summer day. For the dairy adverse, coconut milk makes a refreshing addition to the nuttiness of a robusta brew. Whether you’re new to coffee or have a several-cups-a-day habit, the phin offers a flexible, sustainable way to slow down your process and take in the joy of a good brew.Explore Bon AppétitShoppingcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-08", "author": ["Condé Nast", "An Uong"]}