{"id": "0cfe1465d8ae0cb957f8b8b57d0d835b", "url": "https://www.bonappetit.com/story/fastest-way-to-cut-cherry-tomatoes", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "How to Cut Cherry Tomatoes Fast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Will Not Apologize for the Dorky Way I Cut Cherry TomatoesLaugh all you want: I will beat you in a cherry tomato cutting contest.By Sarah JampelAugust 13, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailScrolling through Pinterest is a lot like shopping at a thrift store: For every 100 pieces of junk, you’ll find one treasure. So while a “hack” for cutting a whole bunch of cherry tomatoes between two quart container lids might seem gimmicky at first (and every time I do it in front of Carla Lalli Music or Chris Morocco, I blush a deep crimson), believe me when I tell you: This one works! This is the treasure! This is that pair of timeless vintage Levis. (Okay, simile stops now.)Here’s how to do it: Place the first quart container lid on your counter, right side up. Then pack on the cherry tomatoes in an even layer and cover with the second lid, upside down (the rims of the two containers will act as a barrier and keep your tomatoes in place). Use a knife—a really sharp chef knife or, my preference, a serrated knife—to slice parallel to the counter, thereby halving all of those tomatoes. Repeat the process until you have enough halved tomatoes to make this Ratatouille Pasta.Sure, you could slice the tomatoes one by one...but, excuse me, do I look like I’m made of time? There’s TV to watch! There’s news to avoid! Even though this trick has been making the internet rounds since the beginning of time, every time I execute it, I get looks of revelatory amazement. Or maybe people are just embarrassed for me? Using this 2003 “hack” that got buried under piles of content?Whatever the look on their faces means, I do know one thing: I’d totally beat them in a cherry tomato-cutting contest.Now it's pasta time:Ratatouille PastaIf we were to round up an all-star team of summer's greatest produce, it'd look a little something like ratatouille: Eggplant and zucchini. Peppers and tomatoes. The gang's all here!View RecipeExplore Bon AppétitCherry TomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Sarah Jampel"]}