{"id": "0cfeeff1d11e09e5e4f7dec4b0de0f8c", "url": "https://www.bonappetit.com/story/healthyish-home", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Healthyish at Home: 7 Ways to Make Your Space Feel Great | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHealthyish at Home: 7 Ways to Make Your Space Feel GreatWe consulted the experts to save our houseplants, bring order to our kitchens, and spark joy in our decor.By The Healthyish TeamJanuary 25, 2021FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailAfter almost a year of doing just about everything from home, our living spaces desperately needed a change. Our houseplants drooped, our overworked (and undercleaned) kitchens overflowed with half-empty pasta boxes. So we decided to take matters into our own hands….after consulting some experts on everything from strategically redecorating to creating a home gym without going broke for a Peloton. Of course, even the most HGTV-worthy DIY can't magically double your square footage or convince your landlord that a Great Dane totally counts as a “small pet.” But these seven actionable tips can still make your space feel great, because after all this time, it's still good to be home. Photograph by Laura Murray1. Got Plant Questions? Ask the Plant KweenSince the beginning of quarantine, Christopher Griffin, a.k.a. @plantkween, has acted as my digital wellness tonic. Their glowing self-portraits (always mid-laugh, decked out in something fabulous, and surrounded by an indoor jungle of 185-and-counting houseplants) and videos (along with a salutatory “daaahlings!”) are the moments of verdant bliss my gloom-and-doom-filled Instagram feed needs. But facing down a long, cold winter lockdown, I realized what I needed even more was an IRL space as green as Griffin’s. So, desperate for advice, I caught up with the Kween themself for answers to all my most burning botanical questions. Get allll Plant Kweens' plant advice. –Hilary Cadigan, culture editorIllustration by Marisol Muro2. Grunt All You Want in Your Home GymWelcome to my basement gym! The ceiling is low and spider-webby here, the temperature is COLD. But hey, it works. Once a devout member of the YMCA— I’ll miss the locker room gossip and my spin friend, Dan—now I’ve got my own low-budget gym without the commute/risk of COVID infection. Plus, it gives me reason to shower every day. Here’s how I did it. –Alex Beggs, staff writerPhotograph by Laura Murray3. Live in TechnicolorIf months of staring at the same walls didn’t weaken minimalism’s appeal, one look at designer Ellen Van Dusen’s gloriously over-the-top Brooklyn brownstone did. “Not everyone has the same relationship with color, but little objects can really shift the mood of a room,” Van Dusen says. “It’s an easy way to change things up.” Seeing how she combines patterns, colors, and tchotchkes will fuel your own decoration dreams. –Aliza Abarbanel, assistant editorIllustration by Marisol Muro4. (Re)Organize Your KitchenWhen you’re cooking nearly every meal, it’s easy to let chaos creep into the kitchen. Expired food lurks in the back of the fridge; grains hide behind cans in cabinets. But it’s a new year, and professional organizer (and former personal chef) Faith Roberson is here to restore order in our overworked, undercleaned kitchens. Get her tips for kitchen organization. –Emma Wartzman,  writerPhotograph by Laura Murray5. Use Food to HealWhen scratchy throats and other mid-winter side effects set in, get relief without a trip to the drugstore by making this savory-sweet cough syrup from Felicia Cocotzin Ruiz. The Phoenix-based curandera, or folk healer, is an indigenous foods activist and chef who educates on using food as medicine through her brand Kitchen Curandera. Here she pairs alliums with ginger and honey for a soothing, savory-sweet syrup. Onions have been used as medicine around the world for countless generations—they’re warming, rich in phytonutrients, and help get phlegm moving. \"This has the same soothing feeling as chicken soup,\" she says, though she adds that “people dealing with a bad cough should go see a healthcare provider.” Cocotzin Ruiz makes this cough syrup with small, sweet I’itoi onions, which grow in the Sonoran Desert where she lives, but shallots can be substituted without compromise. Make Felicia's Scratchy Throat Soother.Photograph by Laura Murray6. Stop and Smell the Rose CandlesIncense isn’t just essential for clearing the air of last night’s salmon. “Especially if we’re not leaving home much, you can create different emotional and psychological environments by using scent,” says neuroscientist Rachel Herz, Ph.D, author of Scent of Desire and researcher on the psychological science of smell. Smell and emotional memory have a fundamental neurological link, making it possible (but not guaranteed) to change your mood with a whiff of freshly baked cookies. But there’s a catch: Our brains quickly acclimate to scents—15 minutes, max—so a single candle will only go so far. Check out all the feel-good fragrances in our staff's rotation.Illustration by Marisol Muro7. Set Boundaries to Stay Sane“During the pandemic, my family’s world is our house,” writes Angela Garbes. \"My husband works in our garage. My daughter attends kindergarten on an iPad next to her bed while I work in the guest room. But the door is always open, my neck craned as I half-listen for panicky cries: “My screen is frozen!” Read about how Garbes sets boundaries in the era of life-at-home.Explore Bon AppétitHealthyishHealthyish HomeRead MoreLifestyleThe Healthyish Guide to Being AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "The Healthyish Team"]}