{"id": "0d02caed9fe4028ecb32a304c002390d", "url": "https://www.bonappetit.com/story/best-beer-glasses-teku", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "A Teku Glass Will Make Your Beer Taste Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBeer Tastes Better in a Teku GlassBecause good beer deserves something better than a Solo cupBy MacKenzie Chung Fegan and Alex DelanyApril 29, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Aside from upside down on top of a keg, I would argue that there is no wrong way to drink a beer. As long as the brew is good, I’ll take it in a tall boy or a frosty bottle or one of those tiny cañas that you get at bars in Spain. But if we’re talking about the best beer glasses for your home bar, the ones that will really let your craft beer be all it can be, there is a clear winner—Rastal’s Teku glasses.Teku Beer Glasses (6 Pack)$60 at AmazonWhat makes the Teku the best glass for beer?The Teku glass was designed by Italian craft beer experts Teo Musso and Lorenzo “Kuaska” Dabove and is manufactured by the German glassware company Rastal. Here in America, we historically haven’t given much thought to our beer glassware. Shaker pints—which, from a form perspective, are essentially Solo cups, but made of glass—are ubiquitous in bars not because they’ve been designed to highlight the nuanced bouquet of an imperial stout. Rather, they’re hard to break, easy to clean, and can be stacked 20 high by a barback making the rounds after last call. Teo and Kuaska (TeKu, get it?) thought craft beers deserved better.In a world of softly rounded tulip glasses and tall, willowy Hefeweizen glasses, the Teku is stemmed and angular, like a wine glass crossed with a witch’s cauldron. A good beer glass should trap the aroma of the beer so that when you go in for a sip, you’re smelling as well as tasting. To do this, the glass needs a body with a top that’s smaller than the base, so the aroma doesn’t leave your glass all at once. (This same logic applies to wine glasses.) You want your IPA’s notes of tropical fruit and pine needles and dank marijuana to sit at the top of the glass, not dissipate into the ether within seconds of being poured.That’s fruity beer! Not wine!\nPhoto by Alex LauThen there’s the stem—same idea here as with a wine glass. I’m a slow drinker, and I’d like a perfectly chilled Gose to stay that way until my glass is empty. One thing that doesn’t work in my favor? Perpetually sweaty palms. But with the Teku, I don’t have to worry about bringing my beer up to body temp because I’m only touching the stem.Finally, there’s that little lip, curving outward from the top of the glass. This is a thoughtful if not totally necessary flourish, but the slim rim of the glass nestles pleasingly along your lip when you sip—a contrast to a chunky pint glass.Do I even need a glass?If you’re headed to the beach or going camping or popping a Miller High Life at a backyard barbecue, no, you don’t need to bring along your fancy stemmed glassware. But pouring your beer into a glass does objectively allow you to better appreciate it. (The 14-ounce Teku is perfectly equipped to hold the contents of a 12-ounce can or bottle of beer.) You won’t be able to admire the tangerine hue of a hazy IPA through aluminum, and good luck trying to huff its juicy aroma through the mouth of the can. Drinking a great craft beer from a can is like when you hear the song of the summer blasting so loudly from a car across the street that you can hum along even though its windows are up. It’s still a banger, but wouldn’t you rather be in that car? (Don’t drink and drive.)Should you build your own Teku pyramid at home? Eh, probably not.\nPhoto by Alex LauIs the Teku glass the best glass for all beers?The beauty of the Teku beer glass is that it’s a true all-rounder, as good with a saison as it is with a hoppy ale. If you’re going to have one set of house beer glasses, go with the Teku. But if you’re more of the “variety is the spice of life” type, consider picking up this craft beer tasting kit from Spiegelau, another German glass manufacturer. They’re particularly well known for their IPA glass, beloved by many hopheads, and you’ll get one of those in this kit in addition to glasses for wheat beers, stouts, and barrel-aged beers. If you’re into the Teku but you’re an even slower drinker than I am, opt for the slightly smaller, 11.2-ounce Mini Teku.Spiegelau Craft Beer Tasting Glasses Kit$46 $40 at AmazonMini Teku Beer Glasses (2 Pack)$33 at AmazonHaven’t I seen these before?The Teku glass is so beloved that independent breweries often make branded versions as merch. Collect them like Pokémon from Copenhagen’s Mikkeller, Brooklyn’s Other Half, and Alaska’s 49th State Brewing. Or go the custom route and have a set engraved with your favorite inspirational quote.How much are these going to set me back?You might assume that a specialty craft beer glass imported from Europe would be obnoxiously pricey, but a set of six Tekus clocks in at $58—under ten bucks a piece. If you’re serious about your craft brews, that’s a reasonable price to pay for the best beer glass out there.Wait, what’s an IPA?10 Styles of IPA to Know Before Your Next Round of BeersOnce you know the difference in IPAs, you can find your IPA soulmate.View StoryEditor’s note: This article was originally published July 12, 2018.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Mackenzie Chung Fegan", "Alex Delany"]}