{"id": "0d0d8ec215dfae128bc687d6244a0a4e", "url": "https://www.bonappetit.com/story/danielle-chang", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Danielle Chang Has The Most Gorgeous Rooftop Garden in New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleForward All Our Mail to Danielle Chang's Gorgeous Rooftop GardenThe Lucky Chow host grows the snappiest snap peas, and the views aren’t bad either.By Hilary CadiganSeptember 13, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI probably shouldn’t have visited Danielle Chang’s dreamy SoHo penthouse the same month I was apartment-hunting for myself. The cream-colored living room with its floor-to-ceiling windows and wall full of books organized by color. The massive dine-in chef’s kitchen with its central hooded stove and enviable number of drawers. The glassed staircase (a staircase! in a New York City apartment!) leading to who-knows-where. It all felt a bit like MTV’s Cribs—unlike my apartment search, which felt more like being in an episode of Deal or No Deal, choosing between a closet and a working oven.Then came the magnum opus: a bilevel rooftop garden with soaring views of the Manhattan skyline and two different lounging areas. Up here is where Chang spends most of her free time—when she’s not off traveling the world for her PBS show Lucky Chow (now on its third season) or running the ship at LuckyRice, the company she founded ten years ago, which hosts events all over the country celebrating Asian heritage through food.To say Chang is living my dream life would be an understatement, but she’s too sweet to envy. Plus the rooftop garden is a straight-up urban Garden of Eden—fat yellow sungolds, pea shoot tendrils spiraling over a homemade trellis, edible flowers of all shades. As a confirmed plant-murderer, unable to keep even a cactus alive, I clearly don’t deserve a life-swap. But maybe I could learn a thing or two.Danielle Chang's rooftop garden is basically an urban Garden of Eden.\nPhoto by Chelsie CraigChang was born in Taipei, Taiwan, moved all over as a kid, and ended up in California for high school. “I was never the least bit interested in gardening,” she says, popping a bright red Japanese turnip off its stalk for me to taste. “When I moved to New York, I barely noticed the changing of the weather.” But she always loved cooking, and Sunday suppers in particular—visiting the local greenmarket, buying what was fresh, cooking up a feast for family and friends. The problem, she says, was finding local iterations of Asian produce, like lychee and bok choy. Such items were plentiful in Chinatown, but most had traveled across the world to get there—not exactly eco-friendly. And yet, says Chang, their low cost and  accessibility discouraged local farmers from trying to grow and sell these items themselves.Traveling to and from Asia to host Lucky Chow, a show centered on the international impacts of Asian foodways, Chang met all kinds of farmers, and began wondering if she might be able to do what they did. One of them, a Korean adoptee living in California named Kristyn Leach, made a particular impression. Leach started farming as a way to reconnect with her Korean roots and told Chang about a seed company called Kitazawa that specializes in heirloom organic Asian produce. “We filmed her for season two, and she was growing these beautiful sweet Korean radishes,” says Chang. “She inspired me.”The komatsuna, or Japanese mustard spinach, is thriving.\nPhoto by Chelsie CraigSo, five years ago, when Chang moved into a new apartment with rooftop access, she decided to try gardening herself. “It was trial by experimentation,” she says. “The first year, I’d literally sprinkle a seed packet into the soil and be amazed if I actually got anything.”She started with tomatoes—which she recommends to all gateway growers (“so rewarding and easy”)—and herbs. First basil, then more speciality Asian varietals like shiso and perilla leaves. Next came the peas. “The more you pick, the more you grow! Now I literally sit there, pick them, water something, come back, and there are already new peas on the vine,” she says with a laugh. Then eggplant, zucchini, radishes, daikon, celtuce, several varieties of chile. Today, Chang makes sweet Asian pickles from Tokyo turnips. She shares her bumper crops with friends and local chefs, and saves all her stems, which she salts and dries for winter soups and stir-fries.She’s also managed to work her nascent gardening skills into new projects with LuckyRice. This summer, she partnered with the Port Authority of New York and New Jersey along with Nick Storrs, a rice farmer on Randalls Island, to install a unique public art exhibit in lower Manhattan. It’s a living rice paddy, planted inside two large wavy wooden structures between the Oculus and the World Trade Center. Chang started the seedlings right here on her roof before transporting them to their new public space, where she checks in on them regularly to make sure they grow strong.The view isn't bad, either.\nPhoto by Chelsie Craig“It’s a public art work and a cultural commentary,” she says. “A metaphor for something so fundamental to Asian cuisine right here in the heart of Manhattan.” On September 26, she’ll celebrate LuckyRice’s ten-year anniversary with a special LuckyRice Feast featuring chefs from all over the world, creating rice dishes ranging from wok-fried rice to paella to show off the crop’s universality.As signs adhered to the installation point out, a third of all the calories consumed by humans worldwide is rice, and 90 percent of that rice is grown in Asia. “I want to make people stop and think a little when they come across a rice paddy in their daily shuffle to work,” says Chang, “about where our food comes from, about the collision of cultures.”Back on the roof, I’m biting into the sweetest, snappiest snow pea I’ve ever tasted. Chang is detailing her plans for future dinners. These peas, tendrils and all, could get stir-fried with some garlic and Shaoxing wine, served with drunken chicken and rice. Or they could be saved for compost soup, a super-healthy dish she invented to make use of extra radish tops, carrot skins, and all the things that usually get wasted.Leading me into the kitchen, she points out a floor-to-ceiling shelf of glass-jarred spices and dried produce from her travels: wakame seaweed flakes, star anise, mung beans, super-fragrant green Szechuan peppercorns, lotus flowers gifted by Buddhist monks from a temple in California. Using these tokens to season produce she grew herself, right here in New York, feels like coming full circle.“Really, we’re all farmers,” Chang says. “Being Chinese, my ancestors did their fair share of farming. And now my kids are talking about how, in the future, we’ll all have to farm our own food.”But she’s also quick to point out that moving toward a more sustainable future happens with individual steps. Sure, I might not have the roof space for a thriving kitchen garden, but I could grow a small box of herbs on my south-facing windowsill. Or plant a few vegetable seedlings in containers beside my front door. That’s the thing about big things. They usually start small.Explore Bon AppétitHealthyishNew York CityprofileRead MoreLifestyleI'm a Chef Who Loves Comedy—So I Became a Stand-Up ComedianBy Einat AdmonyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-13", "author": ["Condé Nast", "Hilary Cadigan"]}