{"id": "0d16cfed0a5bbe5422ef4ed1697ebe20", "url": "https://www.bonappetit.com/story/wild-wild-country-rajneesh-cookbook", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Watching Wild, Wild Country? Then You Need to See The Rajneesh Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWatching ‘Wild, Wild Country’? Then You Need to See The Rajneesh CookbookStay away from the salad bar and make some Nachos Zorba, Nut Loaf, or a nice Coconut Salad instead.By Melissa LockerMay 4, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmail“When you share food, you become brothers because food is associated with love,” the Bhagwan Shree Rajneesh wrote in his book The Mustard Seed. If you watched the Netflix documentary series Wild Wild Country, you already know that the Bhagwan, also known as Osho, was an Indian self-help guru who attracted thousands of followers from around the world with his talk about sex and joy as a path to super-consciousness. Achieving super-consciousness (nudge nudge, wink wink) burned a lot of calories, though, and the Rajneeshees (a.k.a neo-sannyasins or simply sannyasins) loved food.To encourage eating well and enjoying life—and to earn a little gas money for their guru’s Rolls Royce collection—the Rajneeshees published a cookbook. Zorba the Buddha: Rajneesh Cookbook was published in 1984 at Rajneeshpuram, the community they founded in north-central Oregon. The title came from Osho’s desire to combine the vitality and liveliness of Zorba the Greek and the meditative nature of the Buddha. It’s filled with recipes collected from the various restaurants, meditation centers, ashrams, and neo-sannyasins around the world. The recipes are as eclectic a mix as Osho’s followers. There was guacamole, almond cake, Bavarian stuffed cabbage rolls, a multitude of crepes, Champagne Charlie, paneer, and calzones all organized in a delightful, inscrutable, odd manner. Recipes for banana cake, bean chili, khichadi, and Nachos Zorba sit side by side on the page, perhaps as a symbol of unity—or as a suggested menu for a dinner party for pregnant women.The Bhagwan and his disciples known as sannyasins were vegetarian, and in the ’70s and ’80s vegetarian dining meant one thing—Nut Loaf. This mixed-nut and brown rice blend, seasoned with soy sauce, marjoram, thyme, and paprika and baked in a loaf pan was the mainstay of the Oregon summer camps I attended. Camp cooks were seemingly desperate for vegetarian options for campers, so they served up warm slices of this damp brown loaf alongside four-bean salad and, if you were lucky, canned peaches. Needless to say, none of the campers asked the chef for the recipe.That wasn’t the only hippie classic to make its way into the pages of the cookbook, though. It also includes several recipes that call for vegetarian chicken—and in Oregon in the 1980s, Worthington FriChik was the main option. These chunks of texturized vegetable protein (TVP) were sold in cans, floating in a gelatinous sauce that preserved the moisture no matter what measures you took to get rid of it. (Fear not, brave diners, it can be found on Amazon if you’re looking for supplies for your doomsday bunker.)The chefs in the Rajneeshpuram kitchen would transform those chicken-flavored rolls into an array of dishes. They stood in (presumably badly) for the scallops in Coquilles St. Jacques, were tossed into clam chowder, and replaced the veal in Veal Picatta. Chicken Brieburgers, where brie, butter, and mustard are sandwiched between two slices of faux chicken, dipped in egg, wrapped in phyllo, and then deep-fried and served on a bun, could be served up at lunch. For more formal gatherings, Chicken Kiev might appear on the table at Rajneeshpuram. That recipe involved smooshing (technical term!) the chicken cutlet, coating it with butter, parsley, tarragon, and lemon juice. It was then sprinkled with Swiss cheese rolled into a sausage shape, dipped into an egg wash, and rolled in phyllo. The phyllo sausage was dipped again in egg and fried until golden and served on a bed of plain rice, presumably to highlight the flavor of deep-fried, cheese-covered faux chicken.On the rare occasion where TVP wouldn’t work, tofu was the alternative. It appeared as the crab in Mock Crab Salad and was the centerpiece in Tofu Stroganoff, served in a sour cream sauce over noodles and deemed “an elegant dish” by the cookbook’s super-conscious authors, and who are we to argue?The Rajneeshees weren’t the only group promoting vegetarianism in the ’70s and ’80s, of course. The recipes in Zorba the Buddha may have the sannyasin pedigree, but many of them are straight out of the 1970s vegetarian playbook espoused by Frances Moore Lappé in Diet for a Small Planet. Books like Tassajara from California’s Zen Mountain Center, Laurel’s Kitchen, and Moosewood Cookbook all shared a common sensibility (and love of tofu) with the Rajneesh recipes. Cossack Pie, a recipe from the Rajneesh outpost in Fremantle, Australia, bears a similarity to a recipe from Anna Thomas’s 1972 classic The Vegetarian Epicure, where it was called Russian Vegetable Pie. Both recipes involve seasoning butter-browned mushrooms, onions, cabbage, broccoli, and carrots with caraway seeds, basil, and dill. The vegetables are mixed with an egg and, in the Rajneesh version, cottage cheese, poured into a shortcrust pastry, topped with sour cream, more mushrooms, and paprika and baked.Many of the vegetarian cookbooks of the day incorporated Indian dishes into their recipe files, and Zorba the Buddha was no different, although the Rajneeshees had actual Indian roots. The cookbook included many recipes from the Bhagwan’s native country, presumably perfected on his ashram in Pune. There are pakoras made with black chickpea flour, filled with eggplant, potato, or—with a nod to their new homeland—cheddar cheese. More traditional were the chai, and parathas filled with ginger and chili-spiced cauliflower mixed into a simple whole wheat dough, bound with ghee and water. The parathas are then flattened into a six-inch pancake, dry-fried in a flat pan, brushed with ghee, and fried again. Served hot, they go with everything (save the mayonnaise-and-tofu Mock Crab Salad).While some of their entrées required a leap of faith (we’re looking at you, Chicken Brieburger), their baked goods were not just delicious but famous. Someone in Rajneeshpuram had a serious sweet tooth, and a good chunk of the cookbook is dedicated to treats, including four separate variations on chocolate mousse, chocolate gâteaus, chocolate milkshakes, and a pound cake made with a cup of sugar and a cup of butter and laced with almonds and raspberry jam. Their pastries and cakes were so well loved that the Rajneeshees had a bakery in Portland called Zorba the Buddha Bakery that sold eight kinds of bread and some 30 varieties of cookies, like macaroons dipped in dark chocolate and Mexican wedding cookies, cakes, and Linzer tortes, baked at their ranch in Antelope, Oregon, and driven to Portland each day.One of the tenets of the Bhagwan’s religion was happiness and laughter, and there’s no better way to enjoy life than with a tall milkshake, slice of Viennese cake, or, maybe less successfully, faux Chicken Kiev. If only the Rajneeshees had stuck to enjoying their tortes and tarts and parathas instead of trying to poison their neighbors by spiking the salad bar with salmonella. Or perhaps they should have just served them the Mock Crab Salad instead.Pictured up top: Coconut Salad from Zorba the Buddha: Rajneesh CookbookCheck out the full cookbook online here.A recipe the Rajneeshees would (probably) love:Explore Bon AppétitPop CultureOregonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Melissa Locker"]}