{"id": "0d2a9803c2ed6b108771779f456f88bd", "url": "https://www.bonappetit.com/recipe/ruths-lima-beans-with-smoked-turkey-tail", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Ruth’s Lima Beans With Smoked Turkey Tail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueRuth’s Lima Beans With Smoked Turkey TailBy Ben BynumJune 2, 20205.0(10)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrint“This dish is like a warm embrace from my mom, Ruth,” says Ben Bynum, co-owner of Philadelphia restaurants Warmdaddy’s, Relish, South Jazz Kitchen, and Green Soul. Before she passed, Ruth joined her son in converting to Islam, and so replaced the ham hock in her famous one-pot bean dish with halal-friendly but almost-just-as-fatty smoked turkey tails, which are widely available, relatively inexpensive, and seriously delicious.Ingredients8–10 servings 2Tbsp. vegetable oil1smoked turkey tail (about 7 oz.)1large onion, finely chopped½medium red bell pepper, ribs and seeds removed, finely chopped3garlic cloves, thinly sliced½cup Louisiana hot sauce¼cup chopped peperoncini, plus ¼ cup brine2Tbsp. chopped thyme1lb. dried large white lima beans, rinsed, soaked overnight, drained2quarts low-sodium chicken brothPreparationStep 1Place oil and turkey tail in a large saucepan. Set over medium heat and cook, turning occasionally, until brown  on all sides, about 5 minutes. Add onion; cook, stirring occasionally, until starting to take on some color, about 4 minutes. Add bell pepper; cook, stirring, 1 minute. Add garlic, hot sauce, peperoncini, brine, thyme, and beans, then pour in broth. Bring to a boil; reduce heat and simmer, skimming any foam from surface, until beans are tender and liquid thickens slightly, about 2 hours. Shred meat on tail and mix into beans; discard tail.Step 2Do ahead: Beans can be made 3 days ahead. Chill in an airtight container.How would you rate Ruth’s Lima Beans With Smoked Turkey Tail?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI made this with a smoked ham hock and yellow eyed beans, because that’s what I had. The pepperoncini makes this soup delicious flavorful unique and my new favorite. Will be adding this recipe to my regular rotation Sarah TMaine12/22/2021Had some leftover pastrami from Hershel's at Reading Terminal that I subbed for the Turkey neck. Used local, homemade pumpkin hot sauce that gave a nice pumpkin flavor. Phenomenal overall!KevinYork, PA11/13/2021Haven't made it with lima beans yet. Been using pinto but the recipe works well. I smoke my own turkey tails and add several instead of the one. Drechris California 3/27/2021Ruth’s Lima Beans - comfort food at its best and healthiest! I subbed turkey ham for the tail, added a finely chopped carrot with the onion for sweetness, and sprinkled a pinch of summer savory on each bowl at serving.TroutappleTucson6/19/2020Explore Bon AppétitLima BeanWhite BeanBeanVegetableTurkeyPoultryEasyMainSideGluten-FreeDairy-FreeNut-FreeSimmerJuneteenthDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Ben Bynum"]}