{"id": "0d3021d4ff3b4f61aeb4bfc7dadcfddf", "url": "https://www.bonappetit.com/recipe/cantaloupe-with-bacon-cashew-crumble", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Cantaloupe With Spicy Bacon-Cashew Crumble Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCantaloupe With Spicy Bacon-Cashew CrumbleBy Leela PunyaratabandhuJuly 6, 20214.1(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintJuicy melon with a salty-sweet crunchy topping makes for a low-effort but universally crowd-pleasing summer appetizer. “My mother has been making this dish since I was a young kid,” says the cookbook author Leela Punyaratabandhu. “It’s inspired by the Italian classic, prosciutto e melone, and an elegant and old-school Thai appetizer in which watermelon is paired with a sweet, salty, sandy crumble. You won’t find cantaloupe paired with spicy bacon-cashew crumble anywhere in Thailand, but this was one of my after-school snacks and, to this day, one of my favorite things to serve when I entertain guests.” Swap any melon for the cantaloupe—as long as it’s ripe, it will be delicious—and don’t serve it straight out of the fridge, because very cold melon will solidify the residual bacon fat in the crumble. Serve it with Leela’s summery menu for Grilled Pork Shoulder Steaks With Green Pepper Relish, Khao Niao (Thai Sticky Rice), Cucumber, Tomato, and Green Bean Salad, Grilled Scallops With Peach Sweet Chili Sauce, and Lime-Lemongrass Slushies. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonCutting Board$10 At IKEASlotted Spoon$13 $10 At AmazonIngredients4 - 6 Servings6slices bacon, sliced crosswise ¼\" thick3large garlic cloves, finely chopped1red Thai chile or Fresno chile, finely chopped½cup finely chopped unsalted roasted cashews1Tbsp. light brown sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more12-lb. cantaloupe, room temperature, cut into 1\" cubesPreparationStep 1Cook bacon in a dry medium nonstick skillet over medium heat, stirring often, until crisp, about 5 minutes. Using a slotted spoon, transfer bacon to paper towels to drain. Pour off all but 1 Tbsp. fat from skillet.Step 2Cook garlic and chile in same skillet over medium heat, stirring, until garlic is softened but has not taken on any color, about 1 minute. Add cashews; cook, stirring constantly, until heated through, about 2 minutes. Remove skillet from heat and stir in bacon, brown sugar, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt. Taste crumble and season with more salt if needed. Crumble should be equal parts salty and sweet.Step 3Arrange cantaloupe on a platter and top with warm crumble.How would you rate Cantaloupe With Spicy Bacon-Cashew Crumble?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis recipe is fantastic. I have served it five times now to different couples, with rave reviews each time. Simply lovely on the deck in the afternoon sun with a chilled glass of white wine.AllisonMCanada10/9/2021Took this to a family potluck, and everyone raved about the flavors. Now my sister wants to serve it at her bistro. Thanks for sharing a unique flavor combination.Nancy HoffhinesOntario, OR10/4/2021I had high hopes but...\nEven with garden ripened Cantaloupes and fresh garden Garlic and Havasu Chillies....this recipe failed.\nIt was weird and muddy.\nSad because the ingredients sound like a good mixjohnnyontario10/4/2021If you have to eat cantaloupe - this is the way to do itJackie MMadison, WI9/12/2021What a banger!!! The crumble can go in anything!!  Ima try it on vanilla ice cream😃Hungry in PhillyPhiladelphia 8/8/2021Explore Bon AppétitThaiSoutheast AsianAsianMelonFruitCantaloupeBaconCured MeatMeatCashewNutThai ChileChileVegetableFresno ChileSummerQuickEasyWeeknight MealsStarterSnackDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}