{"id": "0d3bab608279bb677e348908dcde099f", "url": "https://www.bonappetit.com/story/stacy-abrams-dinner-party", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Stacey Abrams on the Secret Ingredient to Great Cheesecake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStacey Abrams on the Secret Ingredient to Great CheesecakeAs if registering voters weren’t enough, the politician and activist wrote a suspense novel—and knows how to cook.By Dawn DavisMay 28, 2021FacebookTwitterEmailIllustration by Joana AvillezFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.If you love nothing more than to read a good novel on a lazy summer day, consider While Justice Sleeps. It’s “a first-class legal thriller… that’s fast-paced and full of surprises,” according to someone who knows a thing or two about page-turners, best-selling author Scott Turow. But it wasn’t written by a repeat best-seller. It was penned by none other than Stacey Abrams, founder of voting rights group Fair Fight. Given how much she has on her plate, taking on voter suppression by day and writing books by night, cooking for others is an enjoyable diversion.If you could have any three guests at your ideal dinner party, who would they be?Octavia Butler, an amazing science fiction writer. Lyndon B. Johnson, one of the most fascinating politicians, who went from being a rabid segregationist to being the midwife for civil rights. And Star Trek’s Kathryn Janeway, captain of the USS Voyager. She has to marshal her crew, work with her enemies, and keep morale up while taking on a seemingly endless journey to salvation.You seem to love sci-fi based on the guest list, but your own books include romance novels (written under a pseudonym), and you’re just out with your first legal thriller. Is there anything you can’t do?My mom once said that I would be a jack-of-all-trades and the master of none. So I thought that meant I needed to be a master of all trades. I completely missed the point of her admonition.Where would this dinner be?I’d do it at my home because I really love cooking and because the conversation could get rowdy. When you’re in a private room at a restaurant, people are in and out. I want to suggest “here we are in this safe space, no holds barred. Let’s talk.”Do you break out one of those conversation-starter games?No. LBJ was well known to be a raconteur. Janeway is not shy; she’s going to take her space. And then, from Octavia Butler’s writing, I can only imagine that she would ask really provocative questions that would lead to vigorous and boisterous argument.And what’s the tabletop aesthetic like?I have this really nice set of plates I think I got from Crate and Barrel. They’re really pretty with an ombré pattern. When I have guests over, that’s what I use. I’d do a runner as well. It makes a table feel sophisticated without it being too complicated. And then nice placemats that fit with the runner, but it’s not stuffy.Photo courtesy Crate & BarrelLainie 90-Inch Yellow Table Runner$50 at Crate and BarrelWhat do you cook?I would make crusted-chicken Romano, a pan-fried paillard of chicken crusted with Romano cheese and panko. Asparagus risotto and a side of haricots verts. For dessert, I would make a New York–style cheesecake.Is there a secret ingredient in your cheesecake?I learned to make cheesecake by reading the back of the Philadelphia Cream Cheese box. Over time I’ve perfected my recipe by watching Julia Child. And the Pioneer Woman does really interesting things with her cheesecake. So mine is a blend of the three.Where do you go to relax the day after your dinner?When I’m truly in a celebratory mood, I go to Sotto Sotto, an Italian restaurant in the Inman Park neighborhood of Atlanta. They do this strozzapreti with ragù that is the most delicious thing I eat.Explore Bon AppétitDream Dinner PartyInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-28", "author": ["Condé Nast", "Dawn Davis"]}