{"id": "0d50a6b6fdc50ff29ea5d1126137b479", "url": "https://www.bonappetit.com/story/fourbritishginpicksjustforyou", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Four British Gin Picks, Just for You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredFour British Gin Picks, Just for YouProduced by Bon Appétit with Food is GREATBy Food is GREATDecember 18, 2019FacebookTwitterEmailFacebookTwitterEmailNo spirit is as much a shape-shifter as gin, which is astounding in its ability to absorb different flavors and aromas with even the slightest recipe tweak. But few have pushed gin’s boundaries quite like the British, who’ve been obsessed with the stuff for centuries. Today, Brits are the world’s unofficial leaders in gin production, responsible for crafting some of the best loved and most innovative varieties around.Sorting through them all can be a tall order, but we’ve got the low-down on how to best figure out what type (or types!) of British gin best suit your palate. Some burst with juniper flavor, while others are redolent with the aroma of rose petals. They’re distilled in both the north and south, in both hip urban centers and lush countryside locales. Some are made from centuries-old recipes, while others rely on adventurous new ones. The takeaway? Across the varied landscape of British gin, there’s no shortage of unique flavor profiles that capture the essence of where and how that gin was created.Here are four types to consider the next time you’re at the local bar — or at home, mixing your own next-level cocktail.Southside Fizz with Chase GB Extra Dry Gin \nPhotopia PhotographyJuniper RichAll gins call on juniper, a type of coniferous tree in the cypress family, for its rich woody and loamy notes. But some British gins hit the juniper nail harder than others: Chase GB Extra Dry Gin, for instance, calls on both juniper buds and berries to impart a forest-forward flavor on the palate. Distilled on the Chase Farm in Herefordshire from potatoes grown on-site with water drawn from beneath the property, Chase GB Extra Dry Gin also relies on a bevy of spices—coriander seed, bitter almond, cinnamon bark, ginger, cloves, angelica root, licorice root, lemon peel kibbles, and cardamom—for added complexity. Classic offerings such as this shine brightest in straightforward drinks like the Southside Fizz, which mingles gin with splashes of lime juice, simple syrup, and effervescent soda water.Rose Bloom with Bloom London Dry Gin \nJolly ThompsonFloralFor a hit of summer in the dead of winter, some gins go big on flowers. Among them are the floral bottlings in the aptly-named Bloom Gin range, developed by one of the world’s first female Master Distillers Joanne Moore. The line’s original recipe, London Extra Dry, balances notes of honeysuckle and chamomile with a touch of pomelo, while the strikingly ruby-hued Jasmine & Rose Gin packs notes of (you guessed it) jasmine flowers and rose petals. We dig them in cocktails like the Rose Bloom, which tangles floral gin with rose liqueur, agave nectar, and strawberry syrup.Eden Mill gets in on the flower action too, with its blush-colored Love Gin. Made in the Scottish seaside town of St. Andrews, it avails both rose petals and hibiscus flowers for a bright and fruity effect. It sparkles in a festive cocktail topped with dry sparkling wine. (That’s English sparkling wine, of course!)Classic Negroni with Highclere Castle Gin \n© 2019 John ShyloskiHerbaceousHerbs are often used to balance out heavy notes of juniper. For example, Highclere Castle Gin restrains its juniper flavor — yielded by fragrant berries grown onsite at the centuries-old Highclere estate — with help from various herbs grown on the property, which has earned modern-day acclaim as the real-life castle depicted in the hit series Downton Abbey. Most prominent is lavender from the Monks’ Garden; originally planted by the Bishops of Winchester in the 9th century, it lends a summery fragrance with hints of lemon. Enjoy a smooth and elegant pour on the rocks, in a classic martini, or in an English reimagining of the classic negroni.St. Andrews Punch with Eden Mill Gin \nCitrusyFor added brightness, citrus is a natural complement to gin. Chase has a duo of citrus-infused offerings: the first, a light-pink-colored Grapefruit & Pomelo Gin, which packs sharp notes of pink grapefruit and pomelo — a perfect companion to sparkling Paloma cocktails enriched with grapefruit and lime juices. Meanwhile, Chase’s zingy Seville Marmalade Gin brings fruity notes reminiscent of a hot cross bun, which add bite to crisp Med Spritz cocktails bolstered with Bianco Vermouth, orange bitters, and tonic water.Looking for something a little different? Eden Mill’s Original Gin, which was voted Scotland's Number One Gin at the 2018 Scottish Gin Awards, is infused with bright-orange sea buckthorn berries that grow within walking distance of its St. Andrews distillery. The berries lend a unique tartness akin to blood orange or grapefruit. It's a blast in St. Andrews Punch, which calls on bitter Aperol and grapefruit and lemon juices.Which British gins will you be sipping this season? Pro tip: Gift a bottle to someone special and you’ll be in their good graces long after the cocktail glasses are empty.To learn more about the very best of UK food and drink, follow @GreatBritishFood on Instagram.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Food Is Great"]}