{"id": "0d53fc69053fbae46bf12aca3f3dd8ec", "url": "https://www.bonappetit.com/recipe/fudgy-brownies", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Fudgy Brownies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueFudgy BrowniesBy Claire SaffitzJanuary 9, 20184.3(30)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintThis recipe uses a whole lot of chocolate and makes a large tray of brownies, perfect for entertaining. Not expecting a crowd? Halve the quantities and bake in an 8x8\" pan.IngredientsMakes 15 largeNonstick vegetable oil spray1cup all-purpose flour½cup unsweetened cocoa powder1½teaspoons kosher salt12ounces semisweet chocolate wafers (disks, pistoles, fèves), or chopped chocolate1½cups (3 sticks) unsalted butter, cut into pieces5large eggs1cup granulated sugar1cup (packed) dark brown sugar2tablespoons vanilla extract2pints vanilla ice creamWhipped cream, maraschino cherries, sprinkles, crushed Oreos, or other toppings (for serving; optional)PreparationStep 1Preheat oven to 400°. Line a 13x9\" baking pan, preferably metal, with foil, pressing firmly into corners and smoothing creases. Lightly coat with nonstick spray; set aside. Whisk flour, cocoa, and salt in a medium bowl (if cocoa powder is very lumpy, sift mixture).Step 2Heat chocolate and butter in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until melted and mixture is smooth. Remove from heat. Whisk eggs, both sugars, and vanilla in another medium bowl until smooth, then whisk into chocolate mixture. For a shiny, crackly top, whisk mixture an additional 10 seconds. Add dry ingredients and whisk just until flour disappears and mixture is smooth and glossy. Scrape into prepared pan and smooth top.Step 3Place pan in the oven and reduce oven temperature to 350°. Bake brownies until lightly puffed in the center and a tester inserted into the center comes out greasy but mostly clean with only a few crumbs attached, 25–30 minutes. Let cool.Step 4Invert pan onto a wire rack, remove foil, then invert onto a cutting board right side up. Cut into squares and serve topped with scoops of ice cream and desired toppings.Step 5Do Ahead: Brownies can be baked 2 days ahead. Store tightly covered at room temperature.How would you rate Fudgy Brownies?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleMade these last night and they came out UH-MAZING!! Everyone at the dinner party loved them. Will definitely be making these again!Jeanette EOjai, CA10/20/2021The consistency of these brownies is the soil of Mars.\n\nNot entirely, but close.\n\nPart of the fault is on me. I didn’t read the full directions because I don’t care.\n\nBut seriously—one part of your directions is “preheat the oven to 400” then several steps later you say “reduce heat to 350”??\n\nIf I were an aspirational pastry chef, maybe I would hang on each step of the recipe. But when you are reading the recipe from your phone to make some hot bark for your sister because you forgot her birthday and she likes Ghirardelli, you really think I’m going to comb through your instructions? You think it’s up to you to punish me for being a bad sibling? I have been punished already!\n\nI took a bite of these brownies and spat into the sink. It was like hot metal. Maybe it’s what I deserve. But I shudder to think Claire Saffitz is the one to administer my humiliation. Please, no more. Don’t change oven temperature in the middle of the recipe. I’m begging you. Luke Farquhar Denver, CO10/3/2021How are you supposed to half 5 eggs?JesseHong Kong11/12/2020What a fabulous recipe!  I'd had a hankering all day for brownies, and these were some of the only ones I could find that didn't call for unsweetened baker's chocolate (like, for real, who casually keeps that on hand).  Glossy top, deep chocolate flavor, definitely rich and decadent, but not overly sweet.\n\nIn terms of salt, I read the reviews below and adjusted accordingly.  I know the BA test kitchen uses Diamond Crystal Kosher Salt.  Diamond has a reputation for being less salty than other brands which is why a lot of chefs like it, but it can be challenging to find in places outside of the northeast.  I had Morton Kosher on hand, used just 1 teaspoon, and found the brownies to be appropriately seasoned without going so far as to be 'salty'.\n\nAlso, I used the microwave to melt the chocolate and butter, rather than doing a double boiler.  Cut the butter into tablespoon pieces, toss with your chocolate (I had chips, which made this easier), and microwave in 30-second intervals, stirring between each cycle until everything melts together.  One less pot to fuss with.Raleigh, NC6/8/2020Great recipe, lovely fudgy brownies. I agree with RubenPoelman that the brownies came out a bit salty. It might be because the recipe is includes a lot of sweet toppings. It makes sense that the saltiness would nicely counterbalance the sweetness. I made the brownies to eat as is, without the icecream, so next time, I will use less salt.ElineChantalThe Netherlands4/29/2020So good !! Very nice and fudgey. Not too sweet and with a hint of salt that I love. I didn't have a big enough baking pan so I had to cook them a bit longer, but I intend on getting a new appropriately-sized baking pan just for these brownies because they are just that good and I can't wait to bake them again. (thank you claire!)lallination4/28/2020I prefer brownies more fudgy than cakey- and these definitely  fall on the fudgy side of the scale! Amazingly chocolatey and a hint of salt. I added pecans as well. Delicious! These will now be my go-to brownies.mirandahrHouston4/17/2020I think I messed up somehow.. the brownies were really undercooked at the 30 minute mark and I ended up cooking them for 45 or so minutes, and they are REALLY salty, I substituted the Kosher salt with keltic seasalt so maybe thats where it went wrong😬 Otherwise the consistency is really fudgy and I love the flavour of these brownies, they just came out really salty somehowrubenpoelmanThe Netherlands4/16/2020CLAIRE! Yes!\n\nThese are thicc. These are fudgy.  These are perfect.\n\nWhen halving, I round up to three large eggs. I always use brown sugar only (sub for white) and bake in buttered, glazed stoneware.\n\nEat with a fork, out of the pan, with milk or coffee. It’ll change your life.AnonymousSeattle4/9/2020This brownies were perfect!!! Fudgy, dense and delicious!! Throughly enjoyed with vainilla ice cream. valucooksChile4/2/2020DELICIOUS! Good work Claire<3 It’s a fav.lil liz3/21/2020This is an AMAZING brownie recipe. Everything you want in a brownie. Fudgy, amazing chocolate flavor, thin crackly top, seriously you can’t (and should not) ask for more. Anonymous10/4/2019Favorite new brownie recipe!Anonymous9/8/2019Made these for a coworker's birthday and they were an absolute hit. Perfectly fudgy. I didn't have enough dark brown sugar so I supplemented with a little molasses and upped the white sugar a bit. I also replaced the semi-sweet with dark chocolate. Not too sweet and perfectly decadent. Charlieleelee7/30/2019I messed up... I completely forgot the butter. Taste was a little lacking but that could’ve been because of the lack of butter... I’m gonna lay off baking for a while now 😂 eggarcia4/2/2019Explore Bon AppétitBrownieBar CookieCookieDessertChocolateOther IngredientsQuickEasyNut-FreeBakingSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Claire Saffitz"]}