{"id": "0d5f051acb5fe4c52d223edecc1ed136", "url": "https://www.bonappetit.com/story/summer-bolognese", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "This Chicken Bolognese Is Fresher, Faster, and Just as Good as the Classic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Summer Bolognese Is Fresher, Faster, and Just as Good as the ClassicCherry tomatoes, chiles, basil, and ground chicken create a sauce that's bright, fresh, and August-approved.By Aliza AbarbanelJuly 30, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailWe know, we know: Bolognese is undisputedly a winter comfort food. Those thick strands of pasta coated in velvety meat gravy are best eaten on cold nights when you want to wrap yourself in a blanket of red sauce and parm. But what if you took all the flavors of bolognese and turned them into a summer-friendly pasta. Well, that would be an amazing dish.This summer bolognese combines cherry tomatoes, chiles, basil, and just enough meat for a weeknight-friendly take on the classic Italian ragù. It was created by senior food editor Andy Baraghani, the genius behind BA’s Best Bolognese (a three-hour, velvety meat sauce made from beef chuck, pancetta, white wine, and whole milk) and Healthyish’s Cauliflower Bolognese (a vegetarian but no less satisfying version that draws richness and texture from chopped-up cauliflower and mushrooms). This latest version uses peak-season produce to create a sauce that’s bright, fresh, and totally appropriate for August. Here’s how it comes together:The sauceMost Bolognese recipes use a minimal amount of garlic (and sometimes none at all), but Andy uses eight thinly sliced cloves to create an assertive flavor without pancetta or beef chuck. Canned tomatoes can introduce too much water, so this recipe uses three pints of fresh tomatoes plus tomato paste to thicken the sauce and create ultra-concentrated flavor. Finally, a fresh chile (we like Holland or Fresno) adds fruity, bright heat to cut through the tomato sauce in a way those crushed red pepper flakes can’t.The meatAndy creates a lighter meat sauce by using ground chicken instead of beef chuck, although ground turkey would also work well here. Ground meat can go rubbery if it’s cooked too hot, so it’s important to go low and slow to create a velvety texture.The pastaWe’re partial to bucatini, spaghetti, or rigatoni for their sauce-soaking abilities, but use your favorite pasta shape. Just be sure to stop cooking when it’s very al dente, so it can finish cooking in the sauce without going limp. (Helpful tip: Aim to take your noodles out of the boiling water about two minutes earlier than the package directions.) Once the pasta is in the pot with the sauce, add a knob of butter, some grated Parm, and ½ cup pasta cooking liquid to bring everything together. The final touch? Two heaping cups of basil, which will wilt and perfume the whole pot.All these elements add up to a Bolognese that’s lighter and brighter but no less satisfying than the winter edition. It’s the kind of Sunday sauce we crave in a heat wave—but could make on repeat throughout the year.It's summer pasta night:Summer BologneseThink of this weeknight-friendly pasta recipe as a lighter take on the classic Italian ragù that features cherry tomatoes, a red chile for some heat, and tons of fresh basil.View RecipeExplore Bon AppétitHealthyishBolognesePastaTomatoRead MoreLifestyle42 Tomato Recipes That Taste Like Summer in Every BiteGallery42 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-30", "author": ["Condé Nast", "Aliza Abarbanel"]}