{"id": "0d688e68b92e60df24b82445f97b4690", "url": "https://www.bonappetit.com/story/maranatha-peanut-butter", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "I Go Through Two Jars of MaraNatha Peanut Butter a Month | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Go Through Two Jars of This Peanut Butter a MonthMaraNatha is so fudgy, it must be magic.By Sarah JampelSeptember 26, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If I’m reaching into my jar collection for a vessel for cold brew or leftover pesto, there’s a 99.999 percent chance it’s an old MaraNatha peanut butter jar (specifically, their organic creamy peanut butter). I’ve gone through so much MaraNatha—real talk: two jars a month—that I have a small fleet of the empty canisters in my kitchen, just waiting for their second life.So believe me when I tell you that MaraNatha peanut butter will ruin you for all others (yes, even your friends Jif and Skippy).MaraNatha doesn’t have any of the added sugars or oils of mass-produced peanut butter—but you wouldn’t know it from tasting it. Even though it’s made with only two ingredients—peanuts and salt—it bypasses the pitfalls of all other “natural” peanut butters (as in, it’s not crumbly, dry, oily, gritty, or pasty). Instead, MaraNatha PB is all silky, velvety smoothness. It’s as creamy as Nutella—soft, spreadable, and all too easy to eat with a spoon. When I asked Joe LaPierre, MaraNatha’s master roaster, what made their peanut butter so...is superior the word? Yes, superior!...he explained that the nuts are roasted in small batches, then double-ground (for extra creaminess!) within 30 days.Some recipes, particularly sensitive baking recipes and light dressings and sauces, will advise you against natural peanut butter. But MaraNatha is so lush I use it everywhere: Of course I spread it generously—on rice crackers, toast, halved steamed sweet potatoes, split Medjool dates—but it’s also versatile enough to bake and cook with. That doesn’t mean I’m above eating this PB straight from the jar (normally, I sprinkle a little salt on each spoonful). If you choose to refrigerate it (there’s no need, but I keep it in the fridge for proximity to the jam), it becomes downright fudgy.One thing to note when buying, either online or at your local Whole Foods: Look carefully at the ingredients listed on the jar. MaraNatha makes many varieties of peanut butter and all of them have similar packaging, which means it’s easy to confuse them. As long as the ingredient list is short and sweet—just organic dry roasted peanuts and sea salt—you know you've got the right one.Sure, MaraNatha is a bit pricier than your average peanut butter. But that’s why I use a budgeting app! And did I mention that you, uh, get a free jar?Buy it: MaraNatha Organic Creamy Peanut Butter, $8 at luckyvitamin.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-26", "author": ["Condé Nast", "Sarah Jampel"]}