{"id": "0d697a12430a525f19fd3db009ca84d1", "url": "https://www.bonappetit.com/story/anthropologie-spring-sale-2018", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "The Best Kitchen Products to Buy at Anthropologie's Spring Sale | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Kitchen Products to Buy at Anthropologie’s Spring SaleAre you in the market for some pastel dinner plates? Yeah, probably.By Zoë SessumsApril 6, 2018FacebookTwitterEmailAnthropologieFacebookTwitterEmailNot to enable you...but Anthropologie is having a huge home sale to kick off spring until April 8. Specifically, that means 20 percent off full-price kitchen products including plates, mugs, and cheese boards. We culled through the patterns and florals to bring you our favorite things to buy this weekend—all under $100.Anthropologie\nHand Painted MugsAvailable in peach, mint, and white, these mugs by Canadian artist Cathy Terepocki are meant to be paired with your go-to warm beverage.Buy It: Cathy Terepocki Ontario Mug, $12 (originally $14)Anthropologie\nPatterned BowlsThese vibrant stoneware bowls are part of an exclusive collection by London-based artist Anna Beam. Their bright and poppy designs will add more excitement to your desk lunch grain bowls.Buy It: Freeform Bowl, $12 (originally $14)Anthropologie\nPie DishIf this buttery apple cake also got you thinking about pie, you’ll need a handcrafted dish that’ll look good when the slices begin to disappear.Buy It: Glenna Pie Dish, $34 (originally $42)Anthropologie\nBrass FlatwareThis five-piece stainless steel, brass, and aluminum set has a nice rose gold sheen. An excellent accompaniment to date night dinners.Buy It: Hettie Flatware, $47 (originally $58)Anthropologie\nCheese BoardChoose your own cheese adventure and invest in your cheese-loving self with this fanciful new board.Buy It: Gemfield Cheese Board, $55-$79 (originally $68-$98)Anthropologie\nFlatware SetWhen you want to throw a dinner party and have all your utensils match, this stainless steel set is one to show off.Buy It: Parkway 20-Piece Flatware Set, $80 (originally $100)Anthropologie\nDinner PlatesFor those of us who seek out beautiful plates to present (and Instagram) our food on, these pastel-colored ones make a nice statement and don’t need to be hand-washed.Buy It: Zephyr Dinner Plate, $15 (originally $18)Anthropologie\nTiered Storage BowlsFor picnics and road trips, these stackable enameled stainless steel bowls are portability at its chicest.Buy It: Tiffin Tiered Storage Bowl Set, $55 (originally $68)Anthropologie\nMini Bowl SetNo matter if you lean toward salty, cheesy, or sweet, display your snacks in these mini teak bowls. They’re light, simple, and encourage easy entertaining.Buy It: Teak Mini Square Bowl Set, $20 (originally $24)Anthropologie\nKnife RackIf you’ve amassed a knife collection to display with pride, here’s a visually appealing option that strays from the typical utilitarian magnet look.Buy It: Mounted Knife Rack, $28 (originally $34)Your cheese board could use these crackers:Explore Bon AppétitShoppingRead MorerestaurantsWe Go to This Restaurant Just to Stare at the CeramicsBy Zan RomanoffshoppingThe Best Dutch Ovens at Every Price Point According to Bon Appétit EditorsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-06", "author": ["Condé Nast", "Zoë Sessums"]}