{"id": "0d6aa6137ffa889b921fa0e286e9dbfc", "url": "https://www.bonappetit.com/story/krista-scruggs", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Krista Scruggs Is Making the Most Exciting, Most Delicious Natural Wine Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleKrista Scruggs Is Making the Most Exciting, Most Delicious Natural Wine Right NowShe's become a star of the natural wine world. But she’d prefer you focus less on her and more on what’s in the bottle.By Marissa A. RossJanuary 17, 2019FacebookTwitterEmailIllustrations by Stephanie DeAngelisFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.I was at a party in Oakland last spring when I first tried Krista Scruggs’ wine. It tasted like a pineapple that had been salted, lightly misted in tanning oil, and struck by lightning in the bottle. It was tropical and inviting but with such racing acidity that I was lusting for another glass before I finished the first. “Who made this?!” I cried. The crowd parted, and there was Krista Scruggs.The wine was a bone-dry pétillant-naturel, one of those crown-capped sparkling wines that finishes its single fermentation in the bottle to create carbonation. But Scruggs’ provocatively titled “Jungle Fever,” made from La Crescent—a white grape that oscillates between laser acidity and ripe fruitiness—had a continuous beady effervescence that could rival anything you brought back from France. It was one of five releases from Scruggs’ first vintage of her Vermont-based label, Zafa, which is named after the word for a good-luck charm in Junot Díaz’s The Brief Wondrous Life of Oscar Wao. Her all-natural operation produces wines and ciders and also blends the two to create vinous ciders, an increasingly cool category in the natural wine world. I couldn’t get any of them out of my head.By the time I got to Vermont to drink more, ahem, I mean, write about the wildly intoxicating Zafa releases, Scruggs had become the hottest name in natural wine since Action Bronson did that Facebook video with Frank Cornelissen. Articles painted her as a “rule breaker” and a “trailblazer,” and now,\na mere six months after she’d poured her first glasses of wine for the public, she was named one of Wine Enthusiast’s 40 Under 40 Tastemakers of 2018. It was a come-up most winemakers could only dream of. But for Scruggs—a black queer female winemaker—it didn’t feel supportive; it felt slanted. “There is this narrative that I’m this poor black girl from Oakland who got plucked out of a wine bar, started making wine in Vermont on a lark, and became an overnight success,” Scruggs said from the driver’s seat as we started the two-hour drive from her wood-paneled studio apartment in Burlington to the expansive hillsides of Barnard. “I’m from Fresno, from central California’s farming belt,” she told me with equal parts pride and exasperation.The kaleidoscope of Zafa Wines's hybrid grape offerings.\nPhoto by Marissa RossScruggs rarely speaks without passion, but there is nothing she is more fervent about than farming. Her grandfather had a farm in Visalia, California, when she was growing up, and she would spend every weekend working either on his land or in the garden with her grandmother. After two years as the shipping coordinator for one of the largest wine companies in the country, Constellation Brands, Scruggs decided to work a harvest in France. She came back knowing that she wanted to own land, to farm it, and to be not just a winemaker but also a vigneron, the French term for grape farmer. And it deserves a fancy French word because there are plenty of winemakers who don’t grow their own grapes, but Scruggs does. “Farming is a part of me, a part of my story,” she says. “When you understand that, it makes sense why I make wine in Vermont—because it’s impossible to farm in California today.”As a Golden State native who covers wine from Los Angeles, I know she’s right. There’s not enough land, and the land that there is, no one has enough money for—not to mention climate change and the wildfires. In 2016, Scruggs met Vermont winemaker and visionary Deirdre Heekin at Oakland wine bar Ordinaire, where Scruggs had taken up hanging out and honing her palate. Within the year Scruggs had moved to Vermont and become the assistant winemaker and farmhand at Heekin’s winery, La Garagista. In 2017 she made the first vintage of Zafa, her own wine, sourcing grapes from one of La Garagista’s vineyards and foraging wild apples around Mount Hunger. Last year she converted a conventionally farmed vineyard to biodynamic practices by working more than 100 days straight. “I don’t think it’s ‘overnight success’ to work your ass off for eight years, for up to 120 hours a week, making $15 an hour. But people don’t want to hear that,” Scruggs said. She shook her head, shifting anxiously under her seat belt.“It's not ‘overnight success’ to work your ass off for eight years, for up to 120 hours a week, making $15 an hour.\"“Instead of talking about my farming or my wines, I’m spotlighted for my race and my gender because that is the story people want,” Scruggs told me as we drove through the broad strokes of green on Interstate 89. “I’m proud of those things, and I’m happy people want to highlight them because it means they are acknowledging that I have struggled more in a homogenized industry. But they want the angle for a story without ever getting to know me, or they want my name in their portfolio without ever trying my wines. They say they ‘need’ me, meaning ‘We need someone who looks like you doing what you’re doing.’ They’re commoditizing the fact I’m a black woman in Vermont. It doesn’t just undermine the last eight years of my life, it erases my history, which already happens as a black person.”She parked the car outside our first stop, winemaker Todd Trzaskos’ Stockbridge farmhouse, and sighed, giving each of her eyes a single swipe with the heels of her palms. By the time she hopped out of the car, she was back to wearing her infectious trademark smile.The sun-dappled vines at La Garagista\nPhoto by Marissa A. RossThat day in central Vermont was the most incredible day I’ve ever had tasting wine in America. At Trzaskos’ we drank vibrant La Crescent and Marquette from huge glass jugs that caught the early September light, illuminating the room in neon pops of gold and coral. In the idyllic Tuscan barn of cult cider producer Fable Farm Fermentory, we had a long lunch of fresh greens and stews and a dozen other delicious things I can’t remember because I was so enthralled by the bottles on the table. We topped it off with dinner at La Garagista, a property so beautiful with vines and colorful bursts of flora and damigianas tucked along garden paths that I would need to double my word count to do it justice. Heekin’s biodynamic paradise is where she has produced some of the most acclaimed and beloved American wines of the last decade, elevating hybrid grapes out of obscurity. I drank a bottle of La Garagista’s “Stolen Roses,” a stunning sparkling rosé made by fermenting cider on top of red wine pomace that smells like ripe wild strawberries, white lilies, apple blossoms, and lavender, and tastes like a field of raspberries with pomegranate arils and sprigs of rosemary crushed under bare feet. There was no questioning that this was where Scruggs cut her teeth.On the drive back to Burlington, Scruggs raved about La Crescent and ranted about how underrated it was. She lamented over exes and excitedly told me of new releases she was dedicating to new loves. Near tears, she gushed gratitude for her community in Vermont: Her friends who produce Shacksbury, one of Vermont’s most popular ciders, gave her a personal loan to open her new cellar and tasting room in Burlington, and her apple supplier, Carl Cobb of Canamak Farms, helped her secure a lease of 40 acres on Grand Isle to plant ten acres of vines and two acres of apple trees.“I am one of the luckiest people in the world in that I actually get to do what I want to do. I get to create, and there is nothing more beautiful than that.”\nShe paused. “But I’m away from my family, I’m away from anything that looks like me. If that is the cost for me to farm and make wines with purpose, then that is the cost. All I can do is keep doing what I’m doing and let my work speak for itself.”And it does. Zafa’s first vintage tells a tale of tug-of-war between California and Vermont, from “Against All Odds,” a vinous cider that tastes like an electrified Dole Whip, to “No Love Lost,” another vinous cider made with Frontenac Noir that’s like sipping on a spiced cider wrapped in a fuzzy blanket of tannins next to a fire crackling with acidity, to “Anchors Away,” a straight Frontenac Noir that tastes like an experimental track at the end of an album. Its notes of savory barbecue, honey, and violets leave you wondering, and waiting for, what Zafa will release next and what story it will tell.Explore Bon AppétitThe Healthyish 22Healthyishnatural wineWineVermontprofileRead MoreLifestyle11 Natural Wines That Taste as Good as They LookGallery11 SlidesBy Marissa A. Ross and Emily EisenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Marissa A. Ross", "Emily Eisen"]}