{"id": "0d6c1cdfccb3a5fb0e4f2b222c45f56b", "url": "https://www.bonappetit.com/story/spice-cabinet-organizer", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "The Best Spice Rack for Small Spaces | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Serious About Kitchen Organizing, You Need This Spice RackFit a big spice collection in a small space.By Jarrett MelendezDecember 14, 2020FacebookTwitterEmailPhoto Courtesy of YouCopiaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Before I got serious about organizing my kitchen, I’d engage in the same ritual every time I cooked or baked. Jar by jar, I’d pull out every row, looking for the dried thyme, or cinnamon, or that great spice blend. Then everything would get shoved back into the cabinet in no particular order. Inevitably, a spice would get lost somewhere in the back, and I’d assume we were out and buy more.I was used to doing the minimum spice storage, keeping them in their airtight containers, stored away from light and heat. Wasn’t that enough? Well, no, Jarrett, that’s why you have three jars of dried dill. (True story.)It was time for a change. I wanted something that took advantage of the height and depth of the shelves in our cabinets and pantry. Lining up 2- and 4-inch tall jars on a shelf with 12 inches of clearance is a waste of precious vertical space!So after looking at a couple of pages of search results, I found the YouCopia SpiceStack. Compact and low profile, it fits easily in a small cabinet, on pantry shelves, or even on a countertop. It holds a minimum of 24 standard, square or round, 4-inch tall spice jars, or up to 48 2-inch tall jars. If you’re blessed with lots of vertical space and an abundance of spices, buy two: They’re designed to be stackable. The unit comes in white or granite, and the drawers’ dividers can be adjusted, or even removed, to accommodate jars of nearly any height.But it’s not just that  the SpiceStack takes advantage of vertical space—plenty of spice racks do that. It had many other attributes I hadn’t even considered. If you need to keep it in a higher cabinet, the drawers pull out and hold in place at an angle to bring the top tier down to eye level and all of the spices within reach. Because it comes with labels, though, you never have to guess what’s where. Don’t stress: The whole unit has nonslip feet so you don’t have to worry about pulling it off the shelf when you slide out a drawer.Since buying this spice rack, I no longer have duplicates or triplicates of any spice or herb—but that hasn’t seemed to stop our spice collection from growing. Looks like a second SpiceStack is in my future.YouCopia SpiceStack$40 at AmazonJarrett Melendez is a graphic novel writer and former cook living in Boston with his partner, Stuart, and their collection of plush pigs.Explore Bon AppétitSpiceGet OrganizedToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-14", "author": ["Condé Nast", "Jarrett Melendez"]}