{"id": "0d75bdf080308699a59aba04daa3b996", "url": "https://www.bonappetit.com/story/le-creuset-provence-purple", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Le Creuset Introduces Vibrant New \"Provence\" Purple Color | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLe Creuset Introduces Vibrant New \"Provence\" Purple Color2018's color of the year is already popping up everywhere.By Melissa MintonJanuary 3, 2018FacebookTwitterEmailsurlatable.comFacebookTwitterEmailLe Creuset may be the foremost expert in enameled cookware, especially those of the Dutch oven variety, but the venerable French brand also keeps it fresh with the most on-trend colors. The latest shade that will dominate your kitchen in 2018 is an ombre purple to pale lilac, dubbed \"Provence,\" according to Refinery29.The name likely comes from the fields of lavender that line the French countryside and bloom in the summer months. And in what might just be a happy coincidence, the purple shade is perfectly timed: In December, Pantone announced the 2018 color of year as, you guessed it, \"Ultra Violet.\" Though the Pantone shade is a bit of a deeper blue–based purple than any of the gradient shades in \"Provence,\" the Pantone Color Institute has apparently nailed yet another year's trends.Purple's recent popularity shouldn't really come as much of a surprise. Pantone created a custom purple shade in August 2017 to honor music legend Prince, and the hue has long been associated with royalty—just in case you were wondering what to gift Prince Harry and Meghan Markle for their upcoming wedding.\"Provence\" is not the first time Le Creuset has branched out into special color offerings. In 2017, the brand launched millennial pink pots and pans, catnip for the Instagram-obsessed, and Snow White–themed cookware for Disney fanatics. \"Provence\" is now on sale exclusively at Sur La Table, where it can be seen on everything from the signature Dutch ovens to a flower-shaped cocotte, covered baker, and more. Just, please, learn how to properly clean your Dutch oven before you invest in your new set of lilac cookware.How to clean a Dutch oven:Explore Bon AppétitShoppingToolsTrendsRead MorecookingHow to Clean Your Dutch Oven (Without Ruining It)By Marian Bullrecipes58 Dutch Oven Recipes for Pastas, Braises, Breads, and MoreGallery58 SlidesBy Bon AppétitcultureLe Creuset Releases a Line of Millennial Pink CookwareBy Zoe WeinercultureLe Creuset Is Releasing Some Magical Snow White-Themed CookwareBy Evelyn WangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Melissa Minton"]}