{"id": "0d79a2c8d31f3ad33c68ad07812725ef", "url": "https://www.bonappetit.com/story/heartbeet-cake", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "This Chocolate Beet Cake Is Super Decadent  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOur Hearts Are Beeting For This Super-Decadent Chocolate CakeSee what we did there? Oh, and it happens to be gluten- and dairy-free.By Anna StockwellFebruary 7, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailI have to confess that the idea for this recipe began with the name. I wanted to make something that I could call a Heartbeet cake, so I created a recipe that uses the lowly beet to add a gorgeous red tint and a super-moist, buttery texture to an already decadent chocolatey base. Of course, I also wanted the cake to taste amazing, and it does. I fed a slice to someone who claims to hate beets, and she loved it. I didn’t tell her about the beets until she asked for more.Using beet purée in chocolate cake is not a new trick—the earthy sweetness of beets blends well with dark chocolate. But I specifically wanted a gluten-free chocolate beet cake, because I can’t eat gluten…and, well, this is Healthyish after all.I try to avoid using gluten-free flour blends as much as possible because every brand produces slightly different results, so it’s hard to promise consistency. For this cake, I turned immediately to almond flour, which my co-worker Chris also used in everyone’s favorite gluten-free carrot cake. I love the taste of it, but also and I feel better about eating a dessert made with high-protein almond flour rather than grain flour. As I experimented in search of my dream Heartbeet cake, I found that baking with beet purée and almond flour together meant I hardly needed to add any fat to the cake at all. The natural fat of the almond flour plus the moisture of the beet purée gave the cake everything butter could. So I cut dairy from the cake as well, and made it with just a little bit of virgin coconut oil melted in with the chocolate.Vegan readers, I’m sorry to say that there are eggs in here. The excellent structure of the cake is thanks to the sorcery that happens when you beat eggs and sugar to what bakers call the “ribbon stage”: light in color, tripled in size, and the batter falls of the whisk slowly in a ribbon-like shape when you lift the whisk out of the bowl. You need an electric mixer (handheld or stand) to achieve this unless you have hulk-like arm-whisking skills. Using this as the base of my cake gives it a light and airy crumb and holds it all together without any mysterious gums or thickeners to replace the gluten.My editors stopped me from baking my Heartbeet cake into the shape of a heart (but if you want to go there, double the recipe and bake one half of the batter in a square pan and one half in a round and follow this method to turn them into a heart). Yes, I’m going to be making this cake for Valentine’s Day, and I’m going to sprinkle it with gold luster dust because why not? I might even make it in the shape of a heart. But this cake isn’t just for Valentine’s Day. It’s just an excellent gluten-free, dairy-free chocolate cake, and a very good way to use up those beets in the bottom of your crisper drawer. Whether you share the secret ingredient with your beet-hating friends is totally up to you.Go ahead and pre-heat your oven:Heartbeet Chocolate CakeEarthy-sweet beet purée gives this gluten-free chocolate cake a beautiful red velvet hue.View RecipeExplore Bon AppétitHealthyishHealthy DessertsChocolateCakeBeetRead MoreLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-07", "author": ["Condé Nast", "Anna Stockwell"]}