{"id": "0d8f296455b4372df7343498b0fb5858", "url": "https://www.bonappetit.com/recipe/extra-juicy-turkey-burgers", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "Extra-Juicy Turkey Burgers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueExtra-Juicy Turkey BurgersBy Claire SaffitzFebruary 20, 20184.2(61)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintTurkey burgers always sound like a great idea, but they too often taste like a fat sawdust patty. No more, friends! Mashing avocado into the turkey mixture helps prevent the meat from shrinking and drying out during cooking, which is why these stay awesomely juicy, even when they’re cooked all the way through.IngredientsMakes 42avocados, divided2tsp. Worcestershire sauce1tsp. garlic powder1tsp. ground cumin3Tbsp. plus ½ cup mayonnaise4tsp. Sriracha, divided1½tsp. kosher salt, plus more½medium red onion, divided1lb. ground turkey4Tbsp. extra-virgin olive oil, divided, plus more for greasing3cups very thinly sliced red cabbage (from ¼ medium head)2Tbsp. fresh lime juice, divided4hamburger buns, toastedPreparationStep 1Mash half of 1 avocado with a fork in a medium bowl until smooth (reserve remaining half for topping burger). Add Worcestershire, garlic powder, cumin, 3 Tbsp. mayonnaise, 2 tsp. Sriracha, and 1½ tsp. salt. Grate half of the onion (as in, half of the half, or one-quarter of the whole) on the medium holes of a box grater into bowl. Mix with a fork to combine. Add turkey and mix thoroughly with clean hands until mixture is homogeneous (it will feel very wet and soft, which is okay).Step 2Drizzle 1 Tbsp. oil on a large plate. Using oiled hands, form turkey mixture into 4 balls, place on plate, and press down into patties 4–4½\" across (they’ll shrink as they cook). Chill, uncovered, at least 10 minutes and up to 2 hours (this step will help keep them firm). If chilling for more than 2 hours, cover with plastic and chill up to 2 days.Step 3Meanwhile, stir remaining ½ cup mayonnaise and 2 tsp. Sriracha in a small bowl and season with a pinch of salt.Step 4Thinly slice remaining onion and toss with cabbage in a medium bowl.Step 5Heat 2 Tbsp. oil in a large nonstick skillet over medium. One by one, carefully slide patties off plate into skillet. Cook, shaking skillet a couple of times to make sure patties aren’t sticking, but not pressing down on them, until dark brown underneath, about 5 minutes. Turn and cook on second side until burgers are fully cooked, about 5 minutes more. Transfer to a wire rack and let rest while you finish assembling.Step 6Thinly slice remaining 1½ avocados. Add lime juice and remaining 1 Tbsp. oil to cabbage mixture and toss to combine; season with salt.Step 7Divide Sriracha mayo among cut sides of buns, spreading to edges. Place patties on bottom buns, then shingle avocado slices over. Heap slaw over avocado, then close burgers with top buns.How would you rate Extra-Juicy Turkey Burgers?Leave a ReviewTell us what you thinkReviews (44)Back to TopTriangleExcellent turkey burger!  Easy recipe and everyone enjoyed.  Used shallots instead of onions since that is what I had on hand.  We chilled the patties for about 60 minutes, put on a hot griddle and allowed to get nice and brown before turning.  They stayed together very well. Will make again!R WaltonKY8/25/2021My daughter and her boyfriend highly recommended these burgers so we thought, why not? I was suspicious putting the recipe together but followed the directions to the letter and man, were they fantastic! We made it again last night for the second time with the same results. I am not going to bother reading why someone would put up a negative review. Just go for it!Anonymous West Hartford, CT8/8/2021The haters here are tripping - who in their right mind makes a ground meat based recipe and expects crunch??  \n\nThese things absolutely rule, we've probably made this recipe close to a dozen times now.  I suggest squashing your patties a little flatter than you think as these do contract and rise a fair bit over heat.  Chilling does help, but these guys can be fragile in the pan and will split if you're rough with them.  With a metal spatula and a gentle touch however, an intact flip really isn't too hard after a good 5 minutes per side and getting a nice brown crust to help hold things together a bit.  \n\nAnyway I implore you not to let the haters turn you off of giving this a try, it's always one of my favorites in the dinner rotation.  TYLER D12/18/2020100 percent the BEST turkey burger I've made at home -- well-seasoned, juicy, and so easy to whip up on a week night! Went off book and used some pickled red onions and fresno chiles on top, and would do so again in a heartbeat. Agree that the time in fridge is vital for good texture! Josh HIndianapolis10/7/2020I have made this recipe time and again - with turkey and with Beyond meat. It has been tried and true across many a dinner and family grillout. The key to making this not super mushy/catfoody/meatloafy is REFRIGERATION, y'all! I refrigerate these babies for 30 mins AT LEAST. I will say I tried this with Impossible Meat the other day and it was weird - really tasted the Worcestershire, which was unpleasant. AnonymousMinneapolis8/27/2020Great recipe! Followed the recipe exactly and they came out amazing. Does it look like cat food?, yes it did but they looked like turkey burgers after cooked so don't worry. To the person that commented below me from LA. I think your cooking skills need a look in the mirror. Art is in the eye of the beholder but your blind. If your going to change a recipe then proceed to insult the people that came up with it, your the one at fault. I recommend taking cooking lessens, learning different textures and tastes and how different ingredients can be replaced.\nSo here's a couple other tips\n 1. don't cut down on ingredients, because you like #crunchylife.\n2. Don't add to the recipe and blame the recipe for it not tasting good.\n3. You don't need a ripping cast iron pan to cook. High heat and a little love can care goes a far way.\n4. I recommend trying the recipe again and actually having some fun and love with it. After all love is the best ingredient. \nWell thats all I have to say. Try it yourself but as far as my comments go, it's an amazing recipe with some great imagination. Try it people becuase this sh!t be good. Enjoy and have fun 😉! Happy cooking. DJP123CONNECTICUT8/27/2020This is atrocious. An embarrassment. In the original article where this recipe is cited, Claire says this is Carla Lalli Music’s favorite turkey burger ever. Carla, what cold hell have you been living in?! Claire, how could you do this to us?! A bird died for this! Followed the recipe, but included slightly less avocado and mayo than recommended because mushy things are my mortal enemy (#crunchlyfe). After refrigerating the patties for an hour and them not becoming firmer, I let the cast iron rip. I continued in good faith. If for nothing else than for our fowl friend not to have died in vein. The patties became cracked and sort of fell apart when I flipped them. Not to worry, I told myself as I topped them with my thickly sliced cheddar of choice. I put them under the broiler to get the best possible cheese bubble/crispy edge quotient. Then we went to the bun. My topping game differed from the recommended ingredients (I’m more of a lettuce, tomato, pickles gal). First bite - COMPLETE mush. I’m talking 18th century orphanage gruel level mushiness. I returned my patty to the broiler after extricating it from the bun to nuke it beyond recognition, and it was still the texture of patè or nduja on the inside. After the recent Bon Appetit scandals in the news, I was waffling about how I felt. Now I’m just mad because this recipe is grossly negligent to the lives of turkeys and turkey burger cravers everywhere. Everyone involved in the publishing of this recipe needs to take a hard look in the mirror. Los Angeles 7/8/2020Love this recipe! The Anonymous person from Washington DC does not know how to cook. The uncooked turkey mixture did not look appealing but you're not gonna eat it like that. I followed the recipe and my burgers were very juicy. Rock on Bon Appétit!selftaughtchefRound Rock, TX7/4/2020Amazing recipe and the best juiciest turkey burger ever. Thank you BA! Definitely a keeper! I improvised a little and left out the cabbage. Instead, I did a roasted red pepper and side of roasted asparagus (salt, pepper and parmesan cheese). Turned out like a great combination with this delicious turkey burger! Anonymous6/27/2020Sadly worst BA recipe I've tried. Agree with other users who say this should be taken down. The mixture just created a catfood like mush that was hard to cook and tasted like sawdust. Solid pass. AnonymousWashington, DC 6/19/2020These were tasty but falling apart. We liked the toppings and seasonings but we made some without mayo and avocado in the patty, and those held together much better.AnonymousChicago6/7/2020Juicy yes. Burger maybe. Mine came out a bit more like meatloaf. Daughter dislikes meatloaf.  Wife and I ate hers. AnonymousStamford ct5/27/2020The flavors were on point, but it was probably one of the mushiest burger concoctions I've ever assembled. Luckily, after sitting in the refrigerator for a few hours, it held up enough to make it to the grill. Less avocado next time?\nAnonymous5/26/2020Blown away by these burgers! I am not a big fan of any type of burger other than beef but was looking for a lighter option. I'm totally impressed! We opted for a lettuce burger, added red onion, and covered in Frank's hot sauce. Will absolutely be making these again. I might only do 1.5-2 Tbsp of mayo though...they're so juicy I didn't think they needed all 3 Tbsp. regansanderspensacola, florida 5/20/2020We made these last night for dinner....served on butter lettuce rather than buns.  We also added bacon and feta cheese.  Really, really tasty.  I made the patties about 3 hours before cooking, which I think helped them stay together during cooking.  They're soft, so you really have to just let them cook on one side until you see about half the patty is cooked through, prior to flipping, or they'll fall apart.  Definitely going to make again - i think i might try yogurt or sour cream instead of the mayo for the additional sauce.  We also added lime juice to the sriracha mayo mixture - which I think helped cut the richness.  If you don't have cabbage - i think it would be great with apples or an apple slaw.  Might try that too!  Melissa Huston4/29/2020Explore Bon AppétitBurgerAmericanGround TurkeyTurkeyPoultryEasyMainNut-FreeHealthyishSautéFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Claire Saffitz"]}