{"id": "0da4b9d5ecd3424f47e2fa9067a4c6e9", "url": "https://www.bonappetit.com/recipe/slow-cooked-squid-with-olives-and-herbs", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Slow-Cooked Squid with Olives and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSlow-Cooked Squid with Olives and HerbsBy Chris MoroccoFebruary 13, 20184.7(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyEmailPinterestPrintEmailPinterestPrintCervo’s restaurant in Manhattan serves a braised squid that is so rich we had to take a stab at our own version of the recipe. Slow-cooking breaks down the squid’s collagen so you’re left with fork-tender flesh and a tomato sauce infused with rich, briny flavor.Ingredients4 servings1½lb. cleaned squid1½oz. smoked Spanish chorizo, thinly sliced (about ½ cup)1shallot, thinly sliced4garlic cloves, thinly sliced4oil-packed anchovies1red Fresno chile or jalapeño, thinly sliced4Tbsp. extra-virgin olive oil, divided, plus more for drizzling128-oz. can whole peeled tomatoesKosher salt, freshly ground pepper4thick slices sourdough bread1cup parsley leaves with tender stems½cup mixed pitted green olives, torn if large2Tbsp. fresh lemon juicePreparationStep 1Preheat oven to 250°. Separate squid bodies from tentacles. Cut bodies into ¾\"-thick rings and cut tentacles in half crosswise. Rinse well in a bowl with several changes of cold water. Drain squid and pat dry.Step 2Cook chorizo, shallot, garlic, anchovies, chile, and 2 Tbsp. oil in a medium Dutch oven or other heavy pot over medium heat, stirring often, until chorizo is softened but not yet beginning to crisp and shallot is softened but not yet browned, about 5 minutes. Add tomatoes, finely crushing with your hands as you go, and their juices and squid and bring to a simmer; season lightly with salt and pepper. Cover pot and transfer to oven. Cook until squid is very tender and sauce tastes concentrated, 2–2½ hours. (Uncover the pot for the last 20–30 minutes to allow sauce to evaporate and thicken if needed.) Taste and season with more salt and pepper if needed.Step 3Toast bread until very crisp; drizzle with oil. Place in bowls and top with squid and sauce. Toss parsley, olives, lemon juice, and remaining 2 Tbsp. oil in a small bowl; season lightly with salt. Spoon over squid.Step 4Do Ahead: Squid can be cooked 1 day ahead. Let cool; cover and chill.How would you rate Slow-Cooked Squid with Olives and Herbs?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWe were lucky enough to get some fresh longfin squid. I looked for a recipe, as I have never made squid before. My husband and I like the ingredients listed and gave it a try. We followed the recipe and cooked for 2 1/2 hours. It was so delicious. The squid was extremely tender and the flavor was smoky tomato goodness. The parsley garnish was even better the next day. I wish I could add a picture. When we have access to fresh squid again, we will definitely be using this recipe. AnonymousWisconsin 4/14/2019Delicious recipe, however, I find that the 2+ hour cooking time is simply not necessary. I've made this recipe exactly, except I just kept it on the stovetop on a low simmer for about 30 mins rather than putting it into the oven for 2 hours. It was amazing! The squid was still super fork tender and almost melted in your mouth. Just an FYI in case others, like me, do not have 2+ hours to prepare a meal, but also don't want to chew on rubberbands. AnonymousNYC1/16/2019Great recipe and so simple!Anonymous3/27/2018Made this for a Sunday afternoon game day. Really interesting layering of flavor. I used a vegan chorizo (sorry! ) but I don't think it suggered for it. The olive/lemon/parsley topping adds a bright, salty note to the smokey and subtly briny flavor of the squid. Served it from a pot on the stove and let people cover their own bread and add topping. Considered adding feta, but didn't. The texture of the squid is utterly transformed. A guest described it as badass. Apt. AnonymousSaint Paul, MN 2/26/2018Explore Bon AppétitMediterraneanSquidShellfishSeafoodChorizoSausageMeatOliveOther IngredientsOne-Pot MealsMainDairy-FreeNut-FreeHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}