{"id": "0daec84631b667415ca43378b3321b97", "url": "https://www.bonappetit.com/story/never-fail-grilled-scallions", "year": 2018.0, "month": 6.0, "day": 5.0, "content": "I Make Grilled Scallions at Every Cookout, and Will Until the End of Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make Grilled Scallions at Every Cookout, and Will Until the End of TimeScallions deserve the chance to take a leading role. Let them shine.By Alex DelanyJune 29, 2018FacebookTwitterEmailAndrew KnowltonFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I don’t know if you’re supposed to feel sympathy for vegetables, but I’ve always felt bad for scallions. Sure, plenty of people use scallions in plenty of dishes. But they usually get chopped or sliced into little pieces, pigeonholed as a base flavor or finishing touch to a dish—a tertiary character in a larger story. They’re always part of the thing, never the thing. Which is why, when summer rolls around and the grills of the world get fired up, I always make grilled scallions the thing. If you see me in front of a grill, I can guarantee that a plate of scallions is not far away.Grilling whole scallions is the ultimate tribute to a type-casted vegetable. It is proof that they are worthy of being served as their own dish, treated like any other green vegetable. They have substance, and they can serve as one of the best cookout sides there ever was or will be, prepared simply with a bit of olive and salt and topped with whatever you have on hand. Plus, grilling scallions is easy. Kindergarteners could do it. They shouldn’t. But they could.Here’s how you, someone who made it through kindergarten quite some time ago, can grill some scallions when the opportunity arises. (If you are a kindergartener reading this: WOW! Very impressive. Does your mom know that you're using the computer to read articles about grilling? Maybe just go make sure, okay?) First, you slice the scallions in half lengthwise. (That means up the stalk, from tip to green.) This exposes the layered interior of the scallions, which means that more of the onion's surface area will come in contact with the heat of the grill, which is a good thing.And speaking of the grill, we want it to be ripping hot. After tossing the scallions in a little olive oil and kosher salt, you can throw them on the grill in one of two ways. You could dump the scallions directly onto the grate, which affords you maximum fire-to-allium exposure. Or you could put a grill topper or basket down to minimize the number of scallions that slip through the grill grates and get sacrificed to the charcoal. Either way, you cook the scallions for about 5 minutes, flipping them once or twice, until they pick up a heavy dose of color. Since the scallions are sliced in half, the pale bottom parts will cook just as quickly as the more tender greens. The scallions will become tender and delicious very quickly—this is really about charring the outsides to your desired level of charred-ness.Charred scallions: great with some pork.\nSo you have these tastefully-charred, beautifully-tender grilled scallions—now what? You could eat them exactly as they are. And they’d be great. But finishing them with another element is what really makes them feel like a true dish. Drizzling them with a little bit of a vinegar-forward hot sauce and sprinkling some toasted sesame seeds overtop is a classic move that never disappoints. But if you’re feeling a little frisky, you could also toss them all in a simple vinaigrette and finish them with some lemon zest. Then you serve them alongside whatever protein you were grilling—chicken, fish, steak, whatever. Basically you can just treat them like you would any other grilled or roasted vegetable and watch the crowd go wild.And that’s what this is really about: We need to give scallions a shot. We need to let them go a step beyond their identity as a garnish or an aromatic. Grill them. Serve and eat them whole. Let them sing the songs they were meant to sing. Scallions won’t let you down. They’ve been waiting for this.That hot sauce and sesame seed situation is waiting:Grilled Scallions with Hot Sauce and Sesame SeedsView RecipeExplore Bon AppétitBasicallyGrilled VegetablesGrillNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-29", "author": ["Condé Nast", "Alex Delany"]}