{"id": "0db9fd0ef558eaeb8615c30b321ba98d", "url": "https://www.bonappetit.com/story/barbies-sweet-glazed-carrots", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "These Maple Syrup Glazed Carrots Are Always on Our Holiday Menu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Cousin’s Ex-Girlfriend’s Sweet Glazed Carrots Are Still on Our Holiday MenuSome dishes are meant to last, some relationships aren’t.By Alex BeggsNovember 13, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailIt all started with Barbie. Not the plastic one, but Andy Baraghani’s cousin’s girlfriend who none of us know. Though in a way, all of us know her: the brave Thanksgiving newcomer. Over two decades ago, Barbie showed up to Christmas dinner with these shimmering, syrupy sweet, roasted-to-smithereens carrots that entranced the Baraghani family. And while some loves fade, others only strengthen. Which is why after the breakup, Barbie’s carrots remained on the Christmas menu. A part of the family.“Honestly she did sort of look like a Barbie. I was a closeted six-year-old and I was obsessed with her,” Andy told me. “Plus, that was the year the Barbie girl song came out.” That’s all the historical context you need, folks.Here’s the recipe context you need: The carrots got tossed with cold pats of butter, heaps of sugar, drowned in maple syrup, and then they steam in the oven for HOURS. When served, the carrots would fall apart. In some ways this was good, for family members with sensitive teeth, but in other ways it wasn’t perfect: the carrots would never take on that thick, glazy, caramel sauce.So when Andy was telling us about this dish, we knew he had to develop it for Bon Appétit, to honor Barbie, wherever she is now. This wasn’t the time to go full Andy—adding nuts, chiles, fistfuls of herbs, various zests—but he could make the recipe technically better, and more balanced in flavor. Ultimately, it needed to be a simple roasted carrot dish, unapologetically sweet, primally satisfying. The kind of Thanksgiving side that sticks around longer than some relationships.Andy’s recipe goes like this: Scrub some carrots, trim their hats, chop them into cool asymmetrical chunks or leave them artfully whole, but DEFINITELY leave them unpeeled (purely aesthetic decision). Toss them in a foil-lined baking sheet with brown sugar, maple syrup, butter, and red pepper—that little bit of heat helps tone down the extreme sweetness. Instead of a long, slow roast, bake them at 400° for around an hour—tossing every 20 minutes. Tossing the carrots in the sugar-butter mixture will give them that glazed sheen that makes them irresistible. A sprinkling of flaky salt adds a bit of crunch and an Andy touch. If only Barbie knew.Get the recipe:Maple-Roasted CarrotsThese are the glaziest, most addictive carrots you’ll ever eat.View RecipeExplore Bon AppétitThanksgivingCarrotSideMaple SyrupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Alex Beggs"]}