{"id": "0dce79464899d9c10988ddce69b03f6c", "url": "https://www.bonappetit.com/recipe/collard-greens-salad-with-fried-plantain-and-sumac", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Collard Greens Salad With Fried Plantain and Sumac Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueCollard Greens Salad With Fried Plantain and SumacBy Ashleigh ShantiApril 14, 20204.5(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintCollard greens aren’t just for braising; use them in this anytime-of-day salad, thinly sliced and tossed with a sweet and tangy dressing. This recipe is from chef Ashleigh Shanti at Benne on Eagle in Asheville, NC.Ingredients4 servings 1cup vegetable oil1ripe plantain, peeled, sliced ¼\" thick¼cup extra-virgin olive oil3Tbsp. sherry vinegar or red wine vinegar2Tbsp. fresh lime juice2Tbsp. sumac1Tbsp. Dijon mustard1Tbsp. mild-flavored (light) molasses1bunch collard greens, ribs and stems removed, leaves thinly sliced1fennel bulb, fronds reserved, bulb thinly sliced1large shallot, thinly sliced1cup blueberries or other seasonal fruitIngredient Info: Sumac can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Heat vegetable oil in a small skillet, preferably cast iron, over medium-high. Cook plantain, stirring often and reducing heat if needed, until light golden, about 2 minutes. Transfer to paper towels to drain. Let cool 10 minutes. Reserve skillet.Step 2Smash each plantain slice with a flat-bottomed measuring cup. Return to skillet and set over medium-high heat. Fry, stirring occasionally, until browned, about 2 minutes. Return to paper towels; season generously with salt.Step 3Meanwhile, whisk olive oil, vinegar, lime juice, sumac, mustard, and molasses in a large bowl to combine; season with salt. Add collard greens, fennel bulb, and shallot; toss to coat. Let sit until softened slightly, about 10 minutes. Taste and season with more salt if needed.Step 4To serve, toss plantain and blueberries into salad. Divide among bowls and top with fennel fronds.How would you rate Collard Greens Salad With Fried Plantain and Sumac?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSubstituted fresh tart cherries for blueberries and turned out delicious. Letting the collard greens sit even longer in the vinaigrette, tenderized them even more! AnonymousSan Francisco,CA 6/2/2020Cooked this last night with friends and WOW - was a big success. \nCouldn't get collard greens though and substituted it with an asian leaf mix which was wonderful with everything.marieokBerlin5/23/2020This recipe was beautiful in every way. So fresh & deep in flavors without feeling overly heavy or not filling. Worked perfectly as a lunch for us and definitely kicked off a plantain obsession for my husband.AnonymousVentura, CA5/15/2020Super great salad. The sumac vinaigrette works perfectly with the tart blueberries and sweet nutty plantain chips. If you eat dairy, a swipe of greek yogurt on the bowl before plating makes it a fuller feeling meal, and adds some creamy richness to the collard base!CarolinepartyrockIndiana5/8/2020Explore Bon AppétitSaladCollard GreensLeafy GreensVegetablePlantainSumacHerbs & SpicesEasyQuickSideDairy-FreeVeganVegetarianGluten-FreeHealthyishFryKwanzaaJuneteenthLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Ashleigh Shanti"]}