{"id": "0de7578a66d24394511e7f6c37598b92", "url": "https://www.bonappetit.com/story/a-place-to-date", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "A Place to Date | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Place to DateOpinions on Bumble's dating restaurant from Healthyish editor Amanda Shapiro.By Amanda ShapiroJune 6, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Yesterday the dating app Bumble announced that it was opening a “date-friendly” restaurant in Soho, and the internet went, “Hrm?”BA’s senior staff writer Alex Beggs listed all the foods she’d eat on a date—including the half-eaten box of Milk Duds left over from the movies. The Cut wondered what a Tinder restaurant would look like. (“A lone man, outfitted in a T-shirt and flip-flops, holding up a fish in the corner.”) Jezebel argued that pasta is actually a great first-date food.Allow me to weigh in as a person who has gone on some dates in my life and is therefore an expert. First of all, what need does this restaurant fill for the city’s masses of desperate, hapless daters? There are about 18 things I might worry about before a first date. Finding a place to meet in a city of a hundred thousand restaurants and a thousand million bars isn’t one of them. Bumble could be tackling so many bigger problems, so many innovations that could make dating better for all of us:  A bot that screens potential dates for terrible cologne. An app that tells you if that one set of underwear is clean. A streaming service that generates the perfect playlist based on both your tastes and the ~mood~. A glossary organized by profession so you can look up “small-cap stocks mutual fund” in the bathroom. A device that recognizes mansplaining and delivers a small (harmless!) electric shock to your date. You get the idea.Now let’s talk about the name. If anyone I was dating or considering dating suggested going to a restaurant called Bumble Brew, I would...not date that person. Bumble Brew is not a spot for sexy encounters; it’s a place to drink witch-themed drinks out of mini-cauldrons, and everyone knows it.And if anyone I was dating or considering dating suggested going to a place created by an app, exclusively for the purpose of dating, I would—wait, I literally cannot imagine that happening. Which brings me to my next point: No one is actually going to go here except journalists and people who’d rather be ironic than have a good time. You might go to a bowling alley to bowl, but you don’t go to a dating restaurant to date.One seemingly attractive aspect of Bumble Brew is that Delicious Hospitality (a.k.a. the people behind Charlie Bird and Pasquale Jones) is doing the food and beverage program, which features easy-to-pronounce wines and no troublesome (i.e., delicious) foods like pasta or burgers. On the other hand, I can think of two restaurants where you can already enjoy Delicious Hospitality’s menus, and, guess what, you could even bring a date there.As Bloomberg points out, Bumble is not expecting to turn a profit with its Soho restaurant, which might be the only rational assumption in this whole endeavor. Instead the plan is to roll out Bumble Brews in other cities, like Austin, where people have been waiting, monk-like and celibate, for a place to date.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleI've Been Missing the KitchenBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-06", "author": ["Condé Nast", "Amanda Shapiro"]}