{"id": "0deecc5e6199fbd5dadbec911cf366ce", "url": "https://www.bonappetit.com/recipe/ba-best-lasagna", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Best Lasagna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueBA's Best LasagnaBy Chris MoroccoMay 7, 20214.5(140)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrintThis lasagna recipe has “rainy Sunday cooking project” written all over it. But, if you’re short on time, you can make both the bechamel and the ragu earlier in the week and pop them into the fridge. You can also make a full tray of this lasagna in advance and freeze it unbaked. Once you do bake it, you’ll be grateful for the leftovers—reheat them uncovered in a 350 degree oven until warmed through and there are crispy bits around the edges.The secret weapon here is the ragu. Still, you might ask: why in the world would we tell you to make meatballs, brown them, and then break them into pieces after simmering for hours—for a ragù? Sounds crazy, but it’s the best way we found to sear a big batch of meat without overcooking it. This MeatballMethod™ yields deep color (a.k.a. flavor) along with tender meat. If you want to use fresh pasta, go for it. We also tested the recipe with no-boil noodles, but found they soak up a lot more sauce and the lasagna loses its wonderful ooziness; instead, we recommend the regular dried stuff.Editor’s note: This recipe was originally published February 7, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonPotato Masher$15 At Amazon13x9\" Baking Dish$20 At AmazonLadle$27 At AmazonIngredients8+ servingsRagù Bolognese2lb. ground pork1lb. ground beef chuck (20% fat)Kosher salt, freshly ground pepper2Tbsp. extra-virgin olive oil2oz. pancetta or slab bacon, chopped1medium onion, finely chopped1celery stalk, finely chopped1medium carrot, peeled, finely chopped6garlic cloves, sliced2Tbsp. tomato paste¾cup dry white wine128-oz. can whole peeled tomatoes1cup low-sodium chicken broth1cup whole milkBéchamel7Tbsp. unsalted butter¼cup plus 3 Tbsp. all-purpose flour6cups whole milk4oz. Parmesan, coarsely grated (about 1 cup)Pinch of cayenne pepperPinch of ground nutmegKosher salt, freshly ground pepperAssembly1¼lb. dried lasagna noodles (we like De Cecco since they are wide and short)Kosher saltExtra-virgin olive oil (for greasing)PreparationRagù BologneseStep 1Preheat oven to 225°. Mix pork and beef with your hands in a large bowl; season generously with salt and pepper, then mix again. Form into about 18 large meatballs (they don’t need to be perfect—you’ll be mashing them later).Step 2Heat oil in a large Dutch oven over medium-high. Working in 2 batches, cook meatballs, turning occasionally and reducing heat if bottom of pot looks in danger of scorching, until browned all over, about 6 minutes per batch. Transfer to a rimmed baking sheet as they’re done.Step 3Reduce heat to medium. Add pancetta and cook, stirring often, until lightly browned and beginning to crisp, about 5 minutes. Add onion, celery, carrot, and garlic and cook, stirring occasionally, until softened, 6–8 minutes. Add tomato paste and cook, stirring constantly, until paste darkens, about 2 minutes. Add wine and cook, stirring occasionally, until nearly completely evaporated, 4–5 minutes. Add tomatoes, crushing with your hands, and increase heat to medium-high. Cook, stirring occasionally, until liquid is jammy and reduced by about half, 8–10 minutes. Add broth and milk and return meat to pot. Bring to a simmer. Cover pot, leaving lid slightly ajar, and transfer to oven. Bake sauce (no need to stir, but check after 1–2 hours to ensure liquid is at a low simmer, adjusting oven temperature as needed) until meatballs are falling-apart tender, 3–4 hours.Step 4Using a potato masher, break meatballs apart and incorporate into liquid (you should have about 8 cups ragù); season with salt and pepper. Reduce over medium-low heat if needed to thicken.Do Ahead: Sauce can be made 4 days ahead; let cool, then cover and chill, or freeze up to 3 months.BéchamelStep 5Melt butter in a large saucepan over medium heat. Whisk in flour and cook, whisking occasionally, until flour begins to smell a bit nutty, about 4 minutes. Quickly whisk in milk and increase heat to medium-high. Bring to a simmer and cook, whisking occasionally, until béchamel thickens, about 4 minutes. Reduce heat to medium-low and cook, whisking occasionally, until smooth and velvety, about 10 minutes. Remove from heat and whisk in Parmesan, cayenne, and nutmeg (you should have about 6 cups); season with salt and pepper. Transfer to a large bowl, cover with plastic wrap, and use within 1 hour or chill.Do Ahead: Béchamel can be made 1 day ahead. Keep chilled. Rewarm just enough to loosen before using.AssemblyStep 6Preheat oven to 325°. Cook noodles in a large pot of boiling salted water, stirring occasionally and separating noodles so they don’t stick to each other, until just starting to soften but still snap in half rather than bend when folded; 3 minutes is the magic number. They will be so firm it will just seem all wrong, but this is what separates al dente lasagna layers from gummy ones. Transfer noodles to a large bowl of cold water to cool. Drain and lie flat in a single layer on a rimmed baking sheet, separated by parchment or wax paper.Step 7Lightly oil a 13x9\" glass or ceramic baking dish. Spread 1½ cups ragù in dish. Lay a single layer of noodles over ragù (you will need to cut some noodles in half in order to fill all gaps). Spoon 1¼ cups béchamel over noodles, spreading in an even layer with a small offset spatula. Top béchamel with 1½ cups ragù. Repeat, creating 5 layers of pasta (or 6, depending on how deep your pan is) and ending with remaining 1 cup béchamel. It should come right to the top edge of the dish, and the top layer of pasta will get super crunchy when baked.Step 8Cover with a lightly oiled piece of foil and set on a rimmed baking sheet (just to catch drips). Bake lasagna until bubbling gently around the edges, about 1 hour. Remove from oven and increase oven temperature to 425°; carefully place rack in top of oven. Uncover and continue to bake until top is browned and crisp around the edges, 10–15 minutes.Step 9Let sit 10 minutes before serving.Do Ahead: Unbaked lasagna can be assembled 1 month ahead. Let cool, then cover with plastic and freeze. Let thaw overnight in fridge, then bake as directed.ChevronChevronHow would you rate BA's Best Lasagna?Leave a ReviewTell us what you thinkReviews (81)Back to TopTriangleI’m not even Italian and I know this is not how you make lasagna. Seriously, no mozzarella? No oregano? Make meatballs and then break them apart? It came out tasting fine enough but come on. FenTaos, NM2/1/2022My mothers lasagna receipt is the best in the WORLD.... So why did I make this recipe. The Béchamel? maybe, we typically use Ricotta. The oven meatball ragu? maybe, we make a secret family Bolognese from Italy. The lack of Mozzarella? maybe, that’s a staple of our dish. The fact is .... this was the most decadent, rich, lush and silky tasting Lasagna I ever made. Please don’t tell my mother, but this is my new go to recipe. \nCooking Note: Prepare the Béchamel properly, make sure you measure correctly. Use flat edged lasagna noodles, not curly edged. Properly salt and pepper your sauce. Sublime! AnonymousNew York1/22/2022Spent hours and hours making this to be very disappointed in the results.  It was incredibly bland with little to no flavor. I am a die hard believer in BA’s regular lasagna bolognese recipe and had high hopes for this one.  Not worth the time or effort at all. I added plenty of salt and pepper throughout as well and used San marzano tomatoes and organic meat.  KikiCT Greenwich, CT12/13/2021This is a fantastic recipe. My tips:\n- Season throughout with salt. Taste as you go. The recipe doesn't say this, but to reach that nirvana flavor in the ragu and bechemel, you have to be salting.\n\n- SAVE TIME and just put the pasta in dry. No need to pre-boil it and then cool in ice water. It will cook fully in the oven with the bechemel and the ragu. And for those who are thinking \"but how will the pasta get seasoned if I don't first preboil it in salted water?\" if you seasoned your ragu and bechemel correctly, the noodles will pick up that awesome flabor.Austin Los Angeles, CA11/27/2021Love this recipe, you do have to cook the bechamel for way longer and hotter then the recipe says to get it to thicken just FYI. AnonymousTexas 11/22/2021Ok so usually I’m fully onboard with not only Chris Morocco but all the BA chefs. This was a miss for me all around. It wasn’t bad tasting, but there is no seasoning! I bought a “meatball mix” from my butcher so pork, beef, veal. I seasoned the whole way through with S&P, used San marzano tomatoes, I don’t know what else I could’ve done. This needs basil, way more garlic, oregano, something! I tried this recipe bc I’m team ricotta, but my husband is not so I wanted to try a béchamel to see if he would like it. It was absolutely a fine recipe but one bite in and I was seriously missing the seasoning. I’m Italian so I have a family sauce recipe and I think maybe next time I’ll use that instead. I read some reviews where people did Italian sausage instead and I definitely think that would help. In all it’s just an ok recipe, use your favorite sauce recipe or add seasoning to your liking.AnonymousPittsburgh11/14/2021Too angry Phil, if you used the amount of flour you suggest with six cups of milk you would end up with a piece of plaster of Paris. I agreed that the quarter cup plus 3 tbsp was ridiculous. I used a half a cup and I used a whole stick of butter instead of 7 tbsp. That's just an extra tablespoon. Who cares but the bechamel was perfect!  And I didn't warm the milk and I did pour it all in at once and it still came out perfectly, no lumps no problems. Excellent recipe.Kdm707Portland Oregon11/14/2021This takes all day (start at 1pm to eat at 8pm), but it's not difficult and it is SO delicious. It's a project, but a lot of fun on a lazy weekend afternoon. The béchamel starts off looking like it will never be thick enough and the amount of milk seems ludicrous, but after you let it cook a while (way more than 10 minutes for me) and add in the parmesan it's absolutely perfect. Each step requires longer cooking time  - may be the difference in a professional vs. home kitchen. This is so perfect and decadent. Our family of 3 loves \"finding\" the leftovers in the freezer a couple of months later and having a second amazing meal. Thank you, Chris!Angela SimsChicago11/14/2021The \"bechamel\" recipe is completely broken! This recipe simply does not work based on the quantities given. It asks for 1/4 cup + 3tbps of flour (around 65g) for 6 cups (1700ml) of milk. That is an insanely tiny amount of flour for that amount of milk. To make this recipe even remotely work you'd need to double or triple that amount of flour. Otherwise you just end up with a thin, watery sauce that makes building the lasagna impossible.\n\nAnd WHY \"1/4 cup + 3 tbsp flour\"? Who writes a recipe like that?? 3 tbsp is nearly identical to 1/4 cup so why not just say 1/2 cup or 6tbsp flour?! This recipe is honestly a waste of time, just use the Guardian's Perfect Lasagna. It actually works.Angry PhilScotland11/3/2021For everyone not a USAmerican, just a reminder that 225° means 225F here, and to set your oven to ~100C. I forgot, as I had a lot of things on my mind today, and burnt the sauce something awful.\n\nI've made it before, and the result (if not burnt) is delicious.SamThe Netherlands10/4/2021I love this recipe. But I think the bechamel directions are very hit or miss. It's much easier to incorporate the milk if its warmed (not boiling over!) and adding it only half a cup or so at a time and letting it set before adding more milk. You have to be patient. It will save you time instead of going back to the store for more milk.Eugene9/29/2021Was last minute today before Pensacola Symphony this evening - did not have to shop, wanted to eat with friends, early. All were shocked that it was not my \"traditional\" lasagna offering - it was better.  Did little to no deviation from your list - a touch more garlic.\nServed with  spinach  salad, fresh  baked  bread, two bottles of Hahn, Pinot.RichardPensacola, FL6/26/2021I was never even a lasagna person...made it for Christmas this year and will be making it every year since. Friends and family are OBSESSED I mean it’s simply decadent. The ragu is so layered and delicate...this recipe is very time consuming however so PRO TIPS 1) I made the sauce a day ahead and honestly probably just made it better from marinating overnight. 2) do not skimp on these ingredients!!! The ONLY thing I changed was instead of doing 2lb ground pork, I did 1lb ground pork and 1lb sweet Italian sausage. Totally recommend! 3) make bechamel and assemble on day 2. If you follow all of Chris’ instructions you will crave this everyday of your life!!!Chris New York, NY6/21/2021This recipe was an absolutely with our friends. The béchamel is absolutely divine and the bolognese is luscious. The whole thing doesn't look very pretty after its been cut up, but it totally makes up for that with the flavors. The variations that others have noted below are very tempting, but I strongly suggest making it as written the first time. MattAustin, TX6/13/2021Love this recipe—yes, it's a lot of steps, but it's worth it! Great for a rainy night in. AnonymousBrooklyn, NY6/3/2021Explore Bon AppétitPastaItalianEuropeanGround BeefBeefMeatGround PorkPorkCanned TomatoTomatoVegetableLasagnaPasta & NoodlesMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Chris Morocco"]}