{"id": "0deea23ba87fe7a1f30ce50d943b61d7", "url": "https://www.bonappetit.com/recipe/galayet-banadoura", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "Galayet Banadoura (Sautéed Tomatoes With Pine Nuts and Mint) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGalayet Banadoura (Sautéed Tomatoes With Pine Nuts and Mint)By Sami Tamimi With Tara WigleyJuly 14, 20204.6(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Jenny ZarinsEmailPinterestPrintEmailPinterestPrint“This is somewhere between a tomato dip and stewed tomatoes. Either way, it’s rich, silky, and really versatile,” writes Sami Tamimi and Tara Wigley in Falastin, a vibrant collection of Palestinian recipes and stories. “Serve these sautéed tomatoes either as part of a mezzeh, with some crusty white bread to mop it all up, or as a side to myriad dishes. Any grilled meat or fish, some pan-fried tofu, and all sorts of grain and pulse dishes work well. It’s also really delicious as a pasta sauce.”Reprinted with permission from Falastin: A Cookbook by Sami Tamimi and Tara Wigley, copyright © 2020. Published by Ten Speed Press, an imprint of Penguin Random House.IngredientsServes four as part of a mezzeh spread1¾lb/800g plum tomatoes (8 or 9)6tbsp/90ml olive oil1green chile, halved lengthwise, then roughly chopped, seeds and all8garlic cloves: 2 crushed, 6 very thinly sliced lengthwiseSalt and black pepper½tsp dried mint2tbsp pine nuts¼cup/5g mint leaves, shredded¼cup/5g parsley leaves, roughly choppedPreparationStep 1Core the tomatoes and score the base with an “X”—this makes it easier to remove their skins. There are two ways to do this. The first is to bring a medium saucepan of water to a simmer over medium-high heat, and lower in the tomatoes. Cook for 1–2 minutes, or until the skins start to shrink back, then remove them with a slotted spoon. While the tomatoes are still warm, peel off and discard the skins. The second way is to place them in a large bowl and cover with boiling water. Let soak for 1–2 minutes, then drain. Again, while the tomatoes are still warm, peel off and discard the skins. Once peeled, slice each tomato into six wedges and set asideStep 2Put 3 tbsp of oil into a large sauté pan and place over medium-high heat. Add the tomatoes, chile, crushed garlic, 1 tsp of salt, and a good grind of black pepper. Cook for about 18 minutes, stirring occasionally, until the tomatoes have broken down and the sauce has thickened. Stir in the dried mint and transfer to a serving platter. Set aside to cool slightly.Step 3Meanwhile, put the sliced garlic and remaining 3 tbsp of oil into a small frying pan and place over medium heat. Cook for about 4 minutes, or until the garlic starts to become lightly golden. Add the pine nuts and cook for another 3 minutes, or until they have taken on some color. Pour the mixture, along with the oil, over the tomatoes and garnish with the mint and parsley leaves. Serve warm or at room temperature.Step 4Do ahead: The cooked tomatoes keep well in the fridge for up to four days. The garlic and pine nuts can also be prepared well ahead and kept at room temperature, ready to be spooned on when assembling the dish.How would you rate Galayet Banadoura (Sautéed Tomatoes With Pine Nuts and Mint)?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleIt's winter and there are no more tomatoes at the market. So, I made this with good canned whole tomatoes. Everything else was done per the recipe. It came out wonderfully! I can't wait to try it next summer when the tomatoes are back in.AnonymousSan Francisco, CA12/31/2021Loved this one! Really simple. I can't wait to make this for a party mezze—y'know, once parties are a thing again. Didn't have any mint on hand but flat-leaf parsley brightened it up. I also subbed pistachios for the pine nuts to use up what I had. Lean times, haha. I used some sliced and toasted homemade sourdough to dip in for a taste...amazing. I'll be spooning this over top of some polenta tonight. Love that it's a little spicy!AnonymousLos Angeles, CA7/29/2020This recipe is delicious! I didn’t have plum tomatoes, I had Roma so they didn’t get quite as stewed as I would of liked so I added a little bit of red wine vinegar and some water. Turned out wonderfully. Served it with couscous and roasted chickpeas. Anonymous7/21/2020Yum!! So delicious for such little fuss. I added the herbs to the oil at the end / off the heat for extra flavor and omitted the dried mint. Will double it next time as we are this as two servings for dinner. AnonymousDenver, CO7/21/2020We loved this. Made it with the tomatoes on the vine that we had at home and it turned out great. Served it on toast alongside a lamb sirloin roast. AnonymousSanta Ana, CA7/20/2020Explore Bon AppétitDipCondimentPalestinianMiddle EasternPlum TomatoTomatoVegetablePine NutNutMintHerbs & SpicesSummerEasyStarterSideDairy-FreeVeganVegetarianGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-14", "author": ["Condé Nast", "Sami Tamimi With Tara Wigley"]}