{"id": "0dfc017626ac562f1acc2c0c0528cd3c", "url": "https://www.bonappetit.com/story/cooler-full-of-gimbap", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "No Vacation Is Complete Without a Cooler Full of Gimbap | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNo Vacation Is Complete Without a Cooler Full of GimbapWhen I was growing up, these seaweed rice rolls symbolized how my family was different. Looking back, I think that’s what I appreciate most about them.By  Jennifer Hope ChoiAugust 19, 2020FacebookTwitterEmailIllustration by Hye Jin ChungFacebookTwitterEmailIn August 1995 my family embarked on a seven-state road trip, seeking the humble splendors of quintessential cross-country tourism: dripstone show caves, gold mines, Old Faithful’s clockwork blast, and the four avoidant gazes chiseled into Mount Rushmore’s colossal facade.When we set out on our adventure, I expected some cross between the Oregon Trail computer game and National Lampoon’s Vacation—no dysentery, but long days spent exploring the great outdoors, racking up mileage as cornfields blurred past the car windows; a montage of sibling squabbles, sing-alongs, and pit stops for cheeseburgers with mud-thick chocolate milkshakes at diners untouched by time.We weren’t pioneers, though. Or the Griswolds. We were just six Koreans cooped up in a minivan bound north and east from our home in California. My mother, Umma, kept a map tucked into the knockoff Louis Vuitton fanny pack ever hitched to her hip, guiding us on a route designed by a local Triple A agent. My grandparents (who had survived Japanese imperialism and the Korean War), my sister, cousin, and I came along for the ride.We didn’t know any of the same songs, so there would be no sing-alongs. No diners or cheeseburgers either. Instead, we’d packed enough food to survive for a month on the road without ever stopping. Grandma brought a 38-quart Igloo wheelie cooler filled with kimchi, whole danhobak (kabocha squash), and 30 rolls of gimbap—laver seaweed (gim) wrapped around a rainbow of vegetables and rice (bap).To say I was disappointed by our fixed menu would be an understatement. I wanted the American food that matched an American vacation. If left to my own devices, I could’ve mainlined ranch dressing all the way to South Dakota and back. As a nine-year-old, I didn’t understand yet the sacredness of our homemade food.My mother was the kind of woman who washed and reused ziplock baggies, so I assumed we’d lugged our own provisions due to her notorious frugality. Umma, the ricewinner of the family, worked day and night shifts as a registered nurse, saving up over the school year to take us on summer vacations. I don’t know how she lasted the Disney Big Red Boat cruise or the all-inclusive weekend at Baja California’s Rosarito Beach without Korean sustenance.Perhaps this is why she never seemed happy, even in photos, her mouth eternally crimped into a frown. Almost every meal concluded with her declaring, “You know, I just don’t feel full without kimchi and rice.”The trips were meant to expand our horizons, “for the cultures,” she’d say tersely—which appeared to come at the cost of her own satisfaction. When we hit the road that August, though, my grandma, Halmoni, made sure to pack a rice cooker and a gallon tub of kimchi.Oh, the kimchi. That “odor-resistant” cooler didn’t stand a chance. Like prying open a crypt, even the narrowest crack of the lid released a sharp, mellifluous tang, potent enough to make your eyes water. When we popped it open at rest stops, I could practically see the stink lines wafting into the air, floating over to neighboring tables.We were picnicking in Yellowstone National Park, preparing the usual—my sister divvying off-brand cola into Styrofoam cups, Halmoni passing out the disposable chopsticks—when a blonde pig-tailed girl walked by us. She’d spotted the kimchi sopped in blood-red chili juice; after catching a whiff, her face twisted with mystified disgust.As if to ally myself with this stranger, I whined loudly: “Can’t we have hot dogs?”“There’s hot dogoo in the gimbap,” Umma mumbled, mouth stuffed.But I wanted mine in a bun.Illustration by Hye Jin ChungEven though I actually adored gimbap, I’d recently discovered that my peers did not. Just the sight of it disturbed them, which meant that liking it made me strange, and different.A few months prior I’d brought gimbap to school on International Day. I showed up to class wearing my petal-pink hanbok, positively giddy, like I was performing a more Korean version of myself in a play. I set our platter on a table in the center of the room alongside 30 other family-made dishes.Halmoni had woken up early that morning to prepare the gimbap for me. Still a Buddhist then, she handled every ingredient with quiet reverence, slivering carrots thinner than matchsticks, culling the spinach fronds from scalding water, dappling fresh bap with sesame oil, slicing egg pancakes and yellow danmuji (pickled radish) into uniform belts. The pièces de résistance? Hot dog strips, gone curly from a light pan-sear. She arranged the items atop a sheet of rice-covered gim, and before the stack could topple, her elegant hands squeezed the roll taut with a bamboo mat. She cut the rolls into rings so the black gim encircled tiny colorful vivisections, each an edible Mondrian.At school, one after another, we shimmied down the buffet line. My classmates sluiced gobs of ambrosia, mac and cheese, and tuna casserole onto their plates. But the gimbap sat undisturbed beside an equally unpopular knoll of beige sauerkraut. I didn’t even get a pity sample from our teacher.I wondered if it was merely an issue of unflattering lighting until I caught a few kids grimacing at the rolls. And that’s when I saw gimbap as they must have—Frankenfood: the hot dog’s unnatural pink, the radish’s highlighter yellow, the seaweed’s coal black. It surprised me how quickly this tenderly made thing had warped into an object of repugnance, the way shame steals what we privately love in the face of public spectacle.There’s a Korean word, ahkkawuh, which, according to my mother, roughly translates to “guilt for wasting something precious.” With food, this typically leads to a force-feeding situation. But there was no way I could finish the platter on my own. Not without causing a scene. So I took a seat, my dress’s starched fabric suddenly unbearable on my skin. The gimbap seemed to pulse from its platter, growing more conspicuous as the minutes ticked away.After class, while waiting for Halmoni to pick me up, I devoured as many of those rainbow morsels as I could, as if disappearing them might also disappear my shame.But together on our road trip, my family and I ate gimbap with spirited abandon: while playing I spy, mountain peaks unzipping in the distance; or when my sister swerved the minivan to dodge a squirrel, causing both the tires and Umma to screech. We kept snacking, at Motel 6s and Holiday Inns; before the cone geysers punched the ice blue sky with pillars of water and steam. Or, pool-pruned after swimming, the salty tinge of chlorine and sesame oil left lingering on our lips. We stretched the gimbap to Keystone, South Dakota, where we climbed Mount Rushmore’s Presidential Trail until those heavens-high faces came into view, jutting from stone. Then we piled back into the van and headed for home.More than two decades later, I find myself waking some mornings with an almost primal longing for gimbap. Time has a way of holding a mirror to the past, and now I see our food, and that road trip, in a new light.Historically speaking, gimbap is Frankenfood—a resourceful hodgepodge creation. When mass starvation ravaged South Korea after the war, shelf-stable products skyrocketed in demand. Preserved and canned meats were only available via the U.S. Army base PX, or post exchange. A black market surfaced where opportunists snatched up and resold prized American-made products, everything from Ritz crackers to bubble gum, bread machines to blenders. The destitute could only dream of obtaining Spam, Vienna sausages, and hot dogs to supplement their kimchi and rice. Long after the war my grandparents still treasured those sodium-saturated mystery meats. They signify a time of salvaged pleasure, reminding us of the precious things not to be wasted.And, as it turns out, my mother’s constant frown had not been an expression of disappointment but rather of grief. She had afforded me what she could not access when first moving to America in 1976: assimilation so seamless we often did not understand each other’s needs. Yes, she’d called this country home, yet her appetite would always belong elsewhere. My grandmother knew this. Gimbap had been a way, without words, to quell us all.These days my family is spread across the globe, from Brussels to the Deep South (where my mother now lives). In July I relocated to Oklahoma for an artist fellowship, and Umma and I made a road trip out of the move. We roamed through five states, once again admiring—from a safe distance—the tourist fodder of cross-country travel (the world’s largest office chair, the alleged spinach capital of the world). I didn’t want us to be without gimbap for the drive. That’s why, one summer afternoon, I finally learned how to make the damn thing. Though I do not have children of my own, it frightens me to think certain family traditions may end because of my own fatuous inaction.My mother and I prepped the ingredients together. Our process lacked Halmoni’s grace: “Thinner! Thinner!” Umma barked, inspecting my carrot knife work. I whittled the slivers down to the size of pine needles but tore the egg pancake, which did not go unseen. Umma flagged these errors while quartering the hot dogs, finding time to demand that I replenish her rosé.The first roll turned out a real dud, the gim too loose, each cut piece unwinding like a nautilus. We took turns with the work, testing the frayed ends until the crunch and taste returned: for my mother, a memory of springtime class picnics in Seoul when she washed down each bite with Chilsung Cider, shaded by a riot of cherry blossoms; for me, International Day, sitting curbside in my hanbok, devouring each morsel before Halmoni arrived to take me home.Umma was quiet now. Soon our third and fourth rolls didn’t look too shabby, and as I squeezed taut the final batch, I noticed how familiar my grip on the bamboo mat suddenly appeared—the slender fingers and map of veins—my hands, my mother’s hands, and my grandmother’s, all the same.Jennifer Hope Choi is a writer and editor. She is currently working on a collection of essays.Explore Bon AppétitRoad TripKoreanFirst PersonRead MoreWhere to eatIn a Prius on the Edge of SanityBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-19", "author": ["Condé Nast", "Jennifer Hope Choi"]}