{"id": "0dfd89cb9c6469f11f7445114d12dbe2", "url": "https://www.bonappetit.com/recipe/burnt-orange-and-coriander-roast-pork", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Burnt Orange and Coriander Roast Pork Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBurnt Orange and Coriander Roast PorkBy Shilpa UskokovicSeptember 8, 20214.6(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintLoosely based on the many rich, brick-red pork stews of Mexico, this slow-roasted pork cooks all day in the oven after an overnight marinade. Roasted low and slow with blistered orange halves, toasted coriander, garlic, and chiles, it emerges bronzed and tender, collapsing into thick shreds under the weight of a fork. Repurpose leftovers all week into sandwiches (in a baguette with broiled broccoli rabe and melted cheese); stir-fries (onions, peppers, a splash of sherry, and some doubanjiang); tacos (with guacamole, pickled onions, and jalapeños); fried rice (add chopped kimchi and a couple of eggs); or a diner-style breakfast hash.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonBlender$32 At AmazonCitrus Juicer$7 At AmazonIngredients8 Servings4large oranges, halved¼cup coriander seeds1Tbsp. cumin seeds1Tbsp. dried oregano12garlic cloves, coarsely chopped4canned chipotle chiles in adobo2Tbsp. honey¼cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt, plus more18–10-lb. skinless, boneless pork shoulder (Boston butt)PreparationStep 1Heat broiler. Place oranges, cut side up, in a single layer on a rimmed baking sheet. Broil until flesh is charred, 7–9 minutes. Let sit until cool enough to handle.Step 2Juice oranges into a measuring glass to get 2 cups juice and pulp (add water to bring to correct volume if needed); set orange juice aside. Place juiced orange halves in a large Dutch oven or other heavy pot.Step 3Toast coriander seeds, cumin seeds, and dried oregano in a small skillet over medium heat, stirring often, until fragrant, about 2 minutes. Transfer to a blender and add garlic, chipotle chiles, honey, ¼ cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt, and ½ cup reserved orange juice. Blend on high speed until a mostly smooth paste forms (some texture is okay).Step 4Rub chile paste all over pork and set over oranges in pot. Pour remaining reserved 1½ cups orange juice around pork. Cover pot and chill at least 12 hours and up to 24 hours. Let pork sit at room temperature 30 minutes before roasting.Step 5Preheat oven to 325°. Roast pork, covered, 3½ hours. Uncover and continue roasting until meat is very tender and shreds easily with a fork, about 3 hours more. Transfer pork to a platter and let rest 20 minutes before shredding or slicing. You can toss the meat with some of the juices and liquid left in the pot if you would like; discard the rest.Do ahead: Pork can be roasted 5 days ahead. Cover and chill (in liquid), or freeze in a resealable plastic bag up to 1 month.How would you rate Burnt Orange and Coriander Roast Pork?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleReally good. Used a 3.5 lb pork shoulder and just converted the cooking time by calculating the minutes/pound. Ended up cooking it for around 3 hours total. It was almost a little too salty but still so good.AnonymousSan Francisco, CA1/29/2022Delicious!!  I've made it four times since finding the recipe a few months ago and currently have leftovers in my fridge.  And the house smells wonderful while it's cooking.\n\nSuzannah - I agree that cleanup is terrible.  But I tried the deglazing method last time and it worked wonderfully.  I removed all the burnt oranges from the pan, filled the pan with water and returned it to the oven to boil for about 10 minutes then I scrapped out all the burnt gunk.  Much easier!\nTerriMelbourne Beach1/17/2022This recipe is so good. We used the pork in sandwiches, tacos and ramen per the suggestions. The only reason I didn’t give 5 stars is that it took us like 3 days to clean out our Dutch oven. I can’t  believe no one else has mentioned this in other reviews. If y’all have any tips, please share! SuzannahGreenville, SC12/13/2021Loved this - this recipe should get so much more attention. Made it exactly as written, except made sure I had enough oranges for 2 cups (6 navel oranges). It was great the first night but even better a day and two later. I used a 4 pound roast but made the entire amount of liquid and reserved some for sauce. Roast turned out perfectly but the reserved sauce, boiled down, was way too salty. Will make again and adjust the salt between the rub and what I’m reserving for sauce. Also - a couple days after making we crisped the pork in a fry pan and made tacos, adding a bit of fresh pineapple on top. Kwddallas Burnham Harbor now Dallas TX11/22/2021So I did this recipe in a ALLL CLAD SLOW COOKER. It came out great. I marinated the pork like the recipe stated for 24 hours. I then took out the insert and heated it over med heat, I seared the pork on all sides. I then placed it on a plate and added some onions and caramelized those. I added the pork back to the insert and added some of the marinade and also about 1/2 cup homemade chicken stock. I cooked it on low for 7 hours, my piece of pork was about 6 pounds. I then let it cool and reheated it later on the stove. It was delicious and I served it with cous cous, naan bread and sautéed Swiss chard.E TraversoSonoma, CA11/11/2021I really enjoyed the flavor of this pork. It certainly needs more oranges than the recipe calls for. I bought a bag of Cara  Cara Oranges (aprox 6-7) and used them all. Cooking time was perfect for my roast. Had a delish flavorful crust. I did make a sauce from the cooked oranges, drippings and some HWC once it was done. Parts of the roast seemed a touch dry, so instead of having to serve with chunks of the fat, I made a sauce to deepen the flavor.  The sauce is deep, and decadent but amazing. Took two cooked orange halves from the pan, along with a couple tablespoons of drippings, pulsed in blender, added a splash of HWC, and a touch of salt. So so good. AnonymousAtlanta, GA10/5/2021When I made this I started with 4 very juicy oranges and 2 juicy tangerines and it was still not 2 cups liquid.  I did not like the idea of substituting water so I opened a can of pineapple rings and used that juice to get to 2 cups.  I later added the pineapple rings to the dutch oven for the last part of the cook.  This was an awesome addition.  The pork is very flavorful and I strongly recommend using a cast iron dutch oven if you have one. Hannah BRochester, NY 9/17/2021I just made this, and it’s a winner. I used a 3 pound cut and halved the other ingredients. Needed to add more liquid partway through roasting, and cooked for shorter duration. It turned out beautifully, delicious crust and falling apart tender. Next time if I halve the meat, I’ll keep the full amount of liquid so I have some sauce to spoon over (all I had left in the pot was carbon and tar). AnonymousOakland, CA9/12/2021This looks delicious. But I would say, that organic citrus (which the recipe does not specify) can be hard to find. And if the citrus is not organic, I'm afraid a lovely pork roast is spending a whole lot of time stewing with the alternative. Honor pigs—they deserve to be cooked with honor, for special occasions. AnonymousBoise ID9/10/2021Start at 7:00pm, them uncover and go to bed … have the oven turn off in 3 hours, or have it cook for 6 hours before turning off … wake up the next morning and put it all awayChristian HoustonSt. Louis, MO9/9/2021What about a slow cooker?? Luka Chicago 9/9/2021The burnt orange pork roast is good, however are there alternative suggestions to cook the meat using 6.5 hrs to cook this meat is a bit troubling,the oven is oocupied so what if we need to use it for something else? other comments are appreciated.GillianToronto Ontario Canada9/8/2021Explore Bon AppétitPork ShoulderPorkMeatOrangeCitrusFruitCorianderCuminOreganoHerbs & SpicesGarlicVegetableChipotleChilehoneyKosher SaltDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-08", "author": ["Condé Nast", "Shilpa Uskokovic"]}