{"id": "0dff55a8b6075a82427227cfe37b1a67", "url": "https://www.bonappetit.com/story/molly-baz-gift-guide", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Molly Baz's Essential Cooking Tools Also Make Great Gifts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping11 Essential Kitchen Items That Also Make Great Gifts, According to Molly BazBaz knows best. By Molly BazNovember 19, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl Jones FacebookTwitterEmailIn a world full of every possible kitchen utensil, gadget, and tool imaginable, I find myself reaching for the same few items again and again and again. If you invest in the right equipment, and are thoughtful about how you stock your kitchen, you really don’t need much.Below are the 11 items, always accounted for in my kitchen, that I simply cannot and shall not live without. (And, yeah, I think each one would make a pretty great gift—whether it’s for a friend or for yourself.)Find the rest of our 2019 gift guides right here.All products featured on Basically are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Food ScaleIf you have any intention of living a lifetime filled with both baking and cooking triumphs, I strongly encourage you to invest in a scale. There is enormous room for error in relying on dry measuring cups alone, and the tare function of this digital scale makes it super easy to measure ingredients continuously without dirtying tons of measuring cups and spoons along the way. And if you’ve ever read a recipe that asked you to portion out 12 two-ounce meatballs or roll cookie dough into two-ounce portions…well, now ya can.Buy it: OXO Good Grips 5-Pound Food Scale with Pull-Out Display, $30 on Amazon12-inch Cast-Iron SkilletIf you only buy one cast-iron skillet, let it be this one, the one I reach for most in my home kitchen. It’s large enough to fit a whole chicken, but not so egregiously huge that it’s impossible to lift or fit inside your kitchen cabinet. When treated properly, it’s surface will become so slick that you can scramble eggs in it. It is, in short, the perfect all-purpose pan.Buy it: Cuisinel 12-inch Cast-Iron Skillet, $25 on AmazonLarge Dutch OvenThis is the pot equivalent of the beloved 12” cast-iron skillet. Use this when you’re cooking anything of larger volume that would splatter and spill in a skillet. Toss pasta, build a soup or stew, braise chicken, beef, or pork, cook rice. With a decent Dutch oven, you’ll rarely reach for a pot of any other kind. Plus, they look cool just hanging out on your stovetop.Buy it: Staub 7-Quart Round Cocotte, $320 from Williams SonomaQuarter Sheet TraysIt blows my mind that most people don’t even know these exist! Unless I’m making a sheet-pan dinner (which happens...never), I rarely reach for a standard-size baking sheet. They’re half the size and perfect for toasting nuts, baking a few sweet potatoes, slow-roasting a piece of salmon, making croutons, or reheating leftovers. You can even roast a whole chicken on one of these guys!Buy it: Nordic Ware Natural Aluminum Commercial Baker's Quarter Sheet, $16 for 2 on AmazonBig, Heavy Cutting BoardIMO, there’s truly nothing worse than trying to dice an onion on a cutting board that is too small and watching all your hard work scatter out on the surrounding countertop while your flimsy plastic cutting board slides around. This large, heavy, sturdy cutting board is the anchor of my kitchen counter: It’s my rock, and it will be yours as well.Buy it: John Boos Block RA03 Maple Wood Edge Grain Reversible Cutting Board, $130 on AmazonPhoto by Laura MurrayKitchen TowelsThese kitchen towels are essentially an extension of my hands in the kitchen. They play triple duty as oven mitts, kitchen rags, and dinner napkins, and are cheap enough to put to work without fear of staining.Buy it: Utopia Towels Kitchen Towels, $13 for 12 on AmazonHuuuuuuge Serving BoardThis large round Dutch bread board is the perfect casual entertaining accessory. You can throw an entire meal onto the board (roast chicken, DIY lettuce wraps, or a big steak and a side of roasted potatoes), along with lots of little bowls for salt, pepper, and condiments, and let your guests serve themselves. It’s sort of the non-lazy, 2019 answer to the buffet counter. Throw it down in the middle of your dining table (or even on your coffee table, see if I care!) and you’ll never have to worry about picking out the perfect platter again.Buy it: Extra Large Dutch Bread Board, $140 from Food52Hoka One One CliftonI don’t know how I spent the first decade of my cooking career without these sneakers for support. This is the all-time most comfortable and supportive shoe out there, and that’s just as important whether you’re on your feet for hours in a kitchen or running a marathon.Buy it: Women's Hoka x OV Clifton, $140 from Outdoor VoicesMaldon Salt Sea Salt BucketThis is the perfect finishing salt. Shatteringly crisp, perfectly geometric crystals of salt are the only way to finish nearly everything that hits your table. The crackly crunch factor and pop of saltiness makes your food sing in a way only Maldon (or Jacobsen) knows how.Buy it: Maldon Sea Salt 3.3-lb Bucket, $29 on AmazonSalad SpinnerFor starters, if you don’t already own a salad spinner, you need one! They are crucial both for thoroughly cleaning tender greens, lettuces, and herbs and ridding them of the water that would sog them out and yield slimy salads that repel vinaigrettes. A disaster! This particular model is a pleasure to operate, with a pully system that maximizes power with minimal effort.Buy it: ZYLISS Easy Spin Salad Spinner, $23 on AmazonPhoto by Alex Lau An Apron You LoveI cannot tell you how many times I’ve been DM’d asking for the maker of my floppy, flow-y cross back linen aprons. Until now, I’ve sent you off to some of the many great websites that carry them, but the time had finally come. I created an apron of my own with the designer behind literally all of my clothes (if you’ve seen the jumpsuits, you know what I’m talking about). I teamed up with the one and only Ilana Kohn to bring you the “Baz Apron,” and I am so so so excited to share it. It’s got two oversized pockets for holding thermometers, spoons, and timers, plus a single belt loop for hanging one of those trusty kitchen towels you just invested in.Buy it: Ilana Kohn Baz Apron, $138OXO Citrus JuicerI don’t know how many more arguments with Chris Morocco I can withstand regarding the merits of this citrus juicer. He maintains that his manual citrus press is superior, but as far as I’m concerned, the proof is in the pudding: We did a side by side comparison, and guess which juicer yielded more juice? That’s right, this one. Case closed.Buy it: OXO Good Grips Small Citrus Juicer with Built-In Measuring Cup and Strainer, $10 on AmazonExplore Bon AppétitShoppingGift GuidesHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Molly Baz"]}