{"id": "0e07e29b1497f7a8a38a774fa1c331ef", "url": "https://www.bonappetit.com/recipe/radicchio-bean-and-feta-salad", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Radicchio, Bean, and Feta Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueRadicchio, Bean, and Feta SaladBy Kendra VaculinOctober 19, 20214.5(45)Read ReviewsTriangleEmailPinterestPrintPhotograph by Julian Cousins, Food styling by Adriana PaschenEmailPinterestPrintEmailPinterestPrintBored with lackluster beans? Associate food editor Kendra Vaculin has a citrusy solution to your legume doom with a lemony dressing combining zest-infused oil and bright juice that pulls double duty as a marinade for canned beans and as a dressing for the salad itself. Marinate any white bean (like cannellini, navy, or Great Northern), then toss them with pleasantly bitter radicchio, thinly sliced raw brussels sprouts, and big chunks of salty feta.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At AmazonMedium Saucepan$39 At AmazonCitrus Juicer$7 At AmazonSmall Skillet$40 At AmazonSlotted Spoon$13 $10 At AmazonIngredients4 Servings1lemon4garlic cloves, smashed¼tsp. crushed red pepper flakes½cup extra-virgin olive oil215.5-oz. cans white beans, rinsed1½tsp. Diamond Crystal or 1 tsp. Morton kosher saltFreshly ground black pepper¼cup raw pistachios1head of radicchio, thinly sliced6oz. brussels sprouts, trimmed, thinly sliced½cup coarsely chopped dill, divided8oz. fetaPreparationStep 1Remove zest from lemon in wide lengthwise strips with a vegetable peeler, avoiding as much white pith as possible. Cut lemon in half and squeeze juice through a fine-mesh sieve or your hand into a small bowl; discard seeds. Set juice aside.Step 2Heat lemon zest, garlic, red pepper flakes, and oil in a medium saucepan over medium-low, stirring to break garlic apart and reducing heat if oil around aromatics starts to sizzle too much, until fragrant, 10–12 minutes. (The garlic should gently cook but not take on much color.)Step 3Remove saucepan from heat and add beans, reserved lemon juice, and salt; season with black pepper. Toss to combine; let sit at least 15 minutes.Step 4Meanwhile, toast pistachios in a dry small skillet over medium heat, tossing occasionally, until golden brown, 5–8 minutes. Transfer to a cutting board and coarsely chop.Step 5Combine radicchio, brussels sprouts, and ¼ cup dill in a large bowl. Crumble in feta in large pieces and toss to combine. Using a slotted spoon, add beans, garlic, and lemon zest. Drizzle with infused oil and toss to coat.Step 6Mound salad on a platter; top with pistachios and remaining dill.How would you rate Radicchio, Bean, and Feta Salad?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleLoved this salad! I used Napa cabbage instead of radicchio because it’s what I had, but I followed everything else on the recipe. It tasted great. Will definitely make this again. JaneDurham, NC3/9/2022This is our new favorite salad. Tons of flavor and the feta adds just enough to make the salad a substantive lunch. Bright flavors for spiffing up a winter day. We make a batch and take it for lunch for several days.TraceyAiken, SC2/6/2022Wow, this was a hit! Made this with a few adjustments (tips from reviewers—thank you!): soaked radicchio in ice water while prepping other ingredients, let the oil infuse off-heat in pan for 20 mins (after initial heating), made my own beans the day before (Rancho Gordo Garbanzos), squeezed fresh lemon on top to serve. Absolutely smashing. Would be great with some sliced pepperoncinis as well. If you like salty-sour-bitter flavor profiles, this one's for you.DreSan Francisco1/21/2022I found this incredibly delicious as is! The beans and pistachio are mild and creamy enough to balance the flavour of the radicchio, and it doesn't need an additional Dijon vinaigrette. Make sure to give the oil enough time to infuse (mine was on the heat for probably twenty minutes). I did use the tip of putting the radicchio in ice water while prepping the other ingredients and it definitely removed some of the bitterness while making the radicchio come alive.AnonymousBrooklyn, NY1/6/2022Following the suggestions in the comments we soaked the radicchio and added Dijon, red wine vinegar, and maple syrup to the dressing. Those alterations to the original recipe made this a definite winner for us, and we will definitely be making it that way again.AngNY12/4/2021I stumbled across this recipe looking for a filling salad that I could prep ahead of time and eat for lunch over a couple days. I read through the comments and incorporated several of the brilliant suggestions offered, resulting in a very tasty end result.  I HIGHLY recommend soaking your radicchio in ice water to minimize bitterness as others suggested. Radicchio has a lot to offer, and this technique helps it shine and ensures your salad is visually beautiful.\n\nI found the infused oil to be a bit lacking as a dressing, so I stirred in 1 tbsp dijon, 2 tbsp red wine vinegar and 2 tbsp maple syrup to balance the flavors. This helped cut some bitterness and added a lot more depth. I also subbed pine nuts for pistachios because that's what I had on hand. They worked well, so I think most nuts/seeds could be a good fit here so long as they are crunchy and a little toasty. Lastly, the type of feta you use will really impact the overall feta, so I recommend avoiding a crumbled variety (like athenos) and getting a block that you hand crumble. These tend to have more flavor and better texture overall. In the future I might play around with adding a fruit element to this recipe (dried cherry/apricot) or serving over cooked farro if I want this to work as a dinner main. Thanks for the great  salad springboard BA!\n\nAbbySeattle, WA11/24/2021Made this exactly as directed but cut back a bit on the feta. We loved it, so simple but so delicious! Can’t wait for lunch leftovers tomorrow. Will make it again soon!DoriDC11/18/2021I used thinly-sliced cabbage instead of radicchio and also topped it with crispy fried onions.  Delicious!  My new favorite salad.Paula VMichigan11/10/2021For everyone having issues with the bitterness of the radicchio, try soaking the chopped radicchio in an ice bath for ~30 mins while you prep all the other ingredients. Makes a huge difference!BreanneBrooklyn, NY11/9/2021This salad was delicious. I cooked Rancho Gordo Royal Corona beans for this recipe and had a beautiful head of radicchio from the farmers market. This time of year, Trader Joe’s sells Brussels on the stalk and they are wonderful. We microplaned the lemon zest in lieu of making strips. Beautiful and delicious!Dizastro 11/7/2021Not good as written, way too plain and bitter. My oil nearly burnt on low heat after just a few minutes, and it didn’t change the flavor of the beans at all. I made another vinaigrette with some sugar, honey vinegar, lemon and salt to cut through the bitterness. And I added another half-block of ricotta salata I had in the fridge. It was still just okay, salvageable but not serveable.chrispbaconBrooklyn, NY11/5/2021Love this salad! I used arugula instead of radicchio but kept everything else the same. It wasn’t too bitter, but I think an extra lemon squeeze at the end would even take it up a notch further. PegBTustin, CA11/4/2021After reading the comments around the bitterness of this dish, I made some changes to the recipe. With these changes, my family loved this salad! To be transparent, it was still bitter but enjoyable. I wouldn’t make this salad if you don’t like bitter tasting things. The feta and marinated beans help to balance out the bitterness, but it is still bitter forward!\n\n- added 2x the lemon juice and a few tablespoons of white wine vinegar to cut though the bitterness\n- marinated the beans for an hour\n- roasted the Brussels sprouts and halved them to serve on top\n- used a very small radicchio (size of a softball) AnonymousArcata, CA11/3/2021I was so excited to try this recipe but unfortunately this was a miss, it was just WAY to bitter (and I used half of the amount radicchio from the recipe). I feel like it needs some sort of sweet element to balance it out, maybe like mandarin orange slices ? But, that's just a thought, I really have no idea. It was so unpleasant that we had to scrap the meal and order take out :(MissKikiChicago, IL 11/3/2021Felt very ehh about this salad. The radicchio combined with the raw brussels sprouts was too fibrous. I tried roasting both the radicchio and the brussels sprouts for 15 mins at 425, which softened them up quite a bit and made the salad more enjoyable. CookSorceryBoston, MA10/31/2021Explore Bon AppétitFetaCheeseRadicchioChicoryLeafy GreensVegetableBeanSaladDinnerVegetarianEasyWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}