{"id": "0e504f8cf32aca27951bab11d10503ad", "url": "https://www.bonappetit.com/story/best-things-to-buy-on-boxed", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "The 13 Things I Buy in Bulk on Boxed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 13 Things I Always Get on Boxed, My Favorite Bulk-Buying WebsiteA mild hoarder’s tale of stocking up for less on an excessive amount of sugar, butter, paper towels, and sharp cheddar.By Alyse WhitneyApril 23, 2018FacebookTwitterEmailCourtesy of BoxedFacebookTwitterEmailI have never run out of paper towels, because I’m a low-level hoarder. I buy in bulk and keep backstock of every household necessity and pantry staple so I don’t have to run out to the store in the middle of cooking or cleaning. Which means I’m a recovering Costco addict.I used to frequent Costco, but the $50 membership fee felt excessive when I wasn’t going frequently, so I turned to the internet to figure out the best place to shop in bulk. Most people bulk-buy on Amazon since having a Prime account is almost as necessary as a driver’s license, but it’s not always the cheapest. Instacart delivers Costco items with a slight mark-up to non-members in NYC and major cities, but that’s still not consistently the cheapest, either. The winner for me is Boxed.com, a no-fee, discount bulk buying site that I turn to every few months to cram my cupboards full of paper towels, buy enough vanilla extract to bake dozens of the best chocolate chip cookies, and make a lot of things with whole peeled canned tomatoes. It all comes to my doorstep at once (with free shipping on orders over $49), and after doing a deep dive across all three bulk website options, it was almost always the cheapest for everything. Plus I get less tempted than when wandering the aisles of free sample-ridden Costco.Here are 13 items that I will always buy on Boxed, ready to be stuffed into every cabinet in my house.1. Granulated SugarWhen that brown butter and toffee chocolate chip cookie craving hits, I need sugar. And a lot of it. A 10 lbs. bag of Domino sugar is a mere $5.99 on Boxed! I will lend sugar to any of my neighbors at that price. Comparatively, the same bag costs $15 for 10 lbs. on Amazon and Costco does not carry it.2. ButterSee above cookie reference for why I buy butter 4 lbs. at a time! It stores well in the freezer, and then I can keep a stick of salted butter ($14 for 4 lbs. on Boxed) on the counter for toast-buttering-without-crumbs-going-everywhere needs too. Kirkland is Costco’s brand, but Boxed sells a select number of their products, like this butter.3. Vanilla ExtractSometimes I buy nice vanilla extract, and sometimes I turn to ol’ faithful McCormick. You can get 8 oz. for $26 on Boxed, which may not sound like that much of a bargain, but that is 48 tsp. of vanilla extract! Most recipes don’t call for more than 2 tsp., so that’s 24 batches of cookies. MATH!More vanilla than the beginning of Pleasantville.\nCourtesy of Boxed4. Paper TowelsFor cleaning up messes from baking cookies for parties, I get 12 rolls (1,548 sheets total!) of Prince & Spring paper towels at a time for $16. Their house brand is as sturdy as name-brand and are great for cleaning anywhere in the house.5. Hellmann’s MayonnaiseSpeaking of parties, one of the only products I’m brand loyal to is Hellmann’s mayonnaise. Nothing compares to it, especially for creamy, cheesy baked artichoke dip. It’s a crowd-pleasing recipe that requires an unnatural amount of mayonnaise. I don’t have to use an entire 48 oz. jar for it, but if I did, I would have two! You get 96 oz. of mayonnaise for $15, and you may have a heart attack before you use up both jars.Ann from Arrested Development would love this deal.\nCourtesy of Boxed6. QuinoaRice and quinoa are on heavy rotation in my meal prep, so a 4 lbs. bag of white quinoa ($12 on Boxed) is a good investment. I use it in quinoa and broccoli salad and even breakfast bowls sometimes.7. Soy SauceThere are very few things I cook that a little soy sauce doesn’t go into. It’s a great way to add some saltiness and flavor without adding, uh, salt. A 40 oz. jug of low-sodium Kikkoman soy sauce is $7 on Boxed and goes into a squeeze bottle for adding to stir-fried udon noodles, pork chops, fried rice, egg drop soup, and so much more. The same 40 oz. jug of Kikkoman costs double on Amazon ($14).More canned tomatoes, less problems.\nCourtesy of Boxed8. Whole Peeled San Marzano TomatoesThere are never less than two cans of Cento San Marzano whole peeled tomatoes ($10 for three 28 oz. cans on Boxed) in my cupboard. I can make easy tomato sauce, tomato soup, shakshuka, or even a roasted tomato jam (hot chef tip!) with things I already have in the house.9. Dish SoapI don’t own a dishwasher. I wash a lot of dishes and tomato-sauce splatters. I clean it up, using my trusted Scrub Daddy—which Boxed also has: three daddies for $9—and a giant jug of Dawn dish soap (75 oz. for $9). It would be $1 less for 15 more ounces if I went generic too.You don't need fancy vacuum-sealed bags to sous vide. Freezer bags work fine.\nPhoto by Alex Lau, Food Styling by Anna Billingskog10. Freezer BagsI started sous vide cooking recently and use freezer bags for making medium-rare seared steak, pesto-marinated chicken, or quick-cooking tender shrimp. I can get 152 Prince & Spring freezer bags for $12, which should last me until the next cooking gadget comes out.11. Almond MilkMy coworker Alex Delany really loves Califia Farms Barista Blend almond milk, and even though I’m not a huuuuge alt-milk enthusiast, this stuff is good. And creamy. And I get six 32 oz. cartons for $20 on Boxed. Now I can make many iced lattes at home for pennies! Okay, for about 83 cents if each carton makes four lattes. Again, MATH! One 32 oz. container costs $5 at Whole Foods and Amazon (they are the same thing now, basically).MY DREAM DRAFT LATTE LINEUP.\nPhoto by Alex Lau12. La Colombe Draft LattesI try to make cold brew at home daily, but I always keep some La Colombe Draft Lattes in the back of my fridge just in case. They’re $28 for 12 cans on Boxed, which is about $2.50 per can. Less than a latte at the local coffee shop.Plan an entire gathering around this huge block of Cabot cheese.\nCourtesy of Boxed13. 3-Year-Aged Cabot Sharp CheddarRemember what I said about saving money? I throw that out the window when I remember that you can get TWO POUNDS OF 3-YEAR-AGED CABOT CHEDDAR for $19. It’s aged for three years until it’s sharp and perfectly salty, and it melts into scrambled eggs, macaroni and cheese, or grilled cheese like a dream. But most of the time, I eat chunks of it with Bonne Maman apricot jam and crackers for dinner. I once had an entire party just with this block, a knife, and a small group of friends. We finished it, and I went back online and got another one while we were sitting around in my living room. Saving cheddar and eating cheddar? It’s a win-win.Bulk bins are also great:Explore Bon AppétitGroceryShoppingRead MorecookingMy Love For Bulk Bins Can't Be Measured By the PoundBy Carla Lalli MusiccultureThe Best Kitchen Products to Buy Online This WeekendBy Bon AppétitcookingI Can't Stop Putting Sweet Soy Sauce in Alllll the NoodlesBy Alyse WhitneycultureLa Colombe Draft Lattes Are So Frothy and I'm So HappyBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Alyse Whitney"]}