{"id": "0e681f453264ce4bc24b2cdd5e66686c", "url": "https://www.bonappetit.com/story/chez-panisse-best-lessons", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Lessons from Berkeley's Historic Chez Panisse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat Chez Panisse Taught UsSome of the most beloved chefs, bakers, and food writers have passed through the doors of this legendary café in Berkeley, California. Here’s what they learned on the job.By Elyse InamineMarch 23, 2021FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.Educational. Demanding. Magical. These words come up again and again when you talk to past employees of Chez Panisse, arguably the most influential American restaurant in history. Alice Waters opened the café in Berkeley, California, in August 1971, making simple food with local ingredients. Though “farm to table” is now so common it’s a cliché, at the time a restaurant like this was novel, and so was her way of running it: paying farmers a premium for their best produce, changing the menu daily, giving employees higher than usual wages—and vacation time—and encouraging them to trust their intuition.“The most important thing to me is that we were able to create something that was greater than the sum of its parts,” said Alice Waters in a recent phone interview. “Everyone brought their talents to create Chez Panisse.”The ripple effect of this one little restaurant has been wide. We spoke to just a small corner of the Chez Panisse universe about how the restaurant influenced them and what lessons they took with them when they left: how to treat your employees fairly, cook with confidence, resist overthinking your menu, and so much more. The chefs, authors, and bakers we spoke to have become industry leaders in their own right, passing these values on to the next generation.“They have taken the values of Chez Panisse and interpreted it in their own creative ways,” Waters said. “And I’m just in love with what they created.”Steve Sullivan\nIllustration by Bijou KarmanYour employees come first.“Chez Panisse was set up to benefit employees as much as the business, providing the most sick pay possible, paying people as well as you could, paying for vacation time and health insurance. When we started Acme Bread Co., these were not normal for a bakery or restaurant to offer, but they were baked into our notions of operating a business.” —Steve Sullivan, busser and baker at Chez Panisse from 1975 to 1983 and founder of Acme Bread Co. in BerkeleyKnow where your ingredients come from.“There was such an emphasis on where vegetables came from at Chez Panisse. All the names of the farms we worked with were on the menu, and we took field trips to visit and stay at those farms. That got ingrained in me. So now when I buy mezcal for my beverage shop, I’m thinking about where it’s from, who grows it, what’s the story. We call this ‘grain to glass.’” —Jessica Moncada, busser at Chez Panisse from 2005 to 2010 and co-owner of Alkali Rye in OaklandTrust your cooking intuition.“Chez Panisse is not like any other restaurant, even today. Cooks are encouraged to trust their intuition. You can’t read a book on how to stew onions, for example. You just have to do it, feel confident in your own judgment and be open to all possibilities. That philosophy extends throughout the kitchen. Even if you are the newest cook and have never held an onion, you can say what you think. Every idea is valued.” —David Tanis, baker to co-chef on an off-and-on basis from 1981 to 2011, cookbook author, and ‘New York Times’ food columnistDominica Rice Cisneros\nIllustration by Bijou KarmanPut something unexpected on the menu.“The salad at Cosecha is my nod to Chez Panisse. We get the best greens and go with what’s in season—watermelon in the summer, persimmons in the fall. Some people never had a persimmon until they tried this salad. Alice always did that, bring something special for her guests. I want to do the same for my neighbors.” —Dominica Rice Cisneros, dishwasher to line cook at Chez Panisse from 1998 to 2004 and chef-owner of Cosecha Cafe and forthcoming Bombera in OaklandTurn global into local.“Chez Panisse took French and Italian food and reconfigured them for California. My mother is Japanese, so I spent a lot of time in Japan, going to izakayas and all kinds of restaurants. I realized there was no equivalent for this kind of cuisine: California ingredients with Japanese taste. So I decided to open my own.” —Sylvan Mishima Brackett, assistant to Alice Waters and creative director at Chez Panisse from 2001 to 2008 and chef-owner of Rintaro in San FranciscoLife experience matters more than cooking experience.“When the restaurant opened, we were babes in the woods. None of us had restaurant experience; I had been baking at home since I was kid. We were able to learn as we went along. Because of that, Chez Panisse was an incredibly interesting place to be. The menu changed every night and it was a very collegial atmosphere. So many people who worked there were accomplished in other fields but also fascinated by food and cooking and farming. It was a very different scene compared to the usual top-down restaurant. The constant learning, the constant push to be more than you thought you were kept me going.” —Lindsey Shere, pastry chef at Chez Panisse from 1971 to 1997 and cookbook authorChristian Washington\nIllustration by Bijou KarmanMake your community your purpose.“Sanctuary is on the same page of activism as Chez Panisse but going in a very specific direction. Chez Panisse was a hub connecting farmers and cooks. At Sanctuary, we’re providing Black rest and safety. For me, that means we make space where Black people and POC, especially trans people, women, queer people, and formerly incarcerated people, can come and feel comfortable and have a good time and eat. We want to create a community of cooks and chefs, and we want to highlight little-known chefs to collaborate on menus. Sanctuary is a nonprofit, a restaurant, and an incubator. We’re making our own table and having our community sit at it.” —Christian Washington, prep to line cook at Chez Panisse from 2016 to 2020 and chef at forthcoming Sanctuary in OaklandCook with confidence.“Alice taught me to trust myself, even though I didn’t. That’s really huge when you’re a young person and you’re learning to find your way. You doubt yourself at every juncture. She buoyed me up and gave me confidence. She looked at people from a different point of view compared to other chefs.” —Jonathan Waxman, substitute chef and maître d’ at Chez Panisse from 1978 to 1979 and chef-owner of Barbuto in New York CityPaul Bertolli\nIllustration by Bijou KarmanIf you don’t like the system, change it.“The American meat system is so consolidated. I got into this business to support the regeneration of American farmland, with respect for farmers and animals. That directly came from Chez Panisse.” —Paul Bertolli, co-chef at Chez Panisse from 1982 to 1992 and founder of Fra’Mani Salumi in BerkeleyYour kitchen is your classroom.“Chez Panisse is a teaching kitchen—there’s a lot of investment in cooks. We weren’t interested in cooks’ résumés or schooling but understanding their sensibility about food and helping them come into their own. There is a connection between that environment and my cookbooks. With my books, I want to encourage home cooks and remove any barriers. When I write recipes, I’m like, ‘Go for it. Use whatever you’ve got and see how it comes out, but pay attention so the next time you cook, you learn something. Should you get pancetta instead of relying on bacon? Was the celery that was missing last time important for bringing in flavor?’ Sometimes my tone can be like a parent encouraging their kid to cook.” —Cal Peternell, line cook to co-chef at Chez Panisse from 1995 to 2017 and cookbook authorGet comfortable with constant reinvention.“When I started at Chez Panisse, I was the only professional cook. I did cooking school in France, so when I arrived I had all the technical skills. But with Chez Panisse, especially working with Jeremiah [Tower], I learned to be more imaginative and creative. Every day was a different menu and there were no guidelines except for using what was available. That taught me not to fall into routine and to create new dishes constantly as the seasons changed. When asparagus comes in early spring, they’re sweet and tender, so you can turn them into a wonderful salad. But later in the season, when they’re less interesting, you make it into a soup. This makes your mind work all the time. I have dreams, still, when I don’t have the menu for next week.” —Jean-Pierre Moullé, line cook to co-chef at Chez Panisse from 1975 to 2010, cookbook author, and cooking instructor and cofounder of Two Bordelais in Healdsburg, CASimple is beautiful (and delicious).“What I saw and tasted and learned and did at Chez Panisse followed me to Greens. I wanted food to be beautiful and simple.” —Deborah Madison, prep cook and line cook at Chez Panisse from 1977 to 1978 and intermittently from 1986 to 1988, cookbook author, and formerly of Greens in San FranciscoVivian Ku\nIllustration by Bijou KarmanAlways give something back.“I realized I was part of a great community with multiple stakeholders, not just your customers but your employees and your neighborhood. At Joy, our team makes decisions to reflect this mentality; we donate proceeds from our cookie sales to a different local nonprofit organization each month. We want to give back to a community that has given us so much.” —Vivian Ku, intern and line cook at Chez Panisse from 2010 to 2011 and chef-owner of Joy and Pine & Crane in L.A.Taste early, often, and always.“The cooks were empowered to taste what we were cooking. Taste in the beginning, taste in the middle, taste at the end. Chez Panisse got the most incredible produce—tiny sweet lettuces, dry-farmed Early Girl tomatoes—and you had to taste it, then adjust with oil, adjust with salt. You had to evolve with the ingredient and preserve its integrity by showcasing it in the best way possible. There is an aliveness with the food at Chez Panisse that I strive to bring into my own cooking.” —Andy Baraghani, intern to line cook from 2007 to 2009 and senior food editor at ‘BA’Food can change your life.“Looking back, I didn’t realize what I had really learned from that very important year I spent in Paris in 1965. It awakened all my senses. There were little marketplaces in every neighborhood, and they were absolutely seasonal. That’s where taste is, in ripeness that can only happen in that moment in time. When I came home, I wanted to live like the French. I wanted to eat like the French. When I opened Chez Panisse, I thought it would be a little neighborhood restaurant for my friends. I was trying to create a restaurant where people would fall in love with food. I wanted everyone to experience food the way I did in France. It had changed my life. At Chez Panisse, we weren’t trained cooks. Nobody had a real recipe. We tasted everything together, which opened us to a spirit of collaboration. This took us on a search for taste, and we ended up on the doorstep of the local organic farmers and ranchers and fishers. I learned that food has power—the growing of it, the picking of it, the cooking of it, the serving of it, the eating of it.” —Alice Waters, chef, cookbook author, and founder of Chez PanisseExplore Bon AppétitRestaurantsChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Elyse Inamine"]}