{"id": "0e6fa930b738e847720ffc8ee538f342", "url": "https://www.bonappetit.com/story/pie-or-gallet-feud", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Cabbage’s Big Moment Is Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCabbage’s Big Moment Is HereA popular new recipe, fun food stuff from around the internet, and an urgent dessert feud.By Alex BeggsFebruary 8, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cabbage patch adultsOur most popular recipe of the week was Andy Baraghani’s new Healthyish fall-apart caramelized cabbage. I want to make it this weekend. Cabbage is so cheap and it gets so meltingly tender—or crispy-edged awesome—whatever you want it to be. Raw, crisp slaw if you must! I asked Andy, whose cabbage gratin in the Thanksgiving issue turned me into a certified cabbage head, “Is this cabbage’s year?” “I think it’s become my favorite vegetable,” he confessed. Riveting development!Get the recipe: Fall-Apart Caramelized CabbageWant this letter before it hits the website? Sign up for our newsletter!See you at the Butt HuttWhen I was a nanny my young charge once told me wisely, “Alex, you should never hold a cat when you’re naked,” and that was my motto for living until I read Priya Krishna’s piece in the New York Times about nudist home cooking and now my motto is: “Never make stovetop bacon when you’re naked.” There are so many great...tidbits…(sorry) here, and incredible photographs where fig leaves take the form of a perfectly placed bowl of salad. If only we could all feel this free! (The fanny pack industry would boom!)Read it: The Joy of Cooking NakedPhoto by Alex Lau, prop styling by Kendra SmootPSABecause I’m here for you: Rancho Gordo’s Royal Corona beans—aka “the big beans”—are back in stock for $7/pound. Imagine a white bean so creamy that when you bite into it, it melts into the texture of mashed potatoes. YES. WANT.Find ‘em here before it’s too late.Get the recipe: Big Beans and Tomato VinaigretteBut I really like this recipe too.They’ve seen my heart“Roses are black, your heart is black, these noodles are black.” If you haven’t been feasting your eyes on Genevieve Ko’s recipes in the LA Times, what have you been doing?Even more joyI opened my late aunt Barbara’s 1946 edition of the Joy of Cooking this week and found the diet pamphlet “YOU CAN REDUCE” tucked into the puddings and dessert chapter. I love how much this old cookbook captures a previous era (so many aspics), but if you prefer to live in the present, make sure to grab a copy of the Joy’s latest edition, at long last. If you’re ever stranded on a deserted island and find a fully stocked pantry buried in the sand—maybe a cast iron pan has washed ashore, I dunno, a seagull drops some tongs—this is the book you’ll need. That’s why it’s our Cookbook Club book for February! You have ~4,600 recipes to choose from. NBD.Read more: A Case for Three Copies of the Joy of CookingUnnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen Kaminski“What’s better: pie or galette?” Sarah Jampel started it. Molly Baz propped her foot on a drawer at her station in the Test Kitchen and weighed her hands like Lady Justice: “A galette is all of the glory of the pie without all of the trouble,” she said. “The deliciousness effect is the same, but the effort is minimal. It’s a cost benefit analysis!” “This question is overly simplified and I can’t answer it,” said Claire Saffitz before she was yanked away by her director to make something I can’t disclose gourmet. “PIE FOR LIFE,” said Sohla El-Waylly. “Making a lattice is the best thing ever.” Yeah, if you can do it! It’s hard! “You can make a lattice on a galette Sohla” one-upped Jampel, who prefers a galette except in the cases of [lists 17 exceptions]. Elyse Inamine and I prefer galette because WE LOVE CRUST. “Galette, specifically for the bite where the crust folds over itself,” said Amanda Shapiro. “It’s like a stuffed crust pizza.” Whoa. “Hand pie!” voted off-topic Hilary Cadigan. “All pies are hand pies, if you believe,” said Joseph Hernandez, inspirationally. And then the discussion devolved into talk of Hot Pockets, Pop Tarts, and whether adding ice to seltzer flattens it quicker.Get the recipe: Fall Fruit GaletteExplore Bon AppétitBeggs NewsletterRead MorecookingSummer Is Over but Galettes Are ForeverBy Carla Lalli MusiccookingJust Try Not Going Back for Seconds of This Over-the-Top Cabbage GratinBy Jill BaughmanLifestyleHow to Turn a Vegetable Into a MealBy Amanda ShapirocultureA Case for Three Copies of the Joy of CookingBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-08", "author": ["Condé Nast", "Alex Beggs"]}