{"id": "0e75145cdfe79923293519592f1b8b97", "url": "https://www.bonappetit.com/story/a-lot-of-tomato-toast", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "I'm Making a Lot of Tomato Toast Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Making a Lot of Tomato Toast Right NowNo matter how I prep it, I can't go wrong.By Adam RapoportAugust 20, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Peak-season tomatoes don’t need much. Give me a box of Maldon, a jar of Hellmann’s, and a loaf of crusty bread, and I’m good through Labor Day.Want this letter before it hits the website? Sign up for our newsletter!I will stand at my kitchen counter, slathering mayo on gently toasted country bread, and topping it with a couple thick slabs of plump heirloom tomatoes fresh from the farmers’ market. If I’m feeling fancy, I’ll chiffonade (see, fancy cooking term) some fresh basil and flutter that atop of the generously salted tomatoes.I’ll do this, and then do it again, and then—in all likelihood if no one else is home—I’ll do it a third time. I mean, it’s kinda healthy, right?But let’s say someone else is around. These next two weeks, I intend to aim a bit higher when on tomato toast duty.First up, Andy Baraghani’s everything bagel–like approach to tomato toast (pictured above). Salt is good, but salt with with chives, sesame seeds, Aleppo pepper, and lemon zest is better. Andy’s refined take on what is still a dead-simple dish is a game changer. It is tomato toast for your loved ones.Photo by Emma Fishman, Food Styling by Judy ManciniWhich is slightly different than tomato toast for company. When you’re looking to impress, you want toast topped with warmed butter tomatoes, ginger, soy sauce, and scallions. I mean, how good does that sound?It’s a recipe that is at once chic and summery, the kind you can serve at a sit-down dinner this month, provided that party is on a screen porch and not in an over-air conditioned dining room.As Amiel Stanek, who created the dish, says, “As much as I like a raw, fresh summer tomato, it gets a little oppressive. Warming them gently in butter brings out so much flavor, and makes them so supple and soft.”There are countless things you can do with August tomatoes. But, really, you should never do too much. I like to think that these two tomato toast recipes are just enough.Get the recipes:Tomato Toast with Chives and Sesame SeedsButtered Tomatoes with GingerExplore Bon AppétitAdam NewsletterRead MorecookingThis Pan Con Tomate Is the Tomato Toast of 2019By Andy BaraghanirecipesAccording to Instagram, It’s Tomato Galette SeasonBy Emily SchultzcookingThe Best Tomatoes Call for the Best Tomato KnifeBy Sarah JampelcookingThis Cherry Tomato Vinaigrette Just Makes Me Really HappyBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-20", "author": ["Condé Nast", "Adam Rapoport"]}