{"id": "0e7b0abcc0e625c975aca344d8c66bac", "url": "https://www.bonappetit.com/recipe/sake-braised-mustard-greens-with-sesame", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Sake Mustard Greens With Sesame Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueSake-Braised Mustard Greens With SesameBy The Wolf's Tailor, Denver, COSeptember 17, 20194.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIf you’re making the Miso Pork Ribs With Chile-Honey Glaze from The Wolf’s Tailor in Denver, No. 10 on our 2019 Hot Ten list, you’re going to need a side of these braised greens. (And the Rice Porridge With Dashi too.) Use less-spicy kale instead of mustard greens if you prefer a milder side dish, or try a mixture of both.Ingredients8 servings¼cup toasted sesame oil6garlic cloves, thinly sliced4large bunches mustard greens or kale, ribs and stems removed, leaves torn into large pieces½cup sake or dry white wine1Tbsp. finely grated lemon zestKosher saltToasted sesame seeds (for serving)PreparationStep 1Pour oil into a large high-sided skillet, add garlic, and set over medium heat. Cook, stirring often, until garlic is barely golden, about 2 minutes.Step 2Add a third of the greens to skillet and toss to coat with oil and garlic. Cover skillet with a lid and cook until greens are slightly wilted, about 2 minutes. Uncover skillet; add sake and another third of greens and toss to combine. Cover and cook until greens are slightly wilted, about 2 minutes, then add remaining greens. Cover and cook until slightly wilted, about 2 minutes. Remove lid from skillet, add lemon zest to greens, and continue to cook, stirring often, until greens are completely wilted and tender and most of the liquid has evaporated, about 2 minutes. Season with salt.Step 3Transfer greens to a serving bowl and top with sesame seeds.How would you rate Sake-Braised Mustard Greens With Sesame?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIve made this with both spinach & mustard greens. I enjoyed both! Flavor is fabulous - the sake really adds depth! Produced the perfect amount of liquid! Will make again & again & again....HanLong Island, New York3/23/2022Mustard greens, yes. Maybe spinach. NOT kale - fibrous. Different flavor from mustard greens - not a great substitute. You must also decide if you want your greens as dry as this recipe makes them, as it is written; otherwise, you will need some more stock  or something. these do not make any pot liquoracookfromdetroit10/1/2019Explore Bon AppétitMustard GreensLeafy GreensVegetableSakeAlcohol & Other DrinksQuickEasySideDairy-FreeGluten-FreeVeganVegetarianHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "The Wolf'S Tailor", "Denver"]}