{"id": "0e7c64781e3aabb31de9cf6274219ef0", "url": "https://www.bonappetit.com/recipe/crispy-miso-butter-fish", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Crispy Miso-Butter Fish With Asparagus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Miso-Butter Fish With AsparagusLevel up your weeknight fish routine with a crispy, flavor-packed crust.By Shilpa UskokovicMay 9, 20214.3(102)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintIt’s hard to resist the lure of crispy anything. Here, quick-cooking fillets of fish are slathered in a deeply flavorful combination of miso, butter, and panko, then broiled until the breadcrumbs form a toasty, golden crust. My days as a line cook at Perry St restaurant in New York inspired the technique behind this dish. It was my first job out of culinary school, and in the winter we’d make a similar dish using roast cod topped with a thin sheet of truffle butter reinforced with panko. This is an easier, far more accessible version that’s just as tasty. I use my preferred technique of cooking fish with the skin on (it holds the flesh together as it cooks) yet with no intention of getting it crispy—I just lift the fish away from the skin when it’s time to serve. I find that chasing crispy fish skin is a heartbreaking pursuit, so I don’t even bother. Besides, you won’t miss it with all the texture from the buttery panko business on top. —Shilpa Uskokovic All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFish Spatula$14 At Amazon8-Inch Chef's Knife$47 At AmazonMicroplane$16 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketSmall Bowl$13 At AmazonCutting Board$10 At IKEAOxo Stainless Steel Measuring Spoons$11 At AmazonMeasuring Cups$18 At Bon Appétit MarketHeavy-Duty Aluminum Foil$10 At TargetIngredients4 servings1½lb. asparagus2tsp. avocado or vegetable oilKosher salt44–6-oz. skin-on arctic char, sea bass, or salmon fillets5Tbsp. unsalted butter, divided6Tbsp. white or yellow miso1Tbsp. plus 1½ tsp. Sriracha1Tbsp. sugar9garlic cloves13\" piece ginger⅔cup pankoPreparationStep 1Place a rack in upper third of oven and preheat to 400°. Line a rimmed baking sheet with foil. Line up 1½ lb. asparagus on a cutting board and trim woody ends (about bottom 2\") with a chef’s knife; discard. Slice spears into 1\" lengths and transfer to prepared baking sheet. Drizzle with 2 tsp. avocado or vegetable oil and season with kosher salt. Using your hands, toss well to coat. Push asparagus to one side of baking sheet.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Pat four 4–6-oz. skin-on arctic char, sea bass, or salmon fillets dry with paper towels. Place, skin side down, on empty half of baking sheet.Step 3Now, make the miso butter: Place 3 Tbsp. unsalted butter in a small microwave-safe bowl. Microwave on medium power in 20-second intervals until melted. (Alternatively, melt butter in a small skillet over medium.) Add 6 Tbsp. white or yellow miso, 1 Tbsp. plus 1½ tsp. Sriracha, and 1 Tbsp. sugar. Smash and peel 9 garlic cloves. Finely grate on a Microplane into miso butter. Peel one 3\" piece ginger with a spoon; finely grate into butter. Stir to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Melt remaining 2 Tbsp. unsalted butter in another microwave-safe bowl. Stir in ⅔ cup panko.Step 5Dollop about two-thirds of miso butter over fish, spreading it into an even layer with spoon. Sprinkle buttered panko over fillets and gently press with your hands to adhere. Roast fish and asparagus until fillets are firm when sides are gently pressed, 15–17 minutes. Step 6Heat broiler (to low, if your oven allows). Broil (watching carefully), rotating baking sheet halfway through for even browning, until panko is golden brown, about 3 minutes. Remove baking sheet from oven and immediately drizzle remaining miso butter over asparagus; toss to combine.Step 7Slide a fish spatula between fish skin and flesh and do your best to gently lift away the fillets (skin won’t be crispy, so it’s best left behind). Serve fish with asparagus.How would you rate Crispy Miso-Butter Fish With Asparagus?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleToo salty this is when I did not add salt where asked to AnonymousNew Jersey 3/18/2022I followed the recipe pretty closely, and used light miso (gf) and gf panko. After reading the reviews, I only salted the asparagus lightly, spread a thin layer of the miso butter on the fish, and tossed the asparagus with less butter than pictured. The end result was delicious and different from anything I usually make. I didn’t find the flavour overpowering at all, I think in part because I used light miso, which is milder. I cooked the salmon for a bare 15 minutes and only had to broil for a minute and a half to brown the panko. Salmon was lovely; I think it helped that I got it to room temperature before cooking.JaneApp2/17/2022Include  printable recipe, please!!!!AnonymousAlexandria, VA1/31/2022Waaaaaay too much paste, and much, much too salty. I mean, don't get me wrong, I *love* salt but I could literally feel my blood pressure elevate. Also, even if the salt was dialed down, the flavor was just too damn much. Definitely DO NOT mix the paste with the asparagus. Or, better yet, just make another recipe. \nMy leftovers will be going straight into the trash.AnonymousWashington, D.C.1/18/2022I’ve made this several times an think it’s a keeper.  I agree that if the fish fillet is thin, you need to reduce the paste and also maybe leave the veggies plain as the paste is so intense.  I’ve cooked this with striped bass, black bass and Chilean sea bass and they have all be delicious.JodiNYC12/20/2021One of the most delicious fish recipes I’ve ever made. Read other reviews, played around with recipe and here’s my two cents…I prefer the (non refrigerated) shelf version shiro miso paste. It’s Mild & Sweet with better texture. Used 1tsp of Gochu Jang paste instead of Sriracha and omitted ginger entirely. Personal preference. Next, cover filets with miso butter depending on their thickness. If you have thinner filets only spread a thin layer, otherwise it overpowered it for us. Just eating mouthfuls of paste. Thicker, obviously use a little more. Pile on the panko. That’s the secret weapon. Read another review about baking…I kick the oven up to 425 and find I don’t even need to broil. Keep them in til darker golden brown crust forms and fish “just” starts to separate. It’s weird cuz you literally have to eye it. Lastly, didn’t spread it on asparagus. It just overpowered it and we try to be fairly mindful of our salt intake. This recipe is a total winner and so easy! A. IngallsLos Angeles 10/23/2021It was quick, easy, and very delicious! However, it was very salty and I found that the asparagus really didn't need the miso topping. The balance of this dish needs some adjustments but it is a definite do again!ThomasRochester, NY10/18/2021Delicious, quick, and simple! Perfect weeknight meal. The miso butter is SO good. I did not find this to be too salty, at all. LauraPhiladelphia, PA10/15/2021Fantastic weekday dinner that's super easy to make. I made it with salmon filets & served with a microwave packet of brown rice & quinoa. Next time b/c of my oven, I'll bake/roast for 12min & switch to broil for 2min to get it nice & browned,yet a tad underdone.SoCalJLRSan Diego, CA 10/12/2021i really wanted to love this dish but i found it incredibly salty. i followed the recipe exactly except for using less sriracha. i don’t know if it was the miso i used. i wish i had loved it as other reviewers did. i might try it  again with a 1/3 of the amount of miso and see if that makes a difference. jenLos Angeles 9/23/2021Overall this dish was awesome but I'll use less miso less time.  I used green beans because it's what I had.  I'll definitely make this again!  EvanTulsa, OK9/1/2021Love this recipe. The spice with the crunch and the flakey white fish… I used Sole, so quick cooking… easy and healthy. My fish was large so I modified the sriracha/ miso as well as the cooking time. Asparagus yummy but I also tried lightly broiled zucchini served with wild rice. Awesome compliment K gallucci Houston Texas 7/8/2021Next time, I’ll use half as much of the miso butter on the fish. It’s super flavorful, but it was slightly over powering. Loved the crunch of the panko, wouldn’t change that.  We used striped bass, and it was great. As the fish rested, I roasted the asparagus separately like I usually do, on a sheet pan with a little oil, under high broiler for about 3-4 min. Finishing asparagus with a tad of miso butter was yummy. LaraChicago, IL6/30/2021This was INSANE. Quite possibly the best fish recipe I've ever made. And also the easiest. Followed the recipe exactly, minus one minute from initial cook time. Thanks BA!DanielleSan Francisco, CA6/24/2021Made this recipe exactly as written using 4 8 oz filets of salmon. I  was worried the salmon would overcook after cooking for that long, but it turned out incredible, and would definitely make it again!JacobPhiladelphia, PA6/24/2021Explore Bon AppétitArctic CharFishSeafoodBassSalmonMisoCondiments, Sauces & PastesAsparagusVegetableEasyMainNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-09", "author": ["Condé Nast", "Shilpa Uskokovic"]}