{"id": "0e868bf7a5bb1d0ae6209413be6488d3", "url": "https://www.bonappetit.com/story/braised-chicken-soup-with-greens", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "This Chicken Spinach Soup Recipe Is PERFECT for Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Braised Chicken Soup with Greens Recipe Is PERFECT for SpringThe silky, spiced broth comes together while the rice cooks and the onions quick-pickle.By Chris MoroccoMay 21, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailMy family is loud. New boyfriends, girlfriends, and “just friends\" who are visiting get advance warning about what to expect when joining us for a large gathering: It’s going to be loud and you will be asked a lot of questions. A normal conversation between my uncles about whether or not the lamb is done will come across as a shouting match between four guys all doing their best to impersonate Tony Soprano. There is just one thing that we don’t argue about: How much we all love food.While I have never approached the decibel level of the generation above me, I certainly have a genetic predisposition to asking people a lot of questions, particularly when they are as into food as I am. So it wasn’t weird, at least to me, that when I met my cousin Sarah’s Lebanese boyfriend, Albert, for the first time at our most recent family wedding, I talked to him non-stop about food for an hour, then continued the conversation by text message for weeks after that. And when Sarah’s sister went to visit her and Albert in San Francisco, I asked her for a full report on everything that Albert had made even though I was 3,000 miles away the whole time. Definitely not weird at all.There was one dish in particular that she described as particularly vibrant and delicious: braised chicken with some type of green that apparently had a back story. I needed to know more. Naturally I went right to the source, and, if Albert was confused or even concerned about his girlfriend’s cousin texting him about a meal he made for somebody else, he hid it really well.Molokhia is the dish. It is also the name of the green leaves that had such beguiling texture and intensity. The molokhia leaves are also known as jute or Jew’s mallow (a bitter green somewhere between spinach and sorrel that can get viscous, similarly to okra, when cooked). Most likely originating in Egypt, where it is still widely consumed, versions of the dish are also popular in Lebanon and in many parts of Africa. Molokhia as a dish can take many forms, but usually involves a braised meat. Albert braises the leaves with chicken and garlic and tops it with onion and pita chips, served over rice. It struck me that it was a lot like the chicken soup I grew up eating, but with headier spices and toppings that are way more fun than dusting of Parmesan that is standard in my family. It inspired me to reconsider what a slow-cooked spring chicken soup could be.You start by pickling the red onion so it has time to hang out and soften. Next, you cook the white onion until it's melting-tender in butter and olive oil (the butter adds extra flavor and richness; feel free to use all oil, though.) When the onion is very soft and right on the verge of starting to brown, add the garlic, cardamom (I use cracked pods and count how many I put in so I can retrieve all of them later. Ground cardamom just isn’t as good but I can’t stop you from using it), coriander, and pepper flakes. Once all those aromatics are all super fragrant, wilt down the spinach. I like using mature spinach for this, with wide hollow stems since it stands up to braising way better than the baby stuff can.Next you'll add the chicken and just a couple cups of water. You might think you should use stock here, but you can accomplish so much flavor-wise, by just putting lots of aromatics, some fat in the form of oil or butter, and a good amount of meat in whatever you're cooking. Simmer the soup until the chicken shreds easily while you make the rice. Make sure it's seasoned generously with salt, and that's it! The richly spiced broth will take on a silky texture from the butter and oil. Divide it among bowls, spoon some rice into it, then top it with the drained pickled onion and pita chips. It’s a chicken soup for spring—anytime.Get the recipe:Braised Chicken and Spinach Soup with Pita ChipsMolokhia, a braised chicken and greens dish popular in Lebanon and Egypt, inspired this riff on chicken soup.View RecipeExplore Bon AppétitHealthyishMiddle EasternSoupChickenChicken BrothDinnerRead Morecooking54 Healthy Chicken Recipes That Make Us Fall in Love With Poultry AgainGallery54 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-21", "author": ["Condé Nast", "Chris Morocco"]}