{"id": "0e8da6d0c45703b99a848785775708cd", "url": "https://www.bonappetit.com/story/texas-kolaches", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The Kolache Used to Be Gas Station Grub—Now It’s Everywhere, and Fancy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Kolache Used to Be Gas Station Grub—Now It’s Everywhere, and FancyI spent two days and 375 miles tracking down 20 different versions of Texas’ favorite pastry in one epic road trip.By Priya KrishnaMay 13, 2019FacebookTwitterEmailPhoto by Priya KrishnaFacebookTwitterEmailIf you've never been to Texas, you’ve likely never heard of a kolache. Yet the pastry is one of my home state’s greatest concoctions—a plush round of yeasted dough filled with fruits and/or cheese (not sausage; that’s a common misconception). It arrived in Texas in the late 1800s thanks to an influx of Czech immigrants seeking an abundant place to settle.A number of Texas-Czech descendants opened gas stations near the highways and sold kolaches there, setting up the pastry to become a road-trip staple. I remember stopping on school field trips, a teacher hopping out to buy a few dozen for the class. I fell in love early with the varying saccharine fillings, nostalgic and addictive as Pop-Tarts.On recent Texas homecomings, however, I’ve noticed a change. Kolaches aren’t just gas station grub anymore. You’ll find them in trendy backyard beer bars, filled with artisanal jams; at Indian restaurants, laced with cumin and turmeric. They’ve even infiltrated Texas’ most sacred of eating establishments: barbecue joints.The road trip map.\nIllustrations by Oscar Bolton Green, Photos by Priya KrishnaBut are these spice-studded, brisket-filled creations even kolaches anymore? Is this progression decidedly un-Texan, or indicative of a new kind of Texas? I needed to find out. So I plotted a 375-mile road trip from my hometown of Dallas to Houston, and several cities in between. All in: 20 kolache spots in two days. To layer on the drama, I decided to invite my parents...who both happen to hate kolaches.While Mom and Dad weren’t jazzed on the idea of endless kolaches, neither can resist a good family vacation. So my dad rented a special car (a distractingly red Nissan Pathfinder), despite the fact that we have two perfectly functional vehicles at home, memorized the Wikipedia entry on kolaches, and packed a box of vegetables (to eat instead of the kolaches, he clarified). My mom spent the first hour of the trip explaining that kolaches are “too eggy” and scrunching her face in disgust.Admiring kolaches at the Village Bakery in West.\nPhoto by Priya KrishnaWestUndeterred, I navigated to our first destination: the Czech Stop, a heavily touristed gas station counter in West, a small town built up by Czech immigrants 80 miles south of Dallas. There we ate poppy seed kolaches outside while my dad filled up the tank. The juxtaposition of expertly made pastry and the eye-watering smell of gasoline just felt so...Texas. My mom, the so-called kolache hater, was thrilled, having only ever seen poppy seeds in savory Indian cooking. She loved the soft tufts of dough! It wasn’t eggy! A Czech woman visiting from France told us these kolaches were better than her grandmother’s. Sorry, babička!Lemon (left) and jalapeño sausage-cheese kolaches at B&B Donuts.\nPhoto by Priya KrishnaThe sleeper hit was the Village Bakery, located just down the road in an area that looked straight out of a spaghetti Western. That poppy seed kolache was pillowlike in its squishiness—slightly underbaked in all the right ways, earthy, and not too sweet. Then my dad befriended Evelyn and Mildred, the elderly caretakers of a local museum full of Oregon Trail–style covered-wagon replicas and eerily realistic mannequins dressed in traditional Czech outfits. Ultra-niche museums on barren stretches of road? Also very Texas.The almond strawberry kolache at Austin’s Sour Duck Market.\nPhoto by Priya KrishnaAustinBatch Craft Beer & Kolaches is about as Austin as it gets: a sunny outdoor patio, attractive hipsters brandishing large dogs, and no fewer than three bachelorette parties with T-shirts reading “Brews Before I Do.” Batch’s kolaches, served with a local IPA, were a far cry from the ones we had in West: no poppy seeds, no crumpled paper bag, no whiff of petroleum on the side. Instead they had an interior of peanut butter and homemade grape jam.Next came almond-strawberry kolaches under heat lamps at Sour Duck Market. Then a stop at the new Carpenter Hotel (helmed in part by BA’s editor at large Andrew Knowlton), where my mom kept trying to Instagram the beautifully spiced migas kolache against a vintage banner backdrop because she is very hip. Even Kerlin BBQ, a classic Texas joint, got in the game, stuffing brisket and melty cheddar into a pastry shell. Some Texans would consider this an unholy mash-up. My father, the so-called vegetarian, snuck a bite and sighed with delight.Klobásnek kolaches at the Carpenter Hotel in Austin.\nPhoto by Andrew KnowltonHoustonIn a city where neighborhood pho joints sit next to splashy steakhouses, kolaches fell along a similar spectrum. At one end was UB Preserv, owned by celebrated restaurateur Chris Shepherd, where we chomped on kolaches with a pretzel-like base and ground beef filling. At the other end was the Indian café Pondicheri, located in a fancy strip mall popular among the city’s large South Asian population (many of my family members included). There the kolaches were stained yellow with turmeric, filled with butter chicken, saag, and mushrooms, and served with masala chai. Dad crowned the meal “Indo-Czech-Texan.”Signage at Kerlin BBQ.\nPhoto by Priya KrishnaAs for me? I thought back to my early days scarfing down dollar pastries on school trips, feeling uncomfortably full but very satisfied. To me the kolache has always been defined more by a sense of place than a specific style or filling. Something about eating it off a patterned ceramic plate at a trendy bar just didn’t feel right. It didn’t feel Texas enough.Brisket and PB& J kolaches at Batch in Austin.\nPhoto by Priya KrishnaBut my dad had a counterpoint: Where but the Lone Star State could you find an Indian immigrant like Pondicheri chef-owner Anita Jaisinghani stuffing saag into yeasted dough? Or a pitmaster like Bill Kerlin willing to put his prized brisket into a Czech pastry? This multiculturalism embodies the Texas narrative. It’s what makes my dad—a guy who regularly sprinkles chutney powder on pasta— proud to live here. So perhaps we are both right. Perhaps it is equally “Texas” to eat kolaches by the gas pump as it is to watch them evolve with a statewide dining scene that grows more diverse, ambitious, and multifaceted by the day.Oh, and that box of veggies my dad packed? They returned with us to Dallas, virtually untouched. And maybe that’s the most Texas thing of all: choosing to eat 20 pastries in lieu of fresh produce—and not regretting it.Explore Bon AppétitTexasRoad TripPastryRead MorecultureEating My Way Through Atlanta, I Learned It’s Much More Than Black and WhiteBy Rembert BrownerestaurantsThe Second Best Reason to Go to Marfa Is This Rotisserie ChickenBy Julia KramerLifestyleWhy I Launched the First Indonesian Food Truck in San FranciscoBy Siska Silitonga MarcuscultureHow Dunkin’ Donuts Shaped My Parents’ New Life In AmericaBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-13", "author": ["Condé Nast", "Priya Krishna"]}