{"id": "0e8f7bb5ad75626e27bcb36d1476890f", "url": "https://www.bonappetit.com/story/ashwagandha-stress", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Ashwagandha Can't Fix Stress When You Have a Burnout Lifestyle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAshwagandha Couldn't Cure My Burnout Lifestyle—Here's What DidNo amount of adaptogens could make me invincible.By Adriana VelezMarch 27, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI can’t remember which happened first during my summer of hell: my screaming match with a Madison Square Garden roadie in the middle of the street, or coming down with shingles. I do remember both times thinking, A: This is clearly a wake-up call and B: So much for ashwagandha, that snake oil.Maybe I was being a bit unfair to the ashwagandha.The summer of 2016 was an anxious time for anyone following the presidential elections, but for me it was a doozy. My dream job wasn’t quite turning out how I’d expected. My boss was let go in a restructuring, and I was afraid that I would be next. I became one of those sad-desk-lunch-eating trolls who puts off relieving herself at the restroom just to get one more thing done, shoulders permanently hunched up around my ears. I rarely saw the sun, except during my daily 25-minute run/walk from Grand Central. Between that and the train ride from White Plains, I spent three hours a day commuting and, no, you can’t work on the train. Not if you pass out within seconds of sitting down.I couldn’t relax much at home, either. My adolescent son and I had left Brooklyn—my home for the past 18 years—and moved into a new place in the suburbs with my boyfriend. We expected a smooth adjustment, and, for our naivete, we were rewarded with the opposite.Meanwhile, I prepared to put my Brooklyn apartment on the market for the second time after the co-op board had rejected a first offer. The contractor I hired to paint my 550-square-foot space dragged what should have been a two-week job into a months-long saga filled with mysteriously long absences.Naturally, I decided that summer was also a fine time to start doing 6 a.m. CrossFit workouts. “There, the hardest part of my day is over!” endorphin-intoxicated me would say after class. It was often a lie.I was overwhelmed, but I didn’t feel like I deserved to feel overwhelmed. This life was just what all urban moms do every day. So what if I had a constant tingling in the back of my neck and shoulders, like my nervous system was flickering on and off? I just needed a little extra support.Which brings me to the ashwagandha. If I were telling this story 30 years ago, we’d probably be talking about cocaine: That’s what used to fuel unrealistic expectations for human performance. But, these days, we ambitious, do-it-all urbanites prefer wellness to the explicitly toxic. Ashwagandha is an adaptogen, meaning that it supposedly helps our bodies adapt to stresses. There are many adaptogens out there, but ashwagandha is considered the queen of them all. Preliminary research shows that it’s moderately effective in lowering cortisol in chronically stressed but otherwise healthy people. The root has anti-inflammatory properties and may even mimic the neurotransmitter GABA, which helps you sleep and feel like every little thing’s gonna be alright.The many forms of ashwagandha supplements.\nPhoto by Alex Lau, Styling by Emily EisenWith a name that sounds like a magic spell, ashwagandha would carry me through the chaos, I was sure. I researched the best type ashwagandha—powdered root extract made palatable in a capsule—and started taking a daily dose of 450 milligrams.Maybe if I’d taken the “optimal” dosage of 6000 milligrams a day (according to Examine.com) I may have felt differently. But through the month or so that I took my daily capsules I felt hopeful. I knew these gentler forms of treatment could take a few weeks to become effective. Surely any day now I’d wake up feeling invincible. Meanwhile the pace and pressure of my life showed no signs of abating.Then, one Friday evening on the train home, I found a couple of itchy welts on my neck. I thought they might be spider bites. The next morning there were more, and they traveled down past my collarbone, looking more like a rash. I was also feeling achy and more fatigued than usual, so I saw a doctor. She took some skin samples and led me to believe I had oral herpes for a full 24 hours before the lab results came back with a less terrifying, but just as perplexing, diagnosis: I had shingles. If you’ve ever had the chicken pox, the varicella-zoster virus lingers in a dormant state somewhere in your nerve tissues near your brain and spinal cord. When the virus is reactivated, it comes back as shingles, which shows up as sometimes itchy or painful welts, usually on one side of the body.Typically, it’s a weakened immune system or age that awakens varicella-zoster. But stress can do it, too. I’m fairly certain that’s what caused mine. Basically shingles was my nervous system staging a mass rally against my lifestyle and mindset.I wish I could say I knew exactly what changes I needed to make, that I took my health into my own hands and became my own savior. Instead, small steps on my part and larger events outside my control did it for me.I took an antiviral and the shingles cleared. I got some extra sleep on the weekends. A colleague recommended a book on not worrying. The sticky heat of summer cooled into fall. My tenacious real estate agent sold my apartment and this time the co-op accepted the offer. We got through the holidays. Just after the new year, I closed on my apartment sale, deposited the proceeds, and was laid off in a second restructuring at my company. I cried with relief.All this passed, then everything was quiet. And that’s when I looked back on the unruly, hydra-headed lifestyle I’d been trying to manage with a couple daily doses of root extract. I realized that no amount of ashwagandha or maca or cordyceps would make me invincible. You can’t out-adaptogen a burnout lifestyle.But maybe I could broaden my idea of what an adaptogen is. Maybe it was more than powdered roots. Maybe it could include rest, alone time, meditation, a network for supportive friends and advisors, the word “no.” What if I used these adaptogens to actually prevent myself from creating a burnout lifestyle in the first place?I tossed out the ashwagandha after my shingles diagnosis, but I kept experimenting. That winter my naturopath doctor started me on amino acid supplements. Those seemed to help for a couple months and then not so much. The daily cocktail of fish oil, minerals, and vitamins she also prescribed definitely made me feel stronger and more energetic, though. On the rare occasions when I feel that prickling feeling in the back of my shoulders I have some kava. But what made the most difference was changing my lifestyle.Instead of jumping back into another full time job, I decided to freelance at home. Now I have time for slow, end-of-day unwinding walks instead of commuting sprints.I worked with a coach who helped me reevaluate the expectations I set for myself and better manage my stress. As a divorced and remarried mom, she also helped me steady my little blended family, too.I reduced my CrossFit workouts to two or three times a week and filled in the rest of the days with less punishing activities like yoga.Most helpful of all, I started meditating every weekday morning. It’s a dedicated, mandatory time for me to check in with myself and take a reading of my stress level. I sit with any emotions that might otherwise get mashed down, only to erupt again later some other way, like in the form of another round of shingles. And it’s a good thing I’m doing this: I’ve started a small business and am planning my wedding—but now with a better wellness toolbox for support.I still believe in doing big things. But now I know I can’t continue mindlessly hurtling myself into the world, my energy scattering every which way. As for adaptogens, I’ve just ordered some rhodiola rosea to soften the March blahs. I’m not expecting it to work magic, though.Explore Bon AppétitHealthyishessayRead MoreLifestyleWhat Are Adaptogens, and Why Is Everyone Talking About Them?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Adriana Velez"]}