{"id": "0eb048d72ae754cfaab8db24a5107fda", "url": "https://www.bonappetit.com/story/24-solar-terms", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Following the 24 Solar Terms Helps Prevent My Winter Colds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Hyper-Seasonal Eating Strategy Helps Prevent My Winter ColdsIn Traditional Chinese Medicine, eating with the 24 solar terms promotes harmony both within our own bodies and with the outside world.By Megan ZhangOctober 28, 2020FacebookTwitterEmailIllustration by Rose WongFacebookTwitterEmail\"So that's why you always get sick in winter!\" my grandmother exclaimed with the triumph of a case-cracking detective.I was visiting my grandma in China's eastern province of Jiangsu and had accompanied her to the grocery store. She'd asked me what fruit I wanted to eat, and after hearing my watermelon suggestion, had stared at me incredulously and with some disapproval, as if I had just sprawled out on the floor of the citrus aisle. My grandma pointed out that it was already autumn.This wasn't the first time I'd heard someone in China associate dietary habits with the time of year. It was true that berries indeed tasted best in summer and oranges in winter, but growing up in California, I'd never paid much thought to what the season was before biting into a piece of fruit. After temporarily relocating to Beijing for work, I often heard cryptic statements like, \"Eat radish in winter and ginger in summer.\"I did seem to catch colds more easily than most of my family, especially in chillier months. My first frigid winter in Beijing had been particularly challenging, sinuses barely unclogging in time to surrender to the next bout of illness. I had attributed it to my immune system calibrating to a different country and climate. But my grandmother insisted my proneness to colds could be diet-related, so before temperatures again hit the frosty sub-30s, she sat down with pen and paper to write meal guidelines for me. Expecting an index of herbal concoctions from her old job at a pharmacy, I was surprised when she handed me a list of meat and produce, along with suggestions for how to prepare them. The goal of these adjustments, my grandmother explained, was to help my body achieve a state of equilibrium.\"It's getting colder, so yin energy will become more plentiful. Your poor immunity in winter might trace back to a deficiency in yang,\" she told me.According to Chinese cultural beliefs, yin-yang is a cosmic duality that is believed to govern the rhythms of the universe and can be observed in the interplay between pairs of opposing or complementary natural forces: moon and sun, cold and hot, darkness and lightness. Even the human body and its organ systems are subject to the dichotomy of yin and yang, which must be balanced for optimal health, and the foods we eat play a critical role in achieving that inner equilibrium.Based on Traditional Chinese Medicine (TCM), weather, too, strongly influences the equilibrium of the body's constitutions. \"In each human body is a small environment, which corresponds to the greater environment. The rhythms of the outside world also apply to the human body,\" said Chang Huizhong, a TCM practitioner.According to traditional beliefs in many East Asian countries, the sun's ever-shifting position in relation to the Earth divides each calendar year into 24 solar terms, each of which is associated with meteorologic changes. In ancient China's agricultural society, the solar terms of the Northern Hemisphere received descriptive names evocative of agrarian life: \"Awakening of Insects\" (Jingzhe), \"Rain Water\" (Yushui), \"Cold Dew\" (Hanlu). The 24 phases not only helped farmers harmonize their agricultural production with nature by regulating the timing of sowing and harvesting, but also helped them anchor what they ate to the cadences of the Earth. Different foods are considered optimal in different climactic conditions, so people adjusted their diet and lifestyle corresponding to the time of year.\"Full Grains\" (Xiaoman), for example, is the second solar term of summer, when the husks of wheat and rice grow plump, traditionally signaling the approach of harvest. And as the weather grows hot and humid, people are advised to eat foods that have cooling \"yin\" properties, such as cucumbers, carrots, and bitter herbs. Eating in accordance with the solar terms emphasizes foods which replenish elements that may be susceptible to deficiency during a particular time of year due to weather. Often those are foods that are also freshest in that season.\"Confucius emphasized the importance of eating foods in their proper season,\" said Chen Jie, a chef in Beijing. \"Every household in China tries to follow this principle. It's imprinted in our brains.\"Chen told me he follows this instinct closely both when cooking for his family and in running his restaurant.\"A day without eating in-season foods isn't going to suddenly make you feel ill,\" Chen explained. \"But this way of eating is natural. We choose ingredients that are meant to be consumed right now. That's what will taste freshest and purest.\"What eating with the solar terms commonly means is making the most of foods by consuming them at their prime, at the height of their nutritional potential. To put it simply, it's an eating mindset that respects the natural life cycles of our foods, and can improve harmony both within our own bodies and between our bodies and the outside world.In my case, if an excess of yin energy was at the root of my sluggish immunity, it made sense that my grandmother's list included \"heating\" foods, many of which happen to ripen in colder months and are said to strengthen yang in the body.So, back in my Beijing apartment, I decided, out of filiality and curiosity, to treat the coming winter as an experiment in wellness. Every morning, I dutifully—though a bit skeptically—started my day with ginseng and goji berries steeped in hot water. Standing over the stove cooking yang-strengthening meals became the hallmark of my evenings: stir-frying mutton with chestnut, stewing beef with onions. Bless my grandmother for including sweet fixes like black sesame porridge and sponge cake with dates.When I consulted Chang about my grandmother's recommendations, he agreed that my illness-prone self could probably use a boost in yang, especially in this chilly season.\"Yang energy, just like your clothing or the walls of your home, acts like a protector. It defends you from the cold. If you're deficient in yang, you'll get sick more easily. It's as if your home were made of bamboo poles. It won't block wind from entering through the cracks,\" said Chang. \"Bringing your body back to a state of equilibrium will make you less vulnerable to temperature changes.\"That season I did my best to adhere to my grandmother's guidelines. When the Autumnal Equinox (Qiufen) solar term heralded the arrival of cooler weather, I poured warming huangjiu, or yellow wine, to enjoy with dinner. When Light Snow (Xiaoxue) indeed brought snowfall, I ate more vitamin A-rich radish, said to help combat the abdominal distention that can result from the meat-heavy dishes often eaten in chilly weather. During the wintry storms of Heavy Snow (Daxue), I stayed indoors and cooked hot pot with friends, adding plenty of pepper for the ingredient's supposed anti-inflammatory properties. Chang also recommended lifestyle changes to keep in mind during the winter solar terms: embrace slowness through yoga and meditation, sleep earlier and wake up later to preserve energy. That last one came pretty easily.As my grandma now proudly tells our relatives, that was my first winter in a while without a bout of cold or flu. To be sure, neither of us can fully guarantee that my diet was the primary factor; perhaps my immune system regulated itself over time, or maybe the lifestyle adjustments helped decrease my stress levels. But being more attentive to what I was putting in my body certainly made me more aware of my overall health and well-being. After all, the 24 solar terms have been guiding billions of people's dietary habits for millennia and were even listed as a UNESCO Intangible Cultural Heritage of Humanity in 2016. Chances are there's a reason people have continued living by them for so long: celebrating the Earth's bounty each season is a pretty delicious and practical guiding principle that anyone can follow. And when the weather gets warm again, I'll be sending my grandmother some watermelons—you know, when they taste best.Everyone’s nutritional needs are different, and the climate varies greatly across China and the rest of the world. These are a handful of the traditional foods Chinese people often consume more of during each solar term:SpringBeginning of Spring (Lichun), Rain Water (Yushui), Awakening Insects (Jingzhe), Spring Equinox (Chunfen), Clear and Bright (Qingming), Grain Rain (Guyu)Spring brings revitalization and the start of a new cycle. It’s a great time to load up on fresh green vegetables, such as bean sprouts, chives, amaranth leaves, coriander, and spinach. As temperatures gradually rise, Chinese people often enjoy foods that are said to moisten the lungs: pears, lotus seed, and loquat, for instance. Prepare for the approaching heat of the summer by drinking plenty of antioxidant-rich tea.SummerBeginning of Summer (Lixia), Full Grains (Xiaoman), Ripening Grains (Mangzhong), Summer Solstice (Xiazhi), Lesser Heat (Xiaoshu), Greater Heat (Dashu)With the onset of heat and humidity, Chinese people aim to dispel excess internal heat with “cooling” foods such as sow thistle, bitter melon, cucumber, and mung bean. Keep up vitality by eating light but high-protein foods, such as boiled chicken eggs or salted duck eggs. Months of humidity often leads to lethargy and poor appetite—eating sour green plums can boost appetite, and consuming ginger can promote healthy digestion. As the summer heat peaks and encourages crops to ripen, bite into nutrient-rich lychee, cantaloupe, or pineapple to stay hydrated.AutumnBeginning of Autumn (Liqiu), End of Heat (Chushu), White Dew (Bailu), Autumnal Equinox (Qiufen), Cold Dew (Hanlu), First Frost (Shuangjiang)To protect the respiratory system from the dry autumn weather, Chinese people often eat foods such as honey, lotus seed, and lily bulb—while also keeping moisture-replenishing seasonal fruits such as longans, apples, and peaches in heavy rotation. As the weather cools, families begin cooking heartier meat dishes: think roasted fish, braised pork, and hairy crab. Be sure to enjoy the autumnal crop bounty while it’s in season: chestnuts, pumpkin, hawthorn, and persimmons make for cozy fall snacks. Wash it all down with a glass of huangjiu, or yellow wine.WinterBeginning of Winter (Lidong), Light Snow (Xiaoxue), Heavy Snow (Daxue), Winter Solstice (Dongzhi), Lesser Cold (Xiaohan), Greater Cold (Dahan)In frigid temperatures, invite friends around for a hearty meal of hot pot, with plenty of mutton for the meat’s warming properties. Red dates and black sesame are believed to restore energy and combat internal coldness. Chinese people also typically cook many rice dishes around winter: sticky rice with sausage and meat, or Laba congee (with rice, red bean, peanuts, and dried fruit), are good choices! To prepare for the approaching seasonal change, nourish the body with chicken stewed with nurturing ginseng.Explore Bon AppétitHealthyishChineseSelf CareessayRead MorecultureWhen I Couldn't Be With My Sister After Childbirth, We Practiced Zuo Yue Zi From AfarBy Charlene Wang de ChenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-28", "author": ["Condé Nast", "Megan Zhang"]}