{"id": "0eb2829b86a3a56d26defe549fcb0271", "url": "https://www.bonappetit.com/recipe/slow-cooked-eggplant-with-lemon-and-fennel-seeds", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Eggplant Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Cooked Eggplant with Lemon and Fennel SeedsBy Claire SaffitzAugust 14, 20185.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintUse this master formula as your guide—but feel free to get creative with the add-ins. A dried chile? Sure! A few sprigs of herbs from your windowsill? Why not?Ingredients6 servings1lb. fairy tale eggplants, halved lengthwise if large½head of garlicZest of 1 lemon, removed in wide strips½cup extra-virgin olive oil¾tsp. fennel seeds¾tsp. kosher salt1Tbsp. fresh lemon juicePreparationStep 1Place a rack in middle of oven and preheat to 350°. Toss eggplant, garlic, lemon zest, oil, fennel seeds, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast eggplant, tossing 2 or 3 times, until golden brown, very tender, and crisp around edges and on cut sides, 70–80 minutes. Let cool slightly, then add lemon juice and toss to coat.How would you rate Slow-Cooked Eggplant with Lemon and Fennel Seeds?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThe fairy tale eggplants I got at the local farmers market were shorter and fatter than the ones in the picture, so I ended up cooking them for the full 80 minutes, stirring twice. I scored the cut sides of the eggplant before mixing in the other ingredients, as suggested in BAs basically guide to eggplants - Highly recommended. The flavors of the fennel, garlic and lemon infused into the eggplant flesh. Served with microgreens.a.goekler7491Denton, TX10/1/2020Writing this review in the time of quarantine...all of the vegetables wouldn't have lasted another day neglected. Used Japanese eggplant (that's what we had) cut in half and then lengthwise into planks, threw in  halved on-the-vine tomatoes and a jalepeno. Accidentally added the lemon juice at the beginning but the dish is forgiving. Spread the garlic on some homemade naan with the veg on top.  The end result was meltingly satisfying. As another reviewer wrote, resist the temptation to take the eggplant out early. It wants every minute.AnonymousOR4/25/2020This was: Awesome! I made exactly as directed BUT I added a very large carrot cut in similar size to eggplant (used regular eggplant) and a couple of large jalapeños! OMG! Can’t Wait to make this again (and again...).NY4/14/2020So good!!!!  I used white eggplant (cut lengthwise into quarters).  Took a little longer, ended up bumping up the heat to 375 towards the end, but either way, it was delicious!akampa1530033PA9/28/2019heck yes this was ASTONISHING. i was tempted to take the eggplant out two or three times since it looked done but i stayed the course & it was so worth it. caramelized & creamy. i loooove fairytale eggplant. also i used fresh marjoram instead of fennel - would've loved to use a lemon but didn't have one. next time!!smashcatCT8/8/2019This recipe has changed my life. I'm now going to slow roast all my vegetables in copious amounts of olive oil! The fennel and lemon combination was a flavor bomb. The fennel seeds get crunchy and slightly bitter and smell incredible! I also threw in green peppers with the eggplant, and they took to the flavors even better than the eggplant. I suggest slicing the eggplants thinner so they absorb more flavor and there's more of that light crisp exterior.ashima.chopra08088210/13/2018Explore Bon AppétitAmericanEggplantVegetableEasySideVeganVegetarianDairy-FreeNut-FreeGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}