{"id": "0ebf9be23c065c52c17b18397352a001", "url": "https://www.bonappetit.com/story/savory-croquembouche", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "A Savory Croquembouche to Start Your Party with Outright Opulence | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Savory Croquembouche That’s Opulent for Opulence’s SakeThe cocktail party snack that’ll steal the show. I mean, just look at it!!!By Alex BeggsDecember 21, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailWhile everyone’s picking out their sequins and lamé and velvet jumpsuits to ring in the new year in rayon blends—we’ve been picking out a recipe that’s just as elaborate. Showy. Opulent for the sake of opulence. Part decor, part cocktail snack. Pairs well with champagne and resolutions. Something that catches the light and requires a fresh haircut of whisked caramel. That’s right. A Croquembouche. The French tower of cream puffs. But this time, we’re going savory.A SAVORY CROQUEMBOUCHE!!!Molly Baz, who’d just recreated a Martha Stewart recipe (for cookbook club) that used the croquembouche as a vase (!!), was up for the challenge. And a challenge it was. Not only did a testing round require making 40 pâte à choux, the filling, the caramel, and assembling the tower, but she’d also have to hear our critiques...and do the whole damn thing over and over again until it was perfect. The things we do for beauty!Photo by Chelsie Craig, Food Styling by Kate BuckensWhat’s so savory about it? The choux—henceforth called “the puffs”—are cheesed up with Gruyere so now they’re gougères. The filling is Boursin-inspired: green and herby and creamy and cheesy (parm, ricotta, and cream cheese). The caramel gets offset with salt and black pepper, and the whole thing gets a snow-shower of more grated parm. When an unsuspecting Amiel Stanek tried a bite and assumed it would be sweet, his entire face lit up: “I’m flavor tripping right now!” he exclaimed. The garlicky chive filling, the sharp cheesy dough, there are no flavors hiding in the background here. The only drink we can fathom to go with it is something cold and bubbly. You know the stuff.You can make the gougères a day ahead, and pop them in the oven for 10 minutes at 350° to crisp them up on assembly day.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensThe puffs are easy (make them the same size tho), the filling’s a food processor cinch and then squeezed into each puff with a pastry bag, and the caramel’s fine if you keep an eye on it to keep it from burning. With tongs, or your hands if you like to feel pain, each puff is dipped in caramel for the side that faces the world. It quickly hardens and shines like polished mahogany. The most difficult part is building a symmetrical tree that’s artfully rustic, not droopy, leany, or otherwise...lumpy. After watching Molly assemble it in person, standing there doing nothing—I’m a great and supportive sous!—I took a lot of notes to make it easier on the rest of us without food styling on our resume. Here’s how to assemble a croquembouche like a pro:Before filling each gougères, use a skewer to poke a hole in the center and rotate it around to ensure a hollow center to squeeze the cheese mixture into. Then fill it until it pokes out of the hole and feels heavier in your hand. Some filling might poke out of air holes in the gougères, but don't worry about them, they’ll be covered in caramel later.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensPick out your platter, something sturdy and larger than a dinner plate.Grab a few puffs and arrange them in a circle with 2-3 inches of white space to the edgeCount those puffs. Ours had a base of 9. Each row after will subtract one.Layer one: Roll half of the edge of the first puff like a wheel and place it down with the poke-hole (where the filling went) facing inside the circle, caramel gluing it to the plate. Choux stonehenge! Roll the next puff and connect it to the first and make sure caramel is gluing that to the plate too. Hold the two puffs together for a few seconds so they stick.See how they sort of lean in a little? Not dramatically though.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensLayer two: Place the new puffs in the valleys of the Layer One Puffs. As you roll and stick, tilt the puffs in towards the center sliiiightly, remember this is going to end up conical.You keep doing this, working QUICKLY while the caramel is still warm. If strands of caramel drag over to the plate, don’t worry about it—that’s part of the drapey look. It’ll end up as caramel tinsel on your puffy happy tree.Mid-way through her third layer, Molly reheated the caramel over low heat for around 4 minutes. This makes it easier to dip but also thins the caramel out. When it gets too thick, it hardens like a Jolly Rancher, which isn’t pleasant to bite into.The numbers might not work out perfectly if your puffs vary in size. Don’t panic, just adjust accordingly and if you need to fill in some gaps with caramel use a spatula and get spacklin’.Layer five: When we realized the entire thing was leaning to the right, Molly cradled the entire top with both hands and shifted it to the left. That sort of worked, but rotating the plate so I couldn’t tell one way or another worked even better.The final puff: This is the only puff whose bottom gets dipped. I know, I know. But do it, and plop that shining star on top.Photo by Chelsie Craig, Food Styling by Kate BuckensYou can use a fork to make the final wisps of caramel circling the tower, but Molly made a custom tool: a whisk with an open end, which she made by cutting the tines with a wire cutter. It looked like one of those as-seen-on TV head massagers. It allowed her to get thin strands and plenty of them.I can’t deal with this close-up.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensWhat makes the whole project easier is making the puffs and the filling ahead, but the assembly needs to happen right before serving. They’re better that way. As it sits, the filling warms, the caramel hardens to cement, and that’s sad. Eat it within the hour, maybe two, which come on—shouldn’t be that hard.Get the recipe:Savory Cheese-Filled CroquemboucheThis croquembouche is constructed with cheesy gougères and an herbed cheese filling. It’s the showstopping holiday appetizer you didn’t know you needed.View RecipeExplore Bon AppétitappetizerCocktail PartyEntertainingholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Alex Beggs"]}