{"id": "0ec8bbe90bf5e991329e2ad5d9365945", "url": "https://www.bonappetit.com/story/frankies-tiki-room-las-vegas", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "You Can’t Do Vegas Without a Trip to Frankie’s Tiki Room | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYou Can’t Do Vegas Without a Trip to Frankie’s Tiki RoomThe iconic tiki bar is the only place I want to be.By Alex DelanyJuly 12, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I am what some might call selective when I’m in Las Vegas. In a city with so much excess, sights to see, wonders to absorb, I keep my list small. And at the top of that tight, practiced list lies my favorite bar in the city, a mandatory stop where Singapore Slings, Zombies, and other extravagantly garnished tiki drinks can be found: Frankie’s Tiki Room.Frankie’s is one of those places that couldn’t exist anywhere other than where it does, in a graceless stucco block next to a gas station, a couple miles northwest of the Strip. The massive Miami Vice-esque pink neon sign illuminates the parking lot below, but when you enter the bar, that’s when Frankie’s allure begins to take hold. It’s dark. It smells like someone has been continuously ashing a cigarette onto the floor since the ‘50s, when Frankie’s was a non-tiki mob hangout. Old Hawaiian tunes seep out of the jukebox. Artificial palm leaves drape around the bamboo-clad architecture. And people are drinking.Those drinks—whether you opt for a tiki classic like a Fog Cutter or a Frankie’s original like Surf Dragon (rum-based and filled with flavors of strawberry and violet) or a Frankenstein (golden rum, ginger liqueur, lemon, papaya, and fresh raspberries) are strong. But having just one is not and never has been the move here. Strength is only part of the appeal. The main reason you’re ordering another round is because the bartenders know—and have known for over a decade—exactly what they’re doing with the sweet, punchy, fruity flavors that make for a brilliant tiki drink.When you go to Frankie’s, you go to forget all the mistakes you made in this ridiculous city. And soak up the fact that you’re in one of America’s most amazing tiki bars.Go there: Frankie’s Tiki RoomExplore Bon AppétitHighly RecommendBarsLas VegasRumRum DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Alex Delany"]}