{"id": "0ed3c5e69094c902e8fa1622a30f20d5", "url": "https://www.bonappetit.com/recipe/buttermilk-cornbread", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Buttermilk Cornbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueButtermilk CornbreadBy Molly BazApril 28, 20214.2(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhen it comes to cornbread recipes, there are deeply divided camps rooted not only in taste preference but geography, race, and history. Some argue it should be made with cornmeal, no sugar or wheat allowed. Others think cornbread is incomplete without a sweet touch and the lighter, cakier texture that wheat flour brings. This recipe combines equal parts medium-grind yellow cornmeal and flour, just a hint of sugar, and buttermilk for subtle tangy flavor and lighter texture.It’s perfect next to a big bowl of bean chili or used in Cornbread Stuffing With Sausage and Corn Nuts. (And in case you need a reminder, you never need to wait for Thanksgiving to serve stuffing.) If you enjoy sweet cornbread for breakfast, feel free to double the sugar in this recipe, slather a thick slice with butter and honey, and devour before anyone else in the house wakes up.Editor’s note: This recipe was originally published October 16, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron13x9\" Baking Dish$20 At AmazonWhisk$10 At AmazonWire Rack$23 At BA MarketLarge Bowl$18 At AmazonIngredientsMakes one 13x9\" panNonstick vegetable oil spray2cups all-purpose flour2cups medium-grind cornmeal¼cup sugar1Tbsp. baking powder2½tsp. kosher salt¾tsp. freshly ground black pepper4large eggs2cups buttermilk½cup (1 stick) unsalted butter, melted, slightly cooledPreparationStep 1Preheat oven to 400°. Lightly coat a 13x9\" baking dish with nonstick spray. Whisk flour, cornmeal, sugar, baking powder, salt, and pepper in a large bowl. Whisk eggs, buttermilk, and butter in a medium bowl. Make a well in the dry ingredients and pour in egg mixture; stir into dry ingredients with a wooden spoon until combined. Scrape batter into prepared pan and smooth top.Step 2Bake cornbread, rotating dish halfway through, until a tester inserted into the center comes out clean, 20–25 minutes. Let cornbread cool slightly in dish, then cut crosswise into 4 large pieces. Transfer to a wire rack with a large spatula and let cool completely.Do Ahead: Cornbread can be baked 2 days ahead. Store tightly wrapped at room temperature.How would you rate Buttermilk Cornbread?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleJust made it. Came out very light and moist. I baked it for the minimum and it came out perfect. Usually I like sweet cornbread, but this was for stuffing and I didn’t think sweet was the way to go.  Pepper and buttermilk gave a very nice note. David FSeattle11/20/2021This is what we call 'Yankee cornbread.'  No self-respecting Southerner would put sugar in cornbread.\nJSB Asheville, NC11/19/2021Great recipe. However, its hard to choke down thinking of beans in chili!BirdieSan Antonio, Tx11/18/2021If you do 25 minutes you have glop. 40 minimum.John rNJ11/15/2021I halved the recipe and used about 1/4 cup maple syrup instead of the sugar. But my real secret to great cornbread is a handful of grated cheese. Cheddar is OK but the best is pepper jack. Oh, also I baked it in a cast iron skillet that I let get hot in the oven, then oiled and quickly poured in the batter.Granny AvonLA5/10/2021This recipe doesn’t have much flavor. I might up the sugar and salt next time. AnonymousChicago, IL 1/20/2021I've made this twice now—once for eating and once for BA's cornbread and salami dressing—and I think it's pretty good, though I expect to use it only for cornbread dressing moving forward. I followed the recipe closely in my first attempt, with the exception of substituting honey for sugar and doubling the amount of the honey per one of the other commenter's suggestions. I also used preground pepper. In my second attempt, I once again substituted honey for sugar and also substituted whole wheat flour for all-purpose flour, corn grits for some of the cornmeal, and DIY oat milk buttermilk for buttermilk. Both times, the cornbread was moist, easy to get out of the pan, and maintained its integrity when cut, which was great for preparing stuffing cubes. Echoing other commenters, I found the flavor a little lackluster, although I enjoyed my second batch—which had the amount of sugar called for in the recipe and included freshly ground pepper—much more. The fresh pepper noticeably improved the flavor. If anyone else prefers whole wheat flour and/or has more corn grits on hand than cornmeal, those substitutes didn't considerably change the outcome. (If anything, the grits made it a bit heartier, which was nice for dressing!) If you're looking for a sweeter cornbread for snacking, another recipe might be a better choice; however, if you're making cornbread croutons or stuffing, this is the ticket. GinnyPittsburgh, PA11/22/2020I only had coarse-grind cornmeal, so that's what I used, but it still turned out great! Per the review below, I did double the sugar and found the taste to be perfectly sweet, so I'm glad I did it. I did find that the sides and bottom browned more quickly than the top, but the taste and texture wasn't compromised so I don't really mind!AnonymousIN10/30/2020Doubled the sugar because I wanted it to be a bit sweet and loved it. Holds together very well. Just sweet enough. Definitely will make again!danielle324TN9/12/2020I cut the recipe in half and made in an 8x8 pan, came out perfect.  I think the deliciousness may be partly related to using Five Acre buttermilk ... the good stuff.  It was great with chili for dinner and then toasted with butter and jam for breakfast the next day. I will file this as my go-to cornbread.AnonymousNYC1/16/2020P.S.  I also use creamed corn and whole corn in my recipe.AnonymousDavie,Fl1/10/2020I cannot rate this properly  because I haven't made this recipe yet but I do add jalapenos to the recipe I use now.  I think I will make this one because I LOVE buttermilk.  Patty CakeDavie,Fl1/10/2020I made this gluten-free by subbing in one-for-one all-purpose gluten-free flour. It worked great. I used it for stuffing, but if I was going to serve it by itself, I would add a little more salt next time.AnonymousMassachusetts11/29/2019I made this today. If there was a competition between the five best stuffings eve made, this is Usain Bolt, and the other four are a six-year old kid, a 90- year old grandma with a walker, a guy with crutches, and a sloth. So good! Thanks to Rick and Chris for their work on this. Delicious. Vic LaPiraRochelle Park, NJ11/28/2019How can this be best adapted for dairy-intolerant tummies?Anonymousseattle11/28/2019Explore Bon AppétitBreadSouthernAmericanCornmealFlourButtermilkOther IngredientsQuickEasySideNut-FreeVegetarianBakingThanksgivingBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}