{"id": "0ed9ddaa360d17f0e58f5eb947ec96da", "url": "https://www.bonappetit.com/story/first-time-trying-meat", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "I Was a Lifelong Vegetarian. I Decided to Taste What I Was Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Was a Lifelong Vegetarian. I Decided to Taste What I Was MissingFor decades I never even considered meat to be food. Then I found myself in Argentina, surrounded by plates full of… wait, what are these?By Rajesh ParameswaranOctober 11, 2021FacebookTwitterEmailIllustration by Sargam GuptaFacebookTwitterEmailI was in Argentina writing a novel when I decided—after a lifetime as a vegetarian—that I was going to have my first taste of steak. This was my plan: I would invite an acquaintance out for a meal. She would order a steak, I would order a vegetarian pasta or a salad, and she would give me just one bite of her food. And then I would finally know what meat was.The idea had come to me when I couldn’t get my horse to move. I’d taken a day trip to the Pampas, and the stubborn horse I was riding must have sensed I was a New Yorker who had no business riding horses. He slowed until we were far behind everyone else in our group, then turned sideways on the trail and came to a dead stop. I begged and I prodded, but he wouldn’t budge. I had no idea what to do. Finally, I gave up and simply enjoyed the view.It was a nice view. In the field abutting the path was a scattering of muscular cows, with hides of bright ochre and faces white as coconut meat, grazing in the dark grass. When the cows sensed I wasn’t moving, they slowly raised their heads to see what the deal was. They stared at me with small ebony eyes, the curiosity in their faces rising only one or two degrees above indifference. Who is this fellow staring rudely at us while we eat our lunch, who can’t ride a horse and doesn’t have the first idea of how to behave in the presence of dignified animals?Reassured of my insignificance, they returned to their meal. They had a dense, calm, powerful presence. I couldn’t imagine creatures more casually imperious or coolly disdainful, more satisfied with life or sure of their place in it, more indisputable.That was more or less the moment I decided I wanted to try steak.Let me explain further. My whole family are vegetarians, going back generations. It’s for reasons of religion and culture, overlaid more recently with concerns around climate change and factory farming. When I was growing up, if it was vegetarian, it was food, and if it was meat, it wasn’t. It was a habit so deep it was thoughtless. But by the time I’d gotten to Argentina, I’d started thinking about it. Whatever the reasons for my vegetarianism, food is a part of culture, and it felt strange going through life without direct knowledge of what much of the world was eating. So I’d begun, kind of anthropologically, having a taste of chicken here, a bit of fish there. But I’d still never tried steak. Maybe it was an instinctive association of size with moral worth, or maybe it was inherited taboo, but steak was so bloody and thick and smelly and disgusting. It was meat itself, and I never had the slightest interest in it.And then I found myself in the Argentine countryside, unable to get my horse to move, staring at these copacetic, gorgeous cows, so robust, well cared for, and content—at least while I was with them. They were not crowded into feedlots or cruel factories—certainly not yet. It seemed they had entered unwittingly into a noble compact: their premature deaths in exchange for living grandly on these endless plains and making their country famous with their meat. Of course, the endlessness of the plains required to feed them was part of the problem, environmentally speaking. But if ever in my life I was to have a taste of steak, just to know what it was, then perhaps it ought to be safely far from home, here in this place where the cows had the aura of minor gods. The idea thrilled me.My first attempt was a flop. I invited a tourist I’d just met and found a restaurant on the internet. The bite she gave me was a chewy little nub that barely tasted like anything. But after talking with local friends, I concluded that this didn’t count: I’d chosen the wrong restaurant and gone with the wrong person. So I decided to do it again and do it right.This time I invited Pola Oloixarac, a brilliant, enthusiastic, and somewhat dramatic Argentine writer. We’d go to lunch at one of the best parillas in Buenos Aires on my last day of the trip. “It is an honor,” she would say later, “to introduce you to the meat of my country.”Pola arrived at La Cabrera in a black dress and dark eyeliner. After kissing me on the cheek, she began charming first the maître d’ and then our boyish waiter, and quickly the two men were grinning as they escorted us to a table by a window.I explained my plan once more for good measure: a salad for me and just one bite of her steak. Pola nodded slightly. She stared with great focus and an air of appreciation at the menu, and I sensed already something feeble about my plan—about the presumption that I would be the one to make the plan—in the face of her intensity.“Raj,” she finally said, leaning forward, with confidential urgency. “We will order the steak, of course. That’s why we are here. But there are things on this menu. Wonderful things. Things you will never find in New York or even anywhere else in Buenos Aires. Very Argentine things. I think we should order those things too.”“Ah.” I needed to clarify myself. “I’m afraid I’m only up for one bite of steak. If there’s something more you would like, please feel free. But I’m not used to eating meat, to say the least. And I have to catch a flight in a few hours—I don’t know how my stomach will react.”“Of course.” Pola settled back into her chair. “Just a taste. You don’t have to finish everything.”“But do we really want to waste an animal?”The wine had arrived, and I was sipping with nervous frequency because Pola’s insinuations were worrying me.“Look,” she showed me the menu. “They have mollejas here. I don’t think you can leave Argentina without knowing mollejas.”“If you want those, maybe you should get the half order, just for yourself?” I parried.“And we also have to get morcillas. They are just wonderful. And then the steak, of course. And you also wanted a salad.”“Pola,” I said. “This is starting to sound like an awful lot of food. Your instincts are generous, but I’m just here for one taste of steak. Please don’t order anything if you’re expecting me to eat it.”“Don’t worry, Raj,” she smiled, but I was, and I sensed that I should be. The waiter arrived. My Spanish wasn’t quick enough to follow all that she told him.The salad came first. Massive and mounded with grains, it alone would have been sufficient lunch for two people in my world. It was followed quickly by what I have recollected were the mollejas. These were two charred, oblong objects, about the size and shape of mangoes or fists. To my nose they smelled noxious and intensely animal. In fact, the smell made me feel a little ill.Pola began sawing one of them in half. She took that half and plopped it on a plate. She pushed it in front of me.My heart began to beat faster and my neck grew warm. I couldn’t stand the smell. “Pola,” I said, “I can’t eat all that.”“Just have what you like,” she said warmly.All I had wanted was to take one step across the line—put one toe across, really, to become slightly acquainted with the range of human cuisine and then put this behind me. But I couldn’t become a new person entirely. And that seemed what would have been required of me to eat the thing that was reeking on that plate.What had begun as a limited experiment was spinning out of control. But I reminded myself that I was still responsible. In theory I believed that if an animal were going to die for your meal, it was better to eat every part of it. And my aversion to the food was matched by my reluctance to waste any kind of food: My immigrant habits were at war with one another. And maybe there was also a wish to impress Pola, who was absolutely sincere in her enthusiasm. When you involve other people into the transgressing of your boundaries, you can’t always control how the story unfolds.“I’ll have a taste,” I whispered. I felt the blood leaving my extremities, my head getting lighter, as I said this.“What?” she asked.“I’ll have a little taste,” I said, less weakly, gathering my resolve. The molleja, in cross section, seemed to be composed of a layer of charred skin around a pasty interior. “But before I taste it, please tell me, what is this I’m about to eat?”“Oh, it’s mollejas,” Pola said. “I don’t know how you say it in English. Hmm.” She struggled for a moment. Then her big eyes brightened. “Oh!” She patted her sternum. “Do you know the heart?”I stared back in horror. “Yes, Pola.” My own heart was sinking. “Yes, I know the heart.”But this was the half order, and there were two of them. In what world did an order of heart come with four hearts?“Oh, no, these are not hearts,” she clarified. “But you know. Near the heart. There are, what do you call them in English? Ah. There are glands.”Glands? Is that really what she meant? Glands were things filled with hormones that swelled up when you got sick. You could eat those? I lost myself for a moment: Was it better to eat glands or hearts? It seemed too generous to hearts to say that they were better; but right now it seemed indisputable that glands were somehow even worse.“You look frightened,” Pola said, with sudden sensitivity.“Well, yes.” My mouth was tacky and dry. “In fact, I am frightened. But I guess that’s kind of why I came here. I’m going to do it.”Struggling not to smell the thing, I used a serrated knife to slice off a sliver as carefully as possible with my unsteady hands. The room receded to a buzzing haze. My arm moved, the fork came to my lips, my mouth opened and……the molleja simply melted on my tongue. It was incredibly delicate, airy and light; at the same time it was somehow rich and sort of creamy. It was in every way different from what I thought the smell had suggested. The word delicacy flashed through my mind, and it had new meaning now. Here was something truly delicate and rare. Here was a great delicacy.I’d done it. I’d had my taste. So now what was I doing having another?Next the morcillas arrived. These were dark oblongs with little flecks in them. The smell was complex, deep, unfamiliar. “Morcilla,” Pola explained. “You take some on a piece of bread. And you add chimichurri.”I asked again, although I should have known better by now: “But what is it?”“Let’s see… Well, do you know blood?”“Oh, Pola,” I said. “Yes, I know blood. You’re telling me that this solid thing. . . ”“Oh, no,” she said. “It’s not blood. Not exactly. It’s blood with grease.”I guffawed in grief. I vowed to ask no more questions for fear of more answers. I would just get it over with. I scooped a bit of the moist and crumbly dark matter onto a piece of bread. I spread it down and topped it with chimichurri, which had finely diced mango, cucumber, and cilantro. I brought it all to my mouth and sank my teeth in.How can I describe it? The taste was complicated and layered, almost as if it had been flavored with cloves and other spices—savory but with a slight sweetness. There seemed something vaguely Indian about it. It was simply one of the most interesting things I had ever put on my tongue.I hung my head down and took deep breaths. Somewhere in my veins I felt the molecules of my body transforming.“My dear, you’re frightened again.”“I just need a minute,” I said.“Yes, that’s a good idea. Let’s pause. Let’s take a minute.”I was not frightened now; I was moved. A beast had been killed, one of those great orange cows of the countryside; and the people working in this kitchen had paid attention to it, to all of it, even the oddest parts, and made this art of it. It was a primal—but a very human—thing. It moved me.I drank more Malbec and jettisoned my plan to take just a small taste of everything. The steak had arrived by now, sitting in what appeared to be a pool of blood; it was chewy and boring in comparison to the other marvels on the table. I kept eating everything, because I was amazed by the food, and felt some responsibility to the cow—half of which, virtually, had been served to us (there was also pig, I realized later; the morcillas are made from pig)—to not waste a bit of its sacrifice.There are things of the mind and things of the body, and food is somehow both. It’s an edible language, with its own grammar and local meanings, taught to us by our families. Like language, it’s processed sensually in our mouths. Then one day we look around and want to learn what other people are eating. We realize food is created and contingent. What is incomprehensible can become intelligible; or what is familiar, strange. We can discover new appetites, hidden somewhere in our bodies, and someone can teach us another way of eating.Halfway through our meal, Pola sent everything back to the kitchen to be reheated on the grill because one could do that here, if one knew to ask for it. “This way you can taste things both lightly cooked and medium.” (There is an expertise involved in being a good diner, I saw, as much as is in being a cook.) In a few hours I would be back in New York, trying to reassume my vegetarian habits. This meat was knowledge that could not be unlearned, but I knew it would be less meaningful, less sustainable, without this richness of context, and my particular guide. How could I order glands in Manhattan and expect them to compare? But there with Pola, I kept eating until I simply couldn’t hold any more. And on the plane home that night, I slept soundly, without even a murmur from my stomach.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-11", "author": ["Condé Nast", "Rajesh Parameswaran"]}