{"id": "0ede99fc43c40ea1e83df034d5df990d", "url": "https://www.bonappetit.com/story/chaey-healthyish-recipes", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "I'm Cooking How I Want to Feel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Cooking How I Want to Feel This YearComfort me, saucy tofu noodles, gochujang cauliflower, and chicken soup.By Christina ChaeyJanuary 15, 2022FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioFacebookTwitterEmailHello and happy 2022!I stopped making New Year’s resolutions years ago. It turns out no matter how many years in a row I would resolve to stretch every day, sleep eight hours a night, drink eight glasses of water a day, moisturize after every shower (LOL), and exercise daily (bigger LOL) I…never really ended up doing any of it. (I abhor being told what to do, and apparently that includes when I tell myself what to do.)While I don’t believe in New Year’s resolutions, I do believe in eating well all year round. And come January, after weeks of holiday sugar, salt, and booze, I’m ready, to borrow a phrase we often use at BA, to “cook how I want to feel.” This simple philosophy inspired the seven new recipes I developed for the February issue of Bon Appétit, which is out now. I love seeing so many of you already making these Saucy Tofu Noodles With Cucumbers and Chili Crisp, which I developed while combating tofu fatigue, a thing I didn’t know was possible for me. I don’t love roasted cauliflower or cauliflower rice, but I’ve discovered I absolutely love cauliflower when it’s lightly battered and baked until the florets come out crackly and, when tossed in a gochujang glaze, just rich enough. These recipes define what it means for me to eat well—to cook the way I want to feel—and I hope you’ll try them at home. Also, since getting COVID-19 now feels inevitable in this Omicron world, I’d go ahead and bookmark this comforting chicken soup now.I also like using the new year as a totally arbitrary time to shake up my grocery shopping and fill my cart with produce I associate with the “deep winter,” like juicy satsumas, collard greens, turnips, and sunchokes. I’m poring over old and new favorite cookbooks and flagging all the recipes that will be bright spots during the darkest, coldest months of the year. On my reading list now:Fresh India by Meera Sodha for endless ideas for legumesDonabe by Naoko Takei Moore and Kyle Connaughton for reasons to keep my donabe on the stove at all times (and pray that Takei Moore’s shop Toiro Kitchen restocks larger donabes soon because I am jonesing for an upgrade)Grist by Abra Berens for new ideas for old faithful grainsAt Home in the Whole Food Kitchen by Amy Chaplin for my favorite loaf of spelt and brown rice bread, which makes a truly superb avocado toastMother Grains by Roxana Jullapat for ideas on how to use up the one million whole grain flours left over from holiday cookie baking (buckwheat cake? Okay!)If you have a favorite comforting cookbook you like to revisit at the start of the new year, send it my way!Explore Bon AppétitWhat's Chaey Cooking?CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-15", "author": ["Condé Nast", "Christina Chaey"]}