{"id": "0eecc16c637618bd798d358d6740e597", "url": "https://www.bonappetit.com/story/caramelized-bananas-with-chevre-recipe", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "These Caramelized Bananas Are the Breakfast Recipe You Didn’t Know You Needed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Really Love Chèvre, Make It for Breakfast with These Caramelized BananasA decadent-seeming breakfast to impress houseguests with your unexpected banana roasting skills.By Tia KeenanMay 15, 2018FacebookTwitterEmailLauren V. Allen/Short Stack PressFacebookTwitterEmailThese roasted, caramelized bananas in Tia Keenan’s new Short Stack cookbook dedicated to just one ingredient—Chèvre—caught our hungry eyes. They’re topped with chèvre yogurt and toasted pecans and we had to have the recipe. Below, Tia explains the inspiration behind the decadent breakfast and why she’s chèvre’s No. 1 fan.Chèvre was one of my first forays into the world of “fancy cheese”. It was French, it was fresh and it was as frisky as the goats whose milk made it possible. Chèvre was alive! It was tangy, grassy, citrusy, and bright, and I was smitten at first bite.In the process of making Chèvre, I came to appreciate that my kindred feelings about chèvre—besides the playful, anarchistic joie de vivre that I share with goats—are that it’s more than a cheese to me; it’s an attitude, a perkiness with a side of reinvention.Chèvre is dense and creamy, a rare textural combination for a fresh cheese (for comparison, consider the soppiness of whole-milk ricotta or the curdy crumble of farmer cheese). Because it’s compact, it “loosens” with the addition of milk, cream, yogurt or other liquids without losing its creaminess, which is how the chèvre yogurt (sweetened with honey) in this recipe for roasted bananas works. And unlike other cheeses, chèvre doesn’t melt so much as meld. It’s for painting broad strokes with acidity and fat and for depositing pockets of it, as soft and inviting as a new set of bedsheets.The recipe for roasted bananas came from a dream: I’d live in a rickety old house that I could fill with interesting, eclectic houseguests—the kind of folks who’d need a place to crash while they finished a revolutionary novel or required some R&R after pursuing an improbable international romance. Now that I’ve acquired said dream house, memorable breakfasts are how I ensure a steady flow of houseguests throughout the year (few adults ever have a home-cooked breakfast made for them, so it’s proven to be a truly enticing amenity). Breakfast cheese seals the deal.Lauren V. Allen/Short Stack PressRoasted Bananas with Chèvre Yogurt & Toasted PecansFrom 1 lime, grate 1 teaspoon of zest and squeeze 1 tablespoon of juice1 teaspoon dark rum1 teaspoon pure vanilla extract1 teaspoon ground cinnamon2 tablespoons dark brown sugarPinch of kosher salt4 bananas, halved lengthwise with the peel on4 ounces chèvre, at room temperature1 cup goat’s milk yogurt, divided1 teaspoon honey½ cup roughly chopped toasted pecansSERVES 4Preheat the oven to 450°. In a small bowl, whisk together the lime juice, rum, vanilla, cinnamon, sugar and salt.Nestle the banana halves peel side down in a 9-by-13-inch glass baking dish and brush their flesh with the lime juice mixture. Bake for 15 minutes, until they’re soft and just starting to brown. Increase the oven temperature to broil and continue roasting the bananas for 5 more minutes, until they’re slightly caramelized.Meanwhile, in a medium bowl, use an electric mixer at medium speed to beat the chèvre with a ¼ cup of yogurt, the honey, and lime zest until the mixture is smooth and airy. Fold the remaining ¾ cup of yogurt in by hand and set aside.Using a spatula, carefully transfer the bananas from the baking dish to a serving platter (they will be quite limp, so move slowly), spoon the yogurt over them, sprinkle with the pecans and serve immediately.Buy it: Chèvre by Tia Keenan, $13 on AmazonExcerpted from Chèvre by Tia Keenan. Copyright © 2018 by Short Stack Press. Used with permission of the publisher.Read more from Tia: How Boursin Taught Me What Cheese Could Be1 / 29ChevronChevronPhoto by Alex LauTHE RAW COW CHEESESThese cheeses are made with non-pasteurized milk, meaning they need to be aged a minimum of 60 days to be legally sold, per the FDA. As a result, there are a lot of harder, aged cheeses in this category, with the exception of Dancing Fern right below.Explore Bon AppétitBananaGoat CheeseCookbooksDessertCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Tia Keenan"]}