{"id": "0eee5191b41e92773558830fe3e4128c", "url": "https://www.bonappetit.com/story/black-owned-restaurant-lists", "year": 2020.0, "month": 6.0, "day": 2.0, "content": "Black-Owned Restaurant Lists Circulating the Internet, Organized by City | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBlack-Owned Restaurant Lists Circulating the Internet, Organized by CitySupporting Black-owned restaurants is one practical, actionable way to stand in solidarity with the Black community now, and always.By The Bon Appétit StaffJune 11, 2020FacebookTwitterEmailPhoto by Kelly MarshallFacebookTwitterEmailAs many of us have been inspired to stand in solidarity with the Black community, so has food media. Across the country, restaurant critics, writers, and local food lovers have been pulling together extensive lists highlighting Black-owned businesses in their respective cities. We wanted to share what they’re creating, from Google spreadsheets with updates on take-out/delivery options and GoFundMe links to websites that have long been celebrating Black-owned businesses and owners. We will continue to update this page as more resources become available, and encourage you to use these resources now, and always. Let us know if you come across anything that would be helpful to add to this growing list by emailing us at staff.bonappetit@gmail.com with the subject line “Black-owned businesses.”From left to right: Everett and Jones BBQ in Oakland, Yonnie Hagos and Ajay Relan of Hilltop Coffee and Kitchen in L.A., Miss Ollie's in Oakland.\nPhotos by RYAN WALKER-HARTSHORN, Jennifer Johnson, and RYAN WALKER-HARTSHORNWESTThe Bay Area- Google spreadsheet of coffee shops, bakeries, and restaurants open for take-out and delivery in the Bay Area, with information on merch, gift cards, GoFundMe pages, and more. Created by Soleil Ho of the San Francisco Chronicle- Our article celebrating bakeries, restaurants, bars, and shops in Oakland. Reported and written by Ryan Walker-Hartshorn of BA.Los Angeles- Google spreadsheet of coffee shops, bakeries, and restaurants open for take-out and delivery in the great L.A. area, with information on merch, gift cards, GoFundMe pages, and more. Created by Kat Hong of The Infatuation.- The Los Angeles Times's article listing coffee shops, bakeries, restaurants, food trucks, and pop-ups in the L.A. area. Written by Jenn Harris of the Los Angeles Times.- Black Book L.A.’s list of restaurants and dessert spots to support in L.A. Created by co-founder Makiah Green.San Diego, CA- Google doc of restaurants to support in San Diego. Created by Gabby Beckford of Packs Light.Sacramento, CA- Graphic designer Lauren Charles shared her list of restaurants on Twitter.Seattle- Google spreadsheet of coffee shops, bakeries, restaurants, and bars open for take-out and delivery in Seattle, with information on merch and online shopping. Created by recipe developer and food writer Rose DeMun.- Google spreadsheet of coffee shops, bakeries, restaurants, and bars/wine shops open for take-out and delivery in Seattle, with information merch and gift cards. Created by food and travel writer Naomi Tomky.Portland, Oregon- Support Black-Owned Restaurants Week's directory of coffee shops, bakeries, restaurants, and bars to support in Portland, Oregon. Created by Bertha Pearl, William Travis, and the team at Support Black-Owned Restaurants Week.Phoenix, Arizona- Local First Arizona's guide to restaurants in the greater Phoenix area. Created by Local First Arizona in partnership with the Phoenix Black Collective.From left to right: Lil' Dizzy's Cafe in New Orleans, Nina Compton of Bywater American Bistro in New Orleans, Soul Bowl pop-up at Breaking Bread in Minneapolis.\nPhotos by Alex Lau, WES FRAZER, and Sidney SchultzCENTRALMinneapolis- City Pages's article highlighting bakeries, breweries, and restaurants to support in the Twin Cities. Written by Sarah Brumble of City Pages.Detroit- Fed & Bougie’s list of restaurants to support in Detroit. Created by founder Brittany Hutson.- Black and Mobile, Black-owned delivery app working with Black-owned restaurants in Detroit. Created by founder and CEO David Cabello.Chicago- Seasoned and Blessed’s map and list of bakeries, restaurants, and private chefs to support in Chicago. Created by founder Aaron L. Oliver.- Black Owned Chicago’s directory of coffee shops and restaurants to support in Chicago. Created by founder Tanikia Carpenter and the team at Black Owned Chicago.- Support & Educate's Google doc of Chicago cafés, restaurants, holistic services and other organizations updates every five minutes.Cleveland, Ohio- The Cleveland Bucket List's article listing bakeries, restaurants, pop-ups, and catering businesses to support in Cleveland. Created by The Cleveland Bucket List.Columbus, Ohio- Blackout Coalition’s interactive map of restaurants to support in Columbus and central Ohio.Milwaukee, Wisconsin- MKE Black’s directory of coffee shops, restaurants, bars, catering businesses, and food trucks to support in Milwaukee. Created by founders Paul Wellington and Rick Banks.Indianapolis, Indiana- Eat Here Indy's article listing restaurants in Indianapolis. Written by Michael Moore for Eat Here Indy.Omaha, Nebraska- Instagram post listing restaurants to support in Omaha. Created by production coordinator Sydney Peterson.- Food writer Sarah Baker Hansen has a list of restaurants in Omaha and Lincoln.Lincoln, Nebraska- Instagram post listing restaurants in Lincoln. Created by Goldenrod Pastries.St. Louis- Feast Magazine's article listing coffee shops, restaurants, and catering businesses to support in St. Louis. Written by Kasey Carlson and Heather Riske of Feast Magazine.Kansas City, Missouri- Instagram post listing and tagging restaurants to support in Kansas City. Created by Monarch Coffee.New Orleans- Instagram post of restaurants in New Orleans. Created by Big Easy Magazine.Austin- Austin Monthly's article listing restaurants and other Black-owned businesses to support in Austin. Written by Rosie Ninesling of Austin Monthly.- Google spreadsheet of restaurants to support in Austin. Created by artist and bartender Elizabeth Mathis.Houston- Instagram post listing restaurants to support in Houston. Created by Feed the Frontline Houston.Dallas- Soul of DFW’s list of restaurants open for take-out and delivery in the Dallas and Fort Worth area. Created by founder Deah Mitchell.San Antonio- San Antonio Magazine's article listing restaurants and other Black-owned businesses to support in San Antonio. Featured in San Antonio Magazine.Corpus Christi, Port A, Rockport, and all of the Coastal Bend in Texas- The Bend's article listing restaurants and other Black-owned businesses to support in the Coast Bend. Created by the team at The Bend.Denver- 303 Magazine's article listing coffee shops, bakeries, restaurants, and meal delivery services in Denver. Created by Brittany Werges of 303 Magazine.Jamrock South in Atlanta, Bunna Cafe in NYC, and Cafe Rue Dix in BrooklynPhotos by Emma Fishman, Anders Ahlgren, and JESSE SPARKS & RYAN WALKER-HARTSHORNEASTWashington, D.C.- Feed the Malik's post listing restaurants, cafes, and pop-ups open for take-out and delivery in D.C., Maryland, and Virginia. Written by founder Anela Malik.- Our article honoring restaurants, bars, and landmarks in the nation’s capital. Reported and written by Ryan Walker-Hartshorn of Bon Appétit.New York City- Google spreadsheet of coffee shops, bakeries, restaurants, and bars open for take-out and delivery throughout the boroughs, with information on merch, gift cards, GoFundMe pages, and more. Created by Hannah Goldfield of the New Yorker and Joseph Hernandez and Rachel Karten of BA.- Our article celebrating bakeries, restaurants, bars, and shops in Bed-Stuy and Crown Heights in Brooklyn. Reported and written by Jesse Sparks and Ryan Walker-Hartshorn of BA.- Black-Owned Brooklyn’s directory of restaurants, bars, and shops, along with other Black-owned businesses to support in Brooklyn. Created by Cynthia Gordy Giwa and Tayo Giwa of Black-Owned Brooklyn.- Google spreadsheet of bakeries, restaurants, and bars to support in Queens. Created by Karen Umeda and Queens Eats.Rochester, New York- Google spreadsheet of restaurants and catering businesses open for take-out and delivery in Rochester. Created by marketing, PR, and social media director Leah Stacy.Buffalo, New York- Google doc of everything from bakeries to boutiques, plus charitable organizations, in Buffalo. Created by Dima Maddah.Westchester, NY- White Plains, Tarrytown, New Rochelle, and other towns in Westchester are covered in this community-gathered Instagram post (with additions in the comments).Jersey City, NJ- Google spreadsheet of restaurants offering delivery, pickup, and takeout in Jersey City.Connecticut-  This blog post on CT Eats Out is constantly updating with restaurants across the state of Connecticut.Philadelphia- Google spreadsheet of restaurants and pop-ups open for take-out and delivery in Philadelphia, with information on merch, gifts cards, GoFundMes, and more. Created by Kae Lani Palmisano of Check, Please! Philly.- Black and Mobile, Black-owned delivery app working with Black-owned restaurants in Philadelphia. Created by founder and CEO David Cabello.Pittsburgh, Pennsylvania- Good Food Pittsburgh's list of coffee shops, bakeries, and restaurants to support in Pittsburgh. Written by founder Emily Catalano.Boston- The Boston Globe's article listing restaurants to support in Boston. Written by Devra First of The Boston Globe.- Google spreadsheet of restaurants open in Boston and throughout New England (Hartford, CT; New Haven, CT; Stamford, CT; Vernon, CT; Windsor, CT; Amherst, MA; Brockton, MA, Brookline, MA; Cambridge, MA; Dorchester, MA; Greenfield, MA; Hyde Park, MA; Jamaica Plain, MA; Malden, MA; Mattapan, MA; Medford, MA; Roslindale, MA; Roxbury, MA; Somerville, MA; South End, MA; Springfield, MA; Stoughton, MA; Watertown, MA, Portland, ME; Seasport, ME; Claremont, NH; Manchester, NH; Portsmouth, NH; Pawtucket, RI; Providence, RI, Bellows Falls, VT; Brattleboro, VT; Charlotte, VT; Stratford, VT). Created by Yankee Magazine.- Instagram post listing restaurants to support in the greater Boston area. Created by Boston Black Restaurant Challenge.- Instagram slideshow listing restaurants to support in the greater Boston area. Created by Claudiane Philippe of Nail the Cocktail.Baltimore, Maryland- Google spreadsheet of coffee shops, bakeries, restaurants, and bars in the greater Baltimore area. Created by creative director Shannon Carole.Portland, Maine- Portland Food Map's article listing coffee shops, restaurants, bars, and catering businesses in the greater Portland area. Written by founder Anestes Fotiades of Portland Food Map.Atlanta- The Village's list of coffee shops, food trucks, and restaurants to support in Atlanta. Created by founder and CEO Dr. Lakeysha Hallmon and the team at The Village.- Black and Mobile, Black-owned delivery app working with Black-owned restaurants in Atlanta. Created by founder and CEO David Cabello.- Instagram post of coffee shops, bakeries, and restaurants to support in Atlanta. Created by pastry chef Erika Council of Bomb Biscuits Atlanta.- Twitter thread of bakeries, food trucks, restaurants, and bars to support in Atlanta. Created by @aliensdigest.Nashville- Google spreadsheet of bakeries, restaurants, and catering businesses, along with other Black-owned businesses in Nashville. Created by pastry chef Ali Humbrecht.Richmond, Virginia- BLK RVA’s directory of bakeries, restaurants, and catering businesses to support in Richmond. Created by Enjoli Moon, Katherine O’Donnell, and the team at BLK RVA.Charlottesville, Virginia- The Charlottesville 29's article listing bakeries, food trucks, and restaurants in Charlottesville. Created by Simon Davidson and the team at The Charlottesville 29.Louisville, Kentucky- Instagram post listing restaurants to support in Louisville. Created by chef Damaris Phillips.- Instagram post listing bakeries, restaurants, and bars to support in Louisville. Created by Louisville Scoop.Charlotte, North Carolina- Charlotte Agenda's list of restaurants, along with other Black-owned businesses to support in Charlotte. Reported and written by Brianna Crane and Avery Primis of Charlotte Agenda.Miami- Google spreadsheet of restaurants in Miami. Created by writer Zachary Fagenson.Tampa Bay, Florida- Green Book of Tampa Bay’s directory of restaurants, bars, and catering businesses to support in Tampa Bay. Created by founders Hillary Van Dyke and Joshua Bean.Gainesville (and surrounding areas), Florida- This community-sourced Google doc includes restaurants, fitness and wellness companies, photography, digital services, retail, artists, and more businesses in Gainesville and nearby towns.Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-03", "author": ["Condé Nast", "The Bon Appétit Staff"]}