{"id": "0ef6b335ea42e143aab6a815ef274dfe", "url": "https://www.bonappetit.com/recipe/warm-winter-vegetable-salad-with-halloumi", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Winter Vegetable Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueWarm Winter Vegetable Salad With HalloumiBy Deb PerelmanJanuary 7, 20204.9(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Mariana VelasquezEmailPinterestPrintEmailPinterestPrintRoasted on a sheet pan, this warm winter salad takes inspiration from fattoush, with a seasonally appropriate cast of roasted squash, cabbage, and red onion. Then comes the kid bait: Crispy pita chips so delicious and easy that you should definitely toast extra. And Halloumi, a feta-like salty brined Cypriot cheese that’s often grilled, but when roasted becomes golden brown and pillowy soft. Finish it with cider vinegar, which adds complex sweetness, and sumac, the tart spice that’s essential in classic fattoush.Ingredients4 servings5Tbsp. extra-virgin olive oil, divided2garlic cloves, finely chopped1½tsp. kosher salt1tsp. Aleppo-style pepper½small head of red cabbage (about 10 oz.), cut into 1\" pieces1medium red onion, cut into 8 wedges through root end1½lb. winter squash, preferably delicata, halved, seeds removed, sliced crosswise ½\" thick1large pita bread, split into 2 layers, cut or torn into 1½\"–2\" pieces8oz. Halloumi cheese, cut into 1\" pieces2Tbsp. apple cider vinegar1½tsp. ground sumacMint sprigs (for serving)Ingredient InfoHalloumi cheese can be found at Greek markets, natural and specialty foods stores, and some supermarkets. Sumac is available at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Preheat oven to 425°. Coat a rimmed baking sheet with 1 Tbsp. oil. Mix garlic, salt, Aleppo-style pepper, and 3 Tbsp. oil in a large bowl. Add cabbage, onion, and squash and toss to coat. Spread out on prepared baking sheet (keep bowl handy) and roast until squash is browned underneath, 25–30 minutes.Step 2Toss pita, Halloumi, and remaining 1 Tbsp. oil in reserved bowl. Scatter over vegetables, then turn vegetables over with a large spatula. Roast until squash is fork-tender and cabbage, onion, pita, and Halloumi are browned in spots (cheese should be soft inside), 15–20 minutes. Remove from oven and drizzle with vinegar. Top with sumac and mint.Photo by Laura Murray, food styling by Mariana VelasquezHow would you rate Warm Winter Vegetable Salad With Halloumi?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleI make this, almost as-written, weekly! The main differences are as follows. I replace the squash with 1 large sweet potato, cut into thin half-medallions. This gets cooked on its own tray, with the onion/cabbage/garlic on another. When both trays are slightly browned, they get combined onto 1 tray and put back in the oven. On the now-empty tray, I roast double the amounts of pita and halloumi. Sumac/ACV remain the same. Seriously, this is a fantastic recipe.GCBoston, MA2/9/2022I’ve also made this very close to as-written, subbing both acorn and butternut squashes for delicata on occasion (and adding a bit more garlic). It’s a fantastic recipe that has become a weekly staple…surprisingly even better reheated in a hot oven the next day. Thank you!danielle da cruz1/13/2022Very tasty salad!  Next time I will follow the recipe and cook the cabbage with the other vegetables. I decreased the salt but I will leave the salt out next time. AnonymousDenver CO5/21/2021This recipe is a testament to turn a non-cabbage convert into a believer. To turn a “winter is boring” person into “summer... what?” I love this dish so much I’m making it twice...this week. Don’t judge me- the jammy red onions, the salty halloumi, the perfectly cooked and not boring caaaaabage... tonight, trying it with feta and adding sad fennel. MonicaOakland, CA2/26/2021Simple and delicious! I am vegan so I made it without cheese, though I might add a few tofu cubes in next time. KateNY2/12/2021Delicious and flexible~ have made this as written and  have also adapted to  use what I  have on  hand. Works  with zucchini, eggplant, or corn!LizSan  Francisco, CA2/9/2021This dish is going into regular rotation! Somehow I was able to actually make this salad without going shopping, by substituting a couple of shallots for the red onion and by pulling some cheesy pesto breadsticks from my freezer for the bread. The flavors in this salad are strong, and the colors beautiful and rich. Next time I may pull back on the sumac powder and the salt by 1/2 tsp. I encourage people to make this recipe!Mary BJoseph OR1/10/2021Made this for our Christmas eve dinner, everyone loved it and even the squash-skeptics cleaned the plate. I couldn't find halloumi so added feta out of the oven, I'll be on the lookout and will try with the right cheese if I ever find it. Paula PérezSpain12/25/2020Amazing meal! Like others, I definitely recommend cooking the cabbage on a separate sheet. I also personally love when my vegetables are a little over cooked so I left them in for an extra 5min. Aleppo pepper was hard to find but found some in a middle eastern grocery store. Also recommend sprinkling chopped pistachios as a topping, and the lemon zest is a must! Used kabocha squash for this, which is my fave squash out there, highly recommend. Lastly, made a yogurt sauce (full fat plain greek yogourt, garlic, fresh mint, dried mint, lemon, salt and pepper, little water to liquify) to top off the dish, which was a wow.. really refreshed the meal.CMZOttawa, Canada12/5/2020Another hit from Deb! It's everything you want in a vegetable dish - soft, crunchy, roasty, sweet, tangy, cheesy, a little spicy. *important:* I have made it exactly as written and I agree with the suggestion to season and roast the cabbage on a separate baking sheet. It released too much moisture and prevented my squash from getting those tasty, browned edges. Don't skip the sumac! If you can't find Aleppo, Urfa works too.AnonymousVancouver, BC10/19/2020This is perfect as written, but easy to adapt depending on what you've got in the house. It's become a staple in our house since February. AnonymousEly, United Kingdom10/7/2020Absolutely lovely as a salad.  Substantial enough for a main course too.AnonymousMiami, FL8/20/2020I have made this 5-6 times now, I'll typically use a kabocha squash as that is whats accessible to me. Today I didn't have pita bread but substituted some almost stale sourdough and OMG! having croutons in place of the pita just made the dish 100x more delish!! HIGHLY RECOMMEND! Also subbed halloumi for feta (which i've done a few times in the past, good flavor) and also added mexican queso fresco which cooks identically to halloumi but the taste is a lot lighter. I personally never add the salt in this recipe. I did it the second time after realizing that i forgot to add it in the first time, but it was just way too salty. I recommend just adding salt to taste at the end. This is a simple delish meal and one of my new go-to staples!jkf-00Bay Area, CA4/15/2020Best vegetable recipe ever. I have made it two days in a row cause I had leftover cabbage and squash, I used butternut and it worked super well. I also used a grainy dark gluten free bread that was delicious instead of pita so I think you can really use any bread. I used havarti and it melted but the melted bits were amazing near the veggies. Will make this recipe forever please try it!!AnonymousNew York, NY4/3/2020Wow! I was not expecting this to be so delicious! I didn't have halloumi in the house so I subbed the cheese for feta. I also didn't have pita so I whipped up a quick socca (chickpea flour flatbread: ) and served it on the side. The results were spot on! Great flavors, cozy yet bright -- an overall quick and easy weeknight meal.Anonymous3/10/2020Explore Bon AppétitSaladHalloumiCheeseRed CabbageCabbageLeafy GreensVegetableDelicata SquashSquashWinterSheet-Pan DinnersEasySideNut-FreeVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Deb Perelman"]}