{"id": "0f09e080bdd3ba73b659f489387c27a4", "url": "https://www.bonappetit.com/story/best-pesto-recipe-is-here", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "How to Make BA’s Best Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBA’s Best Pesto Recipe Is Here and It's the Perfect Balance of Nuts, Herbs, and CheeseDo you really need to blanch the basil? Toast the nuts? Grate the garlic? Here’s the deal.By Alex Beggs and Andy BaraghaniAugust 21, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmail“Did you make this with...a mortar and pestle?” We asked Andy Baraghani, tasting his bright green pesto on glossy pasta a few weeks back. He rolled his eyes. If this were Andy’s Best Pesto recipe, he might have, he told us. But this is BA’s Best Pesto; it’s a classic. It’s made in a food processor, and it’s perfect.Lately, we’ve had some avant garde pesto recipes (see Andy’s miso pesto) and variations on different greens, nuts, and cheeses. Even a chopped pesto, no machinery required. But no regular ol’ basil, pine nuts, and Parm combo for all of us craving simplicity in this complicated, humid world. Thankfully, that is no longer the case. Does a hole in the universe suddenly feel filled? That’s what we thought. Here’s what makes BA’s Best Pesto, well, the best:You don’t need to blanch the basil“We’re not assholes,” says Andy on behalf of recipe developers everywhere. Blanching will make it brighter green, but you don’t need to do it. If you’re like, nah I really want that Pantone 3539 greenery, here’s a secret from Andy: Sneak a few leaves of spinach in there, watch the color brighten instantly, tell no one. Tell. No. One.But you do need to roast those pine nutsThrow them on a baking sheet for 5-7 minutes in a 350°F oven, NBD. But the result is huge: a fuller, nuttier flavor to balance the sharpness of the basil. Per Andy the authority: “Roasting activates the oil in the pine nuts and adds depth.”Make it in a food processor, or blender if you wantThe difference is texture. The blender will make a velvety smooth pesto, solid green. The food processor will keep flecks of basil leaves intact. This is an aesthetic decision, or one based on whether you own a food processor or not.The order of operationsInto the food processor go: Nuts first. Grated garlic and cheese. Basil. Then olive oil streamed in. This keeps the basil from getting bruised and browned. (And FYI grating the garlic distributes it garlic better than putting the whole clove in. An important lesson learned from garlic bread.)A note on the best pesto pasta of your lifeIf you’re making this pesto for pasta, to achieve the irresistible glossiness pictured here, add 2 Tbsp. of unsalted butter in a bowl with the pesto before adding pasta and pasta water. It’s not that much butter, and there’s a reason beyond the fact that butter is butter: If the olive oil you used for the pesto is grassy or peppery, and the basil is sharp and peppery, the butter mellows that pep out. When you swirl that first bite of pasta, you’ll be able to taste everything, rather than one note sticking out (extreme basil! Salty cheese! Fiery garlic!). Butter cuts through it all and adds that little something extra that turns regular ol’ pesto into BA’s Best.Get the recipe:BA’s Best PestoThe key is to add the basil at the very end instead of blending everything all at once.View RecipeExplore Bon AppétitPastaPestoBasilPine NutParmesanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Alex Beggs", "Andy Baraghani"]}