{"id": "0f108eed055016cfb17a448359b0179e", "url": "https://www.bonappetit.com/story/diptyque-ginger-room-spray", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "Diptyque's Ginger Room Spray Banishes Kitchen Odors From My New York Apartment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Ginger Room Perfume Banishes Kitchen Odors From My Tiny ApartmentIt smells like freshly sliced ginger root and works faster than you can say “last night’s dinner.”By Jenna Adrian-DiazFebruary 18, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.No matter how incredible dinner smells while it’s cooking, I never want to smell it two hours after the kitchen’s been cleaned up. I’ve moved on (ideally to dessert), but my small apartment, it seems, has not.That’s why I find Diptyque’s Gingembre Room Spray to be absolute genius, instantly banishing lingering scents with a couple pumps of the nozzle. And unlike many air fresheners out there, it actually smells fresh—like just-sliced ginger root. It’s uplifting, invigorating, energizing, even. (Everything that nearly 365 consecutive days of working, eating, and virtual socializing at home is not.)Because Diptyque’s formulation lacks cloying notes of vanilla or sugar often used in room sprays, it won’t clash with your last meal. Even a really punchy, lingering eau de cast-iron-seared harissa duck leg gives way. And, because the parfumerie says the formulation is fabric safe, I have no qualms about spritzing it on the couch, throw pillows, or even my winter coat when meals get really fragrant. Plus, the bottle looks so good that I can leave it out on my coffee table without needing to stash it in an overcrowded closet.Yes, I fully acknowledge that at $68 for 150 ml of ginger-scented magic, this spray is a splurge. But I’ve had the same bottle for two years now and it’s still going strong. This stuff is pretty potent. More potent than anything I can whip up in the kitchen.Photo by Emma FishmanDiptyque Gingembre Room Spray$68 at Nordstrom$68 at Diptyque ParisExplore Bon AppétitHighly RecommendShoppingproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}