{"id": "0f16f902cf225d29535fe07a3ce3af1b", "url": "https://www.bonappetit.com/story/something-and-nothing", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "This Flavored Seltzer Water Is My New Go To | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhen You Want Something More Than a Seltzer But Less Than a SodaSomething & Nothing is the perfect middle ground.By MacKenzie Chung FeganOctober 16, 2020FacebookTwitterEmailPhoto by Addie ChinnFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!I hardly recognize seltzer anymore. Starting with LaCroix, seltzer took down her ponytail, swapped her glasses for contacts, and went to prom with Freddie Prinze Jr. Now seltzer is fancied up with a spritz of calamansi juice or caffeinated or combined with malt liquor and consumed in excessive quantities poolside. I don’t mind; I liked her when she was just carbonated water, but I’m happy to see she’s thriving.Of the many new flavored seltzer water brands to hit the market recently, Something & Nothing is among my favorites. The British company just launched online and in stores in select U.S. cities with three flavors—yuzu, hibiscus and rose, and cucumber. All contain no added sugar, relying instead on grape juice to lend a baseline hint of sweetness. They’re more flavorful than a Spindrift, less than an Orangina—to me, something like a cross between a soda and a seltzer. A soltzer?At 41 to 57 calories per can, they’re not the kind of bubbly beverage I want to mindlessly pound throughout the work day. (I’ll save that for White Claw!) But if I need an afternoon pick-me-up, I’ll open a can of the floral, lemonade-y yuzu. Come happy hour, I’ll mix the cucumber flavor with gin for a tonic alternative that still brings some sweetness. My heart will always belong to plain old seltzer, but there’s room for Something & Nothing too.Yuzu Seltzer, 12-pack$35 at Something & NothingExplore Bon AppétitHealthyishHealthyish Loves ItShoppingSeltzerAlcohol & Other DrinksRead MoreLifestyleThis Eye Massager Is So Relaxing, I Fall Asleep With It OnBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-16", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}