{"id": "0f1be0597fba1518720de65e205b12d1", "url": "https://www.bonappetit.com/story/celebrity-wines", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "3 Celebrity Wines That Are Actually Good, According to a Sommelier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping3 Celebrity Wines That Are Actually Good, According to a SommelierIf you already own four mansions and a Bugatti, why not add a wine label to your portfolio?By MacKenzie Chung Fegan and Tiffany HopkinsSeptember 3, 2021FacebookTwitterEmailPhoto by Isa Zapata, Prop Styling by Anne EastmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Can you even call yourself a celebrity these days if you don’t have your own wine label? From Bon Jovi’s Hampton Water rosé to Boyz II Men’s Harmony label, musicians, athletes, and actors are slapping their names on bottles faster than you can say, “Although we’ve come to the end of the road, still I can’t let go.” But are any of these celebrity wines actually worth buying? Much of that has to do with which winemaker the celeb chooses to partner with, because we’re pretty sure Cameron Diaz is not determining which pruning techniques to employ for her “clean” vegan wine brand. When the juice is good—as in the case of designer Rosie Assoulin’s Vivanterre wines, which are produced by natural wine heavy hitters Patrick Bouju and Justine Loiseau—it’s because the A-lister lending their name to the brand has had the good sense to tap a legit expert. Below, sommelier André Mack weighs in on three celebrity wines that deserve a spot on your table—and for his dunks on the bottles that didn’t make the cut (sorry, Snoop), watch the full video below.Three by Wade Blanc by Dwyane WadeOf all the celebrity wines tasted, Three by Wade wins Mack’s top spot. It’s a California white wine—specifically, 95% Chenin Blanc with a smidgen of Viognier. Chenin Blanc, most often associated with wines from the Loire Valley, is a versatile grape with good acid that Mack says, “all the cool kids are drinking these days.” For his label, Wade has partnered with Napa winemaker Jayson Pahlmeyer. “He has serious people on his team,” Mack notes. “These are real ‘wine legend’ people.” Three by Wade is refreshing and aromatic with notes of honeydew melon, honeysuckle, and a hint of chamomile on the nose. “It’s a great expression of Chenin Blanc in America,” says Mack. “This is wine for people who want to experiment with something different.”Emoji Rating: “Three basketballs 🏀🏀🏀, because this one is ballin’”Three by Wade Blanc$21 at Wine.comLicataa Lambrusco by Raekwon the ChefThis is a Lambrusco—a sparkling red wine from the Emilia-Romagna region of Northern Italy—by Raekwon of the Wu-Tang Clan. “Lambrusco gives you all of the benefits of red wine, but it’s served chilled and has a little bit of frizzante, which kind of acts like a scrubbing pad on your palate,” says Mack. Licataa has an earthy aroma with good tannins and notes of blueberry, raspberry, strawberry, and black currant on the palate. Mack deems it luxurious, multidimensional, and a great pairing for charcuterie boards. “Quality-wise, it’s in the top tier of Lambruscos,” he says. “This feels like Raekwon to me. The easy thing would have been to go to Champagne, but to go to a different region [for sparkling wine] shows an exploratory side, a resourcefulness.” The flashy blue bottle and its fuzzy velvet top makes Licataa a stunner.Emoji Rating: “Smiley face with stars in the eyes”Licataa Lambrusco$30 at Verve WineSun Goddess Pinot Grigio by Mary J. BligeMack calls this out as a “great quality wine” for its price point. Pinot Grigio originates in the Friuli region in Northern Italy. If you’re wondering why this wine isn’t exactly white in color, that’s because it’s made in a traditional style called ramato, whereby the skin of the crushed grapes macerates in the juice producing a beautiful orange color and a more complex, dimensional liquid. Sun Goddess has a floral aroma with notes of peach, nectarine, and cantaloupe. “The skin contact gives this wine texture and soul,” says Mack. “Mary J. didn’t invent this technique, but I think the fact that she was willing to work with someone who was doing this is cool, and I respect that. It feels authentic to me.”Emoji Rating: “Loudspeaker or megaphone 📣, because I want everybody to know about it”Sun Goddess Pinot Grigio$20 at Wine.comExplore Bon AppétitShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-03", "author": ["Condé Nast", "Mackenzie Chung Fegan", "Tiffany Hopkins"]}