{"id": "0f1cc748092e92f0a16c718b6f2cc25e", "url": "https://www.bonappetit.com/recipe/breakfast-burrito-to-go", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Breakfast Burrito Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBreakfast Burrito to GoBy Yekaterina BoytsovaMay 17, 20184.9(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig,  Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThis simple, no-fuss breakfast burrito can be made in about 5 minutes. It’s perfect for kids, to take on your commute, or for a road trip. We love to keep the filling classic with melty cheese, hot sauce, and avocado, but this recipe can be what you make it. Roll up whatever proteins, herbs, and veggies you happen to have on hand.IngredientsMakes 13large eggsKosher salt1Tbsp. unsalted butter112\" flour tortilla1oz. coarsely grated sharp yellow cheddar cheese (about ⅓ cup)½avocado, thinly sliced¼cup cilantro leaves and tender stemsHot sauce and sour cream (for serving; optional)PreparationStep 1Whisk eggs and a large pinch of salt in a medium bowl until very smooth and a little frothy, about 30 seconds.Step 2Melt butter in a 10\" nonstick skillet over medium heat. Add eggs and cook undisturbed until almost completely set but still a little runny 2–3 minutes. The idea is to cook them into a flat, round shape about the same size as the tortilla.Step 3Meanwhile, lightly toast tortilla over a medium-low flame, turning often with tongs, until warmed and lightly browned in some places, 5–10 seconds (or, toast in a large, dry skillet over medium-high heat until warmed and lightly browned in some places, about 1 minute per side). Transfer to a large piece of foil.Step 4Turn eggs with a rubber spatula, then slide out of skillet onto tortilla.Step 5Sprinkle cheese over eggs. Top with avocado and cilantro, leaving a 1\" border around the edges. Add a few dashes of hot sauce and dollop sour cream over, if using. Fold sides of tortilla over filling, then roll up to enclose. Wrap burrito in foil and let sit so cheese can steam and melt, about 3 minutes. Slice in half, if desired.How would you rate Breakfast Burrito to Go?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI have made these at least 4 times now - perfect work from home lunch! ClairePA, USA1/31/2022Can't wait to try these out! BrittJville, Florida8/22/2021I made these for 2 of us for a Sunday breakfast = really good. They were simple and I had all but the cilantro on hand. We added salsa and sour cream. Hot sauce is a must sprinkled over the egg before rolling. I used half cheddar and half pepper jack cheeses which gave it more flavor.  Also, I changed the eggs to 2 from 3 but our eggs were extra large. karenfarHuntington Beach, CA5/19/2019Explore Bon AppétitBurritoWrapTex-MexAmericanEggCheddarCheeseEasyQuickNut-FreeVegetarianFryBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Yekaterina Boytsova"]}