{"id": "0f24e61f88b1a4a0aafc26b0aa4e869c", "url": "https://www.bonappetit.com/story/party-tricks-alison-roman-wine-spritzer", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Bad Wine Is Just a Great Wine Spritzer Waiting to Happen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBad Wine Is Just a Great Cocktail Waiting to HappenIn Alison Roman’s new column, Party Tricks, the Dining In author defends the wine spritzer.By Alison RomanNovember 14, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.I’d love to pretend that my wine collection is full of only top shelf, extremely cool, “highly crushable” bottles with colorful labels and irreverent fonts, but guess what, it is not. Among the feisty pet-nats and funky orange wines lurks the more-than-occasional rando red I know retails for $7.99. Sometimes it’s leftover wine from a photo shoot, or something I got for free from an event, or a bottle brought over by a friend who made a very-last-minute run to a grocery store that only sells Chateau Diana “wine product” thinking I wouldn’t notice. (Well, I did notice! You know who you are!!). Regardless: It’s there, for better or for worse.Now, I consider myself a reasonable person. Which means that despite the added sugar and unpalatably high tannins, I’m still able to find value in all things that contain alcohol. So I am here to tell you that yes, you can still drink that bad wine. Maybe not straight from the bottle—I would absolutely not recommend that. But, when poured over ice, topped with a little seltzer (or trendy sparkling beverage of your choosing) and a healthy squeeze of fresh citrus, it can be better than good—it can be great.I’m sure somewhere out there, I am getting kicked out of a cool person’s wine club, but I have to live my truth. And my truth is that sometimes you’re having a dinner party and it’s the end of the night and all you have left is some not-great wine and guess what? It’s not going to drink itself. Plus, is there anything worse than opening up that bottle of chilled gamay you’ve been saving and serving it to someone too drunk to care how naturally fermented it is? No, there is not.Proof!\nPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiYou don’t even need a recipe to pull this off in a way that feels thoughtful instead of lazy, just the will to see past the butteriness of an over-oaked chardonnay to the promised land of tart, refreshing wine spritzers. (That’s right, I said it!!) Fill as many tumblers as you have guests with plenty of ice, and pour over whatever “just okay” or “kind of bad” wine you have lying around—say, three-quarters of the way up a glass. Top with effervescent water—Is it seltzer? Is it club soda? Is it soda water?? Honestly, still struggling to know the difference—and one or two good squeezes of citrus. To really go hi-low here, add a few dashes of Angostura or Peychaud’s bitters, which will tame any undesirable excess sweetness and make you look a bit fancy, then “garnish” (lol) with some sliced or peeled citrus. Pass around the glasses, and watch the party get a second wind.And there you have it. It’s a cocktail! It’s a spritzer! It’s bad wine, made good.And a batch of cookies, for good measure...Salted Butter and Chocolate Chunk ShortbreadLess chocolate chip cookie, more brown sugar shortbread with chocolate chunks—these cookies have started an Instagram craze.View RecipeExplore Bon AppétitBasicallyParty TricksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Alison Roman"]}