{"id": "0f47645d1eb00861a0e450eb3578540b", "url": "https://www.bonappetit.com/story/cauliflower-bolognese", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Cauliflower Bolognese Is My Boyfriend Now—Apologies to My Husband | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleApologies to My Husband But Cauliflower Bolognese Is My Boyfriend NowI love this sauce so much I've taken to calling it my \"Cauli Bo.\"By Sarah JampelDecember 17, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailAs a vegetarian, my experience with bolognese consists of standing in the pastry kitchen at my former restaurant job, churning gelato while listening to the head chef shout \"Bolo! Bolo! Bolo!\" to the cooks in the back as each order came in. I didn't even know what \"bolo\" (pronounced like the always-in-fashion tie) meant until I asked (derp). But, as it turns out, this ignorance made me the most unbiased judge of senior food editor Andy Baraghani's Cauliflower Bolognese. With no meaty ragù in my taste memory, I had a blank palate and an open mind. This cauli bolo (or cauli bo, as I've affectionately dubbed it) didn't have to live up to any impossible-to-meet (or meat!) standards: I could judge it by its own vegetarian credentials.Because while cauliflower bolognese takes inspiration from the classic beef-pork, or beef-pork-veal, or beef-pork-antelope sausage (?!) sauce in that it's the perfect, luscious, glossy,  Sunday-night-into-Monday-lunch meal—this version is another beast entirely.In place of ground meat, cauliflower is our foundation: It gets blitzed in a food processor as if you're making cauli rice, then cooked down with finely chopped shiitake mushrooms (for a savory, earthy base), onion, sliced chile, woodsy rosemary, plenty of tomato paste, and garlic—lots of garlic. Once the cauliflower starts to lose its moisture (a good indicator is that it will start to stick to the pot), you'll shuttle in al dente pasta and plenty of its cooking liquid. With that addition, the contents of your Dutch oven transform from a mixture of sweated vegetables and aromatics to a velvety but—trust me—bitsy sauce. (Honestly, the texture is not unlike that of cottage cheese: creamy but not homogenous.) Rigatoni is the shape you want: The sauce burrows away in those tubes, ready to surprise and delight you with every bite.My fixation with the tomato-y, cheesy, rich-but-not-heavy cauli bo—I ate it three days in a row, hiding it from my partner onto whom I normally push all pasta leftovers—piqued my curiosity about its meat counterpart. So I texted my friends—not my colleagues, since that would've been embarrassing—about the ideal texture of bolognese. \"Pretty creamy,\" one responded. \"But the meat adds a pleasant chewiness. It sounds weird and terrible, but I can't think of another word. It should also kind of melt in your mouth after the first few bites.\" Another one said \"warm and soft.\" When I reminded him that warm is not a texture, he rebutted, \"True, but it’s a mouthfeel. Crumbly.\" What insight! At that point I mustered the courage to just ask the food editors, who said \"velvety,\" \"meat pudding,\" \"meat paste,\" and \"Sloppy Joe.\"So this isn't a meat pudding, but it could pass as the filling for a vegetarian Sloppy Joe, and I'd definitely describe it as velvety. And there you have it: Cauliflower bolognese isn't as wildly different from bolognese-bolognese as I'd originally predicted. Besides, Andy admitted to me (actually, I was eavesdropping) that even though he has been ankle-deep in meat bolognese all month (he's working on a recipe), it was the cauliflower bolognese he returned to for a second helping.Get your own boyfriend:Cauliflower BologneseNo, this isn’t some kind of joke, and you don’t have to be a vegetarian to love what’s going on here.View RecipeExplore Bon AppétitVegetarianComfort FoodRead MoreLifestyleThis Roasted Broccoli Recipe Tastes Kinda Like DoritosBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Sarah Jampel"]}