{"id": "0f6b53a67018c33b1f775838398ae84e", "url": "https://www.bonappetit.com/story/healthyish-gift-guide-2020", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "11 Self Care & Wellness Gifts for People With Impeccable Taste  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »LifestyleThe Healthyish Gift Guide for People With Impeccable Taste11 gifts to congratulate everyone you know (including yourself!) for making it through 2020.By The Healthyish TeamNovember 17, 2020FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Need more gift ideas? We’ve got everyone on your list covered right over here.All the CBD bath bombs in the world couldn’t erase the stress of 2020, but that doesn’t mean we’re not passing them out to everyone on our list this year, along with other covetable gifts like transportive cookbooks and extremely pourable olive oils. This hyper-curated guide has everyone covered, from hard-core plant parents to your friend who’s gotten “really into puzzles” this year (we don’t blame them). For your best friend whose best friends are plantsEveryone knows that plants make people happy, but what makes plant people happy? Chic ceramic pots like these vibrant hand-painted planters from Nashville-based artist Pepper Sims, which can house propagated philodendron cuttings or help justify a new pilea purchase. They’ll brighten up even the dreariest midwinter windowsill, but their appeal goes beyond aesthetics. The planters are made from porous terra-cotta, which lets air and water flow to ward off dreaded root rot. Experienced plant parents will be impressed; beginners will be grateful (even if they don’t know it yet). –Aliza Abarbanel, Healthyish assistant editorPhoto by Emma FishmanPepper Palm Desert Days Large Pot$40 at EtsyFor the roommate who pours EVOO like it’s waterHere’s a not-so-hot take: I really love olive oil. It’s my favorite oil to cook with at home, so I use a lot of it pretty much everywhere. As I learned more about high-quality olive oils, I started using more premium offerings, but those felt way too precious for my heavy-handed pours. Thankfully, Diaspora Co. founder Sana Javeri Kadri showed me Séka Hills, a winery and olive oil producer operated by the Yocha Dehe Wintun Nation in Northern California. I’ve been buying their Arbequina olive oil in bulk (3 liters), which comes out to around $15 a liter (a steal for the good stuff!) and typically lasts us for three months. It’s got a brilliant green color and a vibrant, peppery flavor that works equally well for cooking and drizzling. With farming practices that focus on sustainable agriculture and environmental preservation of the Capay Valley, it’s a purchase I can feel good about too. –Trinity Mouzon Wofford, cofounder of GoldeCourtesy of Séka HillsSéka Hills Olive Oil$50 at Séka Hills$77 at AmazonFor your friend who loves ceramic but breaks everythingIf you hear “enamelware” and think of splatterware camping gear, check out these psychedelic marbled stunners. Bornn’s cobalt dishware is lightweight and safe to heat, and each plate is one of a kind. These smaller plates are perfectly sized for a slice of cake or afternoon snack, but their utility extends far beyond the dining table. Use one as a key dish and stash jewelry in another. We recommend buying a set of four to scatter throughout your home in anticipation of dinner parties to come. –Aliza Abarbanel, Healthyish assistant editorCourtesy of End ClothingBornn Enamel Plate$25 at AnthropologieFor cooking burnouts who need to feel inspired againFor better or for worse, 2020 will go down as the year we cooked more than ever before. But as the allure of elaborate baking projects and from-scratch lunches faded, the kitchen burnout became real. Luckily, we were delivered the cure: In Bibi’s Kitchen, a new cookbook from Hawa Hassan and Julia Turshen that shares recipes and stories from grandmothers (or bibis) in eight African nations that border the Indian Ocean. This region is the heart of the spice trade, and you can taste the impact in each dish: stew-y doro wat perfumed with spicy-sweet berbere, Somali pasta with warming xawaash. It’s the sort of food that fills your stomach, soul, and fridge for days, transporting familiar surroundings into a new world of flavor. –Aliza Abarbanel, Healthyish assistant editorCourtesy of Penguin Random House“In Bibi’s Kitchen”$35 $32.20 at Bookshop$22 at AmazonFor someone who could use a spa day (without the spa)For those blessed with a bathtub, there’s no better gift than these delicate bath salts. The made-in-Kyoto sachets contain a trio of calming scents—zesty yuzu, delicate cherry blossom, and earthy bamboo—designed to bring onsen vibes to any bathtub. Bath salts are thought to promote circulation and moisturize the dry, flaky skin that often accompanies the colder months. They’re also straight-up relaxing. Pour a packet into the tub, turn up Harps and Rain Volume 3, and give yourself the greatest gift of all: a break. –Aliza Abarbanel, Healthyish assistant editorCourtesy of JinenIyashi Healing Bath Salt$15 at JinenFor your favorite couch potatoMy household likes to keep a cozy and comfy seating situation, so our living space is decked out with handmade, vintage, and heirloom pillows. Last winter I treated myself to one of these soft sculptures from Allison Tran’s Touchy Feely Studio because it’s fun, artsy, and plays well with the rest of the collection. As a three-dimensional artist working in ceramics, I really appreciate accessible and functional art objects that bring some magic and joy to the home. I’m also really into softer mediums than my own, like the soft and plushy fabric of these pillows. Each pillow is handmade and hand-stuffed by the maker—a quality that you can really feel. I can’t help but smile when I see it. In my mind, I imagine it greeting me when I get home. –Yiyi Mendoza, ceramist and co-owner of Yesfolk TonicsPhoto by Emma FishmanHand Pillow by Touchy Feely$84 at Touchy FeelyFor your friend who’s committed to outdoor everything this winterI’m all about the to-go blanket this winter for outdoor dining and chilly park hangs. But a good—and good-looking—portable option is hard to find, which is why I swooned when I saw this one from Minna, the design retailer based in Hudson, NY (the brick-and-mortar shop is a must-visit if you’re in the area). Minna’s Gold Stripe throw is hefty enough to keep your toes warm but lightweight enough to stuff in a tote for your next outdoor activity, and, most exciting, you can throw it in the washing machine when you’re back. I love that it’s handwoven on flying shuttle looms by a family-run cooperative outside Oaxaca City—I swear you’ll feel the desert sunshine coming off it all winter long. –Amanda Shapiro, senior editorPhoto by George UnderwoodMinna Gold Stripe Throw$150 at MinnaFor your neighbor whose quarantine hobby is gardeningKitazawa Seed Company has been selling heirloom Asian seeds for over a century. Kitazawa’s selection is massive, but its curated Chef Specialty Garden bundles are a great place to start. The seeds are super high-quality, yielding gorgeous plants and delicious fruit. We’re eyeing the Pickling Garden in particular, which includes Japanese eggplant, cucumbers, melons, daikons, and turnips. Give it to someone for the holidays so they can plant in the spring, harvest in the summer, and pickle for next winter. –Emma Wartzman, assistant editorial producerPhoto by Emma FishmanTsukemono Favorite Pickling Garden$26 at Kitazawa Seed Co.For the person who lives to puzzlePuzzles are timeless. But their recent appeal, with all the evenings and weekends we’re spending at home, makes sense. Lucky for us, the newsletter-based brand Girls Night In just started a product line called Whiled, featuring four 500-piece puzzles, each designed by a different artist. Call us predictable but our favorite is Sunny Side Up by Lan Truong, whose illustrations we love. Just looking at that breakfast spread makes us hungry. –Emma Wartzman, assistant editorial producerCourtesy of TKSunny Side Up Puzzle$37 at WhiledFor your relative who cleans everythingIn a never-ending quarantine quest to make my home as clean and comfortable as possible, I most recently turned my attention to indoor air quality. Between seasonal allergens, windowsill soot, and whatever my downstairs neighbor just cooked for dinner, I realized that my space could likely use a little freshening. Enter Coway’s Airmega 150. It’s smaller than a typical box fan, has a range of around 200 square feet, and has three different manual fan speeds. At level 1, it’s virtually silent—up from there, it’s relatively unobtrusive white noise. I usually leave it on auto mode, though, so the air quality sensor tracks pollution levels and automatically kicks into high gear when needed, like when we’re cooking dinner and things start to get smoky. I love this air purifier so much that I recently went on to purchase a second, only to find that Coway’s inventory was completely cleared out (likely from folks doing their best to cope with the ongoing wildfires). Now that they’re back in stock, do yourself a favor and invest in cleaner indoor air, if for nothing else, the lack of dust bunnies. –Trinity Mouzon Wofford, cofounder of GoldeCourtesy of TKCoway Airmega 150$190 at CowayFor the friend you’re always asking “where’d you get that?”Andy Baraghani's Fall-Apart Caramelized Cabbage recipe was a Big Moment for the humble winter vegetable. Look at that cabbage all nestled in its tomatoey olive-oil bath! But, for me anyway, it was the serving spoon that stole the show. The tortoise stunner is made by Sabre, the whimsical French tableware brand, and comes with a matching serving fork. But if I were you, I’d add the rest of the tortoise collection to your wish list too: spoons and forks in two sizes, plus a butter knife and a sharper one for cutting through all that fibrous cabbage. They’re all made of super-durable stainless steel and are dishwasher-safe, but you’ll use them so often I bet they’ll never make it there. –Amanda Shapiro, senior editorCourtesy of SabreSabre Tortoise Flatware$69 at Gracious StyleFor anyone who wants to give backThis year, we're donating to Feeding America to support all the work they've done and still have to do. The nationwide network of over 200 food banks and 60,000 food pantries has fed our neighbors for decades, and their work is extra essential right now. The economic impact of COVID-19 has increased food insecurity: In October alone, food banks distributed 50 percent more food than an average month last year. Feeding America estimates that over 50 million people could be food insecure by the end of the year, including 17 million children. Each donation will help fund drive-thru food pantries, grocery deliveries, and other essential services, and your giftee will receive a thoughtful e-card.Illustration by Fran CaballeroDonate to Feeding AmericaShop Now at Feeding AmericaExplore Bon AppétitHealthyishShoppingHoliday 2020Read MoreGift Guide 2020Gifts Under $35 for Your Neighbor, Your Mailman, and the Urban Homesteader in Your LifeBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-17", "author": ["Condé Nast", "The Healthyish Team"]}