{"id": "0f6f9df914adea5e364aae40f58c8f25", "url": "https://www.bonappetit.com/story/how-long-does-wine-last-after-opened", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "How Long Does Open Wine Actually Last? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Long Does Wine Actually Last After It’s Opened?You know you have a bottle of open Pinot Grigio in the fridge right now and have asked this same question.By Marissa A. RossAugust 21, 2020FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I used to be one of those people who never left a bottle unfinished. But when drinking wine became my job, I found myself with more half-full bottles than ever; wines I loved and couldn’t bear to throw out just because they had been open for a day or two. Perhaps you opened that bottle of Gamay a little late in the evening, or you only needed a splash of Pinot Grigio for your linguine and clams. Now here you are the next day/three days/week with half a bottle of wine and the timeless question: How long does an open bottle of wine last, really?Because wine can be made in so many different ways, it’s impossible to give you a hard out on all wines. That would be like asking how long you have to eat a Snickers after you unwrap it versus how long you have to eat an organic banana after you peel it. They are radically different. One is built to sit on gas station shelves for years and the other just got picked and has about three days before it dies. It’s similar with wine.The best way to keep wine after you’ve opened it is to remember to recork it and put it in the fridge. By recorking and refrigerating, you’re limiting the wine’s exposure to oxygen, heat, and light. These are all the things that take a bottle of wine from being next-day-decent to downright disgusting. If you were responsible enough to remember these precautions before you hit the hay, a bottle of red or white wine can last approximately between two and five days. For sparkling wine, you have one to three days (it will for sure go flat, but it’s still drinkable, and sometimes chugging flat sparkling wine after a long day is better than no wine at all). A wine could go bad in a day if it’s an unstable natural wine, or it could last for a week if it’s a highly tannic, commercial red you haven’t touched since the night you accidentally opened it.Rabbit Stainless Steel Wine Preserver$15 at Bed Bath & Beyond$32 at AmazonGet in the habit of saving your wine for later by recorking after each glass now instead of leaving the bottle open on the counter for hours. PLUS, your wine will stay fresher throughout the evening. If you accidentally trash your cork along with the remnants of your take-out dinner, or it does that thing where it expands to twice its size and you can’t shove it back in, fear not. Okay, maybe fear a little if you don’t have any extra corks or wine stoppers around, but you can use plastic wrap and a rubber band. It’s not ideal, but it will help you create a seal around the top of the wine to slow oxidation. Also, go ahead and add some stoppers to your Amazon cart. (I’m a fan of Rabbit’s vacuum stoppers).But let’s say it was one of those nights where you barely got your teeth brushed, let alone gave a second thought to that open Cabernet Franc and left it out all night. While you will most likely end up needing to dump it, pour yourself a glass before you send it to the sink. First, take a look at the color. If the wine has gone from vibrant to brown-tinged, sadly, it’s got to go. That’s a sign of oxidation, as is the smell and/or taste of bruised apples in white wine and vinegar in red wines. As I mentioned before, there’s no telling when exactly your particular wine will start exhibiting these characteristics, so you just have to keep your wits about you. But if it looks good and smells like you’d actually like to drink it, give it a taste. You might even dig it! Especially if you’re already in your sweatpants and you are 100% not leaving the house.Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-27", "author": ["Condé Nast", "Marissa A. Ross"]}