{"id": "0f6f1e8524ba8bf1084ff35e24624380", "url": "https://www.bonappetit.com/recipe/salted-coconut-ladoos", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Salted Coconut Ladoos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Coconut LadoosBy Shilpa UskokovicFebruary 3, 20224.0(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata. Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintSweet and just a touch salty with a faint thrum of cardamom, these adorable little ladoos are well suited for any celebration, from Diwali to Valentine’s Day, or simply for serving after a weekend lunch. In India, ladoos encompass any confection rolled into balls small or large. They range from bright orange ladoos made with sweetened drops of fried chickpea flour batter to raw versions full of crunchy nuts mortared together with a dried fruit paste. Chewy coconut ladoos happen to be my favorite. These are loosely based on a recipe by Meera Sodha that employs a technique similar to Brazilian brigadeiros where condensed milk cooked down to a fudge provides both sweetness and structure. A nonstick skillet simplifies the cooking and cleaning. Should you not have one, stir and scrape the pan like a dervish to prevent any sticking. —Shilpa UskokovicAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonInstant-Read Thermometer$35 At ThermoworksSilicone Spatula$13 At BA MarketCan Opener$14 At AmazonIngredientsMakes about 24114-oz. can sweetened condensed milk1½cups (120 g) unsweetened shredded coconut; plus more for decorating (optional)3Tbsp. unsalted butter, cut into 1\" pieces2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt½tsp. ground cardamomFinely chopped toasted pecans or pistachios (optional) and sprinkles (for decorating)PreparationStep 1Cook one 14-oz. can sweetened condensed milk, 1½ cups (120 g) unsweetened shredded coconut, 3 Tbsp. unsalted butter, cut into 1\" pieces, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and ½ tsp. ground cardamom in a large nonstick skillet over medium-low, stirring constantly with a heatproof rubber spatula, until mixture is fudgy and resembles a soft dough that pulls together into a blob (an instant-read thermometer should register 200°), 8–10 minutes. Scrape coconut mixture onto a small rimmed baking sheet or large plate and let cool until comfortable to handle, about 30 minutes.Step 2Scoop 1 Tbsp. (19 g) coconut mixture into your hands and roll into a ball between your palms. Place on another rimmed baking sheet. Repeat with remaining coconut mixture.Step 3Place some unsweetened shredded coconut and/or finely chopped toasted pecans or pistachios in a small bowl. Place some sprinkles into another small bowl. Working one at a time, roll ladoos between damp hands (this will help the garnishes stick), then toss in coconut and press tops of some ladoos into sprinkles (ladoos will flatten in the process; reshape into balls). Place in small paper cups or on a platter as you go.Do ahead: Ladoos can be made 3 days ahead. Store airtight at room temperature.How would you rate Salted Coconut Ladoos?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI want to try this but substituting the sweetened condensed milk with sweetened condensed coconut milk for a vegan version. You can’t go wrong with more coconut, right?Anonymous2/5/2022@mo if you do that it’ll be like a candy goo, rather than a fudge. AnonymousChicago 2/5/2022can't give a review if you play games with my subscription----Anonymous2/5/2022Can I substitute another healthier sweetener than condensed milk ? Honey+coconut cream ? MoPortland 2/4/2022Explore Bon AppétitDessert5 Ingredients or FewerEasyGluten-FreeIndianSouth AsianAsianCardamomHerbs & SpicesCoconutFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-03", "author": ["Condé Nast", "Shilpa Uskokovic"]}