{"id": "0f883e4e4d4efab0dc273362e95c1144", "url": "https://www.bonappetit.com/story/alliance-traverse-city-kinilaw", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "The Share Plate I Can’t Share in Traverse City, Michigan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Share Plate I Can’t Share in Traverse City, MichiganAnd it’s made with Michigan shrimp! I still can’t get over that.By Alex BeggsAugust 29, 2019FacebookTwitterEmailPhoto by Trap-StudioFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When you’re in the cherry capital of the world...I really think you should try the Michigan shrimp. It’s at my favorite restaurant in my boyfriend’s hometown of Traverse City—scratch that, the entire state of Michigan (but honestly! I’ve been to many other cities!). At Alliance, chef James Bloomfield leads a tiny team of seven to cook food inspired by the cheffy cookbooks on the shelves above the bar—from Zahav to Momofuku to Tokyo New Wave. Initially the share-able menu seems slightly all over the place: beets with za’atar, fried chicken, rabbit carnitas, cherry tomato toast. But it works in the way that the things we crave are all over the place. Nothing is overthought, overwrought, or underseasoned. Every bite is fabulous, especially the kinilaw, a Filipino ceviche made with Michigan shrimp and a crazy good coconut broth. It’s been a menu standby for the three years Alliance has been open and I knew our party of three would require two orders on my most recent visit, because some share plates I have trouble sharing.Michigan shrimp? Yeah, I still can’t get over that. It’s sustainably raised in Okemos, Michigan, at ECA (Environmentally Conscious Aquaculture) Farms—kind of a mouthful name, but they have a fascinating tank setup that produces clean-tasting, tender pink-shelled shrimp that aren’t as briny as the Gulf shrimp I grew up with. At the restaurant, they sous-vide the shrimp until they’re slightly bouncy, and then serve in a light, chilled coconut broth with lemongrass, ginger, chile oil, lime juice, coconut vinegar, and cilantro stems. It’s creamy, tangy, and ridiculously flavorful, making you come back for spoonful after spoonful. Soak up the leftover broth with sous chef Becca Snook’s squishy, crispy-crusted white bread.To accompany, sommelier Andrew Kemp’s wines are thoughtful and fun. If you’re excited about wine and show it, he’ll open something for you that’s “in the back”—leftover from special events and other coveted bottles too low in quantity to add to the wine list. We had a bubbly Austrian blanc de blancs that tasted like Champagne meets cream soda. Paired with the kinilaw, can you imagine anything better?Go there (from Wednesday to Sunday only): AllianceExplore Bon AppétitHighly RecommendMichiganShrimpRead MorerestaurantsSecret Sandwiches Beat All Other Lunch OptionsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-29", "author": ["Condé Nast", "Alex Beggs"]}