{"id": "0f8846b7f50cbe98827e0448f83c7fc3", "url": "https://www.bonappetit.com/recipe/lemon-saffron-salmon-with-dill-rice", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "Lemon-Saffron Salmon With Dill Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLemon-Saffron Salmon With Dill RiceBy Yasmin FahrJuly 26, 20204.6(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Justin Bridges, Food Styling by Tyna HoangEmailPinterestPrintEmailPinterestPrint\"This lemon-saffron bathed salmon served with sheveed polo, a Persian dill rice, is a variation on a dish my mom made me growing up (and continues to make when I go home to visit),\" writes recipe developer Yasmin Fahr. \"Saffron’s deep crimson threads add an intense sunset orange hue and rich aroma to whatever they touch, but the downside is that saffron is very expensive. Enter a technique that my grandmother taught my mother, who passed it onto me: By gently grinding the saffron threads, then mixing them with water, you can create a liquid that makes a small amount of the expensive spice go a longer way. While my mother is an excellent cook, my dad was the one who taught me how to make rice. One of the more important lessons that I learned from him is that it’s crucial to use good quality basmati—otherwise, the strands will likely stick together and become mushy rather than the fluffy, individual grains we’re looking for. I try to buy mine from Middle Eastern stores (look for the Reserve or India Gate brands); in a pinch, I’ve called up an Indian restaurant and asked to buy some directly from them. If you’re not a fan of dill, skip it. Plain rice will still taste delicious with the bright, rich-tasting fish.\"All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit Market13x9\" Baking Dish$20 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonSpoon$24.69 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMesh Sieve$13 At AmazonMedium Saucepan with Lid$36.99 At AmazonIngredients4 servings46–8 oz. skin-on salmon fillets5Tbsp. extra-virgin olive oil, divided1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepper1tsp. saffron threads3lemons, divided1cup dill leaves with tender stems1cup high-quality basmati rice¼cup parsley leaves with tender stems1cup plain thick yogurt (such as labneh, skyr, or Greek)PreparationStep 1Preheat oven to 400°. Pat four 6–8 oz. skin-on salmon fillets dry with a clean kitchen towel or paper towels. Place in a large glass or ceramic baking dish; drizzle with 2 Tbsp. extra-virgin olive oil and season all over with kosher salt and freshly ground black pepper. Rub salmon to coat and arrange skin side down.Step 2Crush 1 tsp. saffron threads in a mortar and pestle (a small bowl and the handle of a wooden spoon also work well) until it’s mostly powder (it’s okay if it’s not perfectly powdery). Transfer to a small bowl and pour in 1 Tbsp. plus 1½ tsp. warm water. Stir until an intense sunset-orange hue and most of the saffron is dissolved (it will look like little crimson dots floating in an orange pool). Cut 2 lemons in half and squeeze juice into bowl, using your hand or a sieve to catch any seeds. Pour liquid over salmon, then turn fillets skin side up. Let sit at room temperature at least 15 minutes or until you’re at a stopping point with the rice.Photo by Justin Bridges, Food Styling by Tyna HoangStep 3While the salmon is marinating, make the rice. Using a chef’s knife, finely chop 1 cup dill leaves with tender stems as small as possible; set aside. Place 1 cup high-quality basmati rice in a fine-mesh sieve and rinse under cold running water, using your hand to agitate rice until water runs mostly clear. Shake off excess water.Step 4Transfer rice to a small saucepan and add remaining 3 Tbsp. extra-virgin olive oil, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 2 cups room-temperature water; stir to combine with a wooden spoon. Bring to a boil, then reduce heat and stir in reserved dill. Simmer, stirring occasionally, until most of the water is absorbed and rice is mostly tender with a still-hard center, 5–8 minutes. (Taste a few grains to check!)Step 5While the rice is cooking, cover saucepan lid with a kitchen towel, securing it at the top with a rubber band or an elastic so that it won’t fall down. (A sheet or two of paper towels, making sure the sides won’t drape down near any flames, will also work.)Step 6Reduce heat to low. Cover rice with towel-lined lid and cook until tender and fluffy, about 10 minutes. Remove from heat, fluff with a fork, and let sit, covered, at least 5 minutes or until ready to serve.Photo by Justin Bridges, Food Styling by Tyna Hoang Step 7While the rice steams, cook the fish. Turn fillets skin side down and roast until exterior is opaque and interior is a light pink, 15–18 minutes.Photo by Justin Bridges, Food Styling by Tyna Hoang Step 8Coarsely chop ¼ cup parsley leaves with tender stems. Cut remaining 1 lemon into quarters. Spoon 1 cup plain thick yogurt (such as labneh, skyr, or Greek) into a bowl.Step 9Divide rice among plates and top with salmon; sprinkle parsley over. Serve with lemon wedges and yogurt alongside, as well as any leftover sauce in the baking dish.How would you rate Lemon-Saffron Salmon With Dill Rice?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleShockingly good in flavor and texture - I would venture to say one of the best recipes I've made in all my years of cooking. I doubt it was my joy alone with the saffron, as I followed the directions to a T... the saffron flavor was so so delicious (1 teaspoon?!!! how could it be any more perfect?! certainly no less would do) - and the yogurt with the salmon was incredible. The texture and tartness was the first thing you want to eat with fish. My partner and I took one bite and barely had any for leftovers, fortunately. A delight because salmon and saffron are both on the expensive side. One of many redeeming things about the recipe was the dill rice - I will be using that in future dishes.Clarice L.Phoenix, AZ1/27/2022Shockingly bad in flavor and texture - I would venture to say one of the worst recipes I've made in all my years of cooking. I'm hoping it was my own error with the saffron, though I followed the directions to a T... The saffron flavor was way too overpowering (1 teaspoon?!!! did i read that right?! certainly a few threads would do)  - and the yogurt with the salmon was nauseating. The texture and tartness was the last thing you want to eat with fish. My partner and I took one bite and had to throw it out, unfortunately. Bummer because salmon and saffron are both on the expensive side. The only redeeming thing about the recipe was the dill rice - I will be using that in future dishes. AnonymousLos Angeles, CA1/10/2022Why make this so difficult - make the marinade, put it on the salmon and set the salmon aside for 15 minutes. Put in the oven and begin to make the rice. The rice and fish should cook in about 15 - 20 minutes, then plate the dish. CSmith12/2/2021The ads and videos in this recipe are ridiculous, as I am finding this is happening with most of your recipes. I'm so disgusted, that I'm considering cancelling my bonappetit subscription.  You can do better......\n\n\nAnonymous11/19/2021Why would you cover this recipe with ads and videos that can't be closed? Not only does it make the recipe worthless, it makes me feel as I would NEVER patronize those advertisers.Hoosier CookIndianapolis11/14/2021One of the best salmon and rice combo dishes I’ve made! The rice is a game changer and definitely a new staple in my house. Delicious recipe overall that i will make again. Deena G9/24/2021I hate to say it, but I was mostly underwhelmed with this recipe. Plus side was that preparation was easy and the overall process was quite quick (perfect for a weeknight situation). I did enjoy how the saffron imparted a beautiful, rich red coloring to the fish, but didn't really add much flavor-wise in my opinion. It was missing...something. Perhaps, some heat? Similarly, the rice wasn't complex enough for my taste to make up for the lacking of the fish's seasoning. All in all though, I really enjoyed trying out this new marinating method and may co-opt it in different salmon recipes which pack more of a punch in the future. I might also try this out again with a doctored up yogurt-herb-situation to see if that rounds things out.\nAlso, FYI, you can also use the lemon zest to add to the rice — why waste it?SAArlington, VA6/19/2021Fish and Rice had so much flavor. Love the yogurt complimenting the dish.AnonymousCincinnati, Ohio7/30/2020This was delicious. I was a little confused on the rice cooking, but I figured it out. Didn't have any yogurt, but miracle whip with some grated garlic worked in a pinch. Had with a side salad. Boyfriend raved about it (he's not usually a huge fish fan, so that's a real compliment). Perfect use for my fresh, farmer's market dill. Would def make again. charlottemzimmermanSaint Paul, MN7/28/2020Brilliant! A masterpiece of a recipe! \nCan be used with other fish, also. \nThank you!AnonymousAtlanta7/26/2020Explore Bon AppétitPersianMiddle EasternSalmonFishSeafoodRiceRice & GrainsSaffronHerbs & SpicesDillEasyWeeknight MealsMainGluten-FreeNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-26", "author": ["Condé Nast", "Yasmin Fahr"]}