{"id": "0f9c04df6d2ffb5033632ca31ee01e5d", "url": "https://www.bonappetit.com/story/valentines-day-dinner-ideas", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "8 Valentine's Day Dinner Ideas, From Our Favorite Food Couples | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture8 Food Couples on What They’re Actually Cooking for Valentine’s DayFrom Netflix and hot fudge to prime rib and R&B. (Steal their ideas!)By Ali FrancisFebruary 8, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailI’m going to be honest: I dislike going out for a meal on Valentine’s Day. Nothing kills the vibe more than a heart-shaped helium balloon to the dome. It’s cold outside. I want to take a bath and wear my stretchy pants. I also want to eat delicious food (that’s a smidge more intentional than my usual sheet-pan whatever) while basking in love’s warm glow. But after nearly two years of cooking, working, and everything-ing from home, I’ve lost my romantic mojo. I don’t know how to say “I love you” with anything anymore.My colleagues, it turns out, feel the same. So, for a little inspiration, we asked eight of our favorite food couples—the chefs, restaurateurs, farmers, and general cooking-obsessed people who just happen to be dating each other—to share their ideal Valentine’s Day plans. From hot fudge sundaes on the couch to fancy beef Wellingtons, consider these romantic blueprints for your own dream date night—even if that is just with your cat. Light a candle. Make something nice. That’s… amore.Photograph by Emma Fishman, food styling by Caroline Hwang, prop styling by Aneta FlorczykDanielle Bell and Pablo Osorio: Peruvian Mussels and Pound CakeAfter meeting through a mutual friend, Danielle Bell, a baker from Louisville, and Pablo Osorio, a chef from Lima, started cooking together early in their relationship. Seeing a barely used paella pan in Bell’s Brooklyn apartment, Osorio suggested that they cook paella for their first dinner party together. In the decade since, their romance has also given rise to their now Los Angeles–based culinary project, de Porres Dinner Series.Cooking together, and for each other, has made sense since the start. Osorio is drawn to savory; Bell dreams in sweets. He introduced her to the best Peruvian food she’d ever had and she showed him Southern techniques and all kinds of baked goods. “Food’s always been something of a love language for us,” Bell says.When they aren’t cooking for work, their ideal date night meal would start with choros a la chalaca, a Peruvian mussel dish. Braised leeks and an Asian pear-shiso salad with fried quinoa would follow. And because their special occasion menus always call for duck—it’s Bell’s favorite meat and a popular protein in northern Peru, where Osorio’s grandmother is from—the main course would be seco de pato, duck legs slow-cooked in a beer-based stew.Dessert is another obvious choice: Bell is known for her riffs on her mom’s pound cake, and this time, it would be flavored with lemon and elderflower and served with roasted strawberries (because what’s a Valentine’s Day menu without strawberries?). “Simple but perfect—you don’t need more than that,” Osorio says. —Bettina Makalintal, associate print editorPhoto by Alex LauBill Clark and Andrew Spena: Shrimp Cocktail and Special CookiesSome couples get to know each other over drinks or park walks. But for Bill Clark and Andrew Spena, their fourth date took place at a restaurant demolition site. “My apartment was down the block and I happened to be working from home,” Spena recalls. “Bill said, ‘We’re taking down walls, do you want to swing a hammer?’ I came by and he showed me how to demo a wall.” Clark had just signed the lease for the space that would become Brooklyn’s beloved Meme’s Diner, which closed its doors in 2020.When they’re not eating at spots around NYC, Clark and Spena’s date night menus are “elevated versions of how we normally cook for each other,” Spena says. “It’s what sounds the best that day or what will make the other person feel good.” More often than not, that’s shrimp cocktail. “We poach our own shrimp and make a whole thing out of it,” Clark says. “Date nights are about big star proteins—last year we made the lobster fra diavolo risotto [from my substack A Piece of Cake]. Or we’ll do a big fat rib eye or a little caviar or something special specifically for Valentine’s Day.”The drinks are always consistent—martinis or Manhattans—as is the hydration: “Whoever is playing bartender will chill the glass with ice and water, then bring that to the other person, who will drink the water. It’s a little way of taking care of each other,” Spena explains. As was true at Meme’s, Clark handles the flowers, Spena is DJ, and, because Clark is an extraordinary baker, there’s always dessert—“even if it’s just a big plate of fruit and a special cookie.” (Spena, it should be acknowledged, is, in Clark’s words, “the star dishwasher.”)This year, “like every Valentine’s Day,” Spena says, “we’ll be working in a restaurant”—specifically, a steakhouse-inspired pop-up at Edy’s Grocer. “We’ll sit down afterward, eat some of the food ourselves, and celebrate a job well done.” —Sarah Jampel, senior cooking editorPhoto by Alex Lau, styling by Claire SaffitzTrina and Jessica Quinn: PJ’s, Netflix, and Roast Chicken“Working in the service industry, it’s hard to date ‘normal people’ because your hours are all over the place,” says Jessica Quinn, who met her wife, Trina, on OKCupid. For the 10 years they’ve been a couple, those all-over-the-place hours meant they never spent Valentine’s Day together. Instead, they were working. Most recently Jessica was executive pastry chef at Rezdôra in Manhattan, and Trina was the sous-chef at Red Hook Tavern in Brooklyn.The pandemic brought changes—most notably the opportunity to launch their own culinary project, Dacha 46, an ode to Jessica’s Latvian-Ukrainian heritage that includes pop-ups, collaborative dinners, and frozen pelmeni. It also meant that, last year, they were able to spend their first Valentine’s Day together. “The vibe was pajamas-slash-sweats,” Jessica recalls. “I hate to admit it, but we’re eat-on-the-couch-while-binge-watching-something people.” Trina clarifies, “Our shows of choice are serial killer documentaries or ghost-hunting shows.” Qué romántico!As for the food, big fussy meals are out. “We spend so much time cooking fancy things for other people,” Jessica explains. Instead, their ideal V-Day menu starts with a giant cheese and charcuterie board with cornichons and olives. Then, roast chicken—specifically Trina’s spatchcocked chicken spiced with paprika, garlic, and lemon, pan-seared under a brick and served with mashed potatoes. “She makes me make mashed potatoes for everything, and I don’t even like mashed potatoes,” laments Trina, to which an exasperated Jessica responds, “What type of person doesn’t like mashed potatoes?!”For dessert, it’s ice cream sundaes with Jessica’s hot fudge sauce and vanilla Häagen-Dazs. (“NOT vanilla bean. I’m very specific,” Jessica clarifies). To drink? Shots from a giant bottle of Beluga vodka, paired with pickles. —MacKenzie Chung Fegan, senior commerce editorPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaNorma Listman and Saqib Keval: Big Cheeseboard Energy“I always joke that we [found each other] on Craigslist, Missed Connections,” says Saqib Keval. He’s talking about meeting his now wife, Norma Listman, back in 2014 while both were working at a mutual friend’s Oakland restaurant—Listman as a consultant during the day, Keval as a chef in the evenings. Luckily, neither had to post online to reconnect after their first encounter. “I was more annoyed than anything at first,” Listman jokes, explaining how the two kept bumping into each other in the kitchen over the next few months.It wasn’t until the first time they worked together directly, for the community-based dining and activism project, People’s Kitchen Collective, that everything changed. “I heard him speak, and I was like, ‘Oh, this guy is actually very smart—and cute,’” she says. From there, the two began dating, opened their restaurant Masala y Maiz in Mexico City in 2017, and got married in 2019.On their dream date, Listman and Keval are all about simple, high-quality food. The menu: “Steak over a fire, in a cast iron, with a lot of salad—perfect tomatoes, beautiful bread, butter, and wine,” Listman says. “That’s actually what we had on one of our first dates,” Keval says. Forgoing the pastries or the ubiquitous V-Day chocolaty treat, they would opt for a cheeseboard, with fresh, seasonal fruit to round out the evening. “We’re not big dessert people,” says Keval, who would prefer “a really perfect peach or nectarine.” Listman agrees: “Topped with chili-lime salt and sugar.”In an ideal world, their date night would take place at a secluded getaway house on the Northern California coast. “We’re in Mexico City right now and it’s great, but I miss that cold breeze—the fog, the chilly dampness, how lush and green it is,” Listman says, imagining herself taking in the Pacific with a martini in hand. “[We’d] live in our own little world” for a night, Keval says. —Antara Sinha, associate cooking editorMarcus NilssonAngie Rito and Scott Tacinelli: Red Sauce Vibes“I always joke that we bonded over caponata,” says Angie Rito about her husband, Scott Tacinelli. “He was talking about caponata, I was talking about my grandpa’s recipe, and we were just comparing notes.” That shared love of Italian food became the foundation for their NYC restaurant, Don Angie, their cookbook, Italian American, and their own family.The couple met just after Rito moved to New York. Tacinelli was fresh out of culinary school, working as a line cook at the same restaurant where Rito happened to be waitressing part-time. “Scott started showing me all these iconic New York restaurants,” Rito remembers, “and that’s how we started hanging out.”While running a restaurant, living, and raising a child together isn’t always easy, Rito and Tacinelli have found a rhythm that works for them. “It takes a lot of patience, flexibility, and trust in the other person,” Tacinelli says. Rito says the arrival of their first son last year put things into perspective. “It got so easy for us to get too caught up in our work life, but he’s really opened our eyes to how important our personal life is too.”Their ideal dinner date, like their restaurant’s food, is magnificently Italian American: Tortellini in brodo and a simple Caesar salad to start, followed by a classic pasta in red sauce with a couple of meatballs (although they’d opt for big bites of paccheri over spaghetti), and a bottle of Lambrusco to wash it down. —Nico Avalle, production assistantPhotograph by Christopher Testani. Food styling by Victoria Granof. Prop styling by Alex Brannian.Elliott Curelop and Harshit Gupta: Something Sentimental“Neither one of us is an all-out romantic,” Elliott Curelop tells me about his relationship with Harshit Gupta, his husband and cofounder of their Austin-based company, Madhu Chocolate. I believe him for about 30 seconds, until the two start talking about their past Valentine’s Day celebrations—namely the one when Gupta surprised Curelop with dinner by some secluded waterfalls. Oh, and the one when they drove eight hours to a brewery in Valentine, Texas, to spend the day together.The couple met online in August 2013. About a year later, they got engaged, moved from Seattle to Austin, got married, and then started Madhu Chocolate in 2018. Bean-to-bar chocolate-making began as a hobby; now, they sell bars nationwide with Indian-inspired flavors like masala peanut, rose pistachio, and Idukki black pepper. And this year, just in time for Valentine’s Day, they’ve introduced a new pistachio-chocolate spread that I have obviously already purchased.This year Curelop is cooking on the big night—something sentimental from their shared past—and Gupta will follow up a few days later. I can’t ask them to ruin this year’s surprise, so Curelop tells me about a past meal: “A restaurant we went to just before I proposed had special compound butters, like red wine butter and saffron butter. So I re-created those. I made a beef Wellington based on our first vacation and a baked Alaska inspired by the very first cruise we took together. It was the heaviest meal in the world, but it was really enjoyable because it was a trip down memory lane.”It’s not all home cooking, though: Gupta says they ended that day in Valentine, Texas, a few years back, eating fast food at a campground hotel. “For us, looking at the stars and eating Dairy Queen, I think it was one of the best meals we’ve had.” —Sonia Chopra, executive editorPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolNick Doherty and Kate Woods: Fish Tacos Alfresco“I remember we were weeding,” says Nick Doherty. Over Zoom, he and Kate Woods are describing their first real conversation: crouched between rows of vegetables while working as field managers at Stone Barns Center for Food & Agriculture in 2017. It wasn’t until 2019 that they started dating, “but that moment was when the seed was planted,” Doherty laughs.Four years later, in March 2021 and with a new border collie pup in tow, Doherty and Woods moved to Martha’s Vineyard, Massachusetts, to comanage Beetlebung Farm—where they grow a biologically diverse range of herbs and vegetables using regenerative agriculture principles. The pair were both drawn to community-based farming and the “beauty of sharing food directly with people,” Woods says. “I think we really bonded over that.”On their ideal at-home date, they’d hang outside on their candlelit porch while listening to Nina Simone radio. With an abundance of thoughtfully raised meat, dairy, and seafood on the island and a lush farm in their backyard, the couple would make the most of what’s around for dinner: fried fish tacos with homegrown radishes, pickled onions, and Napa cabbage, and “some really good yogurt sauces,” Woods says. Alongside, she says, there’d be a simple radicchio salad—“it’s one of our favorite things to grow and Nick is the best salad-dressing-maker ever”—and a bottle of biodynamic Marquette from Vermont-based winery La Garagista. Dessert is honey and lavender gelato made with “awesome raw milk from down the road,” Doherty says.As we’re about to say goodbye, I ask the couple how they set boundaries when work and life happen side by side. “I feel like we're both extremely independent people,” Woods says, “and we like to be outside a lot.” Doherty agrees, adding: “We’re not sick of each other yet, so…” —Ali Francis, associate editorPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiDeborah VanTrece and Lorraine Lane: Prime Rib and R&BWhen it comes to running a restaurant, how do business and life partners Deborah VanTrece and Lorraine Lane of Atlanta’s Twisted Soul Cookhouse & Pours work so well together? “We’re best friends,” they both say. “We laugh a lot,” VanTrece says—and Lane adds, “I stay in my lane.” It’s been a family operation since they opened it in 2014: Lane handles the books and the behind-the-scenes, VanTrece is the creative director and chef, and their daughter is the general manager.Like many in the restaurant industry, Valentine’s Day ends up being more of a work night than a date night, though Lane always makes sure VanTrece has roses. But the romance they can’t share with each other—that night, at least—is what they want to impress upon their guests at Twisted Soul: setting the mood with red light bulbs, red roses, and the soft sounds of smooth jazz or Luther Vandross.Once they’ve gotten a chance to decompress, their own ideal date night could go a few ways. It might be pork neck bones and potatoes or prime rib and sea bass. Or, if they’re really tired, it might just be picking up Waffle House to-go. There are nonnegotiables, of course: cocktails, Champagne, and chocolate-covered strawberries. And ideally, a charcuterie board to share—with blue cheese for VanTrece and smoked Gouda for Lane, plus almonds, olives, really good mustard, and soppressata. Then, add a little jazz or R&B and get the fireplace going.“One of the things I’ll say to her—which is really important to me—is ‘be romantica,’” VanTrece says with a laugh. “It’s what I call it. I think that’s what is important, with even the foods you choose the vibe you’re giving. We all should keep romantica in our relationships.” —Bettina Makalintal, associate print editorExplore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Francis"]}