{"id": "0f9f05389cb0af70ed65e28f78985ad1", "url": "https://www.bonappetit.com/story/my-grandpas-marinated-peppers-always-have-a-place-in-my-fridge", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "My Grandpa’s Marinated Peppers Always Have a Place in My Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Grandpa’s Marinated Peppers Always Have a Place in My FridgeThey’re simple to make, easy to love, and super versatile.By Sahara BohoskeySeptember 23, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailLike so many of us, my love affair with food began when I was just a single-digit child, sitting at the counter of my grandpa’s cozy second-floor restaurant in Tokyo. I look back on that time with such enchantment. Dancing around his tiny kitchen, he taught me the value of simple, quality ingredients and that the true meaning of cooking was not simply to provide nourishment but also entertainment—for your friends, your family, and strangers alike. To this day there is one dish that instantly takes me back to that magical time: his marinated bell peppers, or as he called them, “peperoni.”In this simple dish humble bell peppers are truly transformed. Their skins are charred to a crisp under the broiler the way you would with eggplants for baba ganoush, which in turn makes the flesh succulent, slightly smoky, and extra savory. After all sides of the peppers are charred, they’re left to cool, and during that time they start to release a caramelized pepper juice that is liquid gold—it adds a caramel-like sweetness to the marinade that is *chefs kiss.* Then you get down and dirty with the peppers—there’s something so satisfying about peeling crispy skin off the peppers—and once the flesh is free from skin, you let the peppers marinate in olive oil, fresh chopped garlic, fresh basil and that reserved pepper juice. Because this dish is so simple, you want to use the best ingredients, from good extra-virgin olive oil to the freshest garlic to the most aromatic sweet basil. I highly recommend you use an assortment of yellow, red, and orange bell peppers, which will be the sweetest and most aesthetically appealing.I love snacking on shreds of marinated peppers on their own, but my favorite way to eat “peperoni” is on a fresh slice of baguette with lashings of stinky blue cheese. It’s the perfect combination of funky, salty, and sweet. I always have a jar on hand to add to an appetizer board for last-minute guests; it instantly makes a platter of grocery store cheese highly impressive. But making a batch of these marinated peppers also works as meal prep. Fork a tangle onto grilled chicken sandwiches layered with slices of feta; add some to a grain bowl or leafy green salad for lunch, with the marinade serving as the dressing; chop and use to fancy-up a batch of pasta salad. The possibilities are endless.Marinated Peppers with Basil and GarlicOn a cheese plate, in a sandwich, over scrambled eggs—is there anything that isn't improved by a spoonful of silky marinated peppers? (No.)View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-23", "author": ["Condé Nast", "Sahara Bohoskey"]}