{"id": "0fb4e7696ee418e2116fb3ba8f37f163", "url": "https://www.bonappetit.com/recipe/fish-curry", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Fish Curry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFish CurryBy Meherwan IraniSeptember 20, 20214.6(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis fragrant tomato-and-coconut curry with pieces of flaky white fish is a staple at chef Meherwan Irani’s dinner table. At home, he likes to make double or triple batches of the coconut milk curry (see his recipe for All-Purpose Coconut Curry here) and freeze it in two-cup portions. Then, when he’s ready for dinner, all he has to do is defrost a portion and sear pieces of spiced whitefish that finish cooking in the reheated curry. If you want to prepare this recipe with premade curry, bring 2 cups curry to a gentle simmer in a saucepan over medium-low heat, then add the seared fish to the pan and simmer until the fish is opaque and flakes easily.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonDutch Oven$80 At AmazonFish Spatula$14 At AmazonIngredients4 servingsFish1½lb. firm white fish (such as grouper, tilapia, or cod), cut into 2\" pieces1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. Kashmiri chile powder or ½ tsp. cayenne pepper½tsp. ground turmeric3Tbsp. grapeseed oil or vegetable oilCurry and Assembly3Tbsp. grapeseed oil or vegetable oil1tsp. brown mustard seeds3–4fresh or dried curry leaves (optional)½tsp. asafetida (optional)13\" piece ginger, peeled, finely grated5garlic cloves, finely gratedKosher salt1large red onion, chopped1tsp. ground turmeric114-oz. can crushed tomatoes113.5-oz. can unsweetened coconut milk (not low-fat)1cup low-sodium vegetable or chicken brothThinly sliced red onion, cilantro leaves with tender stems; cooked basmati rice, wild rice, or warm naan; and lime wedges (for serving)PreparationFishStep 1Combine fish, salt, chile powder, and turmeric in a medium bowl and, using your hands, gently toss fish to evenly coat in spices.Step 2Heat oil in a large nonstick skillet over medium-high. Working in batches to avoid crowding, cook fish pieces until lightly browned, about 2 minutes per side (the fish won’t be cooked all the way through). Transfer fish to a plate.Curry and AssemblyStep 3Heat grapeseed oil in a medium Dutch oven or other heavy pot over medium-high. Add a few mustard seeds to pot. When seeds start to wiggle and pop, reduce heat to medium and add curry leaves (if using), asafetida (if using), and remaining mustard seeds. Cover pot and cook spices, swirling, until mustard seeds start popping more gradually, about 30 seconds. Uncover pot and return heat to medium-high. Add ginger and garlic and cook, stirring constantly, until beginning to brown, about 1 minute. Add chopped onion and a big pinch of salt and cook, stirring often and reducing heat if needed to prevent burning, until onion is golden brown and jammy, 7–9 minutes.Step 4Stir in turmeric, then tomatoes and bring to a simmer. Reduce heat to medium and cook, stirring often, until tomatoes are glossy and darkened in color and oil starts to separate around edges of pot, 5–7 minutes.Step 5Add coconut milk and broth and stir to combine; season with salt. Bring curry to a simmer, then reduce heat to medium-low. Cover and cook, stirring occasionally to prevent sticking, 10 minutes.Step 6Add fish to curry. Return to a gentle simmer and cook until fish is just cooked through and flakes easily with a fork, about 4 minutes. Taste and season with more salt if needed.Step 7Divide fish curry among bowls. Top with sliced red onion and cilantro. Serve with rice and lime wedges for squeezing over.Do ahead: Curry can be made 5 days ahead. Let cool, then transfer to anHow would you rate Fish Curry?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleAbsolutely yummy.   Family loved it Suni DHuman Race 1/23/2022As written, this would be about a 3 star dish but with some changes it was delicious. I left out the broth as the sauce was already too thin for my taste (I like my curry to coat the back of the spoon, and this was more like a broth consistency already). I also subbed in 2T of curry powder in place of the leaves; I just couldn’t find any even at Indian grocers, but it didn’t feel like it would be robust enough just leaving thot out. Next time I’ll do the same but allow it to cook down for longer to thicken up. DalOakland, CA11/1/2021This was delicious. I made it a bit more spicy (personal taste) and added carrots and spinach but the base was perfect. Possibly fishsauce instead of salt? Thanks for the recipe, will repeat.RichardArgentina10/31/2021This was amazing. Kind of a Thai Indian fusion. The gentle sweetness of the coconut milk worked perfectly with the savory spices, onions and fish chunks. AnonymousSouthern Maryland10/12/2021My picky partner approves = automatic 5 stars  AnonymousVictoria, BC10/6/2021I’d add some chili or cayenne to the curry, not just the fish. Susan C.Brevard, NC10/3/2021Extremely riffable. I cut down the onions by half, and eyeballed the coconut milk (1 can seemed like a lot - but that's just my preference). I also added chickpeas since I didn't have anywhere near the amount of fish required. End result was delicious - just don't forget the lime and cilantro! AnonymousCanada10/1/2021Delicious, simple, hearty. It came together very quickly. I made it with halibut. Will definitely make again.MegBC9/24/2021Did it with shrimps instead. This is amazing, so good, I've had two bowls. MIAM!LauVDMontréal, Québec9/21/2021Explore Bon AppétitFishSeafoodCurryCoconut MilkOther IngredientsDinnerWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-19", "author": ["Condé Nast", "Meherwan Irani"]}