{"id": "0fd61cfde1215992ad2ecc2e6e5db80b", "url": "https://www.bonappetit.com/story/how-to-temper-eggs", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "How to Temper Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEggs Are Temperamental and Must Be TemperedUnless you want bits of scrambled egg in your ice cream or soup?By Sarah JampelMarch 8, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Anyka BrownFacebookTwitterEmailEggs, for all the gifts they give us (did you know that there are upward of 300 million laying hens in the U.S., as in nearly one for each human?), are, like many performers and politicians, symbols of contradiction. Sometimes they’re hardy and invincible: You can cook them hot and fast with excellent results. But other times they’re sensitive and fragile. They threaten to crack open if a pot of water is too hot. They burst and curdle and weep and stick—point is, eggs need a little TLC. And that’s especially true when it comes to changes in temperature.Let’s say you’re adding raw eggs (or egg yolks) to a pot of hot liquid (or hot pasta). If you pour the eggs straight into the simmering cauldron, they’ll scramble almost immediately. That’s great, and intended, if you’ve set out to make egg drop soup, tomato and egg, or stracciatella. It’s a lot less desirable if you’re looking to harness eggs’ thickening power to achieve a creamy pudding, lemon curd, ice cream base, or carbonara that’s not flecked with cooked egg. In the case of this avgolemono-inspired lemony tortellini soup, the goal is to cook the eggs slowly, rather than all at once, so that they provide body and richness to the broth instead of curdling into discrete bits.“I've got the right temperature to temper you from the storm?”\nTo solve the problem, you have to temper the eggs: Essentially, this means slowly diluting them with a bit of the hot liquid before letting them into the pot to join the party. (Think of it like the eggs are…pregaming? Remember those days?) This gives the eggs a head start in cooking and, as the folks at Cook’s Illustrated explain, makes it harder for their proteins to link up and form bonds (i.e., get scrambled) as they’re heated.Here’s how to temper eggs:Have a whisk and a ladle or measuring cup nearby.Crack your eggs into a bowl or large liquid measuring cup that’s big enough to hold at least a couple of cups of liquid and can accommodate a whisk. If you’re making a custard base, say for ice cream or pudding, you might also be incorporating sugar. Whisk the eggs (or yolks) to homogenize.Stabilize that bowl (if it's large or cumbersome) with a damp towel so that both of your hands are free—you’ll see why in a minute. You can use the towel to form a little nest for your bowl by rolling it into a log, then shaping it into a hollow ring and resting your bowl inside.Once your liquid is hot, use the ladle or measuring cup to slowly dribble it into the eggs, whisking constantly all the while. I like to pour with my non-dominant hand so that I can whisk with my more adept one. (In the case of an egg-based pasta sauce, like carbonara, you'll likely be dribbling some reserved pasta water into the eggs to warm and loosen them.)Touch your egg mixture (like, stick a clean finger in there!). If it’s very warm, you’re good to go. If it’s not, keep adding liquid until it gets there.Now slowly pour that egg mixture back into the pot, still whisking or stirring constantly.Continue to cook, whisking frequently (there’s a lot of whisking involved here) and being sure to scrape the sides and the bottom of the pot, until you’ve reached your desired indicator (in the case of many custards, you’re looking for the mixture to coat the back of a spoon) or temperature.In some (fussy) instances for soups and custards, recipes will have you strain the mixture through a fine-mesh sieve to ensure that not even one singular lump can sneak by. But for this soup there’s enough going on—tortellini, spinach, dill, parm—that one teeny curd of egg isn’t going to be a bother. A whole pot of scrambled eggs, though? Well, then it’s a different dish entirely.Soup's on!Lemony Tortellini Soup with Spinach and DillSilky and comforting yet light and spring-y, this tortellini and spinach soup is the perfect winter-to-spring meal.View RecipeExplore Bon AppétitEggRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-08", "author": ["Condé Nast", "Sarah Jampel"]}