{"id": "0fd9234f8bb7ae8493f79048e6d216cb", "url": "https://www.bonappetit.com/story/simple-spells-from-nonnas-kitchen", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Kitchen Witchery and Simple Spells From Two Italian Grandmothers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKitchen Witchery and Simple Spells From My Italian GrandmothersBlood-spiked espresso love potions, and plenty of ways to fight the evil eye.By Carla CicconeOctober 31, 2018FacebookTwitterEmailIllustration by Sophy HollingtonFacebookTwitterEmailPicture it: Toronto, 1985. My stubby toddler legs hang down from the kitchen counter, feet kicking against the cabinets. I suck on a circular taralle breadstick like it’s a salty anise flavored pacifier. From my front row seat, I watch flecks of salt fly through the air, tossed backwards from grandmother Genoveffa’s hands into the sink as she sings an Italian folk song. Salt gets all over the counter too, and I’m puzzled because this woman would never make a mess on purpose. She gives me a wink, wipes her hands on her apron and goes back to the stove.I’d eventually learn, watching both of my grandmothers do it again and again, that she was reversing some bad luck she’d accrued. As I grew up, I witnessed a lot of superstitious habits go down in the kitchens of my two nonne, who sought to welcome good luck in, and escort bad luck out.They’d never call it witchcraft, but it certainly seemed like magic to me. My nonna Genny came to Canada from Pescara, Abruzzo, by boat when she was 17 to meet a man 13 years her senior who she’d just married by proxy. Her life was not easy, but she was known to conjure up sumptuous feasts that were as much magic spells as they were meals. My other nonna, Fenia, now 95, boarded a different boat to Canada with her two small children in the ’50s. With an extensive knowledge of the garden, she’s healed me of many a stomach ache, headache, and sore throat with her herb-infused teas and soups.But it was the gestures my nonne made in their kitchens—crushing eggshells into their palms to avoid bad luck, blessing loaves of bread by etching tiny crosses into the dough—that made their magic alive and real to me. And like all magic, their kitchen witchery only works if you believe it does. \n Water and OilItalians believe you can catch malocchio, the “evil eye,” from anyone, anytime, anywhere. All it takes is a glance or an innocuous compliment (“omg your hair is so shiny”) to bestow bad vibes onto your person. Symptoms include: fogginess, headaches, migraine, fever, stomach pain, dizziness, bad luck, financial ruin, serious illness, and, for the most unfortunate among us, straight up death.Nonna Genny could detect the malocchio as soon as a cursed soul walked into her house. She’d grab a white bowl and fill it with water, and then slowly drip olive oil into it. If the oil gathered into globs as you’d expect, you hadn’t been cursed. But if the oil scattered around the bowl frantically, girl, that’s the eye. To cure the bad vibes, she would chant while opening and closing scissors above the bowl. Then, she’d drop olive oil into a clean bowl of water, and if the oil stuck together, the evil eye was gone. \n Illustration by Sophy HollingtonPepperonciniIf you’ve ever watched The Sopranos, you probably noticed jewelry in the shape of a horn glinting against the hairy chests of the cast. Horns—originally symbols of the Egyptian mother goddess Hathor, an ancient precursor to goddesses Isis and Venus—are decidedly lucky and good at keeping the evil eye away. Women traditionally don’t wear horns, but they do string up fresh red peppers (Nonna Genny used corno di capra, “goat horn,” from her garden), which look just like them. Once dried, the peppers could be left in the kitchen for protection, put in pockets or purses as guardian talismans, or, my personal favorite, fried in olive oil then crushed atop pastas, eggs, soups, bread, or anything savory for the tastiest mouth blessings. \n Illustration by Sophy HollingtonGarlicKnown the world over for warding off vampires, garlic, like pepperoncini, is also used for protection from evil spirits, curses, and the common cold. (It’s said to be the physical manifestation of Saint Michael the Archangel, patron saint of warriors, and stronger than a Pope-blessed crucifix for his devil-warding abilities). When I’d go to sleep with a cold as a child, I’d always wake to a pungent smell and a halo of garlic slices on my pillow. My dad, using a trick he learned from nonna Fanny, would place them there while I was sleeping. It’s anyone’s guess if my colds actually improved, but the practice certainly kept the boys away. \n Illustration by Sophy HollingtonEspressoOf all the things I learned about in Italian kitchens, nothing quite compares to the espresso and blood love spell. My nonna Fanny and aunts still delight in telling me about it, mostly to watch my eyes bulge and my mouth hang open. The ritual goes like this: A woman lusting for a man secretly drops a dollop of her own fresh period blood into her beloved’s espresso. After shooting it back, the guy will acquire a manic, obsessive passion for her and fall madly (read: insanely) in love. This spell doesn’t always work out for the couple in the long run, but I’ve heard that more than a few unions began that way. (Of course, my nonne would never...) \n Illustration by Sophy HollingtonSaltThe nonnas knew when and how to get salty. When an unpleasant guest would leave their homes, they’d throw salt around the kitchen and sweep it out the back door, ushering those bad vibes to exit, too. But it’s not only used as a purifier. My nonnas always threw a little sacred salt over their shoulders after salting pasta water, a simmering dish, or any time they had it in hand really. When it comes to cultivating good luck, any Italian kitchen witch will agree, you can’t overdo it.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Carla Ciccone"]}