{"id": "0fe1816f89e3ebd5558b517c9e61054d", "url": "https://www.bonappetit.com/story/silver-palate-light-apps-for-dinner", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "The Silver Palate Cookbook Taught Us Dinner Can Consist of Various Light Apps | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Silver Palate Cookbook Taught Us Dinner Can Consist of Various Light AppsWe had big plans for Cookbook Club. Then life got in the way.By Emily SchultzFebruary 13, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailLast week, we pulled out our favorite vintage dishware, stuffed mushrooms, and celebrated our sixth BA Cookbook Club with The Silver Palate Cookbook. But, if we’re being honest, the evening didn’t go exactly as planned. You know those weeks when the entire office has the twitchy-eyed look? The coffee pot is getting refilled three to four times a day? All you hear is how much everyone has on their plate? Yeah, that was the BA office last week. We even had a meeting about time management.So the Chicken Marbella and the multicomponent salads and the green lasagna that people had signed up to make three weeks before quickly turned into aioli platters, cheese, and a bottle of chilled red wine. Several points in the day features editor Meryl Rothstein and deputy editor Julia Kramer sent me Slack DMs anticipating hungry distress: “But do you think I should just order some pizza to be safe?” At the end of the day no pizza was ordered, and we fed ourselves on a variety of quick appetizers, natural wine, and coffee cake, of course. And it was awesome. We didn’t even miss the more ambitious dishes we’d initially planned for. Here were a few of our favorites things we ate.Photo by Emma FishmanBrie Pinwheel“As the features editor, I was closing the April issue, working on a May story with Andy Baraghani that involved him going overseas, oh, and basically still cleaning up from the Super Bowl party I hosted a few days before. Making the Brie pinwheel wasn’t so much cooking as decorating—I literally sliced off the top of the cheese, then pressed in toppings in a wedge shape (use parchment to get clean lines). It was silly and fun, and took about as much effort as I felt like putting in that week.” —Meryl Rothstein, features editorPhoto by Emma FishmanMinty Cucumber Salad“I confess: I totally phoned it in for this one. It was three days before Cookbook Club and I still had zero idea of what I was going to make. So I scanned the book for the easiest, I-really-don’t-have-the-time-but-I-don’t-want-to-bail-either dish I could find. When I landed on this cold salad of cucumbers, chopped herbs, and orange zest, I knew it was the one for me. It helped that it called for at least four hours of chilling time, which meant I could throw it together the morning of, and totally forget about it til Club time.” —Sasha Levine, senior editorPhoto by Emma FishmanAioli Platter“My birthday was the day before Cookbook Club, so making chicken marbella for my coworkers just wasn’t going to happen. At around 3:55 p.m. on the day of, I quickly perused the front section of the book to find something easy and impressive to make. The only thing I actually had to make was aioli, and of course wash and cut the prettiest veggies I could find. As it turns out, aioli should never have 8-10 cloves of garlic in it. But that's what the recipe called for, so that's what I made. Luckily, senior associate food editor Molly Baz stepped in (with a jar of mayo) and helped save my bad-breath-inducing dip into something a little more manageable. Strong recommend on dunking a 9-minute egg in it.” —Rachel Karten, senior social media managerPhoto by Emma FishmanPhyllo Triangles (three ways)“Raise your hand if you’d never worked with phyllo dough before and then discovered it’s a lot harder to deal with than you once thought! You can’t see because I’m sitting behind my computer, but that’s me frantically waving my hands. I initially chose this recipe because it sounded easy (put mixture into phyllo and bake!) but my phyllo was dry so it kept sticking to itself and took approximately 2 more hours then I had planned for. I haphazardly prepped it in the Test Kitchen and shooed Claire Saffitz away at one point because the phyllo would not cooperate. (Sorry Claire!) Not all of my phyllo triangles came out in identifiable shapes, but sometimes life is about the imperfections. I made all three versions, which included a ricotta and prosciutto, spinach and feta, and roquefort (I subbed blue cheese because my local grocery store didn’t have roquefort) and pistachio. My favorites were the proscuitto and the classic spinach and feta, which is something my parents would always make for their adult cocktail parties when I was younger.” —Emily Schultz, social media managerThe ’shrooms (those round, brown blobs) were less-than-photogenic on their own, so here’s us instead!\nPhoto by Emma FishmanStuffed Mushrooms with Walnuts and Cheese“I think stuffed mushrooms appealed to me because they fall in the category of ‘fancy canapés I only got to see on Food Network, like bruschetta and mini blinis with caviar, but never actually had an excuse to make because my parents never invited anyone over as a house rule.’\nWhat's funny is the filling is actually like...super dope. You basically caramelize some chopped onions until they become jammy and browned, and then you add garlic, frozen spinach, chopped walnuts, crumbled feta, and fresh dill. I had some filling leftover that I put in an omelet over the weekend that was l i t t t.”  —Christina Chaey, associate editorRead why we chose The Silver Palate as our February Cookbook Club pick:The Silver Palate Cookbook Is Our February Cookbook Club PickNearly 40 years later, and this classic tome is still the first place we look for comfort.View StoryBuy It: The Silver Palate Cookbook, $25 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubRead MorecultureThe Silver Palate Cookbook Is Our February Cookbook Club PickBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-13", "author": ["Condé Nast", "Emily Schultz"]}