{"id": "0ff1b21c59154b52fca74be1a924a2cc", "url": "https://www.bonappetit.com/story/i-love-soy-milk", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "I Love Soy Milk, and No, I Don't Want to Try That Other Milk Instead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Love Soy Milk, and No, I Don't Want to Try That Other Milk InsteadHemp should only be for making necklaces. Oats? I don’t want a balanced breakfast in my coffee mug.By Ryan SmithJune 26, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailA few years ago, on a sunny Los Angeles morning, my life changed forever—or at least, my familiar morning routine did. I was at Sqirl in East Hollywood having breakfast (read: admiring all the beautiful people) and I asked for soy milk with my coffee. “We have almond milk!” the waif-like Angeleno server chirped back. I froze. “I’ll, uh, take it…. black.”Over the course of the week, I found that I was in a soy milk no-man’s land. Every café in town had converted to almond milk. Over time, the affliction spread. Hip cafes in towns like Scottsdale and New Orleans had ditched my precious soy in favor of hemp or oat milk, as if they could differentiate themselves by the alternatives they offered. Even my local spot in the East Village had moved on to almond and oat. I was really starting to appreciate drinking my coffee black, the way I should have been drinking it all along, I’m sure.Over the past few years, various health concerns have spooked many long-time soy drinkers into seeking out something healthier. “Excess amounts of soy mimics estrogen production which causes estrogen levels to rise, which can feed into prostate cancer and breast cancer,” explains Monika Arenas, a Miami-based nutritionist and “grocery guru” for the Carillon Wellness Resort in Miami Beach. “Everyone is looking for other alternatives that aren’t going to mimic the body’s natural activity.”Recently I've watched as even almond milk is phased out in favor of alternatives. Walking down the aisle of dairy-free “milks” at Whole Foods is exhausting. Rice, hemp, flax, cashew: It feels like every month, we’re on to the next new milk trend.But is it so wrong to keep wanting to drink soy? Here's what I know: It makes my amazing coffee taste even better. Almond could never compete—it made my coffee taste like cardboard, plus, Arenas warns, it takes excessive amounts of water to produce just one gallon of the stuff. Hemp should only be for making necklaces. Oats? I don’t want a balanced breakfast in my coffee mug. My day just isn’t right if I don’t start out with a bit of soy creamer—basically the soy version of half and half—in my cup.My solution? I’ve started packing little 3 oz. bottles of soy with me wherever I go. I am, however, willing to give one alternative a shot. Arenas recommends a homemade creamer made with unsweetened coconut milk, coconut oil, coconut sugar, and a touch of vanilla and cinnamon. For me, the coconut milk is the closest texturally to soy, and it’s just sweet enough. So call me a coconut convert for now, but I’ll always have a travel bottle of soy stashed in my bag—just in case.Explore Bon AppétitHealthyishDairy-FreeMilkSoyTrendsRead MoreLifestyle4 Non-Dairy Milks We Love Besides AlmondBy Ashley MasonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Ryan Smith"]}