{"id": "0ffe9c48df27eee68ccc3765f5b8dd57", "url": "https://www.bonappetit.com/story/buy-tinned-smoked-fish-online", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Buy Smoked Fish and Tinned Fish Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhere To Buy Tinned and Cured Fish OnlineIf you think you hate canned tuna, you haven’t had the right canned tuna.By MacKenzie Chung FeganMay 21, 2020FacebookTwitterEmailFacebookTwitterEmailIt’s no secret that we love tinned fish here at Bon Appétit. Writing an 800-word love poem to your favorite smoked trout, canned tuna, or luxury anchovies is a rite of passage for our editors, a ritual that concludes with Test Kitchen manager Gaby Melian bestowing a key to the secret conservas closet on the fortunate inductee. (I await my invitation, Gaby!)If you're not yet among the converted, now, with trips to the fish counter limited, is the time to embrace these shelf-stable small bois. Not only are they delicious, but also they're packed with omega-3s and good-for-you vitamins and minerals. Plus, as far as seafood goes, anchovies, sardines, mackerel, and other little fellas are among the most sustainable options. If tinned fish really aren't your thing, we've thrown in a couple of our favorite smoked fish options too; they won't last forever, but they'll keep in your fridge longer than the fresh stuff.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.ProducersDonostia FoodsThis importer of Spanish specialty foods has a robust selection of conservas, including staff writer Alex Beggs’ favorite ‘chovies. Their product page reads like a bottle of Dr. Bronner’s: “Animosity toward anchovies is endemic, thanks to the prevalence of poor quality examples cursing supermarket shelves. THESE ANCHOVIES ARE THE ANTIDOTE.” Free shipping on orders over $65.Mercado Little Spain / José AndrésWhen José Andrés’ name pops up in the news these days, it’s usually because his non-profit organization, World Central Kitchen, is feeding the hungry in the wake of disasters, from Hurricane Maria to COVID. It would be easy to forget that he’s also a chef who very much knows his seafood.Patagonia ProvisionsYes, that Patagonia. Eat their Savory Sofrito Mussels while wearing your most normcore fleece and astral project yourself to the Galician coast. Free shipping on orders over $49.Drifters FishUnless you live in Western Washington, you won’t be able to sign up for this Alaska salmon CSF (community supported fishery), a favorite of It’s Alive! host Brad Leone. But you can still stock up on their smoked and tinned sockeye, which we highly recommend you do.Catsmo Artisan SmokehouseThere may not be a lot of wild salmon spawning in the rivers of the Catskill Mountains, but they’re still home to a salmon smokehouse that we can get behind.Wild PlanetSustainably caught tuna, salmon, sardines, yellowtail, mackerel, and anchovies. A grocery store option you can feel good about, Wild Planet placed first in Greenpeace’s ranking of canned tuna brands. Free shipping within the continental U.S.Ekone OystersIn 1982, an oyster farmer Nick Jambor built his wife a smokehouse for her birthday. Their marriage survived, and Ekone smoked oysters were born. These sturdy beauties come in punchy brines like teriyaki and habañero and are sustainably raised in Willapa Bay, Washington.Russ & DaughtersThe incomparable Russ & Daughters—the first business in the United States to have “& Daughters” in its name—has primo smoked salmon, sable, and whitefish for all your appetizing needs.Purveyorshaley.henryWe may not be able to sip on a funky pét-nat at Boston’s haley.henry right now, but a few tins of their Da Morgada mackerel and a bottle from our local wine shop is the next best thing.Preserved StatesAssociate editor Christina Chaey tore through her supply of El Capricho tuna sometime during month one of quasi-quarantine. See what all the fuss is about.La TiendaSpain does tinned fish better than anyone (except maybe Portugal, I’m not here to start fights), and La Tienda has been importing Spanish delicacies to the U.S. since 1996.Wixter MarketChicago’s Wixter Market carries two of Alex Beggs’ favorite brands—José Gourmet and La Brújula—and offers free shipping on orders over $99.Formaggio KitchenHard to decide who is more of a style icon—the Arroyabe fisherman or the mutton chopped gentleman on the Tenorio tins. Boston’s Formaggio Kitchen stocks ‘em both.Parker’sParker’s stocks smoked kipper and haddock filets for homesick Brits. Make kedgeree!Caputo’sChristina Chaey loves this Salt Lake City specialty grocer, and with their excellent selection of tinned fish from Spain, Portugal, France, Italy, and the U.S. can you blame her?Zingerman’sIf you’ve made it this far, the Frequent Fish Club might be for you. Sign up for three or six months of “most glorious seafood you can find in a tin, jar, or bottle” selected by the food fanatics at Zingerman’s, the J. Peterman of gourmet groceries.Ben To TableNot sure where to start your tinned fish journey? Buy a starter bundle and find some new faves.MyPanierYou’ll find more of an emphasis on French brands here, including Roque anchovies and many offerings from Brittany’s Les Mouettes d'Arvor.You want the fresh stuff? Buy fish online right here!Here’s a short-list of where to order meat onlineAll your favorite pantry staples right this way...Explore Bon AppétitShoppingCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}