{"id": "101a77a94457e3cb8eb1144e95a05721", "url": "https://www.bonappetit.com/story/what-is-fish-sauce", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Wait, What Is Fish Sauce, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWait, What Is Fish Sauce, Anyway?That sweet, salty, funky, fishy umami bomb takes dinner from 0-100 real quick.By Alex DelanyMarch 13, 2018FacebookTwitterEmailPhoto by Zach DeSartFacebookTwitterEmailFew ingredients bring as much immediate, show-stopping flavor to a dish as fish sauce does. It's sweet, salty, fishy, and funky all at once, a prismatic tsunami of flavor. But...what is fish sauce? We've all had it at some point or another whether we knew it or not—pad thai, anyone?—but that doesn't mean we know what's in it.Well...fish, actually. Fish sauce lives up to the name. It does, as advertised, derive most of its flavor from fish, but you don't just smack a fish around and out plops a bottle of fish sauce. The real flavor comes from the process of fermenting fish for anywhere from a couple months to a few years. Small fish like anchovies are coated in salt and packed in large barrels to hang out. The natural bacterias start to break down the fish, producing a briny, fishy, savory liquid. That, friends, is fish sauce.Fermentation has been used for thousands of years to develop flavor in anything from fish to meat to beans to vegetables. Many cultures use or have used a fermented fish sauce, from the Greeks to the Chinese, but we most commonly associate it with Southeast Asian cooking. It provides one of the driving flavors in dishes like larb, Vietnamese marinated meats, green papaya salad, and stir-fries, as well as pad thai.We love the flavor of fish sauce for its umami, the earthy, savory flavor field that makes things like mushrooms, roasted tomatoes, and soy sauce taste so complex and crave-able. There’s a distinct, pungent fishiness to the sauce, sure, but that flavor is flanked by a salty, briny, caramel-y sweetness. It’s an ingredient that gives you a little bit of everything when thrown into marinades, stir-fries, and salad dressings, and it's just as useful in non-Asian cooking too. A little fish sauce can boost salty, savory flavor in sautéed greens, pastas, roast chicken, or broths. Generally speaking, we're down to experiment with a dash of fish sauce whenever we would otherwise add salt. It’s aggressively flavorful though, so be sure to add just a bit at a time and taste as you go. A little goes a long way.Ground chicken larb loves a lil' fish sauce.\nLinda XiaoWhen it comes to buying fish sauce, there are hundreds of varieties out there, and if you head to an Asian market you’ll be able to find more regionally-specific brands and variations. But if we had to choose one brand that’s an all-around winner in terms of availability and flavor, we’d go with Red Boat every time. It's made in Vietnam, using only anchovies and salt, and while it's a bit pricier than other brands we think the flavor is worth it—it's incredibly fresh and well-balanced tasting thanks to a slower fermentation process. We wouldn't go so far as to say that we'd drink the stuff but...it's very good.Like most things, fish sauce takes a minute to get to know, and once you know what fish sauce is you're ready to get that relationship going. Hang out with it. Invite it to dinner. Experiment with different proteins and vegetables. And crack a beer while you’re at it. Your fish sauce friendship is blossoming. What a beautiful time to be alive.Buy It Here: Red Boat Fish Sauce, $13 on AmazonFish Sauce: yes. Pad thai: also yes.Weeknight Pad ThaiBecause your takeout habit is getting to be a bit much, tbh.View RecipeExplore Bon AppétitBasicallyFish SauceVietnameseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Alex Delany"]}