{"id": "101d6f93fffe436f5669339f4b52393d", "url": "https://www.bonappetit.com/recipe/ramp-fritters", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Ramp Fritters Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueRamp FrittersBy Claire SaffitzApril 17, 20184.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThese crispy little fritters taste like a three-way cross between onion tempura, blooming onion, and onion rings. If you can’t find ramps, use thin scallions.IngredientsMakes about 2010oz. ramps1cup all-purpose flour¾cup rice flour1tsp. baking powder1tsp. sugar1tsp. kosher salt¾cup club soda¾cup light beerVegetable oil (for frying; about 6 cups)Lemon wedges (for serving)Special EquipmentA deep-fry thermometerPreparationStep 1Remove any slippery outer layers from ramp bulbs, trim roots, then soak in a bowl of cold water, swishing around gently to loosen any dirt.Joe WilsonStep 2Lift out ramps and blot dry with paper towels. Avoid cramming them in a salad spinner so as not to damage the delicate leaves.Joe WilsonStep 3Cut ramps into 1\" pieces ( you should get about 5 cups). Whisk all-purpose flour, rice flour, baking powder, sugar, and salt in a large bowl to combine. Make a well in the center and pour in club soda and beer; whisk until smooth. Fold in ramps.Step 4Pour oil into a large cast-iron skillet fitted with thermometer to come 1\" up sides and heat over medium-high until thermometer registers 350°. Working in batches, place ¼-cup mounds of batter into skillet and press down lightly to flatten and submerge. Fry, turning once, until fritters are golden brown, about 4 minutes. Transfer to paper towels to drain; sprinkle with salt. Serve with lemon wedges for squeezing over.How would you rate Ramp Fritters?Leave a ReviewTell us what you thinkExplore Bon AppétitFritterRampsOnionVegetableRice FlourFlourSpringQuickEasyStarterSideDairy-FreeNut-FreeVeganVegetarianDeep-fryRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Claire Saffitz"]}