{"id": "1022bf97c0b9ddbce30e950c2b287185", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/st-lawrence", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "St. Lawrence Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverSt. LawrenceTake a “trip” to Quebec via Vancouver’s Downtown EastsideFacebookPinterestTwitterEmailChris Giannakos GO HERE: for rich, rustic French-Canadian fare from chef and co-owner (and native Quebecois) J-C Poirier. Do not make plans after St. Lawrence, because in true Quebecois fashion, his butter- and foie gras–laden food is guaranteed to put you to bed.ORDER THE: oreilles de Crisse (unless you’re vegetarian!). These crispy fried pork rinds with maple syrup and black pepper are the only way to begin (or perhaps end?) your meal. Go big with the Paris-Brest stuffed with duck liver and foie gras mousse and the tourtière, a French-Canadian meat pie which arrives triumphantly garnished with a tiny Montreal Canadiens flag.THE VIBE IS: cozy, filled with everyone from tattooed hipsters to your parents’ cool friends who really know their wine. The restaurant’s small French-speaking staff includes some of the best servers, bartenders, and sommeliers in the city, so you’re sure to feel at home—or at least home in Quebec.PRACTICAL STUFF: Open Tuesday to Sunday, from 5:30 p.m. to 10:30 p.m. Closed Monday. Book ahead since tables fill up quickly.—Lindsay AndersonChris GiannakosChris GiannakosWE ALSO LOVECafé MedinaThe city’s downtown brunch institutionThe Pie ShoppeEast Vancouver’s beloved, scrappy, and downright delicious bakeryChambarCivilized debauchery for breakfast, lunch, and dinner in CrosstownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}