{"id": "1028f91831ab25735191d00cf905ba2d", "url": "https://www.bonappetit.com/story/ba-coronavirus-response", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "An Update On What BA Is Doing, From Our Editor in Chief | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureAn Update On What BA Is Doing, From Our Editor in ChiefWe’re here for you, and with you.By Adam RapoportMarch 19, 2020FacebookTwitterEmailPhoto by Chris MoroccoFacebookTwitterEmailEvery week, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he’s been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If you’ve ever wondered how a magazine (and a website and podcast and a video channel) gets made, now’s probably not the time to ask. In the coming weeks, everything we do at Bon Appétit is going to get turned on its head. Yes, I’m a bit nervous about it all. But I’m also optimistic.In response to the coronavirus, we are going to evolve as a brand, and provide our readers and users with the service and content they need—all while grappling with a compromised, remote working environment.We are going to rethink our jobs, while appreciating the fact that we have them. And we’re going to approach our work days as creatively and enthusiastically as we tackle our tasks every other month of the year.To begin, I’ll answer the question that so many of you on Twitter and Reddit have fretted about—yes the BA YouTube channel will carry on. We have a month’s worth of videos, already shot in the BA Kitchen, in the pipeline. They just need editing. But we will also lean into the reality that we all face—holed up in our homes, cooking every single day. Our test kitchen editors—Andy, Sohla, Molly, Chris, et al—have all been provided with tripods and mics to shoot DIY cooking videos on their iPhones. That means you’ll not only get to check out their home kitchens, but also meet some pets, and perhaps a toddler or spouse or two. Your guess is as good as mine. All I know is that I’m looking forward to their trademark humor and cooking acumen, just in a different setting.Want this letter before it hits the website? Sign up for our newsletter!Photo by Chris MoroccoAt bonappetit.com, we’ll do our best to chronicle the tremendous challenges facing the restaurant industry, but we’ll also continue to provide the timely cooking and recipe advice you need now more than ever. And if the images look slightly different, well, that’s because our editors are shooting their own new recipe creations by themselves. Not that I’m looking to put any professional photographers out of a job, but I think you might be surprised at just how skilled they are with a camera phone. (The three images in this article were shot by Chris Morocco, who always makes a point of searching out the best possible natural light before taking his shot.)Our podcast will carry on, still turning out segments that we recorded this past month in our studio on the 24th floor of the World Trade Center. But we’ll also introduce (perhaps less pristine-sounding) segments where I Zoom with my fellow work-from-home editors to see how they’re holding up and what they’re cooking.Photo by Chris MoroccoAnd, yes, we’ll keep making a magazine, as long as our partners in the printing plant and distribution centers are able to do their jobs. We’re currently shipping our May issue. Our entire June/July Grilling Issue is already shot and written. And our August Simple Summer Cooking Issue was, actually, photographed last August. Because if you want beautiful peak season produce, you need to shoot it during peak season.Oh, and on all of our platforms, we will point to and promote the food- and restaurant-related charities that can most use our help in these troubled times.And, finally, as always, we want to hear from you. What kind of content do you want more of? What can we do better? Talk to us. We all need the company right now.Explore Bon AppétitAdam NewsletterCoronavirusRead MorecultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffcultureWhere to Buy Great Coffee OnlineBy Alex DelanyCoronavirusHow to Support Restaurants and Their Workers Right NowBy MacKenzie Chung Fegancooking3 Things to Make You Feel Better About Cooking at HomeBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Adam Rapoport"]}