{"id": "102b47a1f232e170a6697303db4e7674", "url": "https://www.bonappetit.com/story/kamenoko-tawashi-scrubber", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "The Kamenoko Tawashi Scrubbing Brush Makes Washing Dishes a Total Joy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Japanese Scrubbing Brush Makes Washing Dishes a Total JoyFrom someone who truly hates doing the dishes.By Christina ChaeyApril 23, 2018FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Replacing the kitchen sponge when it gets gross and crusted over with bits of old food is a stupidly simple task, and yet I somehow always convince myself I “don’t have time” to do it. It’s the same logic I invoke to ignore similarly mundane tasks like cleaning the sink (ha) or flossing (double-ha). I tell myself this even though I keep a 10-pack of replacement sponges in the cabinet directly under the sink at all times. What ends up happening is I will use the same sponge for weeks at a time (ew) until enough large soggy pieces have flaked off, and I feel terrible about myself and all my choices the whole time.After getting my hands on a Kamenoko Tawashi scrubber, I’d be cool if a gross sponge never crossed my kitchen again. This Japanese brush is more or less exactly the same as when it was first introduced to Japanese households more than 100 years ago. It’s made of durable, waterproof palm fibers that are way tougher than the rough side of a kitchen sponge, but gentle enough that you don’t have to worry about it scratching up your Dutch oven. The tiny metal loop at the top can be used to hang it from a hook when not in use. Seven dollars will buy you the first and last one you’ll ever need.I use the small, 4.5\" version because I like the way it fits in my hand. Hardened mac-and-cheese bits, burnt crusties, gloppy oatmeal bits, scrambled egg dregs, grease—they’re all no match for the Kamenoko Tawashi. The stiff bristles are also great for scrubbing vegetables like carrots and radishes. And on top of all that, it’s shaped like a little turtle! (“Kame” means turtle in Japanese.) Though I will always love the Ringer, these days I find myself reaching for the Kamenoko whenever I wash my cast iron skillet. Any crusty bits that get caught in the scrubber's bristles easily dislodge under running water, so no need to worry about it getting gross over time.In fact, the only things I wouldn’t use this scrubber on are fine crystal and china, and I own neither, so we’re all good here. I’m contemplating buying a few more little turtles to keep around for non-cooking tasks like scrubbing my bathtub, kitchen sink, or white sneakers. And I can only hope the body brush version is as effective at sloughing off my winter layer as the original scrubber is at getting hardened cheese bits off my dinner plates.Hey, I'm not promising that doing the dishes is going to become your new favorite hobby; on a fundamental level, washing dishes...sucks. But if you have the power to make it suck just a little less (read: $7 in your bank account), well, it’s time to toss that grody kitchen sponge.Photo by Ted \\+ Chelsea CavanaughKamenoko Tawashi Scrub Brush$7 at Amazon$9 at East ForkWhen you’re in a cleaning mood:Explore Bon AppétitCleaningShoppingToolsRead MoretechniquesAll Cast Iron Pan Obsessives Need This Scrubber ImmediatelyBy Christina ChaeycultureCast-Iron Skillets: How to Season, Clean, and Cook with Them FOREVERGallery7 SlidesBy Christina ChaeytechniquesIf You Hate Washing Dishes, These Are the Gloves for YouBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Christina Chaey"]}