{"id": "103a2786b62938e03fa5aed84e14aa83", "url": "https://www.bonappetit.com/story/daily-provisions-crullers", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Daily Provisions' Crullers Are the Embodiment of the New York Dream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Live the New York Dream Every Time I Eat One of These Daily Provisions CrullersA glossy, glazy, sugar high–inducing reminder that sometimes, fantasies of Big Apple living are real.By Jesse SparksMay 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I first moved to New York, it was the beginning of summer, I worked a dream internship that actually paid money, and I had my own place near Union Square. I had officially become a living, breathing Hollywood trope (think Enchanted meets Insecure), and was absolutely thrilled about it. In my mind, I was constantly dancing down the city streets, singing a tune about how Dreams Really Do Come True™. Life was sweet, and about as perfect as the crullers from Daily Provisions that I’d treat myself to every weekend.The Danny Meyer–helmed café, located just a few blocks away from that first apartment, also doles out shots of espresso, loaves of rye, and chicken milanese, but the real sell is their cruller: a doughnut with a crispy-crunchy shell of spiraling ridges and an impossibly golden, buttery, moist (sorry) middle. And that’s just the original. Other variations on the classic are showered in cinnamon sugar, drizzled with a deep mahogany-hued maple glaze, or, like my favorite that summer, a deep pink strawberry shell. I made it my habit to pair one with a cup of coffee and get to know the city in a sugar-induced high.A lot has changed since that first summer. I’ve moved several times. I’ve transitioned into new jobs. And...I’ve even gotten a bit more cynical about New York too. But when I need a reminder of what’s good in this city, I know I can always return to that cruller. If not everything can be sublime all the time, at least I know those doughnuts will be.Go there: Daily ProvisionsExplore Bon AppétitHighly RecommendRestaurantsNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Jesse Sparks"]}