{"id": "10470e5ae1d8beabd459b9d737a041d9", "url": "https://www.bonappetit.com/story/pecan-milk-coop", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Not Just Another Nut Milk: How One Brand’s Business Model Is Tackling Wealth Inequality | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNot Just Another Nut Milk: How One Brand Is Tackling Wealth InequalityPecan Milk Co-op’s rich and creamy alt milks have gained a loyal following in Atlanta. But founder Nijil Jones has a bigger goal: putting power back in the hands of economically marginalized queer Black people.By Nikishka IyengarOctober 8, 2021FacebookTwitterEmailNijil Jones (back row, second from left) and the Pecan Milk Co-op teamPhoto by Nelda MaysFacebookTwitterEmailNijil Jones still remembers the first time they discovered pecan milk. It was 2013, and they had just dropped out of Georgia State University. As a result, they were kicked out of their college housing, and living temporarily in a friend’s basement when they took a job as a barista to get back on their feet. The low wage job, coupled with a recent transition to veganism, meant a lot of experimenting in the kitchen to find recipes that were filling and nutritious on the cheap. Potato sandwiches, pancakes made with just flour and water, and lentil burgers became trusted staples, with homemade nut milks as an occasional treat to break up the monotony.“The first time I made almond milk, it just tasted so much better than any almond milk I had ever bought at the store,” Jones recalls. They also noticed that it kept them feeling full a lot longer than store-bought versions since the thick hand-strained milk contained no extraneous emulsifiers—just a generous serving of high-calorie nuts, water, and a pinch of sea salt.Since Georgia boasts the highest pecan production in the country, pecans were a natural next on Jones’s list of nut milk experiments. And they came with an unexpected side benefit: “Pecan milk is a darker color than almond milk,” says Jones with a laugh. “It looked more like me, like my people. A little dark-skinned, you know?”Friends told Jones it tasted like butter pecan ice cream. After a quick survey of the different options at the grocery store, Jones realized there was a market need for a more nutrient-dense, additive-free milk alternative, that “actually tastes fucking good.” From there Jones filed incorporation papers and Pecan Milk Co-op was officially in business. Its signature milk, which is sweetened with dates instead of sugar or stevia, quickly became a hit at local farmers markets and received rave reviews from customers new to pecan milk. The creamy beverage tastes indulgent yet totally unpretentious—much like the brand itself.Instagram contentThis content can also be viewed on the site it originates from.Even back in 2013, before the pandemic revealed the most insidious impacts of capitalism, Jones knew an alternative business model was as important as an alternative milk product. Pecan Milk’s mission soon crystallized around putting power back in the hands of economically marginalized queer Black people in Atlanta. “With us being Black-owned, and it being the South, we do have to think about chattel slavery,” Jones says. “We're still really, really needing to build institutions that have dignified workplaces for us.”Worker-owned cooperatives—where every worker, not just management and shareholders, can own an equal stake in the company and gets to fully benefit from the company’s growth—are entering the anti-capitalist zeitgeist as an antidote to the dominant “winner-take-all” model.For Jones, the cooperative model became a north star, a way to democratize ownership and control of the business while maintaining a non-hierarchical workplace. “As a worker co-op, my team votes me down sometimes, but that's how we get the best decision for the group,” Jones notes. “I think any strong organization should be structured that way, where there’s not just one person who can make decisions for the whole group.” A recent collective decision was to launch a line of CBD-infused nut milks, making Pecan Milk Co-op one of the only dairy-alternative companies in the U.S. to do so. They make and package their products at Leaven, a Black-owned collaborative kitchen space in Decatur, Georgia.In addition to the new product line, the team now includes 10 worker-owners. The cost of a share to buy into full worker-ownership is $1,450, but workers can choose to contribute sweat equity toward that sum from their hourly pay, starting at $7.25 an hour. Once they reach full worker-owner status, that rate goes up to $15 an hour, and the company has its sights set on increasing wages and adding benefits as the business continues to grow. Any portion of net profits not reinvested into the business are shared equally among all worker-owners.But getting to a point of profitability has not been straightforward. It is no secret that in the face of institutional and systemic racism, Black entrepreneurs struggle. Compared to white-owned businesses, Black-owned businesses are almost three times as likely to be less profitable due to a chronic lack of access to capital.Building Pecan Milk Co-op gave Jones front-row tickets to the classic catch-22 of bootstrapping a food business, with the double whammy of doing so while Black. Soon after the company launched, Jones lost their barista job and with that, what little money they were able to save and put toward the co-op. While the brand was gaining traction at farmers markets—growing from a couple of locations to more than a dozen markets fairly quickly—placements in grocery stores proved harder.To buy the ingredients and supplies necessary to grow revenue through large grocery store orders, they needed capital. But Jones, who was housing-insecure at the time, didn’t have the necessary credit score or financial standing to qualify for small business loans. That, coupled with microaggressions from grocery store managers and others in power, only reinforced the significance of what they were building: a company where queer Black people could show up fully, as their whole selves, and have the means to a dignified livelihood.Eventually, Pecan Milk received their first grocery order from Sevananda, Atlanta’s longest standing grocery co-op, but scaling up further was impossible without access to capital. Most product-based businesses, on average, need $30,000 to launch and grow. In the grocery industry, supply chain norms mean smaller vendors like Pecan Milk only get paid a month after they deliver the product, but to make the product, they still have to pay their suppliers on time.Jones learned about payment terms like Net 30 through trial and error, and the consequences weren’t just fiscal, they were physical. “I have lots of knowledge about our business and industry, but a lot of that knowledge lives in my body, you know?” Jones says. “I've had the experience of not having money [after making and delivering our product]. I’ve been hungry, and I can still feel that in my body, for better or worse.”That hunger has translated into an even deeper mission. Since banks and other traditional sources of capital have not been a real option for the cooperative—or for Black-owned business in general since they are deemed to be less creditworthy—Jones and the team are pursuing a creative alternative: a direct public offering, which allows companies to raise capital directly from people, bypassing financial institutions altogether. Jones hopes that customers who love the product will also consider buying shares of the business, giving the co-op a long-overdue opportunity to scale. It’s a strategy Jones hopes will inspire other businesses similarly struggling with the traditional financing model.Chel Xi, a worker-owner who has been with the co-op for six years, is excited about Pecan Milk’s possibilities for growth. She reflects on the last six years of her deepening involvement with the cooperative and compares it to a group project at school where success hinges on everyone taking equal ownership and responsibility, but with an added important layer: “If you're in a traditional workplace, you can get to that space where you’re like, it's just a job. But in this co-op space there is this necessity of interpersonal care.”That same necessity of care underpins the strong legacy of cooperatives in Black communities. In the relentless presence of racist, institutional violence, cooperative economics is often the only means of survival. In fact, as Black co-op scholar Dr. Jessica Gordon Nembhard notes, the Underground Railroad is one of the oldest examples of a cooperative in this country. The informal network and infrastructure that existed between formerly enslaved Black Americans and abolitionists was key to helping other enslaved people to freedom and became a powerful symbol of resistance. Through Pecan Milk, Jones and the team want to pay homage to that legacy and build a future where centering the dignity of Black people is the new status quo.Explore Bon AppétitCultureAtlantaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-08", "author": ["Condé Nast", "Nikishka Iyengar"]}