{"id": "104fb3b2d14ac4cbd5e610d172ccf037", "url": "https://www.bonappetit.com/story/snack-board-commandments", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "I Am Passionate About Snack Boards, And These Are My Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Am Passionate About Snack Boards—and These Are My RulesAll you need is a little bit of everything.By Amanda MitchellOctober 1, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaFacebookTwitterEmailMy taste buds embody the phrase “the heart wants what it wants,” and usually what it wants is a wide variety of flavors, textures, and culinary experiences at once. Being satisfied with just one flavor in one meal? Nah, I’m a tapas girl. So, as is to be expected, I struggled in the beginning of quarantine when I was forced to eat… leftovers, which, for some reason, took all of the joy of food and cooking from me. Yes, I made focaccia, and yes, I ate that entire focaccia over a 14-hour period, but I found myself, rather early on, getting burnt out just cooking for myself day in and day out. So I returned home to Michigan, where my mom (who is a living genius, let me tell you) introduced me to the concept of a snack board.In the island of our kitchen in quaint Franklin, my mother, a few times a week, would set out whatever plate she decides suits her mood and cover it with a variety of food options—bright, fruity goat cheese, cherries (it was Michigan summer, after all), almonds, maybe a few slices of prosciutto—and that would be what we’d graze on throughout the day. I had always considered myself a charcuterie connoisseur and, pre-pandemic, a general fan of #pancakesforthetable and #friesforthetable, so it was an earth-shattering moment to realize a snack board might be a game changer for me and my tastebuds. Snack boards broke up the minutiae of my day, when the only thing I had to look forward to was watching a rerun of Real Housewives of Potomac while drinking too much Beaujolais and painting-by-numbers.Charcuterie is a dream your heart makes, and a snack board can literally be whatever you want to be. Are there rules? Kind of. Are they entirely arbitrary and put in place by me because that’s the only way I can feel like there’s any control in my life? Yes!Rule #1: There are no rules.This is your opportunity—but hopefully not your only opportunity—to do what you want. If you thrive on chaos, you’ll enjoy a snack board. Set it up with a vast array of fruits, vegetables, cookies, handfuls of dried cranberries, and that ham that isn’t quite enough to put in a sandwich, and that’ll get you through a solid work day. All you want is a little bit of everything—the key is to play with flavor profiles and textures on your snack board. Pair a sharp cheddar with grapes and some chocolate-covered pretzels. Just don’t call it charcuterie.Rule #2: A charcuterie board is not the same.If you’ve spent any time on TikTok, you’ve probably seen the “breakfast charcuterie. I hate to be the bearer of bad news, but that is a brunch board, not a charcuterie board. “Charcuterie” is a very fancy French term for “grandiose amounts of cured meats and meat products” according to the definition my brain just invented. Just because there’s bacon on your snack board does not make it charcuterie. Words have meaning, people. Can a snack board solely feature cold meats and cheese? Yes! And that is both a snack board and charcuterie. A charcuterie board can be a snack board, but a snack board is not a charcuterie board.And the minute you start soft-boiling eggs or pulling out pancake mix with the purpose of putting them on your snack board, please reconsider. If you’re going to spend the time actually making things for your snack board (ahem, not your charcuterie board), you probably should just make a whole meal. (In my book, an Eggo waffle is fine because of ease and speed.)Rule #3: A party can have one attendee.Snack boards do not have to be shared. Making a portion for yourself is just as legitimate as creating a decadent plate to be enjoyed with your roommates. Shred some rotisserie chicken and pair it with that amazing chili crisp spread from Trader Joe’s, placed alongside some strawberries that definitely need to be eaten soon, as well as hummus and carrots. It’ll look like a Lunchable, and that’s totally okay.You are all welcome on my snack board!\nPhoto by Alex LauRule #4: Work with what you’ve got.Going out to pick up things for a snack board defeats the purpose of a snack board. A snack board is an all-encompassing way to clear out the leftovers or “not enough of a full serving” handfuls you’ve left behind in your cabinets. If you’re “running out” to get food for a snack board, you might as well just make a whole meal. A snack board is the pantry pasta of boards, you see, and quit lying to yourself: You’re never going to “get around” to using the rest of that candied ginger. Toss ‘em in a tiny, decorative cup that makes you happy, and pair them with some cheese no one liked from your picnic, romaine you dug out from the bottom of the vegetable drawer, and that packet of Sour Patch Kids you picked up to reach a credit card limit. If Mindy Kaling can mix olives, Reese’s Peanut Butter Eggs, sour straws, and yogurt-covered pretzels and call it “improvising,” a handful of Doritos can buddy up with turkey, pistachios, and Skittles.Rule #5: Make it aesthetically pleasing—but not too much.Garnishes are cool, they’re fun, they’re a hit at every party, but please: This is a snack board, not a table scape—we don’t need cute flowers or a cinnamon stick tied up with a pretty bow to make your snack board extra-special. Inedible garnishes have no place on plates of pasta and they shouldn’t be on your board, either.Rule #6: Avoid anything too pungent or messy.Shatteringly crumbly crackers and blue cheese that smacks you in the face when you open the door are great for specific occasions. But that smell will linger longer than the pandemic, and you don’t want crumbs in your keyboard. I’m not trying to wreck anyone’s party, but I do want you to keep the long-lasting impact in mind. It’s just smart.But really: Quarantine taught us all to lean into the chaos, make the best of the worst, and reconsider our idea of what is normal. Sure, we may have gained some new habits and fun hobbies, but the real learning was how to make the best of what we have. Snack boards are a way to kind of embrace the absurd time we live in—”the new normal” is that there is no normal anymore and we’re all just doing our very best.Amanda Mitchell is a freelance beauty and culture writer and podcast host based in Brooklyn. Please do not give her Chardonnay.And with all that leftover cheese…When I Have More Cheese Than I Know What to Do With, I Make Fromage FortCheese, butter, wine—name a more iconic trio.View StoryExplore Bon AppétitSnackappetizerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-01", "author": ["Condé Nast", "Amanda Mitchell"]}