{"id": "105efefc3a30ccd581837e4e9eac3ceb", "url": "https://www.bonappetit.com/recipe/grains-in-herby-buttermilk", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Grains in Herby Buttermilk Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueGrains in Herby ButtermilkBy Andy BaraghaniFebruary 11, 20203.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe herbed sauce in this grain dish gets a double hit of punchy dairy: Not as sharp as other acidic ingredients, buttermilk lends a unique tang and yogurt brings body and richness. Ingredients4 servings1cup mixed unhulled grains (such as spelt, whole barley, and/or whole farro)1small onion, unpeeled, halved3garlic cloves, crushed23x1\" strips lemon zestKosher salt1½cups parsley leaves with tender stems1cup dill fronds1cup buttermilk, preferably room temperature½cup plain whole-milk Greek yogurt, preferably room temperature½lemonExtra-virgin olive oil (for drizzling)Freshly ground black pepperPreparationStep 1Toast grains in a dry medium heavy pot over medium heat, stirring occasionally, until just slightly darkened and beginning to smell nutty, about 4 minutes. Pour in 4 cups water, then add onion, garlic, lemon zest, and a couple of big pinches of salt; stir to combine. Bring mixture to a boil, then reduce heat to medium-low and simmer, stirring occasionally and skimming any foam from surface as needed, until grains are tender (pull out a few grains and take a bite to test), 35–45 minutes; pluck out and discard onion, garlic, and lemon zest.Step 2Meanwhile, purée parsley, dill, buttermilk, and a big pinch of salt in a blender until bright green and smooth. Pour into a medium bowl, add yogurt, and whisk until your arm gets a bit tired—3 minutes should do the trick (whisking the mixture well will ensure that the yogurt doesn’t split and get grainy when you add it to the grains).Step 3Pour buttermilk mixture over grains. Increase heat to medium and bring to a bare simmer. Cook just until heated through, about 1 minute. Remove from heat and squeeze in juice from lemon half. Stir well, then taste grains and season with more salt if needed. Skim any foam from surface.Step 4Ladle grains into bowls. Drizzle some oil into each bowl and top with coarsely ground pepper.How would you rate Grains in Herby Buttermilk?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis recipe sounds amazing, but I am hoping someone can clarify something for me. The recipe does not say to drain the grains, but seems to imply to not use any liquid from cooking the grains, just to mix the grains with the herbs and buttermilk. If I only use the buttermilk mixture, that does not seem to be enough liquid for 4 servings.Anonymous9/27/2020I loved this recipe, but I love most everything Andy does. I did veganize it, making my own buttermilk with oat milk and lemon juice, plus I used kite hill brand Greek yogurt. Not sure if this is why, but I did not have any of the trouble with the herb milk separating at the end. \n\nAlso, maybe this is just me, but in case you interpret his instructions the same way I did: if you want yours to look like the picture. I would not combine milk and grains in the sauce pan. Instead, ladle milk into bowls and then spoon the grains in. Otherwise I got green grains. AnonymousVirginia 4/21/2020Taste was great, but my sauce broke in last \"bare simmer\" step. AnonymousSan Francisco3/11/2020We really enjoyed this recipe, and the preparation was relatively easy and painless.\nSimilar to another commenter, our sauce split when we added the lemon juice... We blamed keeping it on the heat too long, but in hindsight, it very well might have been the lemon juice.\n\nOurs wasn't as bright and cheery as the picture, but we still ate it all and definitely enjoyed it! This is a soup that needs a side dish... We went with hummus and pita chips and enjoyed it.AnonymousDanbury, CT3/9/2020This recipe was ok. I liked the bright flavour and colour but it needed something more. I added green peas, chickpeas and a fried egg on top to make it a meal and also because I am a millennial.  I'm thinking of trying it again but with different greens, like cilantro + spinach.AnonymousVancouver, BC3/6/2020This was so good!  AnonymousPark City Utah3/4/2020It’s cute and green, I like it a lot :)AnonymousDublin 3/2/2020I have a COUPLE OF THINGS TO SAY about this recipe.\n\n1) DO NOT use Kasha in this. Half of the grains will turn to paste and you’ll have a weird porridgey soup. Not great. \n\n2) The lemon juice at the end seemed to curdle the sauce, which was gross. Not sure what could be done about this, but interested to see if others had the same problem.\n\nAll in all I may try making this again just out of curiosity because it seems like it could be good, but my first attempt was so gross we had to throw it all out. I’ll give it that the kasha mistake was not the recipe’s fault and the sauce tasted pretty good before the lemon situation.mer_lavToronto, ON3/2/2020Explore Bon AppétitSpeltRice & GrainsBarleyFarroParsleyHerbs & SpicesDillButtermilkOther IngredientsSideNut-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Andy Baraghani"]}