{"id": "105e5d2a782fc7bf31c4c937f53d19a4", "url": "https://www.bonappetit.com/story/bonappetit-free-streaming-channel-on-tv", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Bon Appétit, Now on Your TV | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBon Appétit, Now on Your TVNew shows. More food. Dig in.By Bon AppétitFebruary 21, 2019FacebookTwitterEmailFacebookTwitterEmailAlready a fan of “It's Alive”? Can't get enough of “Gourmet Makes”? We've got EVEN MORE Bon Appétit for you, now streaming on your TV. Binge original shows and indulge in more episodes (all for free!). Available now on Roku, Apple TV, Amazon Fire TV, and Android TV.Here's how to stream on your TV now:Visit your preferred streaming device’s AppstoreIn the search bar, type \"Bon Appetit\" (don't worry about the accent!)Click install and download to your TV for freeFor more Bon Appétit channel information on each device visit: Roku, Apple TV, Amazon Fire TV, or Android TV.Here's what's new:“It’s Alive: Goin’ Places” (available now!)Building on what fans already love about “It’s Alive,” this new program features even more of Brad Leone (and his hijinks). Each season features a different culinary destination for Brad to learn about the culture, specialties, and tastes of the region. In season 1, Brad travels to central Texas.“Bon Appétit’s Baking School” (launching early April)Pastry chef Claire Saffitz brings her relatable and fun style to “Bon Appétit’s Baking School,” in which she tackles everything from indispensable ingredients to tricky techniques for making the world’s most popular baked goods. Up first: cakes!“Making Perfect” (launching April)The entire Test Kitchen works together in this ensemble-led show to figure out how to make the perfect version of iconic dishes through a mix of in-kitchen testing, expert wrangling, and out-in-the-world exploring. This season will focus on pizza with each of the five episodes hosted by different Bon Appétit personalities.In addition to these original shows, the Bon Appétit channel will also feature all 24 episodes of “The Naked Chef” series with Jamie Oliver. This year marks the 20th anniversary of this popular, classic, and nostalgic series that is distributed by BBC Studios.The programming will also include episodes from our already popular digital series. This includes “It’s Alive,” which features fan-favorite chef Brad Leone as he experiments with various fermentation projects; “Gourmet Makes, ” with pastry chef Claire Saffitz attempting to recreate our favorite childhood junk food; and “Back to Back Chef,” where celebrities try to keep up with Carla Lalli Music in the test kitchen. Plus much, much more!For more Bon Appétit channel information on each device visit:Roku, Apple TV, Amazon Fire TV, or Android TV.Meet our chefs!Brad Leone is the host of “It's Alive,” which largely focuses on food fermentation projects. Brad is also the host of the free TV show “It’s Alive: Goin’ Places,” where he explores central Texas’ culinary offerings in the series’ first season. Brad grew up hunting and fishing with his dad and spent a lot of time in the woods. There, he learned respect for ingredients and nature in general. Cooking has always been a major part of Brad’s life and his passion ultimately led him to join the Bon Appétit team in 2011. Find him on Instagram.At Bon Appétit, Claire Saffitz developed recipes for the print magazine and website, and dabbled in food styling. Claire is frequently featured on Bon Appétit’s YouTube channel, including fan-favorite series, “Gourmet Makes,” where Claire recreates childhood junk food. She’s also the host of “Bon Appétit’s Baking School,” where she breaks down the essentials of baked goods. In the show’s first season, Claire explores the various techniques to bake a cake. Claire earned a Bachelor of Arts in American History and Literature from Harvard University. She also completed the International Program in Classic French Cuisine at École Grégoire Ferrandi, a culinary and trade school in France, and a four-month externship at Spring Restaurant in Paris. After Paris, Claire moved to Montreal to pursue a Masters degree in History at McGill University, where she studied the intellectual history of food in Early Modern France. Find her on Instagram.Carla Lalli Music is the food director at Bon Appétit, where she oversees the brand's food and recipe content in print and across all digital platforms. She writes frequently for the magazine and its websites—Bonappetit.com, Basically, and Healthyish—and is a frequent guest on the Bon Appétit foodcast. Music loves hosting recipe videos in the BA test kitchen and is always excited to talk a celebrity through a dish on Back-to-Back Chef. Her cookbook, Where Cooking Begins, will be published in March 2019. She lives in Brooklyn with her husband and two sons. Find her on Instagram @lallimusic.After working for several years as a behind-the-scenes food stylist, Molly Baz joined the team of test kitchen editors at Bon Appétit. She shares her favorite recipes on Bon Appétit’s “From the Test Kitchen” digital series and is on a quest to find the perfect pizza on “Making Perfect.” After many hours of deliberation, she has concluded that her last meal on earth should consist of: ice cold oysters on the half shell, shrimp cocktail, Caesar salad, crusty sourdough bread slathered in unsalted butter, a perfectly roast chicken, and a bottle of the nattiest natty wine. Basic? Maybe. Perfect? YES. Find her on Instagram.At 17, Andy Baraghani began working at world-renowned restaurant, Chez Panisse. From there, he continued his culinary training in some of the top restaurants around the country, including Gary Danko, Corton, and Estela. By the time he was 21, he was running a monthly pop-up featuring seasonal Iranian food outside of his Brooklyn apartment. In 2015, he joined Bon Appétit as senior food editor where he develops recipes and hosts a regular video series for the brand. In addition, Andy is featured on Bon Appétit’s new TV show “Making Perfect.” Find him on Instagram.Chris Morocco is a senior food editor at Bon Appétit where he works in the Test Kitchen developing recipes, dreaming up food content, and figuring out what the next big thing in food is. He regularly appears in the brand’s video content, including Bon Appétit’s new show “Making Perfect.” Prior to joining Bon Appétit, Chris held editorial positions at Real Simple and Vogue and completed his culinary education at the French Culinary Institute. Find him on Instagram.Priya Krishna is a food writer who contributes to Bon Appétit, The New York Times, The New Yorker, and others. At Bon Appétit, she writes for both the magazine and the website, and also serves as a host on Bon Appétit's \"From the Test Kitchen\" digital series. Priya got her start in food by inaugurating a column in her college newspaper on how to turn dining hall fare into gourmet meals. She also worked at the food magazine, Lucky Peach. Priya is the author of Indian-ish, a cookbook about the hybridized Indian food she grew up eating. Find her on Instagram.Rick Martinez is a cook, writer and pit master with a deep love of Mexican culture and cuisine. Rick is a contributor and video host on Bon Appétit's \"From the Test Kitchen\" digital series. Formerly a senior food editor at Bon Appétit and host of a City Guide video series on Mexico City, Rick spends as much time as possible eating his way around Mexico. Originally from Austin, Texas where he learned the art of smoking briskets, he currently lives in New York dreaming of tacos. Find him on Instagram.Explore Bon AppétitVideoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Bon Appétit"]}