{"id": "1062c753ba815c016cea331f550c552c", "url": "https://www.bonappetit.com/story/zucchini-thats-actually-good-caramelize-pizza", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Want to Make Zucchini That's Actually Good? Caramelize It and Throw It On a Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWant to Make Zucchini That's Actually Good? Caramelize It and Throw It On a PizzaCaramelization is good. Flatbread is good. Throw some zucchini in the mix, and it can't not be good!By Hilary CadiganSeptember 4, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailTwo food words I absolutely love: caramelized and flatbread. I’ve never met anything caramelized I didn’t adore, especially vegetables—they become infinitely superior to their former selves, sweet and smoky and soft and crispy all at the same time. Meanwhile, “flatbread” is really just a code word for pizza, which is a win even when ordered from a large chain days prior and eaten cold standing up hungover in front of the fridge.Anyway, when I came across this recipe for Caramelized Zucchini Flatbread, I knew it was going to be a hitter. Even though those two words I love so much were sandwiching a word that I feel pretty meh about generally. To be clear, I do not hate zucchini nearly as much as my esteemed colleague Carla Lalli Music does, bless her. In fact, I do not hate zucchini at all—I just don’t have the kind of strong, positive feelings for it that I do for caramelization and pizza-like things. You know?But let’s move along. Making flatbread begins with a choice. And that choice involves pizza dough. Which, if you waited ‘til the last minute as I obviously did, is not always a choice exactly, since many small markets do not carry it fresh, and local pizza joints can be rather stingy about selling their dough—even when, in a moment of desperation, you offer to pay double its value. Luckily for me, most markets offer frozen dough, which you can thaw out on the fly by putting it in a sealed plastic bag and soaking it in a bowl of cold water at 15 minute intervals until the center is no longer rock hard. Still moving along!Regardless of your dough sitch, you’re going to want to let it sit at room temperature for about half an hour for max stretchability. While this is happening, preheat your oven to 450 and chop up three medium zucchinis and one large red onion into quarter-inch coins. Then give it all an olive oil bath and a good pinch of salt before popping it into the oven. Let those babies get nice and brown (remember folks, it’s very hard to over-caramelize), which may mean cooking them almost twice as long as the recipe states depending on your oven. (I did it about a third longer and could’ve gone further had my hangry father not been checking in every five minutes about when the pizza would be ready.)The beauty of this recipe is that a lot of relatively simple things are happening at the same time, so if you happen to be visiting your family over Labor Day Weekend you can dole out tasks to various family members. Brother: Mix together two cups of ricotta and a quarter cup of parmesan. Brother’s Girlfriend: Grate half a lemon and one garlic clove into aforementioned cheese mixture. Mom: Chop these onions (sorry, mom). Meanwhile, you just sit in the middle of everything like the delegating flatbread czar you were always meant to be.Squishy, stretchable room temp pizza dough is key.\nPhoto by Alex LauAt this point you’re stretching out your pizza dough on a sheet pan (which is where that room temperature thing comes into play; cold dough will spring back into place each time you try to stretch it, which is very annoying). The stretched dough (it will be very large by this point) then goes onto the oven’s bottom rack to for a bit while the caramelizing onions continue to raise the profile of the neighboring zucchini several points by proxy.Once the bottom of the dough is lightly browned, it comes back out and gets dolloped with the ricotta mixture, then that mess of caramelized vegetable goodness, then popped back into the oven. It’s ready once the ricotta starts oozing into the veggies, again infusing its superiority into the once-meh zucchini.The result, folks, is a very pretty pizza, dusted with lemon zest and crushed red pepper flakes and a cooling flutter of fresh mint leaves, which provide a wholly unexpected flavor that will have you feeling fancy and proud. Yes, zucchini is the star of this dish, but the caramelization and the creamy ricotta and the edible pizza dish on which it sits act like brothers-in-arms, carrying the zucchini to new heights, rendering it not just edible but downright tasty. Your parents will be impressed. Your mom will save the leftovers in Tupperware and eat a slice a day for the next three days. And zucchini farmers ‘round the world will breathe a sigh of relief.Get the recipe:Caramelized Zucchini FlatbreadThe most delicious solution to summer squash fatigue.View RecipeExplore Bon AppétitBasicallyFlatbreadPizzaZucchiniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast", "Hilary Cadigan"]}