{"id": "10635fdaa04b9bb1a24840983b254035", "url": "https://www.bonappetit.com/recipe/spring-chicken", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Buttermilk Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButtermilk Spring ChickenBy Carla Lalli MusicMay 4, 20204.2(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Carla Lalli MusicEmailPinterestPrintEmailPinterestPrintPeople have been brining chicken in buttermilk since forever, often as the first step in a dredged and fried chicken situation. But we have chef and cookbook author Samin Nosrat to credit for the idea of roasting poultry straight out of a buttermilk bath, which not only imparts delicious tangy flavor, but also helps the skin achieve a walnut-colored hue when roasted at high heat.Ingredients4-6 servings4chicken leg quarters (about 2½ lb.)1Tbsp. kosher salt, plus moreFreshly ground black pepper1lemon2cups buttermilk, divided1Tbsp. plus 1 tsp. toasted sesame oil½cup plain whole-milk Greek yogurt or sour creamHot sauce (for seasoning)3Tbsp. extra-virgin olive oil6medium leeks, white and pale green parts only, sliced into ½\"-thick roundsA small handful of chives, thinly slicedPreparationStep 1Arrange chicken legs in a large baking dish or pie plate and season with 1 Tbsp. salt and a very generous amount of pepper, turning to get both sides. Let sit 15 minutes.Step 2Finely grate lemon zest directly over chicken and turn to coat; set lemon aside for making the dressing. Add 1½ cups buttermilk and 1 Tbsp. sesame oil and turn again to coat. Cover and chill at least 3 hours and up to 12 hours, turning occasionally if possible (don’t get up in the middle of the night or anything).Step 3Meanwhile, whisk yogurt, remaining ½ cup buttermilk, and remaining 1 tsp. sesame oil in a small bowl to combine. Cut reserved lemon in half and squeeze in the juice (you should get about 2 Tbsp.). Season with salt and pepper and a few dashes of hot sauce and whisk again to combine. Cover dressing and chill while the chicken marinates.Step 4Preheat oven to 475°. Let chicken sit out at room temperature while the oven comes up to temperature. Line a rimmed baking sheet with parchment paper or foil (to make cleanup easier) and set a wire rack inside. Remove chicken from marinade, letting excess drip off, and place, skin side up, on prepared rack; discard marinade. Roast chicken until skin is a deep brown and crisp and a thermometer inserted to thickest part of thigh registers 165°, 25–30 minutes.Step 5Meanwhile, heat olive oil in a large skillet over medium-high. Add leeks and toss to coat. Season with salt and cook, tossing occasionally, until dark brown around the edges but not completely softened, 6–8 minutes. If the pan looks dry or scorched toward the end of cooking, add a splash of water to get things moving again.Step 6Stir half of chives into dressing, then spread dressing onto a platter or 4 plates. Spoon leek mixture over and top with chicken. Scatter remaining chives over.How would you rate Buttermilk Spring Chicken?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleI've been cooking with buttermilk soaked chicken for quite some time, I love it. as with one comment if I am out of buttermilk (I freeze in zip lock bags) I too add milk and vinegar, immediately turns i into buttermilk. I love it. This is the reason I tried this recipe. I found it wonderful.\nRamona WoodSeattle , Wa8/24/2021Chicken was great, extremely flavorful and super juicy. I just did them in a preheated cast iron skillet (for bottom browning) and had no issues with smoking. Per the other comments about the dressing lacking flavor, I made a more traditional ranch dressing (added kewpie mayo, onion powder, and fresh dill), with the extra I dressed some cabbage/carrots with it for a slaw. Threw extra dill all over everything at the end as well. SarahBerkeley, CA5/12/2021Pretty good, chicken was well flavored.  I marinated overnight.  Way too many leeks, I'd use half the amount.brushjlsolon, oh1/13/2021Made this tonight after reading the recipe and all the comments. While I liked the recipe, I personally found it a bit tricky, and so I thought I would leave some tips for posterity. First of all, since this is a fairly simple recipe with few ingredients, it benefits from liberal salt and pepper at every step (brine, leeks, sauce, and also when plating). Like, more than you would think. I found just a few dashes of hot sauce insufficient to season the sauce; I think 1-1.5 tablespoons is better. For reference, I was using Cholula. I had leftover toasted walnuts and marjoram sprigs and added them to the brine, but I don't think they added anything at all, so skip that if you happen to be in the same situation. In addition to chives, I think the recipe benefits from the added complexity of an additional tender herb (e.g. marjoram) for both the sauce and as a garnish. When baking the chicken, I added water beneath as other reviewers suggested. Although my chicken was fully cooked after the indicated time, I believe the water produced steam which inhibited the browning. I placed the chicken beneath the broiler for a few minutes after, and it ended up nicely caramelized without overcooking. Finally, I'm not used to cooking with leeks, but the ones I got from Whole Foods were pretty large (white and pale green portion almost 1 foot long). I used only 5 of these, and still found the amount of leeks to be too much. So use fewer if you also get ones this big. Oh, and I appreciated a few additional dashes of hot sauce on the leeks when plating. Good luck!AnonymousSan Francisco9/22/2020Looks promising but lacks flavor. It's basically roast chicken with ranch dressing. The chicken came out fine but not as juicy as the marinade would suggest. I'd rather cook it a little longer at a lower temperature. And, the leeks need something, maybe a splash of vinegar and/or some added nuts.SrAsparagusOakland, CA7/12/2020I did not have a wire rack (I was shocked too) so I had to place my legs directly on the tray and it turned out fine! No smoking problems or anything. I am not in love with the yogurt sauce but in the end it did bring some really great flavor. I love recipes that feed into my kitchen ecosystem so I collected all the juices in the tray to use for Carla's perfect beans and the bones for some bone broth! A great, simple recipe, and the leeks will blow your mind, so simple but so much flavor. AnonymousConnecticut 6/29/2020Never knew cooking with sesame oil was so good.  TaxAct.com mentioned that using it can be a tax benefit or something like that. Went to there site thinking they had recipes than stumbled upon this delicious dish. \nTook an hour to cook. It was so yummy and flavorful. \n\n foodzidooziIrving, TX6/24/2020We adapted this recipe to the grill. We made it with airline chicken breasts because it is what we had on hand. Next time I would double the leeks, they were so good. I did double the sauce. Tasty stuff!!AdamsmumMaple Grove Minnesota6/7/2020I made this as written. I lined the pan with parchment and didn’t have any smoking issues. But I have a fairly new oven which seems to have a good fan built in. I also let most of the marinade drip off before I put the chicken on the rack. I really liked the leeks and the yogurt sauce. I did add quite a bit of hot sauce to the sauce. I may cut back on the sesame oil next time and add some garlic to both the marinade and the sauce. This will go into regular rotation at my house.littlerebeccamoore5279Dallas, Texas6/5/2020I don’t usually write reviews but I wanted to for this specific recipe. A couple of challenges. 1. Cook time should be a bit longer for “fall off the bone” chicken. I cooked for maybe 33 mins. Skin was crispy but hard to separate from the bone. 2. Unless you eat the skin, it was a bit bland overall and I used quite a bit of salt. 3. I marinated from 11-7. And followed recipe exactly which I tend not to do but it didn’t sound like it needed any improvements as it was presented. 4. I don’t really get the “ yogurt sauce” part of this recipe. Just felt like I wasted a bunch of things. 5. As others mentioned in their review, mine didn’t smoke at all which was a plus! Maybe because I cleaned my oven last week? Overall I don’t think I would make this again. Honestly I love BA and this was one of the few recipes that I personally didn’t like. CamiejoPlaya del Rey, CA5/28/2020Absolutely delicious 🤤 another BA hit. The flavors were great. I only marinaded my chicken for 3 hours. Next will do it for longer. It was juicy and tasty! Great tip on the adding water at the bottom of the pan as chicken cooks. My apartment was filled up with smoke. Not complaining because it was worth it. Only thing I added was 1 garlic(Grated) to the yogurt/buttermilk sauce. It was lacking something. The longer it sits the tastier it gets. Definitely recommend this and enjoyed this recipe 👌🏼jessicaolBrooklyn, NY5/22/2020Made this tonight fairly successfully. I used the recipe on a spatchcocked chicken (1.5 cups buttermilk made from milk and lemon juice) and marinated for 11.5h. I added whole garlic cloves to the marinade as well. It is very important to line the tray with aluminum foil and pour water in the pan. Continue to monitor for if there is water in the pan as once it all evaporates, there will be smoke (happened to me). I think this step should be included in recipe, so I'm knocking off a star. Unfortunately, I incorrectly inserted my thermapen and ended up having to throw the chicken back into the oven after it had been cut into to further cook. \n\nI significantly altered the sauce. 3 parts yogurt, 1 part sour cream, 2 parts mayonnaise. Lemon, salt, pepper, hot sauce and chives to taste. I thought this was pretty nice with the chicken. \n\nUltimately, very tender and tasty chicken. I learned some lessons here for the next time I make it. Vancouver, BC5/22/2020I want to make this tonight but scared of all the comments about the smokeout. Did that water trick work? Our apartment is so tiny, when it does smokeout it lasts forever and our kitchen window is permanently closed due to freeway noise (LA, figures). AnonymousLos Angeles, CA 5/20/2020ok... this is literally the best chicken I've ever made. So tender and so juicy! It could not have turned out better (and my cooking abilities are pretty meh, so if you're concerned you are no chef... this recipe has GOT. YOUR. BACK.) I used chicken breasts and it took the same amount of time (30 min) and was so yummy. 10/10 would recommend and WILL make again... and again.AnonymousTexas5/19/2020ok... this is literally the best chicken I ever did eat. It is SO tender, SO juicy, SO delicious. I replaced it with chicken breasts and it took the same amount of time (30 min) and was just as yummy. 10/10, would make again.AnonymousUtah 5/19/2020Explore Bon AppétitButtermilkOther IngredientsLeekVegetableChicken LegChickenPoultrySpringMainGluten-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-04", "author": ["Condé Nast", "Carla Lalli Music"]}