{"id": "106ed37b47f0e10fb5c8c766a19c6200", "url": "https://www.bonappetit.com/story/orange-peel-chai-throat-soother", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "When I Lost My Voice, Orange Peel Chai Brought It Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen I Lost My Voice, Orange Peel Chai Brought It BackHow an unrelenting sore throat helped me create a recipe for our sustainability issue—and my new favorite cold remedy.By Sonia ChopraMay 6, 2021FacebookTwitterEmailPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else. When I lost my voice earlier during the pandemic, I tried everything to fix it. First I tried my hardest to just stop talking, though for a chatty person like me (who also has days packed full of meetings), that’s not as easy as it sounds. So I started to go through bags of cough drops, all kinds of home remedies, whole citrus groves full of oranges, and plenty of over-the-counter meds—and I really doubled down on drinking soothing teas.Sadly for me, my go-to formula—boil a ton of ginger with water, add spices, throw in a teabag, steep, strain—wasn’t doing anything. I tried adding honey; I tried losing the caffeine; I tried this great onion syrup from Felicia Cocotzin Ruiz. I bought a fancy new mug to keep water hot all day and set up a little tea station by my desk. I called my grandmother; I texted some chefs I know. Nothing worked.And then a friend sent me a cocktail kit that had dried oranges in it, and on a whim one day I threw one in with some crushed cardamom and cinnamon—and it actually helped. When I ran out of the cocktail garnishes, I started throwing in orange peels, which previously I’d just let pile up on my desk over the course of a day as I went through wedge after wedge of citrus during meetings. The taste is more subtle, but the effect is the same.So when my coworkers asked if anybody had recipes that might be suitable for a story on food waste for the May issue, I developed the orange peel chai. It’s totally adaptable—use the spices you like, omit the ones you don’t, caffeine completely optional—and, if you try it, I hope it picks you up on days when you’re feeling low.Get the Recipe:Orange Peel ChaiRather than tossing your orange peels, add a few to a batch of warming chai for a soothing sick-day (or any-day) beverage.View RecipeExplore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-06", "author": ["Condé Nast", "Sonia Chopra"]}