{"id": "106fe679d0d60603e8c357d036ebb31e", "url": "https://www.bonappetit.com/story/art-of-the-dinner-salad", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "The Art of the Dinner Salad: 5 Tips for Making a Pile of Veggies Feel Like a Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Art of the Dinner Salad: 5 Tips for Making a Pile of Veggies Feel Like a MealA great dinner salad is substantial, addictive, and won't leave you scrounging for leftovers a half hour later.By Kat BoytsovaJanuary 9, 2019FacebookTwitterEmailFacebookTwitterEmailI love salad. Big fluffy green ones. Crunchy ones. Hearty ones. Every salad have a special place in my heart. If I’m being honest, I've been caught on many occasions making a midnight snack out of a head of lettuce and some leftover dressing, a time when any normal person would be munching on shredded cheese from the bag or jarred salsa and chips. (I’m just living my truth people!) But the hard reality is that most people don’t share this feeling with me—and it's my mission in life to change their minds. And that starts with the dinner salad.I get that a lot of folks are resistant to the idea of eating salad—and only salad—for dinner. But as a person who almost always has friends staying over at my place, and am therefore responsible for keeping them fed, I've had plenty of practice converting salad skeptics. Through much trial and error, I’ve come up with a formula for a dinner salad that will satisfy both my salad hater friends and my salad obsessed self. It produces a pile of veggies that is substantial, satisfying, and a main course in and of itself—no post-meal snacking required. Here's how to do it.Massaged kale makes for a more substantial salad base.\nPhoto by Heidi's Bridge, styling by Molly BazHearty GreensA substantial base is the key to a proper dinner salad. This is no place for boxed \"spring mix\" or a head of delicate butter lettuce—you need something with some oomph. I love to use cabbage (red, green, savoy, napa), kale, collards, or mustard greens, which will be able to stand up to all the flavorful add-ins, toppings, and dressings that this salad wants without wilting. The trick to making these non-lettuce salad bases delicious is to massage them with some olive oil, lemon juice and salt after they've been cut up. This helps to break down the tough cell structure these veggies have, rendering them tender and ready to soak up flavor.Leftover rotisserie chicken, tinned fish, and crispy roasted chickpeas all add protein and heft.\nAlex LauProteinA dinner salad needs protein to make it really feel like dinner. Anything goes! Shredded rotisserie chicken. Last night's roasted salmon. Jammy boiled eggs. But nobody's saying you have to use leftovers—you can sizzle up a steak or a pork chop just for this salad endeavor if you want to make it feel less hodge-podge. And do not despair, vegans of the world: Crumbled tofu, frozen-then-thawed edamame, or crispy chickpeas are all welcome here, too.Leftover roasted squash? WELCOME ABOARD THE DINNER SALAD TRAIN!\nPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyRaw & Cooked VegNow that you've got a sturdy base and some protein in the mix, it's time to incorporate some supplementary cooked and/or raw veggies. Again, this could be repurposed leftovers—roasted squash from a few nights ago, stir-fried broccoli—or some odds and ends from meal prep, like quick-pickled cukes or shaved radishes. You want to shoot for contrast, if at all possible—soft, sweet roasted carrots paired with crunchy raw cauliflower, for instance, or tender herbs and sprouts with steamed chunks of sweet potato. And don't forget about fruit! Slivers of tart-sweet apple or Asian pear can bring both acidity and a bit of welcome sweetness to the party.This creamy Tahini-Ranch Dressing is the kind of sauce that dinner salad dreams are made of.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenDressingThis is not the time for light vinaigrettes and the like—you want a dressing that packs a punch, something that has a little heft to it. Remember: Because you started with hearty greens instead of delicate lettuces, this salad can handle it. Think yogurt-based dressings, a rich tahini sauce, or a garlicky homemade ranch. If you are inclined towards something closer to a classic vinaigrette, consider adding a bit of extra citrus, a healthy spoonful of Dijon mustard, or a bunch of chopped herbs, all of which will give it the extra something-something this salad wants.Toasted nuts and seeds are always welcome.\nPhoto by Ted CavanaughToppingsStarting to look like a pretty great salad, huh? Hearty base, protein, extra veg, a knockout dressing. Only one thing stands between you and the best salad you'll eat all year: TOPPINGS! Don't. Skip. This. Step! Toppings are what makes a dinner salad the crunchy-salty-creamy-craveable meal it should be. The more the merrier, but as a rule, I like to make sure to have something crunchy (think pita chips, fried shallots, croutons, nuts, seeds) and something cheesy (crumbled feta, grated Parm, nuggets of goat cheese) to really take that salad to the next level. Toppings are like the icing on a cake, or the star on the top of a Christmas tree: optional, but...not optional.Want to see the formula in action? Try this dinner salad on for size:Raw and Roasted Dinner SaladCrunchy, creamy, sweet, salty, and highly satisfying, this is the kind of salad you can make a meal out of.View RecipeExplore Bon AppétitSaladBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-09", "author": ["Condé Nast", "Kat Boytsova"]}