{"id": "10888d6e6f4bb3f70d1dcf62a6ff66c7", "url": "https://www.bonappetit.com/story/tommaso-free-opera", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I’ve Been Going to Tommaso in Brooklyn All My Life, and Not Just for the Free Opera | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ve Been Going to Tommaso All My Life, and Not Just for the Free OperaSome red sauce joints serve a side of spaghetti. Tommaso serves a side of crooning Italian ballads.By Giulia MelucciApril 16, 2019FacebookTwitterEmailPhoto by Travis RaineyFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I’ve been eating at Tommaso all my life. Since 1974 this restaurant in Dyker Heights, a section of Brooklyn where hipsters seldom venture, has been serving up dishes that are classic yet transcend Italian-American clichés. Resident chef/owner/tenor Tommaso Verdillo was honoring white truffle season before many of his peers across the river had even heard of it. You can order veal cutlet Parmigiana, but you’ll never see beside it a bowl of anemic penne topped with a circle of tomato sauce. Instead of oil paintings of Chianti bottles, the decor features reproductions of Renaissance frescoes, like that snippet of Michelangelo’s Sistine Chapel where God extends his hand to create Adam. The food’s always good, sometimes it’s great, and if the meal doesn’t soar, it doesn’t matter because you’re listening or singing along to opera arias, classic Neapolitan songs, and the occasional pop ballad, provided by Verdillo and a rotating cast of singers with piano accompaniment every weekend.“My father thought he was going to have the next Caruso and get rich,” Verdillo told me recently. His vocal talent was discovered when he was a child singing in church; in his teens he studied to be an opera singer in Manhattan, but by his 20s he was no longer aiming for La Scala. “I was too shy,” Verdillo said. He can’t recall the first time he sang in the restaurant; “it just evolved,” he said, from the kitchen to the dining room. At 73, his voice remains strong.Prepare for the most delicious musical performance in Brooklyn.\nPhoto by Travis RaineyThat kind of thing can be too much for kids. When our parents took us to Tommaso in the ’80s, my brothers and I would try really hard to look at our chicken scarpariello and not each other when Verdillo, dressed in a harlequin costume (it was Carnavale), performed “Ridi Pagliaccio,” a showstopper. We knew if any of us caught the other’s eye we would lose it. Right around the time my childhood ended, my father died, but my mother and I kept returning to Tommaso. By then I had developed an appreciation for opera and especially for wine (Tommaso has a world-class list), but I braced myself one Saturday evening when Tommaso pulled a chair next to our table, closed his eyes, and began to sing “Wind Beneath My Wings,” the theme song from the tear-jerker movie Beaches. I thought I would laugh; instead, I was moved, almost to tears. Tommaso elevated that song above the sentimental. He showed his heart, as he’s been doing with his restaurant for nearly half a century.Giulia Melucci is the author of I Loved, I Lost, I Made Spaghetti.Explore Bon AppétitRestaurantsItalian AmericanRed SauceBrooklynRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Giulia Melucci"]}