{"id": "10a3d3c7166dbb589e383e4ff27ae431", "url": "https://www.bonappetit.com/story/fiery-tofu-crumbles", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "These Spicy Tofu Crumbles Changed the Way I Cook Tofu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Spicy Tofu Crumbles Changed the Way I Cook TofuWhen I'm gone, erect a monument made of this crispy, fiery tofu rubble in my honor.By Sarah JampelJanuary 2, 2019FacebookTwitterEmailPeden + MunkFacebookTwitterEmailI feel more passionately about these spicy tofu crumbles than I do about almost any other soy-based food, which is saying a lot considering how highly I've endorsed Soy Curls, tempeh, and tofu scrambles.Are you dangerously obsessed with tofu, too?These crumbles are just simply... better than all that. With just the right balance of crispiness and spongy-squishiness (and I mean this in the best possible sense), plus a fiery, salty sauce, it's the most versatile, protein-heavy side/condiment/snack in my repertoire. I've made it almost every month for the past two years. And I would eat them a lot more—say, alongside every single meal—if I had the opportunity.Of course it helps that the method is so easy to execute. See, in a pre-Spicy Tofu Crumbles world, I would pan-fry tofu by cutting it up, then tending to each delicate cube in the pan with an eagle eye. I used baby tongs, a fork, or even a wee offset spatula (permission to roll your eyes granted) to flip every cube from side to side... to side, to side, making sure no piece was left pale. It was a precious and ridiculous process that consumed too much of my precious and ridiculous time. This recipe offers sweet relief! By cooking the tofu in large, thick slabs, you only have a handful of pieces to turn just once.Forget the noodles: The spicy tofu crumbles are the star of this ramen noodle bowl with escarole.\nPhoto by Peden + MunkOnce the slabs are on the browner side of golden brown, you'll let them cool and then tear them up with your fingers. You can also use the dullest knife in your kitchen to achieve the same goal: craggy, uneven tofu crumbles with plenty of crevasses to catch and absorb all of the spicy sauce.That sauce is made, very conveniently, from ingredients you probably already have: soy sauce, mirin, Sriracha or gochujang, rice vinegar, and toasted sesame oil. There are also a couple of fresh ingredients—thinly sliced Fresno chile and grated fresh ginger—both of which I've left out in times of need (I've also swapped out the Fresno for a jalapeño and a Serrano and have not been worse for the wear).If you don't pop all of these little tofu crumblettes into your mouth before they get to the table, you'll find tons of ways to use them: with soft scrambled eggs in breakfast tacos, piled atop a bowl of sesame noodles, bobbing on kimchi and vegetable soup, perched on steaming white rice with stir-fried shrimp. I put them in burritos, on kale salads, and under my pillow, where I hope the tooth fairy will replace them with even more tofu crumbles. Because while they last five days in the fridge (a meal prep miracle!), I always go through a batch before that time comes.Get the recipe:Spicy Tofu CrumblesTry this versatile protein-packed side/condiment/snack tossed into stir-fries, as a burrito filling, or folded into sautéed greens.View RecipeExplore Bon AppétitTofuWeeknightSpicyRead MorecookingThis Roasted Broccoli Recipe Indulges All My Food ObsessionsBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-15", "author": ["Condé Nast", "Sarah Jampel"]}