{"id": "10aa0f1d859d4e08b9339fa9ddbb8ac0", "url": "https://www.bonappetit.com/story/why-we-toast-our-bread-in-ghee", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "How to Use Ghee for Flavorful Toast and So Much More | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy We Toast Our Bread in GheeIt started with banana bread, but now we use ghee on everything from pancakes to long-fermented loaves.By Emily Fiffer and Heather Sperling May 6, 2019FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailEmily Fiffer and Heather Sperling are two editors-turned-restaurant-owners in L.A. We'll catch up with Emily and Heather regularly for stories, recipes, and dispatches from the front lines of Botanica, their women-led, vegetable-first kitchen.It all started with banana bread. After a whole lot of trial and error, we’d perfected a recipe that was gluten- and refined sugar-free, foolproof, and extremely delicious. Then we got cocky. If we could make it this good, surely it could be even better. We craved more texture, a whomp of flavor, a je ne sais quoi to give it an edge over all the other banana breads. The answer was ghee.We’d used ghee when cooking Indian food and respected its place in the Ayurvedic nutritional canon (it’s thought to improve digestion and aid absorption of nutrients, and is considered beneficial to all three doshas). But we never understood its versatility and flavor-amping powers until that fateful day when we ghee-toasted our quick bread. Since then, it has achieved staple status in our kitchens (at Botanica and in our homes).As a source of flavor, ghee is truly transformational: Deep and complex, it’s like butter on steroids. That’s not hyperbole because ghee is literally the essence of butter, the result of heating it gently until the milk solids separate and caramelize (closer to but not quite brown butter) and the water cooks off. After a strain, only the fat remains—and its high smoke point is ideal for achieving crispy surfaces while, in the case of the banana bread, leaving the interior pillowy and soft.Banana bread was our gateway drug; then we turned to long-fermented loaves. That’s how Tahini Toast was born: a thick slice of Bub & Grandma’s 30 percent rye bread seared in homemade ghee and topped with maple-orange tahini, berries, cinnamon-candied pecans, a sprinkle of Maldon, and a shower of maple syrup. It’s like French toast and PB&J had an intensely delicious lovechild—and the ghee is what makes the magic.Beyond toast (and Indian cooking, of course), we use ghee to fry eggs to crispy perfection and soft-scramble them (ghee + eggs = perfection). We melt it in a pan with brown mustard seeds and curry leaves and stir it into salted, lime-y yogurt. And don’t get us started on pancakes, from sweet multigrain to savory socca.Sure, we could use olive or coconut oil in most of these circumstances. We could also abstain from watching Game of Thrones and meditate instead. But we believe in indulgence, especially when it comes to food and fight scenes.Making your own ghee will pay off in spades: It’s shelf-stable so will keep for ages on your countertop, and it requires just one ingredient available at pretty much every grocery store in the continental US. If you’d rather buy a jar, we love Fourth & Heart and Ancient Organics. Once you have your magical golden elixir, we promise you won’t stop using it. Just look what happened to us.Explore Bon AppétitHealthyishGheeBotanicaToastRead MoreLifestyleThis Salsa Verde Is Our Desert-Island SauceBy Emily Fiffer and Heather Sperling Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-06", "author": ["Condé Nast", "Emily Fiffer", "Heather Sperling"]}