{"id": "10b0c8017ca24cb8b9098cb13ae10f3d", "url": "https://www.bonappetit.com/story/cult-neapolitan-una-pizza-nyc", "year": 2018.0, "month": 4.0, "day": 5.0, "content": "Una Pizza Napoletana Calls NYC Home... Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAfter Three Moves, A Cult Neapolitan Pizzeria Calls NYC HomeAnthony Mangieri, the chef of Una Pizza Napoletana and student of thin, charred Neapolitan pizza, never expected his restaurant to be a thing.By Anthony MangieriApril 30, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailFew chefs have the following that Anthony Mangieri has amassed with Una Pizza Napoletana. But with each textbook-perfect Neapolitan pie, thin, slightly soggy-bottomed pizzas with crackled, black bubbles and bumps on the crust, he’s gained new converts.And few chefs have moved—seemingly on a whim—like Mangieri has, closing up shop despite the consistent lines and long wait times. He's relocated the restaurant to an entirely different city with an entirely different audience, from coast to coast, sleepy beach town to well-established dining city.Now, after three openings under his belt, he unveils Una Pizza Napoletana 4.0 with Jeremiah Stone and Fabian von Hauske, the chef-owners of Contra and Wildair. They were regulars at Una Pizza Napoletana during its first run in New York in 2004 and were instrumental in bringing Mangieri back to the East Coast. Here, Mangieri plays back each opening (and reopening) of his beloved pizzeria. —Elyse InamineNo one cared when I first opened my bakery Sant Arsenio in Point Pleasant, New Jersey, in 1993. And no one cared when I opened Una Pizza Napoletana three years later. It was wintertime, and it was pretty desolate. Maybe five people came in. But I always wanted to do pizza; it was my real passion. My dad and I built out the restaurant together. We tiled everything, we built a pre-fab oven from Europe and installed it, we bought a bunch furniture and random things from stores close by. No restaurant equipment. No one knew who I was.I was 20. It was beyond my means. I had no car, and I would just borrow my mom’s. I baked, starting at 10 p.m. and ending at 2 p.m. the next day. If I made $75 in sales for the day, I’d be pumped. There were many, many years where I was making no money. But I believed in things so much at that point, thinking even if I got another job, someday I’m going to get this little pizzeria going.Then came the summer of 1996. Andrea Clurfeld, the local food section editor at Asbury Park Press who was a fan of my bread, wrote this long article about Una Pizza Napoletana, and it got a lot busier. We had no employees, so my dad had to take off from his construction and electrical work to help me serve and answer the phone. We’d argue in front of customers. Suddenly, we’d need six pizzas, and I would get so stressed. I was so used to making one pizza at a time—that’s the beauty of the way things used to be. But we made more money in a couple weeks than we’d ever seen. I was there for almost 10 years.Anthony Mangieri.\nAlex LauNear the end of those years, I started coming up to New York City on my days off to build a new home for Una Pizza Napoletana, in a long, narrow building on East 12th Street. It was the same deal: I built everything myself—tiled the floor, made the marble-plywood tables—except for the oven. (An older man in the south of Italy built that for me.) I didn’t expect we would be super busy. I just wanted to open in New York and show a larger audience what is the best pizza in the world. At the same time, Ed Levine of Serious Eats was working on a book about pizza. Clurfeld mentioned me to him, he came to Point Pleasant, and I ended up in the book as one of few pizzas he considered the best in the world.At Una Pizza Napoletana in Point Pleasant, it was never intense. There was never a line. So opening day [in New York] back in 2004, I was completely unprepared. Rob Patronite and Robin Raisfeld of New York magazine had called me to write about the restaurant, then every newspaper after that. I went from a sleepy little business to a big line outside that night. I had no employees, so I hired this Italian guy as a server and he ended up stealing everything I made the first night. It was nerve-wracking craziness. That huge line stayed like that on and off until the day we closed and left for San Francisco in 2009.I always knew I wanted to make it to the West Coast. That was in the back of my mind when I opened in the East Village. At that point, I felt like I was making the best pizza I could, I was the busiest I could possibly be, and there was nowhere else to go. I wasn't ready to grow in terms of another location or partners, and honestly I was burnt out. San Francisco was the first time I didn’t do everything by myself. I was trying to change, bike more, do something different.  The owner of an old garage in the SoMA neighborhood let me take a third of the space and offered a basic build-out. The people hired didn’t understand what I was about. It was a learning experience on how to manage emotionally when you’re not the one doing everything.During that year, building Una Pizza Napoletana, I was so out of the loop, but the opening took on a life of its own. So many people wrote about the place. It had such meaning to people. When we first opened in 2010, maybe a couple hundred people came through that night, including my priest. I always joked around with him and asked if there was such a thing as an ancient oven blessing. He did some research, and he found one. So when we opened the doors, and the priest goes in and decides to do a whole mass—with a 100 people waiting to eat. I hadn’t had enough time with the oven and the dough. (Dough is happy in a place where everything is weathered, so freshly tiled, freshly painted spaces don’t do it for the dough). The next few months, I’d come in to work the dough in the morning, leave for lunch, then return to see people waiting at noon for dinner when the doors opened at 5 p.m. It was insanity.The new Una Pizza.\nAlex LauThis will be my fourth build-out for Una Pizza Napoletana in New York’s Lower East Side. It’s been the least stressful, despite it being the most complicated. We have a designer who is incredible, taking ideas from my old place in San Francisco with the metal work and stuff from Jeremiah Stone and Fabian von Hauske. I haven’t done any physical work at all, more mental stuff.I’m nervous, obviously. I would say now that I’m more nervous to open Una Pizza Napoletana than I’ve ever been. I’ve been pretty cool with everything—I know how to make the tomato sauce, get the dough right, the oven, all that. But I know that it won’t be what I want it to be for a couple months, though I can’t get too negative with myself. The pizza is my main concern.I’m happy to be back in New York City. I’ve been spending more time in New Jersey with family and old friends, the reason why I returned back to the East Coast. At the first Una Pizza Napoletana, I slowly built regulars over years, people who loved it, believed it, supported it. They came every week. They became my friends. I’ve seen their kids become adults. Some of them even came to visit me in California, telling me that they’re so-and-so’s daughter. Another emailed me, asking me to invite all the old customers to stand up and eat like back in the day. Recently, I caught up with a dear friend who I haven’t seen in 8 years. We hugged and he said, “Now everything feels back to normal around here.” That is how I feel about everything. It feels like home, and it’s right.— As told to by Elyse InamineExplore Bon AppétitRestaurantsOpeningsPizzaRead Moreculture8 Styles of Regional Pizza to Know, Love, and CherishBy Arthur BovinorestaurantsAn Amtrak Crash Left Chef Eli Kulp Confined to a Wheelchair—But It Hasn't Kept Him from Running 4 RestaurantsBy Eli KulpRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-30", "author": ["Condé Nast", "Anthony Mangieri"]}