{"id": "10b26f79bcf57769a49cbdfda63723ef", "url": "https://www.bonappetit.com/story/vegan-butter", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "This Vegan Butter Melts, Spreads, and Tastes Like the Real Thing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Only Vegan Butter That Melts, Spreads, and Tastes Like the Real ThingIt's fermented with live cultures, and it's shockingly spreadable.By Kyle BeecheyApril 23, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI never ate much butter as a kid. I grew up in the 1990s, the low-fat decade, and the only fat source my mom allowed in our kitchen was a drizzle of olive oil when absolutely necessary. We had one vintage butter dish that would surface only when we had corn on the cob. So when I became a vegan ten years ago, I desperately missed yogurt, cream cheese, and just about any baked good, but never really butter. And it’s a good thing, because the plant-based alternatives have always skewed more toward “I Can’t Believe It’s Not Butter” than Bordier. Then I tried Miyoko’s.My gateway was the brand’s vegan cheese (their mozzarella is pretty uncanny), but I didn’t fall in love until I found the cultured butter at Whole Foods. Looking at the label, I liked that it didn’t have any weird colorants, gums or “flavors.” It was just a blend of coconut and sunflower oils, cashews, salt, and cultures. I threw it in my cart.First I added a pat to a perfectly roasted sweet potato. Then I used it to coat steamed broccoli. I slathered it on a slice of Fitness Bread. I sautéed mushrooms in it, then I went full-on fancy chef and browned it to top a shaved celeriac salad. The butter was going on/in/with everything, and I couldn’t get enough. EVOO and I went on hiatus.It's highly spreadable.\nPhoto by Alex LauI found that Miyoko’s works brilliantly with sweet foods, too, like on top of stacks of pancakes and inside homemade morning buns. I even use it to make a vegan buttercream, and it gives the frosting a slightly savory, cultured tang. Perhaps my favorite thing about Miyoko’s is that it doesn’t require a trip to a specialty grocer; you can get it at Trader Joe’s, Target, or online.It’s funny that I had to go vegan to discover a butter that I loved. My next move is to get my mom to try it, and I bet it will find its way onto her next slice of toast. Maybe she’ll even give it a home in that vintage butter dish.Buy it: Miyoko's European Style Cultured Vegan Butter, $6.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishShoppingVeganRead MoreLifestyleThis Vegan Egg Substitute Is So Good I Feel Guilty Eating ItBy Kyle BeecheyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-23", "author": ["Condé Nast", "Kyle Beechey"]}