{"id": "10b78a69253329e3e887a15a702eae80", "url": "https://www.bonappetit.com/story/diy-spice-blends-are-the-easiest-upgrade", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Like Garam Masala? These DIY Spice Blends Are the Easiest Upgrade | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLike Garam Masala? These DIY Spice Blends Are the Easiest UpgradeThere's a major difference between store-bought powdered spice blends and ones you make from scratch.By Priya KrishnaNovember 30, 2018FacebookTwitterEmailFacebookTwitterEmailI am going to let you in on a secret: Most of those bottled spice blends you are buying from your grocery store are nothing more than lightly fragranced sawdust, as far as I'm concerned. By the time that packaged garam masala or curry powder hits shelves, the spices in it are usually pretty old, and have lost much of their potency.Let me the first to admit that I have occasionally dabbled in bottled garam masala. A roommate once bought it to make a dish, and in a desperate weeknight cooking moment I grabbed it from the cupboard and dusted it atop a bland stir-fry that needed some oomph. But I knew the truth—that while bottled garam masala gets the job done in terms of adding some mild flavor to a dish, nothing holds a candle to a homemade spice mix. When you start with whole, freshly toasted spices, you are getting the most bang for your buck, flavor-wise. Your dishes will taste (and smell) infinitely more complex. They’ll have depth. Your guests will be all, YOU…cooked…THIS??? It’s amazing what whole spices can do.The thought of making your own spice blend may feel daunting. Trust me when I say: It is not that difficult! Spice blends are about as hard to make as a dip, which is to say you need only know how to lightly cook and combine a few things. You can make dip, can’t you?The other misnomer about spice blends is that they involve dozens of different ingredients. This is true about some spice blends, but not all. And not my mom’s spice blends. When she was a working mother of two who came home at 6 and had to have dinner on the table by 6:30, you can bet she was not concocting complicated combinations of spices. Instead, she had a few simple go-to combinations that each worked in different types of dishes.A general rule with all of these mixes is to always toast your spices on low heat (to prevent burning) just until they are fragrant. Blending can easily be done in a mortar and pestle, spice grinder (my parents swear by the Hamilton Beach coffee grinder for getting the job done), or, in a pinch, a Ziploc bag and the bottom of a whipped cream can (my go-to method in my tiny college apartment). That said, my mom occasionally prefers to keep some spices whole, for texture and more intense flavor (and hey, less work).Here are a few of my mom’s starter blends—three-ingredient combos that are easy to make and endlessly versatile. They'll turn you off the bottled stuff for good.Coriander, Cardamom, and CuminHow to make it: Toast 1 teaspoon cumin seeds, 2 teaspoons coriander seeds, and ½ teaspoon green cardamom pods in a small pan on low heat until fragrant. Transfer the spices to a spice grinder (or mortar and pestle) and blend into a powder.Use it on: potatoes, summer vegetables (zucchini, mushrooms, eggplant, and the like), as a dry rub for lamb or steakCinnamon, Cloves, and FenugreekHow to make it: Toast ½ teaspoon fenugreek seeds, ¼ teaspoon cloves, plus a ½-inch cinnamon stick in a small pan on low heat until fragrant. Transfer the spices to a spice grinder (or mortar and pestle) and blend into a powder.Use it on: Bean or meat stews, fall/winter vegetables (carrots, squash, potatoes, things like that), chicken, or anything else you might use bottled garam masala for.Coconut, Mustard Seeds, and Curry LeavesHow to make it: Toast 10-12 curry leaves, 1 teaspoon of mustard seeds, and 1 teaspoon of shredded, unsweetened coconut in a small pan on low heat until fragrant. Transfer the curry leaves and coconut to a spice grinder (or mortar and pestle) and blend into a powder. Combine with the toasted mustard seeds.Use it on: fish, lentils, tomato-based dishes, salad dressingsTry any of them on this sheet-pan chicken recipe and see for yourself!Sheet-Pan Garam Masala ChickenMarinating in spiced yogurt gets you a juicy and super-tender chicken every time.View RecipeExplore Bon AppétitCurryGaram MasalaSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Priya Krishna"]}