{"id": "10b8fdf5464a7036d157dca0a879ab11", "url": "https://www.bonappetit.com/recipe/dashi-steamed-egg-custard", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Dashi-Steamed Egg Custard Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueDashi-Steamed Egg CustardBy Sohui KimFebruary 14, 20194.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintThis pipping-hot savory egg custard is often served as a banchan at Korean barbecue restaurants and has a similar texture to Japanese chawan mushi. It’s often cooked in a traditional clay pot (called a ttukbaegi) but you can cook the eggs in any small heatproof bowl to get the same effect at home. Use the leftover mushroom dashi in place of the water in Kimchi Jjigae or Spicy Soft Tofu and Seafood Stew for extra flavor.Ingredients4 servingsVegan Dashi8dried shiitake mushrooms½white or yellow onion, thinly sliced5garlic cloves44x4\" pieces kombuSteamed Eggs2scallions5large eggsKosher saltCrushed toasted nori sheets (for serving)PreparationVegan DashiStep 1Bring mushrooms, onion, garlic, kombu, and 2 quarts water to a simmer in a large saucepan over medium-high heat. Cook, reducing heat as needed to maintain a simmer, 30 minutes.Step 2Strain dashi through a fine-mesh sieve into a large bowl (or an airtight container if not using right away) and let cool.Step 3Do Ahead: Dashi can be made 1 week ahead. Cover and chill.Steamed EggsStep 4Separate dark green tops from scallions; thinly slice both parts and set aside separately. Gently whisk eggs in a heatproof ceramic bowl that can hold at least 3 cups water (a pair of chopsticks are the ideal whisking tool since they fully incorporate the eggs without introducing too much air). Add ¾ cup cooled dashi and season with salt (you’ll need about ½ tsp. kosher salt, as the dashi is unseasoned). Stir in reserved scallion whites and pale green parts.Step 5Place bowl inside a large saucepan with a tight-fitting lid. Pour in water to come two-thirds up the sides of the bowl. Cover saucepan and set over medium-high heat. Bring water to a boil. Reduce heat and simmer until eggs are just set (they will still wobble slightly when gently wiggled), 18–25 minutes.Step 6Serve eggs topped with crushed nori and reserved scallion greens.How would you rate Dashi-Steamed Egg Custard?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleNeeds salt too, if not soy sauce and maybe sesame oil...just no flavor. Chawan mushi needs the bonito for the dashi, or there's got to be some flavor to this veg dashi. Thinly sliced in some of the cooked kombu and shiitake too.AnonymousBuffalo, NY3/4/2019Explore Bon AppétitCustardDessertKoreanEast AsianAsianShiitake MushroomMushroomVegetableEggSideStarterDairy-FreeGluten-FreeNut-FreeVegetarianKetoSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}