{"id": "10d485dce094eaee05dd7e3b95c07e9f", "url": "https://www.bonappetit.com/recipe/big-flavor-broccoli", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Broccoli With Onion and Parmesan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBig-Flavor BroccoliBy Chris MoroccoNovember 7, 20194.6(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintChances are you’re trimming off and discarding way too much of your broccoli stems. The stems are so flavorful, they should be their own vegetable. This is our hands-down favorite way to cook the whole plant. Ingredients4 servings1lb. broccoli (about 1 large or 2 medium heads)5Tbsp. extra-virgin olive oil, dividedKosher salt1small red onion, cut lengthwise into ½\"-thick slices4garlic cloves, sliced6oil-packed anchovy fillets1oz. Parmesan, finely grated (about ¼ cup)Lemon wedges (for serving)PreparationStep 1Preheat oven to 400°. Trim only the very bottom, woody part of broccoli stem. Peel tough outer layer from stem, from the florets down to the end of the stalk. Starting from stem end, cut broccoli at a 45° angle into ¾\"-thick slices until you reach the florets. Break florets apart with your hands into bite-size pieces (this avoids getting bitsy trimmings all over the place).Step 2Heat 3 Tbsp. oil in a large heatproof skillet over medium-high until shimmering. Add broccoli; season with salt. Cook, tossing occasionally, until broccoli is bright green and lightly charred, about 3 minutes. Transfer to a plate. Wipe out skillet.Step 3Heat remaining 2 Tbsp. oil in same skillet over medium. Cook onion and garlic, stirring often, until onion is beginning to soften, about 3 minutes. Add anchovies and cook, breaking apart with a spoon, until broken down and garlic is beginning to turn golden around the edges, about 2 minutes.Step 4Return broccoli to skillet and toss to coat with oil. Transfer to oven and roast, tossing once, until broccoli is browned and tender, 20–25 minutes. Wrap handle of skillet with a towel before you forget it’s REALLY HOT.Step 5Scatter Parmesan over hot broccoli. Divide among plates. Serve with lemon wedges alongside.How would you rate Big-Flavor Broccoli?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleAdded a splash of soy sauce, in lieu of anchovies - delicious! Anonymous12/15/2021Finding this recipe felt very serendipitous because I had a partial XL red onion, leftover anchovies, and a zested (but not juiced) lemon all in the fridge and then got broccoli in my CSA! So I got to use up things I had on hand before they went south and the recipe ended up being a huge hit with everyone and low stress to prep. I agree with the other reviewer that it turns out soft. That’s not necessarily a bad thing but if you don’t like that maybe just do the stovetop part as they suggested I think that would also be very good and the broccoli would be a little firmer. I don’t think it tastes at all like anchovies, which I’m not a fan of solo but love as a “secret ingredient” to add depth to recipes as it is here. BananaMartiniElkins Park, PA12/21/2020Not a fan of Anchovies, so replaced it with some diced pancetta and it tasted wonderful!KurtVancouver12/14/2020Amazing! My partner loved it too and even said \"this might be the best broccoli dish I ever had.\" Super easy to make, too.DonaSkopje, Macedonia12/3/2020I know BA is racist but this recipe do be slappin'. Burned my hand on the pan handle despite the fact they said don't forget it's hot. My fingers are in pain as I type this, every flex of my left ring finger is pure fire. Be careful out there kidsAnonymousAloe Vera10/22/2020This is our new favorite broccoli dish! It's so well balanced!AnonymousRedmond, WA6/11/2020Quite delicious, anchovies with broccoli is something I would have never thought of. Not a super big fan of fishiness, so I halved the amount of anchovies, and the umami still shone through. However, the additional step of putting the dish in the oven, as others have mentioned, makes the dish a little more effort than I think it's really worth. The broccoli turns out quite mushy (as you might expect), and I generally prefer my broccoli crunchy. I may try this again just on the stove-top to see if I can get the same flavors with less fuss and crunchier broccoli.atimidtempestSacramento, CA6/8/2020Different and great!  During this pandemic period looking to expand on the usual suspects (ie: steamed broccoli with pesto, roasted broccoli, etc.) this really hit on all levels.  Delicious and NOT fishy in our opinions.  Just filled with flavor.  ThnxmarnahoffmanRichboro, PA5/31/2020This gets a big thumbs up!  Not that much more work than plain steamed broccoli and absolutely delicious.  Served it with some grilled chicken, but honestly, it would be great as a meal in itself.AnonymousColorado5/29/2020Big-flavor broccoli lives up to its name. I see other people in the comments complaining about the fishiness of the anchovies, but in my opinion that's what makes this unique and absolutely delightful. I'm a vegetarian (with occasional lapses) due to health concerns, and that little bit of anchovy in there provides the saltiness that I crave all day long in addition to making the kitchen smell like heaven while it fries up. I might even do a little bit more anchovy the next time I make this, I'm that serious about it.heyguysitsmerobNorth Carolina5/22/2020VERY fishy if you add all the anchovies. I only added three and they still fished that boy right up. Also, the red onions got very sweet, i would recommend maybe blanching them instead of frying before putting in the oven.AnonymousOttawa5/12/2020I've made this recipe 3 times! I wasn't a fan of the time I made it with anchovies (too gritty!) But, the other two times I replaced the anchovies with a couple of tablepoons of fish sauce, and it is amazing. I love that burst of veggie, salty, and acidity that this combination brings. I paired it with some jasmine rice.valeriaanaMiami, FL4/29/2020Whoa...I've made this 4 times in the last month.  It's personal...my husband of 33 years has always really disliked broccoli, but I love it.  I sneaked this on the menu one night because...well, I'm the culinary boss.  He loved it!!  He really, really loved it!!  So did my kiddo.  When I then revealed that it contained anchovies they gave me a fearful, skeptical look, but then got passed it.  This recipe is a keeper!  Super flavorful and fresh.  Tones down the broccoli flavor in a very pleasing manner.  Tip:  I freeze left-behind anchovies, like I freeze my nuts, tomato paste and chilies-in-chipotle.  They keep forever and you always have that teaspoon-or-so that you need without the waste!Julianne6Tarzana, CA4/19/2020Really Really Good! I used 2 teaspoons of white miso instead of the anchovies, to impart some vegetarian umami flavour.AnonymousToronto4/6/2020A taste-machine! My husband and kids (under 8yrs) all gobbled it up. I didn't have red onions (Covid-19), so I used white, and the cooking+roasting made them so tender and sweet...the onions alone were worth the recipe.AnonymousUtah4/2/2020Explore Bon AppétitBroccoliVegetableAnchovyFishSeafoodFallSideGluten-FreeNut-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Chris Morocco"]}