{"id": "10da304e54771e332583cb564e3afc96", "url": "https://www.bonappetit.com/recipe/roasted-squash-salad-with-crispy-chickpeas", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Squash Salad With Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Squash Salad With Crispy ChickpeasBy Chris MoroccoDecember 26, 20194.7(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCrispy, creamy, chewy, bright, and about a dozen other wonderful (see?) adjectives apply to this easy dinner. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings1½lb. sweet potatoes (about 6 small or 3 medium), halved lengthwise1delicata squash, halved lengthwise, seeded, cut into 1\"–2\" pieces7Tbsp. extra-virgin olive oil, dividedKosher salt114.5-oz. can chickpeas, rinsed, drained1bunch scallions, white and pale green parts cut into 1\" pieces, dark green parts thinly sliced3Tbsp. unseasoned rice vinegar2Tbsp. toasted sesame seeds2Tbsp. white miso2tsp. soy saucePlain yogurt and Aleppo-style pepper (for serving)PreparationStep 1Preheat oven to 425°. Toss potatoes, squash, and 2 Tbsp. oil on a large rimmed baking sheet; season with salt. Arrange potatoes cut side down and roast until squash and potatoes are browned underneath and nearly tender, 25–30 minutes. Turn potatoes and squash, then add chickpeas, white and pale green scallion parts, and 1 Tbsp. oil to baking sheet. Shake pan well to coat chickpeas with oil. Continue to roast until chickpeas are crispy and vegetables are very tender, 10–12 minutes longer.Step 2Meanwhile, whisk vinegar, sesame seeds, miso, soy sauce, 1 Tbsp. water, and remaining ¼ cup oil in a medium bowl until smooth.Step 3Dollop yogurt onto plates. Top with vegetables, then drizzle with dressing. Sprinkle with Aleppo-style pepper and dark green scallion parts.How would you rate Roasted Squash Salad With Crispy Chickpeas?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangledidnt have miso so used tahini, this turned out wonderful. super easy too. cassseattle1/2/2022Even better the next day, after the vegetables soak up the dressing. But I admit: I misread the instructions and didn't put water or oil in the dressing.  (I'm not one of those people who thinks she knows better than a recipe writer. I was simply hungry, and didn't read carefully.) It was great. AnonymousNew York, NY12/3/2021I made this for thanksgiving dinner and we all loved it. It was easy, attractive, and interesting, but not so much so that it put off the traditionalists. \n\nThe chickpeas are hard to crisp, as noted. Dry them, then. Not too much oil, high heat separately. I added them as a topping. Also put a dash of fresh sesame oil and a pinch of pepper flakes in the dressing because it seems it needed a boost - excellent. Don’t skip the yogurt. Mia2Tucson11/26/2021This was so yummy! I made it vegan by using sour cashew cream instead if yogurt and it worked really well, used butternut squash and put the chickpeas in pretty early on to get them nice and crispy. All the elements on their own seem just okay but once you put it all together it's excellent. Highly recommend! Annie RVancouver, WA4/20/2021This recipe is a SLEEPER HIT. I used acorn squash instead of delicata and red onion instead of scallions. Had to use two full-sized sheet pans and a quarter sheet to fit it all. Put the chickpeas in 10 minutes earlier than the recipe says if you want them to get really crispy. Double the miso sesame sauce and use it on everythinggg. AnonymousBrooklyn, NY2/28/2021Yet another incredible Chris Morocco recipe. I made this with just the sweet potatoes and chickpeas (I didn't have squash handy) and it was absolutely delicious. I left the chickpeas in for longer to get them really crispy and I'm really happy I did. The miso dressing is absolutely delicious- wow. For a recipe so simple to make, this really has a high end restaurant feel. I can't wait to make this recipe again! Emily New York1/23/2021Slam dunk of a recipe! This hit all the right notes of savory, tangy, crunchy and a blast of umami from that dressing. Everything cooked perfectly at the intervals indicated in the recipe. My only regret is that I didn't double it! Actually, I will do twice as many sweet potatoes next time since the four of us fought over the remaining two halves after we'd each had one...delicious and very original recipe.AliWaldoboro, Maine1/8/2021Really easy, healthy, and delicious! I used half of a leftover butternut squash that I peeled and sliced. The squash and chickpeas weren't crispy, so I suspect I should've dried the chickpeas with a towel after draining, mixed them with oil in a separate bowl to make sure they were coated, and roasted everything longer. The dressing is crazy good, I might just start putting it on everything.AmandaBrooklyn, NY12/3/2020Good way to eat farm share veggies that aren't my fave! Though I used ricotta instead of yogurt, and acorn squash instead of Delicatta cuz that's what I had. it worked.emily12/2/2020So good, so easy, definitely a new favorite! Such a great blend of flavors and textures, and something that I, a novice cook, could make! Can’t wait to have it again 😍HanSeattle, WA11/22/2020This was so yummy, super satisfying and healthy to boot. I loved the combination of crunchy chickpeas and soft sweet potatoes.  AnonymousTrondheim, Norway10/28/2020It is rare to be surprised by a dish but this blew me away. Such a creative and delicious harmony of flavors. We ended up roasting two squash due to size and we used the long white sweet potatoes vs what appears to be pictured as smaller yams (who even knows the difference anymore, though) but that doesn't even matter because this is so. good. We took the squash out at 25 mins, used a separate baking sheet for the chickpeas, etc. Make this dish. Seriously. cbruettSalt Lake City, Utah10/12/2020I wasn’t very jazzed about this recipe, but then I got around to making it (mostly to use up some sweet potatoes) and it is the freaking bomb.com. I don’t even like sweet potatoes, but this salad is actually the perfect combination of flavors. Not too sweet at all. Might be my new favorite salad Carlyd731Philly 5/23/2020I happened to have a sweet potato and some green onions to use up and had everything else on hand so I decided to make this. But then I procrastinated actually making it for a few days because it just never quite sounded like the thing I wanted to eat for dinner. Let me tell you this is delicious! Healthy & filing & a really great combo of flavors. Seattle4/3/2020This was so delicious! Healthy and filling at the same time. I couldn’t get delicata squash at the store, so used kombucha instead and it worked beautifully. AnonymousDetroit3/11/2020Explore Bon AppétitSaladSquashVegetableChickpeaBeanSweet PotatoPotatoDelicata SquashYogurtOther IngredientsFallQuickEasyWeeknight MealsSheet-Pan DinnersSideMainVegetarianNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Chris Morocco"]}