{"id": "10e21ab334c6a3e55ecac016fded64e8", "url": "https://www.bonappetit.com/recipe/pasta-with-lentils-and-mushrooms", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Pasta With Lentils and Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssuePasta With Lentils and MushroomsBy Sarah JampelFebruary 9, 20213.9(132)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'Myrtrek BrownEmailPinterestPrintEmailPinterestPrintWhy boil pasta then toss it with sauce when you could cook it directly in the sauce? This is the question we’ve been asking ourselves ever since Basically editor Sarah Jampel’s genius vegetarian pasta dish entered our lives. Lentils, browned mushrooms, tomato paste, and other friends get a head start before pasta joins the party; as the noodles cook, they absorb the tomato-rich broth while releasing the starches that eventually form a creamy sauce. Depending on the power of your burner, you might find that your liquid is evaporating before your noodles are al dente. If this happens, just add very hot water to the pot, about ½ cup at a time, until the pasta is cooked. If you're craving acid, you can deglaze the vegetables with red wine or add a splash of red wine vinegar or a squeeze of lemon juice at the end.Ingredients4 servings¼cup olive oil1medium onion, finely chopped8oz. crimini mushrooms, stems trimmed, chopped into ¼\" pieces1tsp. kosher salt, plus more2garlic cloves, coarsely chopped1cup brown lentils, rinsed¼cup double-concentrated tomato paste½tsp. crushed red pepper flakes10oz. orecchiette or conchiglie1½oz. Parmesan, finely grated (about ½ cup), plus more for serving3Tbsp. unsalted butter, cut into pieces½cup coarsely chopped parsley, plus more for servingPreparationStep 1Heat oil in a large Dutch oven or other heavy pot over medium. Add onion and mushrooms and cook, stirring occasionally, until mushrooms are deeply browned and really starting to stick to bottom of pot, 12–14 minutes. Season lightly with salt.Step 2Add garlic, lentils, tomato paste, and red pepper flakes and cook, stirring often, until tomato paste darkens slightly and lentils are coated, about 2 minutes. Add 6 cups water and bring to a boil. Reduce heat and simmer gently until lentils are tender but still have some bite, 10–12 minutes.Step 3Add pasta and 1 tsp. salt to pot. Increase heat and bring to a boil. Reduce heat and simmer, stirring often (especially as the liquid starts to reduce toward the end) and adding very hot water by ½ cupfuls as needed if liquid is reducing too fast, until pasta is cooked through and liquid is reduced, 10–14 minutes.Step 4Remove pot from heat and stir in Parmesan, butter, and ½ cup parsley. Taste and season with more salt if needed.Step 5Divide among bowls and top with more Parmesan and parsley.How would you rate Pasta With Lentils and Mushrooms?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangleSo this definitely didn't look like the photo! It was tasty and good winter comfort food, but more like a stewy mac and cheese than what the photo depicts. I'm glad deglazed the veggies with 1/4 cup of red wine, because this definitely needed an acid. I also used slightly larger pasta, gemelli, and that was fine. I would definitely double the tomato paste at the beginning, and, since I'm not vegetarian, add a few anchovies to the onions at the beginning. I have lots of leftovers, which I anticipate will taste better than the first meal last night, and I'm planning on stirring in some canned diced tomato to achieve more tomato flavor.  MegWashington, DC2/1/2022Although this recipe didn’t blow me away by any means I think it is worth leaving a review because it is so easy, versatile, and healthy! If you’re looking for a cheap weeknight meal this is the perfect dish. I subbed vegan alternatives for the cheese and butter and finished it off with some red wine vinegar. Finished in about 30 minutes and so satisfying!Malia LMinneapolis, MN1/10/2022I went to Sicily three years ago and had an amazing pasta and lentils dish. Not quite a soup but not quite a sauce but hearty and so tasty. Since I got home, I’ve been searching for a recipe to get close to what I had in Palermo but to no avail. This dish was a sweet surprise - the closest thing I have found yet, especially in its consistency. I made a couple of little tweaks as I went along - I free-handed the water (it definitely wasn’t six cups) and used broken spaghetti as the pasta. The pasta should be as small as possible to blend in with the lentils. \n\nIn Sicily and Naples, pasta and lentils is ‘peasant’s food’ so the simpler the ingredients the better. I was dubious about putting butter in to the sauce but it did add a richness that really lifted the dish. I used standard canned brown lentils and they worked really well, as well as some veg stock powder. I’ll be making this again - a simple one pot dish that is minimal prep and maximum taste. Jenna NBirmingham, UK. 11/15/2021This dish is OK, but is too fussy to be a regular meal. \n\nI read the reviews and made adjustments — extra tomato paste, extra garlic, less broth (though I ended up needing to add quite a lot of water at the end).\n\nAdding lemon at the end helped to deglaze the bottom of the pan and get up some of the tastiest bits of the sauce. I wish I'd cooked the mushrooms a little longer. All-in-all, not awful, but also not good enough to inspire a repeat.Tired MomWashington, D.C.10/18/2021Yum! Intrigued by the absence of whole tomatoes, the presence of lentils, and loving both mushrooms and pasta, I gave this a go. A few adjustments were made including adding thyme, and oregano, double the garlic, 1/2 tsp Roasted Garlic Bouillon (Better than Bouillon) in lieu of any other salt, double the mushrooms, sprouted green lentils (in lieu of brown), and 2 dollops of cottage cheese at the end (stir through well and let it get melty, it will disappear). The result was a gravy-ish sauce that complemented the spelt orecchiete lovingly leaving a rich flavour and filling meal. Served with crudités. Quick, delicious, and nutritious!Juanita TCalgary AB8/3/2021So I picked this recipe based on the photo and only read the reviews right before I was going to make it. Based on the reviews, I made a number of adjustments (so not sure if this is considered following the recipe). In addition to the mushrooms and onions, I added some chopped up tomato and bell pepper. Then when I was adding the lentils, in addition to the crushed red pepper, I added some oregano, basil, crushed rosemary and a little garlic powder (because I like things garlic-y). I added 3 cups broth + 2 cup waters (I reduced the liquid due to the extra liquid from the tomatoes). Finally, I ended up doubling the concentrated tomato paste because on taste-testing it after adding the pasta, it didn't have enough tomato flavour. It looks absolutely nothing like the photo but overall it's tasty.AllyToronto, Ontario6/13/2021Changed the recipe due to the suggestions from the reviews. Added 2x garlic, more tomato paste (we didn’t have double concentrated paste) and used broth instead of water! Also added the lemon on top! We enjoyed it! It was paired nicely with a light mixed greens salad. AnonymousVancouver, Canada5/12/2021Grey, flavorless dinner that we reluctantly ate became leftovers that everyone avoided. Became trash.AnonymousProvidence, RI4/25/2021Absolutely awful. Looked like sewage. Tasted bland and sad. Had the mouth feel of a porridge from a Victorian orphanage. Jane from MosierMosier, Oregon 4/16/2021Do not waste your time or mushrooms on this. Followed the recipe precisely and ended up with an enormous pan of tasteless pasta. I mean, this had as much taste as if I'd just boiled the pasta and lentils in plain water. It took copious amounts of lemon juice to create any flavor at all. What a waste of an hour. Jeffery CColumbus, Ohio4/16/2021This is super easy and incredibly delicious. I wasn't in the mood for lentils last night so I reduced the amount of water. I halved the recipe because I'm cooking for 1 (+leftovers)...this also means that I made up my own measurements and followed with my senses! The sauce was creamy, the pasta cooked perfectly and the mushrooms were divine (although next time I'll add more). All in all, I highly recommend for a simple week night dinner (especially on a rainy night).College student by day, chef by night 4/15/2021We loved this! I followed the recipe as printed in the magazine and came here to share it with a friend. As others said, I'm glad I didn't read the reviews first. It did take the whole 14-15 minutes for the pasta to cook and sauce to thicken but it came out great and was not at all mushy. I think using broth and lemon next time will make it even better. (The sauce was not at all the brilliant red in the photo - I don't know how it possibly could be after cooking with the mushrooms.)jcz3/25/2021Simple, straightforward recipe but I wasn't blown away by the flavor. You get what you put into it I guess. Definitely great for an easy, quick weeknight dinner though. I added some cumin which certainly added to the flavor.meghanHouston, TX3/21/2021Having made this per the written recipe I agree with the previous reviews—next time I’ll start with less water, will consider using broth instead,  and will add some lemon juice at the end (a tip that was NOT mentioned in the version printed in the magazine). The bright red color of the sauce in the photo does not match the result I got.AnneSacramento, CA3/18/2021My wife and I really enjoyed it and I'm glad I didn't read the reviews beforehand. I don't understand the complaints. I followed the recipe exactly, except for using thyme instead of parsley. The times for each step worked out perfectly. I used the specified amount of water and the pasta was perfectly done - no mush at all. I'll definitely be making this recipe again and it took little preparation unlike what others claimed!Larry L.3/18/2021Explore Bon AppétitPastaItalianEuropeanMushroomVegetableOrecchiettePasta & NoodlesBrown LentilLentilFallWinterWeeknight MealsOne-Pot MealsEasyMainVegetarianNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Sarah Jampel"]}