{"id": "110abd18127e338e0facf751498b0aa2", "url": "https://www.bonappetit.com/story/how-to-wash-restaurant-ceramics", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "How Restaurants Wash $1000 Ceramics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow to Wash $1,000 PlatesThe near-crazy lengths restaurants go to protect their expensive ceramic dishes. Don’t drop them!By Priya KrishnaSeptember 5, 2018FacebookTwitterEmailPhoto by Diane KangFacebookTwitterEmailYou may have noticed that many high-end restaurants are upping the ante on their dishware. Gone are the generic, stackable white plates; and in their place are $1,000 Japanese lacquered bowls and one-of-a-kind ceramic pots from Mexico.But…[Carrie Bradshaw voice] one can’t help but wonder: What happens when they drop one?! The reason that restaurants used those homogeneous dishes for so long is that they make for the easiest, speediest service and cleanup. So how do you run a restaurant when you’re working with serving spoons that cost more than your most expensive bottle of wine?It starts with making sure the staff knows what they are handling. At the picturesque tasting menu restaurant, SingleThread, in Healdsburg, California, every guest interacts with over 30 unique pieces of dishware, made by artisans around the world using materials like lacquer, wood, and clay. Employees memorize details about each glass, dish, vase, and utensil—some of which cost into the thousands of dollars. “They can tell you who made it and where it’s from, and they know that everything is irreplaceable,” chef Kyle Connaughton says.Please don’t break the ceramics at SingleThread.\nPhoto by Eric WolfingerEllia Park, the co-owner and manager of the Korean fine-dining spot, Atomix, sources the dishes for the restaurant largely from Korean artists; these include beauties like a perfectly smooth black ceramic bowl with glossy jagged edges, or a speckled jade bowl into which dollops of fresh cheese and caviar are placed. Park estimates that the total value of all the dishware in the 14-person restaurant is close to $50,000. She allows servers to carry out only one dish at a time, “and with two hands,” she adds. If two plates are required for one course, trays are used, no exceptions. The first time Atomix server Vivian Choi had to handle a dish, “I didn’t know what to do with it,” she says. “I was so nervous.”Then there’s the cleaning. The heavy handmade plates Claudette Zepeda-Wilkins, chef of El Jardín in San Diego, purchased in Oaxaca and Guadalajara for the restaurant are dishwasher-safe and “destroy-proof,” she said. “I feel really bad for the waiters because they are so heavy when you put the food on them,” she added, “but they are durable.” She also had the handles removed off of the mugs (“That’s the first thing that breaks on ceramics”), and her plates are all flat (so they don’t have an edge that’s easy to chip in the dishwasher).At Atomix, Park says that each of the 100 dishes the restaurant goes through on a given night is handwashed (with regular ol’ soap, surprisingly), immediately dried, inspected for food particles or damage, and then wiped again and reinspected before being reused. Some of the serving spoons at the restaurant are made with Korean copper, which can gradually change color when exposed to water. Those get wiped down multiple times, and once a week they are rubbed with a special cream that prevents the color from fading.Use both hands! At Atomix, cards detailing each course also come with information about the ceramist who made the dish.\nPhoto by Evan SungIf you think that’s intense, Connaughton literally built a custom dish-cleaning system around SingleThread’s specific needs. This involves two stations where dishes are individually sorted and washed by four dishwashers, and every washing surface is covered with silicone material “so that nothing ever touches metal or a hard surface,” Connaughton says. The dishes get dried with microfiber towels, and when they are put back on the shelf, there are felt liners placed between each of them.“For a restaurant that has 50 guests a night, to have four dishwashers working is not the norm,” Connaughton says. “But that’s what it takes to take care of all of that.”Even with these meticulous systems in place, every chef admitted that breakages are still common. At SingleThread, Connaughton estimates that at least one dish breaks per week.His team uses an ancient Japanese technique called kintsugi for doing repairs, which means filling the damaged area with melted gold. The idea, he says, is to show “the beauty of the repair.”Park usually ships damaged dishware back to the artists for fixing. Broken serveware poses a bigger challenge to Atomix, as the restaurant has only between 15 and 20 copies of each dish, and seatings are 14 people each. “If someone broke two plates, we would have to change the plates for the whole course,” she says.At El Jardín, even those heavy-duty dishes get chipped from time to time. Zepeda-Wilkins uses the maimed plates for family meal. “I make my employees eat off chipped plates so they look at them every day,” she says with a chuckle. “It is our joke.”Shibumi, the L.A. sushi restaurant known for its Japanese ceramics, has rubber floors in its kitchen, so that if a piece drops, it doesn’t break. The rubber was significantly more expensive than tile, chef David Schlosser says, “but I knew we had to make the investment because of the ceramics. I can’t tell you how many pieces drop on the floor and don’t break.”To sum up: These fancy dishes are pricey, hard to maintain, and require custom cleaning equipment, sometimes even specialized flooring. Are they really worth it?Park, and the others, are unequivocal. “It’s risky, definitely,” she says, but the dishware “is a symbol of respect toward the chef’s cuisine and his efforts. It is part of the cuisine itself. It’s worth it.”Inside Nonesuch, our No. 1 Best New Restaurant, where art and food intertwine:Explore Bon AppétitEntertaining + StyleRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-05", "author": ["Condé Nast", "Priya Krishna"]}