{"id": "110cbe89cad1562da9aea6bddc61e490", "url": "https://www.bonappetit.com/story/how-to-source-saffron", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "What to Know Before Buying Saffron | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat to Know Before Buying SaffronMost of the world's saffron is grown in Iran, but the rest of the story is not so straightforward.By MacKenzie Chung FeganJuly 26, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailNote: When we originally published this article, though we mentioned that the majority of the world’s saffron is grown in Iran, we did not spend enough time discussing the harmful U.S. sanctions that directly impact Iranian farmers who want to sell their products on the global market—as well as millions of other Iranians. Our focus was on highlighting how saffron grown in Afghanistan offers opportunities for farmers and processors there, and we realize that in doing so, we inadvertently delegitimized Iranian saffron.Iran produces over 90% of the world's saffron supply, but we cannot run a companion piece about our favorite saffron from Iran because the sanctions imposed by the U.S. government make it nearly impossible for Americans to legally purchase saffron from Iran that’s clearly labeled as such. Saffron has been a vital part of Persian cuisine and culture for millennia; the quality of saffron from Iran is not up for debate. We look forward to the day when we can make recommendations about our favorite Iranian saffron brands.We have amended the following article to give more context surrounding the effect of U.S. sanctions on Iranian saffron and of U.S. military occupation on people living on both sides of the Iran-Afghanistan border. We have changed the headline and focused our product recommendations to reflect this.Saffron comes from a particularly lovely purple crocus that blooms in the fall and grows close to the ground. The crocus’ stigma and the style—which, if you’ve retained your eighth grade biology, you know are part of the female reproductive system of the flower—are a brilliant crimson. When dried, they impart a complex, musky, honeyed flavor and bold yellow hue to dishes like tachin, biryani, risotto Milanese, shrikhand, and Lussebullar.While some spices are expensive because they only grow in specific climates—vanilla beans, for example, only thrive within 10 to 20 degrees of the equator—saffron crocuses aren’t a particularly finicky crop. Instead, saffron’s high price can be attributed to the extremely labor intensive nature of harvesting and processing. The flowers must be harvested by hand before dawn, and the stigmas must be carefully plucked from the blossoms, each of which harbors only three threads. A single pound of saffron is made up of seventy thousand flowers.Photo by Alex LauSaffron is cultivated in the United States—you can even grow your own!—but the majority is from regions where saffron is part of the culinary tradition and labor is inexpensive, like Kashmir, Afghanistan, and Iran. Iran is by far the world’s largest producer, but for decades the country has suffered under economic sanctions. While previous versions of those sanctions by the U.S. government authorized the importation of products from Iran with cultural value, like Persian rugs and food, the current regulations make no such exemption. If Iranian saffron farmers want to reach American markets, they must rely on middlemen to funnel their crop through other countries, and often saffron labeled as Spanish or Moroccan is actually of Iranian origin. (According to the Spanish farmer’s union, only one percent of Spanish saffron is actually grown in Spain.)Many Iranian Americans maintain a personal supply of Iranian saffron either from their own travels or through friends and family. “Although you can’t import saffron for sale in the United State, there is a statutory exemption that allows you to bring saffron back from Iran when you travel there for personal use,” says Shahrzad Noorbaloochi, a lawyer who specializes in trade and commerce law. But like sanctions regulations in general, even the laws governing gifts and goods for personal use are intentionally murky and vague in order to achieve over-compliance.If you don’t have a personal hook-up, it is possible, if not strictly legal, to find it in the United States. You can look in Persian grocery stores (look for deep red threads labeled “negin” or “super negin” that you might even be able to smell through the packaging) or seek out options online. Recommending a particular brand or website or store here, however, could put them at risk. “Currently in the U.S., you cannot import food that originates from Iran, and that includes obtaining it from a third party country,” says Erich Ferrari, a sanctions lawyer who is the former president of the Iranian American Bar Association. “The government is not going to go after everybody, but calling out a particular company could expose them to danger.”The stated goal of the sanctions against Iran may be to inflict pain upon the government, but in practice, it is average Iranian citizens—like the producers of goods like saffron and pistachios and Persian rugs—who bear the burden. “Say you’re a small farmer and you want to sell to India,” explains Negar Mortazavi, a journalist and political commentator. “You need to ship it, you need insurance, you need a payment to a bank. If any of those steps touch a U.S. company or financial institution, it’s banned.” Sanctions against saffron benefit neither American consumers nor farmers in Iran, and restrictions on products so intertwined with cultural identity impact far more than the economy alone. “Consider the psychological consequences,” says Mortazavi. “It comes to a point where it feels like your identity is being censored.”Iranian saffron is grown in the Eastern part of the country, particularly Khorasan Razavi Province, and this growing region straddles the border with Afghanistan. While it is with regret that we cannot recommend a specific Iranian saffron company without potentially endangering the individuals behind it, we can point to an Afghan-owned brand operating just across the border in Western Afghanistan. The saffron industry presents opportunities in a country that has endured decades of conflict, including 20 years of war led by U.S. forces. Afghanistan has an estimated 2 million widows, largely as a result of that war, and although the work is seasonal and painstaking, processing saffron is traditionally one of the few jobs available to women with limited formal education.Twenty-seven-year-old Mohammad Salehi grew up in Herat Province in a family that farmed wheat, potatoes, and saffron. For three and a half years he served as a translator for the U.S. Army, but after he and his family received repeated death threats from the Taliban, Salehi sought asylum in the United States. He found it difficult to find work. “As an immigrant who speaks English as a second language, people sometimes think you’re not smart,” says Salehi. “So I decided to start my own business and tell my own story. I want people to know that there’s more to my country than war.”Heray Spice imports saffron from a cooperative of 25 farming families from two villages in Herat Province. Salehi knows them all personally, and his company pays on average $400-$500 more per kilo than local traders. He also invests a portion of Heray’s profits in local education. “When I was a boy, every year my family would put half of the income from their saffron crop towards my education,” says Salehi. “I want to help the children of farmers who otherwise wouldn’t be able to afford to go to school.”Explore Bon AppétitSaffronRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-26", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}