{"id": "1114d6000f88bb1fb0020724f2212732", "url": "https://www.bonappetit.com/story/wellness-brands-training", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Many Wellness Brands Are Failing to Train the Influencers They Hire | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMany Wellness Brands Are Failing to Train the Influencers They HireMisinformation and lack of oversight have created a Wild West of influencer marketing.By Flora TsapovskyOctober 2, 2019FacebookTwitterEmailIllustration by Annalee SoskinFacebookTwitterEmailThe other day, I watched a glowing YouTube influencer opine about the benefits of grass-fed dairy products. She used the phrase “research shows” and had perfect skin and a flat belly, but there was no real information in her video: She simply told her 500,000-plus viewers that grass-fed dairy is “better for you” then recommended some superfood smoothie packs. Below the video, numerous commenters recommended turmeric for bloating and debated the benefits of raw vegetables. When I finally clicked away, I felt anything but informed, but I did feel like I’d just watched an ad.Influencers have a more powerful role in advertising than ever before. According to Business Insider, “brands are set to spend up to $15 billion on influencer marketing by 2022, based on Mediakix data,” a number that’s been steadily climbing. Most influencers earn money via affiliate commissions, meaning they get a small percentage of sales made whenever a customer buys via the influencer’s unique link or code. And while federal and state-level regulations prohibit businesses from making false claims in advertising, these regulations largely don’t apply to influencers, and numerous recent scandals have brands, consumers, and government agencies clamoring for change.In 2015, Australian wellness guru Belle Gibson was skewered by the press for claiming to cure multiple cancers with natural remedies. Gibson was also fined in 2017 by an Australian court for fraudulently claiming to donate proceeds from her wellness app to charity. Last year, Florida fitness influencer Michelle Lewin came under fire for posting an Instagram story with Base Carbs Crush pills, appetite suppressants and “carb blockers,” which she has business ties to. Lewin was called out by fans and nutritionists for promoting a product that makes unrealistic and potentially dangerous claims. This spring, a feud between influencer James Charles and make-up artist Tati Westbrook put SugarBearHair vitamins and supplements into the spotlight, bringing further scrutiny to the product. Several clinicians and labs had already accused the brand of making exaggerated health claims and framed the influencers—including Kylie Jenner and Kim Kardashian—in a negative light.There’s been very little research into the scope of the problem. In the U.K., an April study by the University of Glasgow surveyed the blogs and feeds of nine popular weight-management influencers and concluded that only one of them had provided readers with credible information.While federal and state-level regulations prohibit businesses from making false claims in advertising, these regulations largely don’t apply to influencers.In June, U.S. Senator Richard Blumenthal went after the detox tea industry, requesting that the Federal Trade Commission investigate brands like Flat Tummy Co. and Lyfe Tea that use influencer marketing from the Kardashians and others to spread potentially false claims. While it lacks the power to punish offenders, the FTC can set regulations, conduct legal investigations, and recommend that the U.S. Department of Justice take legal action against a business if it finds it to be in violation. Influencers, however, are largely immune to this threat. In 2017, the FTC sent emails to over 90 influencers stressing the importance of disclosing sponsored posts and advocating for full disclosure by adding the hashtag #ad and declaring that the content has been sponsored or paid for. While making a minor splash in the media, the move did very little to change influencer practices.When companies are looking for influencers to promote their products, they’re seeking someone who’s “on-brand,” not necessarily someone who’s knowledgeable about the product. Erin Fong, a letterpress artist from Oakland with a loyal 63K Instagram following, was recently approached by a company specializing in cannabis gift boxes. “I was surprised that they reached out to me as I am not necessarily in the cannabis or wellness realm,” she said. “There wasn't a pre-check of knowledge of the products beforehand, but they did share specific guidelines on how to speak about the products, and they do require new influencers to submit photos and captions for review to ensure that our content and language aligns with theirs,” she says. Fong’s experience exemplifies how many brands operate. “I don't think there had to be a level of knowledge about the product beforehand,” she said. “The review was just based on trying products and speaking to that.”In response, some brands are taking action. “If it’s not the platform that’s going to change, the job is ours to change things,” says Ara Katz, co-founder and co-CEO of Seed, a line of prebiotic/probiotic capsules that launched in June 2018. This summer, Seed announced it was rolling out Seed University, a one-hour course, complete with a final exam, that all potential influencers must take before they can access affiliate links. Questions include “What percentage of our body is microbial?” and “What is the scientific definition of a probiotic?” Fittingly, the course is offered through Seed’s Instagram stories. “Most [information] is spread on social media, which is oriented toward engagement and not trustworthy information,” says Katz. “We’re trying to make sure that those who are making money [by selling Seed’s products via affiliate links] will be accountable and transparent.”When companies are looking for influencers to promote their products, they’re seeking someone who’s “on-brand,” not necessarily someone who’s knowledgeable about the product.Care/of,  a vitamin and supplement brand, has influencers fill out the same personal quiz as potential customers, supplemented by educational materials, before they receive their free recommended vitamin regimen. Among them, you’ll find practical questions like “Do you have a history of heart disease” and “Are you concerned about urinary tract health?” alongside philosophical-ish ones like “For traditional Eastern medicines like Ayurveda, you are a believer, open or skeptical?” Craig Elbert, co-founder and CEO, said, “It's incredibly important to ensure influencers who partner with our brand understand Care/of is a personalized wellness plan, unique to their goals, habits, and lifestyle. Influencers are also sent a hefty amount of extra reading material that regular consumers don’t receive, and they’re granted access to the brand’s staff nutritionists, medical director, and scientific advisory board.Katey Yurko, founder of the wellness and lifestyle website The Violet Fog, which promotes brands like TruSelf Organics and Olly vitamins, says she’d be happy to be vetted more vigorously. “I would like it if more brands and organizations had more requirements because it would make bloggers do the research, which they should be doing anyway,” she said. Yurko, calls herself an “avid researcher” whether she’s posting for affiliate revenue or not, but she recalls only one brand, the year-old Dear Brightly retinoid prescription service that vetted her via a rigorous phone interview. “We really want to make sure we’re working with someone who will be using the brand continuously and would want to educate the consumer,” says Lydia Nguyen, manager of Dear Brightly’s Partnerships and Operations. Nguyen says that both she and a dermatologist consultant review all influencer content to make sure the information is correct.Yurko accepted the partnership but had declined others in the past: “I would not even mention a skincare brand unless I used them for at least three months, and a lot of brands won’t be okay with it because they want content right away.”While some brands are starting to treat their relationship with influencers more responsibly, this is hardly the norm. Two years ago in the U.K., former health writer and communications consultant Sarah Greenidge founded WellSpoken, an organization dedicated to transparency and education among brands, influencers, and consumers. Greenidge started WellSpoken because she saw how lawless wellness content had become online compared with the strict regulations placed on health and medical brands.Earlier this year,Wellspoken launched an international initiative called The Register of Health & Wellness Influencers, which aims to vet brand ambassadors, connect brands with appropriate influencers, and raise the bar on influencer education. According to the Register’s website, the introductory annual fee to join is $120, and influencers will need to provide professional documentation like a degree or certification and undergo an online training course. Greenidge hopes that, in the near future, more brands will look to the register to find influencers to partner with. Greenidge is also working to get “health and wellness influencers” registered as a legally binding term in the U.K. and other countries so that, unless someone registers with her organization, they cannot be paid for sharing health and wellness content on behalf of a brand.Eight out of 11 wellness brands I approached for this article said that they don’t test influencers on their knowledge of the products. But Seed’s strategy may be a bellwether for other brands moving forward. “We know that change on the platforms is happening slowly, so we decided to look to the next person: the influencer,” says Katz. “We designed something to enforce and inject education, and built it in the very same place where misinformation is spread.”Explore Bon AppétitHealthyishTrendsessayRead MoreLifestyleThe One Thing I Hate About Being a Wellness InfluencerBy Kathryn BudigRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-02", "author": ["Condé Nast", "Flora Tsapovsky"]}