{"id": "11173d24e6aa73db99448f0223754346", "url": "https://www.bonappetit.com/story/nick-and-nora-cocktail-glasses", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "These Are the Only Cocktail Glasses I Want to Drink From | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Are the Only Cocktail Glasses I Want to Drink FromKeep it small. Keep it cold. Keep it classy.By Adam RapoportApril 2, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors' favorite things to eat, drink, and buy.I’ll never mix a cocktail as deftly as they do at New York’s Le Coucou or a L.A.’s Majordomo. But I can cop their barware, particularly the Nick and Nora glass. At just five ounces, it’s far more sensible than one of those oversize martini troughs you get at the club—because, really, when you’re drinking a cocktail served up, you don’t want it edging into that lukewarm territory when you’re only halfway finished. Keep it small, keep it cold. You learn that in 10th-grade physics class, right? Oh, and perhaps most important is the glass’s provenance. It’s named for the boozy, quick-talking couple in Dashiel Hamett’s 1934 novel The Thin Man. They’re the couple we all want to be, always dressed for a night out, always with a quip at the ready, and always—always—with a drink in hand. Their namesake glass appropriately honors their art deco–era swag. With its swank gold trim and curved silhouette, it makes you feel all classy—even if you don’t know how to mix a Manhattan.Buy It: Nick and Nora glasses, $42 for six at food52.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendCocktailShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Adam Rapoport"]}