{"id": "113b8d071eb272df7e4c8d5663a07a9a", "url": "https://www.bonappetit.com/story/dishes-that-let-you-experience-local-without-leaving-your-hotel", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Dishes That Let You Experience Local Without Leaving Your Hotel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredDishes That Let You Experience Local Without Leaving Your HotelBy Andaz Hotels and ResortsOctober 31, 2018FacebookTwitterEmailChef Sander brings an artful sense of humor to the food at Bluespoon Restaurant & Bar in Andaz Amsterdam Prinsengracht. Pictured here is Sander's Pigeon, a dish inspired by his cycle to work one morning.FacebookTwitterEmailChef Sander brings an artful sense of humor to the food at Bluespoon Restaurant & Bar in Andaz Amsterdam Prinsengracht. Pictured here is Sander's Pigeon, a dish inspired by his cycle to work one morning.\nAndaz hotels opened its first property at London Liverpool Street in the 2000s, in a building built in 1884. The impetus: host guests with a kind of authenticity that can’t be fabricated. Now, with nearly 20 locations across the globe, each property lives by this rule, giving guests immersive experiences through exceptional dining, locally inspired interiors and art installations, and unparalleled hospitality. Andaz hotels and resorts want you to be enveloped in the senses of the eclectic culture from each neighborhood the moment you arrive. One of the best ways to arrive a tourist and depart a local? Eat the food. Chefs and mixologists eager to excite the palates and minds of guests in unexpected ways have put modern, inventive spins on classic dishes. Taste the culinary specialties and experience the flavor of each city. No doubt you’ll leave more inspired than when you arrived.Executive chef Shaun Keenan borrows from the Japanese practice of using a yukimuro to create his signature dish at Andaz Tokyo Toranomon Hills—a snow-aged chateaubriand.\nENJOY A SNOW-AGED STEAK IN TOKYOThe drinking and dining experiences at every Andaz hotel destination provide an innovative approach to restaurants and bars that are deeply rooted in the community. The Tavern - Grill & Lounge at Andaz Tokyo Toranomon Hills, where culture and tradition meet innovation, is no exception. One of Executive chef Shaun Keenan’s signature dishes, snow-aged beef and potatoes, borrows from the Japanese practice of using a yukimuro, a traditional snow cellar found in the snowy regions of Japan, to preserve and mature ingredients in natural refrigeration. Chef Keenan ages meat for The Tavern in Niigata, just over 200 miles from Tokyo. Stored at a stable temperature of 1 to 2 degrees Celsius with humidity over 95%, meat is rendered tender and juicy with a slight sweetness. It’s then prepared on the lava stone broiler grill to give it a smoky, charred flavor. The flavor transformation is so unique and memorable, even the potatoes for the mash get the same treatment.Chef Majdi Al Hinani’s signature creation, tiger prawns in harra sauce, is only one of the must-try dishes at Andaz Capital Gate Abu Dhabi.\nBE TRANSPORTED IN ABU DHABIAt 18 Degrees in Andaz Capital Gate Abu Dhabi, local flavor is bursting in every dish and drink from morning to midnight. Start your day with healthy, organic pistachio pancakes. At dinner, tuck into their signature dish of tiger prawns in harra sauce, made from locally produced mixed peppers, fresh tomatoes, onions, garlic, cumin, coriander powder, fresh coriander leaves, and peanuts, one of chef Majdi Al Hinani’s favorites. For dessert, dig in to chocolate kunafa cookies, a perfected, unique version of the traditional Arabic dessert (and this rendition, mixed with pistachio, is found only at Andaz Capital Gate Abu Dhabi). Cap it off with a cocktail inspired by the deserts of Abu Dhabi: Desert’s Oasis features traditional homemade jellab (date syrup) and gets its kick from grapefruit and cranberry. No matter where you sit in this sublime space, the food is impeccably fresh, the views from the building––it’s  the world’s furthest leaning hotel tower at an 18-degree incline––are unparalleled, and the locally inspired interiors are majestic. We’d call that one memorable meal.At Andaz Savannah, chef Cummer puts an unexpected and elevated twist on classic shrimp and grits with homemade truffle butter.\nSAVOR A SOUTHERN STAPLE IN SAVANNAHChef Chris Cummer grew up in Louisiana and Texas, and was introduced to grits early in life. However, his discovery of the shrimp-and-grits combo, a quintessential southern staple, didn’t happen until he began his career at a restaurant in southern Louisiana. The key to making them great? Source locally. Now, at the helm of Andaz Savannah’s 22 Square restaurant, he uses Georgia-grown corn that is dried and stone milled, with fresh, sweet Georgia shrimp from local shrimp boat “Papa T.” But chef Cummer credits his current variation of the dish to the many stops along his culinary career. From Louisiana to Texas to New Jersey and NYC, and now in Georgia, each stop is represented in the dish, from the seasoning of the shrimp to the techniques and ingredients used. To elevate the flavor profile, and include an ingredient not commonly paired with the dish, he uses a homemade truffle butter. Because what’s more Southern than more butter?The Modern Mai Tai at Andaz Maui at Wailea Resort has been thoughtfully concocted to maximize its tropical appeal.\nTASTE THE TWIST ON A CLASSIC IN MAUIIf you’ve ever been anywhere in Hawaii, you’ll know of the Mai Tai. This fruity cocktail is claimed to have originated in 1944 at Trader Vic’s and is a Polynesian treat widely enjoyed on the islands. The bartender team at Andaz Maui at Wailea Resort takes this to heart. In true Andaz fashion, they’ve put a twist on the traditional libation with aged Martinique and Jamaican rums, fresh lime, toasted almond orgeat, and orange curacao. (The original Mai Tai showcases the rums and citrus with a subtle hint of toasted almond.) At this Andaz resort, the Modern Mai Tai features fresh local Maui pineapple and a dark Jamaican rum float. Depending on your style–– classic or newly curated––you may have a favorite. Or perhaps you’ll try both as you sit back, relax, and soak up the view of pools and palm trees at Bumbye Beach Bar.Dessert doubles as art at Andaz Amsterdam Prinsengracht, where chef Sander calls upon a local art installation as his inspiration.\nGET CREATIVE IN AMSTERDAMAt Bluespoon Restaurant & Bar in Andaz Amsterdam Prinsengracht, the menu showcases the light, colorful––and in true Dutch form, humorous and highly creative––work of chef Sander Bierenbroodspot. Take Sander’s Pigeon, for example. This signature dish is made of beetroot, petit legumes, cabbage, crispy leg, and mushroom, and was inspired by chef Sander's bike ride to work one day, in which he had an encounter with one of Amsterdam's notorious pigeons. There’s a Video Art Dessert inspired by a video art installation: Cristina Lucas' \"Abstraction Licking\", a Dutch twist on Mondrian, which calls upon the party lifestyle of Amsterdam. To get the full taste and scent experience, it is meant to be eaten in a certain order, and guests are encouraged to eat with their hands. Finally, Martin's Blossom in the Snow is a cocktail inspired by the passing of winter to spring, therefore it has the look and comfort of winter, but it's actually a super-light cocktail buzzing with citrus and floral tones. Consider this a meal that exceeds all expectations.VISIT ANDAZ.COM TO BOOK YOUR EXPERIENCE AT ANDAZ HOTELS & RESORTS.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Andaz Hotels"]}