{"id": "1144e3e7bc2c8a6f87412b7619431627", "url": "https://www.bonappetit.com/recipe/crispy-tofu-with-maple-soy-glaze", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Crispy Tofu With Maple-Soy Glaze Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueCrispy Tofu With Maple-Soy GlazeBy Chris MoroccoFebruary 7, 20184.7(103)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintWhenever you’re cooking tofu, here’s one of our no-fail techniques: Draining the tofu, then squeezing out as much water as possible (without smashing it), is the key to the crispiest cubes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonKitchen Towels$22 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonIngredients2–4 servings112-oz. block firm tofu¼cup low-sodium soy sauce3Tbsp. pure maple syrup3Tbsp. unseasoned rice vinegar½tsp. crushed red pepper flakes1½\" piece ginger, very thinly sliced½cup neutral oil, such as canola or grapeseedKimchi, toasted sesame seeds, hijiki, daikon, sliced scallions, and steamed rice (for serving; optional)PreparationStep 1Drain tofu, then sandwich between several layers of kitchen towels to remove excess liquid. Cut into 9 cubes.Step 2Whisk soy sauce, maple syrup, rice vinegar, red pepper flakes, and ginger in a small bowl.Step 3Heat oil in a large nonstick skillet over medium-high. When oil is rippling across the surface, carefully add tofu so it doesn’t splash. Cook, undisturbed, until very crisp and dark brown underneath, 3–4 minutes. Carefully turn and repeat on opposite side. Holding tofu back with a spatula or slotted spoon, pour out oil into a small bowl. Return skillet to medium-high heat and add soy sauce mixture. Cook, reducing heat to medium so it doesn’t over-reduce or burn and basting tofu occasionally, until glaze is thick enough to coat a spoon, about 4 minutes.Step 4Divide tofu among plates. Drizzle with glaze, then top with scallions. Serve with rice alongside.How would you rate Crispy Tofu With Maple-Soy Glaze?Leave a ReviewTell us what you thinkReviews (61)Back to TopTriangleReally easy and tasty.  Served it on a bed of brown rice and kimchi.  I drained the tofu and left it in the fridge wrapped in a dry cloth so that it crisped up in no time when cooked.   You can easily double the sauce/glaze as I could have used more!carlyepiHartford, CT3/18/2022Delicious - like others, it took longer for my tofu to get \"golden\" but the sauce was delicious. I drained my tofu on paper towels and sautéed sliced carrots, celery and onions. I put the sautéed veggies aside and added the sauce to the pan, let it reduce slightly then added the golden tofu. I let that cook down a bit, then added the veggies again. Served with Jasmin rice and sprinkled with sesame seeds. Soooooo good!PamelaBoston, MA1/12/2022Really great, I make this at least once a week. Getting tofu crisp first is key!Anonymous6/14/2021I lost all crispiness of the tofu as it sat in the liquid to reduce.  Next time, I'll cook the liquid down a bit first to reduce it and *then* will add the tofu at the very end to coat it.  I think adding a bit of flour or cornstarch would help it stick to the tofu more, too.  The flavor was good - will do this again.  :)BoorayinCamas, WA4/29/2021so yummy! I added garlic because no recipe is complete without garlic. great easy meal with pantry staples I always have around. tofu tip – freeze in package overnight, thaw in fridge during the day, and then you'll be able to get a lot more water out of it before you cook. doesn't even required pressing, you can just gently squeeze the water out with your hands over the sink.MacArizona4/22/2021Like candied tofu! Instead of chili flakes I used Chili Crisp. Fantastic! Joyce N Canada3/14/2021So easy and so delicious! I topped a Buddha bowl with this and used extra glaze as dressing. It is my new fav!Diana DiLunaSalida, CO3/12/2021Terrific Make Tofu Great Again recipe. Made a Tofuian out of me, a Trumpian. Trump's the guy who who represents at least 73 million actual legal voting Americans.AnonymousVBeach, VA2/10/2021Wow to Tad C . . . keep your politics out of recipe reviews . . .AnonymousWA1/25/2021HA!  I still can't believe that people make assumptions that others are being paid to write reviews just because THEY didn't like a recipe!  How Trumpian.  Your reviews are FAKE reviews.  AS IF?  \n\nI gotta say that I have been planning on making this for a while and I'm happy that I finally did.  It was easy and delicious and, despite the fact that I didn't have Pepper flakes, I added a dash of Cayenne Pepper and it wasn't too spicy.  Tad CDowntown Los Angeles, CA11/15/2020Making this one for the 2nd time tonight! Highly recommend, very tasty and easy!Stephanie WagnerOntario11/7/2020Best tofu recipe AnonymousCT8/30/2020Wouldn't have posted anything until I saw someone say the reviewers were paid. I was absolutely not paid, and also have come back to this recipe many times because the tofu is delicious. Read the reviews if you think you might want to make a modification for sweetness or spiciness!AnonymousWashington, DC8/21/2020It’s okay. Pretty spicy. I think they must pay people to write these reviews.Anonymous8/10/2020So amazing, makes tofu a star over meat! AnonymousSeattle6/29/2020Explore Bon AppétitAsianTofuOther IngredientsMainDairy-FreeVeganVegetarianHealthyishFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Chris Morocco"]}