{"id": "1146c94e1c7de792ccd0c1ff184b16bc", "url": "https://www.bonappetit.com/recipe/cheesy-tomato-hand-pies", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Cheesy Tomato Hand Pies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCheesy Tomato Hand PiesBy Asha LoupyJune 13, 20214.5(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThe best part about these hand pies is how versatile they are. Mix and match the cheese and herbs to achieve whatever tomatoey, cheesy vibe you’re going for. This version with Gruyère, thyme, and marjoram (or a little tarragon) has a Frenchy feel, while extra-sharp cheddar, thyme, and dill can be subbed in to achieve a grilled-cheese-and-tomato-soup flavor profile. You can even take it to pizza pocket territory with low-moisture mozzarella, oregano, basil, and a pinch of crushed red pepper flakes. Puff pastry often pulls apart at the seams as it puffs when baking, so make sure to press hard with a fork when sealing. Using a metal bench scraper or chef’s knife to cut a thin ¼-inch strip off the crimped edges helps seal the dough as well. No matter what, there will be a little cheese ooze, BUT don’t fret it! That cheese will crisp and create a little skirt around the hand pies—and who doesn’t like nibbling on some crispy, lacy cheese bits? You can use Pepperidge Farm puff pastry in place of Dufour. Each package comes with two sheets, so you’ll want to cut four rectangles out of each one for eight hand pies total.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRolling Pin$13 At AmazonCutting Board$10 At IKEABox Grater$13 At AmazonLarge Skillet$84 At AmazonBench Scraper$8 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonPastry Brush$9 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParing Knife$10 At AmazonSpatula$12.99 At AmazonIngredientsMakes 8114-oz. package frozen all-butter puff pastry (preferably Dufour)2large garlic cloves3–4sprigs thyme2large sprigs marjoram or oregano3Tbsp. extra-virgin olive oil1pint cherry tomatoes1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided½tsp. freshly ground black pepper, divided; plus more (optional)6oz. Gruyére or other semihard or semisoft melting cheese (such as cheddar, low-moisture mozzarella, or Fontina)⅓cup crème fraîche⅛tsp. freshly ground nutmeg (optional)1large eggAll-purpose flour (for dusting)PreparationStep 1Thaw one 14-oz. package frozen all-butter puff pastry overnight in the refrigerator. Keep chilled until ready to roll out. (Or, if you forget to move pastry to the refrigerator the night before, use this day-of method. Remove the pastry from the box and place on a parchment-lined baking sheet—don’t unfold it, or it’ll crack. Let sit 10 minutes, turning the pastry halfway through. If it’s pliable after 10 minutes, unfold. If your box has more than 1 sheet of puff pastry, separate with some parchment paper. Chill in the refrigerator until ready to use. If pastry isn’t ready, wait another 5 minutes. Puff pastry goes from stiff to flabby and sticky in a matter of minutes, so be vigilant.)Step 2Gently crush 2 large garlic cloves with the flat side of a chef’s knife just to loosen the skins. Peel and thinly slice the cloves (save peels for stock, if you like).Step 3Strip leaves from 3–4 sprigs thyme and 2 large sprigs marjoram or oregano and coarsely chop. (You should have about 1 tsp. thyme and 1 Tbsp. marjoram.)Step 4Combine garlic and 3 Tbsp. extra-virgin olive oil in a cold large skillet. Set over medium heat and cook, stirring occasionally with a wooden spoon, until garlic begins to turn golden, about 3 minutes. Add herbs and cook until fragrant, about 30 seconds. Add 1 pint cherry tomatoes, ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, ¼ tsp. freshly ground black pepper, and ⅓ cup water to pan. Bring to a simmer and cook, stirring occasionally, until tomatoes are just starting to soften, about 5 minutes. Gently crush tomatoes with spoon. Continue to cook, stirring occasionally, until tomatoes are jammy, 8–10 minutes more, depending on ripeness. (You’re looking for a consistency slightly looser than tomato paste to prevent soggy hand pies.) Let tomato mixture cool.Step 5Meanwhile, grate 6 oz. Gruyére or other semihard or semisoft melting cheese (such as cheddar, low-moisture mozzarella, or Fontina) on the large holes of a box grater. Transfer to a medium bowl and add ⅓ cup crème fraîche, remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, remaining ¼ tsp. freshly ground black pepper, and ⅛ tsp. freshly ground nutmeg (if desired). Mix well and set cheese mixture aside.Step 6Beat 1 large egg with 1 Tbsp. water in a small bowl to blend. Set egg wash aside.Step 7Roll out puff pastry on a large well-floured surface to an 18x15\" rectangle. Slice in half lengthwise, then in half crosswise. Cut each quarter in half again crosswise so you have 8 rectangles, about 7½x4½\".Step 8To assemble the hand pies, arrange a pastry rectangle so a short side is closest to you. Mound 2 Tbsp. reserved cheese mixture on bottom half of each rectangle, leaving a 1\" border along bottom and sides. Top cheese mixture with 1 Tbsp. tomato mixture.Step 9Working one at a time, brush borders of pastry with a thin layer of reserved egg wash. Fold the top (empty) half of pastry up and over filling so edges of pastry line up, then gently press together. Crimp edges with a fork to seal. (Be forceful as puff pastry has a tendency to pull open when baking.) Trim about ¼\" from each crimped side with a bench scraper or knife, pressing straight down (this will help seal the dough). Place sealed hand pies on a parchment-lined baking sheet, spacing 1\" apart.Step 10Lightly brush tops of hand pies with egg wash and sprinkle with coarsely ground black pepper if desired. Chill in the freezer 30 minutes.Step 11Meanwhile, preheat oven to 375°.Step 12Pull hand pies from freezer and cut two ½\"-long vents in the top of each.Step 13Bake hand pies until pastry is cooked through, puffed, and golden brown, 32–35 minutes. Let cool 10 minutes on baking sheet. If any cheese has oozed out and connected the pies, cut with a spatula so each pie has some crispy, lacy cheese bits. Serve warm or at room temperature.How would you rate Cheesy Tomato Hand Pies?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThese are tasty, but as others say—not hard to make this much butter and cheese taste good. I also found the instructions annoyingly micromanaging. I can figure out how to defrost puff pastry without reading a dissertation on it. Probably not going in a regular rotation, but nice on an indulgent comfort-food night.KIllinois11/5/2021Very tasty, but my goodness, so overwhelmingly rich. I love butter, don't get me wrong, but it was literally pooled under the parchment paper when these were done cooking. Filling to pastry ratio would be better if the dough could be worked even thinner, cut larger to be more like a calzone, and with additional filling. I was mostly just eating delicious, buttery pastry. Lots of legwork for what I would also call a fancy hot pocket. But I wouldn't have the ideas for next time without this batch to go off of. Maybe a different puff pastry other than Dufour would be a little less excessive, but I don't know just yet. Or just go with cheese/veg/etc. on the interior, serve alongside a sauce with some acidity and brightness to cut through the butter. AnonymousIndiana8/12/2021These were tasty and fun to make, but I probably won't make them again. They are glorified hot pockets with way too much fat and sodium. I would make the tomato mixture again to serve over polenta.pipercooksLongmont, CO7/23/2021Made these last week for a road trip, genius! So good, will make these again, will also make the tomato mixture to put on pizza and pasta! Amazing!!Linda elkindChicago, Il7/17/2021These look great, excited to try them. I will have to agree to disagree with the commenter who called these pasties. I'm from Michigan, I know pasties, they are big here. Their dough is much more dense and they almost always include potatoes. Hand pie dough is much lighter and flakier, like a pie. They can be either sweet or savory. JMHOAnonymousMichigan7/7/2021What the hell is a hand pie? They’re called pasties - as in nasties with a P, not what cover nipples. Anonymous7/6/2021Great summer recipeGillianToronto Ontario7/6/2021Explore Bon AppétitSavory Pie & TartPastriesTomatoVegetableCherry TomatoGruyèreCheeseCheddarMozzarellaThymeHerbs & SpicesMarjoramTarragonOreganoBasilDillPuff PastryOther IngredientsStarterNut-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-13", "author": ["Condé Nast", "Asha Loupy"]}