{"id": "1152f880fa539163b5cd669c467486ad", "url": "https://www.bonappetit.com/story/parchment-overhang", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Line Your Pan with Parchment Overhang, Make Life a Smidge Easier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLine Your Pan with Parchment Overhang, Make Life a Smidge EasierYou’ve got better things to worry about than stuck-on cookie bits.By Jesse SparksMarch 25, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Like 90 percent of the people on Food Instagram™, I’m an anxious baker. I’ll read a recipe multiple times before setting out the ingredients, only to double check each step of the way. I’ll spend full minutes comparing my in-progress product to reference photos, wondering whether I’ve reached the right shade of toasty blonde or if I’m still in roasty beige territory (I wish I were joking).But I never waste time worrying about how I’ll get my confection out of the pan without ruining it, and that’s all thanks to parchment paper, a nearly miraculous heat-resistant nonstick material. When it comes to lining square pans and loaf pans, there’s a quick and effective trick that guarantees success every time: Line the pan with enough parchment to hang over its edges. The parchment flaps don't have to cascade out of the pan, exactly, but you do want them tall enough that you can get a good grip.These makeshift “handles” will allow you to hoist your final product out of the pan, ensuring neat edges without clinging or sticking. This also a) eliminates the risk you’ll scratch up your pan by slicing inside it; b) means that you don’t have to flip over a bar with delicate layers; and c) limits the time you’d otherwise spend scrubbing stuck-on brownie bits.Here’s how to line your pan with parchment overhang:For a square pan, start by lightly coating it with a thin layer of nonstick cooking spray. This will hold your parchment paper in place. Cut or tear a sheet of parchment paper that’s about twice as long as your pan. Fold it in half down its length, then use scissors or sharp chef's knife to cut it into two smaller rectangles. With a little trimming, each should sit flush along the bottom of the pan and rise up two of its opposite walls. Fit one sheet in the pan, spray or oil lightly, then place the other sheet in the opposite direction (that is, perpendicular to the first sheet) so that all four walls are covered. Smooth out any bubbles or creases.For a loaf pan, you’ll need a piece of parchment that’s the length of the loaf pan and about three times its width. Spray or oil the pan, then press in the parchment paper so that there’s overhang on the two long sides. Be sure to spray or oil the bare sides, as well.From here, you’re all set to fill your pan with your creations: layers of shortbread, butterscotch, and luscious chocolate, maybe? And this time, you won’t have to worry about the big reveal—just use the makeshift handles you created from that extra parchment paper to lift your confection without any sticking. Now, you’re free to cut it on a flat surface without stressing about scratching your pan. After all, you’ve probably got more important things to think about.Get the recipe:Tahini Billionaire BarsWe took millionaire bars—shortbread plus caramel plus chocolate—and gave them an upgrade (hence, billions) with sesame seeds and tahini. The shortbread is tender, the filling is gooey, and the chocolate ties it all together.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-25", "author": ["Condé Nast", "Jesse Sparks"]}