{"id": "115ad10ab41a37d2a6b964bf8ecd9945", "url": "https://www.bonappetit.com/story/instagrammers-feel-good-food-plan", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "These Instagrammers Are Making the Feel Good Food Plan Look AMAZING | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Instagrammers Are Making the Feel Good Food Plan Look AMAZINGYou guys are killing it.By The Healthyish TeamJanuary 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe’re officially halfway through the Feel Good Food Plan! It’s been a beautiful blur of crispy harissa-smothered chicken thighs, turmeric coconut curry, and roasted salmon with ponzu. And, if our Instagram feed is any indication, we’re not the only ones feeling good. Some people cooking through each day at a time, others are going rogue and making their own lineup. It’s all great—this plan is about finding healthful foods and flavors to cook (and cook, and cook) well after the plan’s two weeks are up. A lot of you have already asked about vegetarian and vegan substitutions, so here's senior food editor Chris Morocco's advice:For big-batch vegetarian protein lunch prep, double the marinated beans, soft boil some eggs, and roast tofu using the tearing technique found in the roasted broccoli and tofu recipe. For a vegetarian version of the Turmeric-Coconut Curry with Pork, add pre-cooked grains for a saucy take on fried rice. Or, swap in crumbled tofu, tempeh, or even roasted sweet potato. If you’re trying to avoid soy products, roasted chickpeas can bulk up lunches and replace tofu in the Roasted Broccoli and Tofu with Creamy Miso Dressing. The dish can also be adapted for a wide range of vegetables. \"I think the main point here is that you want to roast a cruciferous green,\" says Morocco. \"It can be all brussels sprouts, broccoli, cauliflower... I think you just need something that’s really hearty that can take that level of heat and almost char in the oven.\"Saturday's frittata is also perfect for variation. \"You can do zucchini instead of eggplant, but I would just do more cabbage and more onion,\" Morocco says. \"If you have any leftover roasted veg from the previous night or lunch prep, a little bit of the previous nights' roasted sweet potato or roasted broccoli, chop that up and put that in the frittata instead of the eggplant. It's a total pro move.\"Here are some of our favorite takes on the plan so far, sourced from the Healthyish community. And if you’re in need of some extra adaptation guidance, leave us a comment on Instagram or email us at healthyish@condenast.com and we'll do our best to help.1. @Superwowomg used bok choy in place of fennel for her One-Skillet Crispy Chicken Thighs with Harissa, and it looks awesome.Instagram contentThis content can also be viewed on the site it originates from.2. Healthyish editor @ashapiro009 used a crisp apple instead of Asian pear for her Ponzu Roasted Salmon for Two.Instagram contentThis content can also be viewed on the site it originates from.3. And @yobanks2 smartly used baby carrots instead of baby potatoes for an extra nutritional punch.Instagram contentThis content can also be viewed on the site it originates from.4. Bon Appetit senior editor @juliakramer opted for ground chicken instead of pork for her cozy bowl of Turmeric-Coconut CurryInstagram contentThis content can also be viewed on the site it originates from.5. @mollywho added tofu to her lunch prep. It looks great with roasted veggies, kale, lemon yogurt, and a perfect drizzle of tahini-ranch dressing.Instagram contentThis content can also be viewed on the site it originates from.6. And @theyumproject smartly cut all meat out of her turmeric curry with some roasted sweet potato.Instagram contentThis content can also be viewed on the site it originates from.7. @perrikramer reached for lacinato kale instead of Napa cabbage, and sprinkled on some scallions too. We're loving those leafy greens.Instagram contentThis content can also be viewed on the site it originates from.8. @deserteats_ turned Roasted Broccoli and Tofu with Creamy Miso Dressing into Roasted Broccoli and Chicken Thighs with Creamy Miso Dressing.Instagram contentThis content can also be viewed on the site it originates from.9. Bon Appetit senior editor @juliakramer finished off her Coconut-Chocolate Mousse with a perfect dollop of whipped cream.Instagram contentThis content can also be viewed on the site it originates from.10. And @clarelangan cut dairy out of her turmeric curry with a dollop of cashew yogurt. It looks delicious!Instagram contentThis content can also be viewed on the site it originates from.Now go get your lunch prep in order, and we’ll meet you on Monday with some slow cooked white fish. Happy cooking!Explore Bon AppétitHealthyishFeel Good Food PlanRead MorehealthyishThe Healthyish Feel Good Food PlanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-06", "author": ["Condé Nast", "The Healthyish Team"]}