{"id": "1160319858c1250d39e6bb18b153f753", "url": "https://www.bonappetit.com/recipe/spaghetti-with-no-cook-puttanesca", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Spaghetti with No-Cook Puttanesca Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueSpaghetti with No-Cook PuttanescaBy Andy BaraghaniJuly 9, 20194.7(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintTomato seeds and membranes can be a bit bitter, which is why we remove them from this uncooked preparation—it also prevents the sauce from being watery.Ingredients4 servings2beefsteak tomatoes (about 1 lb.), halved crosswise, seeds removed2garlic cloves, finely grated1tsp. crushed red pepper flakes2tsp. kosher salt, plus more1½cups cherry tomatoes, halved1cup Castelvetrano olives, crushed, pits removed2Tbsp. drained capers¼cup extra-virgin olive oil, plus more for drizzling12oz. spaghetti¼cup finely chopped parsley3Tbsp. unsalted butter, cut into piecesPreparationStep 1Pulse beefsteak tomatoes, garlic, red pepper flakes, and 2 tsp. salt in a food processor until smooth; transfer sauce to a large bowl and mix in cherry tomatoes, olives, capers, and ¼ cup oil.Step 2Cook spaghetti in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving ¼ cup pasta cooking liquid.Step 3Add pasta, parsley, and butter to sauce. Toss vigorously with tongs, adding a splash of pasta cooking liquid or more as needed to create an emulsified sauce that coats pasta. Divide among bowls and drizzle with more oil.How would you rate Spaghetti with No-Cook Puttanesca?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI have made this numerous times following the recipe exactly!  I do pulse the olives though, it doesn't need the anchovies.  I use, and love anchovies, but with the capers, olives, and parmesan, it is still plenty salty.  it's my go to pasta dish....Louise2/13/2022Recipe was fantastic without beefsteak tomatoes…. Substituted procutto for anchovies and added mushrooms…a gustatory delight to the last bite…all downed with a glass of pinio grigioPatrick DoorlyBarrie Ontario Canada10/26/2021I missed the anchovies which I deem essential in a puttanesca, but that's ok. That's a different version.\nTereza São Paulo, Brazil8/16/2021Iiked the sauce, but even using some Roma tomatoes, it was very watery. I substituted artichokes for the olives, which worked well. Next time I will drain the tomatoes and see if that worked; there was too much liquid for the pasta sauce to coat the pasta.Linda jGoldsboro, NC7/7/2021Ok I think I improved this recipe! First time round was too watery and not hot enough (cold sauce added to pasta??). So, I followed the sauce recipe except omitted garlic, strained some juice out, fried the garlic in plenty of butter til nutty, then added tomato sauce to warm through, then spaghetti. The fried garlic + fresh tomato flavor was seriously seriously good. This is going to be a summer staple for me. MelSF, CA7/7/2021How could you call this a puttanesca without anchovies?   Sue NanceHonolulu, Hawai'i6/28/2021Excellent meal. Did not pulse the ingredients, Just chopped. Still delicious. Easy, quick recipe.VladOttawa, ON, Canada2/22/2021this is really good- summery, bright, fresh, and easy to throw together. the only thing I will say is that when the tomatoes initially come out of the food processor, they will be an unappealing pink colour. you have to work through that and ignore it, as that becomes irrelevant when the other ingredients are mixed in and the pasta is in the bowl. delicious delicious delicious.toronto7/25/2020Love this used some fresh jyst picked tummies! Yummy added some cheese big hit!!!! AnonymousBiddeford Pool Maine 7/22/2020This was great! So simple to do, fresh and light. Awesome!AnonymousUK6/19/2020This recipe was so delicious! Though like someone else said it took a little longer than I anticipated I would definitely make it again!\nI had to use canned cherry tomatoes and margarine instead of butter #COVIDcooking but it was still great (just a little salty with the margarine). The leftovers were great the next day too!  Jess C.Ottawa, Canada4/7/2020Wow... for a recipe that’s almost vegan, this was lip-smacking delicious. Not as quick as I had expected, but totally worth the effort (and washing the food processor). anitaecSan Francisco9/6/2019This is so delicious and so fast. The simple sauce really lets the tomatoes shine with briny compliments from the capers and a little meatiness from the olives.  The butter added extra depth too, though I'd probably use 2T next time. A great way to use up a bunch of ripe farmer's market tomatoes - make this now while they're in season!AnonymousChicago, IL8/30/2019Love this recipe during our short tomato season in Seattle, have made it weekly since reading it.  There is one technique change worth making.  The sauce creates quite a lot of liquid that doesn't absorb and waters down the pasta more than I like.  I strain the sauce over a fine sieve at the last minute and  return the pasta to the pan over low heat with the strained juice and toss with the butter and a bit of pasta water if needed.  Once fully coated I toss all of the ingredients together in the serving bowl - this eliminates a watery pool of sauce.  szmarie7035Seattle, WA8/26/2019This was delicious and a new staple in our house. I used basil because I’m not a fan of parsley and it was perfect. Light and summery but still a cozy bowl of pasta. AnonymousFlorida8/26/2019Explore Bon AppétitPastaItalianEuropeanSpaghettiPasta & NoodlesOliveOther IngredientsCherry TomatoTomatoVegetableSummerQuickEasyWeeknight MealsMainNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}