{"id": "116a4fd34a2a70543420d97f1582b7e3", "url": "https://www.bonappetit.com/recipe/garlicky-panko-toasties", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Garlicky Panko Toasties Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueGarlicky Panko ToastiesBy Molly BazMarch 19, 2019EmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintLittle, light, and fluffy, these crumbs are the perfect topper for delicate salads that can't handle big honkin' croutons.IngredientsMakes about 1½ cups4Tbsp. unsalted butter4garlic cloves, lightly smashed1½cups panko (Japanese breadcrumbs)Kosher saltPreparationStep 1Cook butter and garlic in a medium skillet over medium-low heat, swirling pan often, until foaming subsides and garlic is fragrant, about 2 minutes. Add panko and stir to coat evenly. Cook, stirring often, until panko is golden brown, about 4 minutes; season with salt.Step 2Transfer to a plate and let cool. Discard garlic.Step 3Do Ahead: Panko can be made 5 days ahead. Store airtight at room temperature.How would you rate Garlicky Panko Toasties?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentGarlicVegetableNut-FreeVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}