{"id": "118f18d0b36d6e69dbf3206eba58d5c4", "url": "https://www.bonappetit.com/story/herbivore-prism", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Herbivore Prism Is the First Natural Exfoliator I've Tried That Really Works | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHerbivore Prism Is the First Natural Exfoliator I've Tried That Really WorksIt's all-natural, Instagram-friendly, and effective (if gentle).By Deanna PaiAugust 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailMy skincare motto can be summed up as: “If it’s not burning, it’s not working.” So, naturally, I’m very into exfoliating products. The idea of dead skin being sizzled off my face is highly appealing, and chemical exfoliants, which dissolve dead skin cells, well, chemically rather than physically are generally a bang-for-your-buck product: They brighten dull skin, treat breakouts, minimize the look of fine lines, and even help your other skincare products better penetrate your skin. So when Herbivore Botanicals, the skincare brand best known for their jade rollers and Instagram-friendly facial oils, debuted the Prism Exfoliating Glow Potion, I wanted to try it.“Do you know Sunday Riley’s Good Genes?” asks Julia Wills, co-founder of Herbivore, referring to the popular lactic-acid treatment. “It’s like that, but natural.” Historically, natural skincare products haven’t been nearly as effective as mainstream products, and I’m generally skeptical of Mother Earth’s ability to Benjamin Button me.But Wills tells me that it took a few years to get the fruit acid -based, synthetic-free formula right, and the ingredient list is pretty impressive. The serum has natural sources of all of my favorite chemical exfoliants: glycolic acid from sugar cane, salicylic acid from willow bark and aloe, malic acid from apple, citric acid from orange, and lactic acid from the Tolkien-sounding bilberry (it looks like a blueberry; saved you a click).The serum also delivers vitamin C, derived from kakadu plum, for its brightening properties, as well as a blend of rose water, aloe water, and a vegan form of sodium hyaluronate to hydrate skin. Its end-goal is to brighten your skin through this combination of exfoliation and moisturizing.When I swap out my usual exfoliant for Prism, I’m first surprised by how good it smells. It’s the first chemical exfoliant I’ve used that doesn’t smell like the floor of a hospital, but like rosewater instead. It’s easy to spread, too, and it sinks in quickly. There’s no tingling, stinging, or burning—and while it’s nice to not have to fan my face after exfoliating, I kind of miss the feeling.Still, it does a decent job at brightening my skin and keeping my breakouts at bay. What I find especially appealing is that it serves as an exfoliant, antioxidant serum, and moisturizer in one. When the midsummer air begins to feel like dog breath, it feels good to apply one lightweight product and call it a day.Still, I do get a few errant zits that I know my usual paint-stripper formula could take down in a second, and while they eventually disappear, the process takes a day or two longer with Prism. But that makes sense: It’s just not as powerful, and therefore not as harsh, as a formula packed with synthetic stuff.And that’s kind of the point. “Out of all the exfoliating acid products on the market today, we didn’t see any that were totally natural and gentle enough to use daily,” Wills and her husband-cum-cofounder, Alexander Kummerow, later write to me in an email. Because of that, it’s ideal for those with sensitive skin, or for someone seeking mild brightening rather than, say, a solution for stubborn breakouts.What I like best about Prism is that it’s exactly what it claims to be: a gentle, clean exfoliant. And one thing that’s harder to find in the skincare world than a natural and effective product? Transparency.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleMoon Juice Founder Amanda Chantal Bacon Has a New Beauty Line and, Fine, I'm Into ItBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-02", "author": ["Condé Nast", "Deanna Pai"]}