{"id": "11ad9dab49d789566c047c2341f244ef", "url": "https://www.bonappetit.com/story/how-to-eat-on-public-transit", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "How to Actually Eat on Public Transit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Actually Eat on Public Transit, You AnimalDon't be the person eating soup on the subway or tuna salad on a flight. There’s a proper way to travel.By Alex DelanyOctober 18, 2018FacebookTwitterEmailIllustrations by Alex DelanyFacebookTwitterEmailI like to eat at a table. Sometimes at a counter. And possibly even standing on the sidewalk, if we’re talking about a slice of pizza. But I do not like to eat on buses. Or on airplanes. Or in cramped subways. As someone who takes various forms of public transportation every day, I can tell you that the rest of the world does not seem to share these preferences. People eat full-on meals within inches of other commuters, in the gnarliest places around. And I wish they wouldn’t.You’ve seen the type, hunched over a styrofoam container, slurping noodles, picking the final bits of their kale salad from their Tupperware, or spooning yogurt into their face hole, as if they’re in the comfort of their own home. Shared transportation is already far from a tranquil experience, and in my very honest opinion, having to worry about the possibility of smelling something nasty or getting food dumped on a new pair of pants makes the experience even worse.I’m not here to yell at you. I’m not here to tell you that you can never put a piece of food into your mouth while in transit. I just want to ask you some questions. I just want to leave you with a few things to consider before your next meal on a plane, train, or automobile:Illustrations by Alex DelanyWhat Type of Vehicle Are You On?Unless you have a private jet or a yacht or somehow afforded to build your own railway system through your 932-acre ranch, you’re probably traveling with other people. Not all modes of transportation are created equal when it comes to whether or not you should eat on them. So here they are, ranked from least to most acceptable:A Tandem Bicycle: This is more an issue of safety than anything. Don’t eat on a tandem bicycle. Ever. The safety of the person behind or in front of you is more important than your inability to go more than 30 minutes without eating a burrito.A Ride-Sharing Car: It doesn’t matter how short your trip is. Or how much you are going to tip the driver. Or if you use Uber or Lyft or whatever the new one is. There is absolutely no excuse to eat any kind of food in someone else’s personal vehicle. Wait until you get where you’re going, and keep your crumbs to yourself.An Airplane: Eating food on an airplane is cruel for four reasons: 1) You are very close to the person next to you, who you may or may not know. 2) The air in an airplane is recirculated throughout the cabin, meaning the scent of your homemade kimchi is also recirculated throughout the cabin. 3) The average time you spend in said cabin is of longer duration than most other transportation. 4) And unless your row mates packed a parachute, there is no way for them to get off they airplane. They, and everyone else onboard, are stuck with whatever smell you happen to be wafting until you land. If you are going to bring outside food on an airplane, make sure it does not smell at all. Homemade granola is great. Smoked salmon is not.Illustrations by Alex DelanyA Subway Car: The risk of having food spilled on or rubbed against another person is just too high. It is also one of the only places that I find myself thinking, “Your face is too close to my face.” The closer your face is to someone else’s face, the less acceptable it is to eat.A Train: Trains have dining cars. These are cars that usually have a small cafe serving subpar food for a few dollars too many. They have real tables where you can put real food. There are also trains with private bunk cars. If you can grab a table or have your own room, you can eat whatever you want. But if you’re in a normal train seat... Nothing smelly. Snacks only. This is the perfect time to unwrap that tahini brownie you stashed in your bag. Or to dive into a bag of mixed nuts, snack mix, or maybe even some Fritos (a Personal favorite). Since you’re sitting, you have a bit more freedom to use your hands and your lap. Don’t forget a napkin.A Bus: The bus provides seats, and allows other passengers to escape, if needed. It is a shining example of space and accessibility, making it one of the more acceptable forms of transportation on which to eat, especially if you happen to be on the top deck of a double decker bus. The kind without a roof. That’s a good place to eat. If you’re on a bus from Ohio to Los Angeles to chase your Hollywood dreams, well, that’s a different story.A Ferry or a Yacht (but Probably Just a Ferry): A boat is a prime vehicle on which to eat. There are seats, but most importantly, there is fresh air. Smells disappear quickly, and there’s usually a safe, convenient place to dispose of your trash. I’m actually encouraging you to eat on a boat. It’s absolutely lovely.Illustrations by Alex DelanyDo You Really Need to Eat Right Now?I'm not saying you can’t ever eat in transit (except for the tandem bicycle and the ride-sharing car), it just shouldn’t be a full meal. That’s what those not smelly snacks are for. As long as you properly throw away or stash any trash, wrappers, or peels, you’re allowed to eat many manageable snacks. Fruits like oranges (when seated only) and bananas are prime because they won’t leak juice (unlike a peach) and come with their own built-in packaging. Bite-sized is also a good snack criterion. Small crackers shaped like fish, candies shaped like fish, snap peas, peanut butter crackers, dried fruit, and Nilla Wafers (which I miss) also belong to this family and are ultimately appropriate because consuming each piece in a single bite cuts down on crumbs and mess.Do You Need a Knife to Eat the Thing You’re Thinking About Eating?If you need to cut something, you shouldn’t eat it. If you have to slurp something with a spoon, stop. Even a fork is pushing it. That means no steak. No chicken. No lamb chops. No baked potato. Unless it’s a hand potato. Like... when you eat a whole baked potato out of your hand. I wouldn’t recommend it... but that’s what a hand potato is.Does The Thing You’re About to Eat Contain Broth?If it does, you’re not allowed to eat it on a train or plane or subway or any other vehicle. That's the law. Remember what I literally just said about spoons? No chicken and rice. No massaman curry. No lobster bisque. No broth. Full stop.Illustrations by Alex DelanyDo You Have a Napkin?If you don’t have a napkin or a paper towel or a rag or something to wipe up a potential mess, you shouldn’t be eating. Rule No. 1 is don’t make a mess. But rule No. 2 is always be prepared for the possibility of one. It is also worth noting that this applies to drinks. You know who spills coffee on the subway floor and doesn’t clean it up? Assholes. That’s who.Are You Late?Oh, you are? Guess what! Doesn’t matter! That’s your fault, not the poor woman who will leave the subway car wearing a nice splattering of your oatmeal. Eat at your desk or stop hitting the snooze button. Being late does not change the appropriateness of eating on your commute.Illustrations by Alex DelanyAre You Going to Be Holding onto a Pole?If you choose to eat something with your hands, you are automatically forfeiting your right to hold onto any pole, loop, or rail. The food you ate is on your hands. Maybe they’re greasy. Maybe they’re sticky. Maybe you licked every inch of them. Regardless, you can’t put them anywhere other people also hold onto. If you do it, I will arrest you.Can the Thing You’re Eating Fall Apart?Foundation and stability are good things to talk about when building a house. They also apply to foods. If your food has the potential to fall apart or disassemble, it’s not a good idea to eat it while you’re moving and surrounded by other people. Foods with questionable stability include, but are not limited to, triple decker sandwiches, hard shell tacos, spaghetti, ice cream sundaes, sloppy Joes, meatball subs, Klondike Bars, and bagel sandwiches.Illustrations by Alex DelanyHow Aggressively Does the Thing You’re Eating Smell?Scent is probably the most important thing to consider. If you think it might smell, it’s too smelly. No one owns the air in whatever vehicle you’re in. It’s for everyone, which means that if you put a smell into the air, everyone has to deal with it. And remember, just because something smells good to you, does not mean it smells good to other people. That being said, fish, eggs, and fermented vegetables are never okay to eat in transit, regardless of vehicle type.Do You Know What Manners Are?This all comes down to manners. I really could have just said, Hey, use your brain. Don't be an imbecile. Use some common sense. But if my exposure to our world’s latest human offerings has taught me anything, it’s that common sense seems to be in short supply.Co-habitation is about sharing. And sharing is about respect. And respect is about considering the other people around you just as much as you consider yourself. Treat others the way... yadda, yadda, yadda. You know how that one goes. You’d be pissed to sit next to someone going to town on a pound of egg salad. Having a rogue, saucy meatball land on your white shirt would probably ruin your day. And sitting in a puddle of melted ice cream certainly wouldn’t set you off on the right foot. The bottom line is this: If the food you’re eating in any vehicle could, even possibly, make someone’s day worse, you shouldn’t be eating it. Put your comfort at the same priority as everyone else’s. That’s how we all win.Explore Bon AppétitTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-18", "author": ["Condé Nast", "Alex Delany"]}