{"id": "11aedbfa2163554e4ccf50283bd0a449", "url": "https://www.bonappetit.com/story/pizza-beans", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "The Pizza Beans Formula and All the Ways to Riff On It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Pizza Beans Formula and All the Ways to Riff On ItYou never get tired of pizza. You’ll never get tired of Pizza Beans.By Ali Slagle September 14, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Rebecca JurkevichFacebookTwitterEmailLike resealable bags and sliced bread, the concept of “Pizza Beans” is so smart, so natural, it’s easy to assume it’s been around forever. But the lovable term can actually be traced to a recipe in Deb Perelman’s cookbook Smitten Kitchen Every Day, where she explains that its name alone sold her son on eating beans.The essence of the dish, though, is as old as cheese and beans themselves—well, probably. Perelman was after a combination of Gigantes Plaki—baked tomato-sauced beans under a blanket of cheese—and classic Baked Ziti. The beans and cheese emerge from the oven bubbling and browned. In other terms, it’s a gratin, the French staple where a base of everything from potatoes to pasta to fruit to, yes, beans is baked or broiled under a browned crust.Pizza Beans is stellar branding—and also a good prompt for all that this dish can be. What’s your favorite pizza? Make its sauce in a skillet, tuck beans and its toppings into that sauce, top with a melting cheese, and broil. With pizza as the flavor inspiration, this basic formula—something saucy + cooked beans + cheese + broiler—can lead to so many rapid-quick, comforting meals. Here are some things to think about when you want to riff, and a few ideas to get you started.The SauceBeans with melted cheese on top is good, but potentially dry and heavy, and there’s nothing to drag bread through. The sauce is what brings these two elements together. It could be any of the classic pizza sauces: marinara (store-bought or homemade), pesto, or fresh tomatoes. Or go the white pizza route and use a creamy sauce. In my Margherita Pizza Beans recipe, grated tomatoes are used to build the sauce. You could riff on that with grated corn or zucchini or butternut squash.You’ll just want to pay attention to the thickness of the sauce: I like my beans to be sauced with something that pools in the bowl, as opposed to something that gloms to the beans (again, for bread-sopping purposes). To reach that consistency, seek out a sauce that’s thicker than broth but thinner than jarred tomato sauce (the sauce will thicken some under the broiler). If the sauce is too thick once you add the beans, thin as needed with water and/or stock. If it’s too runny, continue to simmer it on the stove to cook off some excess water before adding the cheese.The BeansAny cooked bean goes: cooked from dried, drained and rinsed from the can, Gigantes, little dudes—a mix!The CheeseCoarsely grate or tear a melty cheese, like mozzarella, cheddar, Gruyère, or fontina. You can certainly add a second cheese for a mix of textures and saltiness, like Parmesan, ricotta, or feta. You’ll always want more cheese than you think. Distribute in an even layer on top of the beans. If you find that the cheese is sinking into the sauce, pause: The sauce is too thin. Reduce the sauce more on the stovetop before adding more cheese.The BroilerSome Pizza Bean recipes ask you to bake the beans at a very high temperature for about 10 to 15 minutes. When doing this, the sauce concentrates and thickens, which is good, but sometimes I find that by the time my cheese is melted, the sauce reduces too much. For more control, get the sauce to a consistency just a smidge thinner than your goal on the stovetop, then top with the cheese and broil. In a matter of minutes, the sauce will bubble and the cheese will brown. Stand by and watch the skillet under the broiler so you can pull it at the optimal melty-burnished moment.This formula can definitely work with more than just pizza-appropriate toppings. (Why, yes, you can make mac and cheese with beans instead of pasta, or thicken chili in a skillet and melt cheddar on top.) Could you still call it Pizza Beans? It’s your call. Or follow one of these pizza-inspired sauce and cheese combinations using any beans you have:Marinara + mozzarella + pepperoni (on top of the cheese so they curl and crisp!)White sauce + blanched chopped broccoli rabe + mozzPesto + seared mushrooms + pepperoncini + provoloneSeafood stock + clams + oregano + garlic + mozz + pecorino (New Haven-style clam pie)Chicken stock + hot Italian sausage + spinach + fontina + TaleggioCream + sautéed leeks + fennel + goat cheese + pecorinoTomato paste + water + roasted red peppers + anchovy + olives + mozzGrated corn + water + rosemary + parm + fetaKale pesto + bacon + mozz + pickled chiles (after broiling)The Classic:Margherita Pizza BeansFresh summer tomatoes take center stage with these saucy Margherita pizza-inspired beans.View RecipeAli Slagle is a recipe developer, stylist, and writer. Her first cookbook, Dinnertime, will be out Spring 2022.Explore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Ali Slagle"]}