{"id": "11bbf79b4949dca7f91eab2f799bda0c", "url": "https://www.bonappetit.com/recipe/sour-cream-dressing", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Sour Cream Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueSour Cream DressingBy Molly BazApril 12, 20194.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintA dressing this creamy demands cold, watery leaves (such as romaine or iceberg) that can stand up to its weight and offer refreshment.IngredientsMakes about 1 cup¾cup sour cream¼cup mayonnaise1garlic clove, finely grated2tsp. finely grated lemon zest3Tbsp. fresh lemon juice1½tsp. kosher salt1½tsp. freshly ground black pepperPreparationStep 1Whisk sour cream, mayonnaise, garlic, lemon zest, lemon juice, salt, and pepper in a medium bowl to combine.Step 2Do Ahead: Dressing can be made 1 day ahead. Cover and chill.How would you rate Sour Cream Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleSo easy. Works great with any citrus. Perfect for burrito bowls!Lauren Ali Orange,  California 3/5/2021Very tasty, but I would also recommend using less salt. I made it with grapefruit instead because I had no lemons on hand - delicious. walEMinneapolis 6/18/2020Super tangy but creamy.  Yet still a light, bright flavor.  Only thing is that I would def. reco reducing S&P to 1tsp at most. Anonymous900774/20/2020Explore Bon AppétitCondimentQuickEasyGluten-FreeNut-FreeVegetarianKetoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Molly Baz"]}