{"id": "11d0cc6f6564a3f2574705be54ed1868", "url": "https://www.bonappetit.com/story/bake-bread-without-a-dutch-oven", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "How to Make Bread Without a Dutch Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to My Award-Winning Bread is a $4 Foil Roasting PanYou don't need to spring for a Dutch oven to get crusty, well-risen loaves.By Emma BarkerJuly 20, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailIn Basically on a Budget, we'll talk tips, ingredients, and recipes that'll help you save money and eat well.When I started baking bread five years ago, I had more time on my hands than money. I was an underemployed recent graduate trying to save some cash by taking up a hobby that produced food. Although I baked with enthusiasm, my early loaves of bread were disappointing—pale, poorly risen, and lacking in flavor. I made many batches of croutons, finding that frying even lousy bread in a generous amount of olive oil made something delicious. As my roommates gamely crunched on croutons, I kept trying different recipes and different rise times, but it didn’t seem to help. I took to the internet to look for answers.Many bread bakers online tout the benefits of baking loaves in a Dutch oven to create a steam chamber inside of a home oven. This mimics the effect of a professional steam injection oven, where an infusion of hot steam during the first few minutes of baking keeps the crust from solidifying before the bread has fully expanded. The Dutch oven trend seems to have started with Jim Lahey’s no-knead bread recipe and technique, which took the baking world by storm after it was published in the New York Times in 2006. But cursory internet research showed me that even a “cheap” Dutch oven would cost me at least a week’s grocery budget, and I wanted to improve my results without spending money on equipment that I couldn’t afford. To test the limits of frugality, I decided to try an alternative: an aluminum foil roasting pan that I bought for $4 at my local grocery store.BA's Best Bread relies on the Dutch oven method.\nPhoto by Michael Graydon and Nikole HerriottHere’s what I did: I shaped my bread dough as usual, and gingerly plopped it onto a parchment-lined rimmed baking sheet (the parchment is critical to prevent sticking). I then covered it with the overturned roasting pan while it completed its final rise. After letting the dough rise and preheating the oven to 485°, I lifted the cover and slashed the loaf. I then placed the roasting pan back over the loaf to create the steam chamber my bread would need to get a good oven spring. (For bread-heads out there, I’ve also tried this with the sort of dough that needs to rise in a basket: When the dough was fully proofed, I carefully transferred it to the parchment-lined rimmed baking sheet, made my slashes, and immediately covered it with the foil roasting pan and popped it in the hot oven. If you’re working with a high-hydration dough that rose in a basket, it's important to slash the dough and get it in the oven right away—otherwise it will tend to spread outward too much.)Halfway through trying my improvised steam chamber for the first time, I had a moment of self-doubt. Peeking at my loaf in progress revealed that it had risen nicely, but had not browned at all. I removed the roasting pan cover for the second half of the baking time and crossed my fingers. As soon as the loaf of bread came out the oven twenty minutes later, I knew all was well. All of the problems that had plagued my previous loaves were gone: This one was shapely, with a freckled golden-brown crust that crackled softly as the loaf cooled. The crumb was more airy, and the crust more flavorful, than any other loaf I’d made.Now, five years (and five moves) later, I am still using that same battered aluminum foil roasting pan for every loaf of bread I bake. In my experience, the foil roasting pan works with all sorts of crusty bread, and it's nice because, without the restrictions of the Dutch oven, you can try loaves with different shapes (I sometimes make short baguettes this way). The foil pan has outlasted numerous other kitchen gadgets that took up too much space or were too annoying to pack and unpack. It’s had the same beneficial effect on my bread in each of the five different ovens I’ve baked in. I call it the Bread-erator 2015, and it has a place of honor in my kitchen. (And no, I still don’t own a Dutch oven.)Emma Barker is a home baker who has been baking bread for the past five years. In 2017, a loaf of her cheddar and chive bread won a blue ribbon at the California State Fair.Explore Bon AppétitBasically on a BudgetBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-20", "author": ["Condé Nast", "Emma Barker"]}