{"id": "11d00dc6258c292de8d8f59d0288effa", "url": "https://www.bonappetit.com/story/dc-beltway", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "To Travel the D.C. Beltway Is to Sample the Flavors of the World  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTo Travel D.C.’s Beltway Is to Sample the Flavors of the World Try cheesy pupusas, fiery Korean-fried chicken wings, and aromatic jollof rice—all on one tank of gas.By Amiel StanekJanuary 5, 2022FacebookTwitterEmailPhotograph by Scott SuchmanFacebookTwitterEmailIf you live anywhere near Washington, D.C., the Beltway—also known as Interstate 495, the highway that encircles the nation’s capital—is synonymous with traffic jams and gridlock. If you don’t live near the D.C. metro area, the Beltway is a metaphor for a whole different kind of gridlock and political unpleasantness. But this 64-mile stretch of asphalt does have one very special thing going for it: a whole network of suburban communities in Maryland and Virginia that are as diverse as they are delicious to explore. Truly, to travel the Beltway is to sample the flavors of the world. Cheesy, crisp-edged pupusas, lamb-fragrant hand-cut noodle soups, fiery Korean-fried chicken wings, and aromatic jollof rice, all on one tank of gas. Who says driving in circles has to be a bad thing?The EssentialsWhen to Go: Late spring or early fall to avoid swampy summertime weather.Where to Stay: Stretch your legs and stay a while at D.C.’s Line hotel, which is housed in a historic Adams Morgan church and offers hip in-house dining options.What to Bring Back: Capital City Mambo Sauce, D.C’s iconic sweet, sour, and spicy condiment with a storied past.Eden CenterYou could spend an entire week exploring Eden Center, a sprawling Vietnamese shopping plaza in Falls Church, VA, and never get a bad meal. Must-trys include: takeaway snacks from Cha Oc Gia Huy like bò lá lôt, thumb-size nubbins of ground beef wrapped in betel leaves; fried fish cake sandwiches on crackly fresh bread from Banh Mi So 1; and any of Banh Cuon Saigon’s namesake rice rolls and noodle soups. Ruan Thai RestaurantFried dishes are especially standout at this 24-year-old Wheaton, MD, institution. Start with the Yum Watercress, tangles of battered greens tossed with crispy bits of seafood and handfuls of herbs. You’d be wise to center a meal around the whole fried flounder bathed in Thai-basil-perfumed lard prik sauce, with plenty of sticky rice on the side for scooping. La Casita Pupuseria & MarketPhotographs by Scott SuchmanAnytime is a good time for pupusas at the original location of this beloved Salvadoran chain—La Casita is bustling from 8 a.m. until past dinnertime most nights. The cheetah-spotted disks of griddled masa served here, some oozing with real imported quesillo, are outstanding, as is the pan de dia, a steamy breakfast sandwich stuffed with eggs, beans, crema, and avocado.Northwest Chinese FoodPhotographs by Scott SuchmanSpecializing in dishes from Shanxi province—a cuisine that can be hard to find even in big city Chinatowns—this phenomenal sliver of a restaurant is just steps from the University of Maryland’s College Park campus. Handmade noodles are the order of the day, whether stir-fried with chile oil or suspended in lamb and wood ear mushroom soup. Be sure to grab a couple of rou jia mo—stuffed flat buns—for the road.Naija CafePhotographs by Scott SuchmanD.C. proper has no shortage of excellent West African food, but it’s worth driving a few miles south of the Beltway’s southernmost point for a taste of Naija Cafe’s specialty: smoky, delicately spiced and grilled goat asun, a Nigerian favorite. But even if the goat is sold out (it happens!), the rest of the menu will make the trip count: pepper soup with an entire tilapia cooked to perfection; aromatic jollof rice to accompany a tender leg of tomatoey pepper chicken; and thick, nutty egusi soup, made from ground melon seeds cooked down with greens, spices, and dried fish.Choong Man ChickenAnnandale, VA, is flush with stellar Korean options, but fried chicken fanatics need look no further than Choong Man Chicken, an outpost of a popular chain serving crave-worthy and highly idiosyncratic styles of crispy poultry. Snow onion chicken is as unique as it is wonderful, mounded with paper-thin shavings of raw onion and a sweet mayo-based sauce, while “tikkudak” versions are kissed with smoke after a post-fry stint in a charcoal oven.Bethesda Crab HousePhotographs by Scott SuchmanIf you visited the great state of Maryland without eating blue crabs, were you even there? This no-frills seafood shack has everything you'd want and nothing you don’t: long picnic tables covered in brown paper, beer by the pitcher, and cafeteria trays piled high with steamed and spiced crustaceans sourced locally when in season and domestically if not. Walk-ins are likely to be served medium-size crabs, but if you’re after larges or jumbos, call ahead to reserve them.Kuya Ja’s Lechon BellyPhotographs by Scott SuchmanPork is the star of the show at this hip Filipino strip mall storefront—whether it’s ground and mixed with shrimp to stuff crackly batons of lumpia, braised and fried crisp to top rice bowls, or added to silky coconut-simmered spinach and kale laing. But the main attraction is right there in the name: lechón, glorious lechón. We’re talking rich slow-cooked pork belly redolent of heady lemongrass and ginger and crowned with mahogany shards of beyond-crunchy skin.It’s Only NaturalThe Beltway itself may not be scenic, but here are a few of our go-to places in the area to get a breath of fresh air (and bring a picnic).Rock Creek Park: 1,754 acres of city park wind through the northwest quadrant of the city, with tons of trails and historical sites to explore.Kenilworth Park & Aquatic Gardens: This peaceful refuge on the eastern edge of D.C. is beautiful year-round but especially so in July when the lotuses are in bloom.Winkler Botanical Preserve: Located southwest of the city, this verdant 44-acre oasis offers easy strolling, babbling streams, and a waterfall.Wheaton Regional Park: Featuring a miniature train and a 107-year-old wood carousel, this is the spot to reward car-cranky kids.Explore Bon AppétitTravelRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-05", "author": ["Condé Nast", "Amiel Stanek"]}