{"id": "11d3794b40f4d509cba6534d2bb2f6c9", "url": "https://www.bonappetit.com/story/response-to-nationwide-uprisings", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "Food Has Always Been Political | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFood Has Always Been PoliticalBon Appétit’s editor in chief Adam Rapoport on how we’re covering the nationwide uprisings.By Adam RapoportMay 31, 2020FacebookTwitterEmailPhoto by Kerem Yucel / AFPFacebookTwitterEmailOn Friday morning at 10:30 a.m., several of us editors at Bon Appétit jumped on a Zoom call to discuss how we were going to cover the uprisings sparked by George Floyd’s killing. As a food brand, we’re often talking about recipes, cooking techniques, and emerging restaurants. But we also understand that food is inherently political, and there’s no getting around that. If you need proof, look no further than the recent pandemic. As we’ve documented in our daily Restaurant Diaries, restaurants are scrambling for PPP loans and undocumented workers are falling through the cracks.In recent years, we at BA have been reckoning with our blind spots when it comes to race. We still have work to do. But one thing I know is that our editorial mission—besides recipes and home cooking—is to cover the most important stories of the moment as they relate to food. And as food businesses across the country stand in solidarity with George Floyd and others before him, our mandate could not be more clear.So, as an editor, the question I’m now asking our team is how do we locate the intersection of food and politics in this current moment? And how can we report on this convergence in a way that is engaging and useful to our millions of readers?After the meeting on Friday, we got to work. That evening on the site, Priya Krishna posted a beautiful as-told-to story with Minneapolis chef and restaurateur Louis Hunter, whose cousin Philando Castile had been killed by police four years prior. On Healthyish—a site to which inclusive wellness has always been core to its mission—we posted Jesse Sparks’ thoughtful, personal, and service-forward piece on mental-health resources for the Black community.This week on the site, look for an article with Minneapolis restaurateur Tomme Beevas, who owns Pimento Jamaican Kitchen, which was targeted by white supremacists this weekend as it provided fresh water and supplies to protesters. In the days and weeks to come, you’ll see more stories from restaurant owners and staff at the front lines of these protests. We’ll be spotlighting Black-owned food businesses in cities nationwide. And you’ll see us tackling more of the racial and political issues at the core of the food world.In the meantime, we encourage you to donate to organizations supporting racial justice like the ACLU and the NAACP, and to support the Black-owned food businesses in your own neighborhood. We don’t have all the answers. We know we have work to do. Food has always been political whether we say it or not. Now is the time to say it.Explore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-31", "author": ["Condé Nast", "Adam Rapoport"]}