{"id": "11ed989fb4859819ff3cb3a7fa564c51", "url": "https://www.bonappetit.com/story/ge-opal-nugget-ice-maker-cyber-monday", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "A Nugget Ice Maker Means You Can Have the “Good Ice” Whenever You Want | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingA Nugget Ice Maker Means You Can Have the “Good Ice” Whenever You WantThe best ice is nugget ice and the best nugget ice maker is GE Opal.By Lauren JosephNovember 29, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’ve often had a feeling I might be living under a rock. Somehow, despite owning a smartphone/using social media/being required to use the internet for my job, I’ve never seen the meme, learned the dance, or been able to tell you who is an “old” or “not an old” based on where they part their hair. Does this make me cheugy? What is cheugy?So the good ice, the pellet ice, the GE Profile Opal nugget ice? That’s a niche too small and too cool for my unhip existence. But like the rest of the internet, I did (if a few days late) read along as The New Yorker’s Helen Rosner compared the crispy layers of said ice to “well-laminated pastry.” After years of being out of the ASMR loop, the idea of ice that “makes a soothing, gently percussive shuffling sound” sent a pleasant shudder down my spine. GE Profile Opal Nugget Ice Maker$529 $499 at AmazonWhile normal ice is unforgivingly solid, a chipped tooth waiting to happen, the good ice is cush. Doused in a fountain soda or a cool pour of lemonade, it becomes a chompable little snack in your drink, a sensory experience extending beyond the brute force of frozen. These air-pocketed little nuggets are the main attraction at the Coffee Bean & Tea Leaf, Chick-fil-A, Sonic, and elite mall food courts. Also hospitals, where pellet ice is prized for its low choking risk and chewability. While you can, apparently, roll up to a Chick-fil-A and purchase a five-pound bag of chewable ice, there is also a way to have the good ice at home whenever you want—the GE Opal Nugget Ice Maker.I turned to TikTok, a social media platform I had heard about to learn more. For hours I lapped up videos of expansive suburban kitchens, a glossy GE Profile Opal Nugget Ice Maker churning away on each counter. The Opal, you see, is not only Rosner’s choice, but also the rest of the internet’s. Affectionately called She across TikTok, like a seafaring vessel laden with precious cargo, the Opal churns out a whopping one pound of fresh ice per hour. She doesn’t need to be hooked up to a faucet—just fill up the water reservoir and wait as She quietly whirs away, then use the cute included ice scoop to fill a Big Gulp–size cup and aah. If your tap water isn’t filtered, She does that too, of course; if you’d like to schedule your next batch of ice via the mobile app, go ahead. This is primo ice making; expect all the features. The whole contraption, while obviously bigger than the plastic tray that gives you stale, freezer-burned ice bricks, is still smaller than a microwave—a reasonable countertop footprint even if your kitchen is, like mine, definitely not suburban-size.At full price, the $529 GE Opal Nugget Ice Maker is not a flip purchase. But it’s on sale for the holidays, and after hours on TikTok I’ve yet to find someone who’s had buyer’s remorse. Each effusive video is tinged with the slightly embarrassed pleasure at having sprung for such a nonessential appliance. Rosner writes, “The GE Opal was an absurd purchase, unnecessary and indefensible. But it brings me the good ice, which brings me an absurd amount of delight.” I use my Vitamix and my espresso machine every morning—and for the price of those two I could have purchased three GE ice machines—but my love for them cannot hold a candle to the passionate, obsessive ardor that Ice People have for their Opals. If you’re going to splurge for one big-ticket item this season, why get something practical like a vacuum when you could buy yourself an unending supply of frivolous joy?With no childhood memories of Sonic ice myself, I’m still mulling it over. But just in case, I asked my dentist. “I can’t ever endorse ice crunching,” he told me. “But that soft food court ice? That’s not as bad. Actually, I’ll admit it...it’s kind of good.”It's cocktail time:Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-21", "author": ["Condé Nast", "Lauren Joseph"]}