{"id": "11ee553ec06d0abcdeaefa67c8930c34", "url": "https://www.bonappetit.com/story/rancho-meladuco-dates", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "These Medjool Dates Are Sweet, Fudgy, and Basically Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Medjool Dates Are Sweet, Fudgy, and Basically DessertSeriously, if you love dates, Rancho Meladuco Medjools will blow your mind.By Sarah JampelDecember 2, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are eating, drinking, and buying right now. Next up, Sarah Jampel writes of her love for Medjool dates from Rancho Meladuco.When I was about 30 weeks pregnant, I ordered six pounds of Rancho Meladuco Medjool dates and diligently ate two a day. My husband thought this was because I was trying to induce or shorten labor—some say there’s a connection between date consumption and a faster, easier labor (others say that more research is needed). But any correlation was, for me, just a farce. See, the best part of pregnancy—second only to the part about the power of the human body yadda yadda yadda—was having the ultimate reason to eat as many dates as my heart desired under the guise of “functional food.”Photograph by Isa Zapata.  Prop Styling by Paige HicksRancho Meladuco Signature Medjool Dates$20 at Williams Sonoma (1 lb box)$38 at Williams Sonoma (2 lb box)And the Rancho Meladuco Medjool dates, grown in California’s Coachella Valley, are the best I can get my paws on here on the East Coast. They’re ridiculously plump and sticky-sweet, like the best dark brown sugar, and their texture is so soft and luscious, it’s almost fudgy. I store them in their cardboard boxes in my fridge, where they keep for months and solidify slightly, resulting in an even more satisfying chew. I don’t blend them into shakes or purée them for sticky bun filling. (Rancho Meladuco actually sells imperfect “grinders” intended for these situations.) Instead, the best dates are, in my mind, meant to be savored slowly, devoured on their own, admired glorious and whole. For a few lucky visitors to our apartment, I’ll offer them as a gesture of extremely generous hospitality. Occasionally, I’ll make what former food director Carla Lalli Music calls an energy sandwich, removing the date pit and stuffing the cavity with peanut butter (or drippy tahini or tahini plus chocolate chips). Even rarer, I’ll put the dates to work in a salad with celery and feta or, if I’m feeling really luxe, sizzle a handful in a skillet with olive oil, crushed red pepper flakes, and thyme, then spoon them—crispy and caramelized—over a bed of yogurt and scoop it all up with pita.These days the baby is here, but I’m still on my two-a-day date fix. Often, I’ll watch my husband eat three or four in one sitting after dinner. In my mind, I’m calculating when I need to make the next Rancho Meladuco order and wondering, “Hey, what’s your excuse?” But I know that with dates this delicious, there’s no real reason necessary.Date night:Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-02", "author": ["Condé Nast", "Sarah Jampel"]}