{"id": "11f0f7176e2f8d9a61ffd863e87b2176", "url": "https://www.bonappetit.com/recipe/simplest-rosti", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Simplest Rosti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueSimplest RostiBy Chris MoroccoMarch 16, 20214.1(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintShredding and squeezing out potatoes, just like when making latkes, helps create a supremely crisp rosti that serves as a base for eggs and dressed greens. An oven finish means there’s no flipping required, keeping this dish nice and simple.Ingredients4 Servings2large or 3 medium russet potatoes (about 1½ lb.), scrubbed1small onion, very thinly sliced1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepper½cup extra-virgin olive oil, divided1small garlic clove, finely grated2Tbsp. fresh lemon juice1Tbsp. mayonnaise1tsp. Dijon mustard2Tbsp. finely grated Parmesan,  plus more for serving6large eggs2large handfuls arugula, romaine leaves, or Little Gem lettuce leavesPreparationStep 1Preheat oven to 400°. Grate potatoes on the large holes of a box grater. Transfer to a fine-mesh sieve and add onion; squeeze to expel as much water from potatoes as possible. If you want, wrap in a kitchen towel to help soak up the excess water. Sprinkle with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, season with pepper; toss to combine.Step 2Heat ¼ cup oil in a large ovenproof nonstick skillet over medium-high. Add potato mixture and press firmly into an even layer. Cook, shaking pan a few times (potatoes may stick at first, but just keep going; they will release), until deeply browned underneath (carefully lift with a spatula to peek), 8–10 minutes. Transfer to oven; bake until rosti is cooked through (pluck a bit off the top and taste for doneness), 18–20 minutes.Step 3Meanwhile, whisk garlic, lemon juice, mayonnaise, mustard, and remaining ¼ cup oil in a large bowl until smooth. Whisk in 2 Tbsp. Parmesan and season with salt and pepper. Set dressing aside.Step 4When rosti is cooked through, remove from oven and evenly crack eggs on top; season with salt and pepper. Bake until eggs are just set, 10–12 minutes.Step 5Add arugula to reserved dressing and toss to coat. Top rosti with salad.How would you rate Simplest Rosti?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis was ok. I expected it all to come together and be more interesting as a whole. But it was pretty bland — let's be real, it's just baked potatoes and onions. We had to dunk a lot of hot sauce on it. CJSan Diego11/7/2021This is delicious. I’ve made it three times. It’s great for doubling when you have company. I started leaving the Mayo out of the dressing and enjoy it more. AnonymousLos Angeles, CA 5/30/2021I only made the Rosti part of this recipe. I will be holding onto this recipe for its versatility. I put asparagus spears in the oven at the same time as the Rosti. They were done at the same time, though without the eggs I think total time in the oven was about five minutes less. We had it with smoked salmon and gravlax sauce. Topped it all with chives, capers and more dill.ToskanNY, NY4/20/2021I have potatoes to use up, and frankly wasn't expecting much from this. Well, I still have potatoes and will be making this again in a few days. It was fantastic, and yes, stupid simple. I used a bag of spinach, not arugula, and will by more spinach for the next round. The wife's add was pancetta (like sprinkles) and I'll snip chives over mine so it's more onion forward, but as it stands, it's excellent.PattieNJ4/4/2021This was delicious! A few tweaks: I switched the potatoes to the broiler for about 5 minutes before putting the eggs on. I then switched back to the oven to cook the eggs. This allowed for crispy potatoes on both the top and bottom of the dish, while remaining “potatoey” in the middle. I also added extra veggies to the salad - cherry tomatoes and julienned green peppers - to make the dish feel a little more like a meal. I’d definitely do this again! Amy San Francisco, CA 3/26/2021Explore Bon AppétitFritterEggPotatoVegetableRusset PotatoWeeknight MealsMainVegetarianGluten-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Chris Morocco"]}