{"id": "11fa4f56225980fee55776494851afc2", "url": "https://www.bonappetit.com/recipe/khichdi", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Khichdi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKhichdiBy Priya KrishnaAugust 21, 20203.9(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis one-pot Indian mung bean and rice stew was practically made for stay-inside days: Made from pantry ingredients, it requires little effort and is extremely comforting. Feel free to add vegetables to give it more heft (I love to wilt in spinach towards the end), and do not skip the spiced buttery drizzle on top. If you have trouble finding split mung beans, any lentil that's similarly small and split will work well. Rest assured, I've made khichdi with nearly every type of grain and lentil and it's always worked out fine. If you do stray from these ingredients, however, be sure to monitor the water level: You might need to add more as it cooks. This recipe is adapted from my cookbook Indian-ish. Read more about why I love it here. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMesh Sieve$13 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketDutch Oven$80 At AmazonSmall Skillet$40 At AmazonSpoon$24.69 At AmazonIngredients4 servings ½cup split green mung beans, split pigeon peas, or red split lentils½cup any white long-grain rice1bay leaf1tsp. black peppercorns1tsp. ground turmeric1tsp. kosher salt, plus more¼cup ghee or unsalted butter2tsp. cumin seeds2dried red chilesPinch of asafetida (optional, but really good)Pinch of red chili powderPreparationStep 1Combine ½ cup mung beans and ½ cup rice in a fine-mesh sieve and rinse under cool running water until water runs clear. Transfer to a large Dutch oven or other heavy pot (the larger the better, this bubbles vigorously) and add 1 bay leaf, 1 tsp. peppercorns, 1 tsp. turmeric, 1 tsp. salt, and 6 cups water.Step 2Bring to a boil over high heat, then reduce heat to medium and cover pot. Cook, scraping down sides and giving mixture a stir 15 minutes in, until mung beans and rice are tender and mixture resembles a stew, 20–25 minutes. (If your pot lid is threatening to blow, feel free to crack it open slightly.) Remove from heat; taste and season with more salt if needed. Let sit, still covered, while you make the spiced ghee. (Alternatively, you can make this in an Instant Pot. Cook on rice setting on low-pressure 12 minutes and naturally release pressure.)Step 3To make the spiced ghee, melt ¼ cup ghee in a small skillet over medium-high. Add 2 tsp. cumin seeds and cook until seeds start to sputter and brown, a matter of seconds. Remove from heat and immediately mix in 2 dried red chiles, __ 1 pinch asafetida__ (if using), and 1 pinch red chili powder.Step 4Divide khichdi among bowls and add some spiced ghee to each.How would you rate Khichdi?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleLove this, it's a great on it's own and a starting point to add to, and easy on a weeknight. First time I followed the recipe (except used brown basmati, which takes a bit longer, so I let the rice boil for a while first) and it was delicious. Second time I added a bunch of Indian spices I recently acquired and it was even better--threw about 2 tablespoons of soaked fenugreek seeds in with the rice (would add more next time), added dried fenugreek leaves a bit later, put some amchoor powder in after taking it off the heat--all wonderful additions. I thought the spiced ghee definitely added, but it's not make or break in my opinion and it becomes a one pot meal without it, for what it's worth. I would just add cumin, asafetida, red chili into the rice and beans mixture and call it good. Really, don't stress it, it's great. The only thing I would dispute is that this serves 4--maybe as a side, but definitely no more than 2 as a main.AnonymousPortland, OR3/17/2022I used basmati rice and by the time the pigeon peas cooked the rice was all broken down. Not sure if that’s the way it’s supposed to be. \n\nAlso trying to rate is as 2 stars but won’t I cannot. Melanie Australia 4/13/2021I made this with whole mung beans (didn't have split) and accidentally used fennel seeds instead of cumin. Nonetheless it came out great! \n\nI read the comments regarding water content and did drop mine down to 4 cups to begin with, probably around 5 in total. It probably could have used the full amount since mine did come out a little less runny than the photo. I finished mine with the ghee mix (using garlic pwd, onion pwd, and some cumin pwd instead of asafetida) and a pinch for flaky salt. \n\nI think it actually reheats fine! I've kept mine in the fridge for a savory breakfast all week.MaddieChicago2/17/2021Really enjoyed this recipe and look forward to making again. Super comforting. Used red lentils and jasmine rice, only addition was salt when serving. Columbus, Ohio 10/27/2020Not the best for leftovers, but certainly a comforting, flavorful dish for a cold night. I just should have added some vegetables to this. Overall I wasn't blown away.AnonymousBrooklyn, NY10/27/2020This was a good basic recipe that's very versatile. I added my chopped up leftover Caesar Salad Roast Chicken and caramelized shallots to this rice and lentil stew. Everyone loved it and said that it tasted much better than it looked! Hahacarriespnc9/15/2020For how much Priya complains about Americans being afraid of Indian food, it being too hard to cook, or it being too spicy etc, this recipe was bland as hell. I added extra salt in the ghee and the stew. Also added tomato paste, tomatoes and threw in some mustard seeds and cardamom because it was so flat tasting. I did love the crunch of the cumin seeds.AnonymousLos Angeles, CA8/31/2020This was pretty good! I think I would've preferred a regular pot of dal with rice over this, which was extremely soupy even though I only used 4 cups water.dsasala8/30/2020This was really good.  Wife, son, daughter in law, DIL's grandmother, and three grandchildren (3, 5, 6) all liked it, so it's definitely a repeat.  I doubled the quantities, and it was all gone when dinner was finished.  I scaled back the water to 5 cups (yes, 10 since I doubled everything), and used red lentils and brown basmati rice.  It still took a while to boil out the water, so the 4 to 4-1/2 cups cited by others seems like a good idea.  I didn't have asafetida, so I substituted a small pinch of garlic powder.  And for those claiming this recipe is \"Just like the one on ____ website,\"  well, it's not.  Which suggests you are trolling for hits on the other site.  And this recipe is much easier to follow. AnonymousVegas, baby8/25/2020Definitely reduce the water some if you use lentils. Mine took a goooood long while to cook down even though I halved the recipe. Would also not recommend using whole peppercorns ⁠— you'll have a spoonful of porridge with a huge bite of pure peppercorn in it. The basic flavors are great though. The buttery spice is super comforting. Will try again with a little modification. Asafetida can be substituted with a mix of onion and garlic powder in a pinch. I was in a real squeeze so I used Trader Joe's vegan chicken seasoning salt, which contains both along with salt and turmeric. Definitely adds a flavor dimension that's otherwise missing.jelfersSan Francisco, CA7/14/2020Came out too soupy. Far superior recipes for this dish on other websites. Try the one on cookwithmanali.Anonymous6/14/2020Used split green peas and long-grain brown rice, but since I hadn't seen other cooks' comments before I started, I used the full amount of water. It did take a long time to cook off the water, but the resulting porridge is still pleasant and set off perfectly by the chhonk. I used garlic-flavored ghee and swapped in a torn morita chile in place of the smaller, longer type that would be more typical here. Glad to have this recipe in my repertoire!Anonymousda midwest, ya hey6/1/2020For the kichdi I used red lentils and white jasmine rice. For my chhonk I used butter, cumin seeds, crushed red pepper flakes and cayenne. I used 4 cups of water and after cooking covered for 15 minutes I cooked uncovered to get my desired consistency. Will start with 3 cups of water next time and see how that goes. Maybe mung beans need 6 cups but if you use red lentils like me, definitely do not use 6 cups unless you want soup. I’d love to make the chhonk as written but was very happy with how it turned out anyway.AnonymousKentucky 5/21/2020I will hardly ever find a more comforting meal. The chhonk is life-changing.\nI would definitely add the water gradually, I reached my desired texture using just 4.5 cups of water (used red split lentils).AnonymousSlovakia5/3/2020If you are using red lentils like me, use less water like others have suggested! But honestly, you might as well make a dal, as the result was much more like a dal (without aromatics) than the dish pictured here! I would try this again, but with mung beans this time. SiiriUK4/28/2020Explore Bon AppétitStewSoups and StewsIndianSouth AsianAsianPigeon PeaBeanVegetableRed LentilLentilTurmericHerbs & SpicesRiceRice & GrainsQuickEasyWeeknight MealsMainDairy-FreeNut-FreeVegetarianSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Priya Krishna"]}