{"id": "11fd78f980fefad8423a23b9b3ff987a", "url": "https://www.bonappetit.com/recipe/coupe-cafe-amande", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Coupe Café-Amande Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDCoupe Café-AmandeSponsored by NespressoFacebookPinterestTwitterEmailCAVANAUGH2 servingsCrunchy, toasty, and sugary sweet, this unique dessert gets an added kick from Nespresso Variations Paris Madeleine coffee, developed by chef Daniel Rose for our Paris in New York dinner.PrintIngredientsFor the nougatine:¾ cup water2 ¼ cups sugar½ cup glucose3 cups slivered almonds, lightly toastedFor the granite café-amande:1 cup Nespresso Variations Paris Madeleine coffee2 Tbsp. sugar¼ cup amaretto (almond liquor)Recipe PreparationFor the nougatine:Bring the water, sugar, and glucose to a boil in a medium saucepan. As the sugar begins to caramelize, add the slivered almonds and continue to cook until golden brown.Spread the mixture on a nonstick pan and leave to cool and harden. Once cool, roughly chop the nougatine.For the granite café-amande:Mix all the ingredients together in a large measuring cup. Pour into a loaf pan and transfer to the freezer. Once frozen, scrape the frozen Nespresso coffee ice with a fork to make a granite.Serve with the chopped nougatine over vanilla ice cream.Recipe by chef Daniel RoseSponsored by NespressoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}