{"id": "11ff1b30ed954cbc94815bd0a8dca814", "url": "https://www.bonappetit.com/story/chocolate-tahini-bliss-balls", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Bliss Balls With Chocolate Tahini Will Send You To Raw, Paleo Heaven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Chocolate Tahini Bliss Balls Are Perfect for Breakfast, Snacking, AND DessertLike eating raw brownie batter—but without the stomach ache.By Molly BazMarch 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailLet’s be honest, there’s a good chance this is not the first time you’ve encountered a recipe for a healthful, superfood-packed, energy-boosting, raw, paleo bliss balls. If it is, welcome to the world. We have a lot to talk about. But, here’s the thing, regardless of how healthy the ingredients that comprise them are or aren’t, there is no denying that we’ve taken this particular chocolate-tahini bliss ball recipe to a very special place.  A place just a few steps further than the rest. Let me explain.In developing this recipe, it was important to me that the bliss balls were soft, fudgy and reminiscent of a chocolate truffle while still relatively healthy.  They are only two-biters after all, so you really wanna pack it in both flavor and texture-wise for those two bites.  Far too many of the versions i’ve tasted in the past were dense, chewy and tacky, like eating fruit leather more than a truffle. To achieve a smoother and fudgier result, I leaned on tahini to provide both nutty flavor and a creamy, rich texture. The next task was to strike the perfect balance of sweetness with the savory tahini base. A first round, in which I used dates as the sole sweetener, ended up too dense and chewy. So I split the difference, cut back on some of the dates, and added maple syrup to lend a lighter texture. At this point, we were close. To round out the flavor, and because I think you’ll agree that most things are enhanced by chocolate, I added unsweetened cocoa powder.  Finally, I rolled each one in a crunchy mix of toasted sesame seeds and chopped toasted pistachios.What resulted were bliss balls that, in the best way possible, tastes almost exactly like brownie batter without the stomach ache from all the raw eggs, sugar, and oil.  These little guys (and gals, and folks) are sweet, savory, and most importantly extremely versatile—they’re just as perfect for breakfast as they are right before you hit the gym or at the end of a meal when you just CAN’T go to bed without satisfying that sweet tooth.  They will keep for up to a week in your fridge and almost indefinitely in your freezer so you’ll never be left hanging. Try them out for yourself—I think you’ll be blissed out.Follow your bliss:Salted Chocolate–Tahini Bliss BallsThese two-biters are just fudgy and chocolaty enough to satisfy a sweet tooth craving. Consider them an indulgent energy bite: Keep 'em in the fridge, then grab one when the craving hits.View RecipeExplore Bon AppétitHealthyishDateChocolateTahiniRead MorecookingThe Simplest Coconut-Chocolate Mousse Just So Happens to Be VeganBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Molly Baz"]}