{"id": "1213b58f3eb2cd5625c4ebb6757926e8", "url": "https://www.bonappetit.com/story/snack-mix", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "A Snack Mix Ratio That Never Gets Boring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaking Snack Mix Is Easy. But Making Great Snack Mix? That’s ArtHow to make snack mix that never gets boring.By Kendra VaculinDecember 17, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailSometimes all it takes to go from trash rat to lifestyle influencer is one extra step. Here’s what I mean: I have been known to eat dozens of cornichons directly from the jar as a snack, which is a delight and also something no one else should ever witness. But if I take it one step further—in this case, transplanting a few pickles from the jar to a small plate alongside a dollop of whole grain mustard and a cube or two of cheese—we go from Big Yikes to Instagram-Worthy in the blink of an eye. Not every moment calls for going the extra mile, but for days when you feel the spirit moves you, the payoff is great (and often really cute).A snack mix is the obvious step up from eating Cheez-Its straight from the box—though, again, no shame there (remember the pickle jar). In its simplest form a snack mix is two or more snack items combined in a single bowl for a varied eating experience. Technically speaking, a tub of popcorn with a box of Junior Mints dumped into it at the movies is a snack mix. But the format leaves a lot of room for expansion and improvement, as you can tweak the medley of items to craft your ideal blend. I think the perfect snack mix has a few flavor categories it needs to hit, but how you check each box is a matter of personal preference. The ratio is as follows:3 cups bagged snack, like Bugles or Popchips2 cups cheesy snack, like Cheez-Its or Goldfish2 cups cereal, like Chex or Cheerios2 cups pretzel shape, like sticks or rounds1 cup salted nut variety, like peanuts or cashews1 cup chocolate bites, like M&M’s or Reese’s PiecesA mix built using this template is salty, crunchy, cheesy, sweet, and savory, the kind of thing that never gets boring no matter how much you eat. You can certainly scale down as needed, but making a bunch of snack mix at once is never a bad thing, especially when everything is shelf-stable and will keep in an airtight container in your pantry for weeks. It’s easy enough that a kid can do it (and will likely take great pleasure in making each category selection if they’re anything like the power-hungry children I babysat) but theoretical enough that grown-ups can easily get lost in the myriad of possibilities. For a party or a night on the couch, it’s a superlative snack solution.Of course, if you want to up your game a bit, you can absolutely add a coat-and-bake step for an additional layer of flavor and complexity. If you’ve ever made the Chex Mix recipe from the back of the cereal box before, you’ll be familiar with this premise: After selecting your chips, crackers, crispies, and crunchies, you’ll toss the mix in a medley of fat (melted butter or oil), spices, and more before spreading it on a sheet pan and baking until toasted. We have a few such mixes on the site, like the BA Party Mix, which uses Dijon mustard and Worcestershire sauce; this habit-forming mix from a few years ago that nails the sweet and savory combo with nutritional yeast, miso, and honey, and this spicy version from Rick Martinez, where Frank’s Hot Sauce is balanced with dried sour cherries. Follow one of these exactly or let them be a jumping-off point to creating your own evolved Mad Lib recipe—it won’t be the same as dumping Ruffles straight from the bag into your mouth, but it might be deserving of a post on the grid.Explore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-17", "author": ["Condé Nast", "Kendra Vaculin"]}