{"id": "1215ea3f0afa6da4c0989806bd3252bd", "url": "https://www.bonappetit.com/story/grand-opening-chinese-sponge-cake", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Grand Opening's Chinese Sponge Cake Has So. Many. Layers. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow Do I Love Thee, Chinese Sponge Cake? Let Me Count the LayersAt Grand Opening, a pastry pop-up inside Mister Jiu’s in San Francisco, chef Melissa Chou puts a California spin on the classic dessert.By Rachel KartenFebruary 24, 2020FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.At Grand Opening, chef Melissa Chou puts a seasonal California spin on the classic Chinese sponge cake. But, uh, you can only get a slice of it one day each month. That’s because Grand Opening is a pastry pop-up at Mister Jiu’s (a Hot 10 2017 alum!) in San Francisco, open just the second Saturday of every month. From 10 a.m. until they run out, Chou and the team sell riffs on Chinese baked goods, like wife cookies layered with quince and black sesame and chewy brandied cherry nian gao. But the one dish we can’t stop thinking about is the cloud-like Chinese sponge cake. Here Chou breaks down it comes together.The Sponge“A sponge cake is a really iconic Chinese bakery item,” Chou says. “And what makes it appealing is that it’s really soft.” While some versions rely on leaveners, Chou achieves maximum fluff by whipping egg yolks and whites before folding in rice bran oil, sugar, and King Arthur unbleached cake flour.The FruitMost Chinese bakeries feature a pretty standard mix of fruits in the cake, like mangoes and kiwis. Chou instead takes a cue from the seasons, which means strawberries in the summer and mandarins right now. She buys hers from nearby Guru Ram Das Orchards. She loves that they are juicy, sweet, and only slightly acidic—the perfect complement to the rich vanilla-bean-and-beaten-egg-white cream surrounding the citrus chunks.The Lychee LayerIn the middle of the cake, Chou slides in a lychee gelée. It’s a nod to the fruit jams typically found in traditional Chinese sponge cakes. Because fresh lychees are hard to come by, she relies on a frozen French purée and mixes it with gelatin for the gelée. Chou spreads the gelée over a pastry cream made of cream that’s steeped and then strained with toasted coconut and coconut milk.The Tippity TopChou makes not one but THREE different creams for this cake. “Though they’re subtle, the idea is that there are lots of textures,” she explains. While the two creams inside the cake are light and airy, the crowning layer is a mascarpone-and-whipped-cream mixture to add some heft and tang.Explore Bon AppétitRestaurantsDessertDish DecodedRead MorecultureThis Dive Bar Is Turning Out the Best Burger in OaklandBy Julia KramercultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenrestaurantsChef Pierre Thiam of Harlem’s Teranga Makes Classic Jollof Feel FreshBy Jesse SparkscultureThe Halo-Halo at Philadelphia’s Sarvida Is 5 Layers of PerfectionBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Rachel Karten"]}