{"id": "1222fc1f09ce0a2880dd7018aebf1777", "url": "https://www.bonappetit.com/story/right-way-to-make-pb-and-j", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "6 Hot Takes About the Right Way to Make a Peanut Butter and Jelly Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture6 Hot Takes About the Right Way to Make a Peanut Butter and Jelly SandwichWho knew there could be so many opinions about three ingredients?By Bon AppétitFebruary 26, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe peanut butter and jelly is the simplest sandwich in existence, right? Not once you start asking people the right way to make one. We talked to six chefs across the country about their particular methods for crafting the classic and they were as particular as you might expect. Here’s how they do it:“I always use soft bread—milk bread or brioche—then I spread cashew butter and strawberry preserves on each side. I like the chunky fruit. I sprinkle a little sea salt on the inside. That’s it. My sandwich is not toasted, it still has the crusts, and, of course, it’s cut diagonally because it’s very important to have equal parts preserves and nut butter in each bite.” —Julia Jaksic, Cafe Roze, Nashville“I get really good creamy peanut butter and, to give it some texture, I crush some plain peanuts for crunch. Then there’s a layer of strawberry jam. I slice fresh strawberries over the top—it heightens all the strawberry flavor and you get a nice contrast of sweet, acidic fruit. And then, for me, it’s gotta be cut on a diagonal. That holds everything together the best as opposed to straight across. You can get good corner bites of a sandwich that are a little crusty.” —Peter Lemos, Wax Paper, Los AngelesStacks on stacks.\nPhoto by Alex Lau“I like to slather on an equal proportion of crunchy peanut butter to jam on a country loaf (it helps that my husband is a bread master).  Crunchy peanut butter is important for a bit of textural contrast, and when it comes to the jam, I always reach for something with a good amount of acidity.  Apricot is my favorite.” —Elisabeth Prueitt, owner, Tartine Manufactory, San Francisco“I’m into Concord grape jelly and Skippy super chunk on thick-cut milk bread. I like it to squish a little bit. I build it so that both sides have peanut butter and then the jelly is in the middle. It’s a more symmetrical bite and you’re not getting any preserves leached onto one side of the bread.” —Tommy Habetz, Bunk Sandwiches, Portland, OR“For the perfect PB&J at my house, we always use potato bread because that’s our favorite bread. I like to spread a little butter on the outside of the bread and toast it on a cast iron griddle—just on one side—so you get a Texas toast thing going on. There’s a little crispiness but the inside is nice and soft. I like heavy amounts of organic unsweetened creamy peanut butter and strawberry jelly of equal portions, each on one side. And I’m a whole sandwich kind of guy. I’ll cut them in half at the restaurant for presentation, but at home it’s about enjoying a good sandwich.” —John Bates, owner and chef, Noble Sandwich Co. in Austin“I’m a huge fan of spice so I mix a little sambal into my peanut butter. It reminds me of chicken satay. Then I add a few strips of bacon because I’m indulgent, and blackberry jam. I like how all the flavors work together: salty, sweet, and fatty. I’m not particular about the bread, but I do like having it toasty. Since I don’t have a panini press at home, I put it in a pan, sit a brick covered in foil on top, and flip it. If I’m being all fancy, I’ll cut it in half, but usually when I make this I’m standing over my sink.” —Casey Rebecca Nunes, chef, Media Noche, San FranciscoHow about a PB&J in pie form?Explore Bon AppétitSandwichJellyPeanut ButterRead MorecookingWe Didn't Think PB+J Could Get Any Better Until We Made It Like ThisBy Chris MoroccocookingThis Is the Best Peanut Butter of All TimeBy Claire SaffitzcultureA Definitive Ranking of 23 Bonne Maman FlavorsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-26", "author": ["Condé Nast", "Bon Appétit"]}