{"id": "123a07d2862701f20a343326df13d299", "url": "https://www.bonappetit.com/story/cannoli-recipe-victoria-granof", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "This Sicilian Cannoli Recipe Isn’t What You’ll Find In Little Italy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNow That’s What I Call a Cannoli: A Recipe That Even a Sicilian Grandmother Can LoveCannoli queen Victoria Granof showed us the way.By Alex BeggsDecember 5, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailThe car was filled with boxes of cannoli. But you can’t have that. Cannoli get soggy; they can’t sit around, waiting. So Victoria Granof stopped the car on a street in Sicily, in a tiny mountain town famous for cannoli. An old widow in a black cloak crossing the street with her rickety cane caught her eye. Victoria got out of the car and offered the woman some of her cannoli. It just made sense. But then the widow began slashing the air in front of her with her cane, flashed her gums and shouted, “Can’t you see I have no teeth?!” She smacked Victoria’s hands with her cane adding, “Pero, m’arrangio, signorina.” She’ll make it work. Then she took those cannoli.That story, and many others just as wonderful, are in Granof’s 2001 cookbook Sweet Sicily. When we decided to develop a cannoli recipe for Bon Appétit—and not that Little Italy tourist stuff packed with powdered sugar—she was the first person we called. The renowned food stylist and Le Cordon Bleu trained chef and pastry chef shared with us her cannoli knowledge, gleaned from on-the-street and in the kitchen research. Like, did you know one cannoli is a cannolo? That cannoli means “pipes”? That, as the theories go, cannoli were first made by nuns to celebrate lent? That the shape is believed to be an imitation of ancient stone columns, a symbol of fertility in ancient Greece? How about that.d i v i n e\nPhoto by Chelsie Craig, Food Styling by Kate BuckensWhat sets this cannoli recipe apart is that it replicates the cannoli in that mountain town, south of Palermo. They’re made with fresh sheep’s-milk ricotta, which has a hint of funk, and a tang that balances the rich creaminess of the cheese. “It has a greener flavor,” Granof told me. “It gives your palate more things to experience besides just sweet.” But since sheep’s-milk ricotta is not so easy to find over here in the States, we developed a work around: We add a bit of plain goat cheese to the cow’s-milk version to get that tang back in. In comparison, most bakeries in the U.S. add powdered sugar to stabilize the watery ricotta, Granof told me. You’re left with a grainy, super sweet, one-note pastry cream, which is fiiine, in a certain time and place. Not here, not today, though.These cannoli de Victoria Granof have a light and airy, bubbly shell, with a tangy creamy filling dotted with chopped chocolate. You can sprinkle the edges with bright green Sicilian pistachios or slivers of candied orange (a variation on the candied cucuzza squash they used in the convents way back when, Granof told me), or even more chocolate. There are some details in the process, however, that cannot budge.Behold, Victoria Granof’s Cannoli Manifesto, “mostly non-negotiable”:USE LARD for lighter shells that come out completely dry. Don’t blame me if you use oil and they turn out hard and greasy. (You can use the leftover lard to confit a batch of duck legs later.) Knead the dough by hand until it’s completely smooth and small blisters begin to appear below the surface. Too little kneading will result in large air bubbles that explode and make the shells come unfurled.DO NOT wrap the dough too tightly around the tubes. You want the fat to be able to circulate around the frying shells—and that includes the inner side too.DO let the dough and the filling each rest in the refrigerator for at least one hour but not more than 12. The dough needs to relax so the shells aren’t tough and the filling needs its R&R to allow the sugar to dissolve without having to beat the shit out of it.DO NOT use a food processor for the filling. It will break down the ricotta, making the filling watery. Don’t even use an electric mixer; you want the cheese aerated and fluffy.DO NOT—I don’t care what anybody in the Italian diaspora tells you—use powdered sugar in the filling. Just don’t.DO fill the cannoli as close to serving time as possible, so the shells stay crisp.DO NOT be tempted by other recipes that call for instant coffee or cocoa in the dough for the shells. It makes the dough too dark, and it’s easy to be tricked by the color to think the shells are properly done when they may be undercooked.There you have it folks. The Cannoli Queen hath spoketh! Now get out there and track down some high quality lard, sheep’s-milk ricotta, cannoli tubes, and some friends to help you eat them all.Get the recipe:Classic CannoliRemember, the higher-quality ingredients you can find, the better the cannoli will be.View RecipeExplore Bon AppétitItalianDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Alex Beggs"]}