{"id": "123e31f3bd71ad50316a98842c81b7b6", "url": "https://www.bonappetit.com/recipe/pan-roasted-steak-with-crispy-broccoli", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Pan-Roasted Steak with Crispy Broccoli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssuePan-Roasted Steak with Crispy BroccoliBy David TamarkinJanuary 8, 20194.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintIt’s fast, it’s easy, it’s totally repurposable. Making extra tonight means a stress-free dinner tomorrow (steak sandwiches with fennel slaw, anyone?), a little strategy we call nextovers. Reprinted With Permission From COOK90: The 30-Day Plan for Faster, Healthier, Happier Meals By David Tamarkin, Published By Little, Brown and Company, 2018Ingredients4 servings plus leftovers 2large heads of broccoli (about 2½ lb. total)6Tbsp. plus ¾ cup extra-virgin olive oil½tsp. kosher salt, divided, plus moreFreshly ground black pepper½cup finely chopped shallot or red onion¼cup fresh lime juice312-oz. sirloin, boneless rib-eye, or New York strip steaks (about 1¼\" thick)2tsp. vegetable oil1cup finely chopped cilantro2Tbsp. rinsed capers, coarsely chopped½jalapeño, finely choppedPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 425°. Cut broccoli into large florets with some stalk attached. Divide between 2 rimmed baking sheets lined with parchment or foil. Drizzle each with 3 Tbsp. olive oil; season generously with salt and some pepper. Toss to combine. Roast, tossing and rotating baking sheets halfway through, until crisp around the edges and charred in spots, 35–40 minutes. Season with more salt and pepper if desired.Step 2Meanwhile, mix shallot, lime juice, and ½ tsp. salt in a small bowl. Set aside.Step 3Season steaks generously all over with salt and pepper, pressing to adhere. Heat a dry large skillet, preferably cast iron, over medium-high. Swirl vegetable oil in pan to coat. Pat steaks dry; cook 2 steaks, undisturbed, until undersides are browned, about 5 minutes. Turn; cook until other sides are browned and an instant-read thermometer inserted into the thickest part registers 130° for medium-rare, about 5 minutes. Turn steaks onto fat cap and cook until browned, about 3 minutes. Transfer to a cutting board and let rest 10 minutes. Wipe out skillet, leaving just enough fat to coat pan. Repeat with remaining steak.Step 4Mix cilantro, capers, jalapeño, and remaining ¾ cup olive oil into reserved shallot mixture. Reserve 1 steak and ¼ cup cilantro salsa verde for making the Steak Sandwiches another night. Thinly slice remaining steaks against the grain. Top with salsa verde and serve with broccoli.How would you rate Pan-Roasted Steak with Crispy Broccoli?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis salsa verde was EVERYTHING. So so delicious. I cooked the broccoli for about half the time suggested (20mins) and it came out wonderfully charred - I can't imagine what it would have been like after 35-40 minutes; I would caution others to use their judgement/knowledge of their ovens when cooking the broccoli versus following the recipe as written. I served the steak and broccoli alongside some couscous with the salsa verde on top and it was *chefs kiss* LivToronto, ON1/19/2021SOO delicious! I want to put the salsa verde on top of everything now! This was my first time trying capers and I definitely recommend this if you've never tried them before. Amazing little flower buds, they are!AnonymousCharlotte NC1/18/2020am i correct that the onion mixture, capers, lime juice... is just to top the steak with??\nAnonymous10/21/2019I thought the sauce and steak were a perfect combo.  I used the sauce on chicken for the next several days, the onion mellowed a bit and it was still great.  I don’t eat red meat often but when I do, I’ll whip up this sauce.\n\nlizla21Chicago 3/3/2019This was delicious BUT, our broccoli was crispy and tender at 15 mins at 425 F. (We frequently roast broccoli and were surprised by the suggested time at that high temperature).  We reduced the olive oil to 1/4 cup for the salsa and it really did not need more.  riverineUrbana, IL2/12/2019My partner is a super picky eater and they LOVED this. I did too, so easy and so worth itAnonymous1/24/2019DOPEEE. Perfect easy weeknight dinner when I was craving steak. I had some red wine that I thought \"deserved a steak\" to open - this rocked. Made exactly as listed except used broccolini cause I'd been wanting it and the store was out of them for so long, and just adjusted the portion size cause i'm only one person (i have a serving of uncooked steak/ broc for tomorrow, but made full portion of salsa). This method for broccoli is so effing good - crank that oven up and they get so crispy outside and tender inside - it's amazing. Cheers! (on glass two of wine now)kmarxmarxchicago, il1/24/2019I received my Bon Appetit in the mail Thursday and made this dinner on Friday!  Perfect Friday night dinner after a long week!  Easy and delicious.  The salsa verde was the perfect addition to add a little zing.  I will make this again.  AnonymousOttawa, ON, Canada1/12/2019Explore Bon AppétitSteakBeefMeatBroccoliVegetableEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "David Tamarkin"]}