{"id": "124237125d405673d86da2515e0fae21", "url": "https://www.bonappetit.com/story/reception-bar-matchbook", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "I’m a Matchbook Hoarder, But This One Is My Absolute Favorite | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m a Matchbook Hoarder, But This One Is My Absolute FavoriteI can’t get enough of the garden-inspired matches at Reception Bar.By Bryan FountainAugust 16, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve got a small collection of matchbooks. You could call it a problem. I call it a hobby. I just love them for the designs—especially the ones that are metallic and loud. My girlfriend is the opposite; she’s got a cleaner, simpler aesthetic. But the one matchbook we can both agree on is the one from Reception Bar in New York City.Owner Katie Rue opts for an oversize format with matchsticks in colors that pop and three different vibrant designs as the backdrop. “The backgrounds are actual images of Korean stamps with garden imagery that are zoomed in to become abstract,” Rue says. They’re are a nod to her Korean heritage as well as a natural extension of the bar’s serene secret garden vibes. Soju is infused with ingredients like Korean green pepper and taro. Plants sit in every corner. A glass façade lends a kind of greenhouse look.As a designer myself, I love how she took this motif and ran with it. It’s why every time I visit, I run home with a few of these matchbooks in my pocket.Go there: Reception BarExplore Bon AppétitHighly RecommendBarsDesignRead MorecultureThis Little Incense Burner Makes My Kitchen Smell Better and My Heart FullerBy Bryan FountainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-16", "author": ["Condé Nast", "Bryan Fountain"]}