{"id": "1244896129ca85d91fb063072f3b650c", "url": "https://www.bonappetit.com/city-guides/montreal/venue/elena", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Elena Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealElenaPizza and natural wines go hand in hand at this Saint-Henri pie shopFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for the pizzeria, backyard terrasse, basement coffee shop, all-purpose hangout of our dreams. Nora Gray co-owners Emma Cardarelli, who helms the kitchen, and Ryan Gray, who heads the wine program, transformed this long-vacant building into Elena, a natural wine and pizza heaven.ORDER THE: homemade pastas, veg-forward plates, and pizza (duh), which comes out of the wood-fired oven charred and bubbling with a crust that’s somehow soft and crisp at the same time. Cardarelli and Gray place an emphasis on using products from local farms and natural techniques, meaning the pizza dough is naturally leavened (which gives it that subtle tang) and made from Quebec wheat. Gray’s wine list highlights mostly natural wines from small Italian producers and, though there are only a couple of wines offered by the glass, the staff will pour you a taste from whatever magnums are open.THE VIBE IS: sophisticated and modern, with playful pops of color from the lavender and burnt sienna banquettes. It’s the kind of chic affordable spot you desperately wish was in your neighborhood.PRACTICAL STUFF: Open every day 5 p.m. to 11 p.m. The restaurant fills up quickly, so reservations are recommended Thursday through Saturday via Resy.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVENora GrayThe standout Italian restaurant in GriffintownDrogheria FineRun, don’t walk to this Mile End window shop doling out perfectly tender gnocchiLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}