{"id": "12526a34dbf24d9d4c3d973643eb872a", "url": "https://www.bonappetit.com/story/amy-quichiz", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Amy Quichiz Makes Her Bedroom Into a Dance Floor Before Going to Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAmy Quichiz Makes Her Bedroom Into a Dance Floor Before Going to SleepThe Veggie Mijas founder pairs face masks with disco lights.By Neha KulshNovember 19, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Now that “plant-based” is a wellness buzzword, it’s easy to forget that veganism was a perfectly conventional, even unremarkable way to eat for generations. “People think that veganism is for the rich, but our people have been eating this way forever,” says Amy Quichiz, the 23-year-old founder of Veggie Mijas, a New York–based collective of women of color dedicated to hosting vegan dinners and promoting healthy living through an intersectional lens.“We bring awareness to how folks can eat healthier and how every member of our community can have access through SNAP (The Supplemental Nutrition Assistance Program, aka food stamps) and food pantries,” explains Quichiz. Quichiz’s mother is Colombian and her father is Peruvian; she grew up in Queens, eating mostly Colombian food and staples like corn and sweet potatoes. In the time since Veggie Mijas started, she’s helped the network grow to include chapters in Los Angeles, Miami, and Philadelphia.This Thanksgiving, local organizers in Chicago are hosting a Friendsgiving potluck to celebrate indigenous resilience. Along with guided breathing exercises and plenty of food, the event is a reminder to \"listen to the indigenous community, provide resources, and be gentle with our triggers and traumas. It means celebrating our resilience, our strengths and our weakness and being there for one another,” says Quichiz.Between her Veggie Mijas duties and a day job at a sexual health center, Quichiz knows that it’s important to take care of herself before helping others. On any given day, you can find her perfecting her feel-good bedtime routine, which usually involves trap music, skincare, and comfort food. Here’s how else she calls it a night.Quichiz journaling before bed.\nStorytimeI listen to Locatora Radio, hosted by two great femmes of color, Diosa and Mala, who live in Los Angeles. It’s all about creating radical movements and documenting our legacies. I also listen to Radio Ambulante, an NPR special, where folks from all over the world tell their incredible stories of survival. Most of the time, I cry a lot hearing stories about Colombian women losing their children in environmental or borderland displacements. I love listening to both because there is a balance between reality and escapism.Just add disco lightsWhen I'm in my room, I turn the lights off, put on my disco lights, and dance all my stress away. I dance for like an hour. Currently I am listening to Por Ti and No Me Encuentras, by Tatiana Hazel, a Chicana artist from Chicago. I also dance to MIA by Bad Bunny and Drake, and of course, all of the Isolation album by Kali Uchis.Daily temperature checkI try to write in my journal. I journal every other day and have been writing diary entries since I was 6 years old. I try to write out how I feel, what's going well, what's not going well, just so I can have that record. I also like to read Love Poems by Pablo Neruda.Leaning into face-maskingBefore I go to bed, I wear a face mask. I really love this one called Face to the World by Loba Loca, a queer South American migrant artist. Whenever I shower, I place some herb powder on my palm and rub it lightly on my face. It’s oatmeal based, scrubbed with tonic and cleansing organic powder herbs. I also love the Milk Jelly Cleanser, Mega Greens Galaxy, and Moisturizing Moon Mask from Glossier, and the Cup o' Coffee mask from Lush. I place my face masks in the freezer alongside my pink jade face roller and wait 20 minutes before putting it on. The coolness of the jade gets rid of that extra stress.Quichiz dancing the stress away.\nPhoto by Emma FishmanSelf-preservation and spiritualityOn difficult days, I let myself cry. I also do meditation. I lay out my yoga mat and practice a few breathing techniques and play soft music. This is a moment when I give recognition to myself and God for allowing me to have another day in this life.Scented candles and sweatpantsBefore I go to bed, I always prepare myself a Yogi Bedtime Tea. My girlfriend uses the Figuier scented Diptyque candle, which I love because it smells like a warm winter and makes me want to cuddle and go to sleep. I love coming home and wearing my \"Dressed To Chill\" sweatpants from Chillhouse. They are so cute and the softest, most comfortable thing to wear after a long day.Explore Bon AppétitGoing to Bed withInterviewsHealthyishRead MoreLifestyleHilton Dresden Eats Tuna Melts in Bed and Sketches to Fall AsleepBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-19", "author": ["Condé Nast", "Neha Kulsh"]}