{"id": "126d8f7fbb60c2fbc382ffef357ee1dc", "url": "https://www.bonappetit.com/story/milk-your-corn", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "If You Aren’t Milking Your Corn, Is It Really Summer? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Aren’t Milking Your Corn, Is It Really Summer?Sweet summertime corn is here. And with it, the nectar of the gods: corn milk.By Alex BeggsAugust 12, 2020FacebookTwitterEmailPhoto by Laura Murray, Food styling by Sohla El-WayllyFacebookTwitterEmailRemember when Meet the Parents was the funniest movie, and people loved to do that nipple-tugging gesture, and ha-ha-ha you can milk a cat, and it never got old? Until it did! Circa 2011. So I mostly forgot about it until I had to write this piece. Thankfully, that’s not what we’re doing with corn. Not that. Not that at all.We’re cutting the corn kernels off per usual and then scraping the naked cob with the back of a knife to release the corn milk. That is milking corn. Nothing creepy, unless you want it to be, in which case, what you do in your kitchen is your business.Why do we milk corn? (Not to be confused with this sweet Sichuan corn milk drink.) Because the sweet—and yes, milky—juices are concentrated corn flavor. In Sohla El-Waylly’s new recipe for Corn and Peach Chaat, the corn milk adds sweetness you’d typically get from chutney in chaat, and that sweetness balances the savory chaat masala and spicy chiles and ginger. Also, corn milk is starchy. When you make a dressing with it—raw—as in this recipe, it gets creamy and clings to every kernel.When you cook with corn milk, it really thickens up. Sohla says she makes creamed corn without any actual cream, relying on the corn milk to get the job done.These scallops love corn milk.\n“If you don’t scrape your corn, you’re losing a lot,” Sohla says. Here’s a tip: Don’t cut the corn all the way to the cob. Shave off the flavorful, juicy corn kernel tops and leave the fibrous root behind. That’s the stuff that gets stuck in your teeth anyway, and it’ll leave more material to make corn milk with. Also: It’s important to use fresh, in-season, good corn for this to succeed, she adds. The stuff in grocery stores mid-December is mostly likely too dry and sadly bland.Elsewhere, Amiel Stanek’s admittedly absurd triple corn polenta gets super luscious thanks to starchy corn milk. It thickens Claire Saffitz’s Basically corn salsa (she also smashes the cobs). It sweetens the sauce in Molly Baz’s scallops with chorizo and corn. I also came across a handful of corn recipes that don’t use it and should, and those will remain nameless, but if you’re making ANY corn salad or muffins, or adding it to pasta or a fun random stir-fry—add the milk! Don’t let that sweet summer nectar go to waste.Explore Bon AppétitCornSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-12", "author": ["Condé Nast", "Alex Beggs"]}