{"id": "127ecda37f05ae5c0cbad07542b170ef", "url": "https://www.bonappetit.com/story/the-korean-vegan", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "‘The Korean Vegan’ Makes Cooking TikToks That Get Real, Quick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture‘The Korean Vegan’ Makes Cooking TikToks That Get Real, QuickJoanne Molinaro talks TikTok, tteokbokki, and how going vegan helped her get in touch with her heritage.By Adrienne MateiOctober 21, 2020FacebookTwitterEmailFacebookTwitterEmailI first encountered Joanne Molinaro on TikTok, where her voice cut through the cacophony of Doja Cat and Yung Skrrt samples, serenely sharing improbably intimate narratives in 60 seconds or less. Her account, @TheKoreanVegan, an extension of her four-year-old blog of the same name, has an immediately recognizable style. Food prep videos—frying vegetables for japchae, chopping onions for kimchi jjigae—are accompanied by Molinaro’s unhurried voiceover sharing, for example, an account of being body-shamed, or the misguided frustration her teenage self once felt about her dad’s heavy accent. “I’ve been in the TikTok community for less than two months, and I feel like these people already understand me in a way that would normally take years to convey,” says the 41-year-old. “I think in part that’s due to the algorithm, which brings together people who are like-minded in this community where they feel a little bit vulnerable and bare themselves, and know they’re going to be okay.”TikTok contentThis content can also be viewed on the site it originates from.A lawyer by day, long-distance runner by morning, and author-slash-blogger by night (her first, yet-to-be-titled cookbook is set for release by Avery in autumn 2021), Molinaro has a characteristic efficiency that made her a natural on the short-form video platform, where her followers currently exceed 818,000. “It’s amazing to know that I’m reaching people, and there are so many who relate to me because they’re the child of immigrants, or they had trouble with eating, or they had a fraught relationship with their parents,” she says. And while Molinaro admits that it can be unnerving to be ultra-earnest online, “You don’t get anything in return unless you put something out there.” I called Molinaro in Chicago to talk about childhood memories, using social media to build cross-cultural understanding, and how veganism helped her connect to her heritage like never before.Can you share some of your favorite memories around food growing up?I grew up with my grandmothers, both of them. In Korean culture that’s very typical. My grandmother on my mother’s side was a farmer before she came to the United States. When she came to our first home in Skokie, Illinois, and saw our backyard, it was like, “We have to plant as many veggies as we can!” Every summer you’d see these humongous squash, perilla leaves just growing like crazy. Some of my favorite memories are my grandmothers telling me, “Joanne, you’ve got to pick some chiles and bring them into the house,” or picking the fattest, reddest tomatoes, or a bushel of perilla leaves. And then we’d sit together in the living room—my mom, my grandmas, and my aunts if they were around—trimming the leaves or cleaning the peppers or just preparing the food together. We’d have the Korean newspapers all laid out so we wouldn’t make a mess. There’s nothing more safe than being at home with the women who love you, prepping food that you grew in your backyard.TikTok contentThis content can also be viewed on the site it originates from.Did you have any initial reservations about going vegan?When I went vegan, I was afraid that I would lose a connection to my family, to my culture, to my identity. That was a real anxiety, because quite frankly, when I did a friggin’ google search for it, there were very few Korean vegans out there! And so I was like, Can this even be done? And I think the reason I created The Korean Vegan was to prove to myself that, no, no, no, this is not going to irreparably change your relationship to your family, your culture, and your identity.And how did it ultimately affect those relationships?Ironically, of course, going vegan has strengthened my relationship with my family and cultural identity to the nth degree. Because I had to actually work for it, I had to ask my mom, dad, and my aunts questions, like “What is doenjang?” to make sure it’s vegan! And what happens is, they’re not only sharing factual information—“Oh, Joanne, doenjang is actually fermented soybean paste, this is the way it’s made, it’s usually stored in big jars,” but also they’ll tell me, “I remember when your grandmother made doenjang jjigae, she always added potatoes because you loved potatoes so much.” These are the types of stories that surface when you start asking questions about things that you have taken for granted your whole life.TikTok contentThis content can also be viewed on the site it originates from.What is a staple in your kitchen?You will never find my kitchen without kimchi. Sometimes I will make it on my own, sometimes my aunts will make it for me—that’s usually the best—but now some pretty incredible brands of vegan kimchi are out there. My favorite brand, 80 Million Food, has started making a vegan one, and I’ve got a jar of it in my kitchen right now to make some kimchi pancakes. It’s phenomenal.How do you approach creating your recipes?One of the joys of being an adult is that you get to pick up the pieces of the dish that you like and remove the ones you don’t. That’s how my recipes get born. I’m like, I want tteokbokki but I don’t want it with the spicy sauce because I don’t like it, so I’m going to put goonjung—a soy-based sauce—on it instead. You can’t do that when you’re a kid.TikTok contentThis content can also be viewed on the site it originates from.What is your cookbook going to be like?My cookbook is going to feature a ton of recipes that fall into two categories: veganized versions of traditional Korean recipes and fusion-y recipes, because my husband is Italian-American and we eat a very heady combination of Korean and Italian foods. For example, I prefer red sauce a little sweeter. I consulted my husband’s father, who was born in Rome, when I was developing my red sauce recipe and was like, “Should I use tomato paste?” And he was like, “Eh, all it really does is add a little more oomph, a little more body to the sauce, but you don’t really need it.” But it put this idea in my head: Tomato paste looks a heck of a lot like gochujang, a Korean pepper paste, which also has a little sweetness to it. And I was like, Wait a second, why don’t I replace the tomato paste everyone else is putting in their red sauce with gochujang? And it’s really so good.TikTok contentThis content can also be viewed on the site it originates from.What prompted you to begin sharing more personal stories online?I started sharing stories about my family on my blog (The Korean Vegan) because I was very upset with the 2016 election. I had a very hard time understanding how so many people in this country who I absolutely love, could misunderstand my situation so fundamentally. They were saying, “It’s okay to have someone who is clearly racist as a president because these other things are more important than making you feel okay about being in this country.” Putting aside the betrayal I felt, I saw an immediate and urgent need to build a bridge between people like me and people who would vote for him. I was like, “All right, I have a social media presence, maybe what I can do is give people a reason to see my side of the world.” I wanted them to think about my grandma and her story of becoming a U.S. citizen the next time they heard something about building a wall. She fled North Korea with two babies and was a refugee in South Korea. Because of the immigration laws in the ’70s, she was able to immigrate to the United States, and becoming a U.S. citizen was one of the last things she did before passing away—something she was intensely proud of. Before shutting the door on immigrants or putting up a wall to block them or viewing them as intruders, I want people to see the beautiful roots my parents and my grandparents were able to plant on U.S. soil and understand the hardships they went through to earn that.Who are some of your favorite TikTokers?@WhatsonVisface—she’s so cool, she’s beautiful, articulate, compassionate, generous, and so hilarious and strong. I love her. There’s so many Korean people I follow on TikTok, and one of them is @YoungQim. He’s actually the reason I started a TikTok. I saw a video he did during the BLM movement that really moved me. His passion for social justice, intelligence, and ability to articulate things in such a clever and pointed way opened my eyes to what a powerful tool for activism TikTok could be.Explore Bon AppétitHealthyishVeganKoreanInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-21", "author": ["Condé Nast", "Adrienne Matei"]}