{"id": "1282225f21f61a7aec742e63babbc847", "url": "https://www.bonappetit.com/story/silicone-baby-food-freezer-tray", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "If You Make Your Own Baby Food, You Need This Silicone Freezer Tray | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Make Your Own Baby Food, You Need This Silicone Freezer TrayFreezing mashed beans, broccoli, and sweet potatoes in advance made feeding my daughter 1000x easier.By Meryl RothsteinMay 20, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I never thought I would be the type of person who made her own baby food. It seemed aspirational, something only a dedicated mommy blogger could pull off. But when my daughter was an infant, I realized that I was exactly the type of person who made her own baby food. It wasn’t as impossible as I thought (shout-out to the luxury of full-time childcare and an involved partner), but I won’t pretend it was a breeze either. One thing that made it easier was this silicone baby food freezer tray. It was a hand-me-down from my sister, and I used it almost daily for more than a year—an essential tool in my what-am-I-going-to-feed-the-baby-today arsenal.My baby food wasn’t anything elaborate; I would roast sweet potatoes and smush them up and maybe add a spice or two to expose her to different flavors. Then I'd put a portion into one of the tray's compartments and stick it in the freezer; the food was ready to go whenever I needed it. If I roasted broccoli (without salt when she was little) for my dinner, I’d chop a portion into small pieces and throw them in the tray. If I made some oatmeal for breakfast, I’d set some aside in a compartment or two. If I was having tacos for dinner, I’d smash a few spoonfuls of black beans with my fork and freeze them. I had two trays with six compartments each, and I tried to keep them relatively full with a mix of things so that I’d always have a few options to choose from.My daughter was an infant pre-pandemic, when getting out the door to head to work was (1) still a thing for me and (2) a challenge. The freezer trays meant I didn’t have to waste time or effort each morning figuring out what she was going to eat. I would simply defrost, say, a cube of cauliflower and another of chickpeas and she was set for the day. It took more work on the front end for sure (and the mental load of baby food prep is real), but on those hurried mornings at least, it was truly as simple as opening a pouch or a jar.Making and freezing my own baby food allowed me to feed my daughter exactly what I wanted her to eat, and it was a lot cheaper and less wasteful than individually packaged alternatives. And while I thought I wasn’t the type of go-getter who would make her own cumin-and-cauliflower mash, it turned out I liked cooking for my daughter, just as I enjoy preparing dinner for my friends or carefully assembling a lunch for myself. If only feeding my guests were as easy as popping out a cube of carrots.Photo by Isa Zapata, food styling by Micah MortonBEABA Multiportion Baby Food Tray$25 at AmazonExplore Bon AppétitShoppingHighly RecommendCooking For KidsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-20", "author": ["Condé Nast", "Meryl Rothstein"]}