{"id": "12a33e3eb89ddfe9e5011c186a4b1f9e", "url": "https://www.bonappetit.com/story/should-you-buy-a-food-processor", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Should You Buy a Food Processor? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingReal Talk: Should You Buy a Food Processor?What’s it good for? How do you use it? And more importantly: should you order one immediately?By Christina ChaeySeptember 13, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Rebecca JurkevichFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I didn’t think of myself as an “appliance junkie” before I moved into my current apartment. By Brooklyn standards, it feels luxuriously large, like I could run a restaurant supply store out of the kitchen. As it turns out, all I really needed to change my tune was simply more square-footage: I’m now the co-owner of, among other things, a food processor that I’m surprised to find myself reaching for all the time. After a year of chopping, slicing, shredding, and puréeing, I have some thoughts on whether you, too, should own a food processor.First, let’s talk about what a food processor even is. At minimum, a basic food processor comes with a bowl, a removable lid, a base (which contains the motor), and a very sharp blade. It’s more or less an extremely powerful knife that excels at quickly chopping and grinding tons of different ingredients, from onions to to nuts to hard cheeses, in a matter of seconds. The set of attachments will shred and slice carrots (carrot cake!), cabbage (slaw!), or potatoes (hash browns!). There are a whole host of fancy-pants attachments that can knead bread dough and juice vegetables and fold your laundry and pick up your children from school, but for the purposes of this article, I’ll be talking about the no-frills basic kind.Homemade granola bars, thanks to your food processor.\nPhoto by Emma Fishman, Food Styling by Sue LiI’m going to be upfront here: Unless you’re the kind of cook who regularly makes your own homemade nut butters and energy balls, you don’t absolutely need a food processor (I point out these two foods specifically because I’m convinced you can’t make them at home without one). However, if you do a lot of meal prep or you’re chopping-averse, deathly afraid of sharp tools like mandolines and box graters, or uncertain about your knife skills, a food processor might be a worthwhile purchase to make cooking faster and generally more enjoyable.I find myself pulling out my food processor at least once a week to make my own hummus or bean dips, which I do frequently, as well as to whip together sauces and dips that are meant to have a bit of texture. Because most food processors come with a “pulse” feature that allows you to control how finely chopped up your ingredients get, they’re excellent for making not-quite-smooth-in-a-good-way sauces like pesto (BA’s Best) and other all-purpose green sauces, romesco, salsa, or nam prik, the chunky Thai chile dip. (Conversely, food processors are not great at achieving a uniformly smooth texture, so if you're primarily interested in making silky soups or smoothies and only have room for one appliance, a high-powered blender is the better bet.)You're going to need a food processor for cauliflower rice.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThere are a host of other foods I’ll make less occasionally, but when I do, I’m extremely thankful to have a food processor on hand to get the job done, as it does everything so much quicker than I could do by hand. Take Lauren Schaefer’s Cauliflower Rice Pilaf, for example. Owning a food processor means I don’t have to finely chop an entire head of cauliflower with my chef knife. And I can make falafel at home: First, I chop up the herbs, then I wipe out the bowl and add the soaked chickpeas. There’s no need to dirty a cutting board or a knife.When I’m in the mood to bake, my food processor effortlessly cuts cold butter into flour for flaky pie dough and tall, buttery biscuits. It finely crushes graham crackers for a press-in pie crust (hellooo, frozen margarita pie) and makes breadcrumbs—coarse or fine, you choose—for topping pastas or a bowl of brothy beans. And on the days when I make a couple of gallons of homemade kimchi, it’s a godsend for finely chopping large quantities of garlic and ginger, which would take an eternity to mince by hand. Could I do all of these tasks without a food processor? Technically, yes—but I’d be a much slower (and grumpier) cook for it.A food processor will get you perfectly bitsy breadcrumbs, ideal for pasta.\nMichael Graydon & Nikole HerriottUltimately the most important question that should drive your decision to buy a food processor is: Will you use it? If you can honestly answer “yes” to that question, all that’s left to consider is whether it’s worth the valuable storage or counter space it will take up in your kitchen—and, yeah, the money. A good food processor will last you a long time, but it’s not cheap. (The Test Kitchen’s preferred model, the Cuisinart 14-cup, retails for about $160.) If that’s more than you’re willing to spend (or if you’re just looking to avoid hand-chopping the occasional onion or chile), a less-expensive mini food processor (like our favorite model) might be more up your alley, especially if you have a smaller kitchen.I know the time may come when I have to leave my palatial kitchen behind for a standard closet-sized one. But I’m taking my food processor with me—even if that means I have to store it in my bedroom.Cuisinart 14-Cup Food Processor$230 at AmazonExplore Bon AppétitequipmentFood ProcessorShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-13", "author": ["Condé Nast", "Christina Chaey"]}