{"id": "12a8a05570cfb47b919ef0c2af4bb3cd", "url": "https://www.bonappetit.com/recipe/just-basic-enough-vinaigrette", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Basic Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJust-Basic-Enough VinaigretteBy Chris MoroccoDecember 26, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis is a great excuse to treat yourself to some seriously delicious vinegar—check out this list of our favorites.IngredientsMakes about 1 cup½shallot, finely chopped1garlic clove, lightly crushed½cup extra-virgin olive oil¼cup red wine or white wine vinegarKosher salt, freshly ground pepperPreparationStep 1Whisk shallot, garlic, oil, and vinegar in a small bowl. Season with salt and pepper.Step 2Do Ahead: Vinaigrette can be made 5 days ahead. Cover and chill.How would you rate Just-Basic-Enough Vinaigrette?Leave a ReviewTell us what you thinkExplore Bon AppétitSalad DressingSaladShallotVegetableGarlicQuickEasyDairy-FreeNut-FreeVeganVegetarianGluten-FreeKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-26", "author": ["Condé Nast", "Chris Morocco"]}