{"id": "12b40c3b0c962d2514f0c038a3013042", "url": "https://www.bonappetit.com/story/no-fail-turkey-cooking-method", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "The No-Fail Thanksgiving Turkey Recipe Is Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOur No-Fail Thanksgiving Turkey Recipe Has ArrivedThis end-all-be-all cooking method means turkey that’s always crispy on the outside, juicy on the inside.By Alex BeggsNovember 5, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailIn the Bon Appétit Test Kitchen, being assigned the Thanksgiving turkey is a big deal. It’s a right of passage, a responsibility earned with seniority. This year, Andy Baraghani got the call. “It’s an honor,” Andy told me, “like I’m nominated for an Oscar. It’s just an honor to be nominated. Well, in this case, I won the Oscar.” He started waving away tears (Andy watches a lot of Oscar speeches late at night.)The Thanksgiving menu for 2018 focused on finding the best possible versions of classics; this wasn’t a moment to get kooky, but to get technical. And the bird was no exception. The assignment: Develop a foolproof, always-turns-out-right turkey recipe. Every element was considered to the nth degree. Golden, crackly skin. Juicy interior. Actual turkey flavor. In the end, we got this recipe from Andy, which I’ll break down one crucial point at a time. It’ll be fun, though—a real turkey ride on the way to optimal turkeytown. This is how you get there.First, we dry brineAndy’s recipe calls for a salt and sugar dry rub, massaged all over the bird 12 hours (or up to two days) before the big day. This is the key to a juicy, actually delicious turkey (and chicken too!). That’s because the salt pulls out the water from inside the turkey, creating some salty turkey juices (SORRY there’s no other way to say it) that, after some time hanging out in the fridge, soak back into the bird like the giant meat sponge that it is. The turkey loses a lot of water when it cooks in the oven, but the salt helps the muscles retain more moisture, meaning the turkey will stay moist-er by eating time. The salt also helps loosen up the stringy turkey muscles, making it possible for us to enjoy this thing. Beyond that, and if you like to throw around words like “osmosis,” I highly recommend reading the entirety of J. Kenji Lopez-Alt’s The Food Lab, or just this article on brining. Regardless of what is going on beneath the surface of the flesh, the salt and sugar are amplifying flavor, and the sugar helps with that Norman Rockwell golden amber color once it caramelizes in the oven.Juicy turkey is possible, people. Let‘s make dreams happen.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiWhy dry is better than wet brineOr maybe you enjoy filling a huge cooler or tub, Splash mermaid-bath-style, with salt water? It’s a pain, it’s a mess, and that bucket of brine takes up way too much real estate in the refrigerator. Plus, it ends up waterlogging the turkey and diluting the flavor.Then we glazeThing we all want: a turkey with a cover-worthy sheen and golden color. Get it with Andy’s simple sweet-punchy-herby glaze made of vinegar, honey, Worcestershire sauce, rosemary, garlic, orange zest, and butter. (Can also be accomplished by covering it with butter and leaving it on your roof, Kramer-style??). You paint the glaze on every 30 minutes, which might only be two or three times because...What you need to know about timingThe recipe is timed so that you go hard at the beginning, 450° for 30 minutes, to get some color on the skin, and then go down to 300° for 65-85 minutes (this is for a 12–14-lb turkey). This isn’t your wake-up-at-the-crack-of-dawn all-day turkey marathon recipe.What you need to know about pansRing a bell or something! I have an announcement. This recipe calls for a rimmed baking sheet with a wire rack. Like this one. Without the high walls of a roasting pan, the turkey is able to get color ALL OVER, which we skin-stealers like. But yes, you can still totally do this in a regular roasting pan. (Especially if you’re the clumsy type—it’s a big, heavy turkey on a wire rack.)So yeah, we used a roasting pan in this photo shoot.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiPro tip: Add a cup of water in the bottom of the baking sheet to mix with the turkey juices (AGAIN, MY APOLOGIES). The water keeps the juices from burning and making the turkey taste burnt, even if it technically isn’t. Too much water will steam your turkey though, and while a turkey sauna sounds like some kind of Black Friday wellness deal, we DON’T WANT IT. Steam = soggy skin.What you need to know about the turkey’s internal temperatureStab the turkey with your trusty Thermapen in the thickest part of breast near the neck, and when it registers 150°, you’re done. If that sounds low, don’t be alarmed, it’s going to keep cooking outside of the oven. It’s so big, it’s become a turkey oven itself.Rest that turkey!!!This might be a duh for SOME of you but we gotta repeat: Let the finished bird lie there. On the cutting board, away from prying uncles and sniffy dogs. For at least 30 minutes, to an hour. This thing is an animal. The muscles tighten while cooking, and we want to be able to slice it and shove it into our faces, as animals ourselves. Let it rest to let those muscles relax, to let the inner juices (SORRY x3) redistribute. Will it cool down in that time? NO. It retains heat like an industrial sleeping bag.Any further questions? Ask us. Seriously. Email bonappetitfoodcast@gmail and Carla Lalli Music will be answering all Thanksgiving queries on the BA Foodcast this month.Get the recipe:Dry-Rubbed Roast TurkeyOur never-fail turkey is excellent in every way that every other turkeys often fall short. Period.View RecipeExplore Bon AppétitTurkeyThanksgivingBrineTechnologyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Alex Beggs"]}