{"id": "12ce02af8b8db121dedcc2fe83d05538", "url": "https://www.bonappetit.com/story/mini-grill", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "A Mini Grill for Everyone Who Wants to Grill But Doesn’t Have a Yard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWith a Mini Grill, the World is Your CookoutStep 1: Buy a cheap, portable grill. Step 2: Fulfill all of your summer hot dog fantasies. (So, all of your fantasies.)By Alison RomanJune 20, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Judy HaubertFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Even though I live in a fourth-floor Brooklyn walk-up, don’t have a backyard, and am definitely nobody’s dad, you’d be hard-pressed to find someone who loves to grill as much as I do. And I’m here to tell you that regardless of your situation (mine is far from perfect), you can and should own a grill—specifically a $35 portable Weber charcoal grill.Weber Smokey Joe Portable Grill$42 at AmazonSmall enough to fit inside an oversize tote bag and lightweight enough to actually carry around, this little grill is truly summer’s hottest accessory. Whether you have a complete lack of outdoor space or you’re just not ready to commit to the full-size version, it’s ideal for taking to the park so you can grill among the people, which is an excellent way to spend a Saturday afternoon.Now, this isn’t the time to play pitmaster—the grill is so tiny you’re not building a two-zone fire, nor do you have any business trying to cook, say, a leg of lamb. Instead, I bring along the basics: a grill brush so you can give the grate a quick scrub after you're done cooking; self-lighting briquettes (not my first choice, but they're extremely convenient in this situation); and, last but not least, hot dogs, buns, and bottles of mustard and ketchup.If you bring burger meat—a more ambitious option—you’ll also want to pack a little baggie of kosher salt to season the patties. But no matter what, I always bring some chopped or sliced onions and crunchy lettuce to nestle into the buns along with the grilled goods.Everything else—drinks, chips, extra condiments, salads, and sides—gets outsourced to friends. Which means if I invite you to my grilling party at the park, be prepared to arrive with your best snacks in tow.Oh, you'd like another Party Trick, would you?Bless Your Next Party with Big Dip EnergyAin't no party like a Dip Party!View StoryExplore Bon AppétitParty TricksEntertainingSummerGrillRead MoreThe Basically BurgerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-20", "author": ["Condé Nast", "Alison Roman"]}