{"id": "12de8dd695d42cc95539ad33e882e9bb", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-1", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "The Myth of Healthy Eating With Christina Chaey and Vanessa Rissetto | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Myth of Healthy Eating With Christina Chaey and Vanessa RissettoOn the first episode of the Healthyish podcast, we talk about how the past year changed the way we think about our health.By Bon AppétitJune 17, 2021FacebookTwitterEmailFacebookTwitterEmailWhat does it mean to be healthy in 2021? We spent the majority of this year and last cooking and eating at home, and while we’re so sick of staring into our fridges, we did learn some valuable lessons about our mental and physical health along the way. For the first episode of our six-episode Healthyish series, Amanda Shapiro is joined by BA senior food editor Christina Chaey, who recently wrote about redefining “healthy” for herself, and dietitian and food equity advocate Vanessa Rissetto, to talk about what those lessons were and how we’re cooking (or not cooking) now.ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episodeChristina Chaey on “redefining health”Julia Turshen on coming to peace with her bodyChristina Chaey on cooking lessVanessa Rissetto’s Bon Appétit interviewChristina Chaey’s Fridge Clean-Out Donabe recipeAmanda’s current favorite snackChaey’s current favorite snackHow to ListenListen to this episode through the audio player on this page, or subscribe via Apple Podcasts, Spotify, Stitcher, Google Podcasts, or wherever you get your podcasts to get all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitPodcastsHealthyishRead MorecultureHow I’m Redefining What “Healthy Eating” Means to MeBy Christina ChaeyLifestyleHow Writing a Cookbook Helped Me Break Free From Diet CultureBy Julia TurshenLifestyleWhy I’m Trying to Cook Less in 2021By Christina ChaeyLifestyle“There’s a Nutrition Divide in This Country. So I Became a Dietitian.”By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-17", "author": ["Condé Nast", "Bon Appétit"]}