{"id": "12e70e80c255152744b79ac259c9d992", "url": "https://www.bonappetit.com/recipe/stuffed-cabbage-with-lemony-rice-and-sumac", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Stuffed Cabbage With Rice  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueStuffed Cabbage With Lemony Rice and SumacBy Andy BaraghaniFebruary 11, 20205.0(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWith its crinkly texture, savoy cabbage is our go-to for stuffed cabbage, but the regular ol’ green variety also works. Both will become meltingly tender. The filling is a fragrant and tart mix of warm rice, buttery pine nuts, and lemony sour sumac. A dollop of sour cream is essential for balance (and pleasure).Ingredients4 servings12–14large savoy or green cabbage leaves (from 1 large head)Kosher salt¾cup long-grain white rice (such as basmati or jasmine), rinsed¼cup extra-virgin olive oil, plus more for drizzling1large onion, finely chopped½cup pine nuts1cup finely chopped mixed tender herbs (such as parsley, mint, dill, and/or tarragon)⅓cup chopped golden or brown raisins2Tbsp. sumac, plus more for serving1Tbsp. fresh lemon juice1large egg, beaten to blendFreshly ground black pepper3Tbsp. unsalted butterSour cream (for serving)Ingredient InfoSumac, a tart, citrusy spice generally sold in ground form, can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Line a baking sheet with a clean kitchen towel or a few layers of paper towels; set aside. Working in batches, cook cabbage leaves in a large pot of boiling generously salted water until bright green and pliable, about 2 minutes per batch. Transfer leaves to a bowl of ice water to cool; reserve pot of water for cooking rice. Transfer cabbage leaves to prepared baking sheet and let drain.Step 2Return water in pot to a boil and cook rice, stirring often, until grains swell and rise to the surface, 3–6 minutes (depending on quality of rice). Bite into a few grains to test; they should be al dente (rice will finish cooking when baked inside the cabbage). Drain rice and rinse under cold running water to stop it from cooking further. Drain again and transfer to a large bowl.Step 3Wipe out pot. Pour in ¼ cup oil and set pot over medium heat. Add onion and cook, stirring occasionally, until softened and golden, 7–9 minutes. Add pine nuts and cook, stirring often, until nuts smell toasty and have slightly darkened in color and onion is almost jammy, about 5 minutes. Mix in herbs, raisins, and 2 Tbsp. sumac and cook, still stirring, until herbs have slightly darkened in color and are very fragrant, about 2 minutes. Remove from heat and stir in lemon juice; let cool 5 minutes.Step 4Add onion mixture and egg to rice and mix well; season generously with salt and pepper. Wipe out pot; reserve. Working with 1 cabbage leaf at a time, cut out the thickest part of rib by making a thin V-shape; discard. Place 3 heaping Tbsp. filling in the center, running crosswise across leaf. Starting at the base where you cut the V, fold notched side of leaf up and over filling, then fold in sides and roll up leaf like a burrito.Step 5Arrange cabbage rolls, seam side down, in a single layer in reserved pot. Add butter and ½ cup water and bring to a simmer over medium-high heat. Reduce heat to low, cover pot, and steam rolls until filling is cooked through and leaves are tender, 18–25 minutes.Step 6Divide cabbage rolls among plates; drizzle with oil and sprinkle with sumac and pepper. Serve with sour cream.How would you rate Stuffed Cabbage With Lemony Rice and Sumac?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleHi, can this recipe or parts of it be made in advance?AnonymousCalifornia 7/26/2021I made this tonight with Savoy Cabbage and it was really wonderful. I was afraid it would be too tart with that much sumac but it was perfect. I did take some liberties and followed what another reviewer mentioned and also added a little ground beef. I will definitely make this again. I’m kind of wondering if this filling would also work with grape leaves. I may just give it a try.JadeNew York City12/19/2020We have made this recipe at least 4-5X. I've used any cabbage I could get my hands on, but its the best with savoy since the larger leaves help in rolling it up. We've subbed sunflower seeds and other fun fillings (or veggies) if anything was missing. It's definitely a delicious, and forgiving recipe!Priya PatelNew York City8/4/2020Yum! I used collard leaves instead of cabbage and it worked fine. I also left out the egg by accident and didn't miss it! Portland, ME6/15/2020Great filling, which I followed the recipe exactly--though I agree with others that it is easily adapted to other filings/substitutions.  An exceptional vegetarian main dish or a fun side.Cleveland OH4/29/2020we’ve made this 4-5 times... each time with different herbs, sometimes with a little bit of minced meat mixed in.... always using kale because we have access to lots. It’s the perfect base recipe and concerned my apprehension of personal ability to stuff/roll. Thank you! AnonymousCoimbra,Portugal4/18/2020I changed quite a bit with mine: \n6 HUGE green cabbage leaves. \nCauli/brocolli rice instead of grain, sunflower seeds instead on pine-nuts, leeks instead on onions and didn't have any sumac, so just added a bit extra lemon and some cayenne and some crumbed feta into the rice mix.\nI cut into it and took my first bite, I was not expecting it to taste THAT delicious!! \nWas fun to make and will definitely be making again - its a great 'base' recipe to choose your own adventure.belleofbreeCape Town , South Africa4/5/2020This recipe hits the mark - light, refreshing, citrusy with a sweet cronch.  Killer filling.  I subbed walnuts because that's what I had on hand.  Ordered the linked sumac - worth it.einismineSeattle3/28/2020The tip from the user below saved me! If you are using green cabbage, definitely cut from the bottom to keep the leaves from ripping. This is a good, simple recipe with lots of pantry staples that still feels super nourishing and is fun to make (and eat!). AnonymousIndiana, USA3/27/2020This recipe was lovely, and a fun project during the coronavirus scare. I could only find green cabbage which worked fine. Highly recommend peeling the leaves off from the bottom of the head (near the stem) to keep the more fragile leaf ends intact. I used a very wide (12\"), shallow heavy-bottomed pan to cook the cabbage rolls, which I needed to fit all of them in there side by side. Use the widest pot or pan you have! This was a very light meal, so you might want a side dish or appetizer to help fill you up.soapnanaChicago, IL3/17/2020I look everywhere for Savoy Cabbabe...I guess it isn't in season.  This dish was still a hit!muunbemePark City Utah3/4/2020Flavors in this were great! I DID have to watch a video from a different source to figure out how to prep and roll the leaves, but I'll definitely be making this again!Annie CVirginia 3/4/2020Explore Bon AppétitRiceRice & GrainsSavoy CabbageCabbageLeafy GreensVegetableMainStarterGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Andy Baraghani"]}