{"id": "12e9607e50cc27e3ef544d5ac22043f3", "url": "https://www.bonappetit.com/recipe/rosemary-lamb-with-juicy-tomatoes", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Rosemary Lamb with Juicy Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Rosemary Lamb with Juicy TomatoesBy Carla Lalli MusicMay 22, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintLamb shoulder: Not just for braising! For this grilled lamb recipe, separating the shoulder into a few smaller-size pieces before marinating makes it less unwieldy on the grill and allows you to monitor the internal temperature more easily.Ingredients8 servingsLamb and Sauce13–4-lb. boneless lamb shoulderKosher salt, freshly ground pepper2red onions, coarsely chopped1bunch rosemary, leaves stripped from half of sprigs (about 1 cup)1bunch oregano, leaves stripped from sprigs (about 1 cup)¾cup red wine vinegar¼cup extra-virgin olive oil1cup plain whole-milk Greek yogurt¼cup fresh lemon juice1garlic clove, finely gratedTomatoes and Assembly5beefsteak or large heirloom tomatoes (about 4 lb.)Flaky sea saltFreshly ground black pepper3Tbsp. fresh lemon juice, divided1red onion, halved, thinly slicedExtra-virgin olive oil (for drizzling)PreparationLamb and SauceStep 1Lay lamb shoulder, cut side up, on a work surface. You will notice it’s made up of a few muscle groups, separated by thin strips of fat and gaps where the bones have been removed. Use a sharp knife to separate the shoulder into smaller pieces along these natural seams—you should end up with 5 or 6 pieces of various sizes. Transfer lamb to a glass baking dish and season generously on all sides with salt and pepper.Step 2Pulse onions, rosemary leaves, and oregano leaves in a food processor until finely chopped; set remaining rosemary sprigs aside. Add vinegar and oil and pulse until a coarse purée forms. Season marinade with salt and pepper, then pour over lamb, turning to coat. Cover and let sit at room temperature 2–3 hours.Step 3Mix yogurt, lemon juice, and garlic in a medium bowl. Season sauce with salt and pepper; cover and chill until ready to use.Step 4Do Ahead: Lamb can be seasoned 1 day ahead; cover and chill. Sauce can be made 8 hours ahead; keep chilled.Tomatoes and AssemblyStep 5About half an hour before you plan to start grilling, slice tomatoes into ½\"-thick rounds and arrange on a large platter. Season with salt and pepper and drizzle with half of lemon juice. Top with onion, season with salt and pepper, and drizzle remaining lemon juice over. Arrange reserved rosemary sprigs on top; set aside.Step 6Prepare a grill for medium heat. Without scraping off marinade, transfer larger pieces of lamb to grate and grill until underside is very well browned, about 5 minutes. Spoon some remaining marinade over lamb, turn, and continue to grill, turning every 5 minutes or any time you see a flare-up, until lamb is charred in spots and very well browned everywhere.After large pieces have been cooking about 15 minutes, add smaller pieces to grill and follow same instructions; they take less time to cook, and by staggering the start times, all the lamb will come off the grill within a few minutes of each other. An instant-read thermometer inserted into the center of each piece should register 140° for medium, which is ideal. Start checking smaller pieces after 7–10 minutes. The largest piece will take closer to 30 minutes. As each piece finishes, transfer to reserved platter, setting on top of rosemary. Let rest 20–30 minutes.Step 7Transfer lamb to a cutting board and tuck rosemary sprigs off to sides of platter. Tip platter so that accumulated tomato and lamb juices pool at one end and spoon over tomatoes. Using a long sharp knife, slice lamb into very thin pieces and arrange on top of onion and tomatoes. Season with salt and drizzle with oil.Step 8Drizzle yogurt sauce with oil and serve alongside lamb.How would you rate Grilled Rosemary Lamb with Juicy Tomatoes?Leave a ReviewTell us what you thinkExplore Bon AppétitGreekEuropeanLamb ShoulderLambMeatTomatoVegetableRed OnionOnionSummerEasyMainNut-FreeGluten-FreeKetoHealthyishGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Carla Lalli Music"]}