{"id": "12fbb8fb668e3bd513ce2e4adfbc16ad", "url": "https://www.bonappetit.com/recipe/coconut-ginger-chickpea-soup", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Coconut-Ginger Chickpea Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueCoconut-Ginger Chickpea SoupBy Claire SaffitzOctober 23, 20184.5(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintThis super-easy recipe is a perfect canvas for punchy, crunchy toppers like toasted coconut and mustard seeds with turmeric oil and a zingy chutney. The dal is vegan but full of hearty protein thanks to the chickpeas, lentils, and coconut milk. Let the stew sit for a full 12 hours to let all the flavors really meld together, though this step is totally optional. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servingsMustard Seed and Turmeric Oil¼cup extra-virgin olive oil2Tbsp. mustard seeds½tsp. ground turmericPinch of cayenne pepperKosher saltCilantro-Raisin Chutney1small shallot, finely chopped3Tbsp. chopped golden raisins2Tbsp. finely chopped cilantro stems1Tbsp. fresh lime juice1Tbsp. extra-virgin olive oilKosher salt, freshly ground pepperStew and Assembly3Tbsp. virgin coconut oil2medium onions, peeled, coarsely chopped2heads of garlic, top third removed13\" piece ginger, peeled, thinly sliced1Tbsp. curry powder½tsp. cayenne pepper1½cups dried chickpeas, soaked overnight, drained213.5-oz. cans unsweetened coconut milk1½cups split red lentilsStore-bought unsweetened toasted coconut flakes, thinly sliced Fresno or serrano chiles, and/or cilantro leaves (for serving; optional)PreparationMustard Seed and Turmeric OilStep 1Cook oil and mustard seeds in a small saucepan over medium-low, swirling often, until mustard seeds start to pop. Remove from heat and stir in turmeric and cayenne. Season with salt; let cool.Step 2Do Ahead: Oil can be made 1 day ahead. Store tightly covered at room temperature.Cilantro-Raisin ChutneyStep 3Mix shallot, raisins, cilantro stems, lime juice, and oil in a small bowl. Season with salt and pepper.Step 4Do Ahead: Chutney can be made 1 day ahead. Cover and chill.Stew and AssemblyStep 5Heat oil in a large Dutch oven or other heavy pot over medium. Cook onions and garlic, cut side down, and ginger, stirring onions and ginger occasionally, until onions are translucent and garlic is golden brown, 5–7 minutes. Add curry powder and cayenne and cook, stirring constantly, until very fragrant, about 1 minute. Add chickpeas and 5 cups water, stirring to release any bits stuck on bottom of pot; season with several pinches of salt. Bring to a simmer; cover with a lid, leaving slightly askew so steam can escape. Cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until chickpeas have swelled about 50 percent in size but are still crunchy, 25–30 minutes.Step 6Add coconut milk and lentils to pot; season with more salt. Return to a simmer and cook, partially covered, until chickpeas are tender and lentils have broken down to form a thick broth, 30–35 minutes. Pluck out and discard garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt if needed. Ladle dal into bowls and serve with toasted Mustard Seed and Turmeric Oil, Cilantro-Raisin Chutney, coconut, chiles, and/or cilantro as desired.Step 7Do Ahead: Dal can be made 3 days ahead. Let cool; cover and chill.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethHow would you rate Coconut-Ginger Chickpea Soup?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleThis recipe is luxurious and richly flavored.  I expected it to be very good, but it's out of this world.heidikinsPark Ridge, IL1/2/2022I've made this recipe several times now and each time it has come out wonderfully. I made some modifications for my IBS and wanted to share them. I generally only use half the amount of onions called for in the recipe, both in the chutney and in the soup. In the soup, I replace half the onions with fennel. It's absolutely delicious (so good that if my IBS was cured overnight, I'd still probably make it this way) and if you're really sensitive to onions, you can replace all of them with fennel and the soup will still taste good (though not quite as good as the half onion/half fennel). I also omit the cayenne pepper because spicy food is often a trigger for my IBS symptoms. In the chutney, I replace most of the shallot with green onions. It doesn't look as pretty, but it tastes good. I usually quadruple the chutney amounts because it is just so tasty. Anyways, sometimes you just have to adapt things the best you can to enjoy good food with IBS. AnonymousChicago, IL9/12/2021Delicious, I did not bother with the accouterments and still thought it had the perfect balance of seasoning.  Jeremy Philly4/26/2021Doubled the toppings and it turned out super delicious!Clara Yan8/20/2020This was great! The flavours reminded me so much of a green curry that I couldn't help but add a handful of kaffir lime leaves while cooking, and I highly recommend doing this since it takes it to a WHOLE. NOTHER. LEVEL. Agreed about how ridiculously good the chutney is, I want to eat it by the spoonful.\nThe mustard oil looks more interesting than it tastes, in my opinion - I'm used to making tarkas that really mess you up. But still. I liked it a lot and served with a lime wedge to brighten it up a bit.yeliaToronto, ON5/21/2020Y'all, this recipe is a winner. I usually try little changes but I followed this recipe to a T (to my own surprise!) and it. was. perfect. Seriously, the only thing I changed was doubling the chutney because it was just that good, and I wish I'd tripled it! It looks like a lot but it's not, the chutney and oil come together in 5-10 mins tops *while* the meal is cooking anyway. If you want to cut down cooking time, pre-cook chickpeas the night before and skip the 30-min cooking step. (Or use canned chickpeas, but you'll be missing out on texture.) My partner said it was his favorite thing we've ever made at home, even beating Digaag Qumbe - if you've made that BA recipe before, you know that's high praise!newsome.megane8667Jacksonville, FL3/5/2020I knew I would love this soup and I was right! I accidentally burnt the mustard seeds and I didn't feel like making the oil again, and I didn't have the ingredients for chutney so I'm one of those reviewers that others will hate. \n\nThe only changes I made to the actual soup recipe were to salt pretty frequently, up the cayenne because I like a lot of flavor, and only use one can of coconut milk to save some calories. I've been eating the soup for three days now and every time I have a bowl, I exclaim that it's the tastiest soup I've ever made. With each reheat, I've added a little bit of water to loosen it up. The flavors become more and more intense so it can stand a little water in there. I found the garlic instructions very straight forward and, like others, I smooshed a few of the roasted cloves into the soup. I would mince the ginger next time rather than just slicing it.\n\nA wonderful recipe that I'll surely make again.Karin TracyLos Angeles, CA12/31/2019Also should have noted that I peeled the two heads of garlic and put the cloves in whole - it made the stew super garlicky so miiiight just use one head next time.soapnanaChicago 2/20/2019This turned out great! Agree with the other commenters that the toppings are a MUST - they add a layer of sweetness and sharpness that complements the stew well. Be sure you add plenty of salt throughout (though I waited until after the chickpeas were partially cooked) and taste as you go to make sure it’s not bland. The leftovers of this are even better once the flavors meld together more. The only substitution I made was using one can of lite coconut milk and one full fat. Would definitely make again!soapnanaChicago2/20/2019This was a yummy cold weather stew! Also confused by the garlic step (I hate putting dirt-covered roots in a pot), I opted to peel both heads and throw in whole cloves (we love garlic, so this worked). The toppings do make this fun and extra flavorful. Great as leftovers but got VERY thick. Will make again! TXHuskerTexas12/29/2018Not really sure what people are talking about in regards to the chickpea/daal being too bland, I kept sneaking spoonfuls of it while it was cooking. Maybe they didn't add enough salt? As far as the garlic, I think the recipe is pretty clear: take 2 heads of garlic, cut off the tops of them so the cloves are exposed, and put them down into the oil to sear with the onions. As long as you haven't touched the base, none of the paper should get into the soup when you pull out the heads before serving. Amazing dish, made for a great dish to spend a lazy Saturday afternoon making. Even though it's pretty easy to make, serving it with all of the fixings out looks really impressive. Like many other people said, make at least double the chutney. We only ate about half of the chickpeas, but were scraping the bottom of the chutney bowl. Anonymous12/3/2018those Blue cards look familiar. what are they? the font... aleister crowley's nox om pax. Anonymoustsion..11/16/2018As others mentioned, this and all of the otherwise really fantastic-looking stew recipes in this issue are missing key instructions on what to do with the garlic. I just peeled and smashed all the cloves and included them and even though they were whole, they simmered so long and absorbed so much of the stew that catching one in the final was not a problem. Same with the ginger slices. The toppings here are really key. I made them all and the chutney in particular, and the jalapeno slices, really added so much flavor to an otherwise simple stew. AshleyBrookeWashington, DC11/9/2018Having made another stew from this issue (Silky Pork), I knew I didn't want to do that whole garlic head thing again, and I didn't like the idea of ginger slices, so I grated half the garlic and half the ginger, julienned the other half of the ginger, and left the other half of the garlic as whole peeled cloves. I thought that worked out well. As for the flavors, yes it's true, this stew alone is on the bland side. HOWEVER, when you add the mustard seeds/oil and especially the chutney (!!!!!), this really works. I served mine with coconut and cilantro as well, over white jasmine rice, but it was really the chutney that knocked it out of the park. DO NOT SKIP THE CHUTNEY!! In fact, make DOUBLE the chutney!AnonymousNYC10/31/2018I love the ideas here - but the execution is off. If you're going to temper oil - do what is meant to be done and add on right before eating. Heat the oil, when the mustard seeds pop over heat - take it off the heat and add the tumeric and pepper. Immediately pour it over the cooked dal.  I don't have curry - but I did have garam masala and cumin, which I added generous amounts of. I also added the ginger and garlic in the form of a paste (only because I have it bottled). The chickpeas don't add any flavor when added the way described - so I toasted them to crispy and added as a topping.\nnehakBucks county10/29/2018Explore Bon AppétitSoupSoups and StewsStewDalIndianSouth AsianAsianChickpeaBeanVegetableLentilCoconut MilkOther IngredientsGingerHerbs & SpicesFallWinterMainVeganVegetarianDairy-FreeGluten-FreeSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}