{"id": "1305dabc3b57220f2111b11aace30ef3", "url": "https://www.bonappetit.com/story/what-is-clarified-butter", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "What Is Clarified Butter, the Butter We’d Drink Straight? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Clarified Butter, the Liquid Gold We’d Drink Straight?This butter makes everything better. Let us clarify.By Alex DelanyAugust 6, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailClarified butter is the golden glory we always have stashed in the fridge. It’s purer than butter-butter and has a bold richness and a clean finish, with none of the muted milkiness of some traditional butters. Plus, it has a high smoke point, making it the better choice for high temp cooking.What is it?Butter is an emulsion of fat, water, and milk solids. The clarifying process splits up the trio so we can stop third-wheeling and get straight to the magnificent fat. By slowly heating butter, you separate it into three layers: foam (which is the water evaporating), the sunshine-yellow clarified butter (which is the fat), and the white milk solids. The goal is to remove the water and strain out the solids (usually using a cheesecloth), thereby creating a richer and purer fat that's more shelf-stable, too. Clarified butter is intensely luscious, with a nutty, toasty aroma that breaks free from the heavy murkiness of the original product.So what’s the difference between clarified butter and ghee?Ghee is a form of clarified butter that has been used in cooking and medicine in India for millennia. Rather than just separate out the water and milk solids, ghee-making goes further: The butter is cooked longer, until all of the water is gone and the milk solids brown and sink to the bottom of the pan. This gives ghee an even richer, nuttier flavor than clarified butter.Clarified butter is fantastic in scrambled eggs.\nPhoto by Alex LauWhat it’s good for?Because clarified butter is free from the milk solids that burn and smoke during cooking, it has a higher smoke point than regular butter (upwards of 450° F), making it a high temp hero. That means you can get a pure butter flavor in hot applications—like when you're pan-frying, roasting, or searing—because you don’t have to worry about the butter burning. And because it tastes nuttier and more concentrated, clarified butter makes for a final drizzle that's super flavorful rather than simply rich.This liquid gold also makes the simplest recipes look super professional and taste a little, well, extra: Try using clarified butter to make scrambled eggs, popcorn, or crispy fried potatoes even more irresistible. Use it to fry up leftover rice, toast spices, or make incredibly crispy hash browns.And, finally, because there isn’t any pesky lactose floating around, clarified butter lasts longer than butter—up to two months in the fridge (ghee doesn't need to be refrigerated at all). But once you start experimenting with all of its delicious applications, we doubt you'll be able to keep it around that long anyway.Now, put that clarified butter to work in a pan sauce:Easy Steak with Pan SauceA juicy, buttery, steakhouse-worthy dinner in 30 minutes flat.View RecipeExplore Bon AppétitBasicallyButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-06", "author": ["Condé Nast", "Alex Delany"]}