{"id": "13161b1b86eba9c85d49a47b2b78c3a3", "url": "https://www.bonappetit.com/story/canned-bean-liquid", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Canned Bean Liquid: What Is It And Can You Use It?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's The Deal With The Goop In Canned Beans?About to drain and rinse your beans? Not so fast.By Emma WartzmanOctober 2, 2019FacebookTwitterEmailPeden + MunkFacebookTwitterEmailHere at Basically, we’re big proponents of cooking beans from dry—but we’re also not above admitting that canned beans are somewhat of a miracle ingredient. When it’s a weeknight or you’re just plain tired, soaking and simmering is about as likely as organizing your closet. Enter the ultra-convenient, ultra-cheap pantry staple that is canned beans.Now, when cooking dried beans, the liquid is pure gold: usable and totally delicious. But what about the liquid— or, even more common, the goopy glop—that comes in the canned variety? Should you add it to your dish? Should you drain and rinse?There are two main considerations you have to make when answering those questions. First of all, what you’re cooking matters. If you’re crisping up chickpeas to add to a salad, or sprinkling white beans over toast, or stirring cannellini beans into a pasta, you don’t want extra liquid ending up in your dish.The canned beans in questions.\nMike LorrigBut if you’re cooking something that requires extra liquid anyway, you can use it. In the case of Rick Martinez’s chicken tinga tostadas, two entire cans of black beans, liquid and all, are used to make refried beans with a mash-able consistency and a creamy end result. Canned bean liquid, which is often quite starchy, is also welcome in soup, to help thicken the broth, and in hummus, to help it get super smooth.Before you go throwing canned bean liquid into every dish that can theoretically handle it, you have to actually taste what’s going on in there. That is to say, not all canned bean liquid is created equal. It varies from bean to bean and brand to brand. Is it on the thinner side, or more like the aforementioned goop? Is it smooth, or is it gritty? Does it taste like actual beans, or does it leave an unappealing tinny flavor in your mouth? You won’t know until you try.One note: The liquid in all canned beans is a mixture of water, salt, and the starch released from the beans themselves. The salt acts as a preservative to keep the beans tasting fresh, which means the liquid is generally very, very salty. This isn’t to say you can’t use it. It’s simply important to realize that when you do, you’re adding seasoning (there’s a reason those refried beans in the tostadas don’t need any extra salt).Now harness your miracle ingredient, go make some dinner, and leave the closet-organizing for another day.Beans to the rescue:Chicken Tinga Tostadas With Bacony Black BeansEverything you could possibly want in a tostada (and then some): shredded chicken smothered with a smoky, spicy tomato salsa, bacony refried beans, and a smattering of cilantro and cheese.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-02", "author": ["Condé Nast", "Emma Wartzman"]}