{"id": "133317335b52d11c9211cb4f18d58114", "url": "https://www.bonappetit.com/story/sleep-wellness-fixation", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "How the Quest for Sleep Aids Became a Wellness Fixation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Sleep Became a Wellness FixationSleep has become a national obsession, and the lifehackers are searching for shortcuts.By Ashley FettersMay 29, 2018FacebookTwitterEmailPhoto by Yale Joel/Getty ImagesFacebookTwitterEmailThis story is part of the Healthyish Guide to Finally Getting a Good Night's Sleep. Click here to read the whole guide—then get those zzzs.I’ve seen far more sunrises at the end of a late night than I ever have at the start of an early morning. For as long as I’ve been in charge of my own bedtime, I’ve gone to sleep around two or three a.m.; any earlier, and I’ll lie in bed grimly wondering what else I could be doing with these quiet, wakeful hours.There’s a name for this particular behavioral pattern, and it’s not laziness: It's \"Delayed Sleep Phase Syndrome.\" When a study released last year suggested it may be genetic, letters and interview requests began pouring into the inbox of Rockefeller University’s Alina Patke, the paper’s lead author. Everyone wanted to know why they or someone they knew had such difficulty sleeping.As recently as a generation ago, problems like these were considered an inconvenient quirk or a cohabitation liability, like snoring or night terrors. Today, there’s a thriving industry of remedies, ranging from the lab-tested to the superstitious. There are supplements and prescription medicines. There are apps to study sleep and apps to decrease the blue light a computer emits. There are videos, podcasts, noise machines, weighted blankets, special lamps, and even a patch.Sleep has become a national obsession. In 2016, a Motherboard story about “sleep hacking” your room offered up the cautionary tale of a guy whose fixation on his FitBit sleep scores stressed him out so much he...couldn’t sleep. That same year, Arianna Huffington’s book-length treatise on the importance of getting a full eight-hour-night’s rest spent more than a month on the New York Times bestseller list.A restful sleep life now ranks alongside a nutritious diet and regular exercise as one of the aspirational pillars of a healthy, optimally productive lifestyle. So how did we get here?Sleep medicine as we know it grew out of three significant discoveries: the REM cycle, sleep apnea, and the effect of light on the body’s “clock,” or circadian cycle.Much of the most recent research has confirmed for certain what anyone who’s ever had a toddler or pulled an all-nighter might already suspect: Sleep deprivation has detrimental effects on mood and performance (hence its use as a torture tactic). Researchers have also discovered that getting the recommended seven-plus hours each night is linked to lower levels of cardiovascular disease, diabetes, and hypertension.One early symptom of the most recent bout of sleep mania may have been the rise of melatonin. First sold as a natural sleep aid in 1995, the over-the-counter supplement is a lab-grown, synthetic dose of the natural hormone released at night in the brain’s pineal gland; it tells the body to go to sleep. For years it lingered on supermarket “organic”-aisle shelves, a product women of a certain insomniac stage of life quietly swore by.But between 2007 and 2012, the rates of melatonin use in the United States more than doubled. Incidentally, Apple released the first iPhone to U.S. retailers on June 29, 2007. The iPhone wasn’t the first glowing screen, but it and other devices ushered in the age of 24/7 screen time. In 2013, research confirmed that the bright blue light emitted by smartphone screens mimicked daylight a little too closely, triggering the circadian wakefulness response.Another reason we’ve reached Peak Sleep may just be that we’ve reached Peak Sleep Research. There’s now enough of it to wield significant influence over public perception and policy. Stuart F. Quan, a professor of sleep medicine at Harvard, has developed a “sleep calculator” that reveals just how much a sleep-deprived schedule could cost a business in employee productivity and safety each year. Sports teams at the college and professional levels have also begun consulting with sleep specialists to improve performance.The more we understand about sleep, the more we can manipulate its beneficial properties for our own purposes. The same way innovators once used nutrition science to lifehack products like Soylent to eliminate the time-sucking inconvenience of cooking and chewing, they now use sleep science to create products that promise to reset the circadian cycle whenever it’s convenient for the user to sleep.Of course, the problem for many is a shortage of time to sleep, as millions of Americans with small kids or multiple jobs are well aware. For those eternally in search of a shortcut, some of the most fascinating research is taking place in the military. Soldiers and officers sleep poorly, due to unusual shift schedules; to combat fatigue-related accidents, the Air Force has historically allowed (and allegedly pressured) pilots to take “go pills,” or stimulants designed to keep them alert. Now, they want to minimize inefficiency. “They're looking for ways you can get away with as little sleep as you can,” Quan says. “I don't think anybody's found a solution for not sleeping,” he adds.But what about people like Thái Ngọc, the Vietnamese man famous for not having slept since 1973? He's considered little more than a sensational scientific anomaly, yet his relative normalcy and impressive productivity paint a tantalizing picture of a life without the need for sleep. I think about that during what I consider “productivity o’clock,” those past-bedtime hours when I sit in the ghostly glow of my dimmed-down MacBook. Except in this case, my boyfriend can expect a “good morning” text from me around lunchtime.Explore Bon AppétitHealthyishSleep WeekRead MoreLifestyleHow I Quit Hitting Snooze: My Most Annoying Habit of All TimeBy Maggie LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Ashley Fetters"]}