{"id": "133a35203ae213d40fc10bb6c879999a", "url": "https://www.bonappetit.com/story/best-things-we-drank-2018", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "The Best Things We Drank in 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Were the Best Things We Drank in 2018Staffers on the best beer, wine, spirits, and more that filled our cups this year.By The Bon Appétit StaffDecember 21, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen you look back on the year that’s about to pass, what memories shine brightest? Maybe a promotion. Or an engagement. Or a move to a new city. Maybe the rekindling of a lost friendship or the birth of a child. Or maybe it was the time you opened that bottle of perfect, acid-forward, naturally sparkling rosé from Slovenia. Or shared that vintage bottle of Zucca amaro from 1962 with your friends. Or when you drank an expertly-brewed IPA from the comfort of your couch. Yeah, those sounds a little more our speed.We drank a lot of great booze in 2018, but we each had one, the bottle of all bottles, that made every other drink feel unremarkable. From our lips to your eyeballs, here are our best purchases of the year. Domaine Matin CalmeMy favorite thing I drank this year was this bottle of Domaine Matin Calmea Sans Temps, a natural wine from Languedoc. It’s made from 100 percent Carignan, and it’s a huge reason why 2018 became the year I loved Carignan. It’s possible that circumstance had something to play here, because I drank it at a picnic in Paris as the sun set on the Eiffel Tower, surrounded by my close friends. Or maybe it’s just the fact that this wine is really f***ing good. It had a bit of barnyard funk, followed by some slight tannin and mouth-watering blueberry flavors, like a still-warm pie. I’m pretty sure I drank the majority of the bottle myself. —Emily Schultz, social media manager St. Reginald Parish Marigny Carbonic Pinot NoirI’m going to go ahead and say that St. Reginald Parish Marigny Carbonic Pinot Noir was the best thing I drank this year. This is juice box wine par excellence, zingy and gluggable like a cold glass of cherry cola. It was all I wanted to have at my wedding, but I couldn’t find any more in NYC (I think I drank it all). Then, through an insane twist of fate, I ran into the winemaker, Andy Young, at a party in Portland, OR, and like a BOSS he offered to ship me THE LAST THREE CASES of the previous year’s vintage in time for my wedding. I get weepy thinking about it. —Amiel Stanek, senior editor Funaguchi Kikusui SakeThis has been the year of sake for me, and the little yellow 6-oz. cans of Funaguchi are what I look forward to pulling from the fridge when I’m in the mood. (Sure I could share, but 200ml has a way of going down easy.) It’s got a medium-sweet, slightly fruity, full-bodied flavor, but it finishes nice and clean. And because it’s unpasteurized, the flavors evolve over time in the can, which means there’s always a bit of a surprise waiting—and that’s something to get excited about too. —Sasha Levine, senior editor Jeremy Quastana’s L’EndemiqueEver since I drank Jeremy Quastana’s L’Endemique, I’ve been wandering into wine shops trying to find something similar (having given up hope of finding L’Endemique itself). “Do you have any light, unfiltered Gamays kind of like this one?” I'll ask, showing a picture on my phone, in hopes of tracking down a bottle akin to my highly drinkable white whale. I still haven’t found anything I like as much, but it’s certainly been fun trying. —Meryl Rothstein, features editor Mikkeller New York City MikkelleritaI  chewed on lemon slices as a child, so it’s no wonder I’ve spent my entire adult life in search of drinks that make the back of my throat pucker. I love saisons and sours, but Mikkeller’s Mikkellerita was the first IPA to capture my heart. Chalk it up to the heavy hit of lime and slight saltiness (it’s sorta like sipping a tide pool, in a really good way)—or maybe the ever-adorable illustration on the can. I’m not overthinking it—I’m just tracking down every can in New York. —Aliza Abarbanel, editorial assistant Alessio Vermouth BiancoI am currently very, very into Alessio Vermouth Bianco. I tried it over ice with a twist of lemon last summer at SRV in Boston, but it took me a while to finally invest in a bottle because you have to drink it relatively quickly to keep the flavors fresh. It’s similar to sweet Italian vermouth, but it’s more robust, herbal, and crisp. It’s easy drinking and has a hint of slightly bitter citrus, with a honeysuckle-like sweetness to balance things out. I could drink it like water, which is dangerous. —Alyse Whitney, associate editor Bini Rosso FaninoI’m going to get shit for this because this wine is so allocated and expensive, but the best thing I drank in 2018 was the Bini Rosso Fanino. I bought the last bottle of this 50/50 blend of Pignatello and Catarratto from Sicily on a tipsy lark one night when I was feeling very “to hell with it!” It tasted like the ripest, juiciest peach, with such beautifully integrated volatile acidity that swept through it like a long romantic sigh. It was worth every penny of the $90 I still can‘t believe I spent on a bottle of wine at retail. It’s going down in history as the wine that ruined me forever. —Marissa A. Ross, wine editor Capitoline Sweet Rosé VermouthI first tried this citrusy, nutty, herbaceous little beauty in a cocktail mixed with coconut milk at D.C.’s Bad Saint—and needed to know what the hell it was. Turns out, the stuff is made locally with carbonic rosé wine and comes in a bottle as pretty as it tastes. I snapped one up and brought it home, where I like to mix it with Campari and gin for a real nice Negroni (or just drink it straight on the rocks). —Hilary Cadigan, associate editor Threes Brewing Kicking & ScreamingI drank a lot of really cool, complex, atypical, inventive drinks this year. But my favorite was one of the simpler things I drank. Threes Brewing Company’s Kicking & Screaming, a pilsner fermented in a large wood vessel called a foudre, was a breath of fresh air. Just a bit of old-school hop flavor. Just a bit of oak from the foudre. And a body so crisp that the second glass seemed to pour itself before the first was even finished. In the age of fruit-aged this and triple dry-hopped that, this is a beer that tastes like beer. It’s a good reminder that the simple stuff, when done perfectly, is why I started to love beer in the first place. —Alex Delany, associate editor Methode Sauvage Tierra Extraña Cabernet FrancI‘ve been in a Lambrusco rut lately—I love it, but sometimes you need a little variety in life—and the bottle that has set me free is this jammy, almost savory Cabernet Franc. I picked it up during Labor Day from Psychic Wines, a very cute natural wine shop in Los Angeles, and it only took a few minutes talking to the shop owner before I was completely sold on the singular focus of winemaker Chad Hind (he produces wines in California from just two grapes: Chenin Blanc and Cabernet Franc). It was the perfect musky, warming thing to sip, sitting outside with the grass under my feet, as summer turned into fall. And even now too, bundled up inside my NYC apartment with the heater and humidifier on, as the year winds down. —Elyse Inamine, digital restaurant editor Amaro Angeleno2018 was the year I learned to like amaro. And the entry-level one that made me see the orange-hued light was California-made Amaro Angeleno. The notes of menthol and grandma’s perfume cabinet that I had associated with all amari disappeared and were replaced with bright citrus, honey, and fresh herbs. It’s equally at home over ice, in a spritz, or, on its own. It’s amaro for people who say they don’t like amaro. —Rachel Karten, senior social media manager Sipsmith London Dry GinI drink a lot of gin—martinis, negronis, G&T’s, gimlets—and when I’m treating myself I get Sipsmith’s London Dry. Mostly because the swan on the logo appears to be saying, “Let’s get buzzed, you work hard, you’re beautiful and smart,” but also because it tastes delicious. Gin, delicious? YES. Sometimes fancy new gins crank up the botanicals and have an overwhelming floral flavor that doesn’t cooperate with lime juice or Campari. I like a hint of botanical mumbo jumbo, but overall I want a smooth operator. That’s where Sipsmith delivers. And so pretty. —Alexandra Beggs, staff writer Les Parcelles Tète Nat' Igny Ruse RoséThe best thing I drank this year was a big, juicy pét-nat rosé at Basically editor Amiel Stanek’s wedding. It was the “cocktail hour” wine, but our table kept going back for more, until the bartender just handed us an entire magnum (we finished that too). It’s like boozy grape soda, and I mean that in the best possible way. —Amanda Shapiro, senior editor Les Foulards Rouge OctobreI’ve been digging Rouge Octobre from Les Foulards lately. It’s super zippy and incredibly easy to drink. But more importantly, I can get it at my main wine spots here in Manhattan—both Chambers Street Wines and Foragers Wine, around the corner from my place. I don’t like big, heavy reds. This is the opposite of that. —Adam Rapoport, editor-in-chief Explore Bon Appétitholiday2018Holiday DrinksShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "The Bon Appétit Staff"]}