{"id": "133be2a81a59968a8c82ae15d1b6349e", "url": "https://www.bonappetit.com/recipe/crunchy-gochujang-fennel", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Crunchy Gochujang Fennel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueCrunchy Gochujang FennelBy Sohui KimFebruary 14, 20194.7(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintFennel gets a whole new look when quickly blanched then dressed in a spicy-sweet gochujang sauce. Serve this simple Korean banchan alongside rice and a main dish like Red Wine and Soy–Braised Short Ribs or Kimchi Jjigae to make it a meal. The dressing would also be crazy delicious on virtually any vegetable—cooked or raw.Ingredients4 servings1large fennel bulb, stems and dark green parts removedKosher salt1½\" piece ginger, peeled, finely chopped1small garlic clove, finely chopped2Tbsp. gochujang (Korean hot pepper paste)1Tbsp. plus 1½ tsp. unseasoned rice vinegar1Tbsp. honey1Tbsp. toasted sesame oil1½tsp. gochugaru (coarse Korean hot pepper flakes)1½tsp. toasted sesame seedsPreparationStep 1Slice fennel bulb into quarters lengthwise through the core. Cut out core; discard. Slice bulb lengthwise ¼\" thick. Cook in a large saucepan of boiling salted water until just beginning to soften and turn translucent, about 2 minutes. Using a slotted spoon, transfer to a bowl of ice water and let cool. Drain; pat dry with paper towels.Step 2Whisk together ginger, garlic, gochujang, vinegar, honey, oil, gochugaru, and sesame seeds in a medium bowl. Add fennel and toss to coat; season with salt.Step 3Do Ahead: Fennel can be made 4 days ahead. Cover and chill.How would you rate Crunchy Gochujang Fennel?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleLove fennel..love Gochujang so this salad is a keeperDrunkinchef285MIddletown NY3/2/2021i don't even really like fennel, but the sauce this recipe makes is delicious and it made eating the bulb of fennel i had that was getting old enjoyable. can't wait to use the sauce on more things!wheres_the_vegNJ8/5/2020Surprisingly great. I have a bumper crop of fennel in my garden so have been cooking fennel in many ways-in Italian, sauce, savory galettes, slaw. This stuff is great. I worried it would either be slimy or too hard. Great texture--even better flavor. AnonymousVermont7/8/2020Delicious! Very simple to make with a great flavour. Will be making again!AnonymousToronto, ON5/23/2020This was wicked good. My family loves fennel so we're always trying to do new things with it. I will say, the gochujang is spicy but tasty. Would def make it again and would love to try with other crunchy veggies!AnonymousWesterly, RI6/23/2019Delicious recipe, easy and quick to make.  It was my first time ever cooking fennel as we usually have it in salads, never thought of cooking it.  My family enjoyed it and tasty taste.  Sharing recipe with my friends.\nAnonymousMONTREAL, QUEBEC  CANADA4/29/2019my local Walmart grocery doesn't usually carry fennel, to my regret.  but i do have frozen collard greens that would probably shine in this sauce/marinade.  this might be enough spice for me.  if not, then i'll throw in some whole dried chilies.hollis5Vero Beach, FL3/25/2019This was pretty good. The sauce is solid on any crunchy vegetable. I cooked the fennel for about two minutes but then soaked it in cold salt water for an extra 20 minutes and it mellowed out a bit.AnonymousLos Altos, CA3/13/2019Maybe it needs to be cooked longer than the recipe states. This just did not go over well with 3 out of 4 fennel and spicy Korean food lovers. They flavor of the sauce was good. Maybe I would do this again with a different vegetable (cabbage, cucumbers, carrots...)AnonymousBuffalo, NY3/4/2019Explore Bon AppétitKoreanEast AsianAsianFennelVegetableSideStarterDairy-FreeGluten-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}