{"id": "134adbdaa68eff17d0ae4607d5a0d33f", "url": "https://www.bonappetit.com/story/whole30-melissa-hartwig-cricket-protein", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Why Cricket Protein Powder Is Whole30 Founder Melissa Hartwig's New Obsession | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy Whole30 Founder Melissa Hartwig Loves Eating CricketsThe future of protein supplements is powered by cricket powder.By  Eric GinsburgFebruary 23, 2018FacebookTwitterEmailPhoto by Gary Friedman (Getty Images)FacebookTwitterEmailWhen Whole30 cofounder Melissa Hartwig first saw the protein bar made from crickets at her local health-foods store, she thought: “You’ve got to be kidding.”“Who eats bugs?” she recalls asking herself at the time. “That’s weird.”But her curiosity got the best of her, and Hartwig liked the bar so much that insects are now a regular part of her diet.It’s been almost a decade since Hartwig started a food revolution by launching Whole30, a wildly popular month-long diet program that cuts out dairy, alcohol, legumes, grains, sugar, and artificial sweeteners. She doesn’t eat whey or soy protein. But insect protein was Whole30-friendly. (The program emphasizes unprocessed foods and vegetables, but doesn’t discourage meat consumption.) Crickets are a complete protein source: Crickets offer comparable—or better—amounts of protein, vitamin B12, and iron than other meat, according to recent research.While insects are consumed in most countries worldwide and have been for millennia, they’ve only started making their way into packaged foods in the Western world in the last decade. Chapul, the company that sells Hartwig’s favorite bars, was founded by a former whitewater-rafting guide, Pat Crowley, in 2012 and was featured on “Shark Tank” in 2014. Chapul also makes cricket protein powders in three flavors, which Hartwig will mix with water and bring with her when she’s on the go or hiking in the mountains near her home in Salt Lake City.Technically, because of grain-based additives, the chocolate and vanilla-flavored powders and protein bars aren’t Whole30-compliant. Hartwig explains that she bends the diet’s rules a bit—it’s only designed to last a month, after all—but if you’re being strict, the plain powder, which consists solely of Chapul cricket flour, is totally above board.Hartwig has gotten to know Crowley, Chapul’s founder, who speaks passionately about the environmental reasons to get behind insect protein. As he explains in one of his TEDx talks, a protein bar was the easiest way to ease skeptical Western consumers into the idea of eating insects.“It’s very recognizable to our culture [as] food,” he says of the bar format. “So it’s designed to not only be a gentle introduction, but be a wrecking ball to that cultural bias.”And, no, cricket protein doesn’t taste like bugs. “They made it very accessible,” Hartwig said. She likes to offer friends a protein shake, only revealing afterwards that it was made with cricket powder. Though she swears by Chapul’s products, Hartwig says she’ll happily try other insect-based foods. “Just maybe not any live ones,” she says.Explore Bon AppétitHealthyishTrendsRead MorecultureWhy I'm Eating 90 Grams of Protein a DayBy Adriana VelezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-23", "author": ["Condé Nast", "Eric Ginsburg"]}