{"id": "135ec2806fae7caaa2020fe5200d4094", "url": "https://www.bonappetit.com/recipe/chile-butter-roast-chicken", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chile-Butter Roast Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueChile-Butter Roast ChickenBy Yewande KomolafeNovember 15, 2018EmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintThere will be lots of delicious pan juices in the baking dish when the chicken is done, which is a great reason to serve this with rice, mashed potatoes, or a batch of polenta. This recipe is presented to you by Samsung.Ingredients8–10 servings1Tbsp. fennel seedsHandful of cilantro, leaves and stems separated1Thai chile, stem removed2garlic cloves, finely grated¼cup (½ stick) unsalted butter, room temperature3Tbsp. Diamond Crystal or 1 Tbsp. plus 1½ tsp. Morton kosher salt, divided1orange1lb. shallots, peeled, halved if large23½–4-lb. whole chickens, each cut into 8 piecesPreparationStep 1Preheat oven to 425°. Process fennel seeds in a food processor until broken down to a coarse powder. Coarsely chop cilantro stems and add to food processor. Add chile, garlic, butter, and 1 Tbsp. Diamond Crystal (or 1½ tsp. Morton) salt. Finely grate orange zest directly into food processor bowl; reserve orange. Pulse to incorporate. (Alternately, finely chop fennel seeds, chile, and garlic. Transfer to a small bowl. Add orange zest and butter and mix with a wooden spoon.)Step 2Divide shallots between two 13x9\" baking dishes. Pat chicken pieces dry. Using your fingers, gently separate skin from flesh, taking care not to tear the skin. Season chicken on both sides with 2 Tbsp. Diamond Crystal total (or 1 Tbsp. Morton) salt. Slide a scant teaspoon of chile butter under skin of each piece, then rub any leftover butter onto skin. Arrange chicken on top of shallots skin side up and dividing evenly between baking dishes. Quarter reserved orange and place 2 pieces cut side up in each pan.Step 3Roast until chicken is deep golden brown and cooked through, 55–60 minutes. Let chicken rest 10 minutes. Transfer chicken, shallots, and oranges to a platter. Spoon pan juices over, then squeeze orange wedges over. Top with cilantro leaves.Step 4Do Ahead: Chile butter can be made 3 days ahead. Cover and chill.How would you rate Chile-Butter Roast Chicken?Leave a ReviewTell us what you thinkExplore Bon AppétitChickenPoultryChileVegetableMainGluten-FreeNut-FreeKetoRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Yewande Komolafe"]}