{"id": "136533c072eddbdc39999123c5946a7a", "url": "https://www.bonappetit.com/story/amazon-dream-grocery-store", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "What My Dream Grocery Store Looks Like | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat My Dream Grocery Store Looks LikeAmazon thinks it has a plan for the perfect grocery store. We think we know better.By Alex BeggsAugust 3, 2019FacebookTwitterEmailPhoto by Keystone View/FPG/Getty ImagesFacebookTwitterEmailCall me Hal ApenyoIn a riveting article this week about Amazon’s grocery delivery dreams, I couldn’t stop going back to a detail about an internal memo written as a fake press release describing the grocery store of the future. It has dry goods in the basement, fresh produce up top, and it’s designed for optimal online delivery. An expert named “Hal Apenyo” is quoted. But it sounded kinda boring, robotic. I love grocery shopping, I’m here for a good time and maybe some sausage! What would MY dream grocery store look like?~Insert wobbly daydream graphics here~First, there would be two permanent stands outside the entry (automatic doors, but they squish anyone who walks IN the OUT side): Girl Scouts selling cookies to the left, and a lost Trader Joe’s employee handing out pimiento cheese samples to the right. Inside, all of the produce is organic and cheap as hell. There are ALWAYS Fresno chiles in stock so I can make 80 percent of Bon Appétit’s recipes. In the bakery, somebody’s mama is making warm, all-butter flour tortillas (recruited from H-E-B). At the fish counter, each of the whole fish have candy googly eyes stuck on, because the fishmonger is kooky. The meat doesn’t have a confusing, color-coded sliding scale of sustainability—it’s all coded GREEN because it’s all guaranteed ethically sourced, no games. The soy sauce is in the same aisle as olive oil, vinegar, and mustards, and the rice noodles are next to the spaghetti, because the “ethnic” aisle has been banished. For some reason, only Ariana Grande plays on the speakers. The checkout aisles are lined with British tabloids and almond M&M’s and kombucha. And there’s no online delivery option. See you there.Choo chooGet on the pork chop train! God, I love this recipe.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiPlease explainAndy Baraghani, why is this “the only salsa you need”? “I didn’t think of YOU when I developed it,” said Andy, “but YOU will make it. It’s spicy, and you like spicy. And it’s really just putting things on a baking sheet and broiling the f*ck out if them, then pulsing it in a food processor, then seasoning with salt.” It’s charred and has good acidity, he added, and it might convince you to never buy salsa again. From this recipe, you can adjust to your liking, adding more chiles or garlic. “Tomatoes are your base,” said Andy. “From there, you can replace the actors, swapping Judi Dench for Meryl Streep.”Get the recipe: The Only Salsa You NeedPhoto by Chelsie CraigThe final quinoa loafIs life one cycle of grief followed by another? Yesterday marked our beloved Arcade Bakery’s final day. I wrote about my passion for Arcade’s quinoa loaf mere weeks ago. The majority of my Venmo exchanges with co-workers is paying them back for Arcade sandwiches and baguettes. The universe did a cruel number on owner Roger Gural by seeping rheumatoid arthritis into his joints, making the physical labor of baking bread an act of pain. Mr. Gural, thank you for your hospitality and your perfect croissants, signed, the entire Bon Appétit staff.Photo by Adam RapoportMeet Sohla!We have a new assistant food editor, Sohla El-Waylly. This week, Sohla was cross-testing Thanksgiving recipes in a Test Kitchen packed with video crew members, lurking employees on the hunt for snacks, and things got a little chaotic. To the tune of the beeping timer hanging around her neck, she told me about the dramatic moment when the bowl of toasted pine nuts in hot oil she was carrying went flying. “I thought I was gonna make it to my station, but I didn’t.” Gaby Melian tossed some salt on the floor and everything was alright in the morning. “Remnants of it will be on my white pants forever,” Sohla said.With guest starRick Martinez was here this week too, making Christmas cookies! How’re you doing, Rick? “Pretty tired,” he said. “Someone knocked on my door at 2:30 a.m. last night and invited me skinny-dipping. I didn’t go, but the splashing kept me up.” Welcome to Rick’s Fire Island life. #summerofrickUnnecessary food meme of the weekUnnecessary food feud of the weekWhat began as a discussion of what-does-oat-milk-even-taste-like—Aliza Abarbanel made oatmeal with oat milk per Jesse’s tweet above, and declared it a flavorless miss, “no one wants that”—turned into a digression on ...how many of the BA staff have seen actor Maggie Gyllenhaal at New York restaurants. Aliza saw her in line at Van Leeuwen ice cream in Brooklyn, where Aliza ordered the oat milk ice cream, naturally. Meryl Rothstein remembers spotting Gyllenhaal at Via Carota, while Christa Guerra saw her at Café Altro Paradiso. Andy Baraghani glimpsed Maggie with her brother Jake at Mettā in Brooklyn. When Christina Chaey was a waiter, she served Maggie and husband Peter Sarsgaard at Rucola in Brooklyn. Kate Fenoglio saw her at Sweetgreen! Sasha Levine stood behind her in line at Union Market, where she seemed “totally cool”! Carla Lalli Music wins though, because she “sees her a lot”—they live in the same neighborhood.Maybe I’LL see YOU at the Healthyish farmers’ market stand at the Union Square Greenmarket today (Saturday!!!) from 9 a.m. – 2 p.m. I’ll be there bright and early handing out minty limeade, so come say hi!Explore Bon AppétitBeggs NewsletterRead MorecultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggscookingHow Interesting That This Tomato Galette Could Serve 8...or 1By Alex BeggscultureCook the Cover! It’s FoolproofBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-03", "author": ["Condé Nast", "Alex Beggs"]}