{"id": "13673bd7257b0175bc8b011fef63fd9e", "url": "https://www.bonappetit.com/recipe/southwestern-summer-bean-corn-and-tomato-salad", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "BUSH’S® Southwestern Style Pinto Beans™, Corn, and Tomato Salad Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® Southwestern Style Pinto Beans™, Corn, and Tomato SaladFacebookPinterestTwitterEmailThis recipe is high-favor and low-maintenance, perfect for all your end-of-summer entertaining.PrintIngredientsKosher salt and freshly ground black pepper1 pound green or wax beans, trimmed and cut into 2-inch pieces2 ears corn, shucked and kernels removed from ears (1 ⅕ cups)2 cups cherry tomatoes, halved4 ounces thick cut bacon, cut into ½-inch pieces2 tablespoons olive oil3 tablespoon apple cider vinegar1/2 cup finely chopped red onion2 tablespoons finely chopped fresh dill, plus more sprigs for serving1 (15.5 ounce) can BUSH’S® Southwestern Style Pinto Beans™3 radishes, very thinly slicedRecipe PreparationAdd the bacon to a medium nonstick skillet and place over medium heat, cook, stirring occasionally, until bacon is crisp and golden, about 6 minutes. Using a slotted spoon, remove bacon to a plate.Meanwhile, bring a large pot of salted water to a boil. Fill a large bowl with ice water. Add the green beans and boil, 3 minutes. Add the corn to the pot and cook until both corn and green beans are crisp tender, about 1 minute more.Drain the vegetables through a sieve and place the sieve in the bowl of ice water until the vegetables are cold, about 2 minutes. Drain and pat dry. Transfer vegetables to a large bowl and toss with the cherry tomatoes.Whisk the oil with 1 tablespoon of the vinegar in a medium bowl and stir in 2 tablespoons of the onion and 1 teaspoon of the dill. Season with salt and pepper. Toss 2 cups of the vegetable mixture with the vinaigrette.Add the beans with their sauce, the remaining 2 tablespoons of apple cider vinegar, remaining onion, and remaining dill to the bowl with the remaining undressed vegetable mixture. Toss to coat. Season with salt and pepper.Arrange bean mixture on a platter and top with dressed vegetables, bacon, radish, and more dill. Drizzle any juices left in the bowl overtop.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansSaladAmericanGreen BeanCornCherry TomatoBaconPinto BeanSummerQuickEasySideDairy-FreeNut-FreeGluten-FreeMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}