{"id": "136f8bd25ff9154df80898360c985ccf", "url": "https://www.bonappetit.com/story/the-cranks-bible", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "'The Cranks Bible' Is the Only Vegetarian Cookbook I'll Ever Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping'The Cranks Bible' Is the Only Vegetarian Cookbook I'll Ever NeedIt has over-the-top Britishisms and disdain for green peppers, and it's the only Bible for me.By Julia TauschJune 13, 2018FacebookTwitterEmailFacebookTwitterEmailThe year was 2002, and I had recently moved to Montreal to study writing, but both my program and the sleety darkness were eroding my soul much more than expected. I was trying to eat less meat, but my Moosewood experiments, performed in my stamp-sized kitchen, came out bland and brown. I didn’t yet understand the city, and spent many nights wandering the big-box bookstore downtown, getting into an envy-frenzy in the fiction section before retreating to the cookbooks. One such night, a colorful tome called to me from a bargain bin. The Cranks Bible read the title in vibrant cursive script. What?At the time, Cranks (as in, eccentric) was a chain of vegetarian restaurants in London, the first of which opened on Carnaby Street in 1961. The Bible, published in 2001, purported to be a collection of definitive Cranks recipes, written by Moroccan-born food director Nadine Abensur. London-via-Morocco sounded cooler than Moosewood, and the deep discount convinced me. I could not imagine that more than fifteen years later, the book would boast the cracked spine and oil-splattered pages of pure cookbook love; nor that I’d still be schlepping it into bed whenever I needed to relax, be inspired, or just laugh at Abensur’s over-the-top Britishisms, witticisms, and contagious adulation of vegetarian food.Before her stint at Cranks, Abensur worked all over the world in restaurants and catering, serving celebrities like Annie Lennox and the McCartneys. Her fresh flavors and worldly approach were part of Cranks’ attempt to update its brown-ricey brand for the nineties. Abensur couldn’t save the restaurants—most of them closed shortly after the Bible’s publication—but the book was well received in the British press. Some credited Cranks with leading a “vegetarian revolution” in Britain, only to become a “victim of its own trail-blazing.”  I have to wonder if Ottolenghi would be where he is today had Abensur not set the scene.Some people prefer cookbooks with plain language, but I like ’em wordy. Abensur’s style hums with anecdote and opinion. She describes being on a weird date when served a “lurid, shocking plateful” of the beetroot risotto that inspired her own. A memory of her Moroccan childhood hometown’s communal ovens accompanies her vegetarian adaptation of Dafina, a slow-cooked rice dish. Her distaste for green bell peppers that “repeat on you like cheap music” (because of their tendency to return as grassy burps) is but one of the hilarious descriptions of gastric distress.In telling the origin stories of her recipes, Abensur evokes images of fiddling with temperature, listening for sizzle, and pouring in wine on a whim. And the verbiage goes beyond pure entertainment. Some of the weirder writing helped tattoo her cooking tips on my mind. I squeeze the juice from grated ginger because Abensur “cannot abide the little ropy pieces.” Lentils are simmered on low, “otherwise you get mush in a leather coat.” Her assertion that “this book is gently bathed in olive oil” alongside her recipes’ deliciousness finally banished my eighties-child fear of fat for good. Abensur riffs exuberantly: Change the cheese, tweak the heat, throw in some olives! She also uses ingredients I wouldn’t hear of elsewhere for years: miso, preserved lemons, sumac, umeboshi. Abensur is focused foremost on big flavor, easy luxury, and adventure: an approach to veggie cooking I could get behind.Back in Montreal, I started with the Butternut Squash Lasagna and blew one skeptical, carnivorous friend’s mind. Years later, my guests agreed Abensur’s falafel were the best they’d ever had, even if making them filled my tiny apartment with smoke. A dish that got me hooked on the rustic-yet-sophisticated vibe was the Green Beans Braised with Tomatoes: a simple dish that tastes exactly like what it is, elevated to the yummiest, most chill thing to eat on earth. Her recipe for farinata introduced me to the magic of chickpea flour—vegan eggs, did you know? Abensur got me making risotto long before cooking-show demagogues made many a home cook too nervous to try. That “lurid” beetroot one, with its hit of vodka at the end, remains one of most exciting things I make; the Risi e Bisi among the simplest.Reading through The Cranks Bible for this piece, I stumbled on a recipe I swear I’d never seen before: Persian carrot rice with a coconutty crust. My younger self probably passed it by out of fear of trying short-grain rice that wasn’t arborio. But after 16 years of cooking from this book, learning to trust both its guts and my own, I knew better. I overcame my resistance to soaking and then baking the rice, and was rewarded with a creamy, tender dish with a crispy golden crust: yet another Cranks success. I’m so grateful now for those bleak Montreal nights. Without them I might not have found this book, the only bible I need.Buy The Cranks Bible, $3All products featured on Bonappetit.com and Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitHealthyishBritishCookbooksLondonVegetarianShoppingRead MoreLifestyle5 New Vegetarian Cookbooks We're All About This SpringGallery5 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-13", "author": ["Condé Nast", "Julia Tausch"]}