{"id": "13784552c0a09d28b4b8629f89d0252d", "url": "https://www.bonappetit.com/recipe/extremely-cheesy-potato-gratin", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Cheesy Potatoes Gratin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesExtremely Cheesy Potato GratinCreamy, cheesy potatoes with crispy edges, tender middles, and just a whisper of heat—need we say more?By Carla Lalli MusicDecember 20, 20204.6(74)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Carla Lalli Music EmailPinterestPrintEmailPinterestPrintIn case you need even more proof that cheese and potatoes make a miraculous combination, we present this decadent-yet-elegant casserole, where nutty Gruyère, sharp cheddar, and cream bubble around thinly sliced russets. While many recipes for gratin and scalloped potatoes layer the potatoes so that they’re lying on top of one another, Carla Lalli Music positions the slices nearly vertical, which ensures even cooking and means every slice has a crispy side (the best part). Made in a pie dish instead of a 13x9\" baking dish, it’s also a much more reasonable quantity for a small gathering. Do take the time to peel your potatoes—unencumbered by their skins (which tend to dry out in the oven), the thin slices can soak up all of the delicious cream and turn totally tender.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronPie Pan$19 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketBox Grater$13 At Amazon8-Inch Chef's Knife$47 At AmazonCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Bowl$18 At AmazonStainless Steel Skewer$5.89 At AmazonHeavy-Duty Aluminum Foil$10 At TargetIngredients6 servingsRoom-temperature unsalted butter (for foil)3oz. sharp white cheddar (not aged)3oz. Gruyère3lb. russet potatoes (about 6 medium)½large yellow onion1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt½tsp. cayenne pepperFreshly ground black pepper1¼cups heavy creamPreparationStep 1Butter one side of a large (12x12\") square of foil with room-temperature unsalted butter. Line a large rimmed baking sheet with another sheet of foil. Place a rack in upper third of oven; preheat to 400°.Step 2Grate 3 oz. sharp white cheddar (not aged) and 3 oz. Gruyère on the large holes of a box grater (you should have 1 cup packed of each). Place in a medium bowl, gently toss to combine, and set aside.Step 3Scrub 3 lb. russet potatoes (about 6 medium), then peel. Using a sharp chef’s knife (or a mandoline if you have one), slice potatoes crosswise into ¼\"-thick rounds, transferring to a large bowl as you go. Very thinly slice ½ large yellow onion crosswise into half-moons, then add to bowl with potatoes.Step 4Add 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt and ½ tsp. cayenne pepper and season with freshly ground black pepper; toss to combine and coat potatoes and onions with seasonings.Step 5Place pie dish in front of you and imagine that it is the face of a clock. Arrange potato slices in a row in dish, overlapping by about two thirds, to extend in a straight line from ten o’clock to two o’clock (don’t worry about the onions; some will stick to potatoes and come along for the ride, and some won’t). It’s okay if the potato slices are lying flat at this point. Repeat with another row beneath the first one, arranging so second row overlaps halfway over first row.Step 6Using your hands, push both rows of potatoes gently toward the top edge (twelve o’clock) of the dish until they slide up the sides toward the rim, and are eventually perched on their outer edges at a steep diagonal and fit snugly into the pan.Photo by Emma Fishman, Food Styling by D'Mytrek BrownStep 7At this point, the potatoes should stay in place, and you can shingle more potatoes into the dish, row by row and overlapping as before, periodically pushing potatoes snugly together, until the dish is full. Tuck remaining slices of potato and onion in bowl into any available slots (you may have a few pieces of potato that don’t make it into the dish). Discard liquid left in bowl.Photo by Emma Fishman, Food Styling by D'Mytrek Brown Step 8Place pie dish onto prepared baking sheet (for catching any drips), then gradually pour 1¼ cups heavy cream over potatoes. Top with half of cheese mixture. Cover dish with prepared foil, buttered side down, and crimp very tightly to close.Step 9Bake gratin until potatoes are tender when pierced with a paring knife or skewer (uncover to check), 60–75 minutes. It’s okay if some cream has overflowed and browned—that’s what the foil lining is for.Step 10Remove gratin from oven and heat broiler. Carefully remove foil, directing the steam away from your face (it will be hot under there), then top gratin with remaining cheese mixture.Step 11Broil until cheese is bubbly and browned, about 4 minutes. Let gratin sit at least 10 minutes before serving.How would you rate Extremely Cheesy Potato Gratin?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI would love to make these but can’t see the recipe despite signing in. Chris3/3/2022These were absolutely amazing!   Agree with other reviewers - 1/4 teaspoon cayenne  which was plenty.  Can't imagine how hot it would be if I had used the ½ t.  ... and I like spicy!   Otherwise, followed recipe as instructed.  Because I was making for a small NYE gathering, I opted to bake it for about 50 minutes, removed, cooled and put into fridge overnight. Popped back into oven the next day (after letting it come to room temp for about an hour) for about 35-40 minutes, added the extra cheese, re-covered to melt,  then broiler for about 5 minutes - FANTASTIC!  Sandy MacSarasota, FL1/3/2022Almost exactly the formula I've been using for many years, one exception: I bring the potato slices to a very gentle boil for ONLY FIVE MINUTES in the cream, and then let them cool before assembling.   Softens the potatoes just a tad, but also some of the potato starch leeches into the cream which helps to 'firm' the final iteration.   I do like the idea of standing the potato slice up, great alternative.RobLPortland, OR12/30/2021We loved this recipe, although I made some small changes. I added half of the cheese while layering the potatoes in step 5.  Used way less cayenne, just a dash, and added a BIG handful of julienned ham.  I sliced my potatoes in the food processor on the 2 cm and 3 cm disk, but left uncovered in the oven (turned it to “convection” mode) just 15 minutes longer as it seemed the potatoes in the very center weren’t fork tender.  After the additional bake time it had browned nicely, so no need for the broiling step.  KayLynnOhio12/29/2021I made an NYT recipe on Christmas that was nearly identical and we loved it.  Subbed raclette for the cheddar (my invention).  I probably used half again as much cheese but, you know, cheese.  If your potatoes didn’t cook I’d say put a micrometer on those slices.  I used a mandolin and sliced a little thinner than 1/4”.  Absolutely no issue with the doneness.  If you’re concerned, slice on the thin side.  My biggest issue is broiling in the glass Pyrex pie pan.  I guess that’s okay since we used to use Pyrex in our lab equipment over a Bunsen burner, but make sure whatever dish you use is broiler safe.  I shattered Corningware under a broiler a number of years ago.  This year I used Le Crueset.JBHouston12/28/2021\"there is no mention of table salt in this recipe. And if you use table salt in anything you cook then this website is too advanced for you. Look elsewhere for your recipes (maybe the back of soup cans).\"  Was there really any reason to be this rude.  The comments that you are referencing did not deserve that level of rudeness and condescension.  Which I am sure you already know as you listed yourself as anonymous.FmwestesFolsom, California12/28/2021@Steven from Naples - there is no mention of table salt in this recipe. And if you use table salt in  anything you cook then this website is too advanced for you. Look elsewhere for your recipes (maybe the back of soup cans).\n\n@Kooks - Diamond kosher salt is lighter in weight by volume than Morton’s kosher salt. Therefore you would use more of Diamond compared to Mortons to attain the same level of “saltiness.” The recipe is correct in proportion as far as the salt goes. AnonymousLos Angeles12/28/2021Use yellow or red potatoes, rather than russets - they hold together better and have a creamier texture. Also, why on earth do you want us to scrub the potatoes if we're going to peel them? Just peel the damn things and rinse them under the tap!Yas12/28/2021I made this as a side this thanksgiving and my husband and I agreed it was our favorite out of everything we made. We couldn’t stop eating the leftovers either. Only thing is that for some reason the edges didn’t brown, just the center. Still blew our minds tho. Andrea R. Greenville, SC12/9/2021Par boil your potatoes first. I followed the directions to the letter. Undercooked by a mile. JessAlexqndria Va11/26/2021This was delicious and enjoyed by several different palates at our table BUT I only used 1/4 tsp cayenne and it was perfect.  I love heat but could not imagine 1/2 tsp.  Also added a bit more onion.  Messy but delish!Fishandforage11/9/2021This recipe is terrific and you will find yourself buying more potatoes...have been instructed to make this dish at least once a week...minimum!  One note...I did find using a glass casserole dish eliminates the need for foil (expensive)...especially with the glass lid (sprayed w/butter or whatever, of course) placed on top for the first hour of cooking, Placing dish on a pan insures no mess.  The bottoms and sides of the potatoes brown up when the lid is removed and cheeses are added for a quick broil....Sure, the bottoms don't brown....but no one cares....Also I vary cheeses...you will not be sorry you made this dish...Don't know anyone yet who doesn't  LOVE it...every time I make it!Tiny CoyneMtns of Show Low, AZ10/31/2021My gratin has been in the oven for 1 hour and 40 minutes now and the potatoes still aren't cooked. What did I do wrong?!AnonymousBangladesh 8/16/2021Delicious. Easy to customize. I love recipes that are more \"templates,\" where you can sub out similar ingredients. Hubby is not a fan of anything that resembles Swiss, so I used only mild cheddar. Instead of cayenne I used crushed dried thyme and red pepper flake. The dish turned out great. Will definitely make them again. Oh, and I didn't peel the potatoes...too lazy. Again, rave reviews. Thank you, CLM and BA. Joan in SBSanta Barbara, California2/15/2021I though diamond crystal kosher salt was less dense than Morton’s kosher salt.  So the proportions are reversed.  Also yes, 1/2 t cayenne sounds like a lot.  Also I think it’s bad nutritional advice to peel potatoes ever.Kooks2/6/2021Explore Bon AppétitCasseroleGratinPotatoVegetableGruyèreCheeseCheddarRusset PotatoWinterMainSideGluten-FreeNut-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-20", "author": ["Condé Nast", "Carla Lalli Music"]}