{"id": "138354d21e67730b09cbcf36163d7c77", "url": "https://www.bonappetit.com/story/chipwich-on-the-beach", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "A Chipwich on the Jersey Shore Beach Is Italian-American Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Chipwich on the Beach Is Italian-American TooHow summers at the Jersey Shore expanded my definition of red sauce.By Emily SchultzApril 16, 2019FacebookTwitterEmailsainaniritu/Getty ImagesFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.It takes exactly one hour to get from the house I grew up in to the shore. As we drove the length of the Atlantic City expressway, we would peel off at Exit 2 to make our way to the shore house. Before I perfected this route, my grandmother taught me a trick:“Lick your pointer finger. If it tastes like salt, you’re down the shore.”We’d get in from what felt like a journey—my family isn’t much for road trips—and visit my paternal grandmother, who lived in Atlantic City full time. We’d walk the two blocks from her apartment on Raleigh Avenue to Richmond Avenue and catch up over slices at Fiesta pizza. She would ask for her pizza with minimal crust while adjusting her hearing aid. Other times we’d drive down to Mento’s, a family-run water ice (like a smoother Italian ice) spot in the basement of a house. We’d get cherry water ice that would stain our tongues for the rest of the night and overstay our welcome on the brown-painted picnic table facing Ventnor Avenue. Then I’d part ways with my grandmother and immediately make plans with cousins or second-cousins or friends-who-we-called-cousins.The next morning we’d walk eight blocks to my maternal grandparents’ house, stopping at the corner store on our way to pick up a loaf or two of Atlantic City bread—long, squishy, pale baguettes that make for the best beach hoagie of your life. My cousins would come barreling down the stairs as soon as they heard the crinkle of the wax paper revealing an array of cold cuts my grandmother had picked up from the deli. We would each point to the items we wanted in our sandwich: wiggly deli turkey breast, bright pink salami, smooth yellow mustard. After our creations were assembled we would walk to the beach past Florida Cold Cuts, a corner store that we were not allowed to go into due to a certain fight between my mom and the owner that happened in regard to ranch dressing (it’s best not to ask).Instagram contentThis content can also be viewed on the site it originates from.Or maybe it was a day that we skipped the Atlantic City bread because we were going to order stuffed Italian hoagies, layered high with salami, mortadella, and provolone cheese. We’d get them from Dino’s or Sack O’ Subs if no one wanted to leave the beach—the delivery person literally walked onto the sand to hand over the precious cargo. Sometimes my dad’s family would be visiting, so he’d drive into the city itself and pick up some famous White House Subs—the ones stuffed with hot peppers, stacks of cold cuts, and crunchy lettuce. We ate the hoagies right there on the beach, my mom trying to get the sand off a towel as my cousin chased a paper plate in a gust of wind.Or maybe it was one of those super hot days in August—you know the kind where the ocean is filled with seaweed so you have no choice but to bake in the sun? Then maybe we would walk down to the beach on Washington Avenue and buy a Chipwich from John the Ice Cream Man. We would wave him down, more excited to see him than anyone else in the world. He would tell us to wait until the bits of ice that had clung to the plastic packaging melted off, and one of the adults would fling a stack of dollar bills at him.So yeah, none of these are red sauce places. But nothing feels more Italian-American to me than eating meals—everyday meals, not just the big displays of piccata or parm—down the shore with my boisterous family, whose last names all happen to end in vowels. And each trip, before we knew it, the weekend would be over and we would get in the car to drive back to the other side of New Jersey, letting the salty air in through an open window until it was time to get back on the highway.Emily Schultz is the social media manager at Bon Appétit.Explore Bon AppétitItalian AmericanNew JerseyRestaurantsRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Emily Schultz"]}