{"id": "139bf624e67afaf7a8aa48e532c0f410", "url": "https://www.bonappetit.com/recipe/salmon-and-broccolini", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Salmon and Broccolini  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalmon and Broccolini with Citrus-Chile SauceBy Chris MoroccoDecember 26, 20184.8(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintLayers of bright citrus and gentle heat add tons of flavor without weighing down this dish. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servings3jalapeños, stemmed, seeded (save some of the seeds to add later if you like things spicy)1garlic cloveKosher saltFinely grated zest from ¼ grapefruit1tsp. honey4Tbsp. extra-virgin olive oil, divided1bunch broccolini, cut into 1\" pieces25–6-oz. skin-on, boneless salmon fillets1Belgian endive, leaves separated and torn into large pieces2Tbsp. fresh grapefruit juice4tsp. unseasoned rice vinegarToasted sesame seeds (for serving)PreparationStep 1Finely chop jalapeños and garlic on a cutting board; sprinkle with a pinch of salt. Crush with the side of a chef’s knife until broken down into a coarse mash. (You can also purée in a food processor or mash with a mortar and pestle if you prefer.) Transfer to a small bowl and add grapefruit zest, honey, and 2 Tbsp. oil; toss to combine. Let green chile kosho sit until ready to use.Step 2Heat 1 Tbsp. oil in a medium nonstick skillet over medium-high. Add broccolini and cook, tossing occasionally, until charred in spots and crisp-tender, 5–6 minutes. Transfer to a plate.Step 3Heat remaining 1 Tbsp. oil in skillet over medium. Season salmon with salt and cook, skin side down, until skin is browned and crisp, 6–7 minutes. Turn and cook on flesh side just until cooked through, about 1 minute.Step 4Arrange broccolini and endive on a platter; season with salt. Arrange salmon over. Stir grapefruit juice and vinegar into dressing. Drizzle dressing over salmon, then top with sesame seeds.How would you rate Salmon and Broccolini with Citrus-Chile Sauce?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleLoved it!\nI was a bit afraid about changing the grapefruit for a combination of mandarin and lemon (I use a medication that doesn´t go along with grapefruits so... I know, RANDOM!) and I did not have rice vinegar, so I used lime vinegar, but it didnt matter... it was SO GOOD!\nBright, balanced, full of flavor, and the most important...very easy, no oven required :)!Alejandra CarrilloTijuana, México3/4/2021I have made this twice and both times it was amazing.  Lots of flavor but the Jalapeño was not overwhelming.  I would recommend making it.  Low carb. and very delicious.Andrea CoxGrand Lake, Colorado5/11/2020So so so good. Bright, vibrant and comes together really fast! A treat on a weeknight. Anonymous1/28/2020Really good and not very difficult. It sort of just comes together out of nowhere. It's well balanced. I would have never considered grapefruit as something to go with jalapeno and salmon, but it works really well. It's just the right amount.AnonymousVallejo, CA12/14/2019Perfect weeknight meal. The sauce is amazing. My partner isn't a fan of grapefruit, but he had no complaints. The grapefruit flavor is very mild. Will definitely make again.alrr0610Oak Park, IL 3/15/2019So delicious and came together really quickly! The sauce is definitely the star here!AnonymousBrooklyn1/29/2019I meant five stars!gailgh2Southern California1/28/2019I used pink grapefruit - have a tree in my yard. I never saw what one was supposed to do with the green chile kosho - decided that it was supposed to be mixed with the grapefruit juice and vinegar dressing. Used an iron skillet, not \"nonstick.\" Also I thought that it needed a little extra - had not eaten much all day, so put some basmati rice on the plate with the vegetables and fish. This was delicious!gailgh2Southern California1/28/2019Delicious! Did not have endive so thinly sliced raw celery instead which worked great. AnonymousPhiladelphia 1/16/2019Loved this so much! Had a bunch of broccoli to use up so I subbed that for the broccolini and added coconut rice to balance out. Salmon was a thick cut so took a lot longer to cook but the sauce is DELICIOUS. Will definitely make again. Thanks Chris!AnonymousBrooklyn 1/16/2019The star of this dish is the green chile kosho. My partner doesn't care for grapefruit, so we substituted blood orange and it was still delicious. I didn't find it as fast as some other folks are commenting, but maybe I just move slow. I love the idea of using a blender for the sauce.austin738257923840921/13/2019Made this last night and it was amazing. We absolutely devoured this.  It's really easy and fast to put together.   Loved the sauce and combination of flavors of fish and crunch, etc.  Definitely will make again. Anonymous1/9/2019I made the sauce in a blender because I thought it would take less time and it still came out really great! I combined the vingear and grapefruit right into the blender when I did this because it needed more liquid. Also, I cooked the fish and ate it for lunch the next day with the leftover grapefruit I had cut for the juice. Very good. eschultzBonAppetit.com1/8/2019This is so FAST! And full of flavor. Will definitely incorporate into my weeknight dinner rotation. I left all the seeds in because I like things spicy and it was great.AnonymousNew York 1/8/2019This was a great meal, loved the sauce exactly as written and the endive was a nice contrast with everything. Yum!AnonymousDC1/7/2019Explore Bon AppétitSalmonFishSeafoodGrapefruitCitrusFruitBroccoliVegetableQuickEasyWeeknight MealsMainDairy-FreeKetoGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-17", "author": ["Condé Nast", "Chris Morocco"]}