{"id": "13a04b570adbe02d4a6d2af6349bd2c5", "url": "https://www.bonappetit.com/recipe/sushi-rice-with-miso-caramel-glazed-salmon", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Sushi Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSushi Rice with Miso-Caramel Glazed SalmonBy Chris MoroccoMay 29, 20194.7(84)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe tastiest rice is seasoned sushi rice. It has vinegar, salt, and sugar added to develop a wide range of flavors, making it a dynamic counterpart to simple fish for a hassle-free weeknight dinner.Ingredients2 servingsSeasoned Rice1cup short-grain sushi rice1tsp. kosher salt, plus more2Tbsp. unseasoned rice vinegar1½tsp. sugarSalmon and Assembly2Tbsp. pure maple syrup2Tbsp. red or white miso2Tbsp. tamari or soy sauce2Tbsp. unseasoned rice vinegar¼tsp. crushed red pepper flakes, plus more for serving1Tbsp. extra-virgin olive oil25–6-oz. boneless salmon filletsKosher salt3scallions, sliced1Tbsp. toasted sesame seedsLime wedges (for serving)PreparationSeasoned RiceStep 1Rinse rice several times with cold water in a colander until water runs clear. Drain well. Transfer to a small saucepan. Add a pinch of salt and 1¼ cups cold water. Bring to a boil over medium-high heat. Stir rice once, cover, and reduce heat to low. Cook until water is evaporated and rice is tender, 18–20 minutes. Remove from heat and let sit, covered, 10 minutes.Step 2Whisk vinegar, sugar, and remaining 1 tsp. salt in a small bowl until sugar dissolves. Stir into rice and let sit (covered so it stays warm) until ready to use.Salmon and AssemblyStep 3Whisk maple syrup, miso, tamari, vinegar, and ¼ tsp. red pepper flakes in a small bowl to combine.Step 4Heat oil in a medium nonstick skillet over medium. Season salmon with salt and place in skillet skin side down. Cook, shaking pan occasionally to redistribute oil in skillet, until skin is very crisp and deep golden brown, 7–9 minutes. Turn salmon and continue to cook just until very lightly browned on the flesh side (by this point it should be nearly cooked through), about 2 minutes longer. Using a spatula to hold fish from tumbling out of skillet (or just transfer salmon to a plate while you do this), pour off fat from skillet. (Return fish to skillet if needed before proceeding.) Reduce heat to low and add glaze; cook, stirring occasionally, until it begins to thicken, about 1 minute. Baste salmon with glaze and cook, basting occasionally, until glaze evenly coats fish, about 1 minute longer.Step 5Serve salmon on top of rice. Drizzle with any leftover glaze. Top with scallions, sesame seeds, and red pepper flakes. Serve with lime wedges alongside for squeezing over.How would you rate Sushi Rice with Miso-Caramel Glazed Salmon?Leave a ReviewTell us what you thinkReviews (48)Back to TopTriangleThis is a fabulous recipe with room for modifications.  I made this with a piece of rock cod and a piece of salmon, doubled the amount of sauce so that I could add bok choy, and served it over the sushi rice as described in the recipe.  It was great.  I can also prepare this with doubled sauce and use half of the sauce for tofu for my vegan grandkids.  I think they will love it.PatriciaPalo Alto, CA9/17/2021I was in a rush and made a mistake - didn't read the reviews beforehand. The glaze was far too salty, almost inedible. Used red miso and plus sodium soy. Managed to sort of save it by adding raw cucumbers, which offset the salt. Loved the rice - used a lazy shortcut and just added the vinegar mixture to leftover rice. A recipe I'd definitely try again with much reduced soy and maybe a lighter miso.ArianeRochester,  NY9/16/2021I am only commenting on the salmon, as I did not make the rice. The ingredients for the glaze were really good and the whole thing was easy to make. I did not have the overly salty issue that other commenters had. Maybe because I used coconut aminos (it's what I had)? Maybe my miso wasn't super salty? It actually turned out a tad sweeter than I would have liked. I would probably use a touch less maple syrup next time. I also added some grated garlic to the mixture. Overall it was delicious and I would make it again! JWNashville, TN9/15/2021Very good. Reduced salt in rice and in sauce based on other reviews. One can add more if need be. Served with baby bok choy. No green onions in the house so used sweet onions diced and cilantro. Will add this to the rotation.HopsingOregon8/10/2021Very easy to make and very delicious! The glaze was a bit salty for my taste even though I’ve reduced the soy sauce, or maybe it was the miso.. nevertheless it was still a really tasty recipe SuzyMalaysia 7/4/2021Great recipe! I made this for dinner tonight and loved it. Super easy and tasty! JillianChicago, IL5/11/2021Good, but next time I'll try to make it better with less salt.  G.G.Grand Marais, Minnesota3/7/2021One of my go-to weeknight dinners. Love love love this recipe. MLBrooklyn, NY12/25/2020This was absolutely amazing! I read the reviews and cut the tamari in half and the only other added salt was on the fish and I thought it was perfectly seasoned. I served it with some sauteed bok choy, julienned snow peas and scallions as well.AnonymousPortsmouth, NH11/23/2020It was ok. I thought it was a bit too salty. It was pretty easy to throw together so that was good. Don’t think I’ll make it again.EmSeattle, Wa11/18/2020The effort:reward ratio is ideal for a weeknight when you want to eat something delicious. Followed the recipe exactly (but used low sodium soy sauce) and didn’t find it too salty. Will definitely be making this again!MaggieAtlanta, GA10/28/2020So good! Gotta love a less-than-30 minute meal that tastes as great as this. I followed the advice of other comments and cut the soy sauce in half and found the saltiness level to be just right. Served with some pak choi I pan-fried/steamed in the salmon pan before the glazing stage. pottsy.1990London, England9/30/2020Last week I made a miso-glazed salmon from a recipe from America's Test Kitchen.  I had never used miso paste before and the recipe was simple enough.  I did not like it; the salmon was dry and there was no sauce. I tried this recipe after reading lots of reviews mentioning that they had tried other miso recipes and they liked this one best.  It was absolutely delicious! Very easy to make, the salmon was juicy and the maple-miso-glaze was outstanding.  I only used one Tbsp of miso and 1 Tbsp of low sodium soy sauce just to keep my sodium down, but now I wonder if it was necessary as I actually ended up adding a little salt to it once it was finished.  I will make this over and over again!! Thank you Bon Appetit!!AnonymousMiami9/21/2020Deeeeelicious! So simple, but nice complexity of flavors and a very satisfying dish. This recipe will stay in rotation from now on. Thanks, BA!AnonymousTexas9/18/2020My absolute favorite miso salmon recipe... and I've tried a lot of them. It's super simple for a delicious quick dinner.Jennifer APasadena9/9/2020Explore Bon AppétitJapaneseEast AsianAsianSalmonFishSeafoodMisoCondiments, Sauces & PastesRiceRice & GrainsEasyWeeknight MealsMainSideDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Chris Morocco"]}