{"id": "13b78d8a4cd84757d58e355349b7c1ab", "url": "https://www.bonappetit.com/recipe/seedy-sweet-potato-oatmeal", "year": 2020.0, "month": 11.0, "day": 5.0, "content": "Seedy Sweet Potato Oatmeal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeedy Sweet Potato OatmealBy Sara EliseNovember 30, 20204.5(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrint“I love taking my time with this recipe to make cooking part of my calming morning ritual,” writes recipe developer Sara Elise. “I also love that I can customize the milk and toppings to people’s dietary preferences or whatever I feel my body needs at the moment. Packed with nutrients and antioxidants, it feels like the perfect grounding, nourishing start to my day.”Ingredients2 servings½cup (or more) unsweetened coconut milk or milk of your choice (such as oat, hemp, or cow’s milk)½cup old-fashioned oats1tsp. ground turmeric½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1steamed small sweet potato, peeled, mashed1very ripe banana, mashed1½tsp. ghee, unsalted butter, or vegan butter, melted½tsp. ground cinnamonFresh fruit, dried fruit, nuts, and seeds of your choice (for serving)PreparationStep 1Bring coconut milk and 1½ cups water to a boil in a small saucepan. Stir in oats, turmeric, and salt. Reduce heat to medium-low and cook, stirring occasionally, until oats are tender and mixture is creamy, about 4 minutes.Step 2Remove pan from heat and stir in sweet potato, banana, ghee, and cinnamon. Add a little more milk to loosen if desired.Step 3Top with nuts, seeds, and sliced fruit as you like, paying attention to what your body needs and craves for the day. Serve warm to the people you love.How would you rate Seedy Sweet Potato Oatmeal?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI think recipe sounds interesting but hats off to Rosewood from Wichita KS...your comment had me on the floor. DaniWilmington DE 10/22/2021Warm and delicious. I blended all the ingredients at the end, added unsweetened coconut flakes and sunflower kernels, and enjoyed a bowl of this comforting oatmeal.AmandaLake Atitlan, Guatemala9/29/2021Doubled the recipe overall, but used a total of 2 cups almond milk (and no water).  Substituted Soom Tahini instead of ghee.  Used roasted and puréed pumpkin instead of taters. Added a little maple syrup for good measure.  Creamy and hearty!BomzePhiladelphia, PA6/8/2021Savory and comforting! I used steel cut oats so I had to cook it a little longer, and I used a leftover yellow sweet potato (oven roasted). I omitted the banana and dried fruit, but topped with almond slivers, pumpkin seeds, and a drizzle of maple syrup. Added a splash of milk and a dusting of cinnamon to top it off... yum :)KristenSeattle, WA1/8/2021Yummy, but needs some adjustments depending on what you have! I followed another reviewer’s advice and used only 1 1/4 cups water and a heaping 1/2 cup oats for a slightly thicker oatmeal and even cooked it 2-3 minutes longer than called for. Since my banana was just ripe, I microwaved it for 1 minute when I was steaming my sweet potato for 5 minutes. I still found it to be a little more savory and salty than we like, so I added in 2-3 tbsps of honey before topping with pepitas, walnuts, blueberries, and pear. A very hearty rainy day breakfast!AshRedmond, WA12/13/2020Gotta say, I had my doubts - but I am an oatmeal and sweet potato lover so I thought I’d give it a try.This is really tasty!! I used 1/4 cup LESS water and about 2 tbsp MORE oatmeal, approx 1 tbsp chia seeds and raisins during the cooking time. Topped with sesame, pumpkin and hemp seeds and some nice thick Greek yogurt..I will make this again!!LindaGold Canyon, Az12/10/2020I don't have a steamer, so I just threw the sweet potato in the oven. Also didn't have an overripe banana, so threw a moderately ripe banana in the oven along with the sweet potato. Baking the banana ups the sweetness! yum. ivymCA12/9/2020Am I the only one that found the ingredients hard to source and instructions unclear? What my body needs and craves is whisky which as far as I can tell is not a nut, seed, or sliced fruit.  I added it all the same. \n\nFinally, serving warm was no big deal. But where do I find people I love? Plural? It is hard enough to source in the singular yet alone to more than one person. Also if this serves 2 people and I serve it to 2 people I love, I guess I don't get any? \n\nAnyway, in the end the mass of the sweet potato and the banana far outweighed the mass of the oatmeal and the whisky. So it was more like warm bananay sweet potato whisky soup with oats. Going with double the oats (to also help with the serving suggestion), and going to half a banana, half a sweet potato, double the whisky felt more like Oatmeal that was a Sweet Potato Oatmeal. \n\nAlso, no one I love is a bird or a starting shortstop for the Mets so I kept the seeds away but you do you. I recommend soaking the seeds in the whisky. RosewoodWichita, KS12/8/2020Followed the recipe as is, topped with nuts and seeds (not a fan of dried fruit!), and a little drizzle of maple syrup. It was delicious, filling, and the portion sizes were very generous! I thought the mixture seemed a little liquidy at first, but it thickened quickly and ended up being the perfect texture and consistency.RPOntario, Canada12/7/2020Two Questions = It's looking as though you have found the \"errors\" and corrected them. The amount of liquid is much less that original recipe. AND the directions are more clear about how the sweet potato works in the recipe.\nJudithHouston12/7/2020I'll have to try this. Sound wonderfully tasty.  A sweet potato, a banana and some oats:  does that really seem scant to others for two people.  For breakfast??    Unless, of course, you one of those lucky people with metabolism that enables you to eat like a p...?  Jealous, jealous am I!!AnonymousMIAMI, FL12/7/2020I think the proportions of this recipe are a bit off. Two cups of liquid is a lot for half a cup of oats. Even after mixing in the banana and sweet potato mine was still quite soupy. Also a little scanty for two people, unless you add tons of toppings. But the flavors are pretty good. I think I might add an extra quarter cup of oats next time.Anonymous12/1/2020Explore Bon AppétitPorridgeOatRice & GrainsSweet PotatoPotatoVegetableEasyQuickVegetarianGluten-FreeHealthyishSimmerBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-30", "author": ["Condé Nast", "Sara Elise"]}