{"id": "13d34893e413f87c2ed679ab7bf6feb8", "url": "https://www.bonappetit.com/story/brownie-texture-feud", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "The Most Ridiculous Baking Project Is the Bûche de Noël | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Most Ridiculous Baking Project Is the Bûche de NoëlClaire Saffitz weighs in on the holiday season’s most extra dessert.By Alex BeggsDecember 21, 2019FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Grinch de NoëlClaire Saffitz was wearing a bright red sweatsuit and a green puffy coat. “I’m really not in the holiday spirit,” she said.She was sleep-deprived, past her cookbook deadline, and exhausted from a day of filming. But even when Claire is feeling Grinchy she is kind and generous with her time. And I wanted to know: Why in the world would anyone ever want to make a bûche de noël?“In their right mind?” she said, “I’m not sure why.” The labor intensive, showstopping rolled cake requires a minimum of three components: a sponge cake, a filling, and a frosting. It’s a project with a capital P. Claire developed a maximalist bûche for Bon Appétit in 2015. It looks like a birch log plucked from a Christmas card. It has a bittersweet espresso ganache. Mascarpone filling. It has BRANCHES. “I went for it with the decorations with that one,” she said. “I wanted it to look like an actual log. A decomposing log.” A classic Claire shrug. “I do like making the meringue mushrooms! But if you’re in a hurry, you shouldn’t be making bûche de noël.”A gorgeous bûche in the newly updated Tartine cookbook—Claire and I discussed the ingenious white chocolate mushrooms here, which look SO REAL.\nPhoto by Gentl & HyersIf you’re not up for a bûche, Claire suggests making gingerbread or her stunning sticky toffee bundt cake from October 2015. “No one cannot like it,” she said. “We have enough stress around the holidays to worry about meringue mushrooms.”We love you, sticky toffee bundt.\nChristopher TestaniGet the recipes:Double Ginger Sticky Toffee PuddingBûche de Noël IF YOU DAREI also like Claire’s Apple Gingerbread Cake with CreamWant this letter before it hits the website? Sign up for our newsletter!Photo by Alex Lau, Food Styling by Yekaterina BoytsovaWhat I’m cooking this weekendBasically’s Winter Greens Gratin With All the Cheese. Do I need to explain why? LOOK AT IT.In stable conditionI’m deeply invested in the niche drama that is Martha Stewart’s comment on Queer Eye’s Antoni Porowski’s Instagram from her horse stables in Connecticut (ha). What can I say, I’m a news junkie. Martha wrote:“Dear antoni: this is @marthastewart48 You did not tag me on this photo of my stable nor the photo of my beautiful dogs Han, Qin , bete noir and creme brulee We are bummed about that because you have so many followers and you are my Christmas cookies!!! You were nice not to post the forbidden scenes and we thank you!!!”WHAT ARE THE FORBIDDEN SCENES, MARTHA??? Otherwise, I’ll just assume they got wasted on CBD hot cocoa and decorated anatomically correct gingerbread men.Need a last minute holiday gift? Find Martha Stewart’s latest book, Martha Stewart’s Cookie Perfection, here. Sweeten the gift with this fancy amazing vanilla paste and my favorite unbleached parchment paper sheets. Ho, ho, ho. What do you know, we might make an affiliate commission off your purchases.HahaTrader Joe’s: Year in ReviewThe five best things I reviewed from Trader Joe’s in 2019:Mac and Cheese BitesPancake BreadSuper Sour Scandinavian SwimmersMochi Cake MixOrganic Elote Corn Chip DippersThe...worst three:Freeze Dried Red Seedless Grape SlicesCashew Cream Fiesta DipCauliflower Butternut Squash RisottoUnnecessary food meme of the weekUnnecessary food feud of the weekBA’s Best Brownies are peak soft and chewy.\nPhoto by Laura Murray, styling by Anna Bilingskog.Basically editor Sarah Jampel was working on a brownie recipe that divided the staff into two opposing parties: those who prefer a dense, fudgy brownie versus a chewy, soft brownie.Team fudge was...a party of one. Jampel. She defines a fudgy brownie as one normally made with melted chocolate, or a mix of melted chocolate and cocoa powder. “The fat and sugar in melted chocolate give them a creamy, luscious texture with fewer air pockets, less crumbs. They’re dense,” said Jampel. “I want a brownie to melt in my mouth—no chew.”Andy Baraghani is here for chewy: “When I take a bite of a fudgy brownie, and then another bite, I don’t want anymore. It sticks to the roof of your mouth,” he said. Meryl Rothstein pointed to Alice Medrich’s fudgy brownies (recipe below), which she makes sans walnuts—another feud for another time. In between slicing what appeared to be 50 pounds of mortadella, Brad Leone groaned, “Gahhhhhh not a brownie guy. But if I’m having one, I don’t want the brownie to be rawr inside.” “Rawr” is Bradspeak for “raw,” which means underbaked, which wasn’t even the question. But okay. Thanks for the mortadella slice, Brad!Claire Saffitz wants chew, “otherwise it’s too rich,” she said. Chris Morocco weighs in: “I want some chew, not a chocolate brick, not some Desserts by David Glass confection. Look it up, Beggs, it was a thing in the ‘90s.” Fine!Sohla El-Waylly is “chewy all the way. I grew up on the Ghiradelli dark chocolate box mix, that’s my reference point.” She tried Jampel’s fudgy brownies, though, and declared them “excellent” and “high-caliber.” Stay tuned for that recipe—the result will surprise you!Meanwhile, get the recipe: Alice Medrich’s Cocoa Brownies with Browned Butter and WalnutsExplore Bon AppétitBeggs NewsletterRead MorecookingThe Best Eggnog Tastes Like Melted Ice Cream Mixed With BoozeBy Al CullitoncultureThese Bitters Turn a Deadbeat Gift Into a Thoughtful OneBy Hilary CadiganLifestyle10 of My Best Holiday Gift Ideas Because We’re All STRESSED About ItBy Amanda ShapirocultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-21", "author": ["Condé Nast", "Alex Beggs"]}