{"id": "13dce6ee41466f7051038dc1fd2bfccc", "url": "https://www.bonappetit.com/story/what-is-mortadella", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "What Is Mortadella, the Coolest Deli Meat in the Butcher Case? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Mortadella, the Cool Kid of the Deli Case?Get to know everyone’s favorite millennial pink deli meat.By Bettina MakalintalDecember 8, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailMortadella is everywhere. Across the country it’s draped across pizzas and stuffed into sandwiches, like New Orleans’s iconic muffuletta and even a riff on the Japanese katsu sando. But mortadella, which sits pretty in pink in the deli case, isn’t constrained only to the realm of the edible, it has emerged as the meat of the moment, immortalized on shirts, socks, caps, and even as a smiling, fleshy pool float from artist Katie Kimmel. You can drape your own smiling, fleshy self over it—before toweling off with illustrator Marianna Fierro’s flying mortadella towel, of course.“The people that love mortadella love mortadella,” says Marc Hernandez, meat and cheese buyer at Formaggio Kitchen in Cambridge, Massachusetts, who counts it among his favorite deli meats. Mortadella is not only maintaining its popularity, he says, but he’s been seeing it on more menus, from pizza shops to finer dining joints. “People are coming around to it and realizing it’s not just elevated baloney,” he explains. “Especially when you get a good quality mortadella, nothing beats it.”But what is mortadella, actually?Mortadella is an emulsified large-format pork sausage. In non-butcher speak, that means that pork meat is finely minced into a smooth paste, put into a casing, and steamed until the whole thing is evenly and thoroughly cooked, Hernandez explains. Mortadella gets its speckled look as a result of fat, pistachios (often, but not always), and black peppercorns mixed in with the meat.Neck fat from the pig is ideal here, according to Hernandez, “because it has a high melting point, so it’s going to stay tender but not melt” as the sausage cooks, giving mortadella its signature silky texture. Because of all that richness, people tend to prefer their mortadella sliced paper-thin, he adds.As for the etymology, according to one hypothesis, the word mortadella comes from the Latin word mortarium, or mortar, referring to the tool in which the meat is pounded. According to another, it’s derived from the Latin term farcimen myrtatum, a sausage flavored with myrtle berries—a common addition centuries ago, when peppercorns were less accessible. Since myrtle is known as mirto in Italian, mirto becomes mortadella, says Dino Borri, global vice president at Eataly.Where does mortadella come from?Italy, originally—though American-made mortadella from purveyors like Tempesta Artisan Salumi and Olympia Provisions also exists. As a result of that jump, there’s some confusion in the United States about mortadella, according to Borri. In Italy, “there is not just one mortadella” but many, he says. They’re usually made of 100% pork but with regional variations, he explains, comparing it to prosciutto, an umbrella term referring to a leg of pork that exists in varieties like prosciutto di Parma, prosciutto di San Daniele, and so on.Stateside, what we call mortadella is usually actually mortadella Bologna, Borri says, a variety that carries a protected geographical indication certifying that it was made within specific regions of Italy using particular standards. And though bologna (or as we know it in the U.S., baloney) shares a name with the Italian city, that sandwich meat is more of a North American creation; often attributed to German immigrants, it can be made with any kind of meat or a combination of meats.How do I know I’m getting the good stuff? And what is “the good stuff” anyway?You can tell by the mouthfeel, primarily. Borri seeks out meat that feels soft in the mouth and chews into a consistent texture, without defined pieces in each bite. “You want something smooth and silky in texture, very rich in flavor, and fatty,” Hernandez explains. That’s a sign of a more controlled method of cooking since “if you cook at too high heat or too aggressive of a manner, you’ll get more of a grainy texture.” Ideally, you won’t find those versions at the deli counter since producers should do quality checks, Borri says. In addition, mortadella should have a slight sweetness and a strong but pleasant smell.I got the goods! Now how do I serve it?In Bologna you’ll often find it sandwiched between rolls, around lunchtime or 4 p.m., according to Borri. “Just bread and mortadella is the most traditional,” he says. Alternately, you can also find mortadella sliced into thicker cubes and eaten as is during aperitivo time. “Both ways are perfectly reasonable,” Hernandez says, adding that if you’re looking for the latter, ask for a thick slice of mortadella and then cut it up at home. Mortadella also makes a great addition to charcuterie boards, pasta (both as a filling and sizzled up as a salty add-in), and meatballs.We’re big fans of mortadella at BA, though we admittedly don’t always take the traditional route. Wanna keep it classic? Skewer a piece of mortadella with pepperoncini and focaccia in this party-friendly recipe from Andy Baraghani, or layer its velvety sheets into a dreamy bed of cold cuts for your next big hoagie. Or go all in on your own thing—tell bacon to move over by making Ali Slagle’s mortadella wedge salad. Seasons meatings!Mortadella, We Love YouMortadella Wedge SaladIt’s not like a regular wedge; it’s a cool wedge—and by cool we mean stuffed with pickled jalapeños and paper-thin slices of mortadella and drizzled with tangy buttermilk dressing.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-08", "author": ["Condé Nast", "Bettina Makalintal"]}