{"id": "13e2f55b99ec0897136297c6204e866b", "url": "https://www.bonappetit.com/story/a-recipe-calls-for-vegetable-stock-can-i-just-use-water", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Can I Use Water Instead of Vegetable Broth? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Recipe Calls for Vegetable Broth. Can I Just Use Water?Chances I have water > chances I have vegetable broth.By Rebecca GaoNovember 10, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailIf you’re anything like me, you’ve been knee-deep in a recipe only to realize you’re fresh out of vegetable stock. As you panic about ruining your batch of Hetty McKinnon’s one-pot mac and cheese, one small thought enters your mind: Can I just use water?The simple answer is yes, it’s usually okay to substitute vegetable stock with water. In most recipes that call for vegetable stock, its main advantage over water is that it provides flavor, which is especially important if you're making vegetarian or vegan food that’s missing the richness from meat. “When you're missing the animal protein, you still want an umami factor,” BA senior food editor Andy Baraghani says.According to McKinnon, whose most recent cookbook is To Asia, With Love, you can confidently substitute veg stock with water when you’re cooking with meat because so much of a dish's flavor comes from the meat itself. “But if you're cooking vegetarian food, I always think you need to build layers of flavors, and stock is just one of those layers.”Unless you get low-sodium stock, most store-bought stocks are fairly salty, so one of the main elements you miss out on when replacing it with water is sodium content. If you are going to sub water for stock, McKinnon suggests adding salt and herbs (like thyme, bay leaves, and rosemary) to your water to compensate for the lost flavor. Her mac and cheese recipe, for example, calls for vegetable stock, but it’s totally okay to sub with water because the dish is loaded with herbs and aromatics. When a dish already has a lot going on, like a mixture of onions, garlic, ginger, and chiles cooked long and hard, agrees Baraghani, water can easily replace stock.If you don’t keep stock on hand but you don’t want to lose out on flavor, McKinnon suggests dissolving bouillon cubes in water. Bouillon powder (which, like cubes, is made of dehydrated veggies and seasoning) is another easy way to add flavor to your vegetarian cooking. Plus, it’s versatile, can be used to season almost any dish that needs a little bit of a flavor kick, and is a great pantry staple—especially in these one-grocery-run-a-week times. McKinnon swears by Vegeta, which her mom used. “In many cases, [my mom] will add the powder straight into the pot,” she says. Jarred bouillon, like Better Than Bouillon, is another option.Of course, there’s also absolutely nothing wrong with buying cartons of vegetable stock. But, unless you have a brand you’re familiar with, you often don’t know what you’re getting, and they sometimes taste sweeter than the homemade stuff or bouillon. Making your own stock gives you full control, and it’s a great way to use up the veggie scraps (carrot tops, potato peels, and onion skins) you’ve been storing in the freezer. You might need to experiment a bit until you get a stock you like—start with one of stock recipes. “I find adding kombu, which is essential to making dashi, is the way to kind of get that salty umami flavor,” says Baraghani.Though there aren’t hard and fast rules when it comes to stock, there are a couple scenarios where substitution isn’t a good idea. Whenever the flavor is coming primarily from stock, you shouldn’t substitute it with water. In that case, you’ll also want to make sure the stock you’re using tastes good to you. Any brothy non-puréed soups should be made with your favorite vegetable stock if that’s what the recipe calls for—the stock is what you’ll mostly be tasting. The same can be said for starches like risotto or polenta, which soak up flavor from the liquid as they cook.So make your own stock, try store-bought cartons, cubes, powders, or jars until you find what you like best, or experiment with replacing your stock with seasoned water. But whatever you do, don’t let a lack of stock stop you from making this mac and cheese.Get the recipe:One-Pot Kimchi and Squash Mac and CheeseThis is a “necessity is the mother of invention” kind of recipe, born from isolation, scant ingredients, an oversupply of kimchi, and sheer hunger. Yet this unconventional one-pot approach also happens to be one of the simplest ways to prepare mac and cheese. View RecipeRebecca Gao is a Toronto-based journalist interested in climate, food and late-aughts teen movies. In her spare time, she can be found baking (or at least trying to). Her writing can be found in Chatelaine, FLARE, VICE, Reader's Digest, and more.Explore Bon AppétitStockBrothSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-10", "author": ["Condé Nast", "Rebecca Gao"]}