{"id": "13e9af918d1bf5a79ffbe340f78c5036", "url": "https://www.bonappetit.com/recipe/jammy-eggs-with-paprika-aioli", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Jammy Eggs with Paprika Aioli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJammy Eggs with Paprika AioliBy Lauren SchaeferMarch 22, 20184.4(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintLike deviled eggs—but faster, easier, more delicious, and fancier-sounding. This recipe calls for peperoncini, but most pickle-y things (cornichons, olives, that jar of dilly beans you've had for years) will work just as well.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Saucepan$155 At AmazonSpider$6 At AmazonLarge Bowl$18 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonSpoon$24.69 At AmazonPlate$55 At Bon Appétit MarketIngredientsMakes 84large eggs, room temperature2jarred peperoncini in brine4sprigs parsley¼cup mayonnaise½tsp. smoked or hot paprikaKosher saltPreparationStep 1Bring a small saucepan of water to a boil.Step 2Using a spider or slotted spoon, carefully lower 4 eggs into boiling water. Set timer for 8 minutes. Fill a large bowl with ice water.Step 3While eggs are boiling, do the rest of your prep: Drain 2 peperoncini. Remove stems and finely chop. Transfer to a small bowl.Step 4Pick off leaves from 4 parsley sprigs and finely chop (discard stems). Add to bowl with peperoncini.Step 5Mix ¼ cup mayonnaise and ½ tsp. paprika in another small bowl.Step 6When timer goes off, remove eggs from boiling water with spider or slotted spoon and transfer to ice bath. Let cool 5 minutes.Step 7Peel eggs, slice in half lengthwise, then sprinkle yolks with salt. Transfer eggs to a plate.Step 8Top each egg with paprika mayo and peperoncini salsa.How would you rate Jammy Eggs with Paprika Aioli?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI agree (below): looks good. Jammy eggs (plain/straight; 7 minutes, exactly, at a boil; then into cold water) are a regular in this place; so are deviled eggs (but conventionally, with a little more prep: yolks out; mashed, with mayonnaise 'n' relish 'n' stuff, and all the rest). Tis  a good, in-between, maybe just a tad less hassle.  worth a try. Hell, who doesn't like deviled (or, jammy) eggs?  Only active communists.AnonymousMoskva6/19/2021Looks good....and this form of protein hit is the way I’m eating these days rather than full on plate.Sharon WrightMontreal4/1/2021Finally got around to trying this recipe and it did not disappoint! It was super easy to make and delicious! I subbed in Chicago-style hot giardiniera for the peperoncini and it worked super well! I will definitely be making this again. Becca P.Chicago, IL 12/13/2020love the idea of this recipe and will try it soon, but where is the aliloi? \ncoronaburgspain9/7/2020Great recipe. Soooo much better than your grandmother's run of the mill deviled eggs. Will definitely keep in the summertime bbq party menu rotation. Orange, CA6/10/2020I liked this. The yolk was perfectly jammy, and the sauce and condiments went together perfectly!AnonymousColumbia, SC1/11/2020I absolutely love this recipe. I've made it several times and it's one of my favorite things to serve as an appetizer. The boiling time + ice bath method haven't failed me yet in terms of achieving the perfect texture. Honestly, sometimes, if I don't want to go to the trouble of boiling eggs, I'll put the toppings on a fried egg or scrambled eggs and that's delicious too.Cecilia HandyAustin Texas12/20/2019Explore Bon AppétitEggQuickEasy5 Ingredients or FewerSnackStarterVegetarianNut-FreeGluten-FreeKetoEasterPassoverBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-22", "author": ["Condé Nast", "Lauren Schaefer"]}