{"id": "13ea2094e5e538542b4e42ff8a577e03", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/maenam", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Maenam Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverMaenamReinvented Thai cuisine (and cocktails) in KitsilanoFacebookPinterestTwitterEmailGrant HarderGO HERE: for elegant ingredient-driven Thai food that’s still rooted in tradition. Chef Angus An opened Maenam with his wife, Kate Auewattanakorn, almost a decade ago, and they’re still racking up awards. Simply put, they’ve rewritten the rules of what a Thai restaurant in Vancouver (and beyond) can be.ORDER THE: addictive grilled Thai sausage and crispy rice salad, tom ka coconut mushroom soup, and the eight-spice lingcod. Don’t forget two orders of the handmade roti with peanut sauce. Bonus: The bright and refreshing cocktails pair exceptionally well with the food.THE VIBE IS: sophisticated and adult. The contemporary pale-pink space with cork-topped tables is softly lit and encourages quiet conversation.PRACTICAL STUFF: Open every day, from 5 p.m. to 10 p.m.; and for lunch Tuesday to Saturday, noon to 2 p.m. Reservations are available, as is takeout.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEBeaucoupAn outstanding bakery worth the (slight) trek to KitsilanoPhnom PenhA boisterous Cambodian-Vietnamese institution in Chinatown that’s still going strongThe Ramen ButcherUmami heaven and house-made noodles in ChinatownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}