{"id": "13f650e61e30c1bca5c15c2d2f2d253a", "url": "https://www.bonappetit.com/story/amazon-prime-day-2021-cookware-splurges-day-2", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "23 Best Cookware Deals & Kitchen Gadgets To Shop During Amazon Prime Day 2021 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Cookware Splurges for Amazon Prime DayToday, the $$$ pans, appliances, and other kitchen essentials you’ve been coveting are on sale.By Lauren JosephJune 22, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There is a time and a place for a cheap thrill. Then there is a time to splash out. Today—on this, the exultant occasion of Amazon Prime Day 2021—is splash out time, baby. We’ve got the best cookware deals, from the Instant Pot you’re finally ready to spring for to the Le Creuset you’ve gazed at longingly, whispering “someday.” (And if you’re looking for deals on everyday kitchen essentials like fish spatulas and glass storage containers, we’ve got you covered too.) If you’re unfamiliar with how Amazon Prime Day works, here are the basics: Some items will be on sale all day today. Elusive Lightning Deals will pop up for six-hour periods and sell out quickly, so be sure to check back as we update this post with what is currently on sale. Without further ado, here are all the best cookware deals to shop today and tomorrow. All the good stuff, none of the fluff. Vitamix 5200 BlenderI’ve had my dear 5200 for 11 years (11!), and despite pulverizing a smoothie almost daily in it (plus many a tub of nut butter and hundreds of soups), it’s in great shape. This powerful, professional-grade blender very rarely goes on sale, but right now, it’s 49% off for Amazon Prime Day.Vitamix 5200 Blender Professional-Grade, Self-Cleaning 64 oz Container, Black - 001372$550 $379 at AmazonCalphalon Cookware SetSenior food editor Christina Chaey is partial to teeniest Calphalon stainless-steel pot; maximalists can go for this eight-piece set of normal-size pots. These boast even-heating tri-ply construction, can be popped in the dishwasher, and are compatible with that Duxtop induction burner you snagged on sale today. Calphalon 8-Piece Cookware Set$400 $280 at AmazonLe Creuset Square Skillet Grill PanNo outdoor space for a grill? The next best thing is this cast-iron grill pan from Le Creuset. Get it rip-roaring hot and toss on steaks, strips of summer squash, and anything else that could benefit from high heat.Le Creuset Grill Pan$170 at AmazonGreenPan Valencia ProOften, a bulky cookware set has tons of pieces you don’t need. This edited ceramic nonstick trio, 30% off for Amazon Prime Day, has just the essentials: a 2-quart saucepan, a 9.5-inch frying pan, and a 3-quart sauté pan, with a lid. Each pan has a PFOA-free ceramic coating and is oven and broiler safe up to 600°F. GreenPan Valencia Pro Set$100 at AmazonCalphalon Espresso MachineThe Temp IQ is all about the bells and whistles. Warm your espresso cup on the heating tray while you use the included conical burr grinder to get just the right coarseness of grind, then whip the perfect silky foam and pull a shot. This hefty, gorgeous thing rarely goes on sale—and right now, it’s 33% off. Calphalon Temp IQ Espresso Machine$680 at AmazonWeber Propane GrillWeber is pretty much synonymous with Good Grill for a reason. This dependable propane model heats up quickly, has reversible cast-iron grill grates (flip to the smaller side for small fiddly food like vegetables and shrimp), and is easy to assemble.Weber Propane Grill$569 at AmazonCuisinart Air FryerWe love crispy-gone-soggy, but sometimes we also just love crispy, crispy, crispy. Cue the air fryer. This mini convection oven, which is 37% off on Amazon Prime Day, whirs hot air around your potato wedges, whole chicken, or broccoli florets with gusto until that ASMR-level crunch is achieved.Cuisinart Air Fryer$200 $125 at AmazonKitchenAid Pasta Maker Attachment SetIf you say “I love you” through dough, behold the KitchenAid stand mixer pasta attachments. Included in the kit is a roller, a fettuccine cutter, and a spaghetti cutter.KitchenAid  3-Piece Pasta Maker Attachments$130 at AmazonSodaStreamThere is an alternative to filling your cart with jumbo packs of La Croix every time you stop in a grocery store. That’s the SodaStream, and it’s 42% off for Amazon Prime Day.SodaStream Fizzi$89 at AmazonVitamix Food CyclerIf worms in your compost sounds little hard-core for you, consider the nutrient-rich dust route. That’s what this powerful little food cycler from Vitamix makes with your food scraps. Mix the dehydrated vegetable-top dust with potting soil, and add to your budding herb garden.Vitamix FoodCycler$400 $280 at AmazonInstant PotThe 6-Quart Instant Pot Duo Plus does everything you need it to without any superfluous functions. It steams, sautés, cooks rice, sous vides, makes yogurt, and warms food, without any cake-baking capabilities, because you’re still baking those in the actual oven, right? The six-quart is the goldilocks size for most cooks: ideal for most four-portion recipes, with a little room to spare. Save 50% this Amazon Prime Day. Instant Pot Duo Plus, 6 Quart$120 $50 at AmazonCoravinThe fact that wine bottles are the size they are is a cruel, cruel thing for anyone who lives alone. Sometimes you just want a glass with dinner without the stress spiral about whether or not the wine will go off before you’re able to finish it. Enter the Coravin. Unlike the simple (and imperfect) physical barrier an average stopper provides, the Coravin replaces wine with argon gas as you pour, preventing what’s left from oxidizing. Coravin Wine Opener and Preserver$165 at AmazonAeroGardenLast year, every single one of your friends successfully sprouted their spring onion cuttings and stuck an old potato in a pot. This year, you can show up to the function with a caprese full of your own homegrown basil and tomatoes. The hydroponic LED-lit AeroGarden grows herbs, salad greens, and vegetables up to five times faster than a soil garden does, and it comes with a starter seed kit to get you going.AeroGarden$170 at AmazonMisen Chef’s KnifeIf you haven’t yet found your perfect chef’s knife, the one that feels like an extension of your hand and that you take with you to Airbnbs, consider the Misen. The brand’s knives are already a great value, but today and tomorrow, take an additional 20% off.Misen Chef's Knife$75 at AmazonBreville Joule Sous VideIMHO, a sous vide is the ideal to getting a medium-rare steak done on a cast-iron skillet without setting off the fire alarm. Stick that steak in a vacuum bag (or one of these Stashers, also on sale!) alongside some aromatics, and go about your business as the inside is cooked to ideal pinkness. A quick finishing sear in the pan and you’re done. No fire department visits required. Breville Joule Sous Vide Machine$250 $160 at AmazonGooseneck KettleCan you even call yourself a coffee person if you don’t methodically douse your French press grounds in tidy little concentric circles of 195°F water? The gooseneck kettle provides the temperature and pouring precision you need for an exacting morning brew.Stainless-Steel Gooseneck Electric Kettle$60 at AmazonCrockPotA slow cooker might very well be the clog of your cookware collection. She isn’t glamorous, but she sure is a dependable, cozy fallback. Invest in one now and you’ll be all set once soup season rolls back around.CrockPot Slow Cooker$100 $70 at AmazoniRobot Roomba i4Food crumbs are no match for the industrious little iRobot Roomba vacuum. Plus, you can tell your roommates you tidied up without even getting up. iRobot Roomba i4$650 $400 at AmazonCalphalon Toaster OvenA good toaster oven can do anything a real oven can. An entire 12-inch pizza can fit nicely inside this particularly even-heating toaster oven, which has convection, broiling, and, of course, toasting capabilities. Save 35% this Amazon Prime Day.Calphalon Toaster Oven$350 at AmazonKitchen MatThere is absolutely no reason your home kitchen shouldn’t be as cushy a professional one—at least underfoot. Save $20 on this plush mat during Prime Day and give your back a little break while you bake, or keep it next to the sink to make dish duty a little more tempting. Sky Solutions Anti-Fatigue Mat$100 $92 at AmazonSpicewalla Spice SetDigital editorial director Amanda Shapiro relies on a similar kit from Meherwan Irani’s Spicewalla; you very well could too. Or, you could replace the spices in your parents’ home with use-by dates that correspond to your birth year…or both! Spicewalla Middle Eastern Spices Set$55 $44 at AmazonGE Profile Opal Nugget Ice MakerA $550 ice maker is absurd. A $450 ice maker? I’m listening…. Yes, this ice machine is still quite the splurge, but it makes “the good ice,” that crunchy, chewable, airy ice that people go nuts for. If you’re going to make one totally-unnecessary-but-totally-worth-it purchase this Amazon Prime Day, let it be this.GE Profile Opal Nugget Ice Maker$529 $499 at AmazonFoodSaver Vacuum SealerPreserve those chicken cutlets better, longer by vacuum sealing them into a shrink-wrapped airless coffin. Anyone who buys in bulk needs one of these, as does anyone who sous vides: Plop a pouch into a pot with your sous vide machine (also on sale) and dinner is done.FoodSaver Vacuum Sealer$154 $125 at AmazonExplore Bon AppétitAmazon Prime DayShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-21", "author": ["Condé Nast", "Lauren Joseph"]}