{"id": "13ff6c47bf873956bdde05f28b3a9e66", "url": "https://www.bonappetit.com/story/cheesecake-factory-brown-bread-grocery-stores", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "The Cheesecake Factory’s Famous Brown Bread to Be Sold in Grocery Stores | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Cheesecake Factory’s Famous Brown Bread to Be Sold in Grocery StoresThe best part of the meal.By Melissa MintonJanuary 22, 2018FacebookTwitterEmailThe Cheesecake FactoryFacebookTwitterEmailIf you’ve ever dined at The Cheesecake Factory—and what a pity if you have not—you know that the chain is famous for many things. There’s the menu, so thick and full of options you might never get past the appetizer selections before your meal arrives. Or the decor, complete with Egyptian columns, wood paneling, and textured walls, which both surprises and delights with its miss-matched opulent styles. Not to mention the food, so great in its portions and caloric in its ingredients, and yet delightfully consistent. Don’t even get us started on the star of the show: the cheesecake itself. But the underdog of the whole meal, the Cheesecake Factory’s Famous Brown Bread, is finally getting its day in the spotlight.According to Food & Wine magazine, the rolls will now be available in the Factory’s online store and in grocery stores. Lest anyone think that the Factory does not provide for its loyal fans, three versions of brown bread will be available: heat-and-serve dinner rolls and mini-baguettes, as well as pre-cut sandwich loaves. But the best part of being able to purchase packaged Cheesecake bread? Learning the mysterious ingredients, which reportedly include cream cheese, semi-sweet chocolate chips, and powdered sugar.The Factory also already sells box mixes of baked goods,  like brownies, cookies, and cakes, but unfortunately, the secret recipe to its classic cheesecake remains an enigma. For now, we’ll just fill our stomachs with at-home brown bread.The Cheesecake FactoryThe Cheesecake FactoryThe Cheesecake FactoryRelated: Cheesecake Factory Adds Funfetti Cake to MenuExplore Bon AppétitCheesecakeBreadTrendsRead MorecultureThe Cheesecake Factory Combines a Pumpkin and Pecan Pie In One Glorious CheesecakeBy Julia BlackLifestyleShould American Health Care Be More Like The Cheesecake Factory?By Sam DeanrestaurantsCheesecake Factory Comes To New York, We Get An Early Taste of GreatnessBy Michelle CollinsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-22", "author": ["Condé Nast", "Melissa Minton"]}