{"id": "140763b075f2e3d551a71304ea8ec883", "url": "https://www.bonappetit.com/story/cooking-with-fish-sauce", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "How to Use Fish Sauce to Add a Savory, Umami Complexity to Your Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThere Are Millions of Ways to Use Fish Sauce, Which is Great Because It Never Goes BadBring on that umami razzle-dazzle. By Alex BeggsMarch 25, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.FISH SAUCE, I LOVE YOU SO MUCH. I can't imagine a world without you in it. My heart pangs at the thought of Thanksgiving without nuoc cham roasted carrots. The biggest misconception about fish sauce is that it’s “fishy.” And sure, it might smell fishy—hell yeah, it’s MADE OF FISH—but in cooking, it functions more like salt, and brings a deeper, savory, umami punch to whatever it’s splashed into.And yet what even is this stinky beautiful liquid? How does it do the things it does? And how can you use it to its full potential?This condiment is thousands of years old. In ancient Rome they called it garum. The nerdy-charming Harold McGee notes in On Food and Cooking that the historian Pliny defined garum as “liquor from putrefaction,” which sounds delicious, no? Second to perfume, McGee tells us, garum was one of the most valuable liquids around. I'd argue it still is!More on putrefaction below:Wait, what is fish sauce?It’s a fermented condiment typically made from anchovies that’s glorious umami razzle-dazzle in a bottle. While nuoc mam (Vietnamese fish sauce) and nam pla (Thai fish sauce) are among the most widely available types of fish sauce in the U.S., it exists in slightly varying styles all over the world: ngan-pya-ye (Burmese), tuk trey (Cambodian), budu (Malaysian), patis (Filipino), colatura di alici (Italian), shottsuru (Japanese), aekjeot (Korean).But how’s it made?Simply put, fish (anchovies are the most commonly used, but some brands contain trace amounts of by-catch like squid and other small swimmers) are combined with salt and aged in barrels for six months to a year (or longer). The salt draws out the moisture and preserves the anchovies so they can ferment for long periods of time without spoiling, during which microbes grow on the fish, deepening the sauce's flavor. The liquid is strained and sun-dried, then aged a month or so more in ceramic urns or plastic barrels before bottling.Fish sauce as a school of, errrm, fish.\nWhat should I look for when I’m buying it?The good stuff has just two ingredients: fish and salt. Some brands add sugar for balance, which isn’t the end of the world, but anything else is suspect (e.g., preservatives). Red Boat, our favorite Vietnamese fish sauce, has a deep, not-too-salty flavor.Red Boat 40°N Fish Sauce$10 at Sur La TableAnd how do I store it?It stays good for several years, though it may darken and concentrate in flavor over time. If your kitchen gets hot, or if you don’t use fish sauce often, keep it in the refrigerator.You can bet there's fish sauce in this Thai celery salad.\nZach DeSartOnce I have it, how should I use it?A little goes a long way—sprinkle a few drops anywhere you want a bit of extra-savory funk. Try it in...VinaigrettesPasta sauces where you’d use anchovies, like marinaraBraised meatsMarinadesSoupsStir-friesYogurt dips...or start with nuoc cham! This quick and potent Vietnamese staple sauce pairs with any protein, salads, or roasted vegetables. Whisk 2 Tbsp. fresh lime juice, 2 Tbsp. fish sauce, 1⁄2 tsp. sugar, and 1 Tbsp. water in a small bowl until sugar is dissolved. Mix in 1 finely chopped small garlic clove and 1 Tbsp. finely chopped cilantro.Ready for a recipe?Weeknight Pad ThaiBecause your takeout habit is getting to be a bit much, tbh.View RecipeExplore Bon AppétitFish SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-25", "author": ["Condé Nast", "Alex Beggs"]}