{"id": "141cb6a970003d87de02b181436a3885", "url": "https://www.bonappetit.com/story/apotheke-charcoal-candle-restaurant-bathroom", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "I Fell in Love With Apotheke's Charcoal Candle in a Restaurant Bathroom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Bought This Restaurant’s Bathroom Candle—While I Was in Their BathroomSometimes you just know.By Kendra VaculinMarch 18, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I spot interesting items out in the world, I have very little chill. I’ve startled countless unsuspecting women on the street by loudly blurting out, “Wow great earrings!!!” My camera roll is full of not-so-subtle photographs of in situ ceramic bowls and home goods and pairs of boots currently being worn by real live people (yes, they absolutely notice when I take the shot). And I have been known, on occasion, to beg a bank teller or cashier to tell me the name of their nail polish.So, it is entirely in keeping with my whole deal that the candle currently burning in my bathroom is one that I first encountered in the bathroom at Olmsted, a restaurant in Prospect Heights, Brooklyn.Olmsted is warm and casual, with a leafy backyard that echoes the lush plant wall inside. The restaurant’s concept is constantly evolving, and not just with the seasons: Throughout the pandemic, it’s been a fried chicken spot, a take-out hub, and a tasting menu establishment. I find myself returning multiple times a year, roping in different friends to fill out a four-top table. To my delight, among all of the culinary revisions and surprises, the Apotheke Charcoal candle in the bathroom has remained a constant.Apotheke Charcoal Candle$42 at Amazon$42 at NordstromHere is the thing about the Apotheke charcoal candle: Even if it smelled like garbage (which it doesn’t!), I would consider buying it just for The Vibes. The wax itself is black, poured into a matte black vessel with Apotheke printed in all caps, small and simple, in white near the base. It’s an unassuming candle, built to blend in with its surroundings rather than draw any extra attention. I was never a big candle gal—content to receive one as a gift every so often rather than purchase any for myself—but that shifted on my very first trip to Olmsted in 2016. In the restaurant’s single occupancy bathroom, I upset everyone in line by standing inside for far too long, inhaling deeply and ordering the candle on my phone.If I was going to have a candle in my apartment on purpose, I thought, it should be like this one: chic but understated in appearance, not too intense but definitely expensive smelling. It struck me that I didn’t need to settle for something like this magical candle, I could buy this exact model. So I did, and have again a few times since as each old wick burns down to the glass base.Especially in small, enclosed spaces like bathrooms, scented candles are liable to overwhelm. With other brands, I’ve found that lighting a candle when I take a shower can sometimes mean emerging from the water into a room so thickly fragrant it’s as if I could part the scent with my hands. But Apotheke’s Charcoal manages to stay present but light, floating on the air rather than making it feel heavy. The fragrance is deep and woodsy, with amber and leather notes that are at once soothing and powerful. If I close my eyes, my bathroom is a dimly lit spa, or a sparsely stocked boutique in which I cannot afford a single item. It transforms the space, turning the dial up on the put-togetherness of it all. Lighting this candle for company and letting its smell waft gently down the hallway makes me feel like the type of lady I’ll never be: the one who already has the cool earrings, not the one screeching at a stranger to ask where she got them. Thanks to Olmsted—my local dealer of New American small plates and, apparently, good taste—candles are one area where I feel like I’m in the know.Explore Bon AppétitRestaurantsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-18", "author": ["Condé Nast", "Kendra Vaculin"]}