{"id": "142edf8004800b5f91a2a073f9714f7f", "url": "https://www.bonappetit.com/story/how-to-compost", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "How to Compost Even If You Live in an Apartment with Zero Outdoor Space | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Stop Making Excuses and Start Composting AlreadyTiny kitchen? No backyard? Fear of smells? We got you.By Aliza AbarbanelDecember 4, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailIn It’s Getting Hot in Here, Healthyish assistant editor (and aspiring low-waste disciple) Aliza Abarbanel walks us through one thing we can do each month to adapt our lifestyles and pantries for a pre-apocalyptic world. Up next: Figuring out how to compost, no matter what your yard situation is like.The allure of composting is simple: Give your garbage new life. It’s an easy sell for those of us who stay up too late worrying about the not-so-slow sprawl of landfills. But, for others, it’s hard to ignore the inconvenience of sorting your trash and finding a place to collect those food scraps before they get wayyy too smelly. If you’re in the latter camp, think about it this way: As opposed to giving up air travel or going totally vegan, composting is an easy, cheap, and efficient way to lower your environmental footprint as an individual. But when it actually comes down to getting started, well, that’s a harder sell.I get it. “Figure out how to compost in the apartment” languished on my to-do list for years, even though I grew up with a backyard compost bin (and I love crossing things off lists). Online research left me overwhelmed, and I didn’t think my actions would make much of a difference anyway. But when I started tracking my trash earlier this year, I realized that more than half of my garbage could be going in a compost bin. Also I had recently moved to an apartment building with a designated organics bin, which made it a lot harder to tell myself I didn’t have time to make the switch.As soon as I decided to give composting a shot, I realized I had a lot of questions: Wait, can this avocado pit go in the bin? What about leftover fish bones? Is my apartment about to be invaded by fruit flies? What do I do after the bin is full?So I turned to my friends, my veteran-composter parents, municipal services, and the internet for answers. I realized that the more people use composting services, the more accessible they become, and for many of us, now is a great time to get started.The Problem:Organics make up the largest portion of our trash cans: 30 percent, to be exact. In a landfill, this trapped organic material releases methane, a potent greenhouse gas contributing to global warming. Plus exporting residential trash to landfills costs cities millions of dollars a year. Composting can’t do anything to shrink what’s already in the landfill, but it can stem the flow of more trash while limiting the distance our waste travels, creating fertile soil, and even making renewable energy.The Challenge:Composting doesn’t take a lot of work, but it does takes more thought than tossing everything in the trash. Luckily, any lifestyle shift goes a bit easier with a bit of advanced planning. The hardest part is getting started, so this month we’re going to set up our kitchens for composting success.Step 1: Find your compost siteIf you’re blessed with a yard, you can set up a composting bin in your backyard and use the broken-down waste to help fertilize your garden. Also, can I come over? If you live in an apartment or just don’t want to deal with undertaking the whole process on your own, it’s time to search for an organics collection site.Some cities have their own compost collection program and provide bins specifically to collect organic materials. You’d probably spot these next to your regular trash and recycling bins. If you don’t have an organics bin, check with your municipal waste department to see if there is a program in place (and bug them if there isn’t).For those of us without regular organics collection, farmers’ markets, community compost programs, and urban gardens often provide services to collect food scraps from the neighborhood. In NYC, the Union Square Greenmarket compost pile is so eye catching, I’ve heard double-decker bus drivers point it out to camera-clutching tourists. I’m talking towers of cast-off carrot tops and beet greens, mixed with banana peels and coffee grounds delivered from apartment bins by people on their way to the subway.If you don’t live in a metropolitan area or have the ability to start your own backyard bin, you can organize your own community compost program. Ask a neighbor with a garden, local schools, nearby farms, or even landscaping shops if they’d like to start a community site, and check out national community composting coalitions for resources on getting started.Step 2: Find your containerYou can use just about anything to collect compost, from gallon Mason jars to empty yogurt tubs. These homemade options are best kept in the fridge or freezer to cut down on any, um, funky smells. If you’re looking to invest in a countertop container, you’ve got plenty of chic options. Look for something with a carbon filter to neutralize odor that can accommodate about a gallon of compost. (I get a disproportionate amount of joy out of my minimalist Bamboozle bin, which has a handle for easy toting around the kitchen and down to the collection bin.)Once you have a compost bin, you may want to consider liners. “Biodegradable trash bags” made from potato starch and other organic materials are a popular choice for lining containers and storing overflow compost between drops, but be aware that smaller, non-industrial composting facilities aren’t actually able to process these. (More on that below.) And while they’re better for the planet than plastic trash bags, these bags still require fabrication and transportation. So when I remember, I line my bin with shredded newspaper to soak up coffee grounds and other liquids. When I forget, which is most of the time, I just give my bin a quick scrub after dumping and all is well.Step 3: Get to itBefore you start dumping everything in your bin, make a list of accepted materials and post it somewhere visible to cut down on the number of Google searches you’ll inevitably have to do. What goes in depends on the scale of your composting facility: Smaller collection sites often reject oily food scraps and bones to avoid attracting pests as well as “biodegradable” plastic alternatives like bags and utensils, because they’re unable to generate the level of heat needed to break down these processed materials. These rules also apply if you’re using a backyard bin.Municipal facilities are usually able to handle just about any organic material, from bones to greasy leftovers. If you aren’t sure if something is compostable, don’t be afraid to ask your site or use an online resource. (When I got started, I called the Lower East Side Ecology Center’s compost hotline four times in one week.)Why It Works:We’ve already discussed compost’s potential to shrink landfills over time and minimize the distance your waste travels, but the end product is perhaps even more precious. Farmers sometimes call compost “black gold” because it enriches soil by strengthening plant roots, attracting earthworms, and preventing erosion. Compost also has a future in renewable energy as states across the country are using anaerobic digestion facilities to convert our leftovers and yard waste into potent biogas, which is then refined and processed into truck fuel, electricity, or natural gas. The Environmental and Energy Study Institute estimates that tapping all the potential biogas in the U.S. would eliminate enough methane emissions to equal the annual emissions of anywhere from 800,000 to 11 million passenger vehicles.In addition to these clear public benefits, integrating composting into my daily life has made me feel more connected to our food systems. I see food scraps as a community resource, not wasted potential. After all, even the best low waste intentions can’t beat the fact that life happens. Leftovers go uneaten, bread gets moldy, and not everyone wants to eat carrot top pesto. There’s no point in feeling overwhelmingly guilty about any of this, because consumption is an inherent part of life. But with composting, I know some of my waste is making new life.Explore Bon AppétitIt's Getting Hot in HereHealthyishessayRead MoreLifestyleWant to Reduce Your Waste? Do This First. By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-04", "author": ["Condé Nast", "Aliza Abarbanel"]}