{"id": "1433faccafb4e80dc9e514503fb11ff5", "url": "https://www.bonappetit.com/story/what-is-sous-vide-cooking", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "What Is Sous Vide, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSo, What Is Sous Vide, Anyway?You've heard sous vide mentioned before, in fancy restaurants and on competition cooking shows. But more and more people are doing it at home–and you should, too.By Alex DelanyJanuary 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSous vide. It sounds more intense than it is. The name conjures thoughts of scientists, draped in white lab coats or disgraced cooking competition show contestants, cowering in front of disappointed judges. Is it science-y? Sure it is. And do professional chefs use them for impressive, perfectly-cooked proteins? Yup. But what is sous vide, really?At its most fundamental level, sous vide cooking is the process of sealing food in an airtight container—usually a vacuum sealed bag—and then cooking that food in temperature-controlled water. In French, the term translates to \"under vacuum,\" which makes sense. Chefs vacuum seal a protein with marinade, sauce, herbs, or spices and drop it in a large pot of water. There’s no contact with a heated metal surface. No contact with flames or steam or smoke. The water never comes to a boil. Yeah, it's pretty low-key.A sous vide machine uses a heated metal coil to warm water to a constant temperature, never fluctuating to high or low extremes. This means that the cooking progress is gradual and controlled. Proteins like steak, pork, chicken, and fish cook for elongated periods of time, slowly heating up until the entire piece of protein reaches the temperature of the water. Since the water never goes past the desired temperature of doneness, the meat takes significantly longer to cook (A 12 oz. NY strip takes a little over two hours), but it also means that you’ll never have an overcooked piece of protein.Vacuum-sealed and ready to sous vide.\nPhoto by Alex Lau, Food Styling by Anna BillingskogWhen that same steak is cooked on the stove, high, direct heat is applied to the meat to bring the internal temperature up to 135°. While that's happening, you can't see what's actually going on inside, which means you either have to guess, cut it open (which ruins the whole presentation), or poke it anxiously with a meat thermometer. With sous vide, there's no guess work. If you put a steak in a bath set at 140°, there's no chance that steak will go past that temperature. The steak is cooked to a perfect medium-rare throughout, and that's thanks to the sous vide's secondary function, water circulation. Constantly moving water ensures that there are no hot or cool spots in your pot. It’s an insurance policy, like some kind of perfectly-heated, dinner-making jacuzzi.The only hands-on part of the ordeal happens after the food is removed from the bag. Since the sous vide process removes actual contact with a surface from the equation, the meat won’t be crispy, caramelized, or charred in any way. When cooking proteins like pork or steak (which will look pretty gray after a sous vide bath), that exterior texture is key. The solution? An extremely quick sear after the meat has been cooked through. Searing steak or pork in a ripping-hot cast iron skillet for about a minute on each side (including the smaller sides) will develop some caramelization without cooking the interior any further.Sous vide strip steak after a quick sear.\nPhoto by Alex Lau, Food Styling by Anna BillingskogAnd this is the reason why restaurants love sous vide cooking. Being able to cook thick ribeye steaks to a perfect medium-rare before dinner service starts is a huge help. While a chef would normally spend about an hour cooking a ribeye from start to finish (letting it come to temperature, cooking it in a skillet, letting it rest, slicing it, and plating it), the sous vide method shaves off time by allowing the chef to unwrap the steak and quickly sear, slice, and serve, all while guaranteeing the right interior doneness.Sous vide used to be a method employed solely by restaurants, using extremely expensive, large machines to cook in large quantities. But that was then, and this is now. We're living in the golden age of at-home sous vide cooking, with small, affordable, powerful sous vide machines like the Joule warming the waters for home cooks for around $100 dollars a pop. In fact, some would say sous vide is more efficient at home than in a professional kitchen, feeding hundreds of people. But before you run out to buy one (or, let’s be honest, click three times on your laptop), let's talk about why you should.Having pre-cooked, vacuum-sealed proteins at your disposal makes dinner a hell of a lot easier. Maybe you're hosting a dinner party and don't have the time to dedicate to 12 pork chops. Sous vide them before hand, and sear them up right before dinner is served (this cuts down on smoke too.). But what if it's just you? Still worth it?You can have sous vide cooked chicken stashed in your freezer, ready for dinner any night of the week—we dressed ours up with pesto. Get the recipe here.\nPhoto by Alex Lau, Food Styling by Anna BillingskogSous vide is supremely useful in meal prep situations for lazy weeknight dinners. Since your protein is sealed (assuming you used a vacuum sealer, like our personal favorite) and cooked through, it will last in the fridge for at least a week. Once your meat comes to room temperature, you’re a quick-sear away from an impressive Wednesday night dinner. Less of a mess. Less time spent standing over a stove. Less stress, in general. If you have a problem with that, well, we can’t really help you.Sous vide also protects and improves your purchases. The sous vide process guarantees that you won’t overcook a piece of meat. That’s huge, especially when you’ve spent a solid chunk of change on an impressive cut. But it also allows the cheaper cuts to become tender. Steaks with a traditionally tough reputation, like a tri-tip or chuck, do wonderfully in the sous vide. When you cook them using a traditional method, the muscle fibers contract rapidly, forcing out the moisture inside of the meat. With sous vide, those same fibers contract slowly, allowing the juice to stay inside of the meat. This gives you a tri-tip that eats more like a steak three times its price.And while we obviously love a sous vide machine for proteins, there's more to explore. Chefs love sous vide eggs, for perfectly-set whites and runny yolks. Potatoes cook especially well (sous vide potato salad is amazing), and tender vegetables like asparagus are easily cooked for salads or sides. The sous vide doesn't discriminate.Trying new stuff is stressful. We get it. If you think that the whole sous vide process still sounds intimidating, we're here for you. We've developed 4 easy recipes to get you started, an A+ equipment list to get you started. When you finally make it onto Top Chef, you won't be the one who messes up the sous vide steak. Promise.Photo by Alex Lau, Food Styling by Anna BillingskogYour Sous Vide EssentialsSee how to sous vide anything with step-by-step photos hereRead about how sous vide cooking will overhaul your meal prep gamePick up the BA Test Kitchen's favorite sous vide machineGet the RecipesSous Vide Strip SteakSous Vide Pesto ChickenSous Vide Sweet and Spicy Pork BellySous Vide Salmon with Lemon and DillExplore Bon AppétitSous VideToolsRead MorecultureThe Joule Is the Best Sous Vide Machine We’ve Ever UsedBy Brad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Alex Delany"]}