{"id": "1447631d48b2aa8012b3f6648bd39858", "url": "https://www.bonappetit.com/story/ghee-lip-balm", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Ghlee, the Ghee-Based Balm, Is Literally Butter For My Lips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Ghee-Based Balm Is Literally Butter for My LipsWinter is rough, but at least my lips are smooth.By Sonia ChopraNovember 12, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Turmeric. Yogurt. Honey. Coconut oil. Gram flour. I’m no stranger to products from my kitchen making their way into my face masks (like this turmeric and cranberry seed one from Kiehl’s or this DIY recipe with rosewater and honey). But though I cook with ghee often, I’d never incorporated it into my skin care routine—until I started using Ghlee.These lip balms come in sleek black and gold packaging, smell light and fresh, and, most importantly, they work: The moisturizing ghee protects my lips from the winter elements. They come in rose, chai, peppermint, and mango scents (the rose is my favorite), and I always keep a few around—one in my bag, one at my desk, one by my nightstand. I’ve gifted them to people on all sorts of occasions: bridal showers, birthdays, the end of a round of chemo. And I kept holding them up in Zoom meetings to show them off to my coworkers...which, yes, is how this story even came about.Cofounders and siblings Arati and Varun Sharma grew up hearing their mother tell them to put ghee on their chapped lips. A few decades later they started to notice shea butter and coconut oil appearing in all kinds of skin care products in the U.S. “It kind of clicked to me,” Varun, a self-described lifelong entrepreneur, tells me. “Why isn’t our fat used in skin care in the general market?” He ordered ingredients such as vitamin E oil, coconut oil, and, of course, ghee and spent about five months in a lab experimenting with lip balm formulas before creating one he was happy with, launching Ghlee with Arati in late 2019. The team makes their own ghee, buying butter in bulk, cooking it down, and filtering it multiple times. Currently, they’re working on more products, including an unscented balm and a much-requested universal balm that can be used on lips, cuticles, and even as a makeup highlighter.“One of the things that was starting to be frustrating was how much folks have been appropriating not just South Asian culture, but a lot of different cultures, in the wellness community—especially in the small-business market,” says Arati, who spent eight years at Shopify and working with e-commerce brands of all sizes. She notes the importance of South Asians founding and leading businesses that feature South Asian products. “This comes from not just our culture but our family, so why not share it through our lens?”Photo by Isa ZapataGhlee Lip Balm$15 at GhleeExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-12", "author": ["Condé Nast", "Sonia Chopra"]}