{"id": "145203832a857e67681180261ddbba75", "url": "https://www.bonappetit.com/story/joy-toolbox", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "Winter Self-Care: These 5 Things in My “Joy Toolbox” Are Getting Me Through Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese 5 Things in My “Joy Toolbox” Are Getting Me Through WinterWe could all use a stash of activities and exercises to feel a bit better, especially this winter. By Martine ThompsonDecember 22, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Here We Are, artist Martine Thompson explores what it means to care for oneself in a world that doesn’t make it so easy. Up next, a guide to building a joy toolbox to give yourself a midwinter boost. Read on, but don’t forget to check out her winter playlist too.This was one long, hellish year with some highs, yes, but also some very painful lows. I don’t consider myself religious, but truly there were some moments when I had to just stop, lie down, play Marvin Sapp’s “Never Would’ve Made It,” and just breathe. There’s been a lot to process: the 2020 election season; an unprecedented worldwide pandemic; George Floyd’s murder and the global centuries-long abuse of Black people igniting uprisings across the nation, followed by the countless performative gestures that dodged any real heavy lifting and postured as meaningful solidarity. Like I said, it’s been a looong year.Winter is around the corner and with heightened feelings of meh accompanying the seasonal change, I’ve been thinking about joy toolboxes and how helpful it is to have a go-to stock of activities and practices that make you feel good. There are so many heartaches, tragedies, and fucked-up normalities that can unexpectedly knock the wind out of us. So many plot twists in life that nudge us to reevaluate and reimagine what we understand as self-care. While there’s obviously no one-size-fits-all quick fix for tough times or feeling blue, and the short-lived thrill of buying something that comes and goes, I do think it’s worthwhile to find ways to add more joy and tranquility into the day-to-day. From soothing lighting that puts me in my zone to perspective shifts that have helped me embrace the fluidity of life more, here are five things in my wellness toolbox that may inspire your own.Go on a new food adventureWith the food industry still in dire need of support and the same monotonous routine filling many of our quarantine days, now is an especially good time to treat ourselves to takeout from that restaurant or cool new pop-up bookmarked on our Instagrams. You know, the one that evoked an “I’ve gotta try that!” as soon as it crossed your feed. This was exactly the case when I came across Jamaican chef, model, creative technopreneur, and multimedia storyteller Jazzy Harvey serving a revolving menu of Jamaican fusion takeout in Los Angeles’s Crenshaw District. The Anjahles Jamaican x LA Fusion founder and head chef’s current menu offers a remixed selection of Caribbean classics: oxtail mac ’n’ cheese, vegan jerk gumbo, candied “dark and lovely” plantain.Beyond a highly Instagrammable good meal, it feels great to support a small business that prioritizes community and is intentional about giving back, like bringing music and 300-plus free meals to Leimert Park alongside chef Hugh Augustine, chef Marcus Yaw, chef James B, and DJ Coly Cole for a Community Friendsgiving last month. Regardless of where you live, take this winter as an opportunity to make a mini mission around intentionally supporting food businesses, and if you’re around the Crenshaw neighborhood or L.A. County, add Anjahles to your list (and stay tuned for its upcoming pop-ups around the city and holiday catering menu).Commit to making your space a happy placeMaking your space feel like a cozy slice of paradise goes a long way toward combating winter blues. For me, that looks like regularly having fresh flowers around the house, treating myself to fun glassware that gets me daydreaming about post-quarantine get-togethers, and always having candles on deck. Whether I’m relaxing or working, being in a setting with dim lighting coming only from the glow of candles sets the perfect mood. My current favorites are the coconut shell soy candles from Isle of Wax, a candle line launched by Saint Lucia native Danielle Privat to celebrate smells of the Caribbean that I discovered on @blackownedeverything, an Instagram highlighting Black-owned businesses created by stylist Zerina Akers. The Saint Lucia candle filled my room with the most amazing fruity-meets-fresh-laundry smell before even being lit. Opening my package—filled with a flurry of sweet scents, vibrant blue stuffing, and a thoughtful handwritten note—felt like Christmas.Have your therapy/wellness resources up-to-dateFinding a new therapist—or other wellness support—can be such a daunting experience, and if you’re seeking a care provider who shares certain identity intersections with you, like also being a Black woman and/or trans, multiply that by 1,000. I find it super helpful to have a few go-to directories in the toolbox to make the search less of a headache when the need arises. Here are some resources to start with: Queer Healers, whose directory of queer practitioners include herbalists, tarot readers, astrologists, sex therapists, birth/abortion/death doulas, and more. Therapy for Black Girls focuses on connecting Black women with local Black women therapists, and also offers a wellness blog and a mental health podcast led by psychologist, speaker, and founder Dr. Joy Harden Bradford. Black Female Therapists offers a directory of Black women therapists, including a listing of the type of care they specialize in (e.g., anxiety, depression, body image, LGBTQIA+ identity), a podcast, and a mental health blog. You can also check out six other mental health resources offering virtual support to Black people—and I’m adding Lauryn Hill’s live album Lauryn Hill Unplugged No. 2.0 because no one can tell me listening to it in the car doesn’t have special healing properties.Try a new type of weed (if you’re into that)In hindsight, chilling in bed on my phone after trying Canndescent’s “charge” joint feels like a missed opportunity considering how much of an enjoyable body/mind high it provided. Maybe I should’ve had a station ready with snacks, coloring books, art activities, and tender/funny videos? My thoughts once the high started to wane were basically, Wow, well, I guess I’m going to have to be a grown-up and start investing in quality weed now. It was easily the best high I’ve experienced from a pre-rolled joint. Canndescent offers (limited-edition) holiday joints too! If you’re looking to broaden your weed toolbox, consider trying out Papa & Barkley’s THC body oil for pain and tension relief. And if exploring vaginal cannabis products is of interest, Quim’s everyday CBD (or THC) oil can be used for everything from menstruation relief to post-shower TLC.Embrace optimism and uncertainty as an act of wellnessLately, I’ve been opening up more to the idea that positive occurrences and opportunities, as well as the roads leading to them, may not manifest in the way I envisioned in my head—and maybe that’s okay. I’ve also decided to give leaning into positive what-ifs a go. What if this isn’t working out because I’m being redirected to something that’s more aligned with who I am and what I want? What if there’s no need to chase or frantically grasp and that certain roadblocks are blessings in disguise? What if the right things, the right people, and all of the good shit will flow into your life, and the task isn’t to chase or mourn or be swallowed up by shame, but rather to learn, explore, heal, and evolve into the best most you version of yourself? What if “all of the good shit” looks nothing like you ever imagined? What if it’s going to be okay, even if it doesn’t feel like it, even if you can’t see or feel that light at the end of the tunnel right now? If you believed that, what would you do next? That’s the space I’ve been exploring lately, and it’s a refreshing change of pace.Explore Bon AppétitHere We AreHealthyishSelf CareessayRead MoreLifestyleRapper Hugh Augustine’s Vegan Food Is a Love Letter to His L.A. CommunityBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-22", "author": ["Condé Nast", "Martine Thompson"]}