{"id": "145e5290c50a2de2473661dbc90ecf97", "url": "https://www.bonappetit.com/story/lee-initiative-mentorship-program", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "In Kentucky, Where the Future Really is Female | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn Kentucky, Where the Future Really is FemaleA new program created in response to #MeToo aims to foster the next generation of culinary leaders.By Elyse InamineOctober 17, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmail“Hot, behind!” Jen Rock yells. She’s carrying a very large pot of tomato gravy. The warning goes up like an emergency flare to her fellow chefs crammed in one of New York City’s most hallowed (and most claustrophobic) kitchens: the James Beard House.The chefs squish closer to their stations to give Rock room. “This calms me down,” she says to me as she wipes tomato gravy puddles from the countertop. “Close proximity, I’m used to. The stressful part was making sure that everyone got here.”That’s because tonight is the graduation ceremony for Rock and the group of sous-chefs, high school culinary teachers, and chef de cuisines gathered together in this kitchen. Just the day before, they all drove up from Kentucky in small sedans packed with boxes of prepped ingredients for the climactic moment ending their time as the first round of mentees under the LEE Initiative.Rock's take on pork and beans for the James Beard House dinner\nDavid Chow / Courtesy of the James Beard Foundation“How do you respond to the #MeToo movement in a way that’s more than a reactionary thing?” Edward Lee poses to me over the phone, about a week before the dinner.After news of sexual harassment allegations against Mario Batali, John Besh, and Ken Friedman about a year ago, Lee, the chef behind 610 Magnolia in Louisville, and 610’s general manager, Lindsey Ofcacek, reflected on their own experiences working in restaurants. “I have been in the industry my whole life, and I’ve always believed there is more good than bad,” Lee says. Part of that good, he recognized, were the female chefs leading beyond the kitchen.Their conversations led to the formation of the LEE Initiative, a week-long mentorship program that pairs five Kentucky-based cooks with a respected chef from restaurants around the country. The goal is to give rising local talents a chance to shadow a mentor and gain exposure to the industry from multiple angles—from meetings with accountants to social media management to the leadership skills necessary to run a kitchen. Funds raised from sponsors (Maker’s Mark) and private donors (including Lee) go toward paying for each mentee’s time off from work. This year’s applicant pool reached to 200 candidates. The winning five were paired with mentors Anne Quatrano of Star Provisions in Atlanta, Katie Button of Cúrate in Asheville, Brooke Williamson of Hudson House in Redondo Beach, Sarah Grueneberg of Monteverde Restaurant & Pastificio in Chicago, and Jenn Louis of now-closed Ray in Portland, Oregon.“We wanted to do something smaller and quieter but something we thought could last for years and create change,” Lee says. “It was really Lindsey’s idea.”Ofcacek started her career as a line cook, then eventually moved to the front of the house as a general manager and sommelier. Even though she loved her job, Ofcacek thought this was only temporary—she had two small children at that time and couldn’t see how she could meet the demands of running a restaurant while also taking care of them. Then in Louisville, she was hired by chef Annie Pettry of Decca, where maternity leave, nursing in meetings, and strict sexual harassment policies are the norm. She realized she could make it work.When she joined the 610 team about a year and a half later, she brought with her practices passed on from Pettry: ask questions, take care of your staff as much as you do your guests, and don’t be afraid to change the whole system if it’s not working for everyone. Now she’s extending these mantras to the LEE Initiative as executive director.“I just thought about how there are lot of women on the bottom of management and not the top. That’s because if you’re treated like garbage during your first job in a restaurant, you’ll leave,” Ofcacek explains to me over the phone. “We wanted to be an incubator for more women to push through and stay in this industry.”Ofcacek and Lee with the first class of LEE Initiative mentees: Nikkia Rhodes, Stephanie Callihan, Rock, AuCo Lai, and Stephania Sharkey\nPhoto by Chelsie CraigBack at the Beard House, the mentees work together seamlessly. It’s the first time they’re cooking dinner as a team and, for some, it’s the first time they’ve cooked in a kitchen without men. “It’s quieter,” one of the mentees mentions. “Less competitive,” another adds. Then Rock says what all the mentees are thinking: “It feels like a level playing field.”“I stumbled across the call for applicants on social media, and I remember thinking, ‘Oh my gosh, this is me. My name is all over it,’” Rock tells me. “Then in typical Jen Rock fashion, I waited until the very last moment to turn in my application to Lindsey.”She lets out a husky laugh. Rock is a petite woman, dressed in all black, with short, curly hair that seems to defy gravity, and Doc Martens on her feet. Her black, rectangular glasses continually slide down her nose, and she’s mastered a kind of choreography to get them back in place without missing a beat.Rock got into cooking as a way to financially support different career paths she thought she might take—theology school, HIV prevention non-profit work, etc. “There’s always been a little activist inside of me,” she says. But it wasn’t until she started cooking privately for a family that she realized cooking could be a career. So, when she and her family decided to return to Louisville three years ago, Rock landed at Gralehaus, starting off as a part-time line cook/dishwasher and working her way up to chef de cuisine alongside chef Andy Myers—a position she never dreamed of having.She detailed what happened next in her application to LEE Initiative: Mental illness changed her wife, and she became emotionally and physically abusive toward Rock. Then, her wife left her. Devastated, Rock sought out therapy at the Center for Women & Families in Louisville. She poured herself into her work.“I lost my whole world, and I found myself a domestic violence survivor,” Rock says. “I could hardly get up for myself everyday, but, Gralehaus, that was the one good place. It just helped me pull myself up, get through it, and focus on something else.”When she was paired with Jenn Louis for her LEE Initiative mentorship earlier this spring, she had no idea the two would connect over this issue. Louis has written about her own experience of surviving domestic abuse. From her, Rock honed her knife skills and learned how to better communicate with front-of-house staff. But the thing that’s stayed with her the most was how Louis was able to lead in the midst of intense personal struggle. It made Rock realize, “I can do that too.”“My time with Jenn was like a window into where my potential lies,” Rock says of the confidence she gained.” This opportunity [with the LEE Initiative] to take risks, do something for myself, take credit for a dish at the James Beard House—that’s amazing.”Lee and Ofcacek are already planning the next class of the LEE Initiative for 2019. A new crop of chefs have already approached them to volunteer as mentors. They’ll stick to Kentucky, but hope to expand the program to more cities in the future. But for now, the two aren’t making any drastic changes. They plan to do a thorough review of what worked, what didn’t, and what they could do better, then get started on fundraising.“I personally don’t think change happens in one sweeping motion: It happens because a lot of people do millions of small good deeds,” Lee says. “And over time, they drive momentum.”Rock at the Beard House\nPhoto by Chelsie CraigAs the clock ticks down to 7 p.m., the 70 or so guests shuffle to find their seats at the Beard House as Rock and the chefs scramble to plate each other’s dishes. After the whirlwind of a meal, Lee calls the mentees up from the kitchen to introduce them to the audience.“They were scared s**tless downstairs,” Lee says into a microphone, getting a few laughs from the crowd. “They are the future of Kentucky cuisine. They are here to impress you but also to push themselves more than they ever have before.”Lee puts down the mic, and the diners applauded the chefs for their dishes, and their time in the program. Rock takes her certificate that says she officially cooked at the Beard House. She lingers for a moment to bask in the pride and confidence she’s learned to embrace. She beams, and pushes up her glasses one more time.Explore Bon AppétitRestaurantsChefsRead MorecultureDear Male Chefs: Talk LessBy Julia KramerrestaurantsThe Wine Bar That’s Pouring the Most Interesting Stuff in BostonBy Elyse InaminecultureWhat It's Like to be Queer, Trans, Black, and a Line CookBy  Charlie AnderleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Elyse Inamine"]}