{"id": "146ae9522ead5ccb7035b2c7559048ea", "url": "https://www.bonappetit.com/story/calamari-feud", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Calamari Feuds, a Dog Treat Tasting, and a Really Good Asparagus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCalamari Feuds, a Dog Treat Tasting, and a Really Good Asparagus RecipeThat’s what we were up to this week at BA.By Alex BeggsMay 18, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Who’s cooking stuff?Sarah Jampel made Claire Saffitz’s blistered asparagus with a peanut-coconut sprinkle (not as complicated as it sounds!). “Cooking the asparagus in a super hot pan blisters the outsides and chars the tips without making the insides go to mush. And even if the stalks do slacken more than you’d like, there’s a crunchy peanut-coconut topping to make you forget about it.”Get the recipe: Blistered Asparagus with Peanut-Coconut SprinklePhoto by Alex Lau, food styling by Andy BaraghaniEmily Schultz made Andy Baraghani’s fattet hummus, from his Lebanese recipe story (I want to make them ALL). Pita gets crisped up in oil, then you use it to scoop up garlicky-lemony yogurt, warm chickpeas, and crunchy cashews. “It comes together in literally 15 minutes,” she said, “and is the perfect meal to eat on your couch. We normally have a no-eating on the couch rule, but my roommate is out of town this week so…” Hi Chrissy!!Get the recipe: Fattet HummusWant this letter before it hits the website? Sign up for our newsletter!PurinaInto the great unknownRee Drummond bore her black-lined eyes into mine and cooed, “I can’t believe Bon Appétit is here!” And we were...at a dinner for The Pioneer Woman’s new line of Purina dog treats! I’d never sent a quicker RSVP! The treats are “inspired by the things I cook at home at the Ranch,” said the charming and delightful PW around a rustic wooden table surrounded by dog-loving writers. The treat flavors include Beef & Brisket and Strawberry Shortcake, Chicken & Blueberry Waffles, and more. Her own pups’ favorite is Chicken & Sweet Taters. To my right, a writer for People Pets filled me in on Jake Gyllenhaal’s very cute new cat, and to the left, a writer expounded on a tale of a Lab who ate stairs. Stairs! I went home with a goodie bag of treats for a dog I don’t own, so I opened them up and gave each a little nibble. The beef and brisket had a strong smoky steak sauce aroma, and I got a hard bit of gristle in my bite, leaving a leathery aftertaste in my mouth. The strawberry shortcake had a butterfly imprint on it and resembled a tiny pie. It was hard and crumbly but not too different from any British digestive biscuit, lots of oat flour flavor and a hint of strawberry—just barely. With a cup of coffee, ya coulda fooled me.MUST READHave you read this interview with the dentist-turned-line cook at BA’s No. 1 restaurant in America in 2018, Nonesuch? Read it now! “For people my age or in the middle of their working lives, it takes courage to pursue a passion, to reinvent yourself. It’s scary to go out into the unknown.” And think about what you do in life that makes you feel this way: happy.Another oneAnd there are SO MANY great exchanges in this conversation about the Instant Pot between Priya Krishna and the goddess Madhur Jaffrey, like when Jaffrey tsktsks Priya for not soaking her dal overnight because she’s too lazy. “What are you complaining about? You’re not doing any work! You are putting them in a bowl and leaving them. Don’t get so lazy you can’t even soak beans,” she says. Now I want “Don’t get so lazy you can’t even soak beans” on a motivational poster with Jaffrey’s face on it, stat.Unnecessary food meme of the weekAndy's boot campA handful of staffers went to Vegas last weekend for Vegas Uncork’d and every morning they started the day with Andy’s Boot Camp, a grueling hotel gym workout led by Andy Baraghani. “Lots of arms...and legs,” said Rachel Karten. “I’m still sore from it.” There were vertical jumps! Kettlebells! “They had great spirit and tremendous potential,” said coach Andy. And then they spent the rest of the day eating. One meal highlight, Christina Chaey told me, was at Beijing Noodle No. 9, where they ate “beautiful juicy pork and shrimp dumplings, hand-pulled noodles,” and stared at a wall of live goldfish while they dined. Chaey lost $20 in under 20 seconds at the slots, and Andy lost “more money in a short time than I’ve seen anyone lose money,” recounted Alex Delany. The celebrity chef highlight of the weekend was Gordon Ramsay holding Lisa Vanderpump’s fluffy Pomeranian on the red carpet.This calamari is from Ferdinando’s Focacceria in Brooklyn, NY.\nPhoto by Emily SchultzAt the Golden Steer Steakhouse in Vegas, the BA staff argued about where you would never order calamari. Well, mostly they corrected Adam Rapoport, who feels calamari should be ordered in seafood restaurants only, not steakhouses. Then he proceeded to eat half the platter. I asked Molly Baz, is there anywhere you wouldn’t order fried calamari? She sighed, rubbed the bridge of her nose with her hands, closed her eyes, and told me: “I almost always order it. I’m gonna order it.” Gaby Melian already has plans to have some next week, #calamariplans. Carla Lalli Music recalled an episode of This American Life that exposed some restaurant calamari as pig intestines. “In that case—no,” she said. Otherwise: yes. “Maybe not at the airport,” said Rachel. “Ha!” said Amiel Stanek. “I don’t board a plane without a belly full of squid!” “Even when it’s soggy, it’s good,” said level-headed Hilary Cadigan. “It might be a little greasy, the marinara might lack acidity,” mused thoughtful Andy, “but at the end of the day it’s a saucy thing and a fried thing and that’s not gonna be bad.”Explore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay... To Cancel a Dinner Party If Too Many People Are Paleo?By Alex BeggscultureOnce Upon a Time I Foraged for RampsBy Alex BeggscultureThoughts on Carrots, Caullini, and Jack Dorsey’s Drab DinnerBy Alex BeggsculturePork Sauce, Salmon Feuds, and Reese's THiNs: The Week at BABy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-18", "author": ["Condé Nast", "Alex Beggs"]}