{"id": "146cffb9bae84ea41e01ca414650672d", "url": "https://www.bonappetit.com/story/jung-lee-water-jug", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "This Stylish Water Jug Will Make You Drink More Water (In Between the Wine) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Delicate Jug Will Make You Drink More Water (In Between the Wine)Some things are beautiful for the sake of being beautiful, and I want them on my table. By Alex BeggsNovember 25, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When people are coming over, I do things I normally wouldn’t do on a weekend afternoon. I fold pants and stash them away. I check the questionable undersides of toilet seats. I lint-roll cat fur off furniture. And I put out water and wine glasses and a water pitcher, like this pretty one I found at Jung Lee in New York.Doesn’t it look like something Snow White would pour lemonade out of for her seven ungrateful boyfriends? I don’t spend a lot of time outdoors, but this pitcher makes me feel as if I’d like it there. It makes me drink more water just so I can make a show of pouring it. The angled branch handle is the perfect spot for tiny singing birds to land before they braid my hair. Two green and yellow glass leaves have budded within the pitcher, a detail I appreciate because it serves no purpose other than beauty. Too many things in my life our sturdy and utilitarian if not downright ugly. This delicate pitcher is a reminder to spike it with some loveliness once in a while.Fun facts: It’s made by the Italian glassware maker Ichendorf, it’s 16 ounces, and it’s borosilicate glass, which means it can hold up to temperature changes without cracking. If I decide to become a person who decants their wine (and here’s why), I could use it as a cheery decanter. Think of how fun it would be with a batch of rosé Aperol spritzes! Think of what a great gift it would make for the holidays, someone’s wedding, or a housewarming! But since my life revolves around me and my needs, it’ll stay to the center-left on my table, reminding me I could probably use another glass of cold, clear, tap water.Buy it: Ichendorf Greenwood Jug, $55 at Jung LeeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendGiftsEntertainingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-25", "author": ["Condé Nast", "Alex Beggs"]}