{"id": "146d3188f28948a780fde4c878d4a409", "url": "https://www.bonappetit.com/recipe/pickled-beets", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Pickled Beets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssuePickled BeetsBy Maricela VegaJanuary 12, 20214.8(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, Food Styling by Sue Li, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintQuick-pickling is an excellent way to punch up and preserve mild root vegetables like beets. Add them to grain bowls (like this sorghum salad) for flavor and texture and use the leftover pickling liquid to dress sautéed vegetables for a colorful side dish. This recipe is from Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora.IngredientsMakes about 1 quart1½lb. medium mixed beets (such as Chioggia, red, and/or golden), scrubbed1cinnamon stick2bay leaves2Tbsp. black peppercorns2cups apple cider vinegar1cup honey, preferably local2Tbsp. plus 1½ tsp. Diamond Crystal or 1 Tbsp. plus ¾ tsp. Morton kosher saltPreparationStep 1Thinly shave beets on a mandoline into a large bowl.Step 2Toast cinnamon stick, bay leaves, and peppercorns in a large pot over medium-high heat, shaking pan often, until fragrant, about 1 minute. Add 3 cups water, followed by vinegar, honey, and salt. Bring to a boil, then reduce heat and simmer, whisking often, 5 minutes, to infuse. Immediately pour brine over beets. Cover and let cool, 4–6 hours. Transfer to an airtight container; cover and chill until ready to use.Step 3Do ahead: Beets can be pickled 2 weeks ahead. Keep chilled.How would you rate Pickled Beets?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentPickleBeetVegetableEasySideSnackNut-FreeGluten-FreeVegetarianDairy-FreeHealthyishPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}