{"id": "1472a99e4a5da296f0c880527d1d347e", "url": "https://www.bonappetit.com/story/herbivore-emerald-face-oil", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Herbivore’s Emerald Face Oil Smells Like Weed, But It Made My Face Super Soft | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Skin Reeks of Weed from This Face Oil, But At Least It's Super SoftA new cannabis-derived face oil wants your cheeks to chill out. So I tried it.By Alex BeggsNovember 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI went to a beauty event recently for a new Goop product called GOOPGENES. It’s an orange collagen drink that's supposed to make you have everlasting plump skin and stuff. This story is not about that at all. STAY WITH ME THO. At the event, I sat next to a lovely (everyone was lovely, everything was lovely, the drink was ...fishy) beauty writer who told me her skincare routine is now all CBD. “How does your face feel?” I asked. “Very relaxed,” she said. Whoa. On the other side of me, an editor cut a sliver from an already sliced kiwi and took a tiny bite.The main element of this lady’s CBD routine, she told me, is a new face oil from the well-designed, plant-friendly brand Herbivore. It's called Emerald because it’s green, get it? You know what else is green? Weed, kids. However! There is no CBD or THC in this specific product. It’s hemp seed oil, scientific name: cannabis sativa. This is good marketing.So obviously I had to try it. Every morning and night for about two weeks, I squeezed four to six drops from the minimalist dropper bottle, massaged it into my cheeks, and studied the results. My dehydrated skin, a victim of the desert conditions in my radiator-heated apartment, soaked up the oil desperately. Emerald really smells like weed. My face smells like weed. It was jarring at first, and then it would fade, especially if I layered another moisturizer on top. Herbivore suggests their Pink Cloud Creme, which has a light, rose-coconut scent that diminishes the hemp reek. After a week of use, I noticed my skin was definitely moisturized, soft, smooth, and clear of zits. But was I glowing like a rotisserie chicken, my true beauty icon? I might call it “shiny.”I wanted to understand how Emerald actually works, so I called licensed medical esthetician and skincare guru Jordana Mattioli (I avidly follow her on IG for legit product reviews and her walkthroughs of the drugstore beauty aisle), and she broke down the ingredient list—the power players and the not-so-hot.Hemp seed oil. “Hemp seed’s awesome. Hemp has been around the block for years,” Mattioli said. Hemp seed oil is packed with Omegas 3, 6, and 9, which are “gamma linolenic acids,” and while that sounds like some Star Trek shit, it just means it’s super moisturizing and won’t clog pores. However, it might not soak into the skin very fast, she noted, which explains why I felt shiny versus glowy. “Glow is light reflecting off face,” Mattioli reminded me; I really need to stop talking about it like it comes from within.Ashwagandha, turmeric root, shiitake mushrooms. That’s right, there are adaptogens here too. Touting mushrooms in skincare is a sign of the times, (not to say that the ingredients and herbs themself are new—they’re ancient); it just hasn’t been studied extensively yet in the ol’ journals of medicine. For that reason, it’s hard to say if the shiitake in the product is the cause for say, reducing inflammation, more so than other ingredients also present. “Stress and inflammation, that’s where adaptogens come into play,” said Mattioli. “I don’t think [adaptogens in skincare are] harmful, and we know how awesome they are when taken internally, so I’m all for anything that would help reduce stress in the skin.”Squalane is first in the ingredient list, meaning it’s the major player. Squalane is a hydrocarbon that’s found in your own skin as well as in plants, which is how Herbivore gets it in Emerald. Plant-based squalane is “totally safe and fine,” Mattioli told me. Also: super-hydrating. A-ha.Essential oils. “The only thing I don’t love are the essential oils,” Mattioli said. They’re used to add fragrance, and in Herbivore’s marketing, chill-vibe aromatherapy from the scent of hemp. Essential oils are sort of a misnomer, because these aren’t oily like olive or coconut or jojoba. They’re actually super-concentrated extractions of plants that can be very volatile, especially citrus oils, and can include high-proof alcohols that might preserve flower essences successfully but sting your skin. “Some [essential oils] are more intense than others. For the general population, and my clients, when someone has skin issues, I say cut out all potential irritants like essential oils. Hemp seed oil is fine for everyone, but this product wouldn't be my go-to [because of the essential oils].” So make sure you try it on your skin by doing a patch test before slathering your face, especially if you have sensitive skin or have had reactions to products with essential oils before (I have—a mask made my face break into a full-on red, burning fire but the essential oils in Emerald didn’t irritate me.)“We have to remember,” Mattioli concluded, “there’s so much benefit in companies taking the first step and including these new ingredients. Innovation is important. The adaptogen component is really cool. I just want to make sure claims are taken with a grain of salt. Nothing is a miracle product, and when it is, trust me, we will all know about it.” I’ll remain all ears.Buy it: EMERALD Deep Moisture Glow Oil, $48 from HerbivoreAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyRead MoreLifestyleI Love This Turmeric Brightening Mask Despite Its Unfortunate ColorBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Alex Beggs"]}