{"id": "1478149788fb41f8e849a1e83df185a1", "url": "https://www.bonappetit.com/story/american-chinese-food-red-sauce-treatment", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "When Will American Chinese Food Get the Red Sauce Treatment? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen Will American Chinese Food Get the Red Sauce Treatment?I look at the way Italian Americans have progressed from a demonized immigrant group to an unquestioned part of the country’s fabric, and I think, Damn, I want that too.By Chris YingApril 16, 2019FacebookTwitterEmailPhoto by Emma K. MorrisFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Nobody is immune to the charms of Original Joe’s in San Francisco. Even if you’ve never been, you know the type. Big plush booths with olive oil and balsamic vinegar on every table. A dining room that’s perennially lit like Christmas is next week. A menu with dishes from the north, south, and center of Italy. Also Cobb salad, shrimp cocktail, calf’s liver and onions, a roast beef dip, a burger, and half a chicken. Your choice of spaghetti, ravioli, mashed potatoes, or fries accompanies most entrées.And you know what? It ain’t bad. At all. Here’s my go-to order for two people: a plate of crisp golf-ball-size arancini for dipping in marinara. Meatballs, also with tomato sauce, because I can never resist meatballs. Wedge salad. And veal Marsala or chicken Parmigiana for my entrée. Ravioli as my side dish, which is my perennial mistake. Overly thick and spongy, they skew more Boyardee than Bottura, and I’d probably be better off sticking with the (excellent) fries.Don’t worry: Nobody in this restaurant is judging you for ordering chicken parm and fries. I mention this because Original Joe’s is the kind of restaurant you’re trained to sneer at early in your foodie education. Once you’ve learned to differentiate between the cooking of Catania, Rome, Bologna, and Modena, you tend to thumb your nose at catchall Italian American menus.But when I eat at a restaurant like Original Joe’s, I feel hopeful. The story of Italian food in America is one I yearn to see replicated by Chinese, Indian, Vietnamese, Mexican, Thai, Turkish, and numerous other cuisines. Italian food has, for the most part, shed the crippling exoticism that continues to plague—I apologize for this—“ethnic” restaurants and torment their chefs. I look at the way Italian Americans have progressed from a demonized immigrant group to an unquestioned part of the country’s fabric, and I think, Damn, I want that too.Chicken parm, meatballs, and fries on the side? No one will bat an eye at Original Joe's.\nPhoto by Emma K. MorrisBefore the turn of the 20th century, Italian food was just as exotic and intimidating to the average American as any of the culinary traditions I mentioned above. Italian Americans themselves were feared and maligned as foreign intruders.Then the hipsters swooped in.Bohemians were the ur-hipster, according to Paul Freedman, author of Ten Restaurants That Changed America, and they served the same gentrifying role in the early 20th century that they do today. Drawn in by the big portions and rustic charm of Italian American restaurants, bohemians brought money and attention to these unloved corners of the culinary landscape. As time went by and Italian food moved from the outskirts to the mainstream of American eating, those small restaurants gave way to the big exaggerated Italian-ish dining halls we know and love.It was in this climate that a Croatian immigrant named Tony Rodin founded Original Joe’s in 1937, the same year the Golden Gate Bridge opened to traffic. The restaurant began life in San Francisco’s Tenderloin neighborhood as a counter with 14 stools and sawdust on the floor. Over the years it expanded to 140 seats and became a favorite destination for tourists, politicians, and locals alike.I spoke to Krishnendu Ray, a professor and chair of the Department of Nutrition and Food Studies at NYU, about the trajectory of Italian food in America and whether or not we could expect the same for other cuisines. “If you look at the way people talked about Italian food at the turn of the century, it’s with some distaste and disgust,” Ray explained. The rise of Italian food in America, he says, was directly related to the upward movement of Italians in American society. As immigration from southern Europe slowed in the 1920s, Italians already living in the U.S. began to make their mark on American art and culture, especially film and politics. In the ’50s and ’60s, the civil rights movement helped break down some of the racial hierarchy that had Italians classified as what Ray calls “not quite white.” All of this paved the way for Italian Americans and their food to become an integral part of our country’s cultural fabric.In 2007 a fire ended Original Joe’s 70-year run, and it remained closed until 2012, when it reopened in a new location in North Beach, one of the country’s iconic Italian American neighborhoods.By that time, American diners had become infatuated with regional, traditional Italian cooking. San Francisco was especially affected, with a whole generation of chefs inspired to open upscale restaurants that specialized in very specific Italian food: Delfina, La Ciccia, Perbacco, A16, SPQR.Nevertheless—and here’s what I find encouraging—Original Joe’s continued to flourish. I’m heartened that we’ve learned to hold two disparate thoughts about Italian food in our heads at the same time: respect for the hyper-regionality and seasonal cooking of Italy, and equal affection for Italian American restaurants in all their inauthentic glory. More importantly, I’m happy to see that Italian Americans have outgrown their status as unwelcome outsiders.In 2012, Original Joe's reopened in North Beach, one of the country's iconic Italian American neighborhoods.\nPhoto by Emma K. MorrisAll of this can’t help but make me think of Chinese food. For much of its early American life, it was reviled, lampooned, and caricatured. Today there are somewhere along the lines of 50,000 Chinese restaurants in the United States. I like to think that Chinese food—and Chinese Americans—are simply at a different place on the same arc as Italian food.However, the vast majority of Chinese restaurants in America are still cheap eats. Even in places where Chinese cuisine has begun to see some recognition for its mind-boggling diversity and regionality, it tends to bump up against a price ceiling. Chinese food, we think, is supposed to be cheap. We’ll gladly fork over $30 for pasta, but no more than $10 for a bowl of noodles. And have you ever seen what it takes to make dim sum by hand? If so, you’ll know that $6 for four shumai is an absolute steal.What, I asked Ray, would it take for this to change?Ray asserts that as new immigrants arriving from countries like China and India—along with existing communities—begin to come from more professional backgrounds and less working-class ones, they will come into more contact with middle-class white Americans. They will work together, eat together, marry one another, and, ideally, engender mutual respect. That interest in one another will inspire interest in one another’s food and a willingness to try new things. From there we’ll try those new things again and again until we’ve developed a nuanced appreciation for them. Voilà. Easy, right?The glaring obstacle, of course, is that unlike Italians, the immigrants of the past half century may never be accepted as white. “That racial formation is going to delay their absorption and delay turning Chinese food into pizza,” Ray said. “It’s a question of how fast and how ubiquitous it’s going to be. It’s going to be slower than Italian.”In my starry-eyed commemoration of red sauce history, I’ve mostly glossed over the parts where Italian Americans lived first as exiles, then as scapegoats, then parodies of themselves. No doubt the road ahead will be at least equally as excruciating for newer immigrant groups. It’s not so easy as we’d like it to be. People eating more diverse food doesn’t mean they’ll suddenly fall in love with the people who made it. It has to work the other way around: people first, then food.Still, I remain optimistic. Greater diversity in our cuisine is coming, and if you believe Ray, it will be a symptom of greater tolerance in our society. I’ve seen progress in my own lifetime. You can witness it firsthand at restaurants like Original Joe’s, when you take the most quotidian of ideas—Americans love Italian food—and realize that it was once not so obvious.Chris Ying is the cofounder of Lucky Peach (RIP) and the editor of You and I Eat the Same: On the Countless Ways Food and Cooking Connect Us to One Another.Explore Bon AppétitRed SauceItalian AmericanRestaurantsSan FranciscoRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Chris Ying"]}