{"id": "147f3ace3038ad21b7f740ee3c1e557b", "url": "https://www.bonappetit.com/recipe/honey-glazed-pepper-chicken", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Honey-Glazed Pepper Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueHoney-Glazed Pepper ChickenBy Brad LeoneJune 2, 20204.6(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“A halved chicken is really easy to handle on the grill,” says Brad Leone. “Since it’s on the bone, it comes out super flavorful. There are nutrients and flavors in the bones.” It’s crucial to dry-brine the chicken for at least eight hours, which seasons the meat and gives it time to absorb the floral kick of the mixed peppercorns. A fermented garlic-honey and vinegar glaze helps to mellow out the bite. We used this recipe, but you can also use regular honey or maple syrup instead.Ingredients4 servings2Tbsp. black peppercorns4Tbsp. pink peppercorns, divided6tsp. Diamond Crystal or 3¼ tsp. Morton kosher salt, divided13½–4-lb. whole chicken1Tbsp. vegetable oil, plus more for grill2medium Fresno chiles, thinly sliced½cup fermented garlic honey, honey, or pure maple syrup3Tbsp. Champagne vinegar or white wine vinegarSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Finely grind black peppercorns and 2 Tbsp. pink peppercorns in a spice mill or mortar and pestle. Transfer to a small bowl and mix in 5 tsp. Diamond Crystal or 2¾ tsp. Morton kosher salt; set seasoning aside.Step 2Place chicken, breast side down, on a cutting board and use kitchen shears to cut along both sides of the backbone to remove (freeze and save it for stock!). Open chicken and turn skin side up. Press down on center of breast to flatten chicken—you should hear the breastbone crack. Using a chef’s knife or cleaver, split chicken in half through breastbone. Pat dry; rub all over with 1 Tbsp. oil. Sprinkle reserved seasoning all over, making sure to get into all the nooks and crannies. Place on a wire rack set inside a rimmed baking sheet. Chill, uncovered, at least 8 hours and up to 2 days.Step 3Coarsely grind remaining 2 Tbsp. pink peppercorns in spice mill or mortar and pestle. Cook chiles, honey, vinegar, and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt over medium heat, stirring occasionally, until mixture just turns amber in color and is reduced by about half (it should coat a spoon), 10–12 minutes. Stir in pink pepper and set aside.Step 4Prepare a grill for medium heat. Lightly oil grate. Set chicken on grate, cover, positioning vent over chicken if your grill has one, and grill, turning every 5 minutes, until an instant-read thermometer inserted into the thickest part of thighs registers 120°–130°, 15–20 minutes. Uncover and continue to grill, basting with honey mixture and turning chicken every 2–3 minutes, until an instant-read thermometer inserted into the thickest part of thighs registers 175° and 155° in the thickest part of breast, 10–15 minutes longer. Transfer to a cutting board and place skin side up. Let rest 30 minutes before carving.How would you rate Honey-Glazed Pepper Chicken?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is a very good chicken recipe that everybody enjoyed. It looked so good that a vegetarian at the meeting was tempted to try it!AnonymousIthaca, New York8/21/2020This looks beautiful and sounds like it would be amazing but finding these exact ingredients proved to be difficult if not impossible. Fresno peppers aren’t available til late summer or early fall. Pink peppercorns are also hard to come by but I was able to find them. The other reviewers also made substitutions. To make this exact recipe seems unattainable for most. Didn’t actually get to make it the first time, maybe when Fresno peppers are available here I will try again. Sophia901Memphis TN7/2/2020This was SO good! I didn’t have pink peppercorn so used a Szechuan blend and probably about 2 times the amount required (measured ground, not whole, whatever!) also used orange blossom vinegar and added garlic to the glaze because I love garlic. This was delish. Make more glaze that it calls for, you’ll want to drizzle it on afterwards.  AnonymousMinneapolis7/1/2020Sorry, dumb question: does turn mean rotate or flip? If rotate, which side do you put the chicken down: skin side or nonskin side?gpierce112Chicago6/20/2020First things first, this chicken came out great! \nThis recipe was really easy to follow and will definitely make this again.\nI used maple syrup and white wine vinegar. I was able to find most of the ingredients at my local Target. I did use Olive Oil instead of Vegetable Oil.\nI had a hard time trying to find pink peppercorn and Fresno chili's. If you're like me and can't find these, DO NOT substitute the lack of pink peppercorn with more black peppercorn and DO NOT substitute Fresno chili's with Chile Serranos.AnonymousLos Angeles6/15/2020Explore Bon AppétitChickenPoultryFresno ChileChileVegetableSummerMainGluten-FreeDairy-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}