{"id": "14863e3251debaf87bc2fcdc82887e84", "url": "https://www.bonappetit.com/story/nancys-hustle-lamb-dumplings", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "I’d Book a Flight to Houston Just to Eat The Lamb Dumplings from Nancy's Hustle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Book a Flight to Houston Just to Eat These Lamb DumplingsNancy’s Hustle knows the quickest way to my heart.By Priya KrishnaMay 24, 2019FacebookTwitterEmailPhoto by Jenn DuncanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If there is a dumpling on the menu, I will order it. Even, as a recent test proved, when it’s from the Cheesecake Factory. To me, dumplings are like pizza—I’ll never not eat them, but they don’t always dazzle me. At a recent visit to Nancy’s Hustle, an exceedingly cool bistro in Houston, however, I was beyond dazzled.It played out like anywhere else: I saw lamb dumplings on the menu, and without skipping a beat, I ordered them. It didn’t matter that they were an odd fit with the rest of the dishes on the list—things like pancetta croquettes and cavatelli with duck confit. They arrived chubby pockets of meat generously dressed with this spicy, tangy vinaigrette, dollops of thick labneh, and crisped up bits of garlic. Chef Jason Vaughan says he drew his inspiration from Turkic manti. And let me tell you: I have never housed a plate of dumplings faster. The soft but ever so slightly al dente dumpling skin! The way the vinaigrette-labneh combo beautifully offset the richness of the meat! The intense bursts of garlic! The balance of hot and cold and crunchy and soft! My dining companions didn’t even stand a chance. I loved them so much I ordered them again. And I would have ordered them three more times if I could.I’ll continue to order dumplings, and I’ll continue to enjoy them even if they don’t dazzle. But I’d be lying if I said I won’t be wishing they were these little guys from Nancy’s Hustle.Go there: Nancy’s HustleExplore Bon AppétitHighly RecommendHoustonRestaurantsDumplingsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-24", "author": ["Condé Nast", "Priya Krishna"]}