{"id": "1491dfdcb0e95d26743230362436c695", "url": "https://www.bonappetit.com/story/ben-and-jerrys-low-calorie", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Ben & Jerry's Releases Moo-phoria, Three New Low-Calorie Ice Cream Flavors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBen & Jerry's Releases Moo-phoria, Three New Low-Calorie Ice Cream FlavorsIt's the Vermont company's answer to Halo Top.By Melissa MintonFebruary 7, 2018FacebookTwitterEmailComposite. Courtesy of Ben & Jerry'sFacebookTwitterEmailLow-calorie and low-sugar seems to be the current trend in ice cream, and Ben & Jerry's is finally throwing its hat in the better-for-you ring. On Wednesday, the Vermont company announced its new Moo-phoria collection of \"light\" ice cream, available in three new flavors: Chocolate Milk & Cookies, Caramel Cookie Fix, and PB Dough. While the new pints aren't dairy-free, they are made with 60% to 70% less fat, fewer calories, and less sugar than regular ice cream. Plus, unlike some competitors, including the ever-popular Halo Top, the new Ben & Jerry's options are made without erythritol, sugar alcohols, or sugar substitutes, and are sourced with organic milk, an admittedly major accomplishment.Just because Ben & Jerry's skimped on the cream and added more air to achieve the new, healthy-ish (emphasis on the -ish) flavors doesn't mean its signature mix-ins are absent. Chocolate Milk & Cookies is made with a mix of vanilla and chocolate ice cream and swirled with chocolate chip cookies for a total of 560 calories a pint, while Caramel Cookie Fix weighs in at 600 calories per pint and includes vanilla ice cream with shortbread cookies and salted caramel swirls. PB Dough, the new flavor with the most calories—640 in the whole container—features chocolate ice cream with gobs of chocolate-chip peanut butter dough. While nothing can compare to the indulgent mouthfeel a spoonful of classic Half Baked or Chunky Monkey affords, at least these new Moo-phoria flavors don't have the same sacrificial feeling as scoops of other \"light\" ice creams.Halo Top, the reigning low-calorie, high-protein pint, was recently dubbed the most popular ice cream in the U.S., which could have been the impetus for Ben & Jerry's new foray into \"light\" desserts. While Halo Top offers just 240 calories for an entire pint of its vanilla bean ice cream, and these new flavors clock in around 140 calories per half-cup serving, the jury's still out on whether the cult favorite is actually good for us. With clean ingredients and no added sugar substitutes, Ben & Jerry's may have finally cracked the code on lower-calorie ice cream that, against all odds, still resembles the real thing.Explore Bon AppétitHealthyishIce CreamTrendsRead MoreLifestyleHalo Top Is Releasing Seven, Yes, Seven, New Dairy-Free FlavorsBy Andrea ParkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Melissa Minton"]}