{"id": "1498a899ed43ee0c7757cf500245e249", "url": "https://www.bonappetit.com/city-guides/montreal/venue/marche-jean-talon", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Marché Jean-Talon Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealMarché Jean-TalonWander through this locally sourced Little Italy marketFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: because Marché Jean-Talon is a massive open-air one-stop shop for Quebecois products gorgeously laid out in stall after stall.ORDER THE: fried calamari or raw oysters at one of the brick-and-mortar purveyors along the perimeter of the market before you start ogling all the fresh produce, breads, meats, cheese, and fish. Make sure you stop at the Librairie Gourmande for a thoughtful selection of cookbooks, especially ones written by local chefs, and on your way out pick up a bottle of souvenir maple syrup.THE VIBE IS: family friendly! You’ll spy big families doing their routine shopping runs, tourists on the lookout for maple everything, and everyone in between.PRACTICAL STUFF: Open every day: Monday, Tuesday, Wednesday, and Saturday 7 a.m. to 6 p.m., Thursday and Friday 7 a.m. to 8 p.m., and Sunday, 7 a.m. to 5 p.m.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEBoucherie LawrenceAll the Mile End goods to smuggle back homeSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainCafé OlimpicoGet your caffeine fix at this Mile End espresso shopExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}