{"id": "1498f01b1607c40f65948ec47e6a0fde", "url": "https://www.bonappetit.com/recipe/cabbage-slaw-with-charred-scallions-and-lime-dressing", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Cabbage Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueCabbage Slaw With Charred Scallions and Lime DressingBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20204.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCharred scallions provide toasty depth while lime zest and juice bring brightness to this spicy dressing from Lil’ Deb’s Oasis in Hudson, New York.Ingredients4 servings1bunch scallions (about 6), trimmed1habanero chile, seeds removed4garlic clovesZest of 2 limes½cup fresh lime juice¼cup vegetable oilKosher salt1small head of Napa cabbage, thinly sliced2large watermelon radishes or one 6\" piece daikon (Japanese radish), peeled, cut into ⅛\"-thick matchsticksThinly sliced mint and thinly sliced red onion (for serving)PreparationStep 1Heat a dry medium cast-iron skillet over medium-high. Cook scallions, turning once or twice, until lightly charred in spots, about 3 minutes. Transfer to a blender and add chile, garlic, lime zest and juice, and oil. Blend until smooth; season dressing with salt.Step 2Toss cabbage, radishes, and half of dressing in a large bowl. Taste and season with salt and add more dressing if needed. Top with mint and onion just before serving.How would you rate Cabbage Slaw With Charred Scallions and Lime Dressing?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis recipe is banging! However, it doesn’t keep well (the lime becomes too prominent in the sauce the day after). Serves as the perfect accompaniment to the mojo meatballs. Hanwashington, dc12/16/2020Loved this recipe ! made a little bit more of the dressing and used it as a condiment for eggs.. was delicious as well :) thank you BAcatfabiMontréal,Canada5/8/2020SO delicious! This salad packs well for work lunches all week. The dressing is so good, I honestly could use it as a chip dip (or to drizzle on tacos or nachos??). It took a few stops for me to hunt down watermelon radishes, but I'm so glad I did. Thanks BA!AnonymousGrand Rapids, Michigan1/24/2020Wow wow wow 😱🤤 this recipe is absolutely delicious! Thank you BA. Enjoyed every bite of the salad. YES I will make this again, saving this recipe and YES I definitely recommend it. The only adjustment i made is, I only used 1/4 Cup of lime juice not a 1/2 cup. Also didn’t have mint on hand so I used cilantro. But will try it with the mint next time. jessicaolBrooklyn, NY1/11/2020Explore Bon AppétitSlawSaladScallionOnionVegetableNapa CabbageCabbageLeafy GreensLimeCitrusFruitQuickEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}