{"id": "14ab5cbd90750371bb656a2e2376958a", "url": "https://www.bonappetit.com/story/brother-label-maker", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "My Brother Label Maker Lets Me Pretend That Everything Is Under Control | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Label Maker Lets Me Pretend That Everything Is Under ControlWithout it, my pantry would devolve into chaos.By Sarah JampelApril 27, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I love condiments, spices, small jars, and clutter masquerading as collection (as in, I have an array of “tiny spoons”). But I also love order, consistency, list-making, and organization—controlled abundance, if you will. And that’s why I love my Brother label maker, which provides structure and clarity for the otherwise unruly realms of my pantry, fridge, and spice drawer. With the label maker, the riffraff of my kitchen—homemade dukkah! Preserved radish! Three types of dried chiles! Is that aioli?—makes some sense.One of the reasons why my kitchen is so unruly is because it’s small: To save space, I’m constantly transferring dried goods into smaller containers. Rices and grains get shuttled into jars, and the various flours need their own airtight homes. Sugar goes into a quart container, so the big bag can live elsewhere.Surely I am capable of using my senses to discern what is what. But if you’ve ever accidentally used sugar in place of salt or vice versa, you’ll understand why labels are imperative. The neatly labeled vessels make rifling through the cabinet less of a trudge and more of a jaunt. Instead of wading through mysterious territory, I recognize the landscape at every turn. The labels also help me to keep better track of what I have and what I’m running low on.Of course, you can use Scotch tape, a fine-point Sharpie, and a pair of sharp scissors to the same effect. But while tape is great for marking leftovers and other impermanent passers-through, labels are in it for the long haul. When something gets one, you’ve inducted it into your Kitchen Staples.With my Brother label maker, which was a gift from my sister once she knew how much I admired her spice cabinet, I can customize the fonts, borders, and symbols and buy tapes with different colors and patterns. And you can bet I’ve used them all. You can give a girl a label maker, but you can’t take the chaotic tendencies out of the girl.Brother P-Touch PTM95 Portable Label Maker$25 at AmazonExplore Bon AppétitHighly RecommendShoppingRead MoreLifestyleThese Bins Keep My Pantry Tidy No Matter How Many Beans I BuyBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Sarah Jampel"]}