{"id": "14d36c44d2bf5e47928a16f79048b1ad", "url": "https://www.bonappetit.com/recipe/cinnamon-oat-peach-crisp", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Cinnamon-Oat Peach Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCinnamon-Oat Peach CrispBy Bryan FurmanMay 22, 20184.6(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThis dead-simple oat topping can be repurposed for any stone fruit as it comes into season this summer or for pears and apples in fall. This recipe is from B’s Cracklin’ BBQ in Savannah, GA. Read more about pitmaster Bryan Furman here.Ingredients8 servings5lb. medium peaches (about 12), peeled, sliced ½\" thick⅔cup granulated sugar2Tbsp. plus 1 cup all-purpose flour2cups old-fashioned oats⅔cup (packed) light brown sugar4tsp. ground cinnamon1tsp. kosher salt1cup (2 sticks) chilled unsalted butter, cut into small pieces2pints vanilla ice creamPreparationStep 1Toss peaches, granulated sugar, and 2 Tbsp. flour in a large bowl to combine. Let sit, tossing occasionally, 30 minutes.Step 2Meanwhile, whisk oats, brown sugar, cinnamon, salt, and remaining 1 cup flour in a large bowl to combine. Using an electric mixer on low speed, gradually add butter. Once it has all been added, increase speed to medium-high and beat until dry ingredients are incorporated (there should be no dry bits left in the bowl), about 3 minutes.Step 3Place a rack in center of oven; preheat to 350°. Scrape peaches and any juices into a 13x9\" baking dish. Evenly scatter oat topping over peaches and bake crisp until peaches are soft, fruit juices are bubbling, and topping is a deep golden brown, 60–70 minutes. Transfer baking dish to a wire rack and let crisp cool 1 hour.Step 4Divide among bowls and top with large scoops of ice cream.How would you rate Cinnamon-Oat Peach Crisp?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleUse oat flour (rolled oats blitzed in the Vitamiz) to sub for AP flour and it works great gluten free!Joanna9/15/2021Has anyone tried this with frozen fruit? I have a bag of frozen sour cherries Im tryna use up. KatiehwalshAustin5/31/2020made this to go with burgers and hotdogs. major crowd pleaser! would totally make again. I added more onion powder AnonymousNJ7/6/2019Probably the best crisp I've ever had or made.  I served with homemade creme fraiche.  p.s.  I did modify it for less calories - half the sugars, a bit less butter... and it was fabulous.mimimiToronto8/13/2018Thanks for updating the website with the temperature.  The print edition omits it.  I halved the recipe and baked in a 9 x 9 baking dish and it turned out great!shfriedKansas7/19/2018We loved the crumble! Everyone went in for a second and third serving, perfectly balanced and timing to keep texture of peaches.AnonymousItaly7/9/2018This is delicious. For people giving it less stars because there’s no cook time...hello! It’s says 350! Try it. Love it. gaskinsej4909SC7/7/2018Topping is great. Mixed dry ingrdients in food processor and then pulsed in butter cubes. Perfect consistency. Will use again for other fruit crisps.tmarabGeorgia6/17/2018A bit of an editing fail to omit the oven temp. I baked it at 375F and also buttered the pan, though I didn't see any instructions there either. Swapped in nectarines and it was delicious! It is worth noting that the crumble is pretty dark going into the oven, making it difficult to tell when it hits the deep golden brown point. Despite the challenges, I will definitely use this recipe for fruit crisps moving forward!garlicbreathMinneapolis 5/28/2018At what temperature is this baked?wmnashco5/26/2018Explore Bon AppétitCrispFruit DessertDessertSouthernAmericanPeachStone FruitFruitOatRice & GrainsCinnamonHerbs & SpicesSummerEasyNut-FreeBakingJuneteenthRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}