{"id": "14e2d56c97d353ed87ef7325ebb4b5e2", "url": "https://www.bonappetit.com/story/smoky-chorizo-stew", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "This Smoky, Spicy Chorizo Stew Will Actually Make You Look Forward to Leftovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Smoky Chorizo Stew Will Make You Actually Excited for Leftovers (for an Entire Week)It’s the 45-minute dish that just keeps on giving.By Elyse InamineJanuary 18, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailAs you’re skimming this story, I’m probably still eating the same stew that I made three nights ago—and loving every rust-hued spoonful of it. That’s just how good (and bountiful) senior food editor Andy Baraghani’s new chorizo and potato stew is.It’s the thing I want to eat all winter when it’s bleak and already dark at 4 p.m. It hits all the right notes—spice that warms you from the inside! Rich, complex flavors! A touch of acid!—with heat from a sprinkle of cayenne and a lot of paprika, nubbins of salty Spanish-style chorizo, creamy potatoes, tangy sour cream, and a hit of fresh dill.And it’s also the thing you cook all winter, because this recipe is a) incredibly fast to make, b) stupid simple (it’s mostly just cut, dump, and wait), and c) can easily feed a whole football team—or just you for, like, a week.This recipe comes together in just 45 minutes, including cutting all the ingredients and cooking the stew. That’s because Andy built it from flavor bombs, like bacon and chorizo, that do a lot of the heavy lifting for you (and your stove). “The chorizo gives it a back bone and so much depth, so it doesn’t need to go on for hours and hours,” Andy says. Smart guy.Another shortcut Andy recommends to add a lot of flavor with literally zero effort? Adding a hefty spoonful of sauerkraut and a little of the brine right to your bowl. “I really liked the idea of adding pickled veg, definitely something I got from Bar Tartine [in San Francisco],” Andy explains. “But you can add whatever you want—even white kimchi—and then eat it night after night after night.”Which you should. All winter long.Get the recipe:Chorizo and Potato StewThis is the hearty, rustic, and deeply warming comfort food you'll be craving on all snowy days.View RecipeExplore Bon AppétitRecipeWinterStewRead MorecookingWhat’s Better Than Chicken Stew? Chicken Stew Topped With Crispy Chicken SkinBy Hilary CadigancookingThis Silky Stew Solved My Dinner Party Cooking ChaosBy Elyse InamineLifestyleThis Creamy Chickpea and Lentil Stew Deserves Allllll the ToppingsBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Elyse Inamine"]}