{"id": "14ed7cbd730d92874075ce45da782d96", "url": "https://www.bonappetit.com/story/trending-simple-elegance", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Trending: Simple Elegance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredTrending: Simple EleganceWhether your interest is in the culinary arts, interiors, or product design, simplicity is always on trend. Bold extravagance has been replaced with a sense of minimalism that is all at the same time elegant. Think sleek forms balanced by smooth function, like the Delta Trinsic® Pro Kitchen Faucet.By Delta FaucetMarch 15, 2018FacebookTwitterEmailFacebookTwitterEmailStreamline Your Kitchen AccessoriesAnna Cappelen and Chloe Pollack-Robbins, partners of the firm Curious Yellow Design, pride themselves on their style, which is influenced by the simplicity of classic Scandinavian design. A native Scandinavian, Cappelen translates this engrained aesthetic into the interiors she creates, even when shopping for simple details. Both designers agree that restraint is key when selecting all accessories, right down to the floral arrangements. “You may get excited by lavish bouquets,” says Pollack-Robbins. “But keep it simple to be sure it’s appropriate for the space.” This translates to all aspects of living, especially in the kitchen--for example, your faucet should also reflect this idea of simplicity. A sleek appearance combined with highly advanced functionality, like found in the Delta Trinsic® Pro Kitchen Faucet with  Touch2O® Technology, is ideal for keeping things simple yet elegant in the kitchen.A Few, Simple Ingredients Are All You NeedWhen entertaining, or just staying in on a Tuesday night, Bon Appétit Contributing Editor Alison Roman agrees with the Curious Yellow team about simplicity. “Less is more,” she says. One of her go-to favorites is a simple and elegant pasta dish punctuated by many varieties of mushrooms. “You don’t need 100 ingredients to make a delicious bowl of pasta,” says Roman. “The addition of all different types of mushrooms enhances the texture, flavor, and color of the dish.” Roman translates this love of simplicity to her workspace as well. A kitchen that is streamlined yet uber-functional is a must. Cooking can be messy, so any appliance or accessory that can help keep it simple is welcome. That’s where, again, the right faucet comes in. “It is nice to use a faucet like Delta with  Touch2O® Technology,” says Roman. “You don’t have to reach for a handle if you have been cooking and your hands are dirty. It is a ‘simple’ idea that is extremely convenient and needed.”“Whether it is your florals, interior space, or kitchen, keep it clean, simple and elegant,” recommends Pollack-Robbins. Words to truly live by.Looking for more simple and elegant kitchen solutions? See what Delta can do.Serveware courtesy of RW Guild; flatware courtesy of Crate & Barrel; vases courtesy of ABC Carpet & Home.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Delta Faucet"]}