{"id": "14f1850907574eb7f0d4774d102a8f9c", "url": "https://www.bonappetit.com/story/queer-friendly-sauna", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Hotbox Mobile Sauna Reconnected Me With My Russian Roots | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow a Queer-Run Sauna Brought Me Back to My Russian RootsWhen I came out as non-binary, I wasn't sure I'd ever go to a sauna again. By Irina GroushevaiaFebruary 19, 2020FacebookTwitterEmailIllustration by Hannah JacobsFacebookTwitterEmailMy family visited the banya—a traditional Russian sauna—almost every weekend, and sometimes more during winter holidays. Everyone stayed for hours. My siblings and I would take turns in the hot sauna with our parents. “Irusya, lie down,” my mother would command. With a swift motion of a trained wrist, she slapped my entire body with the softened branches of a venek—a broom of dried oak or birch twigs, leaves intact—that had been soaking in a bucket filled with hot water and eucalyptus oil. The feeling was electric, the quick zaps and relief, the lingering pain and pleasure. The room smelled of toasted sap mixed with the beer my father poured on the banya’s scorching coals. Sometimes between slaps of the venek my mother playfully tickled the bottom of my feet.In an adjoining room, my older siblings rested between sessions. Rosy-cheeked and in robes, they’d be seated on a futon embroidered with an old, yellow and brown floral Soviet Union pattern, watching TV and ordering from a menu of dried fish and beer. When I rejoined them they would erupt in a chant of “exhaust my fire”—a literal translation of the cheer we used as someone prepared to take the ice plunge. Standing against the standard-issue Soviet tiles in the bathing area, I would take a deep breath before dunking in the freezing bath. (If we were in the countryside, this would be a jump in the snow.) When you take a cold plunge, for a few seconds after entering the water, nothing exists except the burning sensation on your skin. Afterwards, as steam rolls off in waves, the energy pulses through your veins.Cleansed, I’d sit down with my siblings, ready to rest before another round.The banya aids physical and mental well-being by restarting the body’s cardiovascular system. The sweat releases the body’s toxins, both emotional and visceral. It was an important tradition, a ritual that brought my family members together while caring for ourselves. The heat, the smell of sap and beer—it was home. Until I hit puberty.When my body started to look more like mother’s, the banya became a chore. I would wrap my new fleshy, curvy form in towels, embarrassed and uncomfortable, even in front of my family and close friends. Bright purple stretch marks ran down my milky chest and thighs. After years of wearing my brother’s hand-me-downs, I found myself encased in the gender demarcations of an identity that didn’t quite fit.When my body started to look more like mother’s, the banya became a chore.When I was 13 years old I started kissing other girls. At a sleep-away camp, at night, another girl and I scooted our beds together so we could caress each other’s faces, then hips. I remember blushing. My stomach felt warm. I wanted it so badly but knew it was taboo. Because of the traditionalist mindset, recent anti-gay propaganda laws, and ongoing murders of LGBTQ+ activists in Russia, I had already internalized that as a woman I couldn’t like other women. All through my teenage years I made out with my female friends whose so-called boyfriends couldn’t fathom that it was cheating. Just cute and harmless. Not real love. In that rigid culture, “bisexual” was the only term available for who I was.I dealt with the discomfort because there was no choice. I still went to the banya in order to continue the family tradition, in order to join in community sauna outings with friends. That changed when I moved to New York City for college. I saw parades celebrating queerness. I learned that there were medical services and local businesses catering to my kind and my body. I learned about trans and non-binary identities. Slowly I built a community. I got an apartment with my queer partner (of course, with a cat).With time, I started visiting local bathhouses. Traditional Turkish baths, Russian saunas, and Korean spa houses in the city often divide women and men, funneling them into separate steam rooms. And it was there that I was required to answer that one very alienating question: “Are you a boy or a girl?”My chest and thighs say that I was assigned female at birth. But my broad shoulders and hairy stomach (that I’ve finally stopped waxing) tell me otherwise. I’m neither a man nor a woman. I don’t fit those categories. At the bathhouses in New York, I felt both trapped by a soviet mentality and nostalgic for the comfort of a home and tradition I’d left behind. I needed a place where I wasn’t questioned. I needed a space to heal.Standing out front of the miniature sweat lodge on wheels were two women, Jackie and Paula, the married couple who own and run the HotBox Mobile Sauna, currently parked in Bushwick, Brooklyn. Together they’ve traveled the globe to learn about and experience different sauna cultures. As queer women, they realized that these healing spaces were not very accessible to the queer, trans, and non-binary communities, those whose bodies are often scrutinized in straight spaces. They decided to invest in their own sauna. Their HotBox was designed in Minnesota where, according to Jackie and Paula, there’s a small but thriving mini-sauna culture. Jackie and Paula’s intention was to provide a friendly, accessible, and safe sauna community for all bodies.Instagram contentThis content can also be viewed on the site it originates from.I came for The HotBox’s Sweat Sanctuary session—a shvitz for trans, nonbinary, and queer women only. After Jackie and Paula checked me in they showed me to a changing tent, next to a firepit. I shimmied into my swimsuit as quickly as possible before looking around sheepishly. A group sat chatting by the fire and cooking s’mores. I pulled my beach towel tight around me and walked the few steps to the miniature lodge.Inside was a classic Finnish-style sauna: wood paneling and a wood-burning stove filled with hot rocks. I took a seat on a bench next to a row of others. Many weren’t wearing tops. I felt shy but also liberated. I sat listening as names and pronouns were exchanged. I could hear a few happy shrieks from the ice shower outside. I joined in a conversation about professions—someone ran a queer drink ‘n’ draw, another was a drag performer. One owned a business called Handy Ma’am.Instagram contentThis content can also be viewed on the site it originates from.No one was staring.After a few minutes the liberation overcame my shyness and I took off my top, too.A butch person next to me leaned over. “Is it okay if I pour more water on the rocks?”“Yes, please,” I said.All at once, I felt something I hadn’t in a long time. Like I was young again, at a banya with family. Birch-scented steam filled the space. A wave of heat settled on us. I leaned back on the hot wood panels and closed my eyes.Since that first visit, I’ve followed the mobile sauna wherever it’s popped up in Brooklyn. We hold generations of trauma in our oppressed bodies, and it has been a miracle to sweat it out among my kind, with community members who understand and support my identity. To belong and to restore; to take up space and simultaneously share it generously. To complete my transformation, I realized, I needed a new version of home.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureHow a Women-Only Bathhouse Helped Me Find My Female SelfBy Meredith TalusanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-19", "author": ["Condé Nast", "Irina Groushevaia"]}