{"id": "14f5d2794092b45ef25581e96fac2135", "url": "https://www.bonappetit.com/story/turkey-chili-recipe-foolproof", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "A Foolproof Turkey Chili Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe Fixed Everything That’s Wrong with Turkey ChiliYou’ll want to “gobble” it up—get it!?By Carla Lalli MusicFebruary 6, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery other Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.To be frank, when Chris Morocco asked me to develop a Healthyish recipe for turkey chili, my emotions sagged a little bit. It was like when you show up to your reservation at the poppin’ new restaurant, and the host seats you at a table right next to the bathroom. You’re happy to be in the room, but is this really where we have to sit? Sorry to turkey chili, but the dish often comes across as a compromise. It’s the substitute teacher of chili.Chris didn’t want to hear any of this. I was called to serve, and serve I must. My first decision was to rebuff any overtures toward a “white chili.” I actually love turkey, and I think it is inherently compatible with spice, smoke, and heat. No tomatillos here. My inspiration was going to come from two brick-red chilis on bonappetit.com: Rick Martinez’s Chili Colorado, and BA’s Best Chili, both of which I know and love. Choice of protein aside, those recipes are both built on robust chile purées, which provide the dark current of heat, smoke, and chocolatey bitterness that you expect to find in a good chili. I wanted that for my turkey contender, too, so I soaked ancho, pasilla, and guajillo chiles in hot chicken stock before blending them into a braising liquid that would thicken, enrich, and flavor my version.BA’s Best Chili, a major source of inspiration...\nThe next problem—I mean, challenge!—was to figure out how to cook the chili for long enough to develop all the flavors without rendering the turkey dry and mealy along the way. You don’t have this issue with the hunks of pork in Rick’s chili or the three kinds of beef in BA’s chili, which contain fat and collagen to prevent them from drying out as they tenderize. Ground turkey is extremely lean by comparison, and it’s been ground to small bits, so there’s no protein strands to break down. I was worried. I huddled up with Andy Baraghani, who thought my idea of quickly browning the turkey, removing it from the pan, and then using lots of spices and aromatics to build flavor would probably work. When I told him my concerns about drying out the turkey by simmering it in the chile broth for too long, he agreed that I should add the turkey back into the liquid toward the end of the cooking time. Then I talked to Molly Baz, who debunked my entire theory and insisted the turkey would just get better the longer it got to spend in the three-chile hot tub. This is why second opinions are dangerous. In the ultimate cop-out, I decided to split the difference and cooked the chili base for an hour, then added the browned turkey back for the last 30 minutes of cook time. It worked—the turkey soaks up lots of deliciousness during that half hour, without becoming spent in the process.For a little extra heft and textural interest, there are white beans in this chili. I know, Texans: It’s not really chili if there are beans in it. That’s true, but this is turkey chili—I’m not here to win an authenticity contest. It’s also a Healthyish recipe, so instead of relying on cheese and sour cream, this chili is topped with a very tasty cilantro-yogurt sauce and spears of broken tostadas for dipping and scooping. Like all chilis, this one gets better if it sits in the fridge for a day, a boon for all you meal-preppers out there.In the end, I—a total turkey chili skeptic—was happy. I was proud. I felt I had done right by turkey, a bird I love, and also by chili, a dish of deep pedigree. My feathers felt fluffed. I preened, I clucked, and my turkey chili took flight. Wait—supermarket turkeys don’t fly, do they? They sort of hustle across the field all in a row? Right. Well, that: Turkey chili, the new hot thing, is off and running. Get it while you can.Get the recipe:Turkey and Bean ChiliYes, turkey is a relatively lean protein, but when you pair it with white beans, a robust and concentrated chile purée, and simmer it for a short period of time, it delivers major body and richness. View RecipeExplore Bon AppétitChiliTurkeyWinterSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-06", "author": ["Condé Nast", "Carla Lalli Music"]}