{"id": "151222d9d4d597ca4d2e26602fbab297", "url": "https://www.bonappetit.com/story/rukaiyah-adams", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Rukaiyah Adams Is Changing the Face of Wealth and Wellness in Portland, OR | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRukaiyah Adams Is Changing the Face of Wealth and Wellness in Portland, ORThe chief investment officer at Meyer Memorial Trust is our Superpowered Portland honoree.By Hannah WallaceMay 8, 2018FacebookTwitterEmailPhoto by David AlvaradoFacebookTwitterEmailWe're honoring Rukaiyah Adams as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. We'll be partying with Adams and our partner Caviar at Revelry in Portland on May 16th. Tickets are sold out, but we're probably coming to a city near you soon. Wherever you are, you can read all our Superpowered stories here.When Rukaiyah Adams left a New York City–based hedge fund in 2010, a non-compete clause forced her to take an extended break from work. Missing her mom, who had just been in a car accident, she flew to her hometown of Portland, Oregon.“I went for a run in Forest Park. It was raining lightly, and the sound of rain tapping against the leaves, the smell of soil...” and that’s when it came to me: I am not a New Yorker.”Nine months later, she packed her bags and moved to Portland, a decision that had major ripple effects. Not only did living in Portland reignite her relationship with David Chen, a lawyer in the Bay Area, it helped her switch gears professionally.“I could make ten times more in New York, but I was past the mastery part,” Adams tells me, as she putters around the kitchen of her 1920s English-cottage-style home, making us lunch. “I needed to develop a point-of-view.” In Portland, she landed a job as director of investment management at the Standard, a financial services group, and, in 2013, was appointed to the board of the Oregon Investment Council, the state pension fund.Today, Adams, 44, is the chief investment officer at Meyer Memorial Trust, the third largest foundation in Oregon, with assets of $788.5 million. Started by Oregon grocery store magnate Fred G. Meyer, the trust gives away roughly $35 million a year to Oregon-based social justice and advocacy organizations, equitable education and affordable housing initiatives, and environmental programs. These grants are only possible due to the success of the Meyer investment portfolio, which Adams manages.“Rukaiyah is tackling big, thorny, important, often fraught issues,” says Eve Callahan, an executive vice president at Portland-based Umpqua Bank and long-time admirer. “And she’s doing it with such grace and generosity.”But when I ask her what she does at Meyer, Adam’s reply is pithy: “My job is to make the money.”Long runs in nature—she loves jogging along the Willamette River as well as in 5,200-acre Forest Park—help keep Adams poised in her high-pressure position. “Believe it or not, being healthy and having outlets is pretty important to the technical requirements of the job,” she says as we sit at her marble kitchen table, eating iceberg lettuce with goat cheese, sliced cucumbers and radishes, and shaved carrots, along with avocado smeared on toasted sourdough. “If the person managing money is pulling out her hair and crying, it generates a lot of stress!”Adams running through Forest Park\nPhoto by David AlvaradoIn high school, she played basketball and soccer, and, at Carleton College in Minnesota, she was passionate about rugby. Running has even spurred radical investment changes that have been good for the Meyer portfolio.“Once, in 2014, I was running in Forest Park and stopped and heard the trickle of water and decided that day to switch our investments from oil to clean water.” She has not regretted the decision—global water stocks continue to outperform oil stocks by a considerable margin.More recently, Adams has shifted Meyer’s strategy from a more traditional one of investing in global markets to mission-related regional investing.“Historically, Meyer has focused on venture capital and accelerators—which has done quite well,” says Adams. “But, looking back over who has benefitted from that investing, it’s the same people who normally benefit.” Over the past year, Adams has stepped up investments in businesses run by women and people of color. In 2016, she invested $2 million in Nitin Rai’s Elevate Capital, a fund that invests in Pacific Northwest startups led by women and minorities. (Elevate was a seed investor in feminist tomboy clothing company Wildfang as well as in Hue Noir, a makeup company geared to people of color.)But sexy startups only comprise a small part of Oregon’s economy. “The reality is that most brown people and people of color are employed by small businesses. And we need to grow those businesses,” Adams says. At the moment, Adams has her eye on a few businesses around the state. She’s particularly keen to invest in firms that bridge the urban-rural divide. “They don’t know it, but I’m watching them closely,” Adams says, conspiratorially. “I’m watching how they respond to stress. How they manage their time. How steady they are over time. When you invest in someone, it’s like getting married to them.”On that subject, on New Year’s Eve, Adams wed Chen in an elegant ceremony at the Parker Palm Springs. Adams paused as she sliced vegetables for our salad to show me some photos: One of her and Chen all dressed up in their wedding best, looking radiant and joyous; one of Adams hugging her mom in front of a decorative concrete screen wall.Several times during our interview, she tells me with pride what a fabulous cook Chen is. The youngest of three boys (by about a decade), he spent a lot of time at home with his mom, who taught him to be confident in a kitchen. He has a habit of leaving a cookbook lying on the kitchen counter—Andy Ricker’s Pok Pok, for instance, or Yotam Ottolenghi’s Plenty—with a note: “Pick a recipe.” Adams grabs the Pok-Pok cookbook and flips to Ricker’s recipe for Vietnamese turmeric-marinated catfish with noodles and herbs, and I glimpse a note she scrawled beneath it commemorating that he made it for her on Valentine’s Day last year. Adams says their division of labor is simple: she takes care of the baking and roasting, and he does all the cooking. (She happily does the dishes.)Adams also loves Oregon wines, particularly winemaker Maggie Harrison’s Antica Terra. (“All I do is hug the bottles when I get them,” Adams says.) But her weekday routine does not allow for leisurely meals—at least until dinner. Like many other West Coast investors, she’s up by 6:00 a.m. to check the markets. “So even if I’m not at work, I’m working.” If she runs in the morning before work, she’ll grab a yogurt or piece of fruit on her way out the door. “I love those shredded wheat things that have sugar on top, which I probably shouldn’t eat, but they’re delicious,” she says. Once at the Meyer Memorial Trust office in the Pearl District, she’s at her desk for a few hours, and then around 11:00 a.m. she goes for a 20-minute walk. “I usually have to miss lunch, then I have to gobble it standing up at the sink,” she says. In an effort to eat more mindfully, she’s started bringing leftovers. By around 3:00 p.m., she’s ready for a cup of coffee and a walk—without her phone. “I like to smell the city and see people,” says Adams.Lately, though, she’s working on cutting back. “2018 is going to be the year of no. I have two talks to give this year, and that’s it,” Adams tells me, with what sounds like resolution. But you get a sense that this woman would never be satisfied sitting on the sidelines.When Adams moved back to Portland in 2011, she found a city in flux. Always a majority-white city, Portland was gentrifying at a rapid clip, with black and brown families being pushed out to the suburbs. A fourth generation Portlander—her great grandmother moved to Portland from Louisiana in the late 1950s—she had already witnessed gentrification first hand. Walnut Park, the neighborhood she grew up in, is now known as the Alberta Arts district.As we eat, she tells me the devastating history of Lower Albina, better known today as the Rose Quarter. A vibrant African American and immigrant neighborhood full of bungalows, jazz clubs, corner groceries, and churches, it was affordable and easily walkable to downtown and the neighborhood known as the garment district (now the Pearl).  In the late 1950s, the city declared the area blighted and leveled it, making way for the Interstate, Memorial Coliseum, and a hospital that never materialized. Residents, including Adams’ great grandmother and the German family she rented a room from, were forced to move out. It was an act of racial injustice that many Portlanders are still smarting from.Adams is now on the board of Albina Vision, a coalition of community leaders and developers that aims to redevelop the Rose Quarter with affordability, equity, and walkability in mind. If Adams and the rest of the Albina Vision board get their way, the Rose Quarter will have a public connection to the Willamette River (right now, the lovely bike-and-pedestrian Eastbank Esplanade ends abruptly at the Steel Bridge), a walkable street grid from the 1950s, and affordable housing as a form of reparations to the families who were displaced.Adams pauses and her voice drops to a whisper, so that I need to lean in to hear her. “My grandmother wrote in her Bible, ‘Dear God, I hope I’ve made the right decision in bringing my family to this place. And someday, I hope that one of my children has love, meaningful work, and safety.’” says Adams. “And I am that child.”Explore Bon AppétitSuperpoweredPortlandPortland OregonHealthyishprofileRead MorecultureKaron Davis Is Creating an Underground Art Oasis in the Heart of L.A.By Tasbeeh HerweesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Hannah Wallace"]}