{"id": "151b5f53a64ed596272706db834539f3", "url": "https://www.bonappetit.com/story/simple-issue-2019-editors-letter", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "These Are the Simplest Recipes We’ve Published This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Are the Simplest Recipes We’ve Published This YearSimple? It’s complicated.By Adam RapoportJuly 16, 2019FacebookTwitterEmailPhoto by Alex Lau, prop styling by Kendra SmootFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If it were up to me, every issue of Bon Appétit magazine would be the Simple Issue.Select choice ingredients, futz with them as little as possible, season well with salt and pepper, and use a generous hand with the olive oil.And as editor in chief of this magazine, I suppose it is up to me. But have you ever tried to tell Andy Baraghani what to cook? Found yourself entrenched in a recipe argument with Carla Lalli Music? Been stared down by Julia Kramer when she doesn’t agree with you and gives you that disapproving you-gotta-be-kidding-me look?Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex Lau, prop styling by Kendra SmootA big reason why BA has remained so strong these past several years is because of all the strong personalities who work here. If you ask for someone’s opinion, don’t worry—you’ll get it. Those unsubtle eye rolls by the editors in our hugely popular YouTube test kitchen videos? That’s not hamming it up for the camera; that’s all day, every day.But what I’ve realized after these years on the job is that we’re actually better when we don’t agree. Or, at least, when we can acknowledge that maybe, sometimes, the other person is right.It’s that creative tension that fuels our growth as recipe developers. Like the other day when contributing writer Priya Krishna pressed me on just what simple means— how what’s simple to an Indian-American home cook might be very different from what it is to an olive-oil-and-salt-and-pepper guy like myself.Photo by Alex Lau, prop styling by Kendra SmootIt’s this type of thinking that has made the food in BA increasingly more interesting over these past few years. It’s why our test kitchen editors now regularly reach for jars of miso, tahini, and fish sauce just as my parents relied on ketchup, mayo, and mustard.I’ll be the first to admit that I’m too much of a creature of habit in the kitchen. I lean on my rotation of go-to recipes and techniques—“Should I just do that tomatoey chicken thing again tonight for dinner?” But like most home cooks, I also know it’s the introduction of new ingredients and techniques that supplies that jolt of excitement.So what does simple mean in 2019? To begin with, it doesn’t have to mean “the same.” When Andy lobbies me on a recipe that sounds unfamiliar, I should refrain from my reflexive eye roll. In fact, if it sounds unfamiliar, I should listen up.Yes, a simple recipe should never take too long or require too many ingredients. But beyond that, how about I open my mind? How about I expand my parameters of what simple means? I’m realizing that the more I listen, the more I learn, and the simpler everything becomes.Get all the recipes from this issue:1 / 27ChevronChevronInflammation-Busting Pineapple SlushyView RecipeExplore Bon AppétitLetter From The EditorRead MorecultureSummer Pies Should All Be Deep DishBy Alex BeggsLifestyleThis Watermelon-Feta Salad Is Our New Go-To Summer SideBy Anna StockwellcookingZucchini Doesn't Have to Be Watery and SadBy Adam RapoportcookingThe Galette That Makes People Think I Work at Bon Appétit or SomethingBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Adam Rapoport"]}