{"id": "151d1ab885e4d15cb4c21a52846881b3", "url": "https://www.bonappetit.com/story/the-accidental-apprentice", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "The Accidental Apprentice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Accidental ApprenticeI ran off to Italy on a whim. Then I met the girl with the figs.By Jason HammelMay 3, 2018FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailOne summer in my 20s, I ran off to Italy with the grand idea of, like, figuring it all out. I saved a few hundred dollars and rented an apartment sight unseen from a bulletin board in the train station. It was a single, drafty room, large enough for a twin-size bed, with a set of windows overlooking a wide, bustling piazza. In the corners were two doors: one for a bathroom so small you had to use the sink as a shower, another for the even smaller kitchen—a closet, really, with an old gas oven you lit with a match.It was the address that changed my life: 26 Piazza del Mercato Centrale. Those windows looked out at one of the greatest food markets in the world. I found myself there every morning, hunting through the vegetable aisles. I stumbled badly. Said asinine things like I wanted a “fish” when I wanted a “peach.” I soon learned that in the market, vendors expected you to know exactly what you wanted, and not just in kilograms but by its purpose, who was coming for dinner, what the occasion was, and what recipe you’d use. The problem was, I didn’t know any recipes. I didn’t even know the names of the vegetables. And no one was coming to dinner.That is, until I met the girl with the figs.For several days I’d seen her tending her family stall. In a building full of pudgy old men, curmudgeons armed with paring knives and day-old newspapers, she was a captivating enigma, despite having a grandmotherly style herself. She wore pale cardigans in the mornings, had her apron loose around her hips, was thin, sharply boned, tough as them all, yet still young, spirited, beautiful.That summer she had a small crop of black Mission figs from a southern relative, which she sold by the piece. Since then, in my 20 years of professional fig buying, I’ve never seen any so beautiful— purple-tinged dark skin with long, sharp stems where some careful gardener had clipped them with her shears. A select few had been cut open to reveal a red, swollen heart with caviar-like seeds, still firm and unyielding to the touch.She talked to me about the fig trees. About the hill where they grew. About the woman with the shears: her grandmother, Sophia. I set two figs inside a paper bag and passed them back to her to weigh. She pointed to some mint bunched upright in a cup of water. I pointed at sage. She shook her head no, gestured toward the sun, then made a fan of her hand. She was saying, Figs and mint is for a summer day. From that moment we became close. I’d visit every day, and she’d make suggestions for what to eat, how to eat it, why one ingredient needed another. Figs and mint. Artichokes and leeks. Rosemary for when it rained.Illustration by George WylesolOne morning, in a newly confident stream of inept Italian, I told her how I was learning to cook in the kitchen in my apartment. How before that summer, I had never made food for myself. I can’t imagine how it sounded, this guy speaking eagerly in words only a toddler would use. I described the tiny sink and the old gas oven. She sent me home with a package of sweet peppers, a fistful of oregano, and a jar of fig preserves she had made. Then she pointed at the chicken vendor and said, Get the one on the right.It was early afternoon when she called up to me from the piazza. I went to the windows like a character from a play, and there she was, holding her loose apron in one hand and waving with the other. In my apartment, there was hardly room for us to stand together by the oven. I watched her skillfully trim the peppers in the air like a woodworker with a carving knife. Following the method of her grandmother, she charred the peppers in the oven, then took them out and covered them in streams of olive oil, so much that it pooled between the peppers, before adding sprigs of oregano and splashes of white vinegar. After tasting the oil with her finger, she turned the oven to its lowest setting and put the pan of peppers back in. Her grandmother would leave them in for hours.Let’s take a walk, she said. When we came back, the gentle heat of the oven had softened the peppers until they were creamy yet still somehow intact—still themselves. We roasted the chicken simply and glazed the peppers in the fig preserves. Since there was no room at my place, we took the plates to a nearby park, spread an old blanket on the warm grass, and ate with our fingers.At the time I didn’t know this recipe would be anything other than a glossy detail from a summer storia. I didn’t know that the way she carved the peppers with that bone-handled knife in her hands would come to me every time I’ve held a paring knife since. Or that I would remember this dish each time I tell a cook to take a confit, a poach, a braise, low and slow.We spilled wine on the grass in the waning summer night. Low and slow. An adagio. It was July, and tourists looked at us with envy. See, I could hear one man saying, look at how they live.Get the recipe for Slow-Roasted Bell Peppers:Slow-Roasted Bell PeppersWe streamlined this recipe to get excellent results in an hour; serve alongside roast chicken or spooned over pan-fried fish or toasted bread.View RecipeJason Hammel is the chef of Lula Cafe and Marisol in Chicago.Explore Bon AppétitItalyRed PepperTravelRead MorecultureA Story of a Young Romance, a Bowl of Bar Peanuts, and a Plastic Bottle of WhiskeyBy Rumaan AlamcultureOur Highly Subjective But Very Smart Guide to TravelingGallery21 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-03", "author": ["Condé Nast", "Jason Hammel"]}