{"id": "152806bc0776e538efb70ec281f62635", "url": "https://www.bonappetit.com/story/aleppo-sweets-providence", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Youssef Akhtarini Fled Syria. His Baklava Recipe Came With Him. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYoussef Akhtarini Fled Syria. His Baklava Recipe Came With Him.The story behind Aleppo Sweets, a haven for homesick Syrians and one of our 50 nominees for America’s best new restaurants in 2019.By Priya KrishnaSeptember 19, 2019FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailWhen Youssef Akhtarini landed in Providence, three years ago, his first instinct was to go to the local mosque. His second was to make baklava. So he took out his rolling pin—one of the few possessions he brought from the Middle East—and started to layer phyllo, cook down a lemon-kissed syrup, and chop walnuts. Soon he and his wife, Reem, were inviting the people they had met at the mosque and the volunteers at the Dorcas International Institute, the nonprofit that helped resettle the Akhtarini family in Rhode Island, and feeding them buttery, flaky sweets.Those gatherings turned into a stand-alone restaurant and bakery, Aleppo Sweets. It’s one of our 50 nominees for our list of America’s best new restaurants, and it’s become one of the more popular spots in town—a haven for homesick Syrians, including the refugees he hires to work there, and anyone who dreams of baklava that crackles like a potato chip.“There are other Middle Eastern restaurants in Providence,” says Jenna Pelletier, a former staff writer at the Providence Journal who first wrote about Aleppo Sweets, “but as far as I know, none of them sell baklava like this.”Akhtarini began baking in his hometown of Aleppo when he was 15, as a trainee at the famous Syrian bakery Diab. He started at the bottom, sweeping the floors and placing the pistachios in the center of the bird’s nest pastries, whose base is shredded baked phyllo. He was constantly observing. “I figured out how to read the mind of the person next to me and figure out, What does the person need next?” he says, speaking through a translator, his friend Abdullah Kanaan. “I would run and give it to him before he asked for it. That is how I proved myself.”He eventually opened a few successful bakeries with his brothers. He was known in his neighborhood for his pistachio fingers—rich nut-coated rolls of phyllo—and bride’s bracelets (similar idea, different shape).In 2012 there was a civilian uprising against President Bashar al-Assad, resulting in violent conflict that spilled over into everyday life, including Akhtarini’s. “Regime planes bombarded the neighborhoods, and there were weapons all over the streets,” he recalls. “Sometimes when we wanted to get bread, we had to dodge snipers on buildings.”A year later, he, Reem, and their six children fled Syria for Turkey. Not long after he arrived in Turkey, his bakery was completely destroyed. Suddenly he knew there was nothing to go back to. It was time to start anew. After three years, he sought asylum in the U.S. through the U.N.Eventually the family ended up in Providence, a city that they had never heard of. Thanks to Dorcas International in Rhode Island, which is devoted to providing resources to immigrants, the city had a strong infrastructure for accepting and resettling refugees.Youssef and Reem Akhtarini at home in their new space\nPhoto by Elizabeth CecilAkhtarini soon started renting out a commissary space in a local pizza shop for $500 a month. Either at 5 a.m. or after midnight, he’d make baklava and pistachio fingers to take to a nearby farmers’ market, where they nearly always sold out. “But I was very happy doing this,” he says. “Very happy.” As he brushed syrup over sheets of phyllo and carefully arranged walnuts into each layer, he would take video and send it to his family on WhatsApp. “It makes me feel that everything is okay.”As a refugee, it’s hard to start a business without a credit history. But with the financial backing of Sandy Martin, a volunteer at Dorcas International, Akhtarini took over a space on a quiet tree-lined block of the city in 2018 and started to build Aleppo Sweets. Martin and her husband, Victor Pereira, bought the building that would house the restaurant as an investment property.At Aleppo Sweets, the design is not meant to mimic his bakery in Aleppo, Akhtarini says. That’s in the past. Instead he wants people to feel like they’re in a Syrian home. There are intricately patterned windows, a small fountain, many plants and copper teapots, and a handmade Syrian backgammon board (a lot of it sourced from Etsy).On the morning I visit, he is laser-focused on mabrooma, a shredded phyllo pastry with an intensely complicated process. He carefully rolls up the noodle-like bits of phyllo into a log, deep-fries the entire thing in ghee, drains off the excess oil, and then brushes each side with syrup made of lemon, water, and sugar. The pastry drinks up the syrup like a sponge until it glistens. Then it’s baked until the syrup starts to caramelize. What distinguishes a Syrian pastry from other Middle Eastern pastries, Akhtarini repeats, is that Syrian ones are not too sweet. He’s judicious about the amount of sugar he uses and relies heavily on citrus, so the pastries aren’t cloying but balanced.A platter of pastries: baklava of all sizes and shapes and bird’s nests\nPhoto by Elizabeth CecilWhat also distinguishes Syrian pastries are the varieties of ingredients people use. Akhtarini gets his ghee in a large green tin from an Arabic market outside Boston and his pistachios from Turkey. Still there are certain things he hasn’t been able to find, like the exact strain of bright, spicy Aleppo pepper or ghee made of sheep’s fat (“the minute it touches your mouth, it tastes like heavy milk,” he says longingly).During this interview, Akhtarini cannot sit still. He gets up every 15 minutes or so. To rearrange baklava in the pastry case. To drizzle syrup over mabrooma. To sip one of the 20 (yes) cups of tea he averages a day. It’s an energy born from necessity: The shop has been perpetually packed, despite the fact there was almost no marketing for Aleppo Sweets when it opened in January. Akhtarini was practically living in the bakery the first few months.“Food is the identity of the Syrian people,” he says, “I wanted to give the best face to everybody here—not just me, but the people working in the back.”The menu features several savory dishes like stuffed grape leaves, falafel, beef-filled kibbeh, and chicken kebabs. But the pastries are why you go. The baklava, served alongside a glass of ginger, mint, and cardamom tea, has the richness of a lavishly buttered waffle. The pistachio fingers taste of savory butterscotch. The bird’s nests are like the most decadent Frosted Mini Wheats imaginable. And the mabrooma is smoky and sweet with creamy pistachios nestled in the middle.The bakery already has a steady slate of regulars, including many Syrian Americans. At times you can hear Arabic spoken more frequently than English in the dining room. It’s intermixed with the sounds of mint tea being splashed into decorated glasses and the crunching of baklava like raking autumn leaves.“This is Aleppo baklava,” says Nora Barre, a customer who moved to the U.S. from Aleppo when she was a child. “I used to think, You can’t get this outside of Aleppo.”Akhtarini says he has no desire to move back to Syria anytime soon, where the situation is still fraught. The children have settled into school. They have a new group of friends. “I felt like I am free to do anything I want with anybody [in Providence],” Akhtarini says. “It is not like our country.”The only thing Akhtarini doesn’t love about his new hometown is the weather. He wishes it weren’t so cold in the winter. But to be able to complain about the weather is a luxury, he says, taking a sip of his tea. He has his family, a stable business, and a steady supply of sweets. What more could a person want?Explore Bon AppétitHot 10 2019RestaurantsProvidence, RIChefsRead MorerestaurantsWhy People Travel Far and Wide for Shatila Bakery's BaklavaBy Priya KrishnaPhotography by Emily BergerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Priya Krishna"]}