{"id": "152e6e649044ef4f7a270666ded67947", "url": "https://www.bonappetit.com/story/royal-rose-saffron-syrup", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "The Secret Ingredient That Improves My Cocktails, Morning Yogurt, Delivery Pizza… | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Secret Ingredient That Improves My Cocktails, Morning Yogurt, Delivery Pizza…Royal Rose’s saffron syrup is my ride-or-die.By Amanda ShapiroJuly 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I have a few tricks when it comes to making cocktails. Pre-chill the glasses. Try a sprinkle of salt. When in doubt, citrus. But my best trick comes in a bottle, and it’s this simple syrup from Royal Rose.Royal Rose is a small-batch company in Newcastle, Maine, that specializes in simple syrups made from local ingredients like blueberry and more unusual blends, like lavender and lemon. The whole lineup is commendable and recommendable, but the saffron syrup is my ride-or-die because of its subtlety. With only a few ingredients—unbleached sugar, saffron, lime juice, and cinnamon—the syrup makes almost any drink taste better and more complex...meanwhile, no one drinking will ever guess why.I’ve found that the earthy, just slightly floral syrup pairs well with any base spirit. It’s also delicious stirred into fresh lemonade or plain yogurt, or drizzled over pizza or hard cheese. Once open, it’ll keep for months in the fridge, but if you're anything like me, you'll go through your bottle much faster than that.Buy it: Royal Rose Saffron Simple Syrup, $17All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-08", "author": ["Condé Nast", "Amanda Shapiro"]}