{"id": "15377d58acf24c7660e4e24ef01e5a8c", "url": "https://www.bonappetit.com/recipe/chicken-mole-enchiladas", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Chicken Mole Enchiladas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueChicken Mole EnchiladasBy The Original Mexican CafeOctober 19, 20214.6(30)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, Food styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThese luxurious enchiladas, served at the Original Mexican Cafe in Galveston, Texas, are a timeworn staple for senior staff writer Alex Beggs. “Mole can get too chocolatey if the cook is heavy-handed,” she says, “but here it’s in perfect balance with smoky ancho chiles.” Read Beggs’ essay about what these enchiladas mean to her, then try your hand at making them yourself. The Original’s streamlined approach to making mole cuts down on ingredients without sacrificing flavor for a rich, velvety sauce that’s layered under crispy-gooey cheese.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At Amazon13x9\" Baking Dish$20 At AmazonMesh Sieve$13 At AmazonLarge Pot$55 At AmazonSmall Skillet$40 At AmazonIngredients6 ServingsFilling1½lb. skinless, boneless chicken thighs (4–5)1small onion, halved1celery stalk1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher saltMole and assembly4large dried ancho chiles, stems and seeds removed⅓cup golden raisins¼cup mole paste (preferably Rogelio Bueno)1Tbsp. chicken bouillon paste2tsp. creamy peanut butter1tsp. sugar2Tbsp. plus ¼ cup vegetable oil¼cup chopped semisweet chocolateKosher salt8oz. Monterey Jack, coarsely grated (about 2 cups), divided125\"–6\" corn tortillas¼cup coarsely chopped cilantroFinely chopped onion, cooked rice, refried beans, and lime wedges (for serving)PreparationFillingStep 1Bring chicken thighs, onion, celery, salt, and 5 cups water to a boil in a large pot. Reduce heat and simmer very gently until chicken is cooked through, 12–15 minutes from the time water starts simmering.Step 2Transfer chicken to a medium bowl; let cool. Strain broth through a fine-mesh sieve into a large measuring cup (you should have 4½ cups); discard solids.Mole and assemblyStep 3Toast chiles in a dry small skillet over medium-low heat until pliable and slightly puffed with a few lighter-colored blisters, about 3 minutes. Transfer to a blender, add raisins and 2 cups broth, and tamp down chiles to submerge. Let sit until softened, about 20 minutes.Step 4Add mole paste, bouillon paste, peanut butter, and sugar to blender and purée until smooth.Step 5Heat 2 Tbsp. oil in a clean large pot over medium. Pour chile paste into pan (stand back, mixture will spatter!) and cook, stirring and scraping bottom of pot constantly, until paste is dark, glossy, and the texture of ketchup, 8–10 minutes. Add chocolate and remaining 2½ cups broth; bring to a boil, whisking often. Cook, whisking, until chocolate is melted and sauce thickens slightly, about 2 minutes; season with salt. Let cool until just warm.Step 6Shred chicken in bowl and add half of cheese; toss to combine. Season with salt.Step 7Heat remaining ¼ cup oil in a small skillet over medium-high until hot but not smoking. Submerge each tortilla in oil just long enough to soften, 10–20 seconds each (they should be slightly darker with small blisters). Transfer to paper towels to drain.Step 8Preheat oven to 400°. Spread 1 cup mole in a 13x9\" baking dish. Dip a tortilla in mole in pot, lightly scraping against rim to remove excess. Fill with ¼ cup chicken mixture, roll up tightly, and place seam side down in baking dish. Repeat with remaining tortillas (they can be tightly packed into dish). Pour remaining mole over tortillas; sprinkle remaining cheese on top. Bake until cheese is melted and filling is warmed through, 8–10 minutes.Step 9Top enchiladas with cilantro and onion and serve with rice, refried beans, and lime wedges for squeezing over.How would you rate Chicken Mole Enchiladas?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleKiller recipe, fastest mole ever. I blended some of the sofrito with the chiles, PB, and raisins for a thicker bodyChefMadelineDenver, CO3/10/2022What a sad offering. \nI paid to clear my guilt  for using some great recipes for free. \nThis one lacks direction. \n-onions and celery to boil with chicken thighs… how should they be cut?\n- what broth to use to moisturizer  peppers?\n\nEtc\n Still interesting AnonymousLake Tahoe 1/25/2022Can someone please tell me what bouillon paste is. Is it the same as bouillon base?\nM & JBloomington, IL1/24/2022I’ve wanted to make mole for awhile and this seemed like a good first time recipe. It was delicious and just what I wanted for Christmas Eve. I totally agree with the review below about washing dishes. This isn’t an everyday dish for me. We fried half of the tortillas and warmed the other half in the microwave. The warmed tortillas seemed more likely to crack, but there didn’t seem to be a difference in taste. Sara12/25/2021If you like washing dishes, you'll love this!  I loved the finished product and definitely respect the author's shortcuts for mole.  There will definitely be a next time and I might experiment with pre-shredded chicken, prepared chicken broth, and some way to make the corn tortillas pliable without frying.  Thanks for the great flavors!Wait UpFrozen Tundra12/9/2021These are amazing! Perfect amount of spicy, sweet and savory. Made it twice in the last 2 weeks! I made for skeptical mole people and they loved it. Alexandra RuizColorado 12/6/2021Great recipe! A few notes from my first cooking of it. It probably goes without saying, if you can get freshly made corn tortillas, it really makes the dish. I really liked the idea of starting with canned/boxed mole sauce, then 'elevating' it with the anchos, chocolate, etc. I would probably cut back the peanut butter next time as it punched through too much. I added the chocolate in the blender mix to save time but then was careful not to scorch the mole sauce on the stove. It can be a bit messy to fill the tortillas, but I was able to use tongs to dip, fill, and fold them in the pan without handling them much. Eric W.Durham, NC12/4/2021I liked the flavors of this dish, but it came out very sweet.  I needed to add a significant amount of lime. I would definitely omit the sugar in the blender portion.  I also struggled with how much chocolate to add.  1/4 cup chopped chocolate could be very different depending on how fine the chop was, will probably try using cocoa powder instead next time.MasonBoulder, Colorado11/15/2021So I can use a whole tablespoon of undiluted Better Than Bouillon Chicken Base?RogerHalifax, Nova Scotia11/11/2021I can't give these enchiladas a rating yet, as I have not made them. But...BUT I can give Alex Beggs 5 stars for her story of life, memories and love. I laughed an I cried. I'd have loved to have been friends with your mom. She reminded me of mine and boy, do I miss her. Thanks for a great story Lizo Seattle, Wa11/9/2021@JOYCEE COLORADO - The most common market brand is, \"Better than Bouillon.\"  There are other brands in stores and on internet.  If you find another one, it is just as good.EricJMAstoria, NY10/28/2021What is \"bouillon paste?\"JoyceeColorado10/26/2021We’ve been eating at the Original Mexican Cafe for years! Amazing food and it is great that they are in your mag. Their chicken mole enchiladas are terrific. Since we live in the PNW we will have to make them tonight and enjoy our old Galveston roots. AnonymousSeattle 10/20/2021Explore Bon AppétitEnchiladasMoleChickenPoultryChocolateOther IngredientsDinnerMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "The Original Mexican Cafe"]}