{"id": "1556fe4bbde9ce21cf7b4dee576fc0ff", "url": "https://www.bonappetit.com/story/i-went-vegan-for-love", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "I Went Vegan for Love—And I Won't Do It Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Went Vegan for Love—And I Won’t Do It AgainChanging my diet didn’t make Ben fall for me, but we became real friends once I stopped eating like him.By Zoe DenenbergJuly 16, 2021FacebookTwitterEmailIllustration by ZelootFacebookTwitterEmailIf you’re judging compatibility solely by diet, Ben and I shouldn’t have made it past our first meal. I am allergic to nuts and sesame; Ben is vegan. My fridge almost always contained four different cheeses; his cabinets were stocked with trail mix and tahini. The overlap in the Venn diagram of our diets was razor-thin—and yet, we began a friendship by cooking together.On a Tuesday night in October, Ben invited me over to cook for the first time. I had moved to Birmingham, Alabama five months prior for a writing job at a lifestyle magazine and had yet to make any real friends (aside from my roommate). Ben and I had met on a camping trip, when I’d spontaneously joined a group of friendly strangers for a weekend of hiking up waterfalls and floating down rivers. Over a jar of pickled okra, Ben and I discovered our shared passion for cooking, and I discovered my soft spot for a blue-eyed boy who wore goggles to swim.Related: The Things We Eat for OthersContentThis content can also be viewed on the site it originates from.That night at his place, we made falafel and green beans and tomato confit. As he pressed his thumb into a cherry tomato, I asked how he’d become vegan. He said it started as a bet. “Me and my friend were gonna see if we could do it for a month, and it wasn’t that bad,” he said, shrugging. “But I make some exceptions.”He pulled up a manifesto on his laptop–three pages he’d written outlining occasions when it was acceptable to break from veganism.There was the When in Rome clause—“When I’m somewhere that’s known for a certain food, I’m going to eat it”—and the Home Cooking clause—“If you’re a guest in someone’s home, it would be rude to turn down food someone has prepared for you”—and a slew of others, all focused on making veganism more accessible. I looked at him in his half-unbuttoned Hawaiian shirt and the whole thing felt unbelievable; not untruthful, but extraordinary. He felt extraordinary.Cooking with Ben felt like wandering aimlessly through a new city. We spent hours over the stove, riffing off each other’s ideas. Sometimes he would surprise me with a wild card—a block of silken tofu, a bushel of carrot tops—and ask how we could incorporate it into the meal. “Silken tofu aioli,” I’d say. “Carrot top chimichurri!” he would smile.From the beginning, Ben’s attention felt like a gift. He lived in a cool loft downtown, and I lived in a dingy apartment in the suburbs. He spent his weekends visiting friends in New Orleans and Philadelphia, while I spent mine sitting alone at breweries, reading to pass the time. More than anything tangible, I envied Ben’s self-confidence—he knew exactly who he was and did not think to apologize for it.At 23 years old, I thought I knew who I was too. I loved Victorian novels and my tie-dye Crocs (which I wore well before they were cool). I didn’t know how to ride a bike and sometimes cried when I was hungry. The difference between Ben and me, though, was that I did not truly believe that I could be loved for all of these qualities. After countless failed, not-quite-relationships, I’d never found true romantic connection by being entirely myself. Maybe to be loved, I figured, was to make oneself lovable.My veganism started with small changes. I switched from 2% cow’s milk to oat milk and stocked my pantry with chickpeas. But then I stopped buying meat altogether, loading up on tofu. I sent Ben photos whenever I was eating something vegan. Looking back at our texts, I cringe at the eagerness with which I wrote: “First time w tempeh!!” and “Matzah and !!! Vegan butter !!!” Sometimes, he responded with a small affirmation—“Nice!”—or a thumbs up emoji. Sometimes he didn’t respond at all.Before I met Ben, I’d never genuinely considered cutting out meat or dairy. I love burgers and Parmesan and baking with full-fat butter. But somehow there I was, making “ricotta” out of tofu and coating my popcorn in nutritional yeast just so I could tell someone about it. Meanwhile, Ben constantly forgot about my food allergies, nearly feeding me nuts or sesame on multiple occasions.Let me be honest here: I was also remarkably bad at being vegan. Unsatisfied by meals of lettuce and chickpeas, I found constant excuses to break from my vegan diet. One month into my veganism, I posted a photo of a bloody double-cut rib eye on Instagram, captioned: “Fck labels. I’m still half vegan. No regrets.”But I did, in fact, have regrets. All of my digressions came charged with guilt—every time I ate a slice of steak or a spoonful of ice cream, I felt like I’d failed. I tried to make light of what I saw were my shortcomings by performing a carefree, relaxed approach to plant-based eating, but in reality I was deeply ashamed.Then, a few months into the pandemic, I lost my magazine job. Out of options, I applied to be a baker at Birmingham’s local creamery. I loved baking for a living, but I faced one piece of dissonance: It was officially part of my job to eat dairy. I spent my days watching hundreds of quarts of liquid silk churn out of the ice cream machine: goat cheese ice cream swirled with magenta-hued strawberry-hibiscus jam, or sweet cream loaded with chunks of cookie dough and ribbons of malted fudge. Sometimes, my coworkers and I shouted “Quality control!” as an excuse to dip our spoons into the soft ripples of freshly spun dessert.After a few months of ice cream taste tests, my veganism felt more and more like a charade. Ben didn’t even seem to care about what I internalized as my failures. When I’d posted that photo of a steak, he commented: “Half vegan is better than none at all.” I no longer wanted to be vegan, but letting go of a plant-based lifestyle felt like admitting defeat. My inability to stick to a vegan diet only reinforced the anxiety that had spurred my whole plant-based journey in the first place: that I was not enough.But this past January, things changed. Ben started dating someone else. He broke the news while the two of us sat huddled under blankets on my back porch. He’d just returned from a road trip with a close friend—now his girlfriend. I must be honest here too: Ben and I had never become more than friends, no matter how many times I professed my feelings (twice). Still, I’d held out hope. Maybe, one day, he will see it, I’d thought. Maybe, one day, he will see me. But as I looked at him in that moment, blond hair curling in tufts out the bottom of his beanie, I knew that my fantasy of what he and I could be had to end.Only then did I start to understand the ways I’d changed myself to appeal to him. He never asked me to try out veganism: I volunteered for it. I desperately wanted to fit into his life, to be the kind of person he could see himself with—quietly becoming a smaller and smaller version of myself along the way. Ben and I could only be real friends, I realized, once I was my real self.I am no longer vegan. I eat ice cream almost every day, and I don’t feel bad about it anymore. Ben and I are still close friends who cook together often. A few weeks ago, we made mushroom tacos with couscous and adobo sauce. After dinner, we settled on the couch and I pulled a quart container of leftover chiffon cake out of my bag.“I made this cake today,” I said, holding a misshapen piece out to him. “The scraps would’ve been thrown away.” I waited for him to catch on, watching as he mentally flipped through his manifesto. Then, he smiled.“Food Waste Clause,” he said. We ate the cake together, licking the crumbs off our fingers.Explore Bon AppétitVeganessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-16", "author": ["Condé Nast", "Zoe Denenberg"]}