{"id": "1559ea8e2e5e1b76458c9521afa72ca6", "url": "https://www.bonappetit.com/story/alison-cayne", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Alison Cayne Handles a Cooking School, a Café, a Sauce Business, and Five Kids | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Alison Cayne Handles a Cooking School, a Café, a Sauce Business, and Five KidsThe founder of Haven's Kitchen would eat pasta with bottarga, oil, and garlic every night if she could.By Ali FrancisFebruary 1, 2019FacebookTwitterEmailPhoto courtesy of Alison CayneFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Alison Cayne, manager of Haven's Kitchen and creator of In The Sauce, a podcast on Heritage Radio Network.Today I spent two hours painting while listening to Spotify’s All Out ‘10s playlist. I did an online dance class in my living room and rewarded myself with hummus, butter, and Vegemite on toast (oh, get over it). I paid some bills and sent an invoice because freelance life. And then, finally, I sat on my floor and wrote this piece.In comparison, on any normal day you’ll find Alison Cayne simultaneously managing Haven’s Kitchen—a cooking school, event space, and cafe in a lofty, three story building in Manhattan—while also tending to the needs of her five (!!) children. She might spend some time peddling her brand new range of fresh-made, Haven’s-branded sauces, or organizing an interview at Heritage Radio Network for her podcast In The Sauce. (It’s a show designed to debunk nerdy food-industry challenges in much the same way Haven’s demystifies dinner.)If I’m human, Alison Cayne is Superwoman.The Haven’s mission, Cayne says, is to tackle some of the core issues with big food—that she learned about while getting her masters in food studies from NYU—in a way that isn’t overly intellectualized. “You know, like farm subsidies, the fact that about a quarter of our crops are being grown for fuel rather than food, GMOs, and food deserts,” she says.Exasperated with the lack of general knowledge around these issues, Cayne decided to open a recreational cooking school. “I figured that if the average consumer can learn to cook from home, and use their kitchens to shift the system a little bit, then they don't need to learn all of this stuff—they'll just be making a change every time they make a meal.”Haven’s Kitchen is a unique sanctuary where you can witness biodiversity practices firsthand (using produce sourced from the Union Square Greenmarket), while learning to cook better at home. But, rest assured, Cayne is always wary of things getting too virtuous.  “I love cheese. I really like alcohol. I put gluten in things,” she says.Here, Cayne explains what it’s like to build a physical space from the ground up, how we can put the joy back in cooking, and why she doesn’t believe in competition.What was your original plan for starting Haven’s Kitchen?I’d find a small space in a building, and take people on farmers’ market tours in the mornings. We’d then go back to the kitchen and we’d make a meal. I'd send them out, lock up, and go home. And then I came upon this three-story carriage house, and my face morphed into that emoji with the heart eyes.What did you envision when you first saw it?I immediately imagined this communal beehive, where all things food systems, justice, and love came together. A place where all the movements happening in the food world could have a physical space to exist. While I was picturing it, everyone and their mother was like, \"Very bad idea. Don't do that. Retail sucks. It's a nightmare.\"But you did it anyway?It was 2010-ish, and I had a nest egg, and it seemed to me no bigger of a bet doing this than trusting someone else with it. I met with the landlord. He was like, \"All right, lady. I'm not going to put in any money, but I'll give you a year free rent if you want to go and build it out and get all of the permits.\"There wasn’t a kitchen here already?There was nothing. Everything you see here, I built. Meanwhile, I also built out a forecast of sales based on fully booking three cooking classes a day, seven days a week. Which is hilarious. And I didn't count on my expenses being what they were. But I also didn't count on the events business or our cafe doing so well—because I had no idea.With events, classes, and the café all at once, your model seems complex. Can you simplify why you did it all?I think the cooking classes are the heart. The café is like the big arms that are open to everybody. And the events are like the legs that makes the thing run.And now you retail your own line of Haven’s Kitchen ready-made sauces. Can you elaborate?My rent isn’t getting any cheaper and brick-and-mortars are hard even when they’re doing well. So I kind of looked around saw an incredible team that needed career opportunities and a brand that needed a place to shine. We were already teaching our students how to make all these great sauces and selling them in the store. So it was a bit of a lightbulb moment.Why did you decide on the pouch, not a jar?My mom loves to paint, and she had these squeezy tubes of paint in her studio. And I'm like, \"That makes me feel like painting.\" I thought that maybe I could get people to want to cook by making it a more creative, fun experience. I want people to tap into that freedom of kindergarten, of self-actualizing through cooking a meal.Speaking of, how old were your FIVE kids when you first started building all of this?My oldest was 14, and my youngest was six. And I have, you know, however many in between.How does the whole tribe-of-kids-and-a-demanding-business thing work?I feel like I did my life a little bit in reverse. I got married and had kids at 25, and then started my career at 40. I was very fortunate that when I started all this my kids were a bit older and more self-sufficient. They have needs and time is not 100 percent my own, but I'm not running around with little ones.Do you feel balanced?I hate answering discussions about balance without being very, very mindful of the fact that I have support, and I have a babysitter that can pick up when I can't. But, I think, for me, the more that I have on my plate, the less I can perseverate on one thing. There are times when I'm like, \"This is a little bit much.\" But I think I’d be a helicopter mom without work. And I think work would overwhelm me without my kids.Do you feel like it’s good for your kids, to watch their mom build and succeed at something?My kids, thank goodness, they tell me that they’re grateful for that almost every day. I feel like my job as a parent is basically very simple. It goes back to identity. I don't want them to make decisions based on what I think. I want them to be able to figure out what tummies are telling them, and what they think. To do that, your kids need to know that you ALSO have a self.What’s something you’re still working on?Confidence in myself. For my generation, that was not something we were told to have. We were meant to be a little more self-deprecating and a little more humble. I mean, people would ask me to talk on panels about starting my own business, and I would always ask if they were sure I was the right person.Has anyone given you any advice that’s been instrumental?I believe it was Liz Neumark who told me that competition isn’t real. For example, you could build Haven's Kitchen literally next door to here, and you could have cooking classes and a beautiful loft on the third floor. People might go in for their first cup of coffee, but they're not going in for their second. Because at the end of a day, what makes a place is the energy in the space, your products, and the brand. You can't replicate energy.Do you have any rituals that help you stay sane?I am a fierce guardian of my sleep. I've been known to leave my own dinner party and be like, \"You guys are all welcome to stay. I've got to go nite nite.\" I like taking an Epsom salt bath—they really help me go to sleep. And I read a lot of essays and memoirs.Do you work out?I do Kundalini yoga twice a week, which I think is probably the reason why I am alive. I've been doing it for 14 years, and it got me through a lot of really rough patches in my life. I don't know what it does on a cellular level but...it’s doing it something.What’s in your arsenal of key ingredients?Sesame oil, lemon zest, Maldon. And I'm a Seed + Mill tahini diehard. And I think my sauces, at this point. But all that aside, I would eat pasta with bottarga, oil, and garlic every night of my life if I could.Explore Bon AppétitHealthyishEntrepreneurs Run the WorldInterviewsRead MoreLifestyle'We Were Just a Bunch of Young Hippies Selling Food to Other Hippies'By Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-01", "author": ["Condé Nast", "Ali Francis"]}