{"id": "155d5c308edeac886f16b4b0de223c1a", "url": "https://www.bonappetit.com/story/simple-strawberry-shortcakes", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "These Strawberry Shortcakes Have Only 10 Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Strawberry Shortcakes Have Only 10 IngredientsThe genius is in the constraints.By Adam RapoportJune 11, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When Molly Baz was developing Basically’s Strawberry Shortcakes recipe, I never made it to the syrupy fruit or dollop of whipped cream.I wandered into the Test Kitchen one day around 3 p.m. in a slightly snacky, salty mood. But because it was Coffee O’clock, I also felt like something a smidge sweet. And there on the counter sat a tray of freshly baked, golden brown shortcakes.Bingo.I broke off a corner. And then another corner. Buttery, flaky, salty, slightly sweet—I couldn’t stop. I lifted off the entire roof of the layered biscuit (I mean, we can just call it a biscuit, right?). Then, having gone that far, I gobbled up the bottom half. My afternoon espresso had never met such a fitting partner.Want this letter before it hits the website? Sign up for our newsletter!When you watch the recipe on Basically (filmed in the site’s signature step-by-step videos), you’ll notice that in addition to the standard flour-butter-salt-sugar mixture, Molly incorporates both sour cream and heavy cream. I texted her yesterday to find out why. Here’s what she said:“So the sour cream is the fat and the acid in the shortcake, which is basically a biscuit [See! I told you!], and it activates the baking soda. Essentially replaces the need for buttermilk with something even fattier to provide more moistness to the shortcake. And the heavy cream helps by thinning the sour cream to a drizzleable consistency. I chose to use those two instead of buttermilk because they also play double duty in the whipped cream portion of the recipe. You whip the remaining heavy cream to soft peaks and then stir in a bit more sour cream, which creates a tangier whipped cream. (As always, with the 10-ingredient cap on Basically recipes, ya gotta get smart with your ingredients.)”Molly’s off-the-cuff text revealed why Basically recipes are often my favorites—and why they typically drive chart-topping traffic for bonappetit.com.Because of the vertical’s learn-to-cook ethos, no recipe can require more than 10 ingredients, and the ingredients themselves need to be accessible (no running to three specialty stores in order to cook dinner). Nor can the recipes be that time consuming.The upshot is that our recipe developers are forced to get industrious and resourceful. Turns out the more constraints we apply, the more creative they get.So, in this case, you wind up with a biscuit (excuse me, shortcake) that works as well with in-season macerated strawberries as ripe peaches or blueberries.Oh, and macerated? That just means you hit the fruit with a sprinkle of sugar and a shot of lemon juice ‘til it gets all glazed and gorgeous. Sounds fancy but it isn’t. It’s just Basically.Get the recipe:Basically Strawberry ShortcakesYou can make this classic summertime dessert with whatever seasonal berries are calling your name.View RecipeExplore Bon AppétitAdam NewsletterStrawberryDessertRead MorecookingA Strawberry Dessert for People Who Can’t BakeBy Carla Lalli MusiccookingBet You Can’t Eat Just One Slice of This Strawberry Snacking CakeBy Sarah JampelshoppingSilicone Mats Are So Nonstick, You’d Think They Were Crafted By AngelsBy Sarah JampelcookingGet Lost In the Swirls of This Strawberry-Coconut Ice Cream PieBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-11", "author": ["Condé Nast", "Adam Rapoport"]}