{"id": "155e8728182b65bed497be5a142cca8f", "url": "https://www.bonappetit.com/story/local-bee-pollen", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Local Bee Pollen Is the Only Thing That Cured My Seasonal Allergies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLocal Bee Pollen Is the Only Thing That Cured My Seasonal AllergiesAnd it's a lot more delicious than nasal spray.By Zoe DubnoJuly 6, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI'm not made for the outdoors. April is the cruelest month, breeding lilacs out of the still-cold ground and shooting pollen directly into my face. May through October aren’t any easier: My eyes itch from the moment the first cherry blossom is posted on Instagram until the last of the so-called leaf peepers returns from the north. I’ve taken every antihistamine, nasal spray, and eye drop known to Duane Reade. Only one thing has helped: local bee pollen, eaten by the spoonful, daily.I’m not one of those all-natural woo-woo people. I’ve tried a number of superfoods, powders, and dusts that are meant to clear my skin and boost my vitality, and I’m pretty sure my hair still grows at the same glacial pace and I’m just as “vital” as I’ve ever been. Local bee pollen is the one hippie thing that I can wholeheartedly get behind because it seems to have genuinely improved my quality of life .This bee pollen from Andrew's Honey helps keep my NYC allergies in check.\nPhoto by Chelsie CraigBee pollen is the commonly used term for flower pollen gathered by bees outside the hive.  When they return, they bind the powdery pollen with their saliva to create the packed pellet shape.  Pollen is fed to baby bees as their source of protein, while honey is their carbohydrate source. The saliva breaks down the cell walls of that flower pollen, rendering it more easily digestible. Science!Any bee pollen you consume will be delicious, but only the local stuff has assuaged my allergy symptoms. That’s supposedly because eating bee pollen composed of your allergen partially broken down allows your body to build up an immunity to said allergy. [According to Andrew Coté, founder of Andrew's Honey, which I buy at the Union Square Greenmarket in NYC.  “The basic idea is that if one consumes pollen from that same area where they live and breathe, presumably they’ll build up a tolerance to that pollen. So the next time they breath it in, it won’t be so foreign to their body. If you’re getting a flu shot you’re getting a small amount of the flu virus injected into your body as an antidote to the flu, so it’s the same principle.” These claims are not backed up by the FDA, but your local hippie store proprietor and I both find it to be true. Because of the variations in plant species across the country, eating bee pollen from Ohio hives will do little for allergy sufferers in, say, Colorado.So pick up some local bee pollen at the farmers' market, health food store, or online. You’ll recognize it as granules similar in appearance to Nerds candy, and it can come in a variety of colors based on where you live. My NYC pollen is almost rainbow-colored, while my Connecticut pollen comes in shades of yellow and red. Coté doesn't like to give dosage recommendations but suggests starting small: “The rule of thumb is for an adult person to take a level teaspoon a day and then go from there.”Even if the health benefits of bee pollen are unconfirmed, the flavor makes it a placebo I’m happy to eat on the regular. It tastes like honey’s nuttier, more floral relative. I recommend enhancing your bee pollen experience by throwing it into a smoothie or using it as an ice cream topping. One of my favorite breakfasts consists of sprinkling bee pollen on a thick slice of toast slathered in ricotta, dotted with berries, and drizzled with balsamic. You can't do that with a nose spray.If you have a history of anaphylactic shock or highly allergic to bee stings, it’s best to avoid bee pollen. If you're pregnant, breast-feeding, or on blood thinners, please check with your doctor before consuming.Explore Bon AppétitBee PollenSuperfoodTrendsRead MoreshoppingThis Honey Is Intense and You're Going to Love ItBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-27", "author": ["Condé Nast", "Zoe Dubno"]}