{"id": "157dae594c873907d8cdc1ddcd77dabf", "url": "https://www.bonappetit.com/recipe/brothy-tomato-and-fish-soup-with-lime", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Brothy Tomato and Fish Soup With Lime Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueBrothy Tomato and Fish Soup With LimeBy Andy BaraghaniOctober 26, 20204.3(69)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis sour-salty soup was made for those late-season tomatoes on your countertop about to go bad. They get jammy while the fish poaches. And go ahead, add some greens. Use shrimp! This soup is flexible.Ingredients4 Servings3Tbsp. vegetable oil2medium shallots, finely chopped4garlic cloves, finely chopped2lemongrass stalks, bottom third only, tough outer layers removed, finely chopped2red or green Thai or serrano chiles,finely chopped3medium tomatoes (about 1 lb.), seeds removed, coarsely chopped1¼lb. skinless, boneless cod, haddock,or halibut, cut into 1½\" piecesKosher salt2Tbsp. fresh lime juice1Tbsp. (or more) fish sauce⅓cup coarsely chopped dill, cilantro, and/or basilPreparationStep 1Heat oil in a medium pot over medium. Add shallots, garlic, lemongrass, and chiles and cook, stirring occasionally, until aromatics start to soften but have not taken on any color, about 5 minutes. Add tomatoes and cook, smashing and stirring, until tomatoes have burst and fallen apart and mixture is slightly thickened, about 5 minutes.Step 2Pour 5 cups cold water into pot and bring to a boil. Reduce heat to medi um-low so broth is at a bare simmer.Step 3Add fish to pot; season lightly with salt (you’ll finish soup with fish sauce). Cook until fish is opaque and cooked through, about 4 minutes. Remove from heat; add lime juice and fish sauce. Taste and season with more salt and/or fish sauce if needed. Stir in herbs and ladle into bowls.How would you rate Brothy Tomato and Fish Soup With Lime?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleExcellent recipe.    Our lemon grass was not mature enough so I added  about a tablespoon of lemon zest near the end.  I also left out one cup of water and added back a cup of stock made from the shells of  about 8 shrimp.   Used flash frozen cod.   Served with a crusty bread.    Pretty bueno!Gary DarlinhSan Antonio1/22/2022People who think this dish has no flavor are insane.  Did you taste the broth before adding the fish to make sure it was seasoned correctly? This soup is wonderful. I served it with basmati rice.JackieSeattle, WA11/30/2021This soup is basically a version of Tom Yam Gung without the gung(Shrimp)a Thai fish broth. Great recipe especially being in the west and not having fresh lime leaves or galangal to hand. I put shrimp 🦐 in my dish. Delicious. My wife is Thai and she owns a Thai restaurant and she liked it, can’t be too bad. TedNewcastle uk7/10/2021I make this often and it never disappoints, I definitely salt more aggressively though and I add lots of fish sauce and scallions as well. Don't skip on the herbs, it makes this complete! Well done Baraghani <3TaylorCovina, California5/21/2021This was very simple to make but lacked flavor. I added tomato paste for more flavor and about 2 more tablespoons of fish sauce. I think if you substitute chicken or fish stock for the water that could help and add some tamarind paste too. Unimpressed AnneOakland, CA5/3/2021Love this recipe. I cook a lot of Thai food so I use this as a jumping off point. To the garlic/shallots/lemongrass I added (all are approx measures to taste) 2 tsp of red chili paste (do this to taste, mine is pretty hot), 2 tsp shrimp paste, 2 tbs minced galangal. \nTo the tomato broth I added about 2 tbs of tomato paste\n2 tsp golden mountain seasoning \nA bit more fish sauce than the recipe called for, but I made a big batch \nThin sliced end pieces of Napa cabbage that I had in the fridge \nUsed mint, holy basil, and cilantro as a garnish with the scallions \n\nThis is so quick and easy on a weekday night, it’s in regular rotation at my house! Emma 3/30/2021Just made this tonight. I was craving fish and soup, so it was perfect. I added soy sauce and probably a little more fish sauce than recommended. Then I let it simmer for a good hour, bc I had the time. Add in the fish near the end and had this all over some rice noodles, top with parsley, green onions and some lettuce (veggies life). It was perfect. teeToronto, CA3/27/2021Sadly this was pretty bland - I followed the recipe exactly - added more garlic and added ginger too. Acey22222/21/2021Love this recipe! It’s a weekly staple now. However, I definitely do not remove the seeds from the tomatoes, that’s what gives it the red color and nice brothy tomato flavor. I also use three tilapia fillets and put them in whole. It’s flavorful and they shred apart nicely in the soup. Aliya Minneapolis, Minnesota 1/16/2021Very easy and delicious. I made it 4 times already!. but wondering why the broth is never as red as the first time? Wonder is it different kind of tomatoes or what... It is almost like Tom Yam but so much easier to make.MarthiDallas, TX1/15/2021So delicious.  We belong to an Alaskan fishery CSA and we were able to showcase some of that fish in this wonderful soup.  Came together really fast and the flavors were bright and warming.  Will definitely make this again.AnonymousArlington Heights, IL12/31/2020oops. just used what was on hand to throw this together really fast. \nred chili flakes instead of chiles, halfish really ripe tomatoes, half tomato paste, lime juice from a jar, plus a pinch of sugar, no finishing herbs. \nit works this way, was extremely easy and tasty. will try it out as written next time if a certain husband doesn't forget the basil when he goes to the store. Lyndon S.Athens, GA12/30/2020I am studying the recipe again and I don't know where I went wrong. I found this soup really bland and the broth was way paler than in the photos. Maybe too much water? I tried to modify it as others did with extra tomatoes and a bit of sugar. Still meh. I added a bit of soy sauce too and topped it with extra fresh herbs at the end. Ended up OK but I don't think I'll give it another try. Gabrielle GMontréal12/19/2020Why am I not able to print this recipe? Anonymousgainesville ga11/14/2020taste really good , but for my personal preference it needs more garlic Anonymousindonesia11/12/2020Explore Bon AppétitSoupSoups and StewsTomatoVegetableFishSeafoodEasyQuickOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-26", "author": ["Condé Nast", "Andy Baraghani"]}