{"id": "158a318401d13dfa5c639dd2228e4c20", "url": "https://www.bonappetit.com/city-guides/montreal/venue/mon-lapin", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Mon Lapin Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealMon LapinLaid-back vibes and cool natural wines in Little ItalyFacebookPinterestTwitterEmailTwo Food Photographers GO HERE: for uncommon natural wines and vegetable-focused food from chef-partner Marc-Olivier Frappier  and chef de cuisine Jessica Noël, an alum of Blue Hill at Stone Barns in New York. Here at Mon Lapin, they transform local produce into simple but sophisticated small plates.ORDER: whatever appeals to you from the daily-changing menu. The tiny open kitchen behind the four-seat bar puts out beautiful vegetable-centric small plates, fresh pastas, a few larger proteins, and particularly refined desserts served on vintage plates. Mon Lapin offers a small selection of wines by the glass, listed on the wall mirror, but sommelier Vanya Filipovic puts together an extensive bottle list celebrating small winemakers who use minimal intervention as an approach.THE VIBE IS: relaxed. The small light-filled space has only about ten tables, but the leather benches, white walls, and occasional piece of rabbit paraphernalia tucked into a corner give it an open feel. You’ll find hip, tattooed Montrealers sipping unfiltered orange wine with Fleetwood Mac playing in the background.PRACTICAL STUFF: Open Tuesday to Saturday 5 p.m. to midnight. Closed Sunday and Monday. Tables are first come, first served, so go early (as in before 6 p.m.) on Saturdays.—Claire SaffitzTwo Food PhotographersTwo Food PhotographersWE ALSO LOVEJoe BeefAn over-the-top meal unlike any other, in Little BurgundyLe Vin PapillonLittle Burgundy’s natural wine hubFoxyA perennially packed wood-fired hangout in GriffintownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}