{"id": "159141031dca476d8c6e6e1f4732fd2c", "url": "https://www.bonappetit.com/recipe/bas-best-bolognese", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Best Bolognese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2019 IssueBA's Best BologneseBy Andy BaraghaniJanuary 7, 20194.7(440)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintIt doesn’t take a lot of ingredients (or a lot of money) to make a classic Bolognese recipe. What it does take, though, is patience for the sauce to achieve the ideal authentic texture. You’re going to go low and slow—it’ll take around 3 hours, but most of that cook time is hands-off. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonDutch Oven$80 At AmazonTongs$13 At AmazonIngredients4 servings1medium onion, chopped1celery stalk, chopped1small carrot, peeled, chopped3Tbsp. extra-virgin olive oil1lb. ground beef chuck (20% fat), patted dryKosher salt3oz. thinly sliced pancetta, finely chopped1cup dry white wine⅓cup tomato paste1bay leafPinch of finely grated nutmeg2cups (or more) homemade chicken stock or low-sodium chicken broth1cup whole milk1lb. fresh tagliatelle or pappardelle, or dry rigatoni2oz. finely grated Parmesan (about ½ cup), plus more for servingPreparationStep 1Pulse onion, celery, and carrot in a food processor until very finely chopped. Transfer to a small bowl.Step 2Heat oil in a Dutch oven or other large pot over medium. Break beef into small clumps (about 1½\") and add to pot; season lightly with salt. Cook, stirring occasionally but not breaking meat apart, until beef is lightly browned but not crisp, 6–8 minutes. It may be gray in spots (that’s okay!) and still a little pink in the center. Using a slotted spoon, transfer beef to a medium bowl.Step 3Wipe out pot. Cook pancetta in pot over medium heat, stirring occasionally, until pancetta has released some of its fat and is crisp, 6–8 minutes. Add onion mixture to pot and cook, stirring occasionally, until vegetables are very soft and beginning to stick to surface, 6–8 minutes.Step 4Return beef to pot and pour in wine. Reduce heat to medium-low and cook, smashing down on beef with a wooden spoon, until wine is evaporated, surface of pot is almost dry, and meat is finely ground, 12–15 minutes. (The meat should be reduced to what looks like little bits. It takes a bit of effort, but you can take breaks.) Add tomato paste, bay leaf, and nutmeg and cook, stirring occasionally and still pressing down on meat, until tomato paste is slightly darkened, about 5 minutes.Step 5Pour stock and milk into pot; add a pinch of salt. Reduce heat to the lowest setting and cook, uncovered and stirring occasionally, until meat is very, very tender, 2–2½  hours. There shouldn’t be any rapid bubbles at this stage. Instead, the sauce should release the occasional small bubble or two. When finished, the sauce should have the texture of and look like a sloppy joe mixture. If the liquid reduces before the meat is completely tender, add an extra ½ cup stock and continue cooking. Discard bay leaf. Taste sauce and adjust seasoning with salt; keep warm.Step 6Cook pasta in a large pot of boiling salted water. If using fresh pasta, cook about 3 minutes. If using dry, cook until very al dente, about 2 minutes less than package directions.Step 7Using tongs, transfer pasta to pot with sauce. Add 1 cup pasta cooking liquid and ½ cup Parmesan. Increase heat to medium, bring to a simmer, and cook, tossing constantly, until pasta is al dente and liquid is slightly thickened, about 2 minutes.Step 8Transfer pasta to a platter and top with more Parmesan.Do Ahead: Sauce can be made 4 days ahead. Cover and chill.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate BA's Best Bolognese ?Leave a ReviewTell us what you thinkReviews (204)Back to TopTriangleLove the method—works well for plant based/vegan folks. \n\nSo I had some impossible burger and thought about bolognese, and stumbled across this recipe. Made a few substitutions and additions (nutritional yeast), but overall adhered to the recipe and method. I’m OBSESSED and the creaminess and umami are off the charts. I’ll be making it again soon.\n\nHere are my substitutions for anyone interested:\n\n(1-for-1)\n\nImpossible burger - beef\nTofurky smoked ham - pancetta\nBetter than bouillon broth - chicken stock\nHomemade cashew milk - milk\nSparkling apple cider - white wine \nVegan pasta\nOmitted Parmesan JJCharlotte, NC3/5/2022Quite outstanding. I was skeptical at first--white instead of red wine, nutmeg and no garlic, oregano or basil. But it's all worth it. Since it's time consumming, I doubled the recipe so that I could freeze it for another memorable dinner.SandrineFairfax, Virginia2/13/2022This is without a doubt the best bolgonese recipe there is. It’s my go to and my husbands favourite meal. Simple. I also add a pd of pork and sometime veal or a bit of fresh rosemary but the rest I stick to. Excellent recipe, but yours always are. Do thanks Anonymous2/9/2022Stumbled upon this a couple of years ago when I really wanted make a good bolognese for a few friends. This was so awesome! There was none left. I used guanciale instead of pancetta, because that’s what was available, but I would change any thing else. It’s also very versatile; I use in my lasagna. ravioli and linguine, and it freezes well. Definitely a winner.C MariaGlasgow, Scotland2/6/2022I’ve made this numerous times now. I follow the recipe exactly and I and my husband thinks it’s the best bolognese we ever had. Sometimes the meat is hard to shred, but that’s the meat or me. Lol Thank you for sharing your talent! Delicious! Rockys MomPittsburgh,PA2/6/2022I did this with Impossible 'Burger' and it turned out really well.  My only changes when using the plant-based protein would be to reduce the stock at the end to 1.5 C - or just know that it will be closer to a 3+ hour reduction time.  Also, decrease the salt a bit.  Great recipe!RaeganAtlanta, GA2/6/2022Delicious recipe, have made numerous times now and follow the recipe exactly - yes even with white wine!! It does give more of an orange colour but who says bolognese has to be red? An absolute winner with my whole family, it is a little time consuming but all the preparation is done at the start so you just just have to sit back and let all the delicious aromas fill your home ( with the odd stir every now and again ) I serve it with fresh shop bought tagliatelle and warm french baguette to mop up all those lovely juices 😋 I always make double the quantity as it freezes really well.Nicola Nottingham, UK2/5/2022This is a wonderful weekend cook on chilly days. Freezes beautifully for M-F. But the best thing about this simple recipe is that it tastes just like the Bolognese my Italian friend makes, because he \"could not find the food mia madre makes in America\". He learned to prepare many of his mothers' meals and this is one of his dishes that stole our hearts.\nAlso, I found that some picky kids like it alot, I think, because the meats and veggies are all pummeled into small bits that are easy to eat and served with big noodles!Mommy and the MoonpiesAtlanta, Georgia1/30/2022Made this yesterday during the blizzard in Boston. It takes a long time but its easy. Followed recipe to a T except used 2% milk vs whole, and cinnamon instead of nutmeg since this is what I had in stock. Oh, and used red wine for white. It was yummy - flavorful and gorgeous consistency. Def restaurant quality.  Thank you BA!MaryellenBoston1/30/2022Excellent flavor. It definitely takes time but worth it.AnonymousMaryland 1/30/2022Looks really good will try.\nVery happy with the one I already make because its versatile for beef/turkey/chicken.\nCurious, is milk necessary?  I have a dairy free needs in my house.\nAnd if using beef, isn't beef stock a better pairing?AnonymousBC Canada1/29/2022AMAZING !!!  Have never actually made Bolognese \"proper\" before ... highly recommend this recipe !PatriciaRtoronto, on1/19/2022Best Bolognese recipe I have found! I made this with a vegan ground beef substitute, and omitted the pancetta. I substituted red wine for white and added 1tsp of sugar and 2 tbsp of butter to add richness lacking from the meat. I can’t stress enough how much it tasted like the real thing. It was absolutely delicious! CarolineBerlin, Germany1/11/2022Bolognese sauce is one of my go to’s when I’m dining Italian. I have attempted 3 times to make Bolognese, and I have always been disappointed. My son tried your recipe over the Christmas holiday ( because it is my fav sauce, so sweet) and we were all ecstatic over the flavor. It was so so very close to the one I had in Italy. I knew when I saw the color of the sauce while it was cooking, it was going to be a winner. I made it when I got home and was thrilled the results matched my sons. Thanks BA for fulfilling my Bolognese sauce recipe to have and to eat :)\nSharon Cox\nSharon CoxGrosse Pointe, MI1/8/2022Best Beef Bolognese I’ve made (superior to Marcella Hasan recipe).\n\nI did not have a carrot so substituted a peeled apple - turned out beautifully, very faint sweetness.\n\nAlso used almond milk in place of regular - also worked beautifully. \n\nMy husband LOVED it.AnonymousNew York1/7/2022Explore Bon AppétitPastaItalianEuropeanGround BeefBeefMeatPancettaCured MeatTagliatellePasta & NoodlesPappardelleRigatoniMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-07", "author": ["Condé Nast", "Andy Baraghani"]}