{"id": "159a096649bdc1614b87b2071806f4bb", "url": "https://www.bonappetit.com/story/atomix-white-kimchi-gibson", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "This White Kimchi Gibson at Atomix in NYC Changed My Martini-Drinking Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis White Kimchi Gibson Changed My Martini-Drinking LifeThe bar at Atomix in New York City combines my two favorite things: Gibsons and kimchi.By Rachel KartenDecember 3, 2019FacebookTwitterEmailPhoto by Diane KangFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I grew up in a martini household. When I was eight, my parents would drink their martinis while I sipped my “watini”—water and olive juice with a toothpick threaded tightly with olives. Now, at 28, I’m an avid martini drinker, swapping the water for gin and vermouth but definitely keeping the salty, briny olive juice to cut the sharpness of the gin. Which is why I was truly delighted when I sat down at the bar of Atomix in New York City and saw a very delicious sounding riff on the drink: a white kimchi Gibson.To back up, a Gibson is a martini but with a pickled pearl onion garnish instead of olives or a lemon twist. But Atomix’s version goes way beyond that. The restaurant uses Letherbee Gin, a basement-moonshinery-turned-distillery based in Chicago (that was just featured in BA’s gift guide!), as the base for the cocktail. Next, cilantro-infused vermouth (cilantro steeped in a bottle of Dolin Blanc for four days), which adds a fresh herbiness to the whole shebang. And then my favorite part: The bartender adds white kimchi juice, a byproduct of the kimchi made in the Atomix kitchen. It has all the pickle-y flavors of kimchi, minus the heat, and mimics the pearl onion pickling liquid but with a more vegetal flavor. All of that is then stirred with ice and strained into a coupe glass, and garnished with the crunchiest piece of mu, a radish kimchi, and coriander flowers.Oh, and no, you don’t have to sit through the 10-course dinner at Atomix just to try this drink. The minimalist bar is open for walk-ins Tuesday through Saturday. I have a feeling my new Friday night power move is going to be a white kimchi Gibson. Sorry, martinis! But I think I’m moving on.Go there: AtomixExplore Bon AppétitHighly RecommendNew York CityCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-03", "author": ["Condé Nast", "Rachel Karten"]}