{"id": "159def8cb37feae43e677da6d5fb1975", "url": "https://www.bonappetit.com/recipe/classic-skillet-cornbread", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Classic Skillet Cornbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueClassic Skillet CornbreadBy Claire SaffitzJanuary 9, 20183.3(4)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintDon’t expect something sweet and muffiny here. We follow the three tenets of traditional Southern cornbread: There's no sugar added, there's no flour (only course-ground cornmeal), and there's no better way to bake it than in a cast-iron skillet. This rustic cornbread is sturdy and dry and meant to be dunked, like say in this beef chili. Serve it with this hot honey butter.This recipe is presented to you by Samsung.Ingredients12 servings 2½cups coarse-grind cornmeal1¼teaspoons baking soda1¼teaspoons kosher salt1large egg1⅔cups buttermilk2tablespoons bacon fat, lard, or unsalted butterHot Honey Butter (for serving)Special EquipmentA 10-inch-diameter cast-iron skilletPreparationStep 1Preheat oven to 375°. Set dry skillet over low heat to heat while you make the batter. Whisk cornmeal, baking soda, and salt in a medium bowl. Make a well in the center and add egg and buttermilk, then whisk vigorously, starting in the center to incorporate egg and working your way out, until dry ingredients are incorporated and batter is smooth.Step 2Increase heat to medium-high and add bacon fat to skillet. Swirl to coat bottom and sides of skillet. Whisk batter once more to reincorporate, then pour into skillet and smooth top (batter will sputter around edges).Step 3Bake cornbread in oven until the edges are golden brown and the top is golden, cracked in places, and firm to the touch, 25–30 minutes. Let cool in pan at least 5 minutes before cutting into wedges. Serve with Hot Honey Butter.Step 4Do Ahead: Cornbread can be baked 8 hours ahead. Let cool; store tightly wrapped at room temperature.How would you rate Classic Skillet Cornbread?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleComes together super quick and easy! Very dry but pairs great with chili.KatiehwalshAustin4/10/2020Delicious! Pairs well with chili or good as a snack. Soaks up sauce nicely. Love that it’s not sugary or uses wheat flour. StellacookingBronx ny10/20/2019It was too dry for me! AnonymousMassachusetts 2/4/2019Explore Bon AppétitBreadSouthernAmericanCornmealFlourButtermilkOther IngredientsBaconCured MeatMeatQuickEasySideGluten-FreeNut-FreeBakingJuneteenthNew Year'sBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Claire Saffitz"]}