{"id": "15cd166d77504eed5c20fc78b42eddf2", "url": "https://www.bonappetit.com/city-guides/boston/venue/bar-mezzana", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Bar Mezzana Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginbostonBar MezzanaWhere handmade pastas and tiki drinks somehow pair perfectlyFacebookPinterestTwitterEmailPhoto by Brian SamuelsGO HERE: to eat Italian food in the South End. Go for the crudo, a unique bar program with equal parts spritzes and tiki cocktails, and, oh yeah—pasta.ORDER THE: hand-pulled mozzarella and buttery aged prosciutto, and ask for the grilled bread used for crostini on the side. Sample the chef’s tasting of 11 rotating crudos, from beautiful razor clams with chili and mint to striped jack with a horseradish-caviar-chive topping. Then share an antipasti, like an Italian wedge with speck or grilled octopus with potato and olives. But save room for all the pasta you can handle: handmade options like peppery bucatini carbonara, snail-shaped lumache with brown butter-sautéed mushrooms and house-cured bacon, and biiiig tubes of paccheri with lobster, scallions, and tomato.Beverage pairings are available for $30 to let the bar team guide you with a selection of wines or—surprise!—tiki cocktails. Yep, that means Smoothie Moves (avocado-infused vodka, kale, lime, and a spicy breadcrumb rim to mimic avocado toast) or Three Men in a Tub (blueberry basil shrub, cachaca, white rum, lime, and eucalyptus). Sounds cheesy, but just go with it.Photo by Brian SamuelsTHE VIBE IS: completely different at the bustling bar, where you could see yourself at on a random Tuesday night just for mozzarella and Mai Tais. The spacious, blue-hued dining room is where to take your parents.PRACTICAL STUFF: Reservations available via OpenTable or by phone at 617-530-1770. Open Sunday through Wednesday from 5 p.m. to 10 p.m. and Thursday through Saturday from 5 p.m. to 11 p.m. Brunch is served 11 a.m. to 3 p.m. on Sundays.—Alyse WhitneyPhoto by Brian SamuelsPhoto by Brian SamuelsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-02-14", "author": ["Bon Appétit"]}