{"id": "15d1ba52ef73873c538bce1694078939", "url": "https://www.bonappetit.com/recipe/lime-lemongrass-slushies", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Lime-Lemongrass Slushies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueLime-Lemongrass SlushiesBy Leela PunyaratabandhuJuly 6, 20215.0(1)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis tart-sweet frosty slushy is one of cookbook author Leela Punyaratabandhu’s favorite things to drink with just about any Thai dish, though it would be welcome at any summer cookout. Try to seek out whole lemongrass stalks that have the meatier bulbous parts near the root ends intact; you can find them in some grocery stores and most well-stocked Asian markets. Pair this with Leela’s summery menu for Grilled Pork Shoulder Steaks With Green Pepper Relish, Khao Niao (Thai Sticky Rice), Cantaloupe With Spicy Bacon-Cashew Crumble, Cucumber, Tomato, and Green Bean Salad, and Grilled Scallops With Peach Sweet Chili Sauce. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCitrus Juicer$7 At AmazonMesh Sieve$13 At AmazonWhisk$10 At AmazonSmall Saucepan$155 At AmazonIngredients4 - 6 Servings4lemongrass stalks, tough outer layers removed, bottom 4\" thinly sliced, tops reserved½–¾cup honey1½cups fresh lime juice (about 12 limes)¼tsp. kosher saltLime wheels (for serving)PreparationStep 1Bring sliced lemongrass and 1½ cups water to a boil in a small saucepan. Reduce heat to medium; simmer 1 minute. Remove from heat and whisk in ½ cup honey for a tart-sweet slushy and up to ¼ cup more for a sweeter slushy. Let cool.Step 2Strain syrup through a fine-mesh sieve into a blender; discard lemongrass. Add lime juice, salt, and 4 cups crushed ice and blend on high just until slushy. (Be careful not to blend too long or mixture will turn watery.)Step 3Divide among tall glasses. Garnish with lime wheels and reserved lemongrass tops.How would you rate Lime-Lemongrass Slushies?Leave a ReviewTell us what you thinkExplore Bon AppétitCold DrinkDrinks AllLimeCitrusFruitLemongrassHerbs & SpicesSummer5 Ingredients or FewerDrinksDairy-FreeGluten-FreeNut-FreeVegetarianNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}