{"id": "15d200be9e9d6a31eb0e5ba47468bfbd", "url": "https://www.bonappetit.com/story/italian-food-philly-irish-pub", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "When I’m Craving Italian Food in Philly, I Go to…Murph's, an Irish Pub? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen I’m Craving Italian Food in Philly, I Go to…an Irish Pub?Welcome to Murph’s, where the Guinness is plentiful and the Bolognese is perfect.By Alex DelanyApril 16, 2019FacebookTwitterEmailPhoto by Jason VarneyFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.The first time I heard about Murph’s Bar I was sitting on a stool at Johnny Brenda’s, halfway through my third (possibly fourth) beer, listening to my friend spout nonsense.“It’s an Italian red sauce joint inside of an Irish pub. There’s only one guy that works in the kitchen. He cooks everything. He’s from Italy. It’s always slammed. There are hardly any seats. You have to go early on a weeknight if you want to get in without waiting for like...two hours. It’s affordable. There’s a weird, vague Elvis theme. It’s across the street.”Uh, what? Elvis? Pasta? Are you sure? Wait. It’s in an Irish pub?A quick visit to the restaurant’s website (read: Facebook page) and Google image gallery substantiated my friend’s claims. The poorly lit photos looked good in the way that Bolognese looks good after your third beer.In case the Irish-Italian mix wasn’t enough, you’ll find a splattering of Elvis memorabilia in the bar for a bit of retro Americana splendor.\nPhoto by Jason VarneyWe should go. Like, right now.And we went. Well, we showed up. We didn’t eat, because it turned out that my friend was also right about it being slammed on a Saturday night. All of the chairs in the small room just beyond the back of the bar were filled with people, their tables filled with pasta. We walked a few blocks and ate pizza instead, and I went to bed dreaming of the red sauce I saw on the internet.I’m not the type to watch dreams float by. So I did eventually eat at Murph’s. I ordered fried zucchini flowers and octopus salad and sausage and Bolognese and garganelli with braciola, while making nervous eye contact with the inexplicable Elvis Presley statue next to an Irish flag behind the bar. I ate my food. I drank a Guinness. And an $8 glass of Nero d’Avola. I ate a cannoli. And I enjoyed myself. But the entire time, I was quietly thinking, What the hell is this place? How did someone create a bar/restaurant that so perfectly speaks to me, an Irish-Italian-American? And who is making this food?At Murph’s, ordering a Guinness with your pasta is not only possible, it’s encouraged.\nPhoto by Jason VarneyFrancesco Bellastelli came to Philadelphia from Puglia (the heel of the boot) to be with his wife and her family, and he’s been cooking at Murph’s for about five years. He is the man who is making this food. He prefers to speak Italian (his answers for this interview were translated by his wife), and he drank at Murph’s before he ever cooked there.“My neighbor, my wife’s cousin, and I were at Murph’s having a drink. They were regulars. I got hungry and wanted to eat, but the bar didn’t serve food,” explains Bellastelli. “We eventually talked to one of the owners, and he said he had an empty kitchen downstairs and asked if I would be interested in renting it.”Bellastelli was interested. He began renting the unused kitchen space from the bar’s owners, Theresa and Greg Walton, in 2014, and a mutually beneficial relationship blossomed. The Waltons had a new stream of customers coming into the bar, in search of Italian food, and Bellastelli had the opportunity to serve burrata, orecchiette, octopus salad, and other dishes from his region of Italy.Chef Francesco Belastelli, the man from Puglia.\nPhoto by Jason Varney“In the beginning, I think people would get confused,” says Belastelli about the patrons walking into an Irish pub and finding ravioli. “But now they come for the Italian food and drinks. I feel very fortunate that it has been so popular, and that I found Theresa and Greg. Without their open-mindedness, this probably wouldn’t have worked.”It also wouldn’t have worked without good food.Six days a week, Belastelli works from 6:30 a.m. to 11 p.m., making classics like seafood manicotti (the restaurant’s most popular dish) and the Amatriciana (one of his personal favorites). It’s unfussy, plated without the consideration of a fine dining establishment. And it’s not always totally Italian: On St. Patrick’s Day, he makes ham and cabbage arancini to marry his Italian heritage and his Irish digs in a more direct sense.What else would you expect to eat at an Irish pub in Philadelphia while sitting across the room from a lamp shaped like Elvis Presley?Alex Delany is an associate editor at Bon Appétit.Explore Bon AppétitRestaurantsRed SauceItalian AmericanPhiladelphiaRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Delany"]}