{"id": "15e0df14fd804aa1bf113e51603c6f39", "url": "https://www.bonappetit.com/recipe/lentil-smothered-greens-on-fried-bread", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Greens on Fried Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueLentil-Smothered Greens on Fried BreadBy Molly BazJanuary 7, 20204.9(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintRed split lentils cook even more quickly than other types, making them ideal for weeknight dinners. Turn them into a meal by pairing with savory spiced greens.Ingredients4 servings⅔cup plus 2 Tbsp. extra-virgin olive oil; plus more for serving1medium onion, finely chopped1fennel bulb, finely chopped2celery stalks, finely chopped11garlic cloves, 10 smashed, 1 left whole¾tsp. crushed red pepper flakes1½tsp. smoked paprika, plus more for serving1tsp. kosher salt, plus more½cup red split lentils2bunches hardy greens (such as mature spinach, kale, and/or Swiss chard), stems removed, leaves torn into large pieces1lemon, halved4thick slices country-style breadPreparationStep 1Heat ⅔ cup oil in a large Dutch oven or other heavy pot over medium. Add onion, fennel, celery, and smashed garlic and cook, stirring often, until softened but not browned, 8–10 minutes. Add red pepper flakes, 1½ tsp. paprika, and 1 tsp. salt and stir to combine. Add lentils and 1¼ cups water and stir again, scraping down sides of pot so that all of the lentils are submerged. Lay greens on top of liquid, but do not stir or toss them in. Cover pot, reduce heat to medium-low, and cook until lentils are just cooked through and greens are wilted, 10–15 minutes.Step 2Uncover pot and stir mixture a few times to coat greens. Simmer until most of the liquid is evaporated and lentils are saucy (not brothy), about 2 minutes. Squeeze juice of a lemon half into lentils. Taste and season with more salt if needed. Cover and keep warm.Step 3Heat 1 Tbsp. oil in a large nonstick skillet over medium-low. Add 2 slices of bread and cook until golden and crisp underneath, about 5 minutes. Transfer to plates and turn fried side up. Repeat with 1 Tbsp. oil and remaining bread. Rub fried side of each slice with remaining whole garlic clove; season with salt.Step 4Generously spoon lentil mixture over toast; drizzle with oil and lightly sprinkle with more paprika. Cut remaining lemon half into wedges and serve alongside for squeezing over.How would you rate Lentil-Smothered Greens on Fried Bread?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleSOOO GOOD. Probably one of the best things I've ever eaten. \n\nWe modified the recipe a bit. We used only a couple tbsp oil, and cut the garlic in half (3-4 large cloves). We also don't like fennel so we left that out. \n\nThen we toasted some buns in the oven with butter and minced garlic, then ate it like a dip. \n\nI would highly recommend!! SarahBarrie, Ontario 8/15/2021This recipe was so delicious that I just sent it to some of my family and friends.  I made some changes - greatly reduced the oil (and the garlic, although we do like garlic) used sumac and Aleppo pepper in place of the red pepper flakes. I replaced the fennel with additional celery. I also took another cook's suggestion and replaced half a cup of the water with white vermouth.  It was easy and quite fast.  I was pleasantly surprised by the way that the cooking method (and I guess the acid) softened even the kale stems. Thank you for this terrific recipe.Short CookNew York7/15/2021Any advice as to whether i can freeze this?Rose7/3/2021Love this recipe! I’ve made it many, many times already. I actually use the entire fennel including the stems but add the fronds at the end as a garnish.  I add more lentils, 3/4 cup - 1 cup and more water so the lentils soak it all up. Agree with keeping the bread separate and using it to scoop but the lentils so it stays crunchy. I like lots of garlic on the bread so I grate the garlic cloves (I use 2-3) and spread it on the bread to get the flavor. AnonymousSan Diego, CA5/3/2021I absolutely loved this recipe, for one, it made me believe that there can be non-indian \"dal\" (i.e. lentils) preparations which can be amazing, and two that you can add lentils on a ciabatta and it can taste that good! This was also the first time I got a fennel bulb in my kitchen, which I had been meaning to try for long, and absolutely loved the fresh flavor. I made a slight addition- made a plain yoghurt  mixed with harissa dip which I spread on the toast first, before topping it with the prepared lentils, and it added this tangy-spciy kick to the whole dish! Simoni JainChicago,IL1/25/2021bon appetit, you create some amazing recipes. but this...THIS...it's heavenly. pure delight. i am so impressed & will be making this for YEARS TO COME!!!AshChicago, IL12/29/2020This is an amazing recipe for a healthy weeknight meal that feels warm and hearty with all the right flavors. I eat kale and I eat lentils, but I'd never thought of steaming my greens on top like this! Its easy, it tastes impressive, and it's helping me get through the holidays without a Santa gut. Gaby Portland, OR 12/22/2020I was kind of skeptical of this recipe when I tried it during a challenge of one week of vegan dinners but holy hell did it knock all our socks off and become a weekly must do. I’m not even a huge fan of either lentils or kale but the flavor in this is something else entirely - a perfect melange. It’s also an ideal “kitchen sink” recipe for any unused veggies in your crisper and comes together quickly and easily. If they’re hard throw them in with the onions, if soft with the greens. I don’t care for fennel so I double the celery or throw something else in like carrots. Also subbing yellow lentils for red (couldn’t find red one time) works perfectly. I don’t bother frying the bread at all I just eat it on toast or plain, but I do like to rub the bread with garlic. Almost never find it really needs additional lemon or paprika upon serving. An absolute must try. BananaMartiniPhiladelphia, PA10/17/2020Love this recipe for weekly lunches. In fact, after making my first batch, I froze a bunch and found the thawed stuff to be just perfect.\nMaybe don’t overcook after the kale goes in, as if the batches I’ve made so far, I’ve preferred more liquidy ones, where I more carefully observed the 10-15 minute cook time.monobrownVancouver, BC4/20/2020This is my favorite new recipe, hands-down. It is so hearty and flavorful, and just happens to be vegan. I've made this dish twice in the last two weeks and have sent this recipe to all of my close friends and family. 11 cloves of garlic don't let you down!AnonymousLos Angeles4/9/2020This is SO GOOD and a go to recipe for me. Can I switch out the red lentils for green lentils tho? Red can be harder to find...\n\nAlso bread burns easily! So be careful...\nAnonymousWashington, DC3/30/2020Definitely a keeper. I didn't have fennel or celery and this was still fantastic. Used hot smoked paprika from Spain so nixed the crushed reds. Great way to use up odds and ends in the kitchen. AnonymousDC3/30/2020This was surprisingly good! it’s a go-to recipe for me now! I’ve made it with beans instead of lentils and also just threw in any greens and alliums in the bottom of my veg drawer. Also holds over well as leftovers California3/29/2020I love this recipe! I've made it twice now. The first time I made it with no modifications, other than easing back a bit on the amount of olive oil used to sauté the vegetables. The second time I made it I had all the ingredients on hand except fennel, so I substituted two diced carrots--it was equally delicious! This will definitely be a frequent recipe in the rotation. AnonymousCalistoga, CA3/24/2020This is hands down the best recipe from BA - and I’ve done a lot of them. Made it for myself, then family, then friends and all cite it as absolutely delicious. Give it a go, at least!Anonymous3/11/2020Explore Bon AppétitKaleLeafy GreensVegetableSwiss ChardRed LentilLentilWeeknight MealsMainDairy-FreeNut-FreeVegetarianVeganHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Molly Baz"]}