{"id": "15e44d35e62225b596db6ee98313dae7", "url": "https://www.bonappetit.com/story/simple-turmeric-curry-recipe", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "This Simple Turmeric Curry Tastes Like You Spent Hours at the Stove | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Simple Turmeric Curry Tastes Like You Spent Hours at the StoveHere's how to make it perfect—and what not to do.By Carey PolisJanuary 4, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.My ideal weekday dinner involves some version of crispy ground meat, rice, and fresh herbs. It may not be a new concept, but it pairs incredibly well with \"house pants\" and my couch. This pork turmeric curry hits all of those notes. It meets the done-in-under-30-minutes mark while tasting as if the meat was simmering in a complicated curry sauce for hours. It's nourishing, it's low-key healthy, and it's easy to make.Unless you're me. Because the first time I made it, I messed up this actually incredibly simple recipe by taking way too many shortcuts.Overconfidence is never a good look, especially when the end result is a bland meal that results in a \"I don't like this\" from your husband who regularly eats water-packed tuna straight from the can. But this was on me—senior food editor Chris Morocco would never develop a dud recipe. So we cooked through the dish together, and with just a few small tweaks, created a way better dish. Think Lady Bird versus The Emoji Movie contrast levels.The first step of the recipe is to massage the Napa cabbage. That means really squeezing the cabbage hard to get out the liquid, rather than my weaksauce definition of \"massage\" which was more like a heavy toss in a bowl. What I was originally left with was cabbage that didn't break down or absorb salt, and thus just didn't really add anything to the dish at all except some not particularly pleasant chewiness.Then, brown ground pork in a large saucepan. Not a wide skillet, which results in too much evaporation and essentially no liquid at all for what was supposed to be a thick curry. Cooking equipment matters.Third mistake: Slicing onions to add to the pork. Despite having sliced hundreds if not thousands of onions in my life, I still have more to learn. My slices were too thick, which resulted in the onions not cooking down enough, not browning, and thus not building enough flavor in the curry. Also, I sliced the onions against the grain (good for brisket, bad for alliums) which led to uneven cuts and uneven cooking time. Shame, Carey. Shame.Finally, when recipe instructions say cook garlic and chiles for 4-5 minutes, don't cook for 2½ minutes because you're hungry and the ingredients seemed... cooked enough. Cutting short cooking time limits the amount of flavor that will build in a dish. Hence, the blandness. And the unpleasant taste of raw garlic.These all might seem minor in the scheme of things—I didn't light my kitchen on fire, scorch a pan, or create something inedible. But when you're cooking a recipe that is deliberately supposed to be healthyish—and therefore not full of fat or sugar to make everything automatically taste better—you can't take these kind of shortcuts, Chris explained.My second go-round cooking, when Chris was offering suggestions as I cooked, resulted in a dish so tasty that the entire Test Kitchen team was commenting on how great it was. And really, the only major difference in what I did was to read a little more closely, and take a little more time when prepping and cooking.So when you cook this curry, don't rush because you're hungry, or take shortcuts just because you think it won't make a difference. Respect the recipe as its written. And, in my case, check your cooking ego at the door.Get the recipe:Turmeric-Coconut Curry with PorkInstead of just using plain rice, make your own medley! Try a mix of white rice, millet, and/or quinoa, which all cook in about the same time. You can also sub kale for the Napa cabbage.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanPorkCurryCoconut MilkRead MorecookingThese Crispy Chicken Thighs Are the Healthy Comfort Food You DeserveBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Carey Polis"]}