{"id": "15ebc7de1adb18f93cc8f2d05e1eb5d2", "url": "https://www.bonappetit.com/recipe/butter-basted-rib-eye-with-crunchy-fennel-salad", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Butter-Basted Rib Eye Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueButter-Basted Rib Eye with Crunchy Fennel SaladBy Carla Lalli MusicJune 1, 20194.9(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintRich marbled meats are extra-delicious when served with cool, crunchy, acidic vegetables. It's a fact, and the combo never gets old. Bone-in strip steak or a T-bone are great choices here too. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients3–4 servings12\"-thick bone-in rib-eye steak (about 2 lb.)Kosher salt, freshly ground pepper⅓cup extra-virgin olive oil, plus more3Tbsp. unsalted butter4garlic cloves, 3 smashed, 1 finely grated2–3sprigs rosemary3oil-packed anchovy fillets, finely chopped2Tbsp. white wine vinegar2fennel bulbs, woody tops trimmedAleppo-style pepper (for serving)Flaky sea saltPreparationStep 1If you think of it in advance, season steak all over with kosher salt and pepper. Chill, uncovered, at least 2 hours and up to 2 days. If not, season now and proceed.Step 2Heat a medium cast-iron skillet over medium-high 2 minutes. Drizzle in enough oil to evenly coat pan with no bald spots and cook steak, turning every 2–3 minutes, until a dark crust forms on both sides and steak is very rare (a thermometer inserted dead center should register 115°), 12–15 minutes. Frequent turning will develop a gorgeous crust without creating thick strips of well-cooked steak beneath the surface.Step 3Reduce heat to medium; add butter, smashed garlic, and rosemary. Tilt skillet toward you and scoot steak to the far end of pan so that garlic and rosemary slide down into the foaming butter. Holding the skillet’s handle with your nondominant hand, spoon butter over steak repeatedly, 1–2 minutes (internal temperature should hit 120° for medium-rare). Transfer steak to a platter and let rest 15 minutes for juices to redistribute.Step 4Meanwhile, whisk together grated garlic, anchovies, and vinegar in a medium bowl; season with kosher salt. Whisk in ⅓ cup oil, then taste and season with more kosher salt and some pepper. The dressing should be punchy and acidic.Step 5Cut stalks away from fennel bulb. Remove tough outer layer from bulb, then halve lengthwise. Cut out core. Set cut side down and slice crosswise ¼\" thick, then slice stalks and fronds, which will give the salad a range of textures. Add fennel to bowl with dressing and toss to coat.Step 6Cut steak away from bone and slice against the grain ½\" thick. Season with some Aleppo-style pepper and sea salt; drizzle with oil. Serve with fennel salad alongside and the bone, too, of course.How would you rate Butter-Basted Rib Eye with Crunchy Fennel Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis recipe is undeniable. I feel like I never knew how to make a great steak until I made this. W O W ! ! ! Eating red meat has become a luxury for me and this was extravagant with the simplest of ingredients. 10/10 will make again.  Thank you Carla! mrstylepantsSan Francisco, CA5/18/2020You GUYS, not only is this steak delicious but that fennel salad...what, what?!?! I do not enjoy the taste of licorice which is what raw fennel tastes like to me, but it paired with this dressing is da bomb dot com. I couldn't get enough of it. The crunch Carla talks about is real and worth all the fennel bulb chopping. I'm also not a big red meat eater, but this ribeye recipe is getting added to the mix. Give it a try!Shannon Randol3/13/2020Oh, wow, I read the recipe wrong! Use only grated garlic with the fennel salad! Makes so much more sense.....AnonymousDenver CO8/11/2019Ok I didn’t make the steak but the fennel salad is my new obsession. I think it would do with maybe mincing the garlic or grating all of it - as biting into even a smashed piece of raw garlic is a bit much, but whatever. Also- I ate leftovers the next day and somehow it was even better. AnonymousDenver CO8/11/2019Perfect! The cooking times for the steak were spot on if you really do get a 2lb 2” bone in ribeye. The fennel salad was also surprisingly really good. I was never a fennel person but I loved it and I will now be eating fennel more often. Thanks Carla!nick016NYC6/12/2019Explore Bon AppétitRib Eye SteakSteakBeefMeatFennelVegetableAleppo-Style PepperHerbs & SpicesEasyMainSideGluten-FreeNut-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}