{"id": "15ec2c0f20bde0af9eca550b96f538f6", "url": "https://www.bonappetit.com/story/cook-in-a-foreign-language", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "The Best Way to Learn a New Language Is by Translating Your Favorite Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere’s No Better Time To... Cook in a Foreign LanguageGoodbye Duolingo, ciao translated recipes!By Ali FrancisMay 14, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Make your favorite recipes in a new language.When I decided to start learning Italian last spring, after a month-long trip with my mom, I approached my studies the same way I go about squeezing a lemon: with a rigorous commitment to outcomes. Gimme juice, damnit! It was a painstaking and frustrating process where every step forward seemed to come with three steps back.After the crisis hit, I all but forgot about Italian. I’d been too busy trying to block out my anxiety with blocks on my calendar: run, write, read socialist manifestos, meditate, grocery shop, repeat. Then, one day, while trotting around my house like a lost pup looking for a pat, I received a message from my Italian tutor, who was holed up in Pesaro on the east coast of Italy: “Ti mando un abbraccio fortissimo!!” (Sending you a very strong hug.)Bored and scared and exhausted from reading news, we decided to do a lesson. And then another. And then two per week. Over time, our video calls morphed from traditional lessons on grammar and tense, into a much more universal language: WTF is happening in the world? When will we feel a sense of normalità again? Do we even want to? And when those unanswerable questions became too hard to comprehend for my tiny bambina brain, we switched to the second most important subject: food!Which pasta shape is the most sottovalutata (underrated)? We both agreed: orecchiette. How do you say preheat? Preriscaldare, because even the most mundane Italian words are brimming with lyrical beauty. We read through a pizza recipe and I jotted down old Neapolitan quirks: how to rise dough in the oven with just the light on, for a little extra warmth. And that, in Italy, pizza bases aren’t just *made* from flour and water and yeast—they’re realizzato (realized).Biscotti al cioccolato!\nPhoto by Laura Murray, Food Styling by Pearl JonesI started pasting my go-to BA recipes into Google Translate and trying to read them in my new auntie tongue: zuppa di funghi, pasta con salsiccia, verdure e fagioli, and pollo alla cacciatora. I worked up the courage to make hammy chickpea soup because it seemed easy enough and I was simply too delighted with the word ceci (chickpeas) not to. I kept the English version in one tab and the Italian in the other, in case I got stuck. My favorite step: schiaccia e sbuccia 8 spicchi d'aglio (smash and peel 8 cloves of garlic). Not everything translated perfectly. For example, the closest Italian phrase to “an onion’s papery skin” was le bucce di carta (the peels of paper). But with the help of context and my dizionario, I felt my way through.Learning a language is funny in that the more you know, the more you realize you don’t know. I’d been so diligent about my studies in the past. I went to weekly lessons with a stern woman in New York (in addition to video calling with my tutor in Italy). I Duolingo’d on the train. I did all my homework on time. But all I could focus on was how far away fluency felt. And how much I wanted the struggle to be over already.Cooking to the tune of a recipe has forced me to focus more on the immediate and the minute—peeling each carota and memorizing each new verb—and less on the end result. Because I have no way of knowing exactly what or when that will be. While my tutor constantly reminds me that my Italian is getting so much better, what I really needed was a lesson in embracing the messy, unknown process.Something that is for sure? Tomorrow I’ll be giving these biscotti al cioccolato a whirl.Explore Bon AppétitThere's No Better Time CoronavirusItalianSoupPastaCookieBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-13", "author": ["Condé Nast", "Ali Francis"]}