{"id": "15ef77335997f259fc2faf9a4ae6b4c9", "url": "https://www.bonappetit.com/recipe/pea-and-ricotta-potstickers", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Pea and Ricotta Potstickers With Homemade Dumpling Wrappers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPea and Ricotta Potstickers With Homemade Dumpling WrappersMaking fresh dumpling wrappers isn't hard when you have Hetty McKinnon to guide you. (But we won't tell if you use store-bought.)By Hetty McKinnonApril 11, 20214.7(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintMaking dumpling wrappers from scratch may seem daunting, but this method makes it highly achievable. While there are many types of dumpling skins, some of which are made with starches, my preferred variety to make at home requires just two humble ingredients—flour and water—and happens to be one of the easiest doughs to work with. This dough is incredibly malleable and adaptable. The near-boiling water is the magic ingredient—the heat basically cooks the proteins in the flour, preventing the gluten from forming too much, reducing elasticity. This creates a robust dough that is extremely easy to roll out. Even if you want to make it ahead or have to pop it in the fridge to rest for a few hours, it comes out soft enough to roll. Hot-water dumpling dough is best for pan-fried potstickers and steamed dumplings (they’re too thin to boil). There are also instructions for how to use store-bought wrappers, if you prefer. (Find all of my most valuable dumpling tips here!) This recipe is adapted from my book To Asia, With Love, where I have recipes for potstickers stuffed with all kinds of fillings. —Hetty McKinnonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronThin Wooden Dowel$11 At AmazonChopsticks$7 At AmazonMicroplane$16 At AmazonBreville IQ Kettle$150 At AmazonLarge Nonstick Skillet$50 At AmazonFood Processor$49 At Amazon8-Inch Chef's Knife$47 At AmazonMedium Pot with Lid$155 At AmazonIPOW Fine Mesh Strainers (Set of 3)$12 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonPastry Brush$9 At AmazonPlastic Wrap$9.84 At AmazonIngredientsMakes about 242cups plus 6 Tbsp. (300 g) all-purpose flour (optional); plus more for dusting1small bunch chives2cups fresh or frozen peas (about 10 oz.)1garlic clove½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus moreFreshly ground black pepper¼cup fresh ricotta24store-bought dumpling wrappers (optional)2–3Tbsp. grapeseed oil or vegetable oil, dividedBlack (Chinkiang) vinegar and/or chili oil or chile crisp (for serving)PreparationStep 1To make dumpling dough, bring 1 cup water to a boil in a kettle or small saucepan and let cool 2 minutes. (If you are using store-bought wrappers, skip to step 4.)Step 2Meanwhile, set a large heatproof bowl on a kitchen towel (to stop it from moving around). Pour in 2 cups plus 6 Tbsp. (300 g) all-purpose flour and make a well in the center. Using a wooden spoon or chopsticks, stir flour as you gradually add ¾ cup of the just-boiled water in a steady stream. Try to moisten the flour as evenly as possible. Once the water has been added, mixture should look very shaggy. Being careful as the dough will be very hot, carefully knead in the bowl until dough comes together in a single mass—if the dough is very dry and will not come together, add more warm water, a teaspoonful at a time, until more workable.Step 3Transfer dough to a very lightly floured surface and knead (by now it won’t be hot) with the heel of your hand until smooth and elastic, about 3 minutes. Wrap dough tightly in plastic and place in a resealable plastic bag. Let sit at room temperature at least 30 minutes and up to 2 hours. The dough will steam in the bag and become softer and easier to work with as it sits.Step 4While the dough is sitting, make the filling. Finely chop enough from 1 small bunch chives to measure out 2 Tbsp. Bring a medium pot of salted water to a boil and cook 2 cups fresh or frozen peas (about 10 oz.) until bright green, about 30 seconds. Drain in a colander or mesh sieve and transfer to a food processor or blender. Finely grate in 1 garlic clove on a Microplane. Blend until you have a chunky mash.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Scrape pea purée into a medium bowl; add chopped chives and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt; season with freshly ground black pepper. Stir in ¼ cup fresh ricotta; taste—the mixture should almost be too salty—and season with more salt if needed.Step 6Now, move back to your dough: Cut dough into 4 equal pieces. Working with 1 piece at a time and keeping remaining pieces covered with a damp kitchen towel, roll into a log. Cut log into 6 equal pieces and roll each piece into a ball. Roll out each ball into a 3½\"-diameter round. The correct technique may take some time to master, but the basic principle is to roll the edges of the dough a bit thinner than the center. Hold your dowel in your dominant hand and use your other hand to turn the dough as you roll the edges. Set wrappers aside on a lightly floured surface and cover with a damp kitchen towel. (I usually work in sets of 6 dumplings—roll 6 wrappers, fold 6 dumplings—see below for instructions—then proceed to the next piece of dough, but find a workflow that feels right to you.)Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7If you are just starting out, this alternate technique might be easier: Lightly dust your work surface and dowel with flour and roll out dough as thinly as you can, about 1/16\" is ideal. Use a well-floured 3½\"-diameter biscuit cutter to cut out rounds. Flour rounds well and cover with a kitchen towel. Reroll scraps and continue cutting out rounds until you have used all of the dough. If the dough becomes resistant to rolling, cover and let rest until it softens again. You should get 24–30 wrappers, depending on how thinly you roll out the dough.Step 8If you are using store-bought dumpling wrappers, have a small bowl of water on hand—dip the very edges of the wrapper into the water and rotate it to wet the edge all the way around. If you are using homemade wrappers, there is no need to wet the edges (unless they have been defrosted from frozen). Using a pastry brush, brush off any excess flour from wrapper. Then, holding wrapper in the palm of your hand, place about 2 tsp. filling in the center. Fold one side of wrapper up and over filling to form a semicircle; pleat edge, working from one corner to the other. Transfer to a baking sheet and situate them so the pleated edge is upright and they have a flat bottom. Cover with a damp kitchen towel and repeat with remaining wrappers and filling.→ Learn six other ways to fold dumplings (with videos!).Step 9Heat 1 Tbsp. grapeseed oil or vegetable oil in a large nonstick skillet over medium-high. Working in batches (10–12 depending on the size of your skillet) and adding 1–2 Tbsp. grapeseed oil or vegetable oil to skillet between batches as needed, cook dumplings, flat side down, until bottoms are lightly browned, about 2 minutes (if the dumplings are browning too quickly, reduce heat to medium). Immediately add 3 Tbsp. water (just enough to cover the base of the dumplings). Be very careful as water will sizzle furiously when it hits the pan. Cover pan and cook until water is evaporated, about 2 minutes. Uncover and cook dumplings until bottoms are crispy, about 30 seconds.→ Want to boil or steam instead? We've got you covered.Step 10Transfer dumplings to plates as you go. Serve with black (Chinkiang) vinegar and/or chili oil or chile crisp.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Do ahead: Dough can be made 1 day ahead. Wrap tightly and chill after kneading (no need to rest at room temperature first). Roll out while still cold. Dumpling wrappers can be made 1 month ahead; generously dust both sides with potato starch, tapioca starch, or cornstarch. Stack in bundles of 10–15 (this makes defrosting quicker), wrap in plastic, and place in a resealable freezer bag or airtight container. Let thaw at room temperature before using. (The layer of starch means you will need to use water to seal dumplings.) Dumplings can be filled and formed 1 month ahead. Freeze in a single layer on a parchment-lined baking sheet until firm, then transfer to a resealable freezer bag.Adapted from TO ASIA, WITH LOVE by Hetty McKinnon. Copyright 2020 by Hetty McKinnon. Published by Prestel, an imprint of Penguin Random House. Reprinted with permission.How would you rate Pea and Ricotta Potstickers With Homemade Dumpling Wrappers?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThese were so fun and surprisingly easy for first time ever pot sticker-er. They were not lying when they suggest adding salt to the point of being too much. Made them twice in two days. Erred on the side of more everything second time around - little more garlic, chives, little more ricotta only because I wanted to finish the container. Probably added a total of 1 1/4tsp diamond kosher salt that second time. Made sure not to add even a little over 3/4c water to dough and kneaded a bit longer. I think these can be rolled thinner with more wrappers and the filling would seem to stretch as well. AnonymousPhiladelphia 2/5/2022This technique is fantastic! The potstickers were so easy to roll out. And I was dreading that part, as I have a lot of experience with doughs (yeasted or not) that shrink back after you roll them out. These don't do that. They stay where you put them. I was wondering if adding a little salt would alter the ability to roll them out. I think they would taste better with a little salt. I wonder also if you could use a mix of flours and not just plain all-purpose flour. Anyway, they were really good. I've made them for guests two times now and people loved them. I would guess all sorts of different fillings would be good too. Thanks for the technique. I'm going to try it with my parathas!Marilyn FarleyFairfield CA5/21/2021This is great and I enjoyed it even if I am a Meat and Potatos man. It would really be nice to have the directions to make the Dipping Sauce that you show that has the chilies. I really love that dip and wish to make a good version for myself.\n\nThank you\n\nLarryLarry BernardShakopee, MN5/7/2021How to make low carb as in no flour?  What substitutes can be used?  Otherwise looks like a fun recipe.tamarqueNew Paltz, NY4/17/2021Easy to make and delicious. Unconventional dumpling flavors but it totally works. I doubled the garlic (bc 1 clove = 2) and was happy with the result. I would absolutely make this again, though maybe on a dumpling night where we had a meat option, too.  Abigail Portland, OR4/15/2021Explore Bon AppétitDumplingPeaVegetableRicottaCheeseSpringMainNut-FreeVegetarianFryDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-11", "author": ["Condé Nast", "Hetty Mckinnon"]}