{"id": "15f58e8538e41c7cbc8b7f9622afe75d", "url": "https://www.bonappetit.com/story/internet-cookies-delivery-service", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "I’m Gifting Friends and Family (and Myself) Internet Cookies During Quarantine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Gifting Friends and Family (and Myself) These Cookies During QuarantineInternet Cookies’ lo-fi delivery service offers creative concoctions with flavors changing monthly.By Emma OrlowSeptember 23, 2020FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.One of the strangest things about a global pandemic is that, for better or for worse, life keeps moving. Milestone holidays still have to happen—even though it feels like they shouldn’t be allowed to. Personally, I didn’t want to get another year older while I sat alone in my apartment watching The Sopranos, but, hey, that’s just how the cookie crumbles.Then I stumbled upon Internet Cookies, a delivery service for one-of-a-kind baked goods, the one bright spot among the darkness of COVID-19. I’ve since sent them to friends for their birthdays, my mom on Mother’s Day, and myself (just because!). As advertised, they truly are cookies that you buy on the internet. Founded a year and a half ago by Gaia Valdemarsdóttir—who wanted to leave behind the demanding hours she had as a restaurant cook and pastry chef—Internet Cookies offers a monthly subscription and one-off orders of homemade cookies made with unusual ingredients. Each month there’s a new cookie that Valdemarsdóttir develops out of her kitchen in Santa Fe, New Mexico, with ingredients pulling from her childhood spent in the Faroe Islands, summers with her Czech family in Prague, and other international travels. Past cookies have included combinations like emmer, turmeric, banana, and salt-cured pepper; another was with dried and fresh blueberries, roasted hazelnuts, lavender-infused butter, and maple flakes. And I’d be remiss to not mention the noteworthy pistachio marzipan cookie.For September, Valdemarsdóttir is offering a particularly delightful-sounding Blenheim apricot-dukkah-Cracker-Jack concoction. Her treats are consistently much more inspiring than a classic snickerdoodle or chocolate chip and with just as much warmth baked inside; I wish she’d open a bakery with them all near my house.Despite the company’s tech-forward name, Valdemarsdóttir has a pretty light online presence—the website is really more of a casual blog—and most of her sales currently come from word-of-mouth recommendations. In internet realm, accepting cookies gives websites personalized information about its users. But on this website, “accepting cookies” means you’ve become pen pals with the leader of a very sweet cookie club. The clandestine, low-profile feeling of it all carries over to the no-frills packaging—labeled only with the company’s name in a Gothic-style font—which reminds me of when my parents would attempt to send me hidden contraband (candy) at my childhood sleepaway camp.“I think what I love the most about sending people cookies is that I send them to all sorts of people in all sorts of professions and backgrounds. When I started this, I sort of thought that my customers would be all the same, but I’ve come to learn that a lot of different people love weird cookies, from people located at army bases to grandmas and more,” she tells me.During the pandemic, ordering food gifts online has proven to be incredibly unpredictable with so many delivery slots already snatched up and items sold out without a restock date in sight. But Internet Cookies has been an entirely reliable source of joy, and at $20 (shipping included) for six cookies, a well-priced gift for anyone in need of a pick-me-up or celebration. Buy It: $20 for six cookies (shipping included) All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingGiftsCookieRead MorecultureI Make My Own Ice Cream, But I Fully Endorse Jeni’s PintsBy Sohla El-WayllyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-21", "author": ["Condé Nast", "Emma Orlow"]}