{"id": "1618180f29d095794061829414ab5a06", "url": "https://www.bonappetit.com/recipe/farro-and-escarole-soup", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Farro and Escarole Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFarro and Escarole SoupOctober 7, 20194.0(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThis delicate, brothy grain soup manages to be comforting and fortifying—but without requiring a nap afterward. If you have really good homemade stock on hand, you can use it instead of the water called for here; the soup will only benefit from the addition. But even if you don’t, the flavors will get richer and more concentrated the longer it sits, which means it’s a great make-ahead recipe for a weekday lunch or dinner. This dish is part of the Bon Appétit Guide to Actually Enjoying Your Lunch at Work. Find more recipes, tips, and tricks here.Ingredients4 servings4garlic cloves, thinly sliced3Tbsp. capers¼cup extra-virgin olive oil1medium onion, finely chopped1cup unhulled farro or spelt½tsp. crushed red pepper flakes6celery stalks, thinly sliced on a diagonal4cups torn escarole or kale1oz. finely grated Parmesan (about ¼ cup)Kosher saltPreparationStep 1Cook garlic, capers, and oil in a large saucepan over medium heat, stirring often, until garlic is golden, 4–6 minutes. Add onion, farro, and red pepper flakes and cook, stirring occasionally, until onion is slightly softened, about 3 minutes.Step 2Add 6 cups cold water to pot and bring to a boil. Reduce heat to medium-low and simmer, partially covered, until farro is tender, 20–25 minutes. Add celery and cook, uncovered, until almost tender, about 5 minutes. Stir escarole and Parmesan into soup and continue to cook until escarole is wilted, another 4 minutes. Remove from heat and season with salt.Step 3Do Ahead: Soup can be made 4 days ahead. Transfer to an airtight container and chill.How would you rate Farro and Escarole Soup ?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI love this soup! For those who find that it lacks flavor, two tips: 1. Add miso. 2.  Add Vegemite. I added a little of each; the flavor was outstanding.NancyFCalifornia2/23/2022Like others, I found the final product to be a little lackluster, so I decided to liven things up at the end with some fresh dill, a squeeze of lemon, lots of black pepper, and a swirl of olive oil, and that did the trick. Harissa or your favorite chili oil wouldn't hurt either. Though I didn't do it this time, if I make this again, I'll also deglaze with a little white wine. LauraChicago3/17/2021Quick and delicious! I used a bit less capers and veggie broth instead of water. I also deglazed the onions with white wine before adding the broth, I highly recommend this step. This will be a go-to recipe for me.KateNY2/8/2021Love this recipe, we make it with kale at least a few times a month. Broth or stock vs just water makes this delicious, and I always add 7-8 cups vs. the 6 they recommend. shivsChicago3/8/2020I made this with turkey stock and kale. Flavored broth/stock is a must, IMHO. Delicious, although I will use 7-7.5 c liquid next time. I wanted it to be brothier.nataliematz88Omaha, Ne12/8/2019Super Yummy to eat and easy to make as well. I need to eat gluten free so I made it with brown rice and it work very well.Anonymoustoronto11/19/2019After roasting and serving Cornish game hens (slathered inside and out with a lot of coarse ground mustard mixed with a lot of minced garlic and fresh rosemary) I simmered the bones for a few hours to make a rich broth.  I used that broth to make this soup, and it was delicious.  Not sure the flavor would have been as good with water as a base.  I think a rich vegetable broth would also work well as a substitute for water.AnonymousCharlotte, NC11/3/2019Really tasty and full of flavor. My attempt at it was not very \"soup-y\". It barely had any liquid left in it. Made a great lunch at my desk for the week though.AnonymousChicago10/22/2019Tasty and unusual soup, it’s nice to try a new recipe. I did not deglaze with white wine, and found it quite flavorful. The farro had a nutty pleasant flavor, it was my first time using it in a recipe. I made it exactly as stated, but with baby kale instead of escarole. Thank you!AnonymousEllen10/18/2019Not flavorful at all! I used wine to deglaze, and used broth instead of water, and it still wasn't good. Disappointing. AnonymousLos Angeles10/14/2019Pretty good stuff. I made it with baby kale instead of escarole (lettuce? in my soup?). Never tried farro before so that was nice. The parm got a bit sticky - blending with an egg might help with that but I don't know. Definitely recommend using some type of stock, maybe adding a bit of thyme. I deglazed with white wine after sauteing the onions/garlic/shallot but that's only because I was drinking wine anyway. I like this recipe - good first soup of the fall, you can go your own way with it but it's also nice on its own.jesseranPhiladelphia10/10/2019Explore Bon AppétitSoupSoups and StewsItalianEuropeanFarroRice & GrainsEscaroleChicoryLeafy GreensVegetableCeleryFallEasyMainVegetarianNut-FreeSimmerLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast"]}