{"id": "161c655894c1abd8f476887f0c59377e", "url": "https://www.bonappetit.com/story/caramelized-leeks-on-toast", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "This Caramelized Leeks on Toast Recipe Is Pure Weeknight Magic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Caramelized Leeks on Toast Recipe Is Pure Weeknight MagicIt's also the official recipe of Healthyish Superpowered LA!By Heather SperlingApril 10, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailAt our Silver Lake restaurant Botanica, co-chef Emily Fiffer and I use the word “magic” to describe anything that’s so delicious there’s something inexplicable about it. For example: the caramelized leeks that form the luscious, rosemary-scented foundation of this recipe. They’re cooked down until their natural sweetness is intensified, then seasoned with Aleppo-style pepper and lemon so that sweetness is balanced by a subtle bite. They’re deeply golden, with a rosy tinge from the dried chile. They’re richly aromatic, thanks to a heady dose of rosemary. The result is caramelized leek magic… and we consider its combination with crusty bread and fava beans to be downright alchemy.We have the Chez Panisse Café Cookbook to thank for this dish—specifically, a recipe for garganelli with favas, scallions, rosemary, and ricotta salata that I cooked obsessively during my last semester of college. (YES I cooked to procrastinate, and NO I never finished my thesis—but that’s a different story.) The pairing lodged in my brain as a flavor combination to remember forever: fresh, savory, a touch sweet (in that magical way cooked alliums are), and so very green… Perfect for spring!Fast forward a decade and a half: I’m living in California, getting ready to open Botanica, and, in the midst of a caramelized leek obsession. (Stirred with black lentils and roasted citrus? Yes.) One day, I snagged some favas to play with, and this tartine—a clear homage to that memorable Chez recipe—naturally followed. It’s a dish that embodies what Botanica is about in many ways: It transforms a humble vegetable into something addictively delicious. It feels dinner party ready, while still rustic and unfussy. It’s rich and yet wholly healthyish.Each component of the dish is delicious on its own, and each should find its way into your cooking repertoire, too. Find the crustiest, tastiest bread around, toast it hard, and rub it all over with a cut garlic clove—and maybe start to do this with all your bread, always. Cook your leeks in a big enough pan so that they truly caramelize, rather than steam, and make extra so you can stir them into soft-scrambled eggs the next day. (The leek: The magic wand of alliums! Eh? Eh??) Season the favas (or blanched English peas, or thawed frozen peas, if there are no favas to be found) with plenty of rosemary, lemon, Aleppo, and fruity olive oil, and keep this in your back pocket for a future spring salad… Perhaps with some ricotta salata, Chez Panisse-style. Serve the toast as we do: with a fork and a steak knife and a glass of something vibrant and fresh (like a lightly chilled natural Beaujolais).This recipe from Botanica is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar. Click here to see where we're heading next and buy tickets!Oh, oh, it's magic:Caramelized Leek and Fava Bean ToastPiled high with softened leeks and fresh fava beans, this tartine might—might!—make you forget about avocado toast.View RecipeExplore Bon AppétitHealthyishSuperpoweredRead MoreLifestyleIntroducing Healthyish Superpowered: A New Kind of Dinner PartyBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-10", "author": ["Condé Nast", "Heather Sperling"]}