{"id": "162778e2725e6b928f8258a5d9b36037", "url": "https://www.bonappetit.com/story/vermicelli-better-than-angel-hair", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "You Couldn’t Pay Me to Eat Angel Hair Pasta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Couldn’t Pay Me to Eat Angel HairBut I do love vermicelli. Don’t @ me!By Carla Lalli MusicJuly 25, 2019FacebookTwitterEmailChristina Holmes PhotographyFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.There are many wonderful pasta shapes in the world, but angel hair isn’t one of them. The joy of pasta-eating is in the al dente texture. Angel hair, being too thin, is never al dente. The joy of a long pasta–eating is in the twirling. Angel hair, being spineless, clumps up in a disappointing tangle. With spaghetti, you can pinch your lips together and vacuum up a long strand till it recoils and smacks you on the underside of your nose on the way to your mouth. Angel hair just lands on your chin like the strands of a wet mop. Simply put: Angel hair is the devil.Before you fire off a volley of horrified tweets at me, know this: There is love in my heart for a  spindly little noodle after all. Rice vermicelli! Rice vermicelli (bun) are common in Vietnamese, Chinese, Thai, and Signaporean dishes. I love them equally when tucked inside Vietnamese rice paper rolls, in brothy noodle soups and stir-fries, and even when they’re deep-fried. Part of rice vermicelli’s charm is its bouncy, fluffy, ultra-thin texture, qualities that angel hair can never achieve. And while I have never craved angel hair—not even when I was a baby!—I am craving the heck out of these cold noodles with chicken and nuoc cham right now.Want this letter before it hits the website? Sign up for our newsletter!I’m a sucker for this crispy shallot topper.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe recipe starts with some grilled chicken, but as you and I both know, I’m not grilling chicken on a Wednesday night. I’m grabbing a supermarket rotisserie bird, and I suggest you do the same. That way, you can jump right into the crispy shallot preparation as soon as you get home, a technique that you will master easily and cherish forever since you get both crunchy shallot toppers and delicious infused oil out of the deal.Cooking the noodles might mean soaking them in just-boiled water, or simmering them until tender. Check the package for instructions. In the meantime, make the nuoc cham, which (if you don’t already know), is an iconic Vietnamese dipping sauce built on fresh lime juice, fish sauce, chiles, and sugar. Oh my god I’m salivating. Okay! Then you thinly slice some crunchy vegetables—radishes and turnips are specified but you could use cucumbers and carrots, or fennel and daikon, or literally any other crisp, dense thing you like. Tear some herbs, then toss the noodles with the chicken and the sauce and the veggies, and top with the fried shallots. Soon, you will be dining like a cool-headed angel on a hot summer’s night. Heaven, indeed.Get the recipe:Rice Vermicelli with Chicken and Nuoc ChamNuoc cham, the Vietnamese condiment that dresses this crunchy noodle salad, is made with lime juice, fish sauce, chiles, and sugar. The addictive mix of spicy, sweet, sour, and salty flavors is also great as a dipping sauce for grilled meats.View RecipeExplore Bon AppétitCarla NewsletterRice NoodlesSummerRead Morerecipes21 Cold Noodle Recipes for When It's Too Hot for RamenGallery21 SlidesBy Christina ChaeycookingThe Only Thing Better Than Ice Cream...By Carla Lalli MusiccookingWhy Aren't We Grilling More Pork Shoulder Steaks?By Adam RapoportcultureI Won’t Grill Without My Trusty HeadlampBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-25", "author": ["Condé Nast", "Carla Lalli Music"]}