{"id": "16285b26389c66162e5387463fb3a31c", "url": "https://www.bonappetit.com/story/silver-palate-cookbook-february-cookbook-club", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "The Silver Palate Cookbook Is Our February Cookbook Club Pick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Silver Palate Cookbook Is Our February Cookbook Club PickNearly 40 years later, and this classic tome is still the first place we look for comfort.By Molly BazFebruary 1, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Anna StockwellFacebookTwitterEmailTake a look at the cookbook collection of anyone on staff at Bon Appétit, and there’s a good chance a copy of The Silver Palate Cookbook is there. And if it’s not on their shelf, it’s definitely on their mother’s shelf, or their mother’s shelf. Ring a bell? How about Chicken Marbella? If you’ve ever had the famed olive and prune dish, then you know what we’re talking about.Co-authored by Sheila Lukins and Julee Rosso, the first edition of the unassuming soft-cover cookbook debuted in 1982 and introduced American home cooks to simple, approachable, super flavorful dishes that drew on a global palate, while remaining familiar and accessible. It was an immediate hit. Sure the approach sounds like a given today, but Silver Palate was ahead of its time; almost 40 years later, it hasn’t lost an ounce of its relevance.As winter only continues to get worse (when did polar vortex become a regularly recurring season?) we’re using our monthly Cookbook Club as a chance to turn back to comforting classics while we wait for bright green things (ramps! Peas!)  to return to the market. And if we’re going to use February as an excuse to get nostalgic, then there’s no better place to start than the Silver Palate.Everyone at BA has their favorite recipe from the book, but for me, it’s all about the sour cream coffee cake: the single most important thing I eat all year. It all goes down on Christmas morning (and only on Christmas morning!) as an accompaniment to my family’s very over-the-top gift-giving ritual. Not one of us can recall when or why this tradition began, but I do know that it’s not time to rip apart some shiny paper if the scent of this impossibly moist, perfectly sweet pecan-studded cake isn’t already wafting through the house.So take my word for it, grab some friends, and join us in honoring this timeless classic at your own Cookbook Club this month. Just be sure that coffeecake makes an appearance at the table. You can be very certain I’ll be bringing it to ours.Get the recipe:Sour Cream Coffee CakeThis elegant, moist cake is ideal for serving at a large brunch party or with your morning coffee.View RecipePick up a copy of The Silver Palate Cookbook wherever you buy cookbooks. And if you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon Appétitcookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-01", "author": ["Condé Nast", "Molly Baz"]}