{"id": "162bb61a0f53ec10736c9f70048791f9", "url": "https://www.bonappetit.com/story/jenny-feldt-restaurant-diary-1", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "I’m Not Sure I’ll Ever Go Back to Bartending Full-Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’m Not Sure I’ll Ever Go Back to Bartending Full-TimeIn her first Restaurant Diary entry, Jenny Feldt talks about her decision to step away from the bar and return to Grey Goose as a brand ambassador.By Jenny Feldt, as told to Elsie YangFebruary 17, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them, from a line cook in Denver to a farmer in Winters, California. This week’s diarist is Jenny Feldt, who recently left her bartending and beverage consulting job to resume her role as a brand ambassador for Grey Goose.Moving during COVID isn’t necessarily something that I’d recommend—much less moving twice—but when there’s a pandemic and so little is in your control, it felt like the right thing to do for my sanity. Initially, I was working as a brand ambassador for Grey Goose in Atlanta, but last August the company furloughed a number of employees, including me. When that happened I decided to return home to D.C. to work as a beverage consultant, which is how I ended up at Prost. It was nice to return to my roots, training bartenders and creating a beverage program.The last few months at Prost required a lot of thinking on our toes. And with everything that has been going on in D.C., we took things one day at a time. The ban on indoor dining went into effect at the beginning of January, so we had to find creative ways to drive to-go sales and amp up outdoor seating, which is definitely challenging when temperatures drop below freezing. Cocktails can help, though, and we made sure that Prost’s three signature warm cocktails weren’t just specials that appeared every so often on menus but ready to rock and roll at all times.Even when you’re making drinks that customers love, being a bartender during a pandemic is difficult. In the service industry it’s crucial to be able to understand your guests, anticipate their wants, and get a sense of what kind of experience they’re looking for. Everyone is different—some folks want a super-curated, personalized cocktail whereas others just want a beer, some food, and to be left alone. But you can only figure that out by having some interaction with them.During the pandemic that all disappeared. I had to depend on servers to get a feel for guests, and I just made cocktails according to my recipes. I still managed to find ways to connect. I would send out handwritten notes with to-go orders or write a story or history of the cocktail on the chalkboard to interact with customers at even the most basic level.Photo by Jose PereiroBut in the end I knew my time at Prost would be short. I had always planned to return to Grey Goose. I’ve been in Atlanta for about a month now, and it’s a completely different environment than D.C. For one, indoor dining is almost at full capacity, so restaurants are in full swing for the most part. But that in no way means that things are back to normal or that the industry is not struggling here. We’re working on ways to modify service in order to ensure guests and employees will feel safe and comfortable dining out.At Grey Goose things are a little different than before. A big part of my job is focused on marketing Grey Goose across the southeastern part of the country. In normal times I would be traveling everywhere from Georgia to Tennessee not only to teach bartenders about Grey Goose but also categories of vodka, ways to grow as a bartender, you name it. Now that we’re dealing with the pandemic, a lot of that takes place through Zoom.No two days are the same for me. I’m responsible for building relationships with different restaurants and bartenders across the region, so I’m able to keep a finger on the pulse. I hear how they’re accessing PPE, how they’re leveraging PPP loans, and whether or not they could use financial help. I’m also working on a big mental health initiative at Grey Goose to raise awareness about how difficult this time is for the industry and to also host a series of check-ins.Having a salaried role at Grey Goose is much more stable than gambling on a more traditional service industry job. At this point I don’t know if I can see myself hopping behind the bar full-time anytime soon, given the volatility of what’s going on and of course how different the job is today than it was a year ago.And while I’m spending less time behind the bar, I’m actually interacting more with bartenders on a day-to-day basis than I thought I would. Being around other creative souls brings a sense of community and drive. I’ve been so happy to see much more collaboration throughout different cities, whether through scheduled Grey Goose virtual meet-ups or random check-ins. This has given me a real sense of hope that we will come out of this stronger, and certainly more empathetic, than before.Explore Bon AppétitRestaurantsRestaurant DiariesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-17", "author": ["Condé Nast", "Jenny Feldt", "As Told To Elsie Yang"]}