{"id": "163642515266e9ebb7914ec657c593e5", "url": "https://www.bonappetit.com/story/what-is-saffron", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "What Is Saffron, The World's Most Legendary Spice? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Saffron, the World's Most Legendary Spice?You already know that this red spice is amazing (and expensive), but what is saffron, exactly?By Andy BaraghaniFebruary 5, 2018FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailThis post is part of Andy Baraghani's Guide to Modern Middle Eastern Cooking. Get all his recipes, tips, and stories here.Saffron is one of the most precious spices in the world. The threadlike red stigmas—and the yellow hue they impart—are quite literally the stuff of legend. But what is saffron, exactly? No matter how many tales have been told about the spice, a lot of us still don't know what to do with it or whether its worth the high cost. Here's everything you need to know.Where does saffron come from?The spice originates from a flower called crocus sativus—commonly known as the \"saffron crocus.\" It is believed that saffron originated and was first cultivated in Greece, but today the spice is primarily grown in Iran, Greece, Morocco, and India. While micro-scale production of saffron does exist in the United States, most saffron found here is imported.What does it taste like?Saffron is extremely subtle and fragrant. The slightly sweet, luxurious taste is totally enigmatic—it's tricky to describe but instantly recognizable in a dish. As annoying as it is to say, you know it when you taste it.How should I use it?Grind 2 tsp. saffron threads, along with a sugar cube or a pinch of coarse salt, to a powder with a mortar and pestle or a spice mill to draw out the most flavor and color. Then add ¼ cup warm water and let cool. This is the vibrant elixir to use in your paella, buttery saffron rice, and special occasion desserts like saffron-rose water brittle.Blooming saffron in water\nPhoto by Alex LauWhy is it so expensive?Each flower produces only three threads (stigmas) of saffron, and it blooms for only one week each year. The saffron must be harvested—by hand!—in the mid-morning, when the flowers are still closed in order to protect the delicate stigmas inside. It takes about 1,000 flowers to produce just one ounce of saffron. That's why you'll pay $10 to $13 per gram for the real deal. To make sure you're getting the best stuff, take a sniff—you want saffron that smells a bit like sweet hay. It should also have all red stigmas, no yellow stamens.Where do I buy it?If possible, check your local Middle Eastern grocer. You may also find saffron at Whole Foods and gourmet grocery stores—it's also available on Amazon.How do I store saffron?Keep threads in a cool, dry, dark place (you can put it in the freezer for up to a year). Saffron water can be stored in the fridge in an airtight container for up to three weeks.Put that saffron to good use:Crunchy Baked Saffron Rice with Barberries (Tachin)This stunning crispy rice, also known as tachin, is buttery and rich. It's easier to make than it seems.View RecipeHerb Rice with Green Garlic, Saffron, and Crispy ShallotsThis rice dish is based on one of the most famous Persian polos (pilaf), known as sabzi polo.View RecipeExplore Bon AppétitHealthyishSaffronSpiceRead MorecookingThis Saffron Rice Recipe Is My Fullest Expression of Iranian FoodBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Andy Baraghani"]}