{"id": "1636050e984f45eb2b1aafc0e4e6f0a9", "url": "https://www.bonappetit.com/story/chris-moroccos-cooking-rules", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Chris Morocco's Top 10 Cooking Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChopsticks Are the One Tool You Actually Need Around—and More Essential Cooking Rules From Chris MoroccoOur deputy food editor never cooks without a pair.By Chris MoroccoSeptember 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis month, we're doing a mini series on our podcast. Each of the Bon Appétit Test Kitchen editors will be sharing their top 10 cooking rules: the techniques they swear by, the ingredients they can’t live without, and the mindsets that keep them going. This week: the super taster of the Test Kitchen, Chris Morocco.1. You don’t have to follow a recipeNot even ours. It breaks my heart to say that, because obviously I write them, and I think I do a pretty good job of it. But if something is going on in your kitchen, and that recipe is about to go off a cliff, don’t cook it off the cliff. You know what’s happening in your own kitchen better than I do.2. Invest in decent cookwareOne $80 skillet is better than a $100 13-piece set that has nine things you don’t need. P.S. They count the lids when they tally up those numbers.3. If cooking isn’t fun for you, then do whatever it takes to make it funPour yourself a glass of wine, put on music, have a late ’90s action-comedy movie going in the background. Whatever. Just get yourself set up to enjoy it.4. A cake tester is essential, just not for cakeI use a cake tester to check the doneness of everything from fish to vegetables. The point on it is duller than a paring knife, so you get a much better feel for how finished something actually is. Oh yeah, and when it comes to cake, a toothpick is the move. The rougher surface is more likely to show you what the crumb inside looks like.No sad vinegar here.\nPhoto by Chelsie Craig5. Fresh citrus is better than average vinegar, any dayYou are so much better off using fresh-squeezed lemon or lime juice in your dressings, on your roasted vegetables, on anything where you want to bump up the acidity.6. Keep a set of chopsticks aroundYes, we already did an entire podcast dedicated to just this topic, but chopsticks are truly so essential. They are more nimble than tongs, they won’t scratch up your nonstick cookware, you can grab that fallen green bean out of the crevice of your burner, fish a piece of toast out of your toaster, and so much more.7. Don’t let anyone else tell you what delicious isIt’s okay that Adam isn’t into anchovies. We can still give him shit for it, but at a certain point you have to let go.Gojuchang will add a ton of flavor to your food.\nPhoto by Chelsie Craig, Food Styling by Yekaterina Boytsova8. Go big on flavorIf you aren’t bringing big flavors into your pantry (miso, gochujang, chile oil, soy sauce, hot sauce, and the like) you are holding yourself back. In particular, I mean ingredients that already have done some work through fermentation—one stop shops to adding tons of flavor to your food. They can do it obvious ways that will define your dish, but they also have the ability to impart something subtler, depending on how you use them.9. Mise en place isn’t just about food and equipmentThere’s that temptation when you get home to immediately start cooking. But you have to get yourself ready. Take a minute to relax. Crack open a seltzer. Put on some music. Do it right.10. Taste your foodIt blows me away that hardly anyone tastes their food—or will ask for an opinion without having tasted it themselves. I have half a cutlery shop’s worth of spoons in my pocket at all times designated for tasting.Listen to the full discussion on the BA Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitTest KitchenRead MorecultureThe Test Kitchen Swears By This Sturdy Little ScaleBy Chris Morocco, as told to Lauren JosephcookingChris Morocco Just Made the Best Chocolate Chip Cookie EverBy Alex BeggscultureNobody’s Perfect, Except for This PizzaBy Carla Lalli MusiccookingI’d Invite Myself Over for This Spicy Chicken Katsu SandwichBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Chris Morocco"]}