{"id": "1661925367b208d74993b004b77e3a30", "url": "https://www.bonappetit.com/recipe/mackerel-pantry-pasta", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Mackerel Pantry Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueMackerel Pantry PastaBy Christina ChaeyAugust 10, 20213.9(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWhether it’s mackerel, tuna, sardines, or trout that floats your boat in the tinned fish aisle, a couple of cans of good-quality fish turn a bare-bones pasta into something company-worthy. Tinned fish most often comes packed in either water or olive oil; we prefer them oil-packed because they’re much more flavorful out of the can. (Patagonia Provisions makes an especially delicious tinned mackerel in flavors like lemon caper and Spanish paprika.) The technique for this no-cook sauce, in which you warm the tinned fish in a heatproof bowl set over your pasta pot as the water boils, is borrowed from Joie Warner’s No-Cook Pasta Sauces, and ensures the fish won’t dry out or become tough.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonStainless Steel Mixing Bowls$26 At AmazonTongs$13 At AmazonMicroplane Grater$16 At AmazonIngredients4 Servings24-oz. cans boneless mackerel in olive oil or other high-quality tinned fish (such as sardines or tuna in olive oil), drained1garlic clove, finely grated1tsp. finely grated lemon zest2Tbsp. fresh lemon juice1Tbsp. coarsely chopped drained capers3Tbsp. extra-virgin olive oil, plus more for drizzling½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus moreFreshly ground black pepper12oz. spaghetti or other long pasta3Tbsp. finely grated ParmesanPinch of crushed red pepper flakesChopped parsley and lemon wedges (optional; for serving)PreparationStep 1Place mackerel, garlic, lemon zest, lemon juice, capers, 3 Tbsp. oil, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large heatproof bowl. Season generously with pepper and toss to combine.Step 2Set bowl over a large pot of generously salted water (bottom of bowl should not be touching water) and bring water to a boil. Carefully remove bowl from pot and set aside. (Gently warming the ingredients here allows them to mingle nicely with the hot pasta later.)Step 3Cook pasta in same pot of boiling water, stirring occasionally, until al dente. Using tongs, transfer pasta, along with any water clinging to strands, to bowl with mackerel mixture. Add Parmesan, red pepper flakes, and ¼ cup pasta cooking liquid to bowl and toss pasta with tongs, adding more pasta cooking liquid by the tablespoonful if needed, until cheese is melted and pasta is coated evenly in sauce, about 1 minute.Step 4Divide pasta among bowls. Top with parsley, drizzle some oil over, and season with more pepper. Serve with lemon wedges for squeezing over if desired.How would you rate Mackerel Pantry Pasta?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleOne has to be a devout lover of tinned fish to enjoy this. It needs lots of capers, lemon, etc. to overcome the assertive flavor of the fish. A generous dash of crushed hot pepper helps enormously. This recipe is moronically easy and quick, but I would NOT recommend it for company or anyone who is not a known tinned fish lover. This works great with tinned, smoked muscles, squid, conch, clams, or other milder seafood. A generous dose of chopped scallions also helps. Anything to mitigate the fishy taste.StuKinCT1/10/2022Super tasty!. This dish is much better than the sum of its parts. Made it with tuna, and didn't expect it to be that good. I can see myself making this once a week from now on.Dona11/12/2021I love quick weeknight pastas like this one. I would add more capers (big caper-fan), and be sure to use high quality tinned mackerel in olive oil since lower quality tinned fish is usually way too fishy. Wild Planet was a great, mild choice and melded nice with the rest of the ingredients.AnonymousNorthern California11/12/2021I’ve been wanting to try this because I recently became obsessed with the fish goods section at Trader Joe’s and wanted to put some tinned fish to use. What a waste. The fish completely overpowered the capers, lemon, Parmesan, and any other ingredient that went into it. It tasted like plain pasta with the fish only. It’s not inedible, but I definitely would not try making it again. Pasta_loverSan Diego, CA10/26/2021A variation of this, made with Italian canned tuna, is an old family favorite. Similar to this recipe, we sauté finely chopped garlic in olive oil, then pour that over the pasta (linguine is our choice). Topped with the flaked canned tuna, roasted red peppers, red pepper flakes, and then Parmesan cheese! Simple and so delicious! I’ll need to try with mackerel and capers. A. CarlinoPittsburgh 9/26/2021Explore Bon AppétitPastaItalianEuropeanMackerelFishSeafoodTunaSardineTroutSpaghettiPasta & NoodlesParmesanCheeseQuickEasyWeeknight MealsMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Christina Chaey"]}