{"id": "16712a21dfb9c4bf95eee2b070fc8170", "url": "https://www.bonappetit.com/recipe/benne-biscuits-with-sausage-gravy", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Benne Biscuits With Sausage Gravy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueBenne Biscuits With Sausage GravyBy Ashleigh Shanti and Kaley LairdApril 14, 20204.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintBenne seeds are richer tasting than sesame but can be tricky to source. You can find them at ansonmills.com, but sesame seeds will also work. This recipe is from Benne on Eagle in Asheville, NC.Ingredients4 servingsBiscuits¾cup (94 g) whole wheat flour1Tbsp. baking powder2tsp. kosher salt3cups all-purpose flour (375 g), plus more for surface¼cup toasted benne or sesame seeds, plus more for sprinkling1cup (2 sticks) chilled unsalted butter, cut into pieces, plus 2 Tbsp. melted for brushing1½cups buttermilkGravy and assembly4Tbsp. unsalted butter1lb. pork breakfast sausage, casings removed1small onion, finely chopped2Tbsp. all-purpose flour2cups whole milk1tsp. apple cider vinegar¾tsp. crushed red pepper flakesPreparationBiscuitsStep 1Preheat oven to 375°. Whisk whole wheat flour, baking powder, kosher salt, 3 cups all-purpose flour, and ¼ cup benne seeds in a large bowl. Work in 1 cup chilled butter, smashing with your hands until pieces are the size of dimes and peas. Add buttermilk; mix with a rubber spatula to bring together. Knead dough a couple of times in the bowl until there are no dry spots remaining.Step 2Turn dough out onto a lightly floured surface; pat into a 6\" square. Fold dough in half, then in half again to create a smaller square. Pat back out to make an 8\" square, about 1\" thick. Cut into 9 equal-size squares.Step 3Transfer biscuits to a parchment-lined baking sheet, spacing 2\" apart. Brush with 2 Tbsp. melted butter and sprinkle with sea salt and benne seeds. Bake until golden brown all over, 25–30 minutes.Gravy and assemblyStep 4Melt butter in a large skillet over medium heat. Add sausage and increase heat to medium-high. Cook, breaking up with a wooden spoon as it begins to brown, until browned and halfway cooked through, about 5 minutes. Add onion; cook, stirring often, until softened, about 5 minutes. Add flour and cook, stirring, 1 minute. Add milk and bring to a simmer, stirring vigorously to avoid lumps. Reduce heat; simmer until thick, about 5 minutes. Season with salt and a generous amount of black pepper. Stir in vinegar and red pepper flakes.Step 5To serve, split 4 biscuits and divide among plates; ladle gravy over (you’ll have extra biscuits). Top with scallions and more black pepper.How would you rate Benne Biscuits With Sausage Gravy?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI only made the sausage gravy - delicious!! And so easy. Love love love it. Will definitely make this again. CaitlinVA12/26/2021Absolutely delicious. I would add a bit less salt  (1 tsp instead of 2) and if the dough gets crumbly, add a little bit of neutral oil before you roll it out. These came out amazingly and the gravy was devine. AnonymousBrooklyn5/18/2020Tore through the magazine and realized that I had everything for the gravy but not enough for the biscuits so I made box-mix squits but pulled off this gravy (!) which was...heaven sauce in a pan. Deeply flavorful and exactly the kind of treat that a Sunday morning in captivity calls for. AnonymousRedwood City, CA 5/11/2020This is easily the best biscuits and gravy I've ever had. Next time I'm in Asheville, I will be making a stop at Benne on Eagle. Bravo!Anonymous5/8/2020These taste delicious and are simple to make! The gravy has just the right amount of light heat to it with the red pepper flakes. Be absolutely sure to cut your 8 inch square dough into 9 exact equal size pieces, so 2.66 in x 2.66 in squares is what you are looking for! Just kidding, not sure why this recipe is so heavy on the math but it tastes awesome!! MastpointDetroit5/5/2020This was so, so good, and easily adapted in Covid times. This is easily the best sausage gravy that I've ever made --- it's a bit spicy on its own, but perfectly tamed with the biscuits. I loved the addition of the apple cider vinegar. I woke to find (at the the flour step in the gravy recipe) that my son had consumed the milk I was planning to use, so I combed the fridge for any leftover dairy and ended up with 3/4 C. whole milk, 1/2 C. whipping cream, 3/4 C. plain whole milk yogurt. Even with those unanticipated changes, it was phenomenal. I also subbed rye flour for wheat in the biscuits because that's what I had on hand. Anonymous5/3/2020I just happened to have benne seeds from Anson Mills but I don't think using regular sesame seeds would have mattered. We made the biscuits with white whole wheat flour instead of whole wheat flour because that's what we had.  The biscuits were a lovely creamy color and absolutely delicious plain with salted French butter. Do be careful to follow the instructions keeping the biscuits to 1 inch. We look forward to making the sausage gravy and cornmeal pancakes! Kudos chef Shanti.AnonymousLos Angeles4/21/2020Explore Bon AppétitSouthernAmericanSausageMeatButtermilkOther IngredientsWhole Wheat FlourFlourMainBakingJuneteenthBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Ashleigh Shanti", "Kaley Laird"]}