{"id": "167ed0ad38f93d5458532c82361d8ab8", "url": "https://www.bonappetit.com/story/platanos-maduros-horneados", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Baked Sweet Plantains | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPlátanos Maduros Horneados Are Caramelized Plantains Without the FryingThe hands-off route to caramelized goodness.By Melissa PaniaguaOctober 15, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.If you were to ask my parents if they eat fruits and vegetables with their meals, my mom would immediately respond with something along the lines of “We eat maduritos on a weekly basis.” And while I don’t really consider maduritos (what my family calls fried sweet plantains) to be on the same level as steamed broccoli, it’s true that in Nicaragua, it’s common to have this tropical fruit as a complement to whatever entree you’re serving.Maduritos, also known as maduros, are common in Latinx restaurants and in our Nicaraguan home, and I would never be one to turn them down, so trust me when I tell you that my family’s plátanos maduros horneados (a.k.a. baked sweet plantains) scratch that same itch but are even easier to make.For as long as I can remember, I’ve been eating this baked plantain dish along with jamón and relleno during the holidays with family in Nicaragua. That meant having it on Christmas Eve with my mom’s side of the family in Chinandega and for lunch on Christmas Day at my dad’s parents’ house in Managua. Lucky for me, we’ve carried this tradition with us to the United States, and I’ve recently turned it into an early autumn comfort food for my family too.Keep in mind that many of my Nicaraguan family recipes are never written down exactly as they are made, but are instead improvised and improved constantly over time—this is no exception. To make the plátanos maduros horneados, you’ll need butter, brown sugar, and yellow plantains. You’ll know your plantains are ready for this dish when they are more black than yellow and a tiny bit soft to the touch. They don’t have to be fully black, but the more the better. Sometimes you can buy them already ripe; if not, you’ll have to buy them in advance and let them ripen at home.Start by preheating your oven to 350° and buttering your baking dish entirely. We use a 9x13\" baking dish (or simply a Pyrex, as my family calls it), but you can change the baking pan size depending on the amount you want to make or the number of plantains you’re using. Peel the plantains—it’s easiest if you score them first by making shallow cuts down their lengths. You can place them whole in the buttered pan, but I slice them in half lengthwise—it’s just a matter of personal preference. You can also adjust the plantain size as needed to make them fit better in your baking pan. To finish, sprinkle brown sugar all over the plantains (you need to use enough so that it can melt and caramelize) and bake until they are golden brown, anywhere from 1–1½ hours. Oh, and if you are worried about too much brown sugar, don’t be. I can guarantee you will not mess it up.Photo by Chelsie Craig, Food Styling by Pearl JonesWe serve our plátanos maduros horneados straight out of the oven with a spoonful of either cream cheese or sour cream on the side. The generations-long debate of which dairy product goes best with this side dish is still up for discussion, but I know neither will disappoint.Melissa Paniagua is a freelance writer who loves green juice and coffee in equal measure.The more plantains, the better:PiñonThis cheesy layered casserole is the ultimate sweet-and-savory mash-up, thanks to ground beef simmered with sofrito and tomato, melty mozzarella, and fried plantains to top it all off. View RecipeExplore Bon AppétitIt's That SimplePlantainLatin AmericanRead MorecookingI’ve Been Making Roti Jala Since I Was 10. You Can TooBy Mehreen KarimcookingIf You Don't Love the Desi Omelette, Tell It to My MotherBy Shayma Owaise SaadatcookingChinese Fried Rice Pancakes Are My Mom’s Brilliant Way of Maximizing LeftoversBy Diana YencookingI Wouldn’t Have Dreamt of Making My Own Korma—Until I Figured Out This ShortcutBy Varu ChilakamarriRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-15", "author": ["Condé Nast", "Melissa Paniagua"]}