{"id": "169a8723f29d859805f5dc020e1bf8e9", "url": "https://www.bonappetit.com/story/make-the-most-of-ground-spices", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "How to Make the Most of Ground Spices | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You LOL at the Idea of Grinding Your Own Spices, Read ThisWe won't stop you from using pre-ground spices—but we will tell you how to make them better. By Sarah JampelMay 21, 2020FacebookTwitterEmailTed CavanaughFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.Compared to ground spices, whole spices stay good for longer. And that means that unless your ground spices are top-notch, you'll get a fresher, more potent product from toasting and grinding whole spices yourself. But even though whole spices are The Best, ground spices are without a doubt more convenient. (I don't know about you, but I'm not toasting and grinding spices on a weeknight.) That doesn't mean, however, that you have to settle for sub-par spices. To make the most of pre-ground spices, follow these guidelines:1. Respect their short shelf-lifeIf their color or fragrance fades, toss them. If they smell like nothing, they taste like nothing.2. If you can, buy in small quantitiesThis increases the chance you’ll get through them before they lose their power. How much sweet paprika do you really need anyway?3. Don’t eat them rawBesides cinnamon, cardamom, black pepper, and chile flakes, we don’t endorse the consumption of raw spices. Toasting or blooming spices brings out the most flavor.4. Just say no to pre-ground black pepperGrinding it yourself is easy, worth it, and, with this grinder, fun, too.This Pepper Mill Is So Much Better Than the RestI promise, this thing makes a HUGE difference.View StoryExplore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "Sarah Jampel"]}