{"id": "16a0ce9011118f9304bab26b1297177a", "url": "https://www.bonappetit.com/recipe/salty-blueberry-ginger-margarita", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Salty Blueberry + Ginger Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSalty Blueberry + Ginger Margarita Salty Blueberry + Ginger Margarita by Emily Schultz. Made with Cointreau, muddled blueberry, ginger simple syrup, and blanco tequila. By CointreauMay 13, 20213.3(9)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredients1\" piece ginger½cup sugar½cup water2Heaping Tbsp Fresh Blueberries1oz. Cointreau2oz. Blanco TequilaCoarse Kosher SaltIceCrystalized ginger (for garnish)PreparationStep 1Smash ginger with the side of your knife to expose the flesh and add it to a small heat proof container with 1/2 cup sugar. Pour 1/2 cup boiling water over the sugar and ginger, fasten a lid on the jar, and shake until the sugar is dissolved. Let it sit until cool. (Keep it in the fridge and use any extra in tea for a gingery kick or for more cocktails!)Step 2To a cocktail shaker add all of your blueberries and a pinch of salt. Muddle until the blueberries turn into a yummy mush.Step 3To your cocktail shaker add Cointreau, tequila, 1 oz. ginger simple syrup and lots of ice! You should fill your shaker up about 3/4 of the way.Step 4Shake your drink until the outside of the shaker is frosty and it's uncomfortable to hold the shaker, about 30 seconds.Step 5Take a paper towel and dip it into your leftover simple syrup. Swipe it around 1/4 of the rim of your glass, and then dip the now-wet side of your glass in salt.Step 6Add ice to the glass and strain your cocktail. Finish with a piece of crystalized ginger and enjoy!How would you rate Salty Blueberry \\+ Ginger Margarita ?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangle4 stars. \nPretty good, but I added 1 more tablespoon of blueberries, double the ginger (or steep it in the simple syrup overnight) and squeeze of 1/8 of fresh lime to brighten it up. Cheers!AnonymousLas Vegas, NV5/20/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-13", "author": ["Condé Nast"]}