{"id": "16aa1bb9a56566b6eca969fc072a1297", "url": "https://www.bonappetit.com/recipe/spaghetti-al-limone-with-asparagus", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Spaghetti al Limone With Asparagus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueSpaghetti al Limone With AsparagusBy Evan FunkeMarch 17, 20204.7(96)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintEvan Funke, chef-owner of L.A.’s pasta temple, Felix Trattoria, believes that pasta sauce should celebrate the craftsmanship of pasta rather than try to steal the spotlight. The citrusy olive oil sauce that naps on these noodles does just that, bringing out the spaghetti’s limber, delicate nature. “Coco Chanel that s**t,” he says. “She was all about restraint.” Do your best to thinly slice the asparagus on a deep diagonal so that it bends and twirls around your fork just as easily as the spaghetti does.Ingredients4 servings1lb. spaghetti⅔cup extra-virgin olive oil1large bunch asparagus, trimmed, thinly sliced on a deep diagonal4garlic cloves, smashed43\"-long strips lemon zest½tsp. crushed red pepper flakes8large basil leaves2lemons, halved2oz. Parmesan, finely grated (about 1 cup), plus more for servingPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1½ cups pasta cooking liquid.Step 2Meanwhile, heat oil in a large Dutch oven or other heavy pot over medium-high until shimmering. Add asparagus, season with salt, and cook, stirring often, until just beginning to take on color, about 1 minute. Add garlic, lemon zest, and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Remove from heat and let sit until pasta is done.Step 3Add pasta and basil to pot with asparagus mixture and return to medium-high heat. Squeeze juice from both lemons into pot and add 2 oz. Parmesan and 1 cup reserved pasta cooking liquid. Cook, tossing vigorously and adding more pasta cooking liquid if needed, until sauce is creamy and emulsified and pasta is coated, about 1 minute. Taste and season with more salt if needed. Remove and discard garlic.Step 4Divide pasta among bowls, placing a lemon strip in each, and top with more Parmesan.How would you rate Spaghetti al Limone With Asparagus?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleWe made this using1 & 3/4 large lemons. It was much too lemony - very sour. \nI think it would be helpful if you gave a quantity of lemon juice as the size of lemons varies quite a lot. \nI will make this again with half the amount of lemon juice. AnonymousEau Claire Wisconsin 3/7/2022How come the video from the test kitchen uses heavy cream and butter and yet the recipe does not? There is no asparagus in the video?\n\nHow about setting aside the strips of lemon zest and zesting the rest of the lemon into the heavy cream (where in the recipe is this?) and then adding butter???\n\nThe \"Molly makes Pasta al Limone in the Test Kitchen\", yet the directions do not detail the steps like the video. So I gather that this video is not for the recipe nor any of the other videos on the right side of the screen.\n\nWhat gives???Joe2752712/1/2021Fabolous dish! Definitely adding it to my repertoire of meals.CreaperMo10/12/2021Quick (esp if you do some prep ahead of time), easy and tasty. And healthful, right?AnonymousWethersfield, CT9/16/2021I made this for tonight’s dinner and it is amazing, flavorful and just delicious. I love the hint of lemon in this dish. Despite using the pepper flakes, it is not as spicy as I thought it would be. Everything just blends together so well. The simplicity of the dish all together is refreshing. It was super easy to make and did not take long at all to prepare. The ingredients are things most people already have in the cupboard. I will definitely make this again!!! Thank you for sharing!!!AnonymousWyomissing, Pa9/11/2021why, why,  why,  do people leave comments when they don’t even make the exact recipe I don’t want your stupid changes to the recipe I just want to know if you made it as listed and how it came out.   I plan to make it tomorrow night as listed in the recipe thank youAnonymoussan francisco9/3/2021I added shrimp, used gochugaru instead of chili flakes, and added a kaffir lime leaf. Fresh basil from the garden. Excellent, subtle lemon. Next time, I will use twice the asparagus. Robs MuirClaremont, CA7/7/2021This is absolutely delicious. I've made it once and can't wait to make it again. Thank you.TESKingston, Ontario Canada6/14/2021Loved the recipe, added some oyster mushrooms and cherry tomatoes and sauteed some shrimp too. perfect dinner!Dan NishLos Angeles, CA12/27/2020I have made this numerous times and I gotta tell you folks....F A N T A S T I C  !!\nIf you want a fast, light, easy to prepare meal then this is it.Big JoeMontreal,Canada12/26/2020Excellent. I used less oil, more asparagus and less lemon (1.5 lemons instead of 2). Also used traditional lemon zest as the wider lemon zest strips are more bitter. AnonymousToronto11/15/2020This is the second time I make this pasta dish. It's easy, so incredibly delicious and it's the best way to get my toddler to eat asparagus! Will become a regular staple when I cook dinner. mmenessCalifornia 7/30/2020Made this for dinner last night, but didn't have asparagus on hand so added some boneless chicken to make it more of a meal. It was quite tasty, a little heavy on the lemon for some tastebuds but will definitely adjust and make again! I think this would work really well with shrimp/seafood, might try that next time. AnonymousQueens6/9/2020Soooo oily and bland. The vegetable to pasta ratio was off too.Anonymous6/5/2020We absolutely loved this!  It was quick and easy and delicious, and can be adapted in so many ways based on what is in the fridge and pantry.  I added some pea shoots and garnished with a little fennel pollen and black pepper.  This will be a regular in our rotationshansterama6818Madison, VA6/5/2020Explore Bon AppétitPastaItalianEuropeanSpaghettiPasta & NoodlesAsparagusVegetableLemonCitrusFruitParmesanCheeseSpringWeeknight MealsEasyQuickMainVegetarianHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Evan Funke"]}