{"id": "16b1a63af0e1834d0632e6b5d9fed866", "url": "https://www.bonappetit.com/story/rectangular-tarts", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "A Round Tart Pan Is Nice, But A Rectangular Tart Pan Brings the Drama | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRound Tarts Are Nice, but Rectangular Tarts Bring the DramaI use my rectangular tart pan twice a year. It’s still worth it.By Christina ChaeyDecember 14, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Prop Styling Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.You know how moving your bed to a different wall in your room can make it feel like a whole new space? Changing out your standard cake and tart pans for a slightly out-of-the-box pan can work the same magic on your baked goods. Enter this very elegant, very dramatic long rectangular tart pan that I bring out twice a year when I’m in the mood to make a chic dessert for no reason at all.Yes, you heard that right—I use this pan twice a year. The rest of the time, it takes up space in my very full hall closet where I keep all my bakeware because I don’t have enough kitchen storage. But the oohs and ahhs it garners every time it shows up on the table make it worth it.Fat Daddio's Anodized Aluminum Rectangular Tart Pan$15 $13 at AmazonMy pan is a long and skinny rectangle measuring 4x13\", which means anything I bake in it comes out looking like a giant bar that can be sliced into elegant mini-bars for serving. Like many round tart pans, it comes with a removable bottom that makes it a cinch to unmold and transfer to a plate. I’ve used it to make all kinds of sweet and savory tarts, like a Meyer lemon tart with Paule Caillat’s genius brown butter tart crust and a caramelized onion and Gruyère tart with a walnut crust. But I also love using it as a cake pan to give cakes a look that’s totally different from the usual 9\" round. I’ve used it to make Amy Chaplin’s gluten-free almond cakes (the Roasted Apple-Almond Cake with Cardamom is a favorite) and I’ve tart-ified the famous Burros torte of tender cake thickly studded with big pieces of stone fruit.This vegan chocolate tart is looking very chic.\nChristopher TestaniThis pan is especially good for any tart that has a roughly equal ratio of filling to crust. At just 1\" tall, the walls of the pan aren’t particularly high, making it ideal for desserts with very rich or sweet fillings that you want just a taste of, like gooey pecans or creamy ganache. But I would shy away from anything where you want a high filling-to-crust ratio, like cheesecake or apple pie—the pan simply isn’t high enough.My pro tip: Heighten the drama even more by serving your tart on an equally long and elegant serving platter that makes it look somehow even more stunning. Sure, you’ll use that plate only once or twice a year, but you’ve already got the pan—you might as well lean into the elegance.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-14", "author": ["Condé Nast", "Christina Chaey"]}