{"id": "16b2303d4e38c1dd26766126755fd293", "url": "https://www.bonappetit.com/story/karon-davis", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Karon Davis Is Creating an Underground Art Oasis in the Heart of L.A. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKaron Davis Is Creating an Underground Art Oasis in the Heart of L.A.The co-founder of the Underground Museum is our Superpowered L.A. honoree.By Tasbeeh HerweesApril 19, 2018FacebookTwitterEmailPhoto by Lauren RossFacebookTwitterEmailWe're honoring Karon Davis as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. We'll be partying with Davis and our partner Caviar at Botanica in Los Angeles on April 25th. Tickets are sold out, but we're probably coming to a city near you soon.When the butterfly first appears in the garden, it feels like a set-up. Karon Davis, a co-founder of the Underground Museum, leads me past the black, iron-gated entrance—indistinguishable from the steel and brick warehouses that line the street in the Arlington Heights neighborhood of Los Angeles—and through the building’s cavernous chambers. The white walls stare at us blankly; the museum is closed for a month.Davis—who possesses the kind of meditative and tranquil presence more commonly attributable to a yoga instructor or reiki practitioner—guided me to the studio in the back, where she and her late husband and co-founder of the Museum, Noah Davis, lived when they first acquired the property. She walked me toward the bar, her long, beige duster flapping behind her, to where the cultural critic Hilton Als and the Black Lives Matter founder Patrisse Cullors have hosted discussions and workshops. “We used to sit here with the paper and a joint or a cigarette and talk or hold court,” she tells me. She stopped by the restroom briefly—its door declaring the facilities “out of order”—to show me the wallpaper, created by the renowned interior designer Sheila Bridges. “We’re going to put another bathroom in the back, put a beautiful chandelier in here,” she says.And then finally—finally—she pushes past the back door and, like an otherworldly portal, we’re transported to the garden: a lush, serene outdoor area with a courtyard for quiet meditation and a large open space used for outdoor film screenings. Davis was in the middle of a sentence when she stopped. \"Look at that butterfly,\" she said.The Monarch butterfly flew into the frame as if summoned by Davis herself.“That is so crazy,” she says in quiet awe. “There [used to be] nothing out here. We used to pray that a bee would come back here. We used to [say], ‘Can we just get something?’ And now there’s doves and all sorts of…” Her voice trails off.Davis, a sculptor, and her husband, a painter, opened the Museum in 2012, intending to create a place where people could see art from outside the traditional institutions and arbiters—museums and galleries. This section of Arlington Heights, she says, is an “art and food desert,” and when they first moved into it, the space that would become the Underground Museum was just a spare, empty warehouse with flourescent lighting.  “When we first came here, it was a piece of shit,” she says.“The number one thing for Noah was to bring world-class art to the space: things that were not accessible, to make it accessible,” she says. “To [Noah], museums and institutions can be...cold, so [he wanted] to create an inviting place where people can live among the art. Art is meant to be lived with.”The couple met more than a decade ago, not far from where the museum stands, through a friend. “I was a workaholic at the time, working for a [film] director that was so demanding, and he had a girlfriend so it didn’t work out,” says Davis. “But three years later, we got together, and he just came over and he never left.” They married in 2008, then opened the museum nearly seven years later.The bookstore at the front of the warehouse—which, when it first opened, operated like a library—went up first. With the museum's meager resources, they cleaned up the backyard, which was then just a landscape of gray concrete. They planted cypress trees and built large plant boxes that border the boundaries—boxes that, because they were improperly lined, are now bursting at the bottom with soil.They lived in the back with their young son, Moses, and sometimes with Noah Davis’s brother, the filmmaker Kahlil Joseph, Kahlil, who’s made music videos and films for Beyoncé, Flying Lotus, and Sampha, and who now manages the space with Davis. The first show that went up, in 2013, was called “Imitation of Wealth,” included Noah’s recreations of iconic pieces of art by artists like Jeff Koons, On Kawara, and Marcel Duchamp. “We [wanted] to show the people in the neighborhood that you don’t have to have a million dollars to have this work in your home, to live with beautiful things,” says Davis. “You can make beautiful things out of nothing.”Davis in Ojai\nPhoto by Lauren RossDavis had her first solo show of her own sculptures alongside “Imitation of Wealth.” She was raised in New York by a Broadway actor and a ballerina and followed in their footsteps by studying theater at Spelman College; she later attended USC film school. But for someone who trained in performance art, Davis is shy about showing her sculptures—it was something she liked to keep private, she says, until Noah challenged her to produce an exhibit of her own work. “Our first show, he gave me two weeks, he was just like, okay, we’re going to do this show, and then you’re going to do your show too,” says Davis. She met the deadline.The Underground Museum built a reputation for these kinds of renegade shows, eventually attracting the attention of Helen Molesworth, the recently ousted chief curator at LA’s Museum of Contemporary Art (MOCA). In 2015, the same year Noah was diagnosed with a rare form of cancer, he struck a deal with MOCA that gave him access to the museum’s collection. During his time at the hospital, Noah paged through the catalog and painstakingly curated 18 different shows, the first one of which was a video installation by the South African filmmaker William Kentridge.The second MOCA collaboration was called “Non-Fiction,” a thoughtful rumination on the black body and its treatment through history, which included artworks by Kara Walker, Kerry James Marshall, and David Hammons, a hero of Noah’s. Pieces from that show, including Theaster Gates’s “Sheol,” still hang in the back of the studio.At 32, Noah passed away before he saw either show go up. On his last birthday, Davis “busted him” out of the hospital room and took him to the museum, where Hammons surprised him with a visit. “Just the look on his face—like wow,” says Davis, remembering.Since then, using the plans her husband left behind for the MOCA collaborations, Davis —along with her brother-on-law—has been meticulously executing Noah’s vision. “He left it up to me to make the decision of what comes next,” she said. “I just meditate—what’s the next show, you know? I just go with the spirit, my gut.”Under her direction, the museum has earned an admirable reputation for its provocative programming. The garden oasis in particular has become a defining characteristic of the museum, transforming it into a community gathering space. There are free yoga classes and meditations. Last summer, it allowed a group of skateboarders from the community to build a small juice stand called The Tropics, where they sold healthy fruit and vegetable juices. This past February, a clothing brand called NoSesso debuted its collaboration with lifestyle brand Union in a backyard fashion show at the museum.Davis has been doing much of this from her new home, in Ojai, where she moved after Noah died. She’s no longer the workaholic she once was, when they first met. “I’m learning now to slow down, and really pace myself, and to say no to certain things that are not really serving my spirit and my health right now. Especially after Noah passed I was really all over the place, like, ‘I’ve got to get a career going, get the money to the museum, and take care of myself,’” she says. “I don’t think I really mourned that first year because I was still in shock.”She moved to Ojai, she says, because the light is so beautiful—on a fall day, or a summer evening, she says, the sky is filled with so much color. It’s in Ojai where she feels most compelled to make art. “I always run off to Ojai, and my little garage in Ojai, making art,” she says.” That's where I feel my safest, down here.”More than anything, she hopes she could extend that sense of safety to the museum’s patrons, to provide a refuge from the often hostile world outside its walls. In fact, she’s seen children come to the space and refuse to leave, afraid to return to their poor living situations. “There are some kids—and adults—that have never been to an art space before,” says Davis. “And kids come here… to be around the flowers and the bees and the birds, the butterflies. You don’t get that on the concrete outside of here.”The garden has come a long way from the simple planters’ boxes that used to occupy this space on their own. There’s a fountain, now, and a fire pit. There are plants springing up from the ground that Davis doesn’t remember planting. There’s astroturf that is comfortable to sit on and colorful transparent panes that hang down the pathway, casting beams of red, green, blue, and purple light across the building. People come here to write or think. “There’s something in being still and quiet that today is very hard,” says Davis. “Everything is so instant. But I would like to think that this space allows people to slow down. I think there’s a safe space for your spirit, for your mind, when you slow down.”Explore Bon AppétitHealthyishSuperpoweredprofileRead MorecultureAileen Suzara Is Flipping the Script About 'Unhealthy' Filipino FoodBy Melissa Pandika Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-19", "author": ["Condé Nast", "Tasbeeh Herwees"]}