{"id": "16c1db21ac8b63d3a2a4bf83c5a87d96", "url": "https://www.bonappetit.com/story/male-chef-redemption", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Why Are We So Obsessed with Male-Chef Redemption Stories? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Are We So Obsessed with Male-Chef Redemption Stories?Personal narratives can be powerful. They can also be dangerously limiting—depending on who’s doing the telling.By Amanda ShapiroMay 30, 2019FacebookTwitterEmailIllustrations by George WylesolFacebookTwitterEmailFrom Queer Eye to Britney Spears, we’re a culture consumed by stories of transformation. We want to hear about the fuck ups, the rock bottoms, the come-to-Jesus moments, the clawing out. We want to see who these people were before and who they become on the other side, and their lives become roadmaps for how we might handle our own flaws and shames.Those of us in food media understand this appeal as much as anyone, and the restaurant industry has given us plenty to work with. These days, I’m seeing male-chef redemption stories everywhere; I get as many PR emails tossing me tales of reformed bad-boy chefs as I do about turmeric. On Healthyish and Bon Appétit, we’ve run a handful of accounts of transformation, or at least self-improvement, from chefs like Naomi Pomeroy, Missy Robbins, Gabe Rucker, Sean Brock, and Andrew Zimmern. Most of these articles were written from the chefs’ perspectives, and that was an intentional choice. As an editor, I’ve always felt that the best way to tell a transformation story is in the words of the person who has transformed. These posts all got a lot of eyeballs and, more importantly, a lot of responses from readers telling us how much they could relate.But I’ve come to understand that there’s a pretty big problem with these personal narratives, which is that they are, by definition, one-sided. We know who’s telling the story. But we don’t stop enough to ask who, by extension, isn’t being heard.In February, we ran a first-person story by David McMillan, one of the chef-owners of Joe Beef in Montreal. It detailed McMillan’s hedonistic descent into alcoholism and his long journey toward sobriety, and the reader response was overwhelming. Half a million people read the article, and chefs like Zimmern and Brock shared it on Twitter with gusto. McMillan is frank about the self-imposed hell he lived in, but the focus of the piece is not on how his addiction affected the people he worked with; it’s on the positive impact his newfound sobriety has had across his restaurants.I’ve come to understand that there’s a pretty big problem with these personal narratives, which is that they are, by definition, one-sided.Last week, The New Yorker ran a reported article about McMillan and his business partner, Fred Morin, that details the same trajectory from wine-swilling party hosts to sober, serious restaurant owners. The writer Hannah Goldfield interviews employees past and present who described all kinds of unprofessional behavior at his restaurants, from groping to ass-grabbing to general bullying.Some of these incidents involved McMillan and some didn’t, but that’s mostly besides the point. Whomever the offender, McMillan’s employees weren’t able to come to him for help, because as McMillan himself acknowledges, “I was stuck drinking somewhere.”Personal narratives can be powerful, but they can also be dangerously limiting depending on who’s doing the telling. Addiction and abuse don’t affect the user in a vacuum; they’re shrapnel that hits whomever is in range. And when we let the bomb-thrower shape the narrative, we’re ignoring the people left in his wake. What story would’ve emerged if, instead of giving the platform to the repentant chef, we gave it to his former employees? How would they characterize their experience at Joe Beef before and after McMillan’s sobriety? I wish I knew.Even reported articles don’t always paint a complete picture. In September, Healthyish ran a piece about five well-respected chefs who’d all become sober and were hosting a non-alcoholic dinner at Feast, the Portland food festival. I remember cutting a section that went into why all the participants were men, and I didn't push the writer to question the chefs’ motives or bring in any critical voices. At the time, it seemed besides the point. But those additions would’ve made the piece more honest, nuanced, and timely.It’s curious that these redemption narratives have become so prevalent on the heels of the #metoo movement. For a time it seemed that our obsession had shifted from transformation tales to holding men accountable for their shitty behavior. It seemed that, when it came to sexual harassment, nobody wanted a transformation story. We just wanted the offender to go away.The workplace culture that encourages excessive drinking and drug use is the same culture that breeds sexual harassmentI think we’re attracted to stories like McMillan’s now because we want to believe that they’re not about sexual harassment or abuse. We want to believe that there are “good” male chefs who maybe drank a little too much but then straightened themselves out and made amends. I think we're gravitating to these stories out of some collective desire for catharsis amid so much terrible news.But the reality is that the workplace culture that encourages excessive drinking and drug use is the same culture that breeds sexual harassment. It’s irresponsible to talk about the former without acknowledging the latter, and it’s equally irresponsible to narrow our perspective to a single “hero” the way these redemption stories often do.It would be naive to argue that we can break our cultural addiction to the redemption narrative. It is, after all, one of the oldest stories we have, from Odysseus to the Prodigal Son to Ebenezer Scrooge. This story will never stop compelling us, but it’s crucial to acknowledge that there’s something blinding about its power. Only once we acknowledge this will we start to see beyond it, to consider what other arcs and other voices might tell us about how people err, who they harm, and how not just one person but all of us can heal.Explore Bon AppétitFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-30", "author": ["Condé Nast", "Amanda Shapiro"]}