{"id": "16c4f596d050e119fc9dc0b4c86ef07e", "url": "https://www.bonappetit.com/story/what-is-activated-charcoal", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "What Is Activated Charcoal, and Is It Really Safe? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Activated Charcoal, and Is It Really Safe?Drinking black water is kinda fun, but is it really good for us?By Aliza AbarbanelAugust 23, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSometime over the past few years, activated charcoal burst into our lives like the Kool-Aid Man gone goth. Everything was black: ice cream, toothpaste, even water. It doesn't take much to launch a crazy-colored food trend, but what is activated charcoal anyway? And when we saw the laundry list of health claims (Whiter teeth! Purified air! General \"detoxing!\"), we had even more questions. Namely: Are these seemingly endless uses too good to be true?Okay, what’s activated charcoal?Activated charcoal is processed to create small pores that increase charcoal's surface area available for adsorption, a.k.a. the adhesion of molecules to the surfaces they come in contact with. (Adsorption draws molecules to a surface kinda like a magnet; absorption works like a sponge)  This process is typically created through exposure to high heat, namely burning materials like oak and coconut shells. Once charcoal is “activated,” it can be used in anything from soap and towels to natural air purifiers and, yes, our food.This air purifier uses activated charcoal to filter odors and chemicals. Plus it looks super cool.\nPhoto by Alex LauWhat’s it good for?“Activated charcoal has long been used in hospitals to remove poison from the gastrointestinal tract before it's absorbed into the body,” says Maya Feller Ms, RD, CDN. Charcoal has made the jump from poison control and ER rooms to wellness-minded cafes over the past few years, but that doesn’t mean you should be adding it to your supplement rotation. Activated charcoal may be advertised as a “detoxifier” for fixing hangovers and overindulging on french fries, but it doesn’t just target “bad” particles—it sucks up whatever it can get, including valuable nutrients and even medication. “There is some evidence that activated charcoal has been shown to bond to vitamins, which means it may remove them from your system,” says Feller. “I would caution against daily use especially for people that are taking prescription medications or supplements.”But what about those trendy black drinks? “There's no evidence that activated charcoal is beneficial when consumed on an everyday basis for the general population,” says Feller. “The amount of activated charcoal included in detox drinks is usually not substantial enough to make a difference one way or the other, and any purported health benefits are likely negated by the bonding of the charcoal to the nutrients in the drink.” In other words, drinking a charcoal latte before or after a meal can potentially limit the amount of nutrients your body actually gets and even render prescriptions like oral contraceptives ineffective.If you do want to reap the benefits of activated charcoal, it's safest to stick to using it outside your body. Try using it as a water filter to reduce chlorine and balance water pH, in body towels to pull dirt out of pores, or even as an all-natural cleanser. Just don't expect the charcoal soft-serve to make you healthier.Explore Bon AppétitHealthyishCharcoalTrendsRead MoreLifestyleA Nutritionist’s Guide to Safer, Smarter SupplementingBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Aliza Abarbanel"]}