{"id": "16c76e2f6b96a980ef6be5f43efa6853", "url": "https://www.bonappetit.com/story/willdair-salad", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "The Wildair Restaurant Salad Is My Favorite Salad in NYC, and I Can Finally Make It at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is My Favorite Salad in NYC, and Now I Can Make It at HomeIt's all thanks to A Very Serious Cookbook, out now from the chefs at Contra and Wildair in NYC.By Priya KrishnaOctober 16, 2018FacebookTwitterEmailPhoto by Matty Yangwoo KimFacebookTwitterEmailThe first time I ordered this dish at Lower East Side wine bar Wildair, it appeared as a light green shell, barely visible under creamy squiggles, with pebble-like pistachios and wayward herbs sticking out the top—it looked more like a terrarium than something I was supposed to eat.The terrarium turned out to be one of the most well-composed restaurant salads I had ever had. The dish—which is served at both Wildair and its sister spot next door, Contra—ticks all of the boxes; Two kinds of crunch (lettuce + pistachios), creaminess (the BUTTER-based dressing; more on this soon), freshness (chives and chervil), and a lingering hit of acid (lemon). And the whole thing is presented on a sturdy bed of Little Gem lettuce, giving it both visual appeal and hand salad convenience. The Wildair menu is riddled with hits (see: pork milanese, chocolate hazelnut tart, fried squid), so the fact that this salad is the dish I think about all the time feels like a feat.So imagine my delight when I received a copy of A Very Serious Cookbook, Wildair and Contra chefs Jeremiah Stone and Fabian von Hauske Valtierra’s hit list of recipes from their restaurants, and found the Little Gem salad recipe right there on page 50. Even better, I discovered that the recipe was super simple, and I already had 95 percent of the ingredients (lemons, butter, an egg, olive oil) at home.Von Hauske Valtierra says that the dish was born from leftover leaves they had after picking out the hearts of Little Gems for another dish and a desire to serve a self-contained starter that could be eaten with your hands (though you can use any kind of sturdy lettuce as a base).The secret ingredient, of course, is the butter, an ingredient that you rarely see in salad but that plays a pivotal role in this one. To make the dressing, some of the Little Gem leaves are cooked in butter, a technique the two chefs discovered at Noma in Copenhagen. “You just get a little more depth and roast-y flavors from cooked lettuce,” says Stone. Second, the residual butter from the pan is blended with the cooked lettuce, along with an egg yolk, salt, and pistachios, to make a dressing that’s thick and rich but still tastes clean. Stone says the butter, as opposed to mayonnaise, “has a little more texture to it, and gives the dressing a starchiness” that goes nicely with the juicy lettuce.At the restaurant, the dressing gets generously scrawled with a squeeze bottle (or you can just spoon it) on top of pieces of Little Gem lettuce that have been drizzled with lemon juice, olive oil, salt, and pepper. The salad is finished with some pistachios and fresh chopped chives and chervil to complete that forest-y look.But the salad’s bucolic appearance also plays a very practical purpose. Because of the way the salad is structured, every bite brings the perfect ratio of greens to dressing to nuts to herbs.That’s why Stone says the dish is so beloved. At first glance, it appears very high-concept, like a plating gimmick in a fine dining restaurant. “But it’s actually pretty straightforward,” he says. At the end of the day, it’s just a well-dressed salad. “It doesn’t really look like how it eats.”Get the recipe:Little Gem Salad with Pistachios and HerbsThe best part of this dish is that the leaves here are intact, so they don’t get dressed in a conventional way—kind of a more elegant wedge salad.View RecipeExplore Bon AppétitHealthyishSaladNew YorkRestaurantsPistachioLittle GemRead MorerestaurantsOne of NYC's Coolest Restaurants Just Launched a Vegetarian Tasting Menu Because the People DemandedGallery6 SlidesBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Priya Krishna"]}