{"id": "16cbda6031a96e2c7b28abd27b9157bf", "url": "https://www.bonappetit.com/recipe/berbere-spiced-roast-chicken-and-vegetables", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Berbere-Spiced Roast Chicken and Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueBerbere-Spiced Roast Chicken and VegetablesBy Chris WilliamsSeptember 14, 20213.8(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChris Williams loves to use berbere, a hot and complex Ethiopian spice blend, at his restaurant Lucille’s in Houston. “It’s one of my favorite tools for bringing excitement to humble ingredients,” he says. Williams employs it here to create a flavorful paste, which he rubs all over a whole chicken before roasting it over root vegetables. It’s a simple but satisfying one-pan meal that welcomes whatever seasonal veg you might have on hand.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At Amazon3-Qt. Baking Dish$17 At AmazonCitrus Juicer$7 At AmazonSmall Skillet$40 At AmazonIngredients4 Servings5Tbsp. extra-virgin olive oil, divided, plus more6garlic cloves, coarsely chopped½cup berbere2lemons, halved2½tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus more6radishes, trimmed, halved2cups fingerling or other small potatoes (about 14 oz.)1cup brussels sprouts (about 5 oz.),  halved1cup baby carrots (about 6 oz.)Freshly ground black pepper13½–4-lb. whole chicken1small onion, quartered⅓cup parsley leaves with tender stemsPreparationStep 1Preheat oven to 400°. Heat 4 Tbsp. oil in a small skillet over medium. Cook garlic, stirring constantly, until softened and light brown, about 3 minutes.Step 2Scrape oil and garlic into a blender. Add berbere, juice of 2 lemon halves, and 2½ tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt. Purée to a loose paste.Step 3Place radishes, potatoes, brussels sprouts, and carrots in a 3-qt. baking dish. Drizzle with remaining 1 Tbsp. oil and season with salt and pepper. Place chicken, breast side up, on top. Massage berbere paste all over skin, inside cavity, and between breast and skin. Stuff cavity with onion and 1 lemon half. Loosely cover baking dish with foil and roast 1 hour.Step 4Remove foil and continue to roast until chicken is well browned and an instant-read thermometer inserted into the thickest part of a breast registers 155° (temperature will climb to 165° as chicken rests), about 30 minutes longer. Let chicken rest in baking dish at least 15 minutes before carving.Step 5Toss parsley with juice of remaining lemon half and a drizzle of oil in a small bowl; season with salt. Serve chicken with vegetables alongside; top with dressed parsley.How would you rate Berbere-Spiced Roast Chicken and Vegetables?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThe flavor of the berber was delicious on the chicken and roasted vegetables - make sure to toss the veg in the pan drippings! I will say that the spice paste was very difficult to spread over the chicken as it clumped very easily. I would favor a berbere dry rub then a brush with oil or melted butter. A lemon in the carcass perfumed the chicken nicely. PaulAnn Arbor, MI1/19/2022I wanted to do a quick version for an easy weeknight meal.  I started with two split breasts and four thighs, used about 1/4 cup of berbere spice, the juice of half a lemon, and two garlic cloves, along with corresponding smaller amounts of olive oil and salt.  After covering the chicken parts with the paste, I tossed the veggies in a bowl with the remnants of the paste and a tsp of Kosher salt, and put everything into the oven at 375 degrees on two sheet pans.  I put the split breasts on the bottom sheet to avoid them drying out.  Cooked for 20 minutes, rotated them, keeping the breasts on the bottom, then finished by putting each sheet under the broiler for two minutes.  I cut the other half of the lemon into wedges, which we squeezed over our plates.  The result was excellent, and the clean-up was a breeze.  This recipe will be a staple going forward!GregWellesley, MA1/4/2022Hope to make this soon.  I found recipes on another cooking site to make my own Berbere.  I wish BA included the steps for homemade spice mixes, since I would guess that many of their readers have big spice collections.  Just started my subscription to BA, too. :) MK in MadvilleMadville PA 11/11/2021For all the questioning - the 1/2 cup of berbere is correct. I made it and it turned out perfectly. My roasting time was a little bit longer but possibly because my oven isn't the hottest. Really great and flavourful. AnonymousCanada10/12/2021Just a thought. I think the recipe meant 1/2 oz. not 1/2 cup of Berbere.  I used Berbere spice from Whole Foods.Silvana9/30/2021I would love to know if the amounts of the ingredients are accurate. Is it 1/2 cup or 2oz. jar of Berber spice? Half Cup was so much and cover the chicken in a paste that burned in the roasting pan. One jar would have been more liquid and less pasty and patchy. I would reconsider this amount - seems like it was double what was necessary for coverage and flavor.Silvana9/28/20211/2 cup berbere - is this berbere paste or sauce?AnonymousCanada9/27/2021what brand of berbere spice do you use and where can I find it ?Anonymous9/20/2021Explore Bon AppétitRoasted Vegetablesroast chickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Chris Williams"]}