{"id": "16d362917a41e2119380f000abe67bdf", "url": "https://www.bonappetit.com/recipe/chicken-inasal", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Chicken Inasal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueChicken InasalBy Tom CunananMay 21, 20194.2(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintForget everything you think you know about grilled chicken. This recipe from Tom Cunanan of Bad Saint in D.C. shatters expectations by packing in tons of flavor from lemongrass, seasoned rice vinegar, achiote seeds, and even Sprite. Try the marinade on chicken wings, thighs, or drumsticks, too.Ingredients8 servingsAchiote Oil2lemongrass stalks, trimmed, tough outer layers removed, thinly sliced6garlic cloves, crushed12\" piece ginger, peeled, thinly sliced1¼cups vegetable oil⅓cup achiote (annatto) seedsChicken and Assembly3lemongrass stalks, tough outer layers removed, thinly sliced1head of garlic, cloves separated, chopped1small shallot, chopped12\" piece ginger, peeled, chopped¾cup seasoned rice vinegar½cup Sprite or 7UP1Tbsp. kosher salt, plus more4chicken legs (thigh and drumstick)Special EquipmentEight 8\" metal skewers or soaked wooden chopsticks or bamboo skewers (optional)PreparationAchiote OilStep 1Bring lemongrass, garlic, ginger, oil, and achiote seeds to a simmer in a small saucepan over medium heat. Reduce heat and simmer gently, stirring very occasionally, until oil is brick-red and fragrant, 30–45 minutes.Step 2Do Ahead: Achiote oil can be made 1 week ahead. Let cool; cover and chill.Chicken and AssemblyStep 3Combine lemongrass, garlic, shallot, ginger, vinegar, Sprite, and 1 Tbsp. salt in a large resealable plastic bag. Whisk to dissolve salt. Set chicken legs, skin side down, on a cutting board. Working one at a time, cut a ½\"-deep slash along both sides of thigh bone with a paring knife (this lets the marinade penetrate and helps the meat cook more quickly). Add chicken to bag and close, pressing out as much air as possible; turn to coat. Marinate at least 6 hours and up to 12 hours.Step 4Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side; for a gas grill, leave one or two burners off). Remove chicken from marinade and secure each piece with 2 skewers if desired (the skewers will help you maneuver chicken on the grill without tearing the skin). Season lightly with salt. Discard marinade.Step 5Grill chicken over hottest side of grill, turning occasionally, until deeply browned and charred in spots, about 5 minutes. Move to cooler side of grill and cover. Continue grilling (covered), basting with achiote oil and turning every 5 minutes or so, until skin is burnished and meat is cooked through, 30–40 minutes longer.How would you rate Chicken Inasal?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangle@David you don't need to strain the oil. This would even be better if you can use rendered chicken oil. For the chili vinegar just remove the stem. Put chilies, ginger, garlic, and shallots in a bottle and top it off with coconut vinegar. In the family we make a big bottle every month. We usually wait a month for the spiced vinegar to be ready.Jax ReyesSan Francisco 10/8/2021Quick question:  Should I strain the achiote oil after cooking the oil and the spices together in the pan?\nAnd for making the chili vinegar (blended in a blender), should I use the red chilies whole or cut off the stem?DavidInverness, CA12/29/2020Hi Bon Appetit Team! I am from the island in the Philippines where Chicken Inasal is famous for and seeing this in your website makes me reeaallyy happy. Honestly never expected it to see in an international website. You hit every ingredient my Filipino heart, rather my Negrense heart is crying. \n\nMuch love to you guys <3YaniCanada12/10/2020This is a bastardized version of the original using 7up. The original does not use sugar now soda at all. The key is the use of coconut vinegar to flavor this dish.Alexie ClaparolsBacolod9/14/2020Absolutely delicious. I substituted turmeric and paprika for the achiote seeds (didn’t have any on hand), but next time I’ll track them down for the real deal. The chicken was juicy and unbelievably flavorful. jmrhallFlorida11/17/2019Hi This recipe is wonderful!! But for the German persons comment, that is not the Achiote oil in the center of the chicken in the picture. That is a pic of chile vinegar that was served with this dish. The Achiote oil is for basting the chicken. It is is the June/July 2019 Bon Appetite magazine. You can find the recipe for it along with the Chicken Inasal and also an amazing watermelon feta salad to serve with the chicken. SOOOO DELISH!!!!Foodie1964Albany, NY10/2/2019As a German, I have never tasted Filipino food, so I was skeptical when I tried it.\nGlad I did because this was quite delicious. Very flavorful.\nThe picture shows the achiote oil at the center of the serving plate, but the recipe doesn't say that you should use it as a sauce for the chicken. I drizzled some of the oil on the chicken and the roasted potatoes I made with it and it made a big difference.\nI will definitely do this again and again and again. I'm thinking of roast chicken next time.heikoSGermany5/23/2019Explore Bon AppétitFilipinoSoutheast AsianAsianLemongrassHerbs & SpicesGingerChicken LegChickenPoultryMainDairy-FreeGluten-FreeNut-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}