{"id": "16dd74121c6b27e862e66004f6624b4e", "url": "https://www.bonappetit.com/story/kwame-alexander-mothers-day-community-poem", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Twelve Poets Created This Ode to Mothers—and Their Kitchens (Listen) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTwelve Poets Created This Ode to Mothers—and Their KitchensIn honor of Mother’s Day, Kwame Alexander asked a dozen fellow poets for a few stanzas on how their lives—and their cooking—now mirror their mothers’. Here’s what happened next.By Kwame AlexanderMay 7, 2021FacebookTwitterEmailIllustration by Gaurab ThakaliFacebookTwitterEmailLast month I asked 12 accomplished writerly friends to reflect on how their lives may now mirror that of their mothers, with a particular focus on what happens in their kitchens. They each got the same prompt—“I Am Becoming My Mother”—a title I borrowed from the Jamaican poet Lorna Goodison (who also contributed some new stanzas for this project). Then, like a puzzle maker, in the tradition of the surrealist drawing game known as Exquisite Corpse and the collaborative renga poetry of Japan, I took the pieces and assembled a tapestry of lines to create one crowdsourced, community poem. These are our voices. As one. —Kwame AlexanderListen to Kwame read the poem below:ContentThis content can also be viewed on the site it originates from.The Ceremony of GivingI am becoming my motherin ways I never expectedcursing the Boston Red Soxwhile okra softens like her facekneading the ceremonial Friday night challah—the same dark veins, the Tigris, the Euphrates,spreading life into each tributary.The way I fan the cucumberfor my daughters’ daughteror fold the prayer beneath the forkThe way she gatheredhandfuls of my damp red curlsin a towel at bath time,her fingers pulsing with loveguiding me without a wordthrough the maze of childhoodand the shadows beyondI am becoming my motherunexpectedly hummingher favorite Chopin étudein the kitchenas if it were 1958Molding soft fleshcutting each biscuit, making sure notto twist the cutter and seal the edges.My hands pressed against the open shells of eggsquickly movingfrom pot to potjust as hers did—tuning each course of the meal like drums.We’re golosinas, women who love sweetsat the market, I pick a ripeavocado the way she taught meI’ve accepted my señoratransmutation, the needto feed my family until they groan.I hear her voiceAre you full? Are you full?Each matzo ball big as the moon in the sky.Such humble nourishments.Sometimes I forgetthat poverty stuns us into brilliance.I am becoming my mother,brown/yellow womanmajestic like Mahalia.The captain of everythingThe magician—her wand a knife—fingers smelling always of onionscarrots, zucchini, red pepper, spinach—each one waiting for its turnto cast its decadent spellto perfume our skin, our hair, our clothes,to teach us the ceremony of givingIngredient by ingredient.Contributors:Van G. Garrett is the winner of the 2020 Poetry Question Chapbook Contest for his book, Scrap. He is also the winner of the 2017 Best Book of African American Poetry for his book, 49: Wings and Prayers, as announced by the Texas Association of Authors.Lesléa Newman is the author of 75 books for readers of all ages, including the memoirs-in-verse, I Carry My Mother and I Wish My Father; the novel-in-verse, October Mourning: A Song for Matthew Shepard; and the children’s classic, Heather Has Two Mommies.Margarita Engle is the Cuban American author of many award winning verse novelsand picture books. She is a former national Young People's Poet Laureate, and lives in central California.Marjory Wentworth is a poet, children’s book author and non-fiction writer. She teaches at The College of Charleston; she is the former poet laureate of South Carolina.Richard Michelson’s most recent poetry collection is More Money Than God. He received the 2017 Sydney Taylor Gold Medal from the Association of Jewish Libraries and the 2018 National Jewish Book Award.Janet Wong, the 2021 winner of the NCTE Excellence in Poetry for Children award, is the author of 35 books, including A Suitcase of Seaweed & MORE, a collection of poems, prose, and writing prompts for young people.Georgia Heard is the author of 18 books including a forthcoming collection titled A Field Guide to the Heart. She received an MFA in poetry from Columbia University, and travels the world giving workshops on writing and poetry.Ann Marie Stephens is the author of numerous picture books including Scuba Dog, Cy Makes a Friend, Arithmechicks Add Up, Arithmechicks Take Away, CATastrophe! and forthcoming titles in the Arithmechicks series.Maritza Rivera, a Puerto Rican poet and Army veteran, is the founder of the Mariposa Poetry Series, and the author of About You, a collection of poetry “for women and the men they love”; A Mother’s War, written during her son’s two tours in Iraq; and Twenty-One: Blackjack Poems.Reuben Jackson served as curator of the Smithsonian's Duke Ellington Collection in Washington, D.C. for over twenty years. He is a poet and writer whose music reviews have been published in the Washington Post, Washington City Paper, Jazz Times, and on All Things Considered.Lorna Goodison is one of the Caribbean's most distinguished contemporary poets. Her second poetry book, I Am Becoming My Mother, received the Commonwealth Poetry Prize for the Americas, and she was appointed poet laureate of Jamaica in 2017.Erika Sánchez is the daughter of Mexican immigrants. A poet, novelist, and essayist, her debut young adult novel, I Am Not Your Perfect Mexican Daughter, is a New York Times Bestseller and a National Book Awards finalist.Deanna Nikaido is the author of two poetry collections, Vibrating with Silence and Voice Like Water. She is currently working on her first children’s book along with a third collection of poetry and is a student of Jin Shin Jyutsu.Kwame Alexander is the Writer-in-Residence at the American School in London as well as NPR Morning Edition’s Poet-in-Residence. He is the author of 35 books, and co-creator of a Disney+ series based on his Newbery Medal-winning novel, The Crossover.Explore Bon AppétitPoetryMother's DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-07", "author": ["Condé Nast", "Kwame Alexander"]}