{"id": "16f14629975d132f34b4227c5058840d", "url": "https://www.bonappetit.com/story/nuts-and-nuts-cashews", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "These Cashew Nuts Are Honestly Addictive  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingHelp, I Can't Stop Eating These Fiery, Sweet, and Ridiculously Fresh Cashews!Farm-direct cashews toasted in coconut oil and mixed with fresh herbs and spices? Okay!By Nikhita MahtaniJanuary 28, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSnack aficionados usually fall into two camps: the sugar lovers, who dive into the candy bowl or the bakery aisle, and the salty types who crave pretzels or a big bag of chips. But I want my snacks to be salty and sweet...oh, and spicy too. Blame my Indian heritage and the fact that my mom used to eat whole chilis while she was pregnant with me, but if something isn’t spicy, I don’t eat it. (“Your taste buds are dead,” a very sweet ex-boyfriend once said to me.) And the one snack I’ve found that fits all these requirements: Nuts+Nuts slow-roasted cashews.My nutritionist, Lauren Slayton, first introduced me to these cashews, and at first I was skeptical because bags of nuts usually remind me of the mediocre selection served on airplanes. But when I tried the chili lime flavor, made with sugar, lime leaves, fresh chiles, salt, and garlic, I was sold. They have a fiery kick from the chiles and a sweet exterior and crunch from the caramelized sugar, so it’s kind of like eating spicy candy (told you I’m weird), and the citrus is just tart enough to offset the spice.The roasty, toasty cashews are mixed with chilis, lime leaves, and sweet-salty garlic bits.\nPhoto by Alex LauSisters Cyrilla, Nuning, and Cecielia Suwarsa are the brains behind Nuts+Nuts, which began when a lupus diagnosis forced Cyrilla to move from L.A. to Indonesia for treatment. “So many farmers were using the cashew apples as fodder for various skin treatments like moisturizers, but were discarding great-quality cashews,” she explains. “They gave us several huge bags, and we decided to roast them using our grandmother’s old recipes and give them as gifts to our friends at Christmas.”Soon people were clamoring for more—and the sisters realized they had the makings of a business. Cashews can only be grown in tropical regions, so the sisters wanted to make sure that their local products really paid homage to the places they were sourced from. “We have relationships with farmers in Java and Bali, and then all the ingredients for the flavors are also local,” says Suwarsa.The company offers several flavors inspired by Suwarsa’s Indonesian heritage, like crunchy honey sesame similar to granola and pungent black pepper that’s a little zesty in its own right. Each cashew is slow roasted in coconut oil to bring out its inherent smoothness, and all the ingredients listed on the label, from lime leaves to lemongrass, are visibly present in the bag.Because there are no preservatives in these cashews, the flavors and levels of heat can vary from bag to bag, so it’s kind of like playing snack roulette. But if you get a bag that’s too spicy for your taste, just send it on over to me.Buy it: Nuts+Nuts Cashews in Chili Lime Leaves, $5.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingSnackHealthyishHealthy SnacksCashewNutRead MoreLifestyleI Hated Hard-Boiled Eggs With a Passion Until I Tried These Peckish SnacksBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-28", "author": ["Condé Nast", "Nikhita Mahtani"]}