{"id": "16fd1bb978ff5b56c55acc46c943a8d6", "url": "https://www.bonappetit.com/story/never-fail-slow-roasted-salmon-with-citrus", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Luxuriously Roasted Salmon That’s Restored My Faith in a Boring Old Filet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Luxuriously Roasted Salmon That’s Restored My Faith in a Boring Old FiletMake this olive oil-doused, citrus-dotted dish, and prepare to be converted to Team Salmon.By Elyse InamineOctober 5, 2018FacebookTwitterEmailDitte IsagerFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.When I spot “salmon” on a restaurant menu, one word automatically pops into my mind: Boring. Maybe I’m a snob, but I can’t help it. Often times, the fatty, Creamsicle-hued slab is just there to appeal to the least adventurous eaters. It tends to be handled in the most mundane way possible—maybe served as a skinny filet, seared in a pan, and flecked with black garlic or pickled beets. See? Boring.But when I stumbled upon Alison Roman’s roasted salmon recipe a couple months ago, a new phrase surfaced in my brain: I must eat this. And that’s what I did. Again. And again. It was love at first click.It’s almost stupidly simple to make. You start by thinly slicing a jewel box of aromatics—anise-y fennel, tangy-sweet blood orange and Meyer lemon, spicy-fruity Fresno chile—and toss them in a baking dish with sprigs of dill and a bit of kosher salt. Then, you lay the salmon on top of that beautiful bed of pretty things, sprinkle on a bit more salt, and shower it all with nearly a cup of olive oil.You can also use the same slow-roasting technique with this harissa salmon recipe.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThat’s the secret to what makes this salmon so special: You're practically poaching the salmon in all that olive oil, making it impossible to overcook (more or less). And even if you’re constantly poking the fish to be sure you don’t go over that perfect coral-hued medium-rare (at 275°, that's like 30-40 minutes in the oven), it won’t mess up the presentation. Once the salmon is done, you break it up into hunks on whatever pretty platter you have, then scatter the plate with your perfectly roasted aromatics, replacing the wilty dill with lots of the fresh stuff. The result is the equivalent of a perfect hair day: You roll out of bed, do absolutely nothing, and somehow get tons of compliments.Simply put, this is the recipe that has restored my faith in the maligned protein. And while I’m content to eat it myself (it works without the chiles, and with a splash of soy sauce too), I’ve also tested it on friends. This table full of near strangers immediately bonded over one show-stopping dish. The salmon is that powerful. It can bring people together, and convert even the most stubborn salmon hater into a salmon lover.Get the recipe:Slow-Roasted Salmon with Fennel, Citrus, and ChilesDon’t bother trying to divide this fillet into tidy portions. Instead, use a spoon to break it into perfectly imperfect pieces.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Elyse Inamine"]}