{"id": "17039ba54a1a9da32ff757c9c57423ee", "url": "https://www.bonappetit.com/story/uttapam-pancakes", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "These Uttapam-Inspired Pancakes Are Tangy, Savory, and Satisfying | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mom’s Time-Saving Trick for Superfast UttapamThese aren]t exactly like uttapam—but they’re close enough.By Urmila RamakrishnanMarch 24, 2022FacebookTwitterEmailPhotograph by Isa Zapata, Food Styling by Judy Kim, Prop Styling by Stephanie De LucaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes we make with our eyes closed. Today, uttapam pancakes.While I love a thick, fluffy stack of pancakes with syrup dripping down the sides, for me the ultimate nostalgia comes from uttapam-inspired pancakes. Unlike traditional uttapam, a Tamilian and South Indian staple that has a batter of rice and lentils that’s often fermented for hours, these are made from store-bought pancake mix and buttermilk—my mom’s time-saving solution.When I was growing up, she would make these as part of our weekend breakfast rotation. I loved watching the ghee slip and slide in the hot pan as she’d ladle out the batter and add red onions, vibrantly green cilantro, tomatoes, and red or green chile as the pancake began to brown around the edges and little air bubbles emerged on the surface. From there, it was a race to get as many of the toppings on before it was time to flip. She’d hover patiently until the onions caramelized on the bottom, then deliver the pancakes directly from the stove to whoever’s plate was empty.Syrup and butter are to sweet pancakes what podi (which translates to powder) and chutney are to these savory ones. It’s all about the condiments for dipping. I’d mimic my dad by making a small mound of podi, made from ground dal and hot chile and often nicknamed gunpowder, and then forming a well to fill with gingelly (sesame) oil. He’d then mix the two together, like you would mix eggs into flour for pasta dough. We’d tear off a piece of pancake and dip it in the mixture for the perfect bite of onion, masala, and tomato.Now, these pancakes are my go-to whenever I’m missing those days of sitting around our dining table with family but didn’t plan ahead enough to make the traditional fermented batter. And they’re always accompanied by a mound of podi and gingelly oil or zingy green chutney.Here’s how to make uttapam-inspired pancakes:Make pancake mix, like Bisquick, according to the package instructions, but use buttermilk in place of milk for characteristic tanginess. Add 1 tsp. salt. Heat a griddle or nonstick skillet on medium heat and use a pastry brush to add enough ghee to the pan just to coat the whole surface. Ladle in the batter so that you have about 6\"-diameter pancakes. Add about 1 tsp. each chopped red onion, chile, cilantro, and tomato. Once you see air bubbles forming and the sides are golden brown, carefully flip. Allow onions to caramelize and brown, about 1–2 minutes, before taking it off the heat.For me this isn’t complete without the condiments. My favorites are a green, herby chutney (like store-bought or homemade mint or cilantro chutney) and podi with gingelly oil. You can find it at your local Indian grocer, or order online from companies like Podi Life—my favorite is their crunchy peanut variety. I mound the podi on my plate and create a little well for the sesame oil, then combine them with my fingers. Alternate between the podi and the chutney for a satisfying breakfast.  While these pancakes may not be dead ringers for traditional uttapam, on a groggy morning, they’re just close enough.Explore Bon AppétitIt's That SimplecookingPancakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-24", "author": ["Condé Nast", "Urmila Ramakrishnan"]}