{"id": "170f9d58297990fee6817b253ca2654f", "url": "https://www.bonappetit.com/story/trader-joes-fall-2020-reviews", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Trader Joe’s Fall 2020 Snacks, Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Reviews Are Back: The Good, the Meh, and the PuffyPass the jalapeño puffs, please. By Alex BeggsOctober 14, 2020FacebookTwitterEmailFacebookTwitterEmailInside my new local Trader Joe’s in Ann Arbor, I compete with college students buying frozen samosas and acerola purée (more on that, uh, later). I want to tell them, “In MY day, there were no acerola juice shots at Trader Joe’s. I had to subsist on hash brown patties!” Instead, I veer my cart away as quickly as possible because I’m terrified of dorm germs.This summer, I was about to publish a Trader Joe’s roundup photographed on my plush, unmowed grass, when [waves around the room, generally] happened and no one needed this kind of oblivious silliness. But things keep getting worse, don’t they? And we need a distraction of no consequence. Here we are.Not pictured below but a PSA: I couldn’t find them this month, but GET THE SPRINKLE SANDWICH COOKIES! Butter bombs of vanilla-flavored frosting delight! As well as the fermented pickled jalapeños, which are so spicy. And the ube mochi pancake mix! Gray-purple space Frisbees that have a fun spongy texture and sweet potato flavor.Photo by Alex BeggsNot-chip chipsJalapeño Seasoned Corn and Rice PuffsBEST NEW PRODUCT OF FALL 2020. Little half-circles of puff, like coiled-up roly-polies, are covered in seasoning that’s spicy, a tad sweet, and cheese-like without the cheese. The ideal drinking snack, stress-eating snack, or stress-drinking snack. Those are the only categories of snack I have right now, sorry. The texture is crispy, but it explodes and disintegrates immediately, similar to a Cheetos Puff, which means you want MORE, MORE, MORE (the term for this is vanishing caloric density)!Crispy Banana RibbonsMore sweet than salty, these candy chips have a thin and snappy texture, but they’re too breakable for dipping. The TJ plantain chips are better.Photo by Alex BeggsCorn thingsCorn Cookie Baking MixAnother one of TJ’s best new products lately is this understated canister of cookie mix. The cookies are soft, super corny, and have that little cornmeal crunch. They remind me of Milk Bar’s famous corn cookies without the extra stick of butter. I froze half of my dough balls in case I ever feel like sharing. Plus, they’re so quick and easy to make. Add butter and egg, and it’ll all turn out in the end.Mini Cornbread BiscottiIf you like dry, hardened cornbread someone named Bill left out on the counter overnight without properly wrapping it, this is for YOU! And you can have them all. Take mine. It’s just way too sweet, which is a bummer, because I thought “soup biscotti” would be a cool new thing. Like, imagine dipping these guys into Trader Joe’s best soup—roasted red pepper! However, that would be gross, like dipping cookies into salsa.Photo by Alex BeggsSnacks in square packagesPB&J Snack DuoSomeone call Tim Cook or whoever actually has a hand in the future of technology because these are innovation. Why has no one thought of this before? Wafer cookies filled with peanut butter—crisp pastry that yields to dissolving peanut butter cream—that you dunk in raspberry jam. They’re what some may call “what we need right now.” Which is more junk food. My niece Leah stuck the wafer into the sticky, gooey jam and sucked all of the jam off before going for a second dip. “BITE IT, LADY!” I shouted from the high chair sidelines. She laughed and showed me her tiny fangs and sucked the jam until the wafer turned to mush. “One day I’ll tell you about these times,” I whispered into her unknowing, jam-covered ears.Organic Granola BitesAlso for children and adults who need not be judged, these are little balls of granola bound by sugar that tiny humans can eat in their car seats without leaving too much debris. Have you ever seen a car seat after a kid ate Goldfish? You will never, ever vacuum those cheese crumbs away. Hey kid, have some granola bites.No Bake Nut Butter Bar MixWell, you gotta use nearly an entire tub of almond butter (~$4) and half a bear of honey (~$3) to make these, which makes them $10 bars, but then I guess you cut them into 16 bars so it’s still cheaper than store-bought bars with mountain ranges on them. And WOW, these surprised me. Pieces of crispy puffed rice give them a Krackel quality, and all of the almond butter and flour makes them extremely filling and slightly gooey. They’re delicious and keep for ages in the fridge (the rice does soften after a few days, though). Would buy again, which I don’t say very often, because it’s hard to gain my trust.This Coconut Brings Chocolate on a Date BarsI hear you like “not too sweet,” well, these dense and sticky bars are for you. Bitter chocolate balances the sugary dates, but bars like this make me feel like I’m eating government-issued nutrition patties doled out after the Grand Canyon swallows itself up and we’re all sitting around a campfire fueled by rejected absentee ballots wondering what to do now.Photo by Alex BeggsImpostor chipsOrganic Nacho Cheese Flavored Corn Tortilla ChipsThese faux Doritos have the cheese powder bit NAILED, but the chip itself has that made-too-healthy stale quality. As a certified chip expert (let me have this), I can confidently say that these need more technology (and maybe more fry oil) to go full Dorito. But if you can get down with sorta stale tasting chips because “they’re organic”—okay! Have at ’em.Sea Salted Saddle Potato CrispsNow these faux Pringles are astonishing. Did you know that, while classic Lay’s are thin slices of potato, Pringles are made of dehydrated potato flakes? Again, chip expert talking. The potato flakes give them that thick-yet-dissolvable quality. These are an award-worthy dupe, if there were awards for shameless snack copycatting.Photo by Alex BeggsExciting crackersOrganic Garlic Naan CrackersThese mini naans are oh-so-cute and, wow, buttery. They’re sturdy and good for dipping in hummus or eating while standing in the kitchen thinking about what snack you’d like to have after this pre-snack. Your mouth will steam with garlic fumes. YUM.Everything But The Gluten CrackersSay you’re not able to eat wheat flour. These could be your cracker. They’re hardy and seedy and just a whiff musty. I’ll stick to my onion-flavored MARY’S GONE CRACKERS for now, thanks.Photo by Alex Beggs2 talls and a smallPumpkin Spice Protein SmoothieWhen I twisted the cap off, orange dried pumpkin spice flecks flew off and seasoned my floor with their festive flair. If I were under the delusion that my body needed more protein, I’d happily purchase this to fulfill that invented need. The spice is subtle; it’s mostly milky. I feel my biceps tingling already!Acerola Juice ShotMy friend Bryan says the frozen acerola purée is “actually very good,” and I believe him, because this juice shot is tart and sour, like a green strawberry. It’s also trendy because HEALTH, and probably unnecessary, like $125 “nap dresses.” That doesn’t mean I can’t want both.Vegan Caesar DressingBriny, creamy, with a hint of sweet-salty miso.Photo by Alex BeggsFall-y thingsProtein Maple MuffinAdd water, microwave, and watch the protein powder muffin puff up, thanks to the magic of RADIOACTIVITY!!! The texture, sort of a damp sea sponge, melts in your mouth and makes me want to eat more. But I can resist.Cinnamon Bun CookiesSOFT and plush like a stress ball, wow. These are miraculous. Inside the squishy cookies, a creamy filling that has never done a bad thing in its life.Photo by Alex BeggsTubs o’ stuffHerbed Tahini SauceHeavy on the parsley, unfortunate brown color.Romesco DipStill too close to eating pasta sauce out of a tub.Cottage CheeseCurdy!Photo by Alex BeggsFrozen friendsKung Pao Chicken Mochi BallsYOU NEED TO TRY THESE. A crispy sweet mochi shell yields to chewy, and the filling is sparse, leaving big gaping holes to squish into. The filling is supposedly chicken, lots of ginger. Even my cat licked the tray clean. One late night during the weirdest, darkest times in our nation’s history, I made dinner out of these, my beloved TJ mac ’n’ cheese balls, and mini spanakopita while I yelled at the TV and scrolled Facebook Marketplace. Life can be enriching, inspiring, and artful. Or it can be this.Pork and Ginger Soup DumplingsI should have sprayed my metal steamer with PAM or something because my dumplings stuck, tore, and leaked their gingery soup. Treat these dumplings like your delicate heart: gently.Photo by Alex BeggsFrozen friends part 2Focaccia PrimaveraI’m confused at reviews I’ve seen online that describe this as “delicious,” which is the opposite of what it is. It’s a Frisbee-size puck with under-seasoned spinach-egg mush and a thin, dry crust. You’re better off with the frozen spanakopita at Trader Joe’s.Pumpkin empanadasClove bombs.Photo by Alex BeggsCheese-Less “Cheesecakes”Not terrible!Photo by Alex BeggsDinner enhancersOrganic Ghee & Sunflower Oil SprayI thought this was a cool idea, in theory. In execution, the ghee squirts out of the nozzle in a direct splurt, not a diffused splatter. Do you know your squirts from your splurts and splatters? The sunflower oil is probably chemically necessary to make this product, but it adds a musky flavor I don’t l-o-v-e. Idea: Make your own ghee!Pumpkin Curry Simmer SauceI saw that my vegan stepsister-in-law (hi, Meg!) loves this stuff, so I had to try it. You’re supposed to add ¼ cup of the brown goop to whatever protein you’re cooking, but in my best judgment, I dumped the whole jar into a pan of mushrooms, kale stems, onions, and tofu. And that was the proper amount; it just didn’t get me all the way there. Salt did. Somehow this product that has 120% of your daily sodium intake (if you use the whole jar, whee!) was mysteriously bland. LOL, that’s processed food for you. Beguiling and bountiful.Tomato Spread“Spread?” Please, this is Portuguese tomato JAM. It is unrelentingly sweet, but a “fun” alternative to fig jam for your elaborate TikTok cheese platter. The slimy bits of tomato skin will satisfy people who enjoy peeling off their sunburns. ENJOY.Honey Aleppo SauceSweet ’n’ smoky.Photo by Alex BeggsAnother SpreadApple Cider Fruit SpreadTake even the smallest spoonful of this “spread,” and you will get SMACKED with super, super concentrated apple cider flavor. Plus, little chunks of softened apples, how digestible. Over the summer I tried the watermelon spread—avoid unless you like eating lip gloss—but this is much better. I imagine you could: Spread it on ricotta toast, serve with a juicy pork chop, or swirl into vanilla ice cream for a homemade touch that’s, ultimately, a lie.Photo by Alex BeggsSticksPumpkin Spice Baton Wafer CookiesLove these PSL wafers. The subtle, creamy filling didn’t kick in until my third stick. I like how I can pretend they’re long Cruella de Vil cigs—and their portability. Here are all of the places you could store these wafers to have ready in case of low blood sugar: the pen pocket on your cargo pants, behind your ear, one of the holes of your toothbrush holder, inside a pencil box, any available window ledge.Dark Chocolate Cookies SticksThese are like extra thick Pocky. The cookie part is twisty—to avoid breaking any cookie patent laws, perhaps?!—and yet they still break easily. Tastes like chocolate-dipped printer paper.Photo by Alex BeggsThere’s always a new milkUnsweetened Non-Dairy Hemp BeverageYou are wearing a hemp necklace (braided, maybe even beaded), and suck on it during class when you’re bored. It tastes ropey. A little cardboardy. That’s hemp milk for ya. I thought Raisin Bran might mask the flavor, but nope, I ate a bowl of soggy cardboard for breakfast.Photo by Alex BeggsCheesesShredded Unexpected Cheddar CheeseA reliable sharp cheese now in shredded form, but the shreds are twice as wide as usual shreds. Not sure why...unexpected?Dutch Spicy KaasI can still taste the lingering, overwhelming flavor of vegetal green pepper. The tricolor flecks are visually intriguing, but my family stood around the kitchen smacking our tongues trying to get that taste outta there. Maybe it’s better melted on pizza? I’ll let you find out.Photo by Alex BeggsBags o’ nutsBazaar Basket Snack MixHeavy on the dried fruits. You’ll get handfuls of just apricots and dried cherries here, which is great if you haven’t pooped in a few days. Chickpeas are a dehydrated delight! Too bad this thing is in dire need of SALT, but that might be more of a personal problem.Dry-Roasted Maple AlmondsSo this is what Buddy the elf’s breath tastes like. They’re missing the shattering candy coating of a honey-roasted nut, saturated with maple flavoring, and just too dry for me to tolerate in my mouth. A place that puts up with a LOT.Read previous Trader Joe’s reviews here. Explore Bon AppétitTrader Joe'sRead MorecultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-14", "author": ["Condé Nast", "Alex Beggs"]}