{"id": "171278f6a19b4c56036107c7583e7996", "url": "https://www.bonappetit.com/recipe/peras-con-alguashte", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Peras con Alguashte Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssuePeras con AlguashteSeptember 22, 20204.0(2)Read ReviewsTriangleEmailPinterestPrintPhotographs by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“Squash and pumpkins are huge crops in El Salvador, and the seeds never go to waste—they get toasted and ground to create alguashte,” a nutty Salvadoran seasoning, says chef Anthony Salguero of Popoca in Oakland. In the fall months, crisp peak-season pears or apples are an undeniably delicious way to enjoy this refreshing fruit salad, but it’s also outstanding when made with crunchy, slightly tart underripe mangoes if you can get your hands on them.Ingredients4 Servings2large pears or apples, cored, thinly sliced lengthwiseJuice of 1 limeHot sauce (such as Valentina)Kosher saltAlguashte (for serving)Mint leaves (optional; for serving)PreparationToss pears and lime juice in a medium bowl to coat. Shake in a few good dashes of hot sauce to taste, season with salt, and toss to coat. Sprinkle generously with Alguashte and top with mint leaves if using.How would you rate Peras con Alguashte?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladSalvadoranCentral AmericanLatin AmericanPearFruitEasyQuickSideDairy-FreeGluten-FreeVeganVegetarianRawDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}