{"id": "171588b6a93b88513ed73cbd5163917a", "url": "https://www.bonappetit.com/story/best-vegetarian-cookbooks", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "The 7 Best Vegetarian Cookbooks of All Time, According to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe 7 Best Vegetarian Cookbooks of All Time, According to MeWhether I’m looking for an interesting way to cook a rutabaga or a make-ahead dinner party dish to feed ten, these titles have my back (and belly).By Sarah JampelJanuary 13, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.I like to think of myself as a quasi-minimalist. I limit myself to ten tote bags, I get rid of lone socks, I own four pairs of shoes total—but there’s a limit to how far I’ll winnow down my cookbook collection. They feel less like possessions and more like friends. I feel better just knowing that they’re there, full of recipes, wisdom, and seemingly endless information. They’re my reference library when I’m looking for an interesting way to cook a rutabaga, or a make-ahead dinner party dish to feed ten, or different names and variations of congee. And while I own plenty of cookbooks that include recipes for meat and fish, I get more excited about vegetarian-only book because I’m getting more bang-for-my-buck. Here are my seven most-loved, from the one I turn to when I need a project to the one I open when my mind is fried and I need a jolt of inspiration:World-of-the-East Vegetarian Cooking by Madhur JaffreyWhen I was just a young tween, I went through a samosa phase spurred by my Indian food fixation and the illustrated step-by-step guides in this 1981 book. The brilliant Madhur Jaffrey has authored 30 cookbooks (and some children’s books too—what can’t this woman do?), but somehow the one I own that’s cracked at the binding is her second, World-of-the-East Vegetarian Cooking. It covers an almost-comically large swath of the planet, from Bali to Japan to India to Iran, making the meticulously researched headnotes and recipes all the more amazing. Once I grew out of my samosa stage, I explored the rest of the table of contents—shredded cabbage with mustard seeds and fresh coconut, hijiki with sweet potatoes, and black-eyed pea pancakes. There are enough recipes in here to last me at least another forty years.Buy it: World-of-the-East Vegetarian Cooking, $20Fresh India by Meera SodhaLast year on my birthday, friends from many parts of my life came together to throw me a surprise party. Who, me?! I was shocked, thrilled, and grateful—even more so when I realized that everyone had cooked a dish from Fresh India, a book I’ve been obsessed with since it was published in 2016. It’s like the vegetarian sequel to U.K.-based Meera Soha’s first book, Made in India: a personal account of the fresh, fast food Meera cooks at home. The goan butternut squash cafreal (which inspired this recipe for Squash With Yogurt Sauce and Frizzled Onions), paneer butter masala, cauliflower korma with blackened raisins, and spinach, tomato, and chickpea curry are holding me over until her newest book, East, is available for purchase in the U.S. \\Buy it: Fresh India, $25Afro Vegan by Bryant TerryBryant Terry’s mission—not just in this book but in his career as a whole—is to honor and shine light on the culinary history of the African diaspora, and to show that African and Afro-diasporic ingredients and techniques are inherently healthy—no adaptation necessary. The recipes in this book brilliantly fuse flavors and ingredients from Africa, the Caribbean, and the American South: Think tofu curry with mustard greens, muscovado-roasted plantains, chermoula tempeh bites, and curried scalloped potatoes with coconut milk. And since each recipe comes with a song, you don’t even have to think about your cooking playlist.Buy it: Afro Vegan, $20Lucky Peach Presents Power Vegetables by Peter Meehan and the Editors of Lucky PeachR.I.P. Lucky Peach, and thank you so much for leaving us with this wacky, weird, and wonderful cookbook proving that, yes, vegetarian food can be fun, too. The LP team set some smart constraints—like pastas and egg-on-it grain bowls are not permissible (I can figure those out myself), but fish (in the form of anchovies and fish sauce) and dairy are fair game—that pushed them (and, me) to be more creative. Now, I keep a bottle of pomegranate molasses in the pantry so I can make the muhammara whenever I want it, and the pappa al pomodoro (made with dried-out English muffins!!!!!!!), spanakorizo, and zucchini mujadara are in my regular rotation.Buy it: Lucky Peach Presents Power Vegetables, $20Moosewood Cookbook: 40th Anniversary Edition by Mollie Katzen“Of a time” is how my parents always describe this book, which is a classic representation of a certain era of hippie-style, cottage cheese-heavy vegetarianism in the U.S. First published in 1977 as a collection of recipes from the Moosewood Restaurant in Ithaca, New York, it’s handwritten and illustrated, with recipes like mushroom moussaka, broccoli strudel, and gado gado that draw from many parts of the world. So what if it’s not the most hyped-up, 2020-feeling cookbook—that’s what I like about it: It feels like I’m cooking from a zine. The food is neither too sexy, serious, nor sophisticated—it’s open to my tweaks and whimsies and perfect for cooking in sweatpants for my closest friends.Buy it: Moosewood Cookbook: 40th Anniversary Edition, $15The Modern Cook's Year by Anna JonesWhen I’m in a rut, this is first the book I flip through, knowing I’m guaranteed to land on something delicious-sounding. It’s organized by season, with 250 recipes for snacks, breakfasts, desserts, and, of course, dinners that run the gamut from aspirational (a “wedding-worthy” tomato tarte tatin) to more realistic (chard pasta with ricotta). There isn’t a recipe I haven’t bookmarked (which, yes, sorta defeats the purpose): pistachio and ricotta dumplings with peas and herbs, black sesame noodle bowl, miso-roasted squash and potatoes with kale, yellow split pea soup with green olives, chard lentil and bay leaf gratin, velvety squash broth with miso and soba. The recipes often rely a little on instinct—but with ideas and flavor combos this good, I’m happy to forgive a couple overlooked details. Just as valuable as the recipes are the supplementary informational spreads, like a guide to brewing herbal infusions, using the freezer to its full potential, making curry paste, assembling sheet-pan dinners, and composing hearty salads.Buy it: The Modern Cook's Year, $26Power Plates by Gena HamshawI’ll argue with anyone who insists that a vegetarian diet can’t be a nutritionally-balanced one (I get enough protein, okay?). But I will concede that it does take a bit of mindfulness to make sure that a meat-free meal is satisfying: Without that, I’ll eat a bowl of creamy pasta for dinner, then wonder why I’m hungry an hour later. Which is where Gena Hamshaw comes in. A registered dietician, Hamshaw offers 100 recipes that contain the right mix of macronutrients (protein, carbohydrates, fat) to feel nourishing. That means that when I make her smoky red lentil stew with chard or pudla with spicy sautéed spinach or charred broccoli salad with freekeh and spring herbs, I don’t have to make any additional elements—it’s all there. Even when I’m not cooking from Gena’s book, this overarching question (“does my meal include a fat, protein, and carbohydrate?”) gives me the direction I need to put together something smart.Buy it: Power Plates, $16All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishThe Not Depressing VegetarianCookbooksVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-13", "author": ["Condé Nast", "Sarah Jampel"]}