{"id": "1719bd7844276ac60b3315ed2b6fba11", "url": "https://www.bonappetit.com/story/kielbasa-mustard-two-ingredient-appetizer", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "This Is the Greatest Two-Ingredient Appetizer of All Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Greatest Two-Ingredient Appetizer of All TimeSeriously. Two ingredients. Promise.By Alex DelanyMarch 26, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Jennifer OphirFacebookTwitterEmailI have a rather unique understanding of what constitutes successful home entertaining. Some might say it’s all about elegance or luxury or consideration or taste. But me? I think it’s about deception. I’m not saying I’m a dishonest or deceitful host. I love my guests! But in my mind, the secret to a dinner party that is as enjoyable to host as it is to attend is presenting food that seems to be much more than it is, to create the illusion that you worked way harder than you actually did. It’s all about the low-lift, high-payoff dishes—ones with a high ROI (Return on Investment) for all you business-minded folks out there.In all the years that I've served these types of dishes at parties, I’ve kept track of the most successful—the all-stars of the low-lift lineup. And there is one dish that absolutely slays every single time I serve it, one that has earned a permanent spot on every cookout menu I will serve from now until the end of time. It is inarguably the world’s greatest two-ingredient dish. I am talking, of course, about seared kielbasa and mustard.You might be thinking, Wow. I’m reading an article about kielbasa and mustard. What's there to say about that? This guy really is all about deception, huh? I already know what I need to know about one of the world’s great sausages!And that’s fine. But the whole point is that you don't think about any of that when someone plops a plate of the good stuff down in front of you. Instead, you think something like, What?! Grilled kielbasa?! And mustard?! I want to combine them and eat them with my mouth right now! You don't think about how simple and dumb-easy that snack was to prepare. You just get excited.The combination is a textbook example of simplicity and balance on every level. If we’re talking about texture, you have the crispy snap of the charred kielbasa casing, the firm, meaty interior, and the luxurious smoothness of that mustard. Such contrast! Flavor-wise, you have the the fattiness and smokiness of the sausage, paired with the tang and heat of the mustard. Such pleasure! Such perfection!And unlike most two-ingredient dishes, this one is truly two ingredients. There’s no added salt. No cooking fat. No pepper. No optional herbs or fancy garnishes. There’s kielbasa, and there’s mustard. I can tell you how to make this dish in two sentences. Here you go:Cook the kielbasa on a grill or cast iron skillet over medium-high heat, until the casing is deeply browned and sausages are warm throughout, about five to seven minutes. Remove the kielbasa from heat, slice into coins, and serve them on a plate with a small bowl of mustard.You can spring for the good stuff or just grab whatever's at the grocery store. I promise both will be loved.\nLook at that. No lies there. I was 100 percent truthful regarding the simplicity of this dish. Could you do it differently? Sure. If you wanted to slice the sausage before you cook it and brown those coins individually for extra caramelization, go for it you little overachiever. But whichever way you prepare it, it's as easy to make as it is to love.But to my guests and yours, the simplicity of the dish is lost in the commotion of the appeal. No one is going to think about how easy it was to make. They’ll be too busy going back for piece number two, three, four, and five. To me, this is what good entertaining is all about, creating a smokescreen of deliciousness that distracts from just how effortless the food was for you to prepare. And that's a kind of deception that nobody is going to get mad about.Need more kielbasa content? Here's some soup:Kielbasa and Lentil Soup with Lots of BasilExactly the kind of hearty-but-not-too-hearty soup you want on a rainy spring day.View RecipeExplore Bon AppétitKielbasaGrillBasicallyMustardRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-26", "author": ["Condé Nast", "Alex Delany"]}