{"id": "171eafe571a1fcc4c02a14ee1c8e9d64", "url": "https://www.bonappetit.com/story/evergreen-zucchini-carrot-waffles", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Evergreen Zucchini and Carrot Waffles Are the Frozen Waffles I Was Waiting For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGrown-Up Toaster Waffles Are My New Favorite LunchThese frozen, savory, bite-size treats are versatile, made of vegetables, and ready in minutes.By Kelsey OgletreeFebruary 24, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve never been a veggies-for-breakfast person. When I spotted Evergreen’s zucchini and carrot waffles in the frozen aisle at Whole Foods, I thought I might be able to change that. But compared to my beloved vanilla protein oats and peanut butter, these savory rectangles just never called my name in the morning—so they sat lonely in my freezer, collecting ice.That was before I discovered lunch waffles.One day I had whipped up a pot of homemade tomato soup. As I was about to ladle out a bowl, it dawned on me: We were out of bread. And let’s be real, what’s a bowl of tomato soup without a toasty, gooey square of grilled cheese to dip right in there?Then I remembered those waffles languishing in the freezer.Digging through my fridge, I found a fresh log of goat cheese. I swung open the door to my freshly Marie Kondo’d pantry and a light shone upon my beloved bottle of Mike’s Hot Honey. It was all coming together. My husband looked at me like I was nuts, but I was a woman on a mission. What had started as a potential disappointment turned out to be the first of many veggie waffle lunches.Here’s how to do it: Stick a couple of these zucchini and carrot waffles in the toaster until they’re hot and golden brown. Then spread them (holes-side up) with a layer of creamy goat cheese, stack them all artsy-like on a plate, and drizzle with hot honey. Serve adjacent to your favorite bowl of soup and dunk to your heart’s content. Extra napkins advised for worth-it sticky fingers.You can, of course, use whatever waffles you want for lunch waffles, but I like Evergreen for a few reasons. They come in an adorable mini size, meaning it’s NBD to toss one (or four) into the toaster depending on how hungry you are. Second, the ingredients are all things you’d find in your own kitchen—whole grain flour, honey, eggs, almonds, carrots, zucchini, avocado oil, baking soda, cinnamon, salt. Each serving has 6 grams of protein and 4 grams of fiber. And they taste great, especially with a little goat cheese and hot honey. Don’t we all need something to look forward to at lunch these days?Evergreen Zucchini and Carrot Waffles$7 at EvergreenExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-24", "author": ["Condé Nast", "Kelsey Ogletree"]}