{"id": "1720bc009dfb3bc859ee18c35cb4e4eb", "url": "https://www.bonappetit.com/recipe/lemon-pepper-salami-bites", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Lemon-Pepper Salami Bites Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueLemon-Pepper Salami BitesBy Andy BaraghaniNovember 20, 20185.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintBright citrus and fresh-ground pepper put a festive spin on two party staples: Cured meat and Marcona almonds.Ingredients8 servings2lb. thinly sliced salamiHandfuls of Marcona almonds1lemonFreshly ground black pepperExtra-virgin olive oil (for drizzling)PreparationLayer salami with some almonds in a shallow bowl. Finely grate lemon zest over; save fruit for another use. Top with a few grinds of pepper and drizzle generously with oil.How would you rate Lemon-Pepper Salami Bites?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDelicious!!  Who would have thought lemon and salami would taste so delicious?!  It’s always nice to find a quick, easy, unique appetizer to make.  A Wilson CT 6/19/2021I made this for New Years as well as a host of other Bon Appetite recipes. This was by far my favorite and the easiest! This is my new found favorite appetizer or snack. I’m craving more of these flavor combinations. The lemon zest does magical things! 🍋  RwoodroofLittle Rock, AR1/6/2019Boy was this way better than the sum of its parts. Made for NYE and it was the biggest hit in a huge spread! I couldn't find marcona almonds, used cashews instead, can't wait to try with almonds!delaneymaeNashville, TN1/2/2019Explore Bon AppétitSalamiCured MeatMeatAlmondNutLemonCitrusFruitQuickEasySnackStarterDairy-FreeGluten-FreeMemorial DayLabor DaySuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}