{"id": "1728e6dd385e4b9237abf1ac05ca5a89", "url": "https://www.bonappetit.com/story/gyeran-bap", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "Gyeran Bap is What’s For Lunch (or Breakfast or Dinner) When You Can’t Be Bothered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGyeran Bap is What’s For Lunch (or Breakfast or Dinner) When You Can’t Be BotheredKorean egg rice will never fail you.By Joy ChoJuly 29, 2020FacebookTwitterEmailPhoto by Justin Bridges, Food Styling by Tyna HoangFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.You know the scene: It’s noon, you’re starving, and digging through your fridge will be more work than you’ve accomplished all morning. You could order takeout (again), but why would you when a hearty bowl of gyeran bap is literally within reach and will take all of seven minutes to whip up?Gyeran bap (pronounced geh-ran-bap) directly translates to “egg rice” in Korean and is, in my opinion, one of the greatest things to ever happen to lazy cooks, students on a budget, and parents feeding picky eaters the world over. How can cooked rice, a few fried eggs, and pantry condiments all mixed together deliver such depth of flavor and satisfaction? I pondered this question recently as I tucked into a bowl of the rich, creamy stuff on a quick lunch break, and I’m honestly not sure.Although gyeran bap is technically a kind of bibimbap (“mixed rice”), since it’s a dish where rice is mixed together with other ingredients and condiments, it’s much less labor intensive than traditional bibimbap. (Even as a Korean-American preparing the various marinated vegetables, minced meat or seafood, and mouth-puckering gochujang sauce feels a bit intimidating for a casual lunch.)That’s why gyeran bap is a total godsend. All you need is cooked rice, eggs, soy sauce, and sesame oil. It’s a foolproof and customizable dish that can be ready in less than 10 minutes with fewer than five ingredients, all of which you probably have in your kitchen. (You don’t even need the eggs: My mom tells me that when she was growing up in Korea, eggs were not a staple in her house, so her version of “gyeran” bap was rice mixed together with soy sauce and sesame oil. Still delicious!)Whether out of laziness or a craving for comfort, gyeran bap has been a go-to food whenever I want a cheap, hot meal with minimal effort. It’s unfailingly satisfying, dishing out nostalgia and a degree of flavor that’s almost too good for how easy it is to make.Here’s how to make it: People have their own methods of making gyeran bap, but the general idea is similar and really simple. Scoop a couple cups cooked short-grain rice (preferably day-old) into a big bowl—you’ll need the room for mixing—and heat it up in the microwave for a minute (or, if you don’t have one, in a frying pan). Meanwhile, in a nonstick pan greased with oil, season 2–3 eggs lightly with salt and pepper and fry over medium-low heat until they’re just underdone—I like how the runny yolks and nearly-set whites add richness to the finished dish. Transfer the eggs to the bowl of rice and add a few drizzles of soy sauce and sesame oil to taste. Mix it all together with a spoon, making sure to dice up the egg with the rice and to coat everything well.And here’s how to customize it: A true pantry meal, gyeran bap allows you to use up existing ingredients and jazz up the dish according to your mix-in preferences. Talk about being both creative and economical. Try adding soy sauce and gochujang for some savory heat. My dad’s not-so-secret ingredients are nori strips, masago, and sukiyaki sauce, a lovely medley of umami flavors tinged with a pleasant sweetness. A sprinkle of sesame seeds or furikake, quick stir-fried vegetables, or chopped-up cooked spam or sausage can all take your bowl to a whole new level.This is why gyeran bap is so great: It’s really hard to mess up. And really easy to make delicious. With so much going for it—low cost, low effort, high satisfaction—gyeran bap may just become a regular part of your regular meal rotation starting…now.Joy Cho is a freelance pastry chef and writer temporarily based in Columbus, Ohio, where she started a curated baked goods delivery service and launched nationwide shipping of her Pastry Packs.Explore Bon AppétitIt's That SimpleRiceKoreanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-29", "author": ["Condé Nast", "Joy Cho"]}