{"id": "172fd9a24284054bd3866e5dbe67c629", "url": "https://www.bonappetit.com/recipe/panettone-bread-pudding", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Bread Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPanettone Bread PuddingBy Molly BazDecember 22, 20194.9(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintSo you just ate one delicious slice of panettone, a buttery, sweet bread originally from Milan. Congratulations! But now you need to figure out what to do with the rest of it. Enter panettone bread pudding, the best way to consume all those leftovers. Or really, the best way to consume panettone in the first place. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketRimmed Baking Sheet$20 At Bon Appétit MarketWhisk$10 At AmazonLarge Bowl$18 At AmazonMicroplane$16 At Amazon3-Qt. Baking Dish$17 At AmazonTongs$13 At AmazonSmall Bowl$13 At AmazonSieve$18 At AmazonIngredients6–8 servings¾panettone loaf (about 1½ lb.)1large egg5large egg yolks3cups half-and-half3Tbsp. granulated sugar1½tsp. vanilla extract1tsp. kosher salt, divided1orangeUnsalted butter (for pan)¾cup whole-milk plain yogurt2Tbsp. pure maple syrup1Tbsp. powdered sugarPreparationStep 1Place a rack in center of oven; preheat to 275°. Tear ¾ panettone loaf into large, irregular pieces. Arrange in a single layer on a rimmed baking sheet. Bake until light golden brown, dry, and crisp to the touch, 35–40 minutes. Let cool.Step 2Meanwhile, vigorously whisk 1 large egg, 5 large egg yolks, 3 cups half-and-half, and 3 Tbsp. granulated sugar in a large bowl until very well combined, the sugar has dissolved, and no streaks of egg remain, about 30 seconds.Step 3Whisk in 1½ tsp. vanilla extract and ¾ tsp. kosher salt.  Finely grate 1 tsp. orange zest into custard and whisk to incorporate.Step 4Grease a 2½–3-qt. baking dish with butter. Increase oven temperature to 300°. Arrange cooled bread pieces in dish. Pour custard over, using tongs to flip and submerge bread and soak in custard. Pop out some pieces so they sit above surface of custard in craggy peaks.Step 5Transfer to oven to bake until custard is no longer wet, the bread pudding is golden brown, and butter is bubbling at the edges, 45–55 minutes. Let cool 20–30 minutes.Step 6Meanwhile, whisk ¾ cup whole-milk plain yogurt, 2 Tbsp. maple syrup, and remaining ¼ tsp. kosher salt in a small bowl.Step 7Using a fine-mesh sieve, sprinkle 1 Tbsp. powdered sugar over bread pudding.Step 8Scoop out portions of pudding and divide among plates. Drizzle with maple yogurt.How would you rate Panettone Bread Pudding?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleAbsolutely the best bread pudding recipe I've tried so far!  The custard came out perfectly.  I used cinnamon raisin challah bread and added a pinch of salt; amazing with the \"hint\" of orange.  SUPER EASY too!  My new \"go to\" bread pudding recipe.Anonymous12/19/2021I'd make this, but I just keep the eating the entire loaf of panettone myself! Oh well.AndyOttawa, ON10/22/2021This by far has got to be one of the best bread puddings that I've made.  Sooo tasty. Entire family ate every crumb.  Best of all, the sauce made it complete.  Easy to make.  2 thumbs up!  5 stars.\nJay R.Browns Mills, NJ2/16/2021I’d give this recipe a 4.5 if I could. The pudding itself is exactly what I’d hoped it would be — it puffed up a bit at the end of baking. It was sweet, but not so much that the other flavors were lost.\nInstead of the yogurt sauce, I found a creamy rum sauce that is a much better flavor contrast (I think amaretto would be good too).JaneSt. Louis MO12/24/2020Good recipe, use panettone with dried fruits and be sure to cook it enough milomanLos Angeles 1/24/2020Great recipe! Don't skip the yogurt topping. It's an awesome topping.AnonymousGrand Rapids, MI1/3/2020Needed to come up with a dessert for christmas! This Panettone bread pudding recipe was the best decision I made. Was easier to make than expect and the end result was DELICIOUSFlowerboyFrance12/29/2019Delish! And SO easy! Made this twice now, the second time for a Christmas Eve party. My dish was a little on the small side (filled to the top only 2 quarts) but with some work it fit just fine, and after baking the bread deflates a bit. The maple yogurt is fantastic here. After an hour in the oven the bread pudding was still not quite \"dry\" everywhere, but once taken out and allowed to cool it was fine. Was a hit at the party and I'll definitely be making it next year.Anonymous12/26/2019Explore Bon AppétitBreadDessertItalian AmericanAmericanBakingChristmasBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-22", "author": ["Condé Nast", "Molly Baz"]}