{"id": "1730e3b7906e1976a6aef2ae8a2c2fde", "url": "https://www.bonappetit.com/story/toms-perfect-ten", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Tom's Perfect 10: I Tried the Instagram-Famous Granola With a 17,000-Person Waiting List | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Tried the Instagram-Famous Granola With a 17,000-Person Waiting ListEvery month a mystery flavor of granola arrives on your doorstep. So novel! So delicious! So crunchy!By Ali FrancisDecember 1, 2021FacebookTwitterEmailPhotograph by Emily Simms/The Working AssemblyFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I discovered Tom’s Perfect 10 via Instagram, of course. During a caffeinated doomscroll I paused to watch a heartwarming comedy of errors: Advertising executive Tom Bannister and his small children messily portioning out ingredients for marshmallow and blueberry granola, sneaking spoonfuls of honey, and showering their New York City kitchen in oats. In the tasting video that followed, Eva Chen, director of fashion partnerships at Instagram and Bannister’s wife, is behind the camera filming him. After offering a complicated and self-deprecating flavor analysis—“Guys, watching this, did you know Tom puts this much effort in?” Chen asks the audience—Bannister rates his own granola an 8.3 out of 10.Despite the solid score—and the 17,000 person waiting list—I was initially reluctant to try Tom’s Perfect 10. It’s nothing personal. I’ve just always considered granola to be sad and sand-like: the underwhelming fish in an overwhelming sea of breakfast cereals. But when I tore open a packet and shoved a handful into my mouth, I immediately understood all the hype.When you eventually make it off the waiting list and onto the eating list, the delivery experience alone is super fun. Every month a mystery flavor—like Pina Colada, Flaming Chocolate, and Blackberry Chai—arrives on your doorstep. For those of us who have spent the past almost-two years locked in a routine of sameness, Tom’s Perfect 10 is a little crunch of novelty. Each flavor comes with a scorecard designed for you to rate the granola based on characteristics like appearance, texture, and addictiveness, which you photograph and send back to Bannister so he can keep iterating on the recipes.Photograph by Emily Simms/The Working AssemblyMonthly Subscription – Tom's Perfect 10 Granola$20 at Tom's Perfect 10We know Instagram algorithmically advantages people like Chen and Bannister, who are good at using it. The couple’s connections to the advertising and media worlds—Bannister is the creative director at influencer marketing agency Billion Dollar Boy—went a long way in helping churn up demand for Tom’s Perfect 10. But their sorta-scrappy process still feels humble and delightful, and interactive in a way that makes it seem like you’re creating the granola alongside Bannister, his family, and their community of die-hard granola stans. And, not to over-philosophize breakfast, but compared to the overnight success stories that frame many food founders, it’s refreshing to see all the messy missteps made along the way.I’ve tried the Ginger Zing and Original varieties, and each one offers a burst of flavor. Aside from the chill, brown-bag packaging, nothing about this granola is expected. The Zing, spiked with candied ginger, Vermont maple syrup (also infused with ginger), and a hint of black pepper, is spicy and bracing—like ginger chews in granola form. A whole bowl of the stuff will fire up your morning routine, but it’s also the perfect afternoon snack or yogurt topper. The cinnamony Original was a crowd-pleaser among the friends I shared it with, dessert-sweet and packed with chocolate chips, pistachios, and dried cherries.Both were, as I immediately Slacked my colleagues, “textural perfection”: clumpy and crunchy without breaking teeth or tearing up the roof of your mouth. At $20 for a 10 oz. bag, this granola is not what I’d call affordable. But when you factor in the meticulously sourced ingredients, smaller-than-supermarket scale, and labor and shipping costs, it makes sense that it’s more expensive than your average mass-produced brand.According to Chen, this whole granola experiment started with Bannister’s longtime love of the staple. “We’ve been together for half our lives, and every time we went on vacation there would be a breakfast buffet. I would get 56 courses and Tom would be like, ‘Oh, I just want granola,’” she tells me over Zoom. “I would get mad because I was like, ‘That’s not how you do a breakfast buffet!’” Eventually, Chen started posting stories of Bannister reviewing granolas to her Instagram for fun. “It was weird,” he says. “People really liked them. It got to the point where in playgrounds and on the street, people were coming up to me and asking me about granola.”Photograph by Martin Romero/The Working AssemblyDespite trying virtually every granola on the market, he still believed the perfect batch hadn’t been created. So, right before lockdown, Chen challenged Bannister to make his own. “I started [experimenting] every month with my kids,” he says. “And then COVID-19 hit and it was a great bonding activity while we were locked in our apartment. I got creatively engaged in it and really wanted to continue making it better.” The family chronicled their granola adventures on Instagram, where, according to Chen, “a lot of people would DM and say, ‘I want to buy it. How can I buy it?’”Demand for the product increased and by June of 2020, Bannister was renting a commercial kitchen to make Tom’s Perfect 10, Chen was helping develop the monthly flavors, and their kids were sticking branded labels on the packages. In the meantime, the waiting list had ballooned out of control, and “I had to figure out how to scale the production and the fulfillment,” Bannister says.Now Tom’s Perfect 10, which was formerly called Tom’s Granola, is officially relaunching. It’s the culmination of months of nerve-wracking, real-time feedback from thousands of early-bird customers. “I didn’t want to call it perfect,” Bannister says, “until, you know...” Chen finishes his sentence: “Until it was.” Shoppers will be able to buy a monthly subscription along with one-off bags of the Ginger Zing. And each quarter going forward, the highest-rated variety from the subscription “will graduate from the flavor-of-the-month into the core collection,” like the Ginger Zing has, Chen says.Because it’s December, I’ve been carb-loading extra granola on top of my hot oatmeal. I’ve served the ginger flavor over a warm roasted squash salad and on a creamy carrot soup for a little peppery crunch. The Original flavor is best with a scoop of ice cream or hot custard, though I’m not above stress-eating handfuls from the packet. My only quibble: There’s no way one bag of this granola is going to last me a month. Oh well! Like the thousands of others queuing up, I’m willing to wait for a good thing.Explore Bon AppétitLifestyleCultureRead MoreGranola SconesGrain-Free Tahini GranolashoppingNut Butter Wishes It Were Granola ButterBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-01", "author": ["Condé Nast", "Ali Francis"]}