{"id": "17461ac0de7439ab0c617b7239906641", "url": "https://www.bonappetit.com/story/bilberry-powder", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "I’m Pounding Bilberry Powder and My Skin Is Loving It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI’ve Been Pounding Bilberry Powder and My Skin Is Loving ItIt’s got 300 antioxidant-packed berries per tablespoon. What?!By Nikhita MahtaniDecember 19, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ve always been told I have really great genes—but only by people who’ve met my parents. They look like they’re 30, while I, on the other hand, have had a forehead wrinkle I’ve affectionately called “frowny” since I was 21. The youthfulness I do have is the kind most people hope to leave behind: acne, dark spots, and uneven skin tone.To compensate, I’ve developed a fairly complicated skincare routine that includes regular facials as well as tons of kale and supplements—and while they definitely make a difference, I still break out every time I take a flight, and my dark spots are more noticeable when I don’t get enough sleep (which happens often). But recently I was scrolling CAP Beauty’s grocery section in search of some more adaptogens to help manage my high stress levels, and I spotted something called dried bilberry powder. I love blueberries for their flavor and health benefits, and this product promised a similar taste and more antioxidants per tablespoon. (Hey, it was winter: I needed all the immunity-boosting power I could get!)I know what you’re thinking: Yet another supplement promising to give you that elusive “glow.” But that’s not what bilberry powder is about. Consisting of pure dried and powdered bilberries, the powder from Nordic Nordic delivers 300 berries per tablespoon. That’s so many berries! Think of it as antioxidants on steroids, protecting the skin from sun damage, curing dark spots, boosting collagen production, and aiding digestion, helping to fight the buildup of toxins in the body.Co-founder Reeta Piirala-Skoglund, who launched the brand after moving to the U.S. from Finland, explains, “I actually have very bad eczema, and this has been one of the best ways to control that in a natural way. Eating berries is such a big part of Finnish culture, and they really have a host of benefits people might not be aware of.”I started my foray into bilberry powder by adding a tablespoon to either my smoothie or coffee every day. It has a tart aftertaste—somewhat like an underripe strawberry, and if you add too much, it can definitely make your mouth pucker. I found that adding it to my smoothie worked best because it served as the fruit component—just with way less sugar. You can always add in honey or maple syrup to sweeten, but I like the way it tastes, so I don’t.While nothing happened to my skin immediately, within a week, I had a definitive glowier look about me—my dark acne spots were reduced, and my skin wasn’t as dry as I’d expect it to be in the winter. The biggest test, though, was when I went to San Francisco for the weekend, eating and drinking all the things that would normally aggravate my skin (dairy and sugar), and sleeping way too little while drinking more than usual. Instead of the patchy skin and pimples on my chin that I normally had to look forward to, my skin was softer, and I had absolutely ZERO breakouts. I had been doing nothing differently other than adding in this powder, so I now believe in its magic.“It’s just a fruit, so it doesn’t taste funky or weird at all,” says Cindy DiPrima, co-founder of CAP Beauty. “The brand really focuses on foraging for pure, clean products in the wild that are picked at optimum freshness. It’s such a great way to get maximum nutrition from the lightest product.”Bilberry powder is now a core part of my daily ritual—partly because it tastes so damn good, and partly because it just works. I add it in smoothies for a tart kick, oatmeal or pancakes for a fun vibrant color, in my coffee when I don’t have time for breakfast, or at night in hot green tea. DiPrima even suggests baking with it or drinking it in a latte like you would turmeric or matcha.Would I say I’ve turned back the clock on my skin? My skin is definitely brighter. But more importantly, I didn’t break out on two long-haul flights in the span of a week, have recently been told I look good by my very judgmental relatives, seen my dark circles substantially reduce, and have generally been feeling better. I would say that’s a total win… and, now, those comparisons to my lucky-as-hell parents are justified.Buy it: Nordic Nordic’s Bilberry Powder, $21All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishBerrySelf CareRead MoreLifestyleThe 7 Supplements That Healthyish Staffers Swear ByGallery7 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-19", "author": ["Condé Nast", "Nikhita Mahtani"]}