{"id": "174617163e765ad3e59c5e4541511940", "url": "https://www.bonappetit.com/recipe/herby-garlic-confit", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Herby Garlic Confit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueHerby Garlic ConfitBy Andy BaraghaniSeptember 18, 20184.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYou can spread the cloves on grilled bread, marinate olives and feta with the garlicky oil, mash cloves into store-bought mayo, or stir into mashed potatoes.IngredientsMakes about 2 cups4heads of garlic, cloves separated, unpeeledA small handful of thyme sprigs, rosemary sprigs, and/or bay leaves1½cups extra-virgin olive oilPreparationStep 1Preheat oven to 250°. Place garlic, herbs, and oil in an 8x8\" baking dish or a small saucepan. Cover with foil and bake until garlic is tender, 60–75 minutes. (You’ll have to pop one out of its skin to test it; it should be soft and jammy.) Let cool.Step 2Do Ahead: Garlic confit can be made 2 weeks ahead. Transfer to an airtight container and chill. Reheat over low heat before using.How would you rate Herby Garlic Confit?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleHello; The garlic baked in oil sounds delightful.  I'm going to try it. \nAre there any cloves in this recipe.  They are mentioned a few times in thee recipe but you seem to be talking about the garlic at the time.  FYI.\nSharon Frost\nOntario, CanadaShari FrostOntario, Canada3/1/2021\"...botulinum is an anaerobic bacterium, meaning it can only grow in the absence of oxygen...\" W.H.O.   M. TynerNYC1/13/2021Just a quick note! The recipe does include instructions to refrigerate after baking and for those who have botulism concerns, heating foods above 248 degrees Fahrenheit for at least 5 minutes will kill any botulism spores. After 2 weeks of storage in the fridge, there’s the possibility that the garlic will start to lose its texture and may start developing rancid flavors. Treat the 2 weeks as a “best by” date rather than a hard expiration date. I hope this helps clear up any confusion. AnonymousRangeley, Maine11/26/2019When it is stored improperly in oil (without oxygen) and in warm temperatures (at room temperature), it can produce a very serious toxin that causes the illness botulism. Botulism can be fatal if not treated immediately. It is very important to refrigerate garlic confit, as per the Center for Disease Control.AnonymousKansas City11/9/2019I just prepared this and there isn't enough oil to submerge all cloves in the jar. Should I just add plain EV olive oil to cover? Do I understand that it won't keep beyond two weeks?\nwagner_eRochester NY10/12/2019DJHOUTS from Fresno, I agree that the wording is confusing.  But in the original article about the recipe (but not with the recipe) they say that it will keep for two weeks.  That seems short too me since the \"confit'ing\" of things are not just about cooking but also preserving, but I'm not the expert on this so I'll stick with their guidance.  My plan is to cut the recipe in half, write the date on a piece of tape on the jar as a reminder of the \"expiration\" and as a reminder to make another batch. bryon1New York, New York10/15/2018Not a review but a question. You always say in your recipes, \"Can be so many days ahead\". Like this one, two weeks ahead. Does that mean that you can serve it in two weeks and then throw it out? How long does it last in the fridge? I make some of your sauce recipes and have the same problem. How long does things last in the fridge.djhoutsFresno, CA10/9/2018Not a review but a question. You always say in your recipes, \"Can be so many days ahead\". Like this one, two weeks ahead. Does that mean that you can serve it in two weeks and then throw it out? How long does it last in the fridge? I make some of your sauce recipes and have the same problem. How long does things last?djhoutsFresno, CA10/9/2018Explore Bon AppétitCondimentAmericanGarlicVegetableDairy-FreeGluten-FreeVeganVegetarianNut-FreeKetoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}