{"id": "174702dd75c3a3ba2fb4b0b99f7519a0", "url": "https://www.bonappetit.com/story/trendy-frothy-coffee", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "I Tried the Dalgona Coffee That's All Over the Internet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Gave In And Tried the Frothy Coffee ThingOh temporary, sugary joy!By Alex BeggsApril 9, 2020FacebookTwitterEmailPhoto and food styling by Emma FishmanFacebookTwitterEmailWelcome to I Gave In, in which senior staff writer Alex Beggs surrenders to the latest targeted ad, trendy recipe, or life-changing cooking tool—and reviews it.This is a GREAT time to do what everyone else is doing. Stay home! Wash ya hands! Rewatch GoodFellas. Google “allergy symptoms.” And make some frothy coffee.You don’t have to bend my arm. (It’d be the only exercise I’ve gotten all day.) I love a novelty coffee beverage. They spark me with sugary, temporary joy. If you wake up in the morning, refresh the news app on your phone, and let out a guttural moan for all of mankind, that sort of temporary joy is in short supply. So take all you can get, my friends.Frothy coffee, officially known as dalgona coffee but with multiple cousins around the world, is big on TikTok, Instagram, and foodie blogs right now. For obvious reasons! It’s ADORABLE. It looks like an emoji. Billowy, thick coffee fluff island floating on your weird “milk” of choice. Normally—haha, normal—I drink black coffee because that makes me feel like a hardened cowboy ready to lasso some tumbleweeds. But in these abnormal times, I’m looking for distraction anywhere I can find it. I wanted to try the trendy coffee.The recipe I used: Combine 1 Tbsp. instant coffee (Café Bustelo if you know what’s good for you), 1 Tbsp. sugar, and 1 Tbsp. boiling water in a cup or whatever. Froth it up with the $3 Ikea milk frother  you knew would come in handy one day for something other than spare batteries. Prepare ice and milk in a glass and pour the frothy stuff over top. Voilà!!!I’m not sure the science here, but the instant coffee dissolves (regular coffee would be grainy/gross) and, with the help of the sugar, transforms into this near-solid, creamy blob, much denser than foamed milk. If I didn’t have a frother, I’d try shaking it in a mason jar or a handheld whisk, which is how photographer Emma Fishman made it. The froth itself is sooo sweet and while the separate layers remain long enough for you to take a pic, eventually the coffee mixes into the milk and the whole drink balances out.Caveat! Instead of diluting the instant coffee, you’re getting a concentrated hit of it. It left me WIRED and BUZZIN’. My toenails were tingling. I speed-clicked between 14 different tabs open on my computer, the indoor equivalent of lassoing tumbleweeds, accomplishing nothing. But what fleeting fun.  I can’t promise anything permanent, but temporary joy? That I can handle.Explore Bon AppétitTrendsI Gave InRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Alex Beggs"]}