{"id": "175dd8fb4bcae2321f78d81ab2fdb200", "url": "https://www.bonappetit.com/recipe/steak-salad-with-harissa-potatoes-and-crunchy-radishes", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Steak Salad With Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSteak Salad With Harissa Potatoes and Crunchy RadishesBy Molly BazOctober 7, 20194.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe thing that makes this steak salad so great is that it’s equally as delicious served warm for dinner as it is prepped overnight and eaten cold for lunch the next day. The potatoes only get better as they hang out in the harissa vinaigrette, which does double duty as a dressing for the salad. (Harissa pastes vary greatly in their relative spiciness and funkiness, so try a few different brands to figure out which you like best. And remember: when incorporating into dressings, stir it in little by little until it tastes right.) If saving for lunch, the key to unwilted greens is all in the proper layering technique: Pack them on top of the cooled steak and potatoes, and wait until the very last moment to toss or shake it all together. This dish is part of the Bon Appétit Guide to Actually Enjoying Your Lunch at Work. Find more recipes, tips, and tricks here.IngredientsMakes 2 single serving lunches1lb. baby potatoes½cup kosher salt, plus more10oz. skirt steak, trimmed7Tbsp extra-virgin olive oil, divided6Tbsp. harissa paste, divided3Tbsp. red wine vinegar2large handfuls of baby mustard greens, arugula, or spinach4radishes, thinly slicedFlaky sea saltFreshly ground black pepper1lemon, halvedPreparationStep 1Place potatoes in a medium saucepan, cover with 3 qt. water and ½ cup kosher salt, and bring to a simmer over medium-high heat. Cook, uncovered, until potatoes are tender when pierced with a fork, 12–14 minutes. Drain potatoes and transfer to a plate. Let sit until cool enough to handle.Step 2Meanwhile, cut steak in half crosswise. Season all over with kosher salt. Transfer steak to a shallow bowl and add 2 Tbsp. oil and 2 Tbsp. harissa. Using tongs, turn to coat. Let steak sit at least 15 minutes and up to 24 hours.Step 3Whisk together vinegar and 3 Tbsp. oil in a medium bowl. Gradually whisk in 2 Tbsp. harissa. Taste the dressing. If it’s pungent and strong, stop there; if you feel like it could take a bit more heat and flavor, add remaining 2 Tbsp. harissa. Add potatoes to dressing, smashing them lightly with your hands to expose some of the flesh so it can soak up some of the vinaigrette.Step 4Heat remaining 2 Tbsp. oil in a medium skillet over medium-high. Cook steak in a single layer, undisturbed, until well charred, 3–4 minutes. Turn steak and continue to cook until other side is charred, 2–3 minutes longer. Transfer steak to a cutting board. Let rest for a few minutes, then thinly slice against the grain.Step 5If packing for lunch, divide potatoes and harissa dressing between 2 airtight containers. Layer sliced steak over potatoes. Divide greens and radishes between containers. Season with sea salt and a few cranks of pepper. Nestle 1 lemon wedge into each. Cover and chill until lunchtime.Step 6Let container sit at room temperature for 15 minutes before eating so oil loosens up and meat isn’t fridge-cold. Squeeze lemon wedge over, reseal container, and shake to coat everything in dressing. Transfer steak salad to a bowl if desired.Step 7Do Ahead: Steak salad can be assembled 3 days ahead. Keep chilled.How would you rate Steak Salad With Harissa Potatoes and Crunchy Radishes?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis was excellent. I didn’t add extra dressing on top once I plated it and it was still great! Threw the skirt steak on the bbq. Quick dish will definitely keep in rotation, thanks!KittycatcaronToronto 6/25/2020Really enjoyed this one! I had it slightly warm for dinner and added some onions for an added punch. My plating made it look like a heap of trash, but the flavor popped off. mrbernardiniNew York, NY5/14/2020I made this meal last night to meal prep for lunches this week and it was delicious... BUT I wish the recipe didn't say to \"toss the potatoes in the dressing\" then 2 paragraphs later tell you to reserve the dressing if you're making it for lunch.  Since this was featured in the work lunches article I wish this instruction would have been placed earlier in the recipe.  Now I have soggy potatoes for lunch... Overall though recipe is delicious and I will definitely make again. rachael.rishworthToronto, Canada10/28/2019This is so tasty and simple! I made it to the recipe but I think it would be great with other crunchy vegetables like sugar snap peas or even green bell peppers.AnonymousToronto10/16/2019So good! Doubled the recipe and made it for a family dinner. We grilled the steak and also grilled thick slices of red onion at the same time and it was such a good edition! Went a little light on the potatoes and a little heavy on the greens, but it was still really hardy and filling. Certainly going to become a regular rotation in our meal plans from now on!Anonymous10/16/2019Sub chicken for steak (fish might work too, although maybe not for traveling and shaking the next day). Didn't use quite that much salt in boiling the taters (and didn't use Kosher salt, because boiling salted water, so seemed regular salt was OK). To really make sure the potatoes soak up dressing, smash & toss while they are as warm/hot as you can handle. Dan from CT10/9/2019Explore Bon AppétitSaladSteakBeefMeatPotatoVegetableHarissaCondiments, Sauces & PastesMustard GreensLeafy GreensRadishEasyWeeknight MealsMainDairy-FreeNut-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Molly Baz"]}