{"id": "1770cfa0c2ce818496d7675e1cfd30ca", "url": "https://www.bonappetit.com/story/vegas-experience-the-unexpected", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Experience The Unexpected | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredExperience The UnexpectedFrom a whole new world of epicurean adventures to high-energy sports and entertainment, Las Vegas has its finger on the pulse of what’s next and what’s best. At this year’s Vegas Uncork’d, May 9–12, be at the center of the city’s most buzzed-about culinary extravaganza featuring one-of-a-kind events with the world’s most noteworthy chefs. Whether it’s a Vegas-style Picnic At The Park or an evening sipping rare whiskies with famed culinary names, you’ll be the first to experience the unexpected the moment you arrive.By Vegas Uncork'dApril 15, 2019FacebookTwitterEmailFacebookTwitterEmailThe perfect cocktail, a food hall to take the top spot on your favorites list, or an authentic dim sum dinner: These are just a few reasons why Las Vegas is first to wow with what’s new.Meet Me in The LibraryNoMad Restaurant brings its artful balance of accessibility, theatricality, and luxury to Park MGM Las Vegas in a soaring space inspired by the iconic library of the flagship location in New York. Dive into communal courses served alongside elevated American classics, and don’t miss the signature NoMad Roast Chicken for two.Rosé-Colored GlassesBusinesswoman and TV personality Lisa Vanderpump brings the glamour and romance of her Los Angeles empire to glittering Las Vegas with the all-new Vanderpump Cocktail Garden at Caesars Palace. You’ll sip on craft cocktails, Vanderpump Sangria and Rosé, and thoughtfully curated wines among the rose garden—and maybe even a few stars.Dim Sum DarlingNow you can savor all the unique flavors of traditional dim sum in Las Vegas at Mott 32 in The Venetian Resort Las Vegas. Hong Kong’s most awarded restaurant, named after the famed convenience store at 32 Mott Street in New York’s Chinatown, mixes the taste and sensibilities of China and infuses them with modern techniques and farm- to-table practices. From dumplings to scallion pancakes, each bite will leave you transported.Raise a Glass to the PastGo back in time when you slip inside The Underground at the Mob Museum, accessible only with a password spoken through a slot on an unmarked door. This small distillery makes corn-mash moonshine and offers 30-minute tours, as well as Prohibition-era cocktails for those in search of a boozy adventure. Looking to host your own private shindig? Ask the bartender to reserve The Fitting Room, a hidden private lounge for 12.Vineyards Via VegasWine enthusiasts, rejoice! The all-new Winemaker Dinner Series brings renowned vintners from around the globe to Wynn Las Vegas to craft exclusive pairing menus designed to delight. This one-of- a-kind experience takes food and wine lovers on a journey through each vineyard without ever leaving the table.New on the BlockPrepare to be amazed—and satiated—after a visit to Block 16 Urban Food Hall in The Cosmopolitan. From the debut location of Pok Pok Wing, by James Beard Award- winning chef Andy Ricker, to the famed Hattie B’s Hot Chicken by way of Nashville, this all-day global eatery with a lively atmosphere does not disappoint.The Curated CocktailAt Oak & Ivy, discover a new world of whiskey with barrel-aged cocktails, rare beers, and spirits. Whether you prefer a Mule with house- made ginger beer, a classic Manhattan, or ask the bartenders to create something unique based on your tastes, there’s something for every libation lover.Visit VegasUncorked.com for more information.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Vegas Uncork'D"]}