{"id": "177fe14f82af6a2ddc099fb3324b6755", "url": "https://www.bonappetit.com/recipe/pan-con-tomate", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Pan con Tomate Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssuePan con TomateBy Andy BaraghaniJuly 9, 20194.5(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSpoiler alert: We broke with tradition. Instead of rubbing toast with cut tomatoes, we grated the tomatoes to make a raw sauce that the bread can really absorb.Ingredients4 servings1ciabatta loaf3Tbsp. extra-virgin olive oil, plus more for drizzling2garlic cloves, halved crosswise2lb. heirloom tomatoes, coredFlaky sea saltFreshly ground black pepper, chopped oregano, and/or oil-packed anchovy fillets (for serving; optional)PreparationStep 1Preheat oven to 300°. Holding a bread knife so it’s parallel with work surface, slice ciabatta in half lengthwise (like opening a book). Slice each piece in half lengthwise down the center, then cut each strip on a diagonal into 4 pieces (you should have 16 pieces total).Step 2Drizzle 3 Tbsp. oil over bread and rub each piece to evenly distribute oil. Place bread on a rimmed baking sheet and bake until lightly browned and dried out, 30–40 minutes. Rub warm toast with cut sides of garlic; set aside.Step 3Meanwhile, slice a thin round off the bottom of each tomato. Starting at cut end, grate tomatoes on the largest holes of a grater into a medium bowl until all that’s left are the flattened tomato skins. Finely chop skins and mix into grated flesh; season very generously with salt.Step 4Spoon a generous amount of tomato sauce over each toast (you may have some left over). Let sit at least a minute or two so bread can absorb some of the juices. Drizzle with oil, sprinkle with more salt, and top as desired.How would you rate Pan con Tomate?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFor something so easy, I got a ton of compliments. Delicious. A perfect way to use fresh tomatoes. JessToronto8/31/2021so yummy! I added caramelized leeks on top bc I had leeks I needed to use up. Delicious and fresh :) Anonymous8/15/2019This is amazing.   This is so easy and so GOOD.  Thank you, Andy.donaleenPortland, OR8/14/2019Explore Bon AppétitToastSpanishEuropeanTomatoVegetableGarlicSummerQuickEasy5 Ingredients or FewerStarterSnackDairy-FreeNut-FreeVegetarianVeganLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}