{"id": "179c72b6336f16ead0b5a2329b91ef04", "url": "https://www.bonappetit.com/recipe/baklava-dip-with-rosewater-vanilla-yogurt-and-honeyed-nuts", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Baklava Dip with Rosewater-Vanilla Yogurt & Honeyed Nuts Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBaklava Dip with Rosewater-Vanilla Yogurt & Honeyed NutsSponsored by Stacy's®FacebookPinterestTwitterEmailBreak up the dessert routine with this sweet, cooling dip to pair with Stacy’s® Cinnamon Sugar Pita ChipsPrintIngredientsFor the yogurt:16 oz. thick Greek yogurt2 teaspoons vanilla extract2 teaspoons rosewater, (note: If you can’t find rosewater, use some orange zest or simply omit)For the honeyed nuts:1/4 cup granulated white sugar1/4 cup honey, plus extra for garnish1 lemon, zested then juiced (zest reserved for garnish)1 stick cinnamon2 pods cardamom1/2 cup pistachios, roughly chopped (one pinch reserved for garnish)1/2 cup walnuts, roughly chopped (one pinch reserved for garnish)To finish:1 bag Stacy’s ® Cinnamon Sugar Pita ChipsA pinch of ground cinnamon for garnishRecipe PreparationStir together yogurt, vanilla, and rosewater.Heat a medium pan over medium heat. Add the chopped nuts and toast, tossing frequently, 2-3 minutes until fragrant and\nlightly browned. Transfer immediately to a sheet pan and spread out to cool.In a small saucepan, combine sugar, honey, lemon juice, cinnamon stick, cardamom pods, and 3 Tbsp. water. Bring to a boil, stirring until sugar is dissolved, then reduce heat to low-medium (just enough to keep bubbling) for an additional 4 minutes without stirring.Remove from heat and let the syrup cool slightly. Once cool, remove the cinnamon stick and cardamom pods and discard. Fold in the toasted nuts and stir to combine. Let cool completely.Fold the honeyed nut mixture into the yogurt. Garnish with reserved chopped nuts, the lemon zest, a few pinches of ground cinnamon and a drizzle of honey. Enjoy with Stacy’s ® Cinnamon Sugar Pita Chips.Sponsored by Stacy's®GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredStacy's® Pita ChipsMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Stacy'S"]}