{"id": "17a04c739ac13749c2311be99dd7ec29", "url": "https://www.bonappetit.com/story/kristyn-leach-restaurant-diary-1", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "I Hope We All Survive This Year and I'm Still Farming by the End of It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Hope We All Survive This Year and I'm Still Farming by the End of ItIn her first Restaurant Diary entry, farmer Kristyn Leach talks about the never-ending pivots she’s had to make due to COVID-19, fire season, and food insecurity in her community.By Kristyn Leach, as told to Aliza AbarbanelFebruary 24, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them, from a bartender in Atlanta to a line cook in Denver. This week’s diarist is Kristyn Leach, a farmer in Winters, California. Here she explains what last year was like for her, with COVID-19, wildfires, food insecurity, and the toll all that has on small-scale farmers like her.My hair is way grayer than ever before.I started my farm 10 years ago in Winters, California, and I grow primarily Asian herbs and vegetables, mostly Korean heritage crops. A lot of the crops go exclusively to Namu Restaurant Group in San Francisco, and, remarkably, that was still the case in 2020. Namu has always used a lot of Korean radish and Napa cabbage for different styles of kimchi, and we shifted to growing more things they could preserve and either sell or store, like Korean perilla for banchan or chile peppers for chile crisp. During the pandemic they also provided meals for World Central Kitchen and SF New Deal, so some of the crops were used for that.We didn’t lose crops or money directly due to COVID, but we had other issues that were exacerbated by the pandemic. Three years ago we moved to our new farm plot and we’ve been dealing with some preexisting soil issues since then. This has caused crop loss throughout the season, and the market channels—restaurant wholesale and farmers markets—were rapidly shifting due to the pandemic. In the end we weren’t able to grow the business in ways we thought would be possible, like starting a farmers’ market stand to sell straight to consumers.My daughter was born in June, and in August the LNU Complex Fire came through our town. We’re used to fire season. There are always a number of weeks where I’m out there wearing a mask, dealing with smoke, and trying to keep the working days as short as I can. But I’ve never had it affect me on a physical level like this. This was the first year where it felt like the mask wasn't enough. Having a newborn was very stressful—sleep has been crazy, of course—and during those weeks of bad smoke, it was hard because if I started coughing badly I would wake everybody up. The first night she slept for eight hours straight we were so excited and then we were like, “Wait is this smoke inhalation?”I’ve been working with an organization called Kitchen Table Advisors, which gives free business advice to small farmers. They helped a number of us in their program write a grant so we could do free food distribution for families at risk of being food insecure. Some farmers had lost business when the hospitality industry collapsed and schools shut down, but we still wanted to plant and grow things more than ever, regardless of the uncertainty in the market. That’s how Namu Farm started Seed Stewards CSA last July.Photo by Eugene Kan of MaekanSeed Stewards is a free vegetable subscription box that uses the CSA model to build conversations around seed selection. We sent them to 30 families in the Bay Area, mainly Korean, Filipino, and Vietnamese American families with kids between the ages of 4 to 10. The subscription comes with this geeky botany curriculum and recipes, and kids in the group are asked to conduct interviews with people who have a cultural understanding of that month’s key vegetable, like their grandma. We even do a virtual potluck. I was a little worried because kids are on Zoom more than ever and parents are working remotely, but we got feedback that it was nice to have some substantive community building in the virtual space. I know for me personally, it was the thing that got me through the challenges of this year.I’m looking forward to continuing our Seed Stewards CSA. This year we’re going to link up with five other farmers for a coordinated eight-month program. Each month’s vegetable box will showcase different varieties of a highlighted crop, so we’ll send out radishes in June from a farmer from Santa Cruz who will talk about the radishes she grows and how they play into her cultural heritage. Right now we’re trying to set it up through Patreon, so people outside our group can pay to participate remotely in the programming, and other small farms we’re friends with can offer the curriculum to their CSA members too.We’re heading into another year where there’s just as much lingering uncertainty. More restaurants are closing, and there’s no sense of when that market will be coming back. There is a potential mental health crisis en masse for a lot of farmers, and we don’t have the energy to be as proactive as we were last spring. It’s felt unrelenting, between a dry winter, COVID, planting in spring, and fires happening earlier and more intensely.I hope we all survive this year and I'm still farming by the end of it. The good part of everyone getting their ass kicked was realizing the bad parts of the ruggedly masculine ways farmers have of working alone, gritting our teeth, and getting through things. How many years, if we get more years like this, can we keep doing this and deal with the redundancies of doing it all in our separate little ways? I’ve been connecting a lot with other small-scale vegetable farmers, sharing knowledge, resources, and just talking in a supportive environment. I'm hoping we start figuring out more collective models because that’s how we continue to have these livelihoods in the future.Explore Bon AppétitRestaurantsRestaurant DiariesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-24", "author": ["Condé Nast", "Kristyn Leach", "As Told To Aliza Abarbanel"]}