{"id": "17a906552e823b0326b265c589e3d44f", "url": "https://www.bonappetit.com/recipe/autumnal-tonic", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Autumnal Tonic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAutumnal TonicHarold Villarosa shows us his special take on a classic G&T. With sake, orange-ginger simple syrup, thyme and cranberry garnishes, your house is sure to smell like autumn.By BOMBAY SAPPHIRE® GINDecember 10, 20205.0(3)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire4oz. premium tonic water2large strips orange zest (with pith)1one-inch piece ginger, thinly sliced1lemon wheel, for garnish1fresh thyme sprig, for garnish½cup sugar½oz. semi sweet sakeSmall handfull of fresh cranberries, for garnishIcePreparationStep 1Combine sugar, orange zest, ginger, and ½ cup water in a small saucepan. Bring to a boil over medium-high, stirring until sugar is dissolved. Reduce heat to medium and simmer for 5 minutes.Step 2Set a fine sieve over a medium heatproof bowl. Strain the mixture into the bowl; discard solids. Refrigerate ginger-orange syrup until chilled, at least 30 minutes.Step 3Fill a glass with ice. Add the Bombay Sapphire, sake, and ½ oz. of the ginger-orange syrup. Top with tonic water and gently stir.Step 4Garnish with a lemon wheel, cranberries, and a sprig of thyme.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2020. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Autumnal Tonic?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGorgeous juniper, ginger flavour combination. I love this cocktail. The ginger isn't heavy at all. Just enough for a bit of the flavour to enhance botanical in the gin! This is a hit and I strongly recommend this lovely, delicious gin cocktail! It's fabulous!Anonymous12/30/2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-08", "author": ["Condé Nast", "Bombay Sapphire"]}