{"id": "17a96a4d40a4d3d0f5821b05b3947f67", "url": "https://www.bonappetit.com/recipe/antipasto-salad", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Antipasto Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueAntipasto SaladBy Andy BaraghaniJuly 10, 20184.4(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintA no-cook summer salad with a lemony, garlicky dressing. And salami. Long sweet peppers show up at farmers’ markets during the peak of the season and may be sold as long sweet yellow, sweet banana, Hungarian Sweet, or Cubanelle. For this antipasto salad recipe, you can substitute two medium red, orange, or yellow bell peppers (don’t use the green ones).Ingredients4 servings 1garlic clove, finely grated⅓cup extra-virgin olive oil¼cup red wine vinegar½tsp. crushed dried oreganoPinch of crushed red pepper flakes3Italian long sweet peppers, thinly sliced into rounds1small red onion, thinly sliced, rinsed114-oz. can artichoke hearts, drained, patted dry, halved18-oz. ball fresh mozzarella, torn into pieces4oz. salami, preferably fennel, thinly slicedKosher salt, freshly ground pepper1lemon2cups basil leavesPreparationStep 1Mix garlic, oil, vinegar, oregano, and red pepper flakes in a large bowl. Add sweet peppers, onion, artichokes, mozzarella, and salami and toss to coat; season with salt and black pepper. Let sit, tossing occasionally, at least 15 minutes.Step 2Zest half of lemon over salad and add basil; toss to combine. Season with more salt and black pepper if needed.Step 3Do Ahead: Salad (without lemon zest and basil) can be made 1 day ahead. Cover and chill.How would you rate Antipasto Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleLove an antipasto salad! I don't like peppers so substitute sun-dried tomatoes.  A can of chickpeas or white beans are not unwelcome here. Bulk up with a mixture of little gem lettuce and radicchio. Perfect for those summer nights when it's too hot to turn on the stove! Serve with a light, chilled red or an ice-cold beer. Delish!JamieSan Francisco7/8/2021Absolutely hands down the best Antipasto recipe. Made this recipe multiple times- works well with shallot in place of the red onion too!WARWICK, NY7/23/2019Omitted the Basil only because I forgot it at the store, used a little less onion, and it was amazing. The dressing reminded me of growing up as I was raised on red wine vinaigrette’s.\nWill add this to my go too’s.\nThanksAnonymousBenicia, CA6/16/2019I liked this salad waaaaay more than I thought I would.  Italian peppers were a trick to find (I have a good grocer but they were pretty picked over) and I wanted something with a bit more flavor than just yellow/orange/red peppers.  I admit, it's Hatch chile season and I was tempted to use a mild one, but wasn't brave enough this first time around!  So I picked up a good orange pepper, then grabbed a jar each of cherry and banana peppers and diced some of those in---normally am not a fan but they did super well in this recipe---just be sure to give them a quick rinse to get the excess vinegar off after cutting since you already have it in the dressing here.AnonymousHouston8/19/2018This is a winner!  the flavors are bright and flavorful.  The only thing I changed is that I used sliced roasted red peppers from a jar.  The cubanelle peppers didn't do much for me.  I also added a chopped plum tomato since I had it on hand.  The dressing is perfect and lent a great flavor to the dish.  It also makes a great sandwich on a ciabatta roll with lettuce leaves on each side to keep it from getting soggy.  I can't wait to make it again!AnonymousLower Hudson Valley8/4/2018Explore Bon AppétitSaladItalianEuropeanRed OnionOnionVegetableArtichokeMozzarellaCheeseSalamiCured MeatMeatSummerQuickEasySideGluten-FreeNut-FreeKetoLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}