{"id": "17b50fbfd7b8d6518643144a94edb06a", "url": "https://www.bonappetit.com/story/pandemic-food-innovations", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "The Pandemic Food and Takeout Innovations That Changed Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusBouncier Buns and Nori Sleeves: How the Pandemic Changed Restaurant FoodWhile you were ordering delivery, food scientists were making sure that burger was up for the job. By Alex BeggsMay 20, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailDay in and day out, we live our lives not thinking about the scientist in the lab somewhere trying to find a solution to one of humanity’s greatest problems:The squished, downtrodden hamburger bun.The bun that lost her bounce. And when COVID-19 hit and delivery orders skyrocketed, the Squishy Bun Issue became more prevalent than ever. Have you had a burger delivered lately? How did it hold up? If it was decently bouncy, golden and rounded, it might have been a bun recently improved by the scientists at Kerry, an Ireland-based food company that makes ingredients for every corner of the food industry, from restaurants to grocery stores. Inside the bun dough is Kerry’s trademarked enzyme Biobake™, a naturally occurring protein that, when added in the perfect ratio and kept at the perfect temperature, creates a more resilient bun.While I can’t tell you which fast-food restaurants source their buns from wholesale bakeries that develop their recipes with Kerry, I can tell you that it’s MANY.Kerry was working on bun improvement months before the pandemic, but the timing was prescient. Restaurant delivery skyrocketed in the neverending months of lockdown. And everyone from fast food bigwigs to 40-seat sushi spots wanted their food to hold up as well as possible, whether it was traveling in a bike messenger’s backpack or an UberEats backseat. Some restaurants had teams of culinary experts and scientists behind the scenes calibrating a heartier flatbread dough, while others were crafting special packaging. Their solutions to the delivery conundrum reveal the creativity—and chemistry—behind what we usually just think of as dinner.Take my money, PaneraThis April, I ordered lunch from Panera, the healthiest fast food option. If you get a grain bowl. Instead I ordered two of their snazzy new flatbreads, aka “long pizza.” My delivery person got lost and was off by ~ 4 minutes. My flatbread, packaged in a pizza box, was a tragic 98 degrees. Ideally, it should have been at least 120, the temperature “when you think something is hot and delicious,” according to Panera’s Chief Food Innovation Officer Claes Petersson.“If it gets colder than 120, you start to think, ‘Oh, this is a bit cold. I want to reheat it.’” Oh, this is a bit cold, I thought, I want to reheat it. I reheated my chicken-and-bacon flatbread back to life and scarfed down every bite. However, if I’d ordered it again today, the flatbread would have been packed on top of a piece of corrugated cardboard that prevents heat from escaping through the bottom of the box and keeps the long pizza 10-15 degrees warmer; a change that went into play after weeks of extensive temperature studies.Instagram contentThis content can also be viewed on the site it originates from.Before the temperature studies, there were dough studies.The flatbreads were designed to be eaten in Panera restaurants; the weight of the dough per flatbread was 110 grams for a perfect chewy-crisp base. But in March 2020, “we went from pretty much 85% dine-in to 85% off-premise overnight,” said Petersson. They tested the flatbread’s deliverability and found that the dough was drying out, especially when reheated at home.Petersson’s team did “gazillions of tests” and he ate hundreds of flatbreads until they landed on a new weight: 165 grams, which would be just as chewy-crisp in the cafés as it is at home. The flatbreads launched in October, four months later than intended—but optimized. As more diners return to the cafés, the recipe will remain the same.How do you deliver a 60-ounce wood-fired lamb shoulder?You could try to package the magic of Maydan, the D.C. restaurant that earned the No. 2 spot on our 2018 Hot Ten list, in a plastic takeout container, but the massive stone hearth would probably melt the container and all your extremities before you got home. That didn’t stop owner Rose Previte from giving it a go.“We would never have done to-go before, ever,” she told me. But last March, she looked around the kitchen and asked, “What do we have that we can put in boxes?” The restaurant’s signature dish is a 60-ounce wood-fired lamb shoulder showstopper.Instagram contentThis content can also be viewed on the site it originates from.“We started shoving them in those containers that you would get a rotisserie chicken in at the grocery store,” she said. “Then we realized there's no way. This is never going to be as good at home as it is [in the restaurant].” They switched the dish to be smaller lamb shanks, under-cooked them on the hearth, and gave customers instructions for reheating them at home.“I wish I could tell you I had a scientist who did something like infuse the smell of smoke, because that’d be really cool. It’s less romantic than that.” Five iterations of changes all came down to packaging, finding the perfect aluminum-bottomed container that could go right into customers’ ovens.Now that the restaurant is opening up for indoor dining, the shoulder is available on-site again. When they return to full capacity, takeout will stop—there isn’t room in the restaurant to do both—but people can still order event catering they call “celebration packages,” an offering Maydan didn’t have pre-pandemic but one that’s become a profitable side-hustle. (Get the ribeye kebab!)We must protect the noriIt was in the back of Lisa Limb’s mind: How could they ever deliver Nami Nori’s temaki? Once assembled, an eater has minutes before the moisture from rice and fish dampens the crisp nori wrapper into the texture of a soggy tissue. Limb, a partner at the 40-seat, always-packed New York restaurant, had been working for months on a prototype of a plastic sleeve to slip the temaki’s nori wrappers in, like a tiny nori book jacket. One day, eventually, they’d do takeout. Then Covid hit and she realized: “Oh, I guess we’re doing this now.”Instagram contentThis content can also be viewed on the site it originates from.She quickly began searching for a manufacturer who could make the sleeve with compostable material and was rejected by over a dozen before ordering a test-run of 25,000. Each temaki gets two sleeves that protect the nori. The diner slips them off from each side without messing up the toppings held inside—and there’s a cute GIF version on their site to show you how it’s done. “Restaurateurs, we are a resilient, creative bunch of people,” Limb said.Meanwhile, Limb’s husband took their dishes for an hour-long bike ride and they sampled the results. The calamari battered in rice flour held up, even when microwaved. But the spicy tuna crispy rice dish, normally served on delicate rice chips at the restaurant, wasn’t working; they transformed it into a dip. When Nami Nori announced it was doing delivery on Instagram, the same people who’d crowded into the restaurant and waited hours for a spot at the bar came calling.“That first day we were slammed,” she said. “Some of us still are in shock, just thinking about what happened.” They had to close early—they ran out of food. By the end of the week, Limb had to place another order for the nori sleeves: 500,000.Delivery has slowed down now that the weather’s warmer and indoor dining in New York is returning to fuller-and-fuller capacity. But Nami Nori’s delivery and takeout will continue; they’ve got it down to a science now.Each order comes with illustrated instructions on how to pull the nori sleeves off—like a note from mom in our lunchbox. They wanted customers to feel the same personal connection they feel in-person, when that temaki is placed in front of them by a human being, said Limb: “Even though you can't see us, you know that we’re here, and we’re still doing it.”Back to BurgerlandBack in their Chicago bakery lab, Kerry spent close to a year on the bun project. After all, that trademarked enzyme was going to span the country, then the globe. The local restaurateurs had days to adapt and get on with the show. Richie Piggott, the enzymes expert at Kerry, kept using the word “resilience” to describe the improved, plush burger buns. In bakery terms, he said, “resilience is the ability to spring back to its original shape when it’s subjected to compression.”And isn’t resilience what this is all about?It’s amazing what restaurants and chefs came up with to keep their food as high quality as possible despite the obstacles being thrown at them from every direction. Millions of people were stuck at home, and some had the privilege of getting food delivered to us like exiled Napoleons. And what did the restaurant industry do? Made that food better. We don’t deserve them.Explore Bon AppétitCultureCoronavirusTechnologyRead MorecultureHow a Single Appliance Made Americans Better CooksBy John BirdsallcultureYou’d Never Guess These Food Brands Are 50 Years OldBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-20", "author": ["Condé Nast", "Alex Beggs"]}