{"id": "17b7c8af81f744e73005085f21cf4708", "url": "https://www.bonappetit.com/recipe/dry-rubbed-roast-turkey", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Dry-Rubbed Roast Turkey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueDry-Rubbed Roast TurkeyBy Andy BaraghaniOctober 16, 20184.7(123)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOur never-fail turkey produces a holiday centerpiece that is excellent in every way that other turkeys often fall short. It’s not bland, thanks to a sugar-and-salt dry rub. It’s juicy as heck, because we nailed the optimal target temperature (might as well write 150° on your hand now). And cooking the turkey on a rimmed baking sheet is great for all-over browning, but be extra careful as you remove it from the oven so that the drippings don’t slosh over the sides.Ingredients8–10 servings½cup Diamond Crystal or ¼ cup plus 1½ tsp. Morton kosher salt1Tbsp. light brown sugar112–14-lb. turkey, neck reserved for gravy, giblets discarded, patted dry12Tbsp. (1½ sticks) unsalted butter, room temperature, divided¼cup sherry vinegar or red wine vinegar2Tbsp. honey4tsp. Worcestershire sauce3sprigs rosemary3garlic cloves, crushed22x1\" strips orange zestPreparationStep 1Place salt and brown sugar in a medium bowl and work together with your fingers until incorporated. Place turkey on a wire rack set inside a rimmed baking sheet. (If you don’t have this setup, place your turkey on a V-shape rack set inside a large roasting pan.) Sprinkle dry brine all over outside and inside of turkey, patting to adhere and nudging some into crevices. You won’t need all of the dry brine, but it’s good to have extra since some of it will end up on the baking sheet as you season the turkey. Chill bird, uncovered, at least 12 hours and up to 2 days.Step 2Remove turkey from wire rack and rinse baking sheet and rack if needed (turkey will most likely release some liquid onto pan). Line baking sheet with 3 layers of foil and set rack back inside. Place turkey, breast side up, on rack and tuck wings underneath. Let turkey sit at room temperature 2–3 hours.Step 3Place an oven rack in middle of oven; preheat to 450°. Using your fingers, loosen skin on breast. Work 4 Tbsp. butter under skin, spreading evenly over both breasts. Smear outside of turkey with another 4 Tbsp. butter.Step 4Tie legs together with kitchen twine and pour 1 cup water into baking sheet.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Roast turkey, rotating pan halfway through, until skin is mostly golden brown all over, about 30 minutes.Step 6Meanwhile, cook vinegar, honey, Worcestershire sauce, rosemary, garlic, orange zest, and remaining 4 Tbsp. butter in a small saucepan over medium heat until bubbling and slightly thickened, about 5 minutes. Reduce heat to lowest setting and keep glaze warm.Step 7Reduce oven temperature to 300° and continue to roast turkey, brushing with glaze every 30 minutes and adding more water by ½-cupfuls as needed to maintain some liquid in baking sheet, until an instant-read thermometer inserted into the thickest part of breast near the neck registers 150° (don’t worry; the temperature will continue to climb while the bird rests), 65–85 minutes longer. Skin should be deep golden brown, shiny, and crisp. Transfer turkey to a cutting board and let rest at least 30 minutes and up to 1 hour before carving.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHow would you rate Dry-Rubbed Roast Turkey?Leave a ReviewTell us what you thinkReviews (62)Back to TopTriangleI made this last night for Thanksgiving and it was an absolute Knock-Out! So tender and moist and had the BEST flavor. Everyone said it was the best turkey they had ever had. I had to humbly agree. I added some lemon zest and chopped rosemary to the dry brine mix and brined my 16lb turkey for a little over 24 hours. I did take it out when it reached 160* but followed everything else to a T. Turkey rested for around 1.5 hours and it was still warm and just perfect. Leslie SockLos Angeles, CA 11/26/2021This is the third year I’m making this. Outstanding! The only thing that would make this better is if Andy were here making it with me! Next year, please, Andy! ;-)Jason SChicago11/25/2021The first time I made a Thanksgiving turkey on my own in 2020 I used this recipe - and the results were outstanding! The turkey tasted delicious, looked magazine spread ready, was simple but flavorful and a huge crowd pleaser. Will use this recipe again this year and for many years to come!matthewSomerville, Ma11/22/2021I have made this turkey for 3 friendsgivings, 2 thanksgivings and a few Christmas’.  Each year it tastes better and better. My now husband said this turkey is one of the reasons he wanted to marry me! Hahahah but really its that good. Bon Apetit is my secret weapon in the kitchen. It will be basically impossible to try and find a better/new recipe than this. Christina Los Angeles 11/19/2021Andy big kudos to you! Other Turkey recipes are way too complicated and yours is very easy to follow and delicious! It’s been three years I’m making it and never failed me. I’ll never try to make another kind of Turkey at all. 👏🏻EdaCa11/19/2021Three years running I made this for Friendsgiving. It never fails to satisfy the need for the classic turkey. Make this one and you'll have a tough time searching for something better. Ryan11/12/2021THIS IS THE ONE. If you want the best turkey recipe out there, this is the one. Phenomenal. Thanks Andy 😀LMartisMontreal, Canada 11/11/2021Can you do this with a 20lb turkey-just with more dry rub?Melissa New Hampshirite 11/10/2021Made this last year and it is FANTASTIC. The skin was incredibly crisp and the meat was juicy and flavorful. I'm visiting this page again so I can bookmark this for this Thanksgiving. Allison JaneMichigan11/9/2021Made this last year and the family loved it! So juicy and flavorful. Looking forward to repeating it this year. Garrett PKansas City, MO11/7/2021Truly the best turkey I’ve ever had! It’s easy to make and has become our go-to turkey recipe! \nSueOttawa, Ontario10/5/2021Bottom line, best turkey recipe EVER!Anonymous7/5/2021So delicious.  My family requested that this be the only way I make turkey again!Becky TDarlington, SC11/30/2020This recipe was perfect. Turkey was delicious and everyone was so impressed. Thank you!!Victor MardikianAnn Arbor, MI11/28/2020I followed an earlier review and brined my 13 pounder on Monday. I followed the remaining directions. I had to remake the glaze because I burnt the first batch. The bird looked fantastic, like picture perfect, and was moist top to bottom! I did cover the breast toward the end to let the thighs catch up ( to 160.) Made the gravy which was also on point. Thank you!\nPaul the DadChefSt. Petersburg, FL11/27/2020Explore Bon AppétitAmericanTurkeyPoultryRosemaryHerbs & SpicesOrangeCitrusFruitMainNut-FreeRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Andy Baraghani"]}