{"id": "17bcdd4de67a18f8c709bbd3a9229115", "url": "https://www.bonappetit.com/story/taylor-elyse-morrison", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "This Self Care Founder Wants You to Stop Doomscrolling and Start Drawing Cards | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Founder Wants You to Stop Doomscrolling and Start Drawing CardsTaylor Elyse Morrison is all about midday baths, Zoom doodles, and finding a wellness routine that works for you.By Brittany HutsonFebruary 23, 2021FacebookTwitterEmailPhotograph by Anna ZajacFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Taylor Elyse Morrison, founder of self-care start-up Inner Workout.  Taylor Elyse Morrison knows what it’s like when wellness starts feeling like another item on the to-do list. Her philosophy? Make your practice cumulative, not stressful. Since starting her company, Inner Workout, an online platform offering self-care resources and experiences, she’s been more intentional about turning inward, and responding to her needs as they arise rather than sticking to an arbitrary schedule. A day in the founder’s life looks a whole lot different from the hustle-heavy stereotype of entrepreneurship. There’s plenty of that, of course, but if Morrison craves a midday bath or a moment to doodle in her notebook, she’ll do it. As someone still figuring out my own self-care style, her in-the-moment approach intrigued me. I’ve certainly felt discouraged when it feels like everyone else on Instagram has their “two hours of self-care before 8 a.m.” routine lock-in. Some days I can comfortably squeeze in 10 minutes of meditation, 30 minutes of reading and journaling, and 45 minutes of exercise before work. On other days, I feel lucky if I can manage a cup of hot water and lemon.Instead is available for preorder on Kickstarter through March 11.\nPhotograph by Anna ZajacTo Morrison, having an hours-long routine isn’t always realistic, or even what you need every day. But it is possible to reclaim brief moments of care. That’s where Inner Workout’s latest product—a 50-card deck called Instead—comes in. The idea is that if you’re bored and tempted to grab your phone, you pick up a card instead. Each one offers a bite-size activity or affirmation prompt designed to help us quit the dreaded doomscroll, reclaim our minutes, and encourage daily reflection. Suggestions like “feel your feet on the floor” or “find rest in this moment” promote contemplation over comparison and offer manageable strategies for feeling better. Over time, the idea is that each little moment adds up, as you divest from distraction and reinvest in self-care.Instead is available for preorder on Kickstarter through March 11. Ahead of the product’s official launch, I spoke with Morrison to find out how she integrates these principles into her own life, what led to the creation of Instead, and why quality over quantity matters with self-care.Today for my self-care… I woke up without an alarm, laid in bed listening to the sounds, and then checked the time on my phone. I meditated for about seven minutes with the Insight Timer app. Then I took my dog for a walk. Later I did a Barre workout, which I was really nervous to do because that amount of muscle repetition hurts! But I decided that I needed it for my body. In the middle of the day, I took a bath because I was freezing and that’s how I like to warm up.I’m not interested in being… the type of entrepreneur who is “on” all the time. I’m trying to push back against that mentality, and I’ve gotten really intentional about it over the past six months. I remind myself that I don’t always need to be on email or social media. Generally, I try to check my email four times a day. I allow myself two Instagram visits per day, but I don’t have a strict time limit. I’m experimenting with what feels good, but the goal is to be on for only what’s necessary. My natural state is to work all the time, especially when I enjoy that work. But if I’m going to sit here and say that it’s important for you to take care of yourself and I’m burning myself out, that’s not in alignment with my personal values or my company’s values.Being distracted and taking breaks… isn’t necessarily a bad thing. But I found that scrolling was not a helpful way for me to take a break. Instead of sitting and thinking about things when I was bored or anxious, I’d scroll. And I’d get all this information that wasn’t actually helping me process my feelings, so I’d just sort of stew in them. I think that kind of passive, mindless dwelling can exacerbate your stress and feelings of negative self-worth. That time could be spent on supporting your well-being instead of pouring hours into an addictive app that’s designed to hold your attention for as long as possible.What we heard in our customer research was… people didn’t love how much they were engaging with Instagram. Then, when the pandemic hit, it was clear that we all started spending even more time on the platform. People essentially said that Instagram is a “necessary evil,” especially for creatives and business owners who feel like they need to have some type of presence on there. But they also feel worse about their art or business when they compare themselves to other people’s highlight reel. My team and I came up with four different product options, and the deck of cards resonated the most.One of our impact goals is to… help people reinvest 500 hours a year from social media into self-care. To some extent, it’s helpful to have social media to connect and reach people, especially right now when we’re so isolated. But I don’t think that’s where the transformation happens. We can post all kinds of feel-good quotes, but it takes more than a double tap or a share for those things to have an impact. We have to actually practice them. Knowing, caring for, and becoming your full self requires intentional work. The Instead cards offer a direct route to doing that. For example, the other day I was in a Zoom meeting and I pulled a card that said “make art.” So I started doodling while I was listening in on the meeting, instead of scrolling on Instagram or getting distracted by my website’s Google analytics.When it comes to self-care… I think we get stuck on the quantity debate—how much is enough? It’s of course nice to care for yourself for longer periods of time, but that isn’t always realistic or accessible to everyone. I think bite-size moments of self-care add up in the same way that bite-size social media moments add up—or those moments when you’re feeling inadequate or stressed or overwhelmed. You can replace those moments with listening to yourself and doing something kind for yourself. It starts to add up and you start craving more of that.Explore Bon AppétitHealthyishPerson of InterestSelf CareInterviewsRead MorecultureThis Twitter Tarot Reader Finds Mental Health Wisdom in the CardsBy Joseph HernandezLifestyleAstrology Apps and Tarot Cards: My Pandemic Search for CertaintyBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-23", "author": ["Condé Nast", "Brittany Hutson"]}