{"id": "17bed59cbd9805149a532a340fc1c861", "url": "https://www.bonappetit.com/story/sunrise-bottle-shop-austin", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Sunrise Bottle Shop Is the Place for Natural Wine in Austin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s Only One Place in Austin Where I Buy My WineSome people visit Sunrise Mini Mart to fill their gas tanks; I go for the hard-to-find bottles.By Andrew KnowltonApril 2, 2019FacebookTwitterEmailPhoto by Jessica AllieFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The two biggest concerns I had when I recently moved from NYC to Austin was where to get my haircut and where to buy my wine. Thankfully, a friend recommended a guy named Tim Beard, no joke, for the former. The wine proved more difficult. And then I heard about Sam Rozani and the gas station he manages called Sunrise Mini Mart (a.k.a. Sunrise Bottle Shop).Sunrise sells all the things you expect from a normal gas station—chips, smokes, and that new flavor of Gatorade. But it also has one of the craziest, most impressive, and most unexpected natural wine selections you’ll come across. Sunrise Sam, as his fans call him, first fell in love with craft beers (you’ll find offerings from pretty much every outstanding Austin craft brewer, as well as those further afield), which eventually led to his infatuation with low intervention wines. These days you’ll still find a few people filling up their cars with gas, but the rest of us are filling our trunks with cases of hard to find bottles. Wine from Mexico? Yep. Sam stocks as much Bichi as he can get his hands on. Sake? Yamada Shoten’s Everlasting Roots tastes as good as it looks. As far as I’m concerned, a visit to Sunrise Mart is somewhere between seeing the bats and eating breakfast tacos when it comes to Must Dos in Austin.Go there: Sunrise Bottle ShopExplore Bon AppétitHighly RecommendAustinWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Andrew Knowlton"]}