{"id": "17be1a539571713066fe1fba8cd13932", "url": "https://www.bonappetit.com/story/raw-broccoli-caesar-salad", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Broccoli Caesar Salad Proves That Raw Veg Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Broccoli Caesar Salad Is a Blaze of Raw Veg GloryPut down the romaine: Broccoli and Napa cabbage are the perfect base for creamy, tangy, garlicky dressing.By Emma WartzmanOctober 22, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailI consider a Caesar salad to be a pretty perfect food. In fact, it is probably one of my Top 10 Favorite Foods of All Time. I know! It’s a salad! But it’s a salad with a creamy, anchovy-packed, cheesy dressing and golden-brown bread nuggets (also known as croutons). I am not a professional, so I can tell you that when I “taste” my Caesar dressing, I do it by inserting a big ol’ spoonful of it into my mouth. Followed by a second one, just to be sure it’s right.But do you know who is a professional? Chris Morocco. That is why I jumped at the opportunity to make his Broccoli Caesar, which is every bit as delectable as the original, and an even a better match for that dinner party you’re hosting this fall weekend.Chris used both raw broccoli (more on that in a minute) and Napa cabbage as the base instead of Romaine, two heartier, sturdier greens that stand up well, long after dressing. “In fact, it’s only going to improve with age,” Chris says. So prep it ahead of time and let the flavors—spicy garlic, briny anchovy, bracing lemon zest—really soak in.Peel. Those. Stems.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen Kaminski“There’s something pleasant about keeping a salad raw, even when it’s a root vegetable like carrots, or the cruciferous greens in this recipe,” Chris says. “It’s a good counterpoint to the richer and more decadent food you’re generally eating in the fall.” The key, though, is to make sure the texture is, indeed, pleasant—not the squeaky kind of raw that is difficult to chew.You do this by making sure the broccoli florets are not so small that they would turn to fluff and disappear into the dressing, but not so big that they’d be confused for crudit´és. When it came to the stems, I made sure to peel them before slicing, just like the recipe instructs. No cheating here. Those stems have a bad rap, but once the firmer outside is gone, I find them to be the most tender and flavorful part of the whole veg.Full disclosure: I did not make this recipe for a dinner party, though I plan to soon. I made it for myself. And though it doesn’t call for it, I also added golden-brown bread nuggets in there, because it was dinner, and I was hungry. Like I said, I’m not a professional, but I don’t think Chris would complain.Get the recipe:Broccoli CaesarYou've never met a better, brighter riff on the classic Caesar than this raw broccoli twist.View RecipeExplore Bon AppétitBroccoliSaladFallWeeknightRead MorecookingHow to Make a Thanksgiving Salad That Everyone Will Actually EatBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-22", "author": ["Condé Nast", "Emma Wartzman"]}