{"id": "17c81f584cfe3f9d205163b90603d256", "url": "https://www.bonappetit.com/recipe/salt-and-pepper-fish", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Salt and Pepper Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalt and Pepper FishBy Andy BaraghaniFebruary 10, 20204.5(67)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintTraditionally, the fish for this classic Chinese dish is battered and deep-fried. In our version, the fish is pan-seared in hot oil, but still gets plenty of texture and flavor from ginger, caramelized scallions, and lots of freshly ground black pepper. When you’re cooking the fish, be sure to let it get golden brown on the first side before turning. Once turned, the fish won’t take much longer to cook through. Serve with steamed rice, or this gussied up version. It's amazing what a little bit of butter, a dash of vinegar, and some salt and sugar can do.Ingredients4 servings1cup short-grain sushi rice8scallions, dark green parts and white parts separated1Tbsp. finely grated peeled ginger (from about one 1” piece)3Tbsp. neutral oil, divided1½lb. skinless, boneless cod, cut into 2” pieces1Tbsp. unseasoned rice vinegar1tsp. sugarKosher salt, freshly ground pepper2Tbsp. unsalted butter, cut into piecesPreparationStep 1Rinse rice in several changes of cold water in a medium bowl until water runs clear. Drain well, then transfer to a small saucepan. Pour in 1¼ cups cold water and bring to a boil over medium-high heat. Give rice a stir so grains don’t stick to the bottom. Cover pot and reduce heat to lowest setting. Cook, undisturbed, until water is evaporated and rice is tender, 18–20 minutes. Remove from heat and let sit, still covered, 10 minutes.Step 2Meanwhile, thinly slice dark green scallion parts into rounds. Thinly slice white parts on a steep diagonal. Keep separated.Step 3Mix ginger and 2 Tbsp. oil in a medium bowl. Add cod; season with salt and plenty of pepper (about 2 tsp.). Toss to coat.Step 4Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Add cod and cook, undisturbed, until golden underneath, about 2 minutes. Turn fish pieces, then scatter white scallion parts over. Cook, shaking the pan a bit, until fish is cooked through and some scallions are caramelized and some are just slightly softened, about 2 minutes more. Remove from heat.Step 5Stir vinegar and sugar in a small bowl until sugar dissolves. Stir into rice. Add butter and sliced scallion greens; gently stir until butter melts. Season with salt.Step 6Transfer rice to a platter and top with fish; pour any pan juices over.How would you rate Salt and Pepper Fish?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis is one of my favorite recipes for a quick delish dinner.  I prefer halibut, but cod is fine.  I can't believe people have called this bland!  Nothing wrong with their suggestions, but I think probably they did not add sufficient black pepper.  The more the better.  More ginger works too.  I cut smaller pieces of fish than shown in this photo.KatieSouthfield, MI10/29/2021I made this recipe, and it was great! So easy, too. I also added lots of freshly ground pepper. This is a “Keeper”! However, I didn’t have any sushi or short-grain rice, so I cooked my usual; Jasmine rice. Grandma taught me how to cook rice when I was a kid, so no problems there, and Jasmine is my fave, anyway, so all was right with the world! 😝YvonneTustin, CA4/9/2021quick and simple!\nThe rice is easy to make instant pot, 12mi on low pressure w slow release then stir the seasoning\n\nFish is quick to put together. Dont skip on the fresh pepper! I used a LOT, 2tbs as  suggested in the directions. when mixed with the ginger, salt and olive oil, it almost turned into a paste and the final result was flavorful with just a few min on the stove. Cécile1/28/2021I was satisfied at how satisfying and flavorful this was! I used brown rice, which still tastes great with the butter and sushi vinegar, and sprinkled a bit of furikake on top just for fun...yum! And it comes together quickly.MeganMinneapolis1/26/2021The recipe seemed a bit bland so I sautéed the scallions in butter and added them to the rice and sautéed more and left them in the pan to cook the fish in. I also marinated the fish in a blend to honey, red pepper flakes, garlic, ginger & olive iol. Heavily peppered the marinated fish and sautéed it  with the scallions in the pan. I  squeezed a lime on the fish while cooking. It was amazing! The honey gave it a bit of oomph along with the ginger , garlic & lime juice. So much flavor!AnonymousWisconsin1/12/2021As is, it's kind of boring. It needs some help from other flavors as suggested by others. A great template, though. Anonymous11/14/2020So I made this with A LOT of fresh ground black pepper. A LOT. And I really recommend it. DELICIOUS.AnonymousLos Angeles10/12/2020I have made this once with halibut and once with white king salmon. (We live in the Pacific Northwest, so have all kinds of great, fresh, WILD fish.) I doubled the ginger, added all the scallions into the pan to sauté at the end —I just don't like to fuss— and added a bit more butter and a squeeze of lime to extend the sauce. Didn't use the sugar at all. Served it both times with rice grits, but I'm sure any kind of rice would be lovely. Love this recipe. \nLela HiltonChimacum, Washington9/23/2020I made this recipe but followed one of the suggestions below and added a little bit of soy sauce, red pepper flakes, and rice vinegar to the marinade for the fish and it was delicious. Next time I think I’ll add a splash of line at the end. Very easy and quick to make. I’ll definitely be making this again.AnonymousMiami, FL9/10/2020I think is this the shell of a really great/customizable recipe, but I don’t think I would ever strictly follow it as is because of how bland it seems. I added a lot more ginger, a clove of crushed garlic, soy sauce, and red pepper flakes into the marinade. Probably doubled the amount of scallions. Topped with everything but the bagel seasoning, diced red Chile pepper I had lying around, and a squeeze of lime. Made the rice as instructed. It all came together so quick and tasted SO good, but definitely a recipe that needs some adjusting based on personal taste.AnonymousFL9/1/2020Very good! Not enough rice for 4, and you could halve the butter. But super tasty and will go in regular rotation!AnonymousAustralia 8/30/2020I love cod because it reminds me of my childhood in the Caribbean where we traditionally make salted cod especially around Easter, but it is a very bland tasting fish.  Don't be afraid of adding flavor to it (hot peppers, coconut milk, lime, hot pepper flakes, etc.) I find that in this recipe, the cod is getting a lot of help from the sweet rice, but everything tastes better when you add rice.  I would prefer the star of the recipe to be the cod.valeriahayMiami, Fl8/27/2020I love cod because it reminds me of my childhood in the Caribbean where we traditionally make salted cod especially around Easter, but it is a very bland tasting fish.  Don't be afraid of adding flavor to it (hot peppers, coconut milk, lime, hot pepper flakes, etc.) I find that in this recipe, the cod is getting a lot of help from the sweet rice, but everything tastes better when you add rice.  I would prefer the star of the recipe to be the cod.AnonymousMiami, Fl8/27/2020So easy, so simple, so tasty! My partner and I both thoroughly enjoyed the delicious fresh ginger flavor of the cod with the “gussied up” rice. Such a yummy balance. Brooklyn 8/22/2020This was easy and delicious!  Made with Blistered Green Beans with Garlic and Miso (BA July 2016).  Great Weeknight meal!  AnonymousKansas City, MO8/21/2020Explore Bon AppétitCodFishSeafoodRiceRice & GrainsScallionOnionVegetableGingerHerbs & SpicesEasyQuickWeeknight MealsMainGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-10", "author": ["Condé Nast", "Andy Baraghani"]}