{"id": "17dba576fe0fb2ccc4da4ed062ca0297", "url": "https://www.bonappetit.com/story/why-i-hate-meal-prep", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "I Hate Meal Prep, and Here's How I Feed Myself Without It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy I Hate Meal Prep and How I Feed Myself Without ItThis is the anti-meal prep meal plan.By  Lizz SchumerMay 2, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhen it comes to food, I’m basically a hobbit, always thinking about the next meal. I start looking forward to lunch before breakfast is over, and I plan my dinner over elevenses. What I don’t love is pulling the same, sad lunches out of the fridge, day after day. Sure, on Monday, those pre-made meals make my little Type-A heart feel like I’m ready to conquer the world. But by Friday, they’re the definition of al desko drudgery. If you’d rather craft exciting meals on the daily than eat batches of the same thing all week, here’s your anti-meal prep plan. No recipes required.Up your grocery shopping gameJust because you’re not prepping a batch of boxes each Sunday doesn’t mean you don’t have to do a little advance work. Each week, stock your fridge with a selection of groceries that can work in an array of delicious combinations. For starters, grab a couple of your favorite grains, meat or non-meat protein, and vegetables that can live in your fridge for a week or so. Build up your selection of sauces and dressings, too. Bottled is fine, but a few versatile homemade options will keep things fresh.Grains are meal prep all-starsEvery other cafe and juice bar serves a grain bowl these days, and there’s a reason for that. Hearty, versatile grains like quinoa, freekeh, or brown rice make an awesome base for a whole slew of lunches that will stave off the 3 p.m. vending machine sprint. They also work great cold or hot. I like to keep a few cups of grains going in my fridge at all times, just waiting to become a bowl, salad base, or protein side. Tossing them in the Instant Pot means I can whip up a batch while I get ready in the morning, no prepping required.Put an egg on itI’ve met very few foods that don’t benefit from the addition of an egg. Burgers? Hit me. Savory oatmeal? Perfection. Salad? All day, every day. With a dozen eggs in the fridge, you can toss together a quick egg salad (or hand salad, if you prefer), top your grain bowl with a creamy hard or soft-boiled egg, or craft a Caesar salad that will turn your desk into the kind of old-school Italian joint where dinner comes with a crouton-studded show.Beans really are the magical fruitKeeping a batch of cooked beans on hand means you can create a hearty, vegetarian-optional meal at a moment’s notice. Roasted chickpeas can round out all manner of salads and grain bowls, while black beans or kidney beans turn everyday into taco Tuesday. Pick up a few cans of your favorite to stock your pantry, or toss a batch of the dried kind in the pressure cooker to keep in the fridge.Prepared protein keeps things simpleWhen it comes to protein, choose your own adventure. Keep a rotisserie chicken in the fridge or roast one yourself, and pull off a portion whenever you need it. Marinate some firm tofu or make a big batch of pulled pork. This is where leftovers are your friend. Last night’s roast chicken tastes great as tomorrow’s tacos, chicken salad, or soba salad. Yesterday’s pork shoulder just begs to live again as a cubano. If steak survives more than one meal in your house, that sucker’s a solid salad. If you don’t have ideas, try this guide.Whatever you do, keep it simpleThe most important thing to remember about anti-meal prep is versatility. Some people find it helpful to keep a chart on the fridge with categories to help you mix and match. I prefer to freestyle it. If you’re used to working with recipes religiously, it may take you a few weeks to get into the groove, but once you do, there’s no going back. Check out our Feel Good Food Plan master lunch prep formula to get started.Stock your pantry, get cooking, and you too can break free of the meal-prep tyranny.Explore Bon AppétitHealthyishMeal PrepLunch al DeskoLunchRead Morecooking5 Meal Prep Strategies From a Guy Who Does It For a LivingBy Micah FredmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Lizz Schumer"]}