{"id": "17e37e3884dd3a5987c49c9bc7daf264", "url": "https://www.bonappetit.com/story/kismet-rotisserie-chicken", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Kismet Rotisserie's Chicken Tray Comes With The. Best. Sides. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Is the Rotisserie Chicken of My Dreams and I’ll Eat It 5 Times a Week if I Want ToAt Kismet Rotisserie in Los Angeles, chefs Sara Kramer and Sarah Hymanson put a Mediterranean spin on their burnished bird.By Molly BazAugust 5, 2020FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.My life revolves around rotisserie chicken. On a good week I’ll eat it at least three times; on a bad week, one. Which is why I knew I had to check out Kismet Rotisserie the last time I was in Los Angeles. It’s run by two very talented chefs, Sara Kramer and Sarah Hymanson—the duo behind Kismet, an all-day California-meets-the-Mediterranean restaurant right down the street. Knowing their commitment to perfection, I had high expectations for their burnished bird. But I didn’t expect to be so blown away by each little side dish that came with it. Garlicky toum! Farmers market pickles! Schmaltzy potatoes! It was all so good, I could see working the spot into a five-times-a-week schedule—if I didn’t live so far away. And I’m not the only one.According to Kramer, business has flourished since she and Hymanson adjusted their restaurant to be reliant on takeout and delivery when COVID-19 hit. (Through donations they have also been feeding frontline workers, in partnership with Frontline Foods, and a local women’s shelter.) “We’re grateful to feed our community right now,” Kramer told me over the phone.Here’s what goes into the half chicken tray keeping Kismet Rotisserie (and hungry Los Angelenos) going.The ChickenAfter testing 20 chicken breeds and 15 dry rubs, the chefs found their dream duo. They went with a small free-range bird, great for absorbing the secret spice mix (we hear there is turmeric and Aleppo-style pepper). After brining the chickens overnight, they  slide them into a Dorégrill La Rotisserie, the French machine used at every poulet rôti joint in Paris. The end result: golden brown skin every time.The PicklesThe farmers market dictates the house-made pickles (beets! radishes!). But for the pickled cucumbers and spicy peppers, the chefs go with store-bought Middle Eastern versions. “They’re perfect just the way they are,” Kramer says.  The WedgeAs much as this salad is defined by the crisp iceberg, Kismet’s is all about the miso-poppy seed dressing. It’s a nod to the ’90s health food the Sara(h)s both grew up on and balances out all the rich flavors with its tang.The Chile OilFor their version of a Chinese chile crisp, the chefs take the usual dried chiles, fried garlic, and oil and throw in some of their fave Moroccan spices, like cinnamon.The HummusThe secret to this satiny hummus? Soaking, braising, then peeling (!) high-quality dried chickpeas before whirring them in a turbocharged food processor. The ToumThis punchy Lebanese sauce is typically made with just raw garlic and oil, but Hymanson and Kramer add blanched garlic to give it silky body.Explore Bon AppétitRestaurantsNeighborhood Restaurantsroast chickenDish DecodedRead MorerestaurantsHow Do I Love Thee, Chinese Sponge Cake? Let Me Count the LayersBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-05", "author": ["Condé Nast", "Molly Baz"]}