{"id": "181993f4489cd5abf2800e4f235f1038", "url": "https://www.bonappetit.com/recipe/peanut-drinking-snack", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Peanut Drinking Snack Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssuePeanut Drinking SnackBy Rumaan AlamApril 17, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintThis spicy, sour, salty, crunchy mix isn’t your typical roasted bar nuts recipe. Fresh lime juice, red onion, chiles, and cilantro give it amazing flavor. It’s best served with spoons for scooping into your palm.Ingredients4 servings½small red onion, finely chopped2serrano chiles, seeds removed, finely choppedZest and juice of ½ limeKosher salt1¼cups salted, dry-roasted skin-on Spanish peanuts½cup finely chopped cilantro¼tsp. chili powderPreparationStep 1Combine onion, chiles, lime zest and lime juice, and a large pinch of salt in a medium bowl. Let sit a minute or so to allow flavors to come together and for onion to mellow.Step 2Add peanuts, cilantro, and chili powder to onion mixture and give it all a good toss. Taste and season with more salt as needed.Step 3Serve peanut mixture in a small bowl with spoons.How would you rate Peanut Drinking Snack?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is hands down my favorite snack to have with drinks, which I first ate in India. Thanks to bon appetit for printing the recipe here. It is delicious and pretty much the best way to eat peanuts!KatjaNew York1/22/2021This was exactly what I was looking for.\nSimple, absolutely delicious, uses ingredients that probably on the shelf and as a nice little bonus, healthy!random_GuyIndia8/11/2020Explore Bon AppétitSouth AsianAsianPeanutNutChileVegetableSerrano ChileQuickEasySnackDairy-FreeGluten-FreeVeganVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Rumaan Alam"]}