{"id": "1829d356b73c13148ca7824624fe0359", "url": "https://www.bonappetit.com/story/lauren-halsey-summaeverythang", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "How Artist Lauren Halsey' Summaeverythang Is Feeding South Central LA | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Artist Lauren Halsey Is Feeding South Central L.A.Halsey started a community center and distribution hub during the pandemic, but she's not slowing down now.By Dylan RupertJune 1, 2021FacebookTwitterEmailPhotograph by Allen Chen / SLH STUDIOFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Lauren Halsey, founder of Summaeverythang, an organization that provides free, local, organic produce to people in South Central Los Angeles.At the beginning of 2020, artist Lauren Halsey had just started building what she thought was her dream project: an Afrofuturist community center that would host workshops, events, artist talks, and after-school programs for residents in South Central Los Angeles. But when the pandemic hit, Halsey threw herself into a new dream: a massive, weekly distribution of local and organic produce boxes, free to that same community. Since May 2020 Summaeverythang has been distributing over 600 boxes a week. Halsey is funding the $80,000-a-month operation through her own art sales and outside donations. In the last few months, she teamed up with a cabal of Crenshaw-based chefs—Hugh Augustine, Shanita Castle, Stuart Eubanks, and Supreme Dow—as well as Timothy Hollingsworth for a hot meal program. For someone whose creative work is inextricable from her roots in South Central, this project is a mutual aid effort, community gathering, and an art practice rolled into one.When the pandemic hit… I realized that resources would never trickle down. Because resources hadn't trickled down before COVID-19. There was already a hunger crisis. It just feels like what we've already been living and knowing. But the pandemic, more so than anything that I've experienced in my life, got me in the streets in the way that I've wanted to be, to show up for my practice. I think it's my best work yet because of that.My biggest challenge was… refrigeration. Once we got the hang of how to operate and drive the refrigerator truck, we were able to figure out the hack of getting this very beautiful, super-nutrient-dense produce from farm to truck to South Central. I also realized you can just go to a farmer's market and say, “Hey, do you have a list of your produce items?” and you can buy in bulk! I guess that's common sense for folks in that world, but it wasn't for me.I’ve made it work by… tapping into my community. I used the network and friendships that I've made through art, then recycled that information back into making the food program work. Vinny Dotolo [of Jon & Vinny’s and other restaurants in LA] is a huge supporter of my art practice. He hooked me up with Samantha Rogers, the buyer for all of the produce at his restaurants. She's incredible, and she linked me with these amazing farms. It was just wild going out to eat at, like AOC, for example, and seeing like the Coleman lettuce salad. And I'm like, oh yeah, we get Coleman Family Farms lettuce. We buy them out!My long-term goal is… whenever we stop doing 600 boxes a week, whether that happens a year from now or two or three years from now, is to figure out a way to get these people the same produce at the grocery stores, which then also helps the farmers. I want to approach all the grocery stores and the managers of these supply chains, and hold them accountable for where they're sourcing their produce, which is most often outside of California. I want to get them to switch to local farms.The most important thing I’ve learned is that… we don’t have to wait for someone to show up in a cape or a suit or whatever and do community work for us. We are the community. We can propose our own solutions. And though it might be a bumpy ride the first two or three weeks, or a month, or whatever—we're enough to figure it out and we always have been, always will be. So why wait? It'll work or it won't...but most likely it will.Explore Bon AppétitHealthyishPerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-01", "author": ["Condé Nast", "Dylan Rupert"]}