{"id": "1830c2c208b5a9b820f4cbfdf5b25260", "url": "https://www.bonappetit.com/story/how-to-infuse-oil", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "How to Infuse Olive Oil, a Fancy-Sounding Trick You Can Do Practically Any Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking\"Infusing Oil\" is a Fancy-Sounding Trick You Can Do Practically Any TimePack in the flavor without making a whole sauce.By Sarah JampelSeptember 5, 2019FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY YEKATERINA BOYTSOVAFacebookTwitterEmailYou might think of “infused oil” as something that belongs on a high-falutin restaurant menu next to the béarnaise sauce and sous vide pork belly.But infusing oil is much simpler than it sounds, requiring neither lab coats nor molecular gastronomy. Essentially, you’re heating oil with aromatics—spices, herbs, chile flakes, citrus, alliums—so that both the oil and the aromatics benefit. The heat from the oil brings out the flavors of the ingredients (maybe you’ve seen this step referred to as “blooming” or “tempering”) and makes them crackle and crisp. In turn, those ingredients imbue the oil with their flavor. You scratch my back, I’ll scratch yours.Strain out the crispy bits from the hot oil so that they stay crunchy.\nPHOTO BY CHELSIE CRAIG, FOOD STYLING BY YEKATERINA BOYTSOVAWhat you get is a powerful oil with lots of crunchy bits, perfect for drizzling on ricotta or hummus, toast or fried eggs, seared tofu or slow-roasted fish, steamed sweet potatoes or fried rice.Using hot oil to relay the flavor of spices to the oil itself is a technique practiced across cuisines: In her book Indian-ish Priya Krishna calls chhonk (a.k.a. tadka), where spices are sizzled in oil, then poured over dal or sabzi, “the greatest Indian cooking technique ever.” And you’ll find versions of chili oil, which can be as simple as heating chile flakes in oil, or loaded with ginger, garlic, cinnamon and star anise, at Sichuanese restaurants and ramen shops.I’ve long wondered how Andy Baraghani makes his recipes so much more delicious than seems fair. Turns out, infused oil is the answer. The first step in his Garlickiest Fried Rice is to fry sliced garlic in oil, then remove those golden slivers and use that infused oil to cook the rice. For his Risi e Bisi, he makes a scallion oil, then garnishes the finished product with the crisped-up scallions slices and a drizzle of the onion-y oil. And his Steak Short Ribs are served with a quickie garlic-chile oil. Andy is teaching by example and yes, we get the idea!Dive in!\nPHOTO BY CHELSIE CRAIG, FOOD STYLING BY YEKATERINA BOYTSOVASo for this Lentil Salad, we took his cue: You’ll heat olive oil with garlic, scallions, and lemon zest before adding almonds, which fry in the heat, and, at the last moment, red pepper flakes and cumin seeds (since spices are sensitive and prone to burn, they go in last). Strain the oil so that the aromatics stay crisp—they’ll add delightful texture to the salad—then use that oil as the base of a vinaigrette. The flavor of the cooked-out alliums and lemon peel is simultaneously less harsh and more complex than if you had you added them raw. Plus, the oil gets evenly distributed over the lentils, making sure all bites are good bites.Grab a skillet, your favorite spice, and your favorite allium. Infuse some oil the next time you’re making a salad dressing or just looking to amp up roasted cauliflower. Sometimes I’ll infuse oil, pull out the aromatics, then use that oil to sauté chickpeas. And just like that, no one can tell that dinner came from a can.Get the recipe:Just-Keeps-Getting-Better Lentil SaladHere’s the answer to your question: “What can I make on Sunday night that will taste great for my 10:30 a.m. desk lunch on Wednesday?”View RecipeExplore Bon AppétitOlive OilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-05", "author": ["Condé Nast", "Sarah Jampel"]}