{"id": "18625a83163610cecafe8b33645a505f", "url": "https://www.bonappetit.com/story/mira-mariah", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Mira Mariah, Ariana Grande's Brooklyn Tattoo Artist, Is Winning at Work and Basically Everything Else | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAriana Grande's Brooklyn Tattoo Artist Is Winning at Work and Basically Everything ElseHow Mira Mariah tattoos six days a week while being a mom and managing chronic painBy Ali FrancisNovember 4, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn our series Office Crush, we're asking people with the coolest jobs to take us to work. Up next, Mira Mariah, the artist covering Brooklyn and Ariana Grande in squiggly feminine tattoos, lets us shadow her for a day of sketching and deli lunches.“I’m like a diamond,” Mira Mariah says, chuckling to herself. “There are different sides of me and I reject being pigeonholed into any one idea.” Mariah, 27, is a mother, “a person living with a disability,” an illustrator, and sometimes a fashion and jewelry designer. But you probably know her as @GirlKnewYork, Ariana Grande’s go-to tattoo artist.Today in the U.S. women make up the majority of people with tattoos, yet the artform remains largely dominated by men—which is precisely why Mariah got into tattooing in the first place. She wanted “cool tattoos” that better represented an expressive, modern generation of women and “couldn't think of anyone to do them.” So, after leaving her job as an assistant fashion designer in 2014, Mariah started a tattoo apprenticeship she found via a Craigslist ad. She began using Instagram as a tool to market her designs, and while her posts were initially met with “cricket sounds,” interest spread online once she started tattooing her fashion-influencer friends.Mariah is now so sought out for her uniquely feminine illustrations—a squiggly sun on a bicep, a cheetah-print butterfly on a forearm, a delicate frond on a rib cage—that she only accepts 50 clients from the 700–800 applications she receives per month. Curious, I ask her what she still enjoys about the, erm, intimate process of tattooing the skin of another. “Beyond the dominatrix thing?” she asks with a wink, alluding to the fact that tattooing is technically hurting people for money. “It’s a physically satisfying process that still feels like fashion.”Mariah works six days a week while looking after her daughter Margo and managing the chronic pain caused by her disability, a leg she had amputated at 17 because of health complications. “I am not the only person living with a disability, which is why I like talking about it,” she says. She's clear that her goal for this interview is not to make \"any of this look easy,\" and that her lifestyle wouldn't be possible without a lot of help. “I have two studio assistants, I live with my younger sister, and my family pitches in when they can—we all do it together,” she says. Here’s how Mariah goes through her day, from making breakfast for her family to working on “inclusive” brand collaborations in her Bushwick studio to tattooing at Fleur Noire in Williamsburg.Mariah with her sister, Isa, (left) and assistant, Brooklyn (right).\nPhoto by Emma FishmanPancakes and PomeraniansWhen I get up in the morning, the first thing I do is wash my face with this Soy Face Cleanser from Fresh; it feels so good on my skin. For me, it’s so important that all of this skincare and beauty routine stuff is not just about the end result, but that it’s a really physical pleasure too. After that I’ll drink a ton of water, then take our Pomeranians—Mojo Jojo and Suleiman—for a walk. I am a firm believer in putting your face in the sun every day. It's so energizing.Getting my daughter into her school uniform in the morning is definitely a challenge, but I’ve found that you can convince her to do anything if she gets to wear this unicorn headband or cat ears. Being a mom is a lot of work and a lot of wondering if you are doing the right thing, but I love it. She is so lovely, she inspires me, and it’s really special getting to see someone come to life.Breakfast is the main meal of the day that we have together as a family, because I work nights a lot, so I’ll always take the time to cook something. I like making pancakes, eggs, some sort of croissant sandwich situation, or cinnamon rolls—which we eat while listening to Maria Callas.Mariah sketching in her Bushwick studio.\nPhoto by Emma Fishman\"Good coffee only comes from bars\"After I walk my daughter to school, I’ll head to my art studio in Bushwick. I love being there—my illustrations are on the walls, and we have neon signs and plants. It just looks and feels like me. I am of the opinion that good coffee only comes from bars. It’s just who I am. So when we need to grab coffee near the studio, it’s usually from this place called Cobra Club.These days it's getting harder and harder to define what I do. I am a tattoo artist, an illustrator, a professional internet girl, and sometimes a fashion designer. All of the projects outside of tattooing happen here, at my studio. In the last year or so, I've worked on a capsule collection of jewelry with Amarilo, social media illustrations for Nurx (which is a birth control company), and I make my own sweatshirts. I try to work with brands that feel like me—a bit cheeky, ironic, fun, and very inclusive.Haribo gummies are a key afternoon snack.\nPhoto by Emma FishmanTattoos and deli chicken saladAround noon I’ll head over to Fleur Noire, where I tattoo, in Williamsburg. It’s hard to explain my process without sounding like a pretentious asshole, but you have to fill out an application to work with me. I review it, and either accept or deny it based on your concept, your placement, and if you seem like a nice person.Most days I tattoo somewhere between three and five clients. But I love to sneak out and meet up with friends if I can. I really love Maison Premiere for a fancy meal, or Butler for coffee. But honestly, I mostly have deli chicken salad and San Pellegrino for lunch. Or sometimes I’ll buy a thing of hummus and a box of crackers, eat ten of them, and then put it away. Am I the only one who thinks that’s an amazing lunch?Obviously, Mariah's studio has the decor on lock.\nPhoto by Emma FishmanPain management and redefining \"wellness\"I deal with a lot of chronic pain issues related to my leg, and working a lot can make that worse. I try to listen to my body as much as possible, and remind myself that it's really important that I stay healthy to make good work. So if I need to move appointments, I do it. No matter what.Physically, I have to ice my leg all the time and I take tons of baths. I have a bunch of vibrators, because all these companies keep sending them to me. I don't really enjoy vibrator masturbation at all, to be perfectly frank, but it’s really relieving on my nerves to massage my back and leg with them. Topical CBD is really good for muscle relief, and I am pretty consistently taking Not Pot gummies.I try to eat vegetables, because I love vegetables, and I love working out. I like activities that are actually fun, like yoga, dance classes, and cycling. But I can’t help feeling like wellness is other people's pressure on you to be skinny. This is all complicated for me because I am not a thin woman, and because I think a lot of people are shocked by that. I am skinny fat, so my whole body just feels like a cloud. I'm not insulted by this and I talk about it very plainly in front of my daughter. It's not a bad thing; it's just a thing. My goal is that Margo doesn’t grow up ignoring her beauty, but that she acknowledges it, while also knowing that everyone else is also beautiful for who they are.A quick EOD snack session.\nPhoto by Emma FishmanWorking late or “mom dates”I usually don’t leave the studio until around 9 p.m., but if I can't see my daughter for a few evenings straight, I'll take a break in the evening so we can “go on a mom date.” Her favorite restaurants are by CHLOE and this burger place, Blue Collar, on Havemeyer Avenue. When she was little, it was really important to me that she not have rigidity around eating. I love that she’s the kind of girl who adds more butter to her croissant, or will say to me, “Let’s get dumplings!” She’s a really cool eater.If I’m not with Margo, I might meet my boyfriend for a late dinner, which we know is “bad,” or I’ll  draw for a bit while he makes music. When I finish work late, I’m just not going to come home and cook a meal. I either get takeout or eat whatever nonsense is in my fridge. There are two kinds of nights that happen after that, with nothing in between: I take a bath, put my pajamas and slippers on, eat an actual meal, and crawl into my bed; or I'm out dancing until 3 a.m.Explore Bon AppétitHealthyishOffice CrushInterviewsRead MoreLifestyleHow Katie Rue Runs Reception Bar, a Korean Cocktail Oasis on the Lower East SideGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-04", "author": ["Condé Nast", "Ali Francis"]}