{"id": "18676c7213d92e71ba6de4370bc42345", "url": "https://www.bonappetit.com/story/vita-coco-pressed-coconut-water", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "No Prepackaged Coconut Water Could Satisfy Me...Until I Found This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNo Prepackaged Coconut Water Could Satisfy Me...Until I Found ThisAnd now, I will visit up to five different bodegas on a quest for Pressed.By Hilary CadiganNovember 18, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoystovaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.For the three most simultaneously interesting and relaxing years of my life, I lived in Chiang Mai, Thailand. A lot of things were great about it, but my favorite thing was the coconuts. Real coconuts, lots of them, everywhere you turned—on the trees and in the markets, and not just the big, green, not-quite-ripe boys but the sweet tiny ones with brown crackable shells, too. Inside is the most delicious-tasting substance natural to this earth, full stop. Water so pure, so creamy, with the subtlest sweetness and an almost umami-like richness. Flesh thick and tender, detaching from the shell with the slight prod of a spoon. Once I learned of these coconuts’ existence, I’d have near-daily whole-body cravings for them, which I could satisfy by walking one block from my house to the fruit cart on the corner and buying a fresh one with a hot pink straw for 10 baht, the equivalent of about 33 cents.Now that I live back in the tropical-fruit-forsaken United States, I miss coconuts more fiercely than I miss bum guns. And I tried, for years, to find a replacement. But while pre-packaged coconut waters are trendy and plentiful, none could compare. They were too sour, or too bland, or too saccharine with added sugar, or tasted too much like the vessel they came in (a box or a plastic bottle, not a coconut shell), or mixed with some bullshit ingredient like pineapple juice. When they came close to the flavor I was looking for, they’d be too prohibitively expensive for a person (me) who needs coconut water like some people need cigarettes.And then, just when I’d given up all hope, I found Vita Coco Pressed Coconut. It sat demurely beside its lesser brethren (Original and Twist of Lime, I’m looking at you) in my local bodega’s display cooler, swathed in shiny cardboard like the others. But there, on the label, beside the big green coconut featured on all the other Vita Coco labels, I saw it: an additional coconut, this one hairy and brown like the ones I remembered so fondly.My hand shot out before my brain even registered what I was doing and grabbed it. I paid the requisite $2.99, brought it home, poured it in a glass, and lo! It wasn’t clear or slightly yellow as those lesser coconut waters are. It was a beautiful milky white, with tiny particles of coconut flesh evenly distributed throughout so that they melt on your tongue with each sip. The flavor was creamy, subtle, umami-like, as it should be. It was the closest I’d ever come to an actual Thai coconut.Today, I am a Pressed fiend. I’ll hit up multiple bodegas—my record is five—in search of Pressed. People will say, “The coconut water’s right here!” and I will curse them internally. “No,” I’ll mutter, closing the glass door with a thwack. And I’ll head on down the road, to the next shop, or the next, no matter how hot or cold or late I am. Why? Because the minute I unscrew that white plastic cap, I know I’ll be transported right on back to Thailand. Only Pressed can do that.Buy it: Vita Coco Pressed Coconut, $30 for a dozen 17-ounce bottles at AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingCoconut WaterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-18", "author": ["Condé Nast", "Hilary Cadigan"]}