{"id": "186afdc39246bf348a82a951ab82185a", "url": "https://www.bonappetit.com/story/crispy-pork-cutlet", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Crispy Pork Cutlets You’ll Daydream About | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Won’t Apologize for Daydreaming About This Crispy Pork CutletThis new recipe satisfies every crunchy-salty-vinegary craving I have around dinnertime.By Jesse SparksJuly 11, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailRecently I’ve developed a horrible habit: an eyebrow-furrowing, jowl-emphasizing squint, the grotesque expression of someone struggling with one of life’s most difficult questions: “What do I want to eat?” And more often than not, the answer isn’t what’s in my fridge. I start daydreaming of the crispy-crunchy-salty something from a café around the corner, and then my need to save that budget for the weekend quickly snaps me out of it.But it’s not hard to get a restaurant-worthy dish at home that’s just as crispy-crunchy-salty. Enter senior food editor Molly Baz’s new recipe for a thinly pounded, shallow-fried pork cutlet. The pork is tender, juicy, and light, without getting bogged down in grease. Don’t get it twisted though, the crispy-crackly cutlet isn’t the only star in this meal. There‘s a whole cast of overqualified and underappreciated supporting actors: A simply dressed, lemony fennel salad, and super quick pickled cherries you never saw coming.With the hunger to fry at the top of mind, I sprinted to grab my supplies. As I stood in the butcher’s shop staring at hefty hunks of pork shoulder I remembered the caution Molly gave a few days before. “Make sure to get meat that has enough fat in it,” she said. “When it’s pounded out, the tough cut tenderizes and benefits from all of that fat. It’s a better way to get flavor and tenderness.”Cut to my steamy apartment. Before a lick of oil touched a pan, I tossed the cherries into a resealable bag and carefully pressed on them until I saw the pits plop out (another Molly tip). You could use this cherry pitter, but the plastic bag method works just as well in a pinch. After fishing out the pits, I added unseasoned rice vinegar, salt, and pepper into the bag and let it sit. This adds a slight savory tang to the cherries, but not a full-on pickle sour.In another plastic bag, I threw in the pork steaks and sealed it, then hammered away. Typically, a meat tenderizer or mallet is ideal, but if it’s been a long week any hard object will do (it was only Tuesday). I used an empty wine bottle. Right as I was starting to worry that my downstairs neighbor would get fed up with the thumping, those beautiful patches of fat started to yield and smooth out. What was once sturdy and tough became softer. The meat, now at about a  ¼” thickness, had just the right amount of give, yielding to a prodding finger but still strong enough to stay intact while frying.Then it was time to lightly coat the pork in flour, salt and pepper before a light fry. In one bowl, I mixed powdery things: salt, pepper, and flour. In a second bowl, beat eggs and mustard together. In your final bowl, panko and fennel seeds.With my spread of bowls in front of me, I turned to get the oil going, but felt the looming reminder of past frying failures: Beware the oil temperature. If the oil is too hot, the outside will burn while the inside stays woefully undercooked. If it’s too cold, you’ll get stuck with soggy pork. I knew the oil was ready after dropping in a sprinkle of panko and watching it bubble and float. If the panko sinks, the oil isn’t hot enough. If it burns, that sucker’s too hot. As I dropped my cutlets in, the rolling pops and crackles sounded like an encouraging round of applause as each cutlet glistened and turned to that warm shade of golden brown (about two minutes per side).While the now crispy cutlets cooled on a wire rack, I hopped back over to that salad. Sliced fennel (glad I gave in and got that mandoline), tossed with unseasoned rice vinegar, lemon juice, salt, and pepper. All that acid softens the fennel a bit, and then you add the literal (pickled) cherries on top.Once it was all done, I tried to channel Molly’s plating prowess by carefully arranging fennel fronds like an edible bouquet and sprinkling salt on the cutlet in a brief, soft shower. The result: The cutlet was rich and tender thanks to the smatterings of fat I’d asked the butcher not to shave off. For a bit more boost, I added a swipe of mustard to the side of my plate for prime dipping action. And with each brilliant bite, I grew more and more confident that staying in for a quick homemade feast was the right decision. Now, I have a better meal to daydream about.Get the RecipeCrispy Pork Cutlets with Fennel SaladPounding the meat both tenderizes it and allows for a very quick cook time: a win-win for weeknight dinner.View RecipeExplore Bon AppétitPork ShoulderCutletFennelFennel SeedCherryPankoRead MorecookingThe Chicken Katsu Recipe Every Kid (and Adult) Will LoveBy Adam RapoportcultureThese Jarred Sour Cherries Should Live In Your PantryBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-11", "author": ["Condé Nast", "Jesse Sparks"]}