{"id": "186f55e710264d57c6b4d12db5449efe", "url": "https://www.bonappetit.com/recipe/salmon-steaks-with-cilantro-and-garlic-yogurt-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Salmon Steaks with Garlicky Yogurt Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Salmon Steaks with Cilantro-and-Garlic Yogurt SauceBy Chris MoroccoMay 22, 20184.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis yogurt sauce will work on virtually any protein you can think of. Even tofu. Yeah, we went there. Try this glaze on: Shrimp, black bass, or snapper fillets, chicken pieces, or lamb chops.Ingredients4 servingsVegetable oil (for grill)2serrano chiles2garlic cloves1cup cilantro leaves with tender stems½cup plain whole-milk Greek yogurt1Tbsp. extra-virgin olive oil1tsp. honeyKosher salt212-oz. bone-in salmon steaksPreparationStep 1Prepare a grill for medium-high heat; oil grate. Remove and discard seeds from 1 chile. Purée both chiles, garlic, cilantro, yogurt, oil, honey, and ¼ cup water in a blender until smooth; season well with salt. Transfer half of sauce to a small bowl and set aside for serving.Step 2Season salmon steaks lightly with salt. Grill, turning once or twice, until flesh is starting to turn opaque, about 4 minutes. Continue to grill, turning often and basting with remaining sauce, until opaque all the way through, about 4 minutes longer. Serve with reserved sauce alongside.How would you rate Grilled Salmon Steaks with Cilantro-and-Garlic Yogurt Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is one of my most favourite recipes. So simple and so delicious. You can use the sauce with anything, we make it year round. When there’s too much snow to grill, we just make the fish in the oven or on the stove. Victoria B.Montreal 12/20/2021This was fresh excellent. The sauce is so fresh and we ended up drizzling the extra over everything on our plate - salad, roasted sweet potato, slaw, salmon...I subbed a jalepeno because that's what I had. Also in addition to salt, I topped the Salmon with Aleppo pepper and lemon juice, and cooked on a grill mat over sure thin sliced lemon. Will def be making this all summer. AnonymousSeattle, WA5/21/2020Explore Bon AppétitSalmonFishSeafoodCilantroHerbs & SpicesGarlicVegetableQuickEasyWeeknight MealsMainGluten-FreeNut-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}