{"id": "1885d23aabc458d48843f7b3d531a14b", "url": "https://www.bonappetit.com/story/the-best-banana-bread", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Overripe Bananas Have a Heaven, and It’s This Banana Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOverripe Bananas Have a Heaven, and It’s This Banana BreadThe search for the best of the best ends here.By Carla Lalli MusicFebruary 21, 2019FacebookTwitterEmailPhoto By Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Creating a “BA’s Best” recipe always incites a lot of soul searching in the test kitchen, and the development that led to our legendary banana bread is a textbook example of the phenomenon.To achieve BA Best status, a recipe needs to be a stellar and stunning version of an iconic dish. This isn’t an opportunity for creative riffs or twists and tweaks; we’re choosing the classics, and the final recipe should stand as a perfect, superhero version to eclipse all other versions in existence when we’re done. Often, the development process starts with asking what attributes define the dish, and once we define each critical element, we drill down even further. When we worked on BA Best Meatloaf, we agonized over the bacon on top. The Classic Caesar elicited crouton madness. It is not uncommon to ponder existential questions such as, “Does baked ziti have to be made with ziti?”Want this letter before it hits the website? Sign up for our newsletter!When it came to BA’s Best Banana Bread, we agreed on these non-negotiable qualities: It had to be made in a loaf pan. It needed to be moist with bananas. It couldn’t be too sweet to eat for breakfast. The mashed fruit needed to melt into the crumb—no sludgy chunks allowed! Nuts proved divisive, so we made them optional. You should be able to make it with ingredients you already have on hand, because when bananas go from spotted to brown, you want to be poised to swing into action.I ate a lot of banana bread while we were developing this recipe, and I couldn’t help indulging in nostalgia for the one from my youth. I grew up on my mom’s go-to recipe, the Kona Inn Banana Bread from the Fannie Farmer Baking Book. It was delicious when warm, and if it lasted into a second day, it begged to be toasted and served with a swoosh of cream cheese or softened butter.Sadly, when I made the Kona Inn recipe, it never came out the way I remembered it (I’ve now confirmed that my mother has been making incremental, proprietary adjustments to that recipe over the years, thus barring every other person of achieving similar greatness). It meant turning my back on Fannie Farmer, but everything I loved about my childhood banana bread ended up in the BA’s Best version. I’ve made this recipe dozens of times, and it always tastes the way I want. It is light but dense; moist but airy; banana-y but brown-sugary and a little tangy too. We’ve published other banana breads—there’s a chef-y one and a chocolatey one. They’re fine, they’re good, but they’re not The Best.This recipe has become the banana bread that my children will think is what all banana bread should taste like, even when they’re grown-ups trying to figure out what to do with their very own blackened bananas. Well, the joke’s on them because I’ve been making some little adjustments of my own over the years. For one thing, I don’t know why we didn’t put vanilla in our recipe, so I always add a teaspoon to the batter when the eggs go in. My mom cuts half the all-purpose flour with whole wheat flour, so I do that, too. And because I like a crunchy topper, I sprinkle an even coating of sugar in the raw over the top of the loaf before baking. This loaf lasts less than 24 hours in our household, so my other trick is to make two at a time—bananas permitting, of course. Is it The Best just the way it’s written? Of course. Do I love it more because I’ve made it my own, little by little over the years? Absolutely. We’re making memories here, people, and those are unique.Get the recipe:BA’s Best Banana BreadDark brown sugar is key and a dollop of mascarpone makes for superior tenderness. Walnuts optional but encouraged. View RecipeExplore Bon AppétitCarla NewsletterBanana BreadRead MorecookingOnly Vitamin C Can Save Us NowBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Carla Lalli Music"]}