{"id": "1887abc2f3feb42ad166496fa45c6e9b", "url": "https://www.bonappetit.com/recipe/dry-rubbed-turkey-breast", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Dry-Rubbed Turkey Breast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueDry-Rubbed Turkey BreastBy Andy BaraghaniOctober 16, 20184.2(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you're worried you won't have enough meat for next-day sandwiches or you simply don't want to bother with a giant turkey, the bone-in breast is your ticket. With no basting or babysitting, it's the path of least resistance to juicy, flavorful meat, impressive enough to earn applause but foolproof enough to supplement a whole bird. The breast goes into the oven at a relatively high temperature to take on some color, then finishes low and slow for extreme juiciness.Ingredients8 servings 1Tbsp. coriander seeds1Tbsp. fennel seeds1Tbsp. black peppercorns⅓cup Diamond Crystal or ¼ cup Morton kosher salt2tsp. light brown sugar16-lb. skin-on, bone-in turkey breast, patted dryPreparationStep 1Coarsely grind coriander seeds, fennel seeds, and peppercorns in spice mill or with mortar and pestle. (If you don’t have either, you can always chop with a chef’s knife.) Place salt and brown sugar in a medium bowl and work together with your fingers until incorporated. Stir in ground spices.Step 2Place turkey on a wire rack set inside a rimmed baking sheet. (If you don’t have this setup, place your turkey on a V-shape rack set inside a large roasting pan.) Sprinkle dry brine all over both sides of turkey breast, patting to adhere. You won’t need all of the dry brine, but it’s good to have extra since some of it will end up on the baking sheet as you season the turkey breast. Chill, uncovered, at least 12 hours and up to 2 days.Step 3Remove turkey breast from wire rack and rinse baking sheet and rack if needed (turkey will most likely release some liquid onto pan). Line baking sheet with 3 layers of foil and set rack back inside. Place turkey breast back on rack and let sit at room temperature 2–3 hours.Step 4Place an oven rack in middle of oven; preheat to 450°. Pour 1 cup water into baking sheet.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Roast turkey breast, rotating pan halfway through, until skin is mostly golden brown all over, about 30 minutes.Step 6Reduce oven temperature to 300° and continue to roast turkey breast, adding more water by ½-cupfuls as needed to maintain some liquid in baking sheet, until an instant-read thermometer inserted into the thickest part of breast registers 150° (don’t worry; the temperature will continue to climb while the turkey breast rests), 50–70 minutes longer. Skin should be deep golden brown and crisp. Transfer turkey breast to a cutting board and let rest at least 30 minutes and up to 1 hour before slicing.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHow would you rate Dry-Rubbed Turkey Breast?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleHmm. Mixed results here. I should have followed my intuition and used less salt. It really doesn't need  1/3 cup of salt. You just need enough to rub on the bird and be done with it. About a couple of tablespoons will do it.  The bird came out too salty. Naturally, the cuts of meat in the center of the bird were well seasoned while the meat closest to the skin/surface was exceedingly salty and almost inedible. Maybe wet brine would be better? I dunno. \nHowever, the cooking technique was spot on and I'll be doing it this way from now on. Roasting it on high at 450 F for 30 and then lowering the temp to 300 F was perfect. AnonymousLos Angeles County11/26/2021This turned out very well and the turkey was very moist, even though I only had a half day to brine it in the fridge.  The recipe says to let the turkey sit at room temperature for 2-3 hours.  I would think that there would be a risk of bacteria leaving it out that long, so I only left it out for about an hour.Tina DDenver, CO11/29/2020Great flavors and cooking instructions. Mine hit temperature after 50 minutes at 300F. For the dry brine, I separated the skin from the meat to shove the seasonings in between. The 1/3 cup of Diamond Crystal resulted in a very well-seasoned turkey; I'd just dial that back to a 1/4 cup next time.AnonymousDurham4/20/2020Explore Bon AppétitAmericanTurkeyPoultryMainGluten-FreeKetoRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Andy Baraghani"]}