{"id": "1889cbb01bdd695e93481d5fc8be90d2", "url": "https://www.bonappetit.com/recipe/grilled-chicken-skewers-with-toum-shish-taouk", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Grilled Chicken Skewers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueGrilled Chicken Skewers with Toum (Shish Taouk)By Kamal MouzawakApril 16, 20194.9(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintToum, an intense garlic sauce usually paired with shawarma, is used as both a marinade and a condiment in this Lebanese chicken dish. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe.Ingredients4 servingsToum6garlic cloves2large egg whites*2Tbsp. fresh lemon juice1½cups vegetable oilChicken and Assembly3Tbsp. fresh lemon juice2Tbsp. tomato paste1Tbsp. ground coriander3Tbsp. vegetable oil, plus more for grill1¼lb. skinless, boneless chicken thighs4pitas, warmedSpecial EquipmentFive 8\"–12\"-long metal skewersPreparationToumStep 1Pulse garlic, egg whites, and lemon juice in a food processor until smooth. With motor running, very gradually stream in half of the oil (this will help the emulsion stay together). Scrape down sides of processor and continue to process, gradually adding remaining oil, until mixture thickens and becomes light and airy (it should cling to a spoon). Season with salt.Step 2Do Ahead: Toum can be made 2 days ahead. Cover and chill.Chicken and AssemblyStep 3Mix lemon juice, tomato paste, coriander, ¼ cup toum, and 3 Tbsp. oil in a large bowl to combine. Transfer marinade to a large resealable plastic bag. Save remaining toum for serving.Step 4Working one at a time, slice chicken thighs in half lengthwise and season generously with salt. Add to bag with marinade, seal bag, and massage marinade into chicken. Chill at least 3 hours and up to 12 hours.Step 5Let chicken sit at room temperature 1 hour before grilling.Step 6Prepare a grill for medium heat; oil grate. Thread chicken onto skewers, folding pieces back and forth accordion-style so they pile onto themselves (it should be about 3 strips per skewer). Grill, turning occasionally, until browned and beginning to char in spots, 10–12 minutes.Step 7Serve chicken on top of pitas, with pickles and reserved toum alongside.Step 8*Note: Raw egg is not recommended for the elderly, pregnant women, children under four, and people with weakened immune systems.How would you rate Grilled Chicken Skewers with Toum (Shish Taouk)?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleThis was incredible!  I followed another reviewers recommendations on adding 1/2  Greek yogurt. I served it with a Greek tomato salad ( tomatoes, onions, peppers and cucumbers) on nan bread. Tzatziki sauce would be a nice added condiment Kfb55New Jersey 9/19/2021Sooo good. Whole family loves it. Thanks!Mama TIdaho9/7/2021This recipe is amazing—true chicken comes out perfect every time and the toum is perfectly light and garlicky! Have made multiple times since I discovered this recipe last year and will continue to make it. Goes well with pita, cucumber, and red onion marinated in lime juice! Kathryn Atlanta, GA 9/6/2021Excellent recipe for the toum and the shish tawokeAnonymousToronto Ontario Canada9/6/2021I have been trying to find a good recipe for toum for a while now - and this recipe is perfect!  Very fluffy and garlicy, I know i will want to eat it with a lot more than chicken skewers.  The chicken skewers were also delicious but I altered the marinade.  I prepared the marinade as suggested and then added a cup of plain Greek yogurt and coated the chicken and left it alone for a couple of hours.  The yogurt makes the chicken incredibly tender and it grills beautifully.P JohnsonSt. Paul, MN4/12/2021This is one of my family's favorite new dinners! The chicken is absolutely amazing and when there isn't enough time to prep the grill we simply put it in the oven on convection (~425 for 30 mins) and it is just as good!. The one thing we have found is that adding more lemon juice (I would say about 1 Tbsp if not more) really helps to bring the flavor out. AnonymousNJ11/16/2020I made the toum easily with a stick blender and I'm really stoked because I've never managed to emulsify mayonnaise and almost didn't bother! I added 6 garlic cloves like the recipe said and it's got quite a bite. I like it but it might be too much for my guests. I'm hoping it'll mellow out by dinner time (and I am a garlic lover who usually doubles up on the garlic!). Don't forget to add 1/4 cup toum to the marinade! AnonymousEdinburgh8/6/2020It's just amazing. Make it. There's nothing else to say!kirsplashSan Jose, CA8/4/2020Made this earlier and it was delish! Chicken was lemony and paired really well with the toum. I took a chance of making the garlic sauce on a blender since i dont have a food processor and it worked! I was afraid bc it was very liquidy at the start but it gets emulsified and fluffy after some time. dnnlyrnManila6/28/2020I made this recipe three times in three weeks!  My family prefers chicken breasts and they work great. We also like a little heat in our food so I’ve been adding Aleppo peppers. It’s really easy to broil as well.  It’s a dish everyone likes so I’ll be making it again and again.  skpillowDallas, TX6/22/2020I don't have a grill, so I cooked some dark meat chicken in plenty of marinade on the stovetop in a skillet. Honest truth, I can't image the grill is better. I didn't want to lose a drop of the marinade, which kinda like caramelized on the chicken and gave it some CUTE color. For so few ingredients, I was mad that it was so much better than the complicated stuff I can do.NatWatAustin, TX5/15/2020My mum’s a vegetarian and she adores garlic sauce so I swapped the raw eggs with cold water and chilled the oil it still worked. Best recipe ever.luxgngshIndia10/2/2019This is currently sitting in my fridge marinating and I am TOO excited after reading these reviews. Review to come...HealthyFatHespeler 9/30/2019This recipe is fantastic beyond words, best shish taouk I've ever had in my 23 years of life, and it's right in my kitchen. I'm boggled at how the marinade is so simple yet so delicious and flavourful. My mum's a tough critic of food but she liked it so much she asked me to make it again, and for my relatives too. 😂munirahalhabshiKuala Lumpur, Malaysia8/27/2019Absolutely in love with the toum. I might have to make the toum every week now. The chicken was good, nice and flavorful. I don't have a grill so I just seared the strips in a cast iron pan on the stove, so I didn't get the smoky taste, but it was still very good. I don't have a food processor, so I made the toum in my blender, and despite accidentally drizzling the second half of the oil in without the blender running (the blade got bumped off the rotor while I was scraping the sides down), the emulsion came together beautifully after the addition of a splash of water and some more blending. I've had it in a jar in the fridge for the last couple days and it's still perfectly incorporated and fluffy. It's VERY garlicky, like eating blended garlic, but fluffy and creamy. If you have leftover toum, it's phenomenal as the mayo in a tomato sandwich. AbbyRAL8/23/2019Explore Bon AppétitSkewerLebaneseMiddle EasternChicken ThighChickenPoultryYogurtOther IngredientsSpringMainDairy-FreeNut-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}