{"id": "1893bcb470115c0b3aeb5f9d1e7393e6", "url": "https://www.bonappetit.com/story/how-to-make-your-own-ghee", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "How to Make Your Own Ghee And 3 Ways to Use It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Your Own Ghee And 3 Ways to Use ItAnything you can do with butter, you can probably do better with ghee.By Priya KrishnaOctober 6, 2020FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailI’ve spent many afternoons sidled up next to my mom in her kitchen, watching her stir sticks of butter in a pot as they slide from foamy white to clear, golden ghee, filling the room with a butterscotch-y aroma. When I was growing up, it was a special treat when she cooked her dal with rich ghee instead of oil. If I had behaved well, she would occasionally take a warmed-up leftover roti, slick it generously with ghee and brown sugar, and roll it up for me as dessert. This remains my perfect food.Ghee is the magnificent result of distilling butter down to just the flavorful butterfat, and it has long been a fixture of a number of cuisines. It’s simple to make at home (though you can find our favorite store-bought brands below), useful to have around, and has a high smoke point and supercharged flavor that lend it well to baking, poaching, frying, and everything in between. The talented recipe developers you’ll meet below—Hetal Vasavada, Chitra Agrawal, and Farhan Momin—created South Asian-inspired recipes that highlight three ghee techniques you can apply to all kinds of dishes once you’ve learned them.We all bring different perspectives to our cooking, but our philosophy on ghee is shared: Anything you can do with butter, you can probably do better with ghee.How to Make Your OwnMelt 1 lb. unsalted European-style butter (such as Kerrygold or Plugrá) in a medium saucepan over medium high heat. (Regular butter will work just fine too, but European-style butter’s lower water content means it will yield more ghee after you cook off all the water.) Reduce heat to medium-low.Simmer butter, stirring often, until it goes from foamy and pale yellow to clear and golden and the little bits of milk solids have settled on the bottom of the pan, 7–10 minutes. From here either strain the ghee (see step 3) or, for a nuttier flavor, continue to cook ghee, stirring often, until the milk solids turn the color of toffee.Line a fine-mesh sieve set over a large jar with 3 layers of cheesecloth (you want to catch all of the milk solids so they don’t burn when you cook with the ghee later). Strain ghee into jar and cover. Store milk solids in a small airtight container. (Stir into cooked rice or add to baked goods.) Both ghee and milk solids will keep in a cool, dark place up to 3 months.Poach Your Proteins in GheeFarhan Momin, who runs the pop-up Farmo Cooks and the butcher shop Atlanta Halal Meat & Food, likes to make his own flavored ghee by toasting whole spices like coriander seeds and smoky black cardamom in butter. He uses the resulting mixture to poach shrimp, though the flavored ghee would also be great spooned over any lean protein such as chicken or fish.Ghee-Poached ShrimpIn this recipe, spiced ghee becomes a rich poaching liquid that cooks shrimp to perfection.View RecipeSizzle Your Spices in GheeStir-frying leftover rice in ghee with spices, curry leaves, and mix-ins such as cashews and fresh coconut elevates a staple into something luxurious. Chitra Agrawal, founder of Indian condiment company Brooklyn Delhi and author of Vibrant India, took flavor inspiration for this simple dish from her mother’s home state of Karnataka in South India, where thuppa means “ghee” and anna means “rice” in Kannada, the local language. “This recipe is inspired by one that has been made in my family for generations in Mysore,” Agrawal says. “If I’m having this dish for dinner, I’ll serve it paired with a dal and a little spicy, tangy achar mixed into the rice to give it that sour edge.”Thuppa AnnaChitra Agrawal took flavor inspiration for this simple dish from her mother’s home state of Karnataka in South India, where thuppa means “ghee” and anna means “rice” in Kannada, the local language.View RecipeBake With GheeFor Milk & Cardamom author Hetal Vasavada, discovering brown-butter ghee was a happy accident, the result of leaving butter on the stove to simmer for too long. Cooking the milk solids until they’re just this side of burnt yields a deep toasted flavor that stands up perfectly to the aromatic chai spices in this play on coffee cake. The streusel incorporates the caramelized milk solids left behind after you strain the brown-butter ghee, giving the cake an extra boost of flavor.Chai Cake With Brown-Butter-Ghee StreuselThis cake is the kind of baked good that you can whip together without a whole lot of planning or special equipment.View RecipeBrands We LoveIf DIY isn’t your thing, there are a number of great store-bought options.Deep: For baking, Vasavada likes Deep 100% Pure Cow Ghee because it is mild in flavor but still sweet and nutty, bringing out the best in cakes, cookies, and bars.Tin Star: Agrawal says Tin Star Foods Ghee “tastes like the stuff my grandmothers make.” It has deep, toasty undertones that suit more neutral foods like rice and toast.Amul Pure Desi: Momin calls Amul Pure Desi Ghee a good “starter ghee.” It has a pure buttery flavor that complements other ingredients in a dish rather than overpowering them.Explore Bon AppétitGheeButterSouth AsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-06", "author": ["Condé Nast", "Priya Krishna"]}