{"id": "189a98ee0219ac1203b397f2b27b2c7e", "url": "https://www.bonappetit.com/story/meet-the-logan-roy-of-sauces", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Meet the Logan Roy of Sauces | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMeet the Logan Roy of SaucesRecipe recommendations and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroOctober 24, 2019FacebookTwitterEmailPhotograph by Alex Lau, Food Styling by Rebecca JurkevichFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.It’s felt pretty quiet in the Bon Appétit office this week...we’re definitely all still recovering. My Best Weekend Ever actually started on Wednesday with an extended friend hang, slid into Thursday with a party for Alison Roman’s just-launched cookbook, rolled up into Friday with smashburgers in the Test Kitchen, stumbled into Saturday with the Hot 10 extravaganza and a night on the dance floor, and petered out on Sunday when I failed to make it to Rick Martinez’s tacos and beer thing. Sorry, Rick! I heard it was delicious.To balance out all the partying, I’ve been eating tofu. Specifically these Spicy Tofu Crumbles that Claire Saffitz developed nearly four years ago (and that everyone’s favorite vegetarian Sarah Jampel reminded me about earlier this year) but I never paid attention to until now. I’m just one of those “not-that-into-tofu” people, okay? Well, I regret the last four years of my life, because these tofu crumbles come together in ten minutes and taste, I swear, like Mexican chorizo. I’d eat them in tortillas or over brown rice with pickly things and maybe a soft-boiled egg.Squash: It's what's for dinner.\nPhoto by Emma Fishman, Food Styling by Kat BoystovaI also think you should make this brand-new squash recipe for dinner. It's Sohla El-Waylly's follow up to those zucchini fritters you all freaked about, and it features maybe the most powerful Power Sauce ever to come out of the Test Kitchen during my time: Greek yogurt, olive oil, crushed olives, olive juice, dill, and the pièce de résistance, charred red onions. This sauce is the Logan Roy of sauces. Or is it more of a Kendall? Make it, and let me know what you think: healthyish@condenast.com.Hey, look! It's an event! On November 5th, Healthyish is hosting a breakfast in NYC for women who love to travel. We’re joining up with Condé Nast Traveler’s Women Who Travel along with our faves, Future of Women, at Haenyeo, Jenny Kwak’s homestyle Korean restaurant in Brooklyn. Lale Arikoglu, CNT’s senior lifestyle editor and co-host of the Women Who Travel podcast, is going to chat with Shelma Jun of Flash Foxy and Sarah Knapp of OutdoorFest about how to make outdoor travel more accessible to all. Jenny will serve up a true Korean breakfast: homemade dumplings, steamed egg casserole, squash pancakes, cabbage miso soup, and more. This is a small event, so get your tickets now, and I'll see you there.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleWould You Go Running in Jeans?By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-24", "author": ["Condé Nast", "Amanda Shapiro"]}