{"id": "18ac1d0b939cf576cb2be3c508ec00d3", "url": "https://www.bonappetit.com/story/these-5-cocktails-will-make-you-want-to-escape-to-the-caribbean-asap", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "These 5 Cocktails Will Make You Want To Escape to the Caribbean ASAP | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThese 5 Cocktails Will Make You Want To Escape to the Caribbean ASAPBy Princess CruisesApril 20, 2018FacebookTwitterEmailFacebookTwitterEmailAre you daydreaming about warm weather and sipping a colorful, fruity cocktail on a Caribbean vacation? Us too. We’re not talking about the fluorescent, sugary-sweet kind your parents may have said cheers to back in the day; these latest versions incorporate locally-sourced spirits and exotic, tropical ingredients, unlike any libation you’ve had before. Before you head on your next island-hopping adventure (hello, Princess Cruises!) we’re sharing our favorite drinks from Antigua to Cozumel and Curaçao—so you know what to order and where to get it while in town.Curaçao—Take a Sip with Sophisticated StyleCuraçao is not just the blue colored spirit you’ve seen on cocktail menus. It’s also the name of the Dutch Caribbean island, known for its beautiful cove-tucked beaches and expansive coral reefs. While Blue Curaçao—the original recipe using the bitter peels of laraha citrus fruit—is still popular in a variety of cocktails, the non-colored orange version is a great way to bring the vibrant citrus flavor liqueur to your drinks. Try something a little different with an Orange Box Car. This sophisticated spin on a fruit-forward cocktail is made with Senior Genuine Orange Liqueur, gin, egg white, lemon juice, orange-infused simple syrup, and fresh orange. When you’re docked and looking to explore the island for a unique twist on island cocktails, don’t miss Luke’s Cocktail Bar—a small, intimate bar with a distinctive menu.Cozumel—Cheers! You Had Us at Mezcal and CucumberYes, making a trip to Cozumel could surely lead you on the tequila train but one of our favorite spirits of the moment is mezcal. In Mexico, both tequila and mezcal are in high demand for all kinds of beachy cocktails. The island off Mexico's Yucatán Peninsula is famous for its renowned snorkeling and diving. When your activities are done for the day, it’s the perfect time to relax with a drink that’s refreshing and has a slight kick. The Mezcal Con Pepino gets a smoky start from mezcal mixed with fresh lime juice, agave nectar, muddled cucumber, serrano pepper, and a sweet-tart combo of crushed chili pequin and sugar on the rim. For a spot in town that feels a little off the tourist path, pay a visit to Turquoise Beach Club for a local libation at happy hour.Antigua—There’s Nothing Better Than Your SmileSurrounded by coral reefs, the stunning island of Antigua is known for its many sandy beaches and also, for its very own rum. Though Old Fashioned Rum Punch recipes are ever present, it’s the namesake Antigua Smile we’re crushing on. This golden-hued cocktail just screams summer, and with a combo of Cavalier Antigua Rum, Creme de Banana, and a unique variety of pineapple called Antigua Black—it hits all the perfect “I’m never leaving this spot on the beach” vibes. If you’re on the island and want to try this mouthwatering drink while admiring the view, make a stop at Castaways Beach Club and say cheers to the sunset.Baby, Let’s Cruise for a Delicious Spin on Traditional CocktailsOnce you have a taste for delicious, island-inspired cocktails made with fresh fruit ingredients, we can’t blame you for wanting to make the most of every opportunity to grab one. Right onboard your next Princess Cruise through the breathtaking Caribbean islands, tap your friendly bartender to shake up one of these signatures for you to enjoy. The Ultimate Mai Tai is made with Bacardi Oakheart Rum, Amaretto, pineapple and orange juices, a splash of sweet and sour, and Grenadine. Or if a Pineapple Mojito is more your style, try their delicious signature version that’s made with Bacardi Pineapple instead of the usual white rum. Cheers!To taste your way through the islands and book your next Caribbean cruise, visit Princess.com/BonAppetitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-20", "author": ["Condé Nast", "Princess Cruises"]}