{"id": "18bf0ba66a462f84abe94f2ecc6f6877", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/grapes-and-soda", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Grapes & Soda Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverGrapes & SodaKitsilano’s blink-and-you’ll-miss-it destination for cocktails and natural wineFacebookPinterestTwitterEmailGrant HarderGO HERE: for Grapes & Soda’s quirky variety of natural wines and bartender Satoshi Yonemori’s innovative and precise cocktail list.ORDER THE: daily cocktail special by Yonemori and any British Columbian wines recommended by the knowledgeable staff. The list changes frequently, but keep an eye out for Bella, a natural sparkling wine producer in the Okanagan Valley, and Little Farm Winery in the Similkameen Valley, a single vineyard producer of Chardonnay and Riesling. They also have a small but appealing selection of Scotch. If you’re feeling peckish, snack on the smartly sourced cheese and charcuterie board or belly up for the small seasonally based dinner menu.THE VIBE IS: cramped and cozy, with bottles everywhere and industry vets at the six-seat bar or few tables, which have drawers for cell phones. It’s a subtle reminder to be present and enjoy what’s in your glass.PRACTICAL STUFF: Open Tuesday to Saturday, from 5 p.m. to 11 p.m. (with happy hour between 5 p.m. and 6:30 p.m.). Closed Sunday and Monday. No reservations.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVE33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryUpstairs at Campagnolo“Camp Upstairs” in Strathcona is the only carpeted dive bar you’ll want to spend time inThe DiamondProhibition-era glam (and meticulously made cocktails) in GastownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}