{"id": "18c4e1bbc00e12bdbbf9692917e315ac", "url": "https://www.bonappetit.com/recipe/campari-spritz", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Campari Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueCampari SpritzBy Kat BoytsovaMarch 20, 2018EmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintDry sparkling rosé and lemon soda complement the citrusy flavor of Campari and make for a beautifully vibrant cocktail.IngredientsMakes 12oz. Campari3oz. dry sparkling roséSplash of lemon soda1lemon wheelPreparationPour Campari and rosé into a rocks glass filled with ice. Top off with soda, stir gently to combine, and add lemon wheel.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Campari Spritz?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllSpritzItalianEuropeanCampariAlcohol & Other DrinksDrinksEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Kat Boytsova"]}