{"id": "18db369ad8a59b75f5397cabde6ff353", "url": "https://www.bonappetit.com/recipe/chicken-soup-with-charred-cabbage", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Chicken Soup with Charred Cabbage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueChicken Soup with Charred CabbageBy Anna StockwellOctober 16, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintSimmering a rotisserie bird in water with a handful of aromatics beats boxed chicken stock any day. Plus, the mushroom stems are basically free flavor; add a handful to any pot of simmering stock for an umami boost.Ingredients4 servings 1cooked chicken carcass (from a store-bought rotisserie or homemade roast chicken), plus 1½ cups shredded skinless roast chicken meat8oz. shiitake mushrooms, stems reserved, caps torn in half6garlic cloves, crushed1tsp. kosher salt, plus more2Tbsp. extra-virgin olive oil1medium head of green cabbage (about 1 lb.), cored, sliced into ½\"-thick ribbonsFreshly ground black pepperChili oil (for serving; optional)PreparationStep 1Bring chicken carcass, shiitake stems, garlic, 1 tsp. salt, and 8 cups water to a boil in a large pot, skimming foam from surface as needed. Cover pot and reduce heat to medium. Simmer 15 minutes. Strain broth through a fine-mesh sieve into a large bowl. Rinse out pot, then pour broth back in.Step 2Meanwhile, heat oil in a large skillet over medium-high. Cook mushroom caps, stirring occasionally, until golden brown and softened, 7–9 minutes. Transfer mushrooms to a plate; season with salt.Step 3Add cabbage to same skillet, press into an even layer, and cook, undisturbed, 2 minutes; season with salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred and tender in some spots and still crisp in others, about 2 minutes.Step 4Add mushrooms, cabbage, and shredded chicken to broth and cook over medium heat just until chicken is warmed through, about 3 minutes. Season soup with salt and pepper. Divide among bowls and drizzle with chili oil if desired.How would you rate Chicken Soup with Charred Cabbage?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSuper flavourful but yet subtle tasting. The flavours all work so well with another for a filling meal. ArianaToronto1/12/2021Explore Bon AppétitSoupSoups and StewsAmericanChickenPoultryShiitake MushroomMushroomVegetableGreen CabbageCabbageLeafy GreensEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishSimmerSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Anna Stockwell"]}