{"id": "18dd35cd4bfff0a856dfc3c9ff7901bc", "url": "https://www.bonappetit.com/recipe/cabbage-tabbouleh", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Cabbage Tabbouleh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueCabbage TabboulehBy Kamal MouzawakApril 16, 20194.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintThis salad—a take on the more traditional herb-centric tabbouleh salad made with tons of parsley, mint, bulgur, and tomatoes—is crunchy, herby, cooling, and refreshing. To add some heat between bites, serve fresh green chiles for nibbling alongside. A key to success is to have all your ingredients prepped and ready to go before assembling. You don’t want the cabbage to wilt before you're ready to eat. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe. Ingredients4 servings¼cup bulgur (not quick-cooking)¼medium head of green cabbage, cored, very thinly sliced (about 4 cups)½medium white onion, very thinly sliced2cups very finely chopped parsley1cup mint leaves, torn if large1tsp. ground allspice⅓cup extra-virgin olive oil⅓cup fresh lemon juiceKosher saltFresh green chiles (optional)PreparationStep 1Place bulgur in a small bowl; pour in boiling water to cover by 2\". Let soak until tender, about 50 minutes; drain.Step 2Toss cabbage, onion, parsley, mint, allspice, and half of the bulgur in a large bowl. Drizzle olive oil and lemon juice over tabbouleh and season with salt; toss again to combine.Step 3Transfer tabbouleh to a platter and sprinkle with remaining bulgur. Serve with chiles alongside if desired.How would you rate Cabbage Tabbouleh?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThanks! My vegy-avert children do love this salad. In my case, I replace bulgur with red quinoa.  AnonymousChicago IL11/21/2019Explore Bon AppétitSaladLebaneseMiddle EasternBulgurRice & GrainsGreen CabbageCabbageLeafy GreensVegetableQuickEasyWeeknight MealsSideDairy-FreeNut-FreeVeganVegetarianHealthyishHanukkahLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}