{"id": "18de5ce278338b879f4c807095dd638b", "url": "https://www.bonappetit.com/recipe/vegan-butternut-squash-soup", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Vegan Butternut Squash Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Butternut Squash SoupBy Christina ChaeyNovember 18, 20184.6(105)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis is just what the doctor ordered when you've been going too hard on the meats and cheeses. This comforting, ginger-laced soup just so happens to be vegan, and is exactly what we want when we feel like we've been overindulging a bit. If you've always thought you needed to own a $500 blender or have hours to spare to make a luxuriously silky puréed vegetable soup, well, you don't! We made a super smooth soup using a $40 Black & Decker blender. Just make sure the butternut squash is completely tender before it goes in the blender.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonDutch Oven$80 At AmazonBlender$32 At AmazonLadle$8 At AmazonDish Towel$6.15 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAMedium Bowl$17 At AmazonSpoon$24.69 At AmazonVegetable Peeler$10 At AmazonWooden Spoon$6 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketForkLarge Bowl$18 At AmazonIngredients4–6 servings1large onion3garlic cloves12\" piece gingerA small handful of cilantro, with stems1large butternut squash (3½–4 lb.)113.5-oz. can unsweetened coconut milk, divided2Tbsp. extra-virgin olive oil¼tsp. crushed red pepper flakes3tsp. kosher salt, plus more½cup unsweetened coconut flakes2limesPreparationStep 1Preheat oven to 300°. Trim the ends off of 1 onion. Cut in half through root end, peel and discard skin, then coarsely chop. (No need to sweat the knife work here—it's all going to get blended anyway.) Transfer chopped onion to a medium bowl.Step 2Using the flat side of chef’s knife, smash 3 garlic cloves. Peel and discard skins, then coarsely chop. Transfer to the bowl with the chopped onion.Step 3Using a spoon, peel 2\" piece ginger. (We always like to use a spoon to peel ginger, which is way better for navigating all of those nooks and crannies than a vegetable peeler.) Thinly slice and add to bowl with onion and garlic.Step 4Trim a handful of cilantro leaves with tender stems; set aside for serving. Coarsely chop remaining stems and transfer about ¼ cup chopped stems to bowl with onion. Clear your cutting board.Step 5It’s time to break down your squash! (We promise it’s not as scary as it sounds.) Trim off both ends of 1 butternut squash, then cut through where the neck meets the bulb. (This makes it easier to peel.) Peel both pieces of squash with a vegetable peeler. Cut squash neck and bulb in half lengthwise. Using a spoon, scoop out seeds from each half of the bulb; discard seeds. Place squash pieces cut side down on board and cut each piece in half lengthwise. Cut squash crosswise into 1\"-thick slices. Again, you don't need to worry about beautiful knife work here, but it's good for the pieces to be similarly sized so they cook at the same rate.Step 6Vigorously shake 13.5-oz. can of coconut milk for a few seconds so everything gets well mixed. Open can and set aside 3 Tbsp. milk to swirl over finished soup.Step 7Heat 2 Tbsp. oil in a large Dutch oven or saucepan over medium. Add onion mixture, ¼ tsp. red pepper flakes, and 1 tsp. salt and cook, stirring occasionally with a wooden spoon, until onion is translucent and soft, 5–7 minutes.Step 8Add squash and give everything a stir to coat. Add 3 cups water, or enough to just submerge the squash, remaining coconut milk in can, and 2 tsp. salt, then stir to combine. Raise heat to high and bring soup to a boil.Step 9Once soup is boiling, reduce heat to medium-low and simmer, stirring occasionally, until the vegetables are very tender, 12–14 minutes.Step 10Meanwhile, prepare your garnishes. Spread ½ cup coconut flakes on a rimmed baking sheet. Toast in oven until golden brown, about 5 minutes. (If you can't find big coconut flakes, shredded is okay, too, but it will probably take less time to toast. Just make sure to avoid any pre-sweetened stuff.) Keep an eye on them—coconut flakes can go from golden to burnt in seconds. Cut 1 lime into wedges; set aside for serving. Using a fork or citrus reamer, juice the second lime into a small bowl.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11You’re almost ready to blend—so let’s do this! First things first: set up your workstation. You’ll need your pot of soup, blender, a large bowl, a ladle, and a clean kitchen towel all within arm’s reach. Using ladle, fill blender pitcher no more than halfway with equal parts broth and vegetables (if you fill it up, it will overflow as it blends!). Now, here’s the most important step of this entire recipe: When you secure the blender lid, make sure there is a vent for the steam to escape (many blender lids come with removable vents). If you skip this step, the lid will blow off and you will end up with soup on every inch of your kitchen.Step 12Holding the lid down with a folded kitchen towel, carefully blend soup, starting from the lowest speed and working your way up to high, until smooth and silky, 10–15 seconds. Transfer to a large bowl. Repeat, working in batches, until all soup is blended.Step 13Wipe out Dutch oven and return to stove. Pour soup back into pot and heat over medium, stirring occasionally, until you can see steam rising from the pot. (You may be tempted to serve the soup straight from the blender, but it loses a lot of heat in the blending process and gets lukewarm. Trust us—you want to reheat it.) Stir in lime juice. Taste and add more salt if needed.Step 14Ladle soup into bowls. Top with a swirl of reserved coconut milk, toasted coconut flakes, and cilantro. Serve with reserved lime wedges.Step 15Do Ahead: Soup and toppings can be made 4 days ahead. Store in separate airtight containers and chill.How would you rate Vegan Butternut Squash Soup?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleI made this soup with the very last butternut squash from last summer's harvest. The fruit opened like a radiant jewel -- so lovely I decided to roast it in the oven to enhance the color and bring out the sweet-nutty flavor. This recipe has the perfect balancing notes of creamy-sweet, garlic-savory and \nginge spice that left plenty of room for the natural butternut flavor to shine! \n\nI used homemade chicken broth instead of water supplemented with a splash of good quality sherry and added a pinch of Penzey Balti spice. I used my immersion blender, which made the processing very simple and whipped in that luscious, velvety texture! It was gorgeous and delicious! In addition to the garnishes suggested, I put out a bowl of air-popped corn as an option to add to the top for a light crunch. \n\nIt was even better the second day!Clare WyattCoeur d'Alene, Idaho2/24/2022Yummy soup! Made it on a bit of a whim in the middle of a snow storm so i had to use dry cilantro and ground ginger instead of fresh and a red onion instead of yellow. I’ll cut back next time on the red pepper flakes…it was surprisingly spicy between that and the ginger. Love how easy it is to make! Will definitely make this again!Jo SteinbargerSaint Paul, MN12/11/2021Amazing soup!  Not bland at all!  I followed the recipe, using 2 packages of pre-cut squash, which worked out fine. We found the amount of salt the recipe calls for was perfect and did not need to add any more. I blended the soup in a Vita Prep, which smoothed it out nicely very. It had a full mouth feel to it! The addition of the drizzle of coconut milk (unsweetened LITE coconut milk found in the Thai aisle), toasted coconut flakes (I used Bob Mills coconut shavings which are bigger than flakes, and worked out very well. I toasted them for five minutes exactly at 300° and that was perfect) and cilantro not only added excellent taste and texture to the soup but made for a beautiful and organic presentation. Served with a quinoa salad (lemon balsamic dressing, tomatoes, cucumbers, and chopped spinach) and some fresh Italian bread. Husband loved it and I did too! Can’t wait to make it all again.  EVNY12/1/2021Excellent recipe. I'm surprised that people found it bland. I went to the grocery store the same day I made it so my veggies were super fresh which may have made a difference. For the person who said they wish they used a stick blender, I actually tried that at first and it didn't blend enough. I ended up using my blender which made it perfectly smooth. I also didn't use the coconut shreds, instead, I roasted pumpkin seeds. I will be making this again and have already shared with my mom and mother-in-law. Nicole California 11/29/2021Loved this soup. Our daughter is vegan and she loved this recipe, is adding it to her files. My husband loved it too, and I'll be making a bunch of it to take to Vermont with us to share with family! Thank you! Anne KRochester, NY10/29/2021For the folks who find this soup really bland, I did a couple of things that helped: added more garlic, more salt and the juice of 1-2 limes (do this part slowly so you can make sure it works for you). Made a difference! \n\nNext time I may add in a sweet potato into the mix and more onion.Rana Khan Chaka KhanOttawa10/23/2021This is a good soup on the day but a great soup the day after! I added a couple of leftover eggplant cheeks and a can of butter beans for a little more substance.Greg KingTasmania Australia10/18/2021This is a fabulous recipe for butternut squash soup lovers, although I wish it had used a stick blender instead of an actual blender. Stick's are so much more convenient, faster, and more organized in my humble opinion.Louise LowryBasin City, Washington10/16/2021Excellent recipe, and easy to modify a little if needed. I didn’t have any coconut flakes so instead of drizzling the milk and flakes over at the end, swirled a little of my cashew cheese in and added basil and rosemary instead of cilantro. More of a savory blend :)Jenny BBronx, NY10/13/2021This soup turned out so good! IMPORTANT- if you are planning on toasting the coconut flakes just be careful because mine got burnt and caught on fire and I had to use the fire extinguisher. Also if you have to use a fire extinguisher near your food then try to cover it with a lid my soup probably got some fire extinguisher chemicals in it but I still ate it and it was fire! Only modifications I added was some curry and paprika in the seasoning, a bit more salt on top,  and chefs kiss!Ana EFlorida7/18/2021Mannnnn this soup was soooooo good .i did  modify  a bit .It was amazing.I already knew it was going to be scrumptious just by the ingredients.\nI was ranting about  making it tonight  and my daughter's  grandmother said she wanted some not even knowing what it would taste like but trusting  me\n🤣By the time i was done and able to taste it.I said,shoot now i have to share.I was delighted with the taste.Thank you.When  she receive the soup.i will say Bon Appetite.😋Thank you so much.JM  Harlem, Ny2/19/2021The soup came out a bit flavourless added a lot of salt to try to get some flavour out. AxelMalta1/27/2021I found this to be nearly flavourless. I followed the directions to a tee. AnonymousToronto, ON1/24/2021Delicious ~ and could not be simpler!\nMade as written except I used 2 tsp salt and it was plenty, but season as you go.\nThanks BAJessicaEast Hampton, NY1/18/2021Yes, delicious!! I did not toast the coconut...or add it at all but it’s very savory and I’d be comfortable serving it to guests which is our highest family standard for recipes!Gail NJ1/16/2021Explore Bon AppétitSoupSoups and StewsButternut SquashSquashVegetableCoconut MilkOther IngredientsFallEasyWeeknight MealsStarterSideMainDairy-FreeGluten-FreeVeganVegetarianSimmerLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-18", "author": ["Condé Nast", "Christina Chaey"]}