{"id": "18eae789b57408d495c69dcdadb82e46", "url": "https://www.bonappetit.com/story/fungi-perfecti-catalog", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "My Favorite Magazine Is a This Free Fungi Perfecti Catalog—Yes, You Heard That Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingMy Favorite Magazine Is a Mushroom Catalog—Yes, You Heard That RightFungi Perfecti’s annual magazine is packed with nerdy deep dives and, of course, mushrooms. By Emily WilsonApril 9, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!The magazine's paper was matte with a slight sheen, almost crumpled, and the photograph on the cover looked like it was shot at dawn, its subject emerging from a dark forest and gazing in wonder at a barrel-shaped organism that hung from a tree. The man was Paul Stamets and the object of his desire was an Agarikon mushroom.I immediately recognized Stamets as the mycologist from Fantastic Fungi—a 2019 documentary that explores the rich environmental and healing properties of mushrooms—and the article read like a wonderfully nerdy extension of the film. I loved it. As I flipped through the magazine, I learned about the benefits of various fungi species and how to make mushroom spores, read a recipe for reishi chili, and discovered a wealth of supplements and foraging tools.I guess now is probably the time to tell you that this “magazine” is actually a free catalog (remember those?). It arrived in the mail with my latest order of Host Defense MyCommunity capsules from Stamets’s company, Fungi Perfecti. I first started taking the blend of 17 mushrooms for immune defense last year while suffering a particularly nasty head cold, and all I can say is that I haven’t been sick since.Washington-based Fungi Perfecti was founded in 1980 and is dedicated to cultivating gourmet and medicinal mushrooms, and selling them in the form of supplements, extracts, teas, and more. They’ve been publishing the annual catalog for more than 30 years with a simple goal: Get their customers (me) hyped on the wide world of mushrooms. Sure, it's branded content—but it's also a great read. I’m no mycologist, but I love to cook with shiitakes and chanterelles and I swear by my fungi supplements. Meanwhile, ads for mushroom grow kits and tinctures pop up in my Instagram feed on the regular. What I love about Fungi Perfecti—besides its morel beeswax candle and smoothie-perfect powders—is that it’s been researching, foraging, and developing mushrooms for consumer education and healthful consumption since 1980. Stamets has believed in the power of fungi since way before you could double-tap ’em on your smartphone and channels as much effort into sharing his knowledge as peddling his products.To flip through Fungi Perfecti’s thoughtfully produced catalog is more holistic and enjoyable than the virtual buying experiences I’ve come to expect. Along with a peppering of shroom-y products, the analog approach informs me of the research that goes into their development and helps me determine which consumables are right for me—whether I buy from the brand or not. I’ll be keeping the catalog around until next year’s release, so that I can hunt for fun fungi items when it comes time to restock my capsules. Some might call that good marketing. I call it magic.Order it: Fungi Perfecti Catalog, FreeFungi Perfecti MyCommunity Mushroom Capsules$30 at iHerbExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-09", "author": ["Condé Nast", "Emily Wilson"]}