{"id": "19128d02c8462b14a87334148fdca36c", "url": "https://www.bonappetit.com/story/mulled-wine-can-take-a-hike", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Mulled Wine Can Take a Hike | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMulled Wine Can Take a HikeHot takes about hot wine.By Alex BeggsDecember 15, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Unnecessary food feud of the weekPhoto by Marissa A. Ross“They used cheap wine because they were cheap boys.” That was how Emma Wartzman recounted—in film noir narration—the terrible mulled wine she had on an early date at her boyfriend’s apartment. Is mulled wine ever good, we wondered? “Smells better than it tastes,” declared Adam. “Truly disgusting” said Carla Lalli Music, “unless you’re trying to sell your house and the realtor is showing it, in which case, make a big pot.” Social media manager Emily Schultz suggested boiling the mulling spices in water, perfuming your home, and drinking “the regular wine like regular wine.” Whoa! “The problem is” Julia Kramer typed with deep thought and analysis, “everyone here grew up in the Mid-Atlantic which is basically Florida so you do not understand what it is like to live in an actually cold climate (e.g., Chicago) where hot beverages e.g., glogg are essential to winter survival.” Aliza piled on: “Chicago taught me that mulled wine is okay but hot toddies are FANTASTIC.” Elyse Inamine and Amanda Shapiro are pro-mulled wine, but it must be said, they’re very amenable, patient, and kind people. Hilary Cadigan and Jesse Sparks prefer the Hot Penicillin. What about you?Want this letter before it hits the website? Sign up for our newsletter!Photo by Fine Art Images/Heritage Images/Getty ImagesIs it ever okay...Before you attend any cocktail parties, dinner parties, first birthday parties for dogs, or science fiction book clubs this weekend, make sure to brush up on your manners. Are you going to bring a six-pack of beer and then stash the last two bottles in your backpack to take home later? Notice the wine you brought wasn’t opened and therefore assume it’s still in your possession? OH NO YOU’RE NOT. And yet, according to multiple sources, this happens dangerously often. For more unsolicited etiquette advice (with bonus recipes), read our latest column here. And send me your questions and conundrums and general gossip! staff.bonappetit@gmail.comPhoto by Alex LauStockings full of fishOne of my favorite things about the holidays is all of the presents. So what! I need new socks! When it comes to food-themed gifts, though, things get tricky. How do you know what kitchen gadgets people already have or even want? That’s why this year’s most important gift guide, according to me, is this tinned fish stocking stuffer guide. Too niche, you say? Too bad! Well, you can use this highly personalized cookbook gift guide instead, actually. As long as no one in my immediate family tries to send me another olive oil infuser, we’ll be good.Photo by Chelsie Craig, Food Styling by Kate BuckensMake thisParty pork!!! With a name like that, how could you go wrong? (By under-cooking it—watch out.) I had to ask the Whole Foods butcher to cut this piece of pork with the chine bone in (??? news to me) but within 10 minutes, I had my roast, five giant leeks, two bunches of kale, and three heads of garlic in the biggest tote bag I own. The pork turned out juicy and fantastic—the fennel and cinnamon rub was so unexpected and great. A Molly Baz moment of genius. My whole place smelled like Christmas. Make it!Get the recipe: Party-Ready Pork RoastElsewhere, a weighted blanketWhen a weighted blanket arrived at the Healthyish desk of Aliza Abarbanel, we all got on the floor and took turns feeling the weight of the world on our bladders. I felt claustrophobic and trapped under the bean-bag-sounding thing, but Rachel Karten loved it. “I want to layer two of these!” she said. Read more about weighted blankets here.Dreaming of a white elephantThe Bon Appétit art department hosted a white elephant party this week and everyone paused frantic work on the February issue to attend and drink boxed wine hung from stockings, courtesy of crafty art director Christa Guerra. Designer Bryan Fountain wore a giant foil snowflake made by art assistant Annalee Soskin on his head. Editor in chief Adam Rapoport sent his assistant, Ryan Walker, with wine he was gifted at work, so in karmic return he got the mouse traps brought by Basically editor Amiel Stanek. Restaurant editor Elyse Inamine went home with a wheel of stinky cheese. Staff photographer Alex Lau brought a coveted Nicolas Cage t-shirt discovered on Amazon, which visuals editor Emma Fishman won to everyone’s jealousy, and promptly turned into a crop top. What a festive Tuesday!What is Brad up to?I have no idea.Unnecessary food meme of the weekExplore Bon AppétitBeggs NewsletterWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-15", "author": ["Condé Nast", "Alex Beggs"]}