{"id": "191e6f9283083b6170a01f64fda2fc1e", "url": "https://www.bonappetit.com/story/coming-up-mushrooms", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "From Lattes to Lamps, America's Coming Up Mushrooms | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFrom Lattes to Lamps, America’s Coming Up MushroomsIn the kitchen and beyond, we’re fixated on fungi.By Ali FrancisSeptember 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Kat BoystovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I was growing up in the ’90s, the only mushroom I had time for was Toad—Princess Peach’s loyal attendant and by far the best Mario Kart character. I thought the real thing, the fungus that my mom insisted on hiding in Bolognese, carbonara, and stir-fries, was straight up feral. Spongy, dirt-clad, and unsettling. Fast-forward a couple of decades and the balance has tipped. Not only do I eat fungi daily—lovingly spritzing the yellow oysters that sprout creepily from a bag atop of my fridge and lacing my morning coffee with reishi-cacao mix—but it seems everything outside of my kitchen is coming up mushrooms too.Mushroom Hot Cacao Mix$37 at Amazon$19 at HiveThey’re dominating my social media feed; taking over the beauty and wellness industries; inspiring various books, exhibitions, kitschy poster art, fashionable foraging shoots, and adorable home goods; providing, thanks to their unique structure and chemical properties, the ideal building blocks for everything from housing insulation to faux leather; and being pegged as ecological saviors sent to transform the way we manufacture, consume, and live. And yeah, the psychedelic ones are going mainstream too—reports show millennials are opting out of binge-boozing culture in favor of microdosing tiny amounts of psilocybin in the name of self-care. If I knew anything at all about “the stock market,” I’d put all my money on mushrooms. (Okay, and those cute little robots that deliver food right to your door. Those are gonna be big.)Mushroom Night Light$11 $10 at AmazonOf course, mushrooms have been around forever. In fact, we share a common evolutionary history—a limb on the genealogical tree that branched away from plants “perhaps 1.1 billion years ago,” Natalie Angier wrote for The New York Times in 1993. One researcher cited in the piece said this is why fungal diseases are so pesky to treat. “A lot of the metabolism is so similar that you can’t target a fungus sufficiently without gravely affecting the human host as well,” said Mitchell L. Sogin, Ph.D., of the Center for Molecular Evolution at the Marine Biological Laboratory. So, basically, we are mushrooms and mushrooms are us and that toenail fungus will plague you for years. Crazy!While fungi have long been prized in other cultures, many non-Indigenous Westerners are only just waking up to them. “Over the last 70 years or so, America has been incredibly mycophobic,” says Gordon Walker, ​Ph.D., the mycologist behind @FascinatedByFungi—a TikTok account dedicated to getting its 778K-plus followers stoked on ’shrooms. “I think a lot of that dates from around World War II, when we lost much of our immigrant food cultures to the great whitewashing of American food—which came at the detriment to local food systems but to the boon of national processing companies.” As food was industrialized and optimized for speed, cheapness, and ease of manufacture, tater tots, TV dinners, and Spam cans pushed fresh produce to the collective periphery. Mushrooms may have particularly fallen out of favor because they’ve long been considered objects of fear.Wooden Salt and Pepper Grinder$123 at Etsy“It’s always been like, ‘Eeewww, [mushrooms],’” says chef, writer, and TV host Sophia Roe. “Like, they’re these phallic things that represent death, rot, and mold—none of which are actually bad.” But an influx of books, YouTube channels, and social accounts like Walker’s are granting us more information about mushrooms than ever before. “People used to be very suspicious of mushrooms because eating the wrong one could easily kill you or make you ill,” says Gina Rae La Cerva, a geographer, environmental anthropologist, and the author of Feasting Wild: In Search of the Last Untamed Food. “Now you can basically snap a photo with your phone and identify something, even if you’re in the middle of nowhere.”Today, Americans produce and eat record amounts of fungi. They’re one of the most sustainable foods grown in the United States, and, with more people leaning into plant-based diets for both environmental and health reasons, “meaty”-textured mushrooms are an ideal swap for animal products, according to Roe. But perhaps most crucially, we’re learning how to cook with mushrooms and realizing they’re very delicious. “America is starting to become more obsessed with mushrooms,” says Roe, “because we know what to do with them. We can RIP that whole cream of mushroom thing.”Mushroom Citrus Juicer$12 at Urban OutfittersBut is a trend really a trend unless the wellness industry has gotten involved? Used for centuries in traditional medicine, functional mushrooms—the ones that promise enhanced moods, boosted immune systems, and increased energy—are popping up in everything from daily capsules to facial exfoliators to protein powders. While fungi have no doubt produced some of our most important medical drugs (like penicillin and cholesterol-lowering statins), the jury is ultimately still out on whether any of the claims these New Age products make hold water. According to Walker, supplements are probably not having the functional effect we think they are in the small quantities they’re consumed. “The benefit comes from just eating the mushrooms,” he says.Moon Juice Acid Potion Exfoliator$42 at Moon JuicePersonally, I’ve been catfished by too many wellness trends to fully embrace the medicinal claims—or, who knows, maybe I’m still a little mycophobic, despite my better impulses—but that doesn’t stop me from making a coffee-reishi bev every morning. I can’t speak to the “adaptogenic properties,” but I drink it for the creamy, nutty, and chocolaty kick it gives my morning joe. And although consuming reishi may be relatively new to me, I’m mindful of the cultures who’ve been using these and other mushrooms medicinally and ceremonially for thousands of years. With psilocybin use legalized for mental health treatment in Oregon and more states sure to follow, there will undoubtedly be questions—as there are with white sage and marijuana—about who profits from medicines that have been used by nonwhite cultures for millennia.And no, you’re not tripping. Mushrooms are definitely sprouting up in the fashion and design industries, too, where we’re wearing fungi on our literal sleeves and inviting them to take over our homes. They’re everywhere: embroidered into this sparkly, psychedelic Ashish dress; repped by celebs; and inspiring some truly adorable lighting situations. Not to mention, designers are getting hyped on mycelium leather—which is made from mushrooms’ sprawling, underground network of fungal threads.Photo courtesy TomboloTombolo Fungi Top$136 at TomboloPerhaps everything is coming up mushrooms because we find ourselves trying to reconnect with nature—even if just by ordering a T-shirt. Or perhaps the reason designers can’t stop referencing mushrooms is the same reason we can’t stop eating, wearing, and buying them: Fungi carry the potential to fundamentally uproot how we live on (and with) earth. And that’s just super groovy, man. So, between now and fungi-topia you can catch me rubbing mushroom serum on my face, hounding mushroom risotto, and dancing in the mushroom light wearing my mushroom-embroidered disco sweater.Critter Wine Stopper$10 at Urban OutfittersLong live mushrooms!1 / 54ChevronChevronCreamy-ish of Mushroom SoupView RecipeExplore Bon AppétitLifestyleShoppingTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-22", "author": ["Condé Nast", "Ali Francis"]}