{"id": "191ee89bf10adfcafb80e942b7696f66", "url": "https://www.bonappetit.com/story/cod-clams-corn-recipe", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Cod, Corn, and Clams: This Summer Recipe Is So Good I’d Do a TED Talk About It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Summer Recipe Is So Good I’d Do a TED Talk About ItToday we're discussing the Three Cs: Cod, Clams, and Corn.By Rachel KartenAugust 20, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenFacebookTwitterEmailThis recipe is all about the Three Cs. And this isn’t some acronym for how to be a better leader (Communication! Confidence! Commitment!). It’s much more important than executive prowess: Cod, Clams, and Corn.This new one-pan recipe by Claire Saffitz is simple without compromising on high-impact flavor. It’s got the richness and brininess of a spaghetti alle vongole, minus the carb snakes and plus the sweetness of summer corn. Let’s break down each of the Cs and examine how they contribute to the undeniable success of this butter-forward recipe.First up, the cod. I’ve been on a cod kick ever since making this recipe from Healthyish’s Feel Good Food Plan. Normally I slow-roast it, but this recipe calls for a dredge in flour and then a quick skillet hang. A word to all the corner cutters: don’t skip the flour. You need it to make the cod nice and golden, and it helps give body to your eventual sauce. The cod’s done in around 10 minutes total, and then it goes to the platter you’re serving it on, to be topped with...The second C: clams. I’m strong enough to admit that this was my first time cooking clams. But with lots of motivation and a few Google searches (“How to scrub clams”), I made it through. By the way, to clean clams you put them in a bowl with water and either scrub them with a toothbrush or agitate them a bit, then lift them out with your hands, and put them into a new clean bowl with water and repeat. Okay, back to the recipe: Add oil and shallot to your post-cod skillet. Then some white wine. And then your clams. Cover with a lid, or aluminum foil if you’re lazy like me, and wait for those suckers to open up. Five-ish minutes later, take out the good boys (open clams) and throw out the bad boys (closed clams). I think I only lost two. RIP.And finally, the last C: corn. I used the only useful kItChEn hAcK I ever learned, and set a smaller bowl upside down in a bigger bowl and cut off the kernels. It works! Add your Pinterest Corn to your clam juice-y pan along with about a 3 Tbsp of butter. Stir, stir, stir until the corn is cooked and the sauce is thick and glossy (thanks flour!). To finish things up, spoon your briny and buttery corn sauce over a platter with the cod and clams, then top it all with parsley and a squeeze of lemon. And that, friends, is how the Three Cs can truly change your summer life. Thank you for attending my TED Talk.Get the recipe:Skillet Cod, Clams, and Corn with ParsleyWho says clam sauce is only good for pasta? Not this buttery corn-studded dish.View RecipeMore clams!Explore Bon AppétitCodCornClamWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-20", "author": ["Condé Nast", "Rachel Karten"]}