{"id": "1920197eeb2d6e35a31b6f2d76b6e08c", "url": "https://www.bonappetit.com/story/tendon-tempura-carlos-jr", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Tendon Tempura Carlos Jr.'s Mountain of Perfectly Fried Tempura Is My Reason for Driving Up and Down California | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Mountain of Perfectly Fried Tempura Is My Reason for Driving Up and Down CaliforniaTendon Tempura Carlos Jr. is a temple to tempura.By Elyse InamineFebruary 5, 2020FacebookTwitterEmailPhoto by Alice TakeuchiFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.During my last trip to my hometown of Valencia, California, I had a number of excuses to drive all 50 miles down south to Torrance. First, family—my sister and her husband live there and I'm a dutiful older sister. Second, it's one of the OG Japantowns, brimming with hushed, tatami-mat-lined restaurants serving uni don and beloved tonkatsu spots packed like a club on a Friday night. Third, sometimes my mom would drive (free gas!). But the reason why I really made so many treks to Torrance during my short stay was for this mountain of tempura at Tendon Tempura Carlos Jr. in Torrance, California.As you can tell by the name, this place is a temple to tempura, the Japanese art of battering and deep-frying. There is restraint and balance and careful thought put into every little crispy thing on chef Carlos Pinto’s menu, especially the special tempura bowl. It has flaky white fish for meatiness, sweet kabocha squash, ocean-kissed seaweed for a little salt, spicy shishito peppers, big boy shrimp (because what tempura place doesn’t have this?), a cluster of tiny scallops for a luxurious touch, and a poached egg that you can poke so the yolk pools over the pearly, sticky rice. Each ingredient gets dipped into a simple batter of Japanese flour and very cold water, then fried in a sesame-soybean oil mix until the ingredients are softly cooked (but not mushy) and the coating is so crisp that it shatters like a croissant. “We make it with passion,” Pinto told me over the phone.On the cover of the menu at Tendon Tempura Carlos Jr., Pinto writes about how, after moving to Japan from where he grew up in Peru, tempura saved him from loneliness. He began cooking at the iconic Hannouske in Tokyo (you’ll find them inside Mitsuwa grocery stores in the States). Soon tempura wasn't just the thing he made every day at Hannouske but the thing he couldn't stop thinking about, the thing he craved on his days off. Eventually he moved to the U.S. to oversee Hannouske in Torrance, but when it closed, he decided to give the people what they want: tempura, the Carlos way.That means cartoon-y drawings of him all over the restaurant and the most special tempura bowl. It was a mountain of crackled fried goodness and, honestly, the real reason I'm going back to Torrance.Go there: Tendon Tempura Carlos Jr.Explore Bon AppétitHighly RecommendRestaurantsLos AngelesRead MorerestaurantsI Fought L.A. Traffic Just for This Beef Noodle SoupBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-05", "author": ["Condé Nast", "Elyse Inamine"]}