{"id": "192276a001d9b54f1734944bb614f270", "url": "https://www.bonappetit.com/recipe/citrus-ginger-raita-with-spice-oil", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Citrus-Ginger Raita With Spice Oil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueCitrus-Ginger Raita With Spice OilBy Sohla El-WayllyOctober 20, 20204.3(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintGinger and orange juice give this raita a holiday feel. Treat it like cranberry sauce–it goes with everything. Labneh is made by taking strained yogurt and straining it again so you’re left with something extra thick and rich. It can accommodate all the lemon and orange juice while retaining enough body to be scooped up with hot parathas. If all you have is Greek yogurt, that will work too, just know you’ll end up with a thinner raita. This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.IngredientsMakes about 2½ cups2cups labneh1½tsp. finely grated orange zest1½tsp. finely grated lemon zest¼cup fresh orange juice2Tbsp. fresh lemon juice1Tbsp. finely grated peeled ginger1Tbsp. sugarKosher salt1Tbsp. extra-virgin olive oil1tsp. coriander seeds, crushed½tsp. ground turmeric½tsp. Kashmiri chile powder or ¼ tsp. cayenne pepperPreparationStep 1Whisk labneh, orange zest, lemon zest, orange juice, lemon juice, ginger, and sugar in a small bowl to combine; season with salt. Set ¼ cup raita aside if you’re making Garam Masala Short Rib Roast With Pistachio Crust.Step 2Just before serving, heat oil in a small saucepan over medium-high. Add coriander seeds and cook, shaking pan occasionally, until fragrant and popping, about 1 minute. Add turmeric and chile powder; cook, shaking pan, until fragrant, about 30 seconds. Pour over raita.Step 3Do ahead: Raita (without oil) can be made 2 days ahead. Cover and chill.How would you rate Citrus-Ginger Raita With Spice Oil?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI can't get labneh here best substitute?Teresa LyLogan UT12/26/2021This is a great variation of raita, specially with the coriander tempering. Loved it!Purnima PatelBethesda, ND12/2/2020Explore Bon AppétitCondimentSouth AsianAsianYogurtOther IngredientsGingerHerbs & SpicesOrangeCitrusFruitEasyQuickSideGluten-FreeNut-FreeVegetarianHealthyishThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}