{"id": "19230b945f557e75c268b615f041f056", "url": "https://www.bonappetit.com/story/milk-bread-shaping-tutorial", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Japanese Milk Bread Shaping Tutorial | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Step-by-Step Guide to Shaping Your Milk BreadLooking to achieve those quintessential seams on your homemade loaf? Right this way...By The Bon Appétit Test KitchenMarch 27, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWhen we published our Japanese milk bread recipe earlier this month, our Test Kitchen worked with Alessandra Gordon, owner of Seattle-based purveyor Ayako & Family, to create a simpler version of the one the she remembers from her childhood in Japan. The adapted method cuts out a few steps in the shaping process, but the result is a loaf as soft, white, and tender as any. What that the modified recipe doesn’t include, however, are a few tell-tale signs of a more traditional technique: a few vertical seams and a jelly roll–like pattern on the bread’s surface. For home cooks who want to go the extra mile, use the exact same recipe (find that right here), but follow these steps below once your dough has completed its initial proof and is ready to punch down and shape.Photo by Chelsie CraigPunch down proofed dough.Photo by Chelsie CraigDivide into six pieces and shape each into a ball.Photo by Chelsie CraigFlip one ball over so seam side is facing up. Then, roll out dough so that it forms a 5x4\" rectangle about 1/2\" thick.Photo by Chelsie CraigWith your fingers, roll the dough up lengthwise into a jelly roll, making sure that the corners meet the edges of the dough. (It doesn’t need to be rolled tightly, but it should be rolled evenly and symmetrically.)Photo by Chelsie CraigSituate the jelly roll so the seam side is facing up, and then pitch the seam so its sealed. Repeat with remaining balls.Photo by Chelsie CraigTake both ends of a rolled log, and bring them together so it forms a gentle U shape. Repeat with remaining logs.Photo by Chelsie CraigLiberally butter two 9x5x5\" pain de mie pans and lids or 9x5\" loaf pans. Place three logs in alternating directions in each pan.At this point, you can return to the recipe, picking right back up where it says to cover the pans with plastic wrap and return them to warm spot.Explore Bon AppétitRecipeBreadtechniqueRead MoreMilk BreadcookingI’d Invite Myself Over for This Spicy Chicken Katsu SandwichBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-26", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}