{"id": "19317f129ae0b0e1c54def51acd0f9e7", "url": "https://www.bonappetit.com/recipe/herb-rubbed-cast-iron-chicken-with-pan-sauce", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Herb-Rubbed Cast-Iron Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueHerb-Rubbed Cast-Iron Chicken with Pan SauceBy Drifters Wife, Portland, MEAugust 14, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintElizabeth CecilEmailPinterestPrintEmailPinterestPrintLetting the bird’s skin dry out before cooking is crucial to getting restaurant-worthy crispiness. Pair that with rotating the cast-iron skillet around the burner for even browning as it cooks, and you've got yourself the crackliest, juiciest half chicken imaginable. This recipe is from Drifters Wife in Portland, ME, our No. 9 Best New Restaurant 2018.Ingredients4 servings 1cup parsley leaves with tender stems1Tbsp. rosemary leaves1Tbsp. oregano leaves2garlic cloves, smashed¼cup extra-virgin olive oil13½–4-lb. chicken, split in half through breastbone, backbone and wing tips removedKosher salt, freshly ground pepper2Tbsp. vegetable oil1Tbsp. fresh lemon juicePreparationStep 1Finely chop parsley, rosemary, oregano, and garlic in a food processor. With the motor running, stream in olive oil and process until a coarse paste forms. Season chicken with salt and pepper and rub flesh side with herb purée. Place, skin side up, on a rimmed baking sheet. Chill, uncovered, at least 3 hours and up to 1 day.Step 2Let sit at room temperature 1 hour before roasting. Place a rack in lower third of oven and set a large cast-iron skillet on rack; preheat oven to 450°. Wrap the bottom of a medium cast-iron skillet in foil; set aside. As soon as oven is heated, carefully transfer skillet to stove and set over medium heat. Add vegetable oil. Once it begins to smoke, arrange both chicken halves skin side down with breasts touching in center and legs facing out. Place foil-wrapped skillet on top to weigh down. Cook, moving top skillet around to press on chicken in different spots, and shifting bottom skillet around burner every few minutes, until skin is deeply golden brown, 8–10 minutes.Step 3Position top skillet on chicken legs, transfer to oven, and roast 7 minutes. Slide top skillet over so that weight is on breasts and continue to roast until an instant-read thermometer inserted into the thickest part of legs registers 165°, 7–9 minutes longer. Remove top skillet and spoon off all but 1 Tbsp. fat from skillet with chicken; discard. Add lemon juice and ¾ cup water. Let sit off heat 2 minutes. Transfer chicken to a platter; let rest while you make the sauce.Step 4Bring liquid to a simmer over medium-high heat, stirring and scraping up browned bits; cook until an emulsified glossy sauce forms, 5–7 minutes. Season with salt. Pour sauce around chicken.How would you rate Herb-Rubbed Cast-Iron Chicken with Pan Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitAmericanChickenPoultryRosemaryHerbs & SpicesOreganoOne-Pot MealsMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Drifters Wife", "Portland"]}