{"id": "193e340e2838f3a6c3aab1e0887a0f30", "url": "https://www.bonappetit.com/story/what-is-a-roux", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "What Is a Roux and Why Do I Keep Messing Mine Up? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is a Roux and Why Do I Keep Messing Mine Up?Butter, flour, and a whole lotta whisking.By Nico AvalleDecember 29, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food styling by Micah MortonFacebookTwitterEmailSome kitchen skills—like dicing onions, flipping pancakes, or rolling burritos—may feel tricky at first but become muscle memory pretty quickly. But in my experience, learning how to make a roux is not one of those skills. The process itself seems straightforward: Add equal parts fat and flour to a pan on medium low, then stir until uniform and the desired color has been achieved. In practice, however, my rouxs are pretty hit-and-miss.Sure, sometimes I’ll nail one on the first try and be on my way to perfect gravy, béchamel, or gumbo. But then there are the times when things keep clumping together, or the mixture comes out super thin, or—worst of all—the flour just burns before it can incorporate into the fat. When that happens, I usually dump my failed attempt (along with my ego) into the trash and start over. But after messing up senior food editor Christina Chaey’s Japanese Curry recipe twice in a row, I realized I needed help from the pro. Here’s everything I learned:What is a roux?In the simplest terms possible, a roux is a mixture of equal parts flour and fat, cooked together over low to medium heat, to create a uniform thickening agent that’s deployed in saucy recipes like this extra-creamy Lasagna Bolognese, Chicken-Andouille Gumbo, and béchamel-soaked Croque Monsieur.You have options when it comes to the fat, but more often than not, roux is made from either neutral oil (like vegetable or canola) or unsalted butter. When used in soups, sauces, and casseroles a roux provides creaminess and density, helps incorporate other fatty ingredients like cream or cheese, and generally binds things together into a cohesive finished product. And gravy, this season’s MVP, is made by adding stock and/or meat drippings to a roux.As the silent x in their name implies, rouxs are common in French cuisine—used in mother sauces like béchamel and velouté—but they pop up in dishes from around the world too. Rouxs are an essential part of Cajun cooking and are also the backbone of many Japanese curries—like Chaey’s winter squash and mushroom curry and the Golden Curry that inspired her recipe.“If you look at the ingredients on the box [of Golden Curry], it’s pretty much just flour and oil, and then you have salt, sugar, and curry powder,” Chaey says. If you want to see the power of a well-made roux, add one of those gorgeous yellow blocks to a pot of veggie broth. It’ll disperse in seconds, turning a runny stew into a velvety, creamy sauce right before your eyes.How do I make my rouxs better?In Chaey’s eyes, making a good roux largely comes down to practice and intuition—but there are a couple tips that can help you get there sooner.Trust your nose“You want to cook the flour and the butter until there’s no raw flour smell left,” she says, comparing the telltale scent to pancake batter or biscuit dough. If you’re using butter as your fat, you’ll also pick up on the toasty, nutty scent of the milk solids browning (like when making brown butter). Once you reach that point—note to self—lower the heat to avoid burning.Keep an eye on the colorThere are many degrees of doneness in rouxs, all of which get their names from their various hues. White rouxs are used in creamy béchamel sauces, the building block of great macaroni and cheese, and should only be cooked until the flour and fat are incorporated and the raw flour smell dissipates—cook times can vary, but white rouxs generally come together in 3–5 minutes. A light or blond roux cooks for slightly longer to develop some browning and is typically reserved for slightly darker foods like turkey gravy. And the dark brown roux, used most often in Cajun food, is cooked until it’s the color of chocolate and ready to lace gumbo with a nutty richness. Word to the wise: Butter will almost certainly burn while making a darker roux, so opt for a fat with a higher smoke point, like vegetable oil, and don’t stop stirring until you reach your desired color.How do I deal with lumps?Your eventual goal is a glossy, uniform paste that coats the back of a spoon (but doesn’t stick). Lumps can form when the flour packs together, but they’re easy enough to break up. “The best technique is to keep [the mixture] moving constantly,” says Chaey, “and make sure whatever utensil you’re using is flexible enough to reach every corner of the pan, because hidden, forgotten pockets of flour will burn.” Starting with a whisk is a good idea—especially a flat whisk, which makes scraping the corners of a pot much easier—but once the bigger clumps are broken up, you can switch to a flexible rubber spatula or wood spoon.Still, rouxs can be deceptive. According to Chaey, when you add spices to the roux in her recipe, it will appear to seize up almost instantly, looking a lot like the failed rouxs we’re trying to avoid. Fear not, though—this doesn’t mean your roux is ruined. It’s a ruse! (Sorry.) Once you add that paste to your stock or stew, it will dissolve away just like a Golden Curry block, instantly filling your pan with the creamy finished sauce you’ve worked so hard for.Roux La-La:Japanese Curry With Winter Squash and MushroomsIf you love instant Japanese curry from a box, a bowl of this soul-warming homemade version packed with seared mushrooms and sweet winter squash will deliver instant nostalgia.View RecipeExplore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-29", "author": ["Condé Nast", "Nico Avalle"]}