{"id": "1947a67c68f2bc034e86c758cec9f876", "url": "https://www.bonappetit.com/story/50-dollar-dinner-party-pork-shoulder", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "The $50 Dinner Party You Can Completely Make Ahead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe $50 Dinner Party You Can Completely Make AheadThat's right: 10 guests, $50 worth of groceries, and nobody will even see you cook.By Amiel StanekJanuary 18, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI’ve been hosting dinner parties for over ten years now, and if there’s one thing I’ve learned, it’s this: I don’t really want anyone to see me cook. It was cute and all, at least when I lived in a big shared apartment with an open kitchen, to be slicing and dicing and sautéing while keeping up banter with my guests. But you know what? Now that I’ve got a one-bedroom and a narrow galley kitchen, I don’t want anyone up in my grill during go-time, asking me what I’m doing or what such-and-such ingredient is. Honestly, that’s kind of my job, and on Saturdays I try to keep the explaining-cooking-stuff-while-sweating thing to a minimum.This is all to say, when I’m planning a menu for a dinner party, I look for dishes that require as little a la minute cooking as possible—things that can be prepped, cooked, and more or less cleaned up hours before anybody walks through the door. Seriously: Nothing makes you feel like a boss quite like sitting at the table with your friends, eating snacks, drinking wine, with the knowledge that you could have dinner on the table in ten minutes, starting whenever-the-hell you want. It’s a powerful, intoxicating secret—I could be wrong, but I’m preeeeetty sure this is what having a concealed firearm feels like.Moooooving on, it is in this spirit that I bring you 2018’s first installment of the $50 Dinner Party: a menu that a) feeds 10, b) costs around $50, and c) you should be able to shop for in the morning (as in 9 a.m., not 11 a.m.), prep over the course of the afternoon, and have everything buttoned up before your friends roll up at 7. Let’s do this.Le Menu:Creamy Kimchi DipCider-Braised Pork Shoulder with Butternut SquashHerby Napa Cabbage Salad with LimeChocolate and ClementinesYou’ll Need:1 6—7-pound bone-in pork shoulder (Boston butt), preferably skinless2 medium butternut squash (about 7 pounds total; pick ones that are about the same size)2 cups apple cider or juice¾ cup low-sodium soy sauce or tamari¾ cup distilled white vinegar2 heads of garlic6 scallions3 cups short grain white rice1 16-ounce jar kimchi1 8-ounce brick cream cheese1 8-ounce tub sour cream6 Persian cucumbers, or 1 English cucumber1 medium head of Napa cabbage (about 2½ pounds)1 bunch cilantro1 bunch dill2 limesAssuming You Have (Otherwise You’ll Need to Buy):Kosher saltExtra-virgin olive oilBlack pepper½ cup neutral oil (vegetable, peanut, canola, whatever)Ask Your Friends to Bring:1 bag pretzels1 bag sturdy potato chips1 of those cute little cases of clementines or mandarin orangesA bar of chocolate (everyone)Booze (everyone)Dinner Party MarxismFirst things first: Tell your friends what to do. Text everyone and instruct them to bring booze. While I used to get super specific about what kind of wine to bring—light reds, sparkling wine, etc—I’ve changed my tune a bit. Now, I try to be super specific with each guest, to play to their strengths, as it were. Got a couple of friends who like to nerd out on natural wine? Tell them what you’re cooking and let them get weird. Have a friend who is chronically broke and only begrudgingly buys wine when other people tell them to? Have them bring a twelve-pack of shitty beer, for when the wine runs out and nobody cares what they’re drinking anyways. That friend who won’t stop talking about their fancy promotion? A decent bottle of whisky or tequila for when the party really starts to get dark. Think of it as Dinner Party Marxism— “From each according to his ability,” and all that.You’re also going to ask the one friend who you know will show up on time to bring a bag of potato chips and a bag of pretzels to go with the kimchi dip, the one friend who you know is going to show up late and feel guilty about it to bring one of those little cases of clementines, and ask a handful of random, reasonably responsible people to bring bars of chocolate, dealers choice. If this makes you uncomfortable, try listening to the 2006 hit “Bossy” by Kelis featuring Too $hort while delegating; I find it helps.Get the Pork StartedThe whole day needs to be organized around that salty-sweet, fall-apart slow-roasted pork shoulder—it’s a big piece of meat, and its timeline is your timeline. Start to finish, you should budget 7 hours. I’m not saying this to freak you out, but if you want to actually experience the euphoric sensation of having everything done by the time your doorbell rings, you need to manage your time accordingly.So here’s the thing about pork shoulder. In its most basic form—bone-in, skin-on, and big—it’s about as cheap a piece of meat as you’re going to get. Most of those are going to clock in at 5-8 pounds, and something on the lower range is definitely going to be enough to feed a group this size, probably with leftovers. The limiting factor is the size of your Dutch oven. I literally measured mine (10.5 inches in diameter, the #29 Le Creuset) and brought a measuring tape to the store to make sure I found one that fit. If you’re working with a smaller pot, plan accordingly—maybe you want a boneless pork shoulder instead, so that you can cut it into a few pieces that will fit into your cooking vessel.Give that pork a good rub down.\nPhoto by Alex LauNow that that’s out of the way, let’s start cooking. Arrange your oven racks so that you’ve got one in the lowest possible position and one in the highest possible position, and preheat that bad boy to 300°F. Take your 6—7-pound bone-in, skinless pork shoulder out of the plastic, put it on a rimmed baking sheet, and rub it all over with 3 tablespoons kosher salt. Let it sit out for at least an hour, allowing the meat to come up to room temperature, which will help it to cook more evenly. In the meantime, deal with the squash.Cut 'em in half, scoop out those seeds, but don't waste a second peeling.\nPhoto by Alex LauDeal with SquashSlice your 2 medium butternut squash (ideally totalling around 7 pounds and relatively the same size and shape) lengthwise, and scoop out the seeds and stringy bullshit with a spoon. (Notice I didn’t tell you to go through the agonizing and stupid process of peeling them. You’re welcome!) Rub them down with a little bit of vegetable oil or olive oil, season them with salt, and arrange them cut side-down on a rimmed baking sheet. Easiest butternut squash prep you’ll ever have to do. Once these guys are cooked and soft, we’re just going to scoop out big irregular chunks of the flesh—leaving that stupid skin behind—and use them as the base for all of our saucy pork business.Butternut squash, all oiled up and seasoned, ready for the oven.\nPhoto by Alex LauDeal with the Pork AgainHas an hour passed yet? It shouldn’t have. (Lulz I am sorry but if it took you a whole hour to cut those squash in half and scoop out the seeds you are probably in over your head with this whole dinner party thing tbh.) Go ahead and get together the ingredients for the pork’s irresistibly salty-sweet braising liquid. Measure out 2 cups apple cider or juice, ½ cup low-sodium soy sauce or tamari, and ½ cup distilled white vinegar. Slice 1 head of garlic in half crosswise. Good deal.Sear it on all of the sides, people.\nPhoto by Alex LauIt’s searing time. Pat the meat all over with paper towels—you want it as dry as possible. Heat 1 tablespoon vegetable oil in your Dutch oven up over medium-high heat, and when the oil starts to shimmer and smoke, carefully lower the pork shoulder in fatty side-down. Sear the pork on all sides until it is good and dark and crusty—this could take as long as 20 minutes total, be patient! When that’s done, turn off the heat, carefully lift the meat out and onto the rimmed baking sheet, and even more carefully pour off whatever fat is in the bottom of the Dutch oven.Photo by Alex LauPhoto by Alex LauPhoto by Alex LauPut the Dutch oven back on the stove, turn the heat back on to medium, pour in that apple cider-soy sauce-vinegar business, and toss in the garlic. When the liquid gets bubbly, put the pork back in there—fatty side-up this time. Tear off a square of aluminum foil, put it on top of the meat, and kind of tuck it around before putting the lid of the Dutch oven on. (What’s the deal with the foil? IDK, Claire Saffitz told me to, and when she tells me to do something I always do it.) Turn off the heat, transfer the Dutch oven to the bottom rack of your oven, and slide the sheet pan of butternut squash onto the top rack.Congratulations! Your main course is almost entirely done. Well, the “doing stuff” part of the main course, anyways. The pork is going to take between 3 and 3½ hours total, but you should go ahead and check on everything happening in the oven after an hour and a half or so. At this point, flip the pork, recover it with foil and the lid, and pop it back in the oven. The squash is probably ready to come out by then—a fork should slide easily through the skin and into the flesh—and you can just cover it with foil and let it hang out on top of the stove until game time. As for the pork, stay tuned for further instructions.Prep the SaladTiiiiiiiiiiIIIIIiiiiIIIIIIIIIme, it’s on your siiiIIIiiIIIiiiide, YES IT IS! (Am I still a millennial if I like singing Rolling Stones karaoke? You decide.) Now that the pork and the squash are in the oven, you’ve got some hours on your hands. But if I were you—and the tone and tense of this article kind of assumes that I am, in fact, you—I would go ahead and get the rest of my prep out of the way now. That means getting the salad together, making the dressing, and making that kimchi dip.Before we deal with the salad fixin’s, we’re going to set ourselves up for kimchi dip success by taking an 8-ounce block of cream cheese out of the fridge, cutting it into cubes, and letting it come up to room temperature in a bowl on top of the warm oven. (If the idea of mixing cream cheese and kimchi together sounds gross you to, trust—it did to all of my coworkers too. Until they tried it.)Chop, chop, chop.\nPhoto by Alex LauNow: that salad. The thing that I love about a cabbage salad is how crunchy and sturdy it is. Where lettuce prepped too far in advance can get kinda sad and wilt-y, cabbage holds up like a MF champ—exactly what we want in the context of  this whole get-it-all-done-before-anyone-gets-here thing. Mix it with a ton of herbs and a super zippy, lime-y dressing, and you’ve got yourself the perfect complement to anything rich and meaty. To start, take out 1 medium head of Napa cabbage (about 2½ pounds) and peel off any nasty-looking outer layers. Slice the whole thing in half lengthwise, then each one of those halves lengthwise, and then chop down each quarter crosswise so you have roughly 1” pieces. Transfer that to a salad bowl. Now, that wasn’t so hard, was it?Photo by Alex LauHERB TIME! You know what makes a bunch of chopped cabbage feel less like a bunch of chopped cabbage and more like a salad? A whoooooole lotta herbs. In this case, you’re going to use an entire bunch of cilantro and an entire bunch of dill. That’s correct: The two most controversial herbs in the same damn dish. Edgy, right? I’ve got this theory, which is that when you combine dill and cilantro they stop tasting like dill and cilantro and just taste brilliant and beautiful and green and “herbaceous”—you can feel free to pretend like this is your theory when people say, “Hey! I don’t normally even like dill and cilantro but they’re pretty good in this salad!” Or you can take the coward’s way out and use, like, parsley or something instead. Looks like you get to decide which side of history you’re on!In any case, wash and dry 1 bunch of dill—tbh I only do this is they seem very dirty—and  pick the frilly, tender mini-sprigs of dill off of the not-so-tender stems and add them to the salad bowl. Do the same with 1 bunch of cilantro, then cover your salad with a damp piece of paper towel and chuck the whole thing into the fridge for later.Photo by Alex LauOn to the dressing, which I hesitate to call a dressing because of how simple it is. Zest two limes into a measuring cup. Then halve the limes and squeeze them into that same measuring cup. You’ll probably end up with about a ¼ cup of juice, to which you’ll add some distilled white vinegar until you get ½ cup of liquid in there total. Add a big pinch of salt, a bunch of grinds of black pepper. Measure out ½ cup of vegetable oil in a separate bowl/cup/mug, cover both in plastic wrap, and set them both aside for later. Done and done!Make Kimchi DipI hold this truth to be self evident: If you mix sour cream and cream cheese together, add something extremely flavorful to that unholy combination—caramelized onions, miso, Buffalo chicken—and season it with salt, you have a Delicious Dip. This is the principle behind this kimchi dip, and I’m going to make you a believer.Remember that cream cheese that you set out a while ago? Put that in a bowl, mash it up some with a rubber spatula, and add an 8-ounce tub of sour cream to it. Mash it up so it is as smooth as possible. Add a pinch of salt and mash some more. The stage has been set for Delicious Dip.Photo by Alex LauPhoto by Alex LauTake out your 16-ounce jar of kimchi—I like to use the spiciest possible Napa cabbage version I can find, but any kind will do—and remove the solids from the jar, trying to leave behind whatever liquid is in there. Give the kimchi a good squeeze over the sink if it seems especially wet. Then chop it up as finely as you can. Add it to that bowl of creamy goodness, along with 1½ tablespoons of low-sodium soy sauce or tamari, and mix the whole thing up good. Delicious Dip, right??? Season with salt if it needs it, transfer it to a Presentable Dip Bowl, cover it with plastic and pop it in the fridge. Slice 6 Persian cucumbers on a jaunty diagonal to use as scoopers, throw those in a Ziplock, toss that in a fridge, and you’re golden.You are so close to having everything done before anyone has arrived, it’s crazy.Ready the Pork!Salad? Check. Salad dressing? Check. Kimchi dip? Check. Now it’s back to the pork situation. By now your butternut squash is probably cooked and out of the oven, and the meat is on its last stint in the oven. At the 3 hour mark, take a peek at the pork. If it’s not pulling away from the bone, looking so tender that it’s about to collapse onto itself, give it another half hour or so—you don’t want to rush this part, or you’re going to be annoyed with yourself later.Done and done.\nPhoto by Alex LauWhen the pork shoulder has gotten to that special, fall-off-the-bone place, take it out of the oven and let it rest, uncovered, for at least an hour. You know how people are always telling you to let meat rest before you cut it up? Well, this is a big ass piece of meat, and it needs plenty of time to rest. Also: You’re going to need to get hands-on with that meat, and if you don’t let it cool down you’re going to burn the shit out of your fingers. Go do something else for an hour!Photo by Alex LauHow was that hour? Good? Take a shower or something? (Read: Scroll through three years of an ex’s Instagram feed.) Great! Time to shred the pork. Take that now-patiently-rested, nearly-falling-apart hunk of meat and transfer it to a platter. Fish the mushy halves of garlic out of the Dutch oven and squeeze the cloves out of their skins and back into the pot, then toss the skins. Now start pulling the meat into bite-size pieces, throwing them back into the cooking liquid in the Dutch oven as you go, discarding any gristle-y pieces, bones, or unappealing hunks of fat in the process. When that’s finished, give that meaty, saucy goodness a taste, and add a splash of vinegar and some salt if it needs it. Put a lid on it, park it on the back of the stove.One last thing. Trim and clean up 6 scallions, and slice them as thinly as possible. Transfer that to a bowl and put it in the fridge.You’ve done it: Dinner is prepped, and you’ve still (hopefully) have hours before anyone is going to show up at your house. Pour yourself a drink and pat yourself on the back.Now do the dishes.Game TimeDING DONG! Look who it is! Your most responsible friend, the one who always shows up exactly on time! Normally this would annoy you, because you’re in the middle of something and were kind of counting on an extra 15 minutes—but not today! You are ready.Heeeeeeeere's KIMCHI DIP!\nAlex LauShow them in, pour them a drink, and set out the bowl of kimchi dip along with the sliced cucumbers and the chips and pretzels they brought. Sit down with them and shoot the shit while the rest of your friends filter in. How good does that feel, knowing that everything is already done? A few of your friends are probably giving you weird looks because they’re used to you scrambling and sweating in the kitchen for the first hour of the dinner party. “So...what’s for dinner?” They might ask in a leading sort of way, suspicious that you decided to not cook at all and just order pizza. Give them a self-satisfied smirk. Tell them what’s for dinner. Feels good, right? Concealed carry.About a half hour before you want people to sit down, reheat the pork over low heat, covered. You can also pop the butternut squash back into the oven to warm up for a few minutes, but it’s fine at room temp, too. Take the salad out so it’s not fridge-cold.Shreddy, saucy pork, butternut squash, what's not to like?\nAlex LauOnce the table is set and you’re ready to eat, turn off the pork. Turn your attention to the butternut squash. Use a serving spoon to scoop up rough hunks of the cooked squash flesh—leaving behind the skin—and arrange them over the bottom of two large plates or platters. Use tongs to scatter the pork over the squash. Ladle some of that delicious, porky jus out of the Dutch oven and all over the pork-squash business, scatter some scallions on top, and you’re good to go. Ferry those platters out to the table, and bask in the “ooooh”s and “aaaaaaah”s.Crunch time.\nAlex LauBack to the kitchen. Toss the cabbage and the herbs together with your hands, add in the lime-vinegar dressing and mix again. Add the oil and give it another good toss. Taste it for seasoning, and add a couple of good pinches of salt if it needs it—you really want it to pop. Divide the salad between a couple of large plates or bowls if you feel like it, and bring that salad to the table. More “oooh”s and “aaaaaaah”s.Eat. Drink. Be merry. Wipe not a bead of sweat from your brow. Is this the easiest dinner party you’ve ever hosted, or what?Nobody is going to get mad at citrus and chocolate.\nPhoto by Alex LauDessertAt some point, when everyone has eaten their fill and heaped praise upon your cooking, make dessert happen. Take a page out of my dear friend Alison Roman’s book here (speaking of books: BUY HER BOOK) and set that crate of clementines right in the middle of the table, and toss those bars of chocolate next to it like you’re dropping the mic.Done. And. Done.Aaaaaaand scene.\nPhoto by Alex LauGet the recipes:Creamy Kimchi DipThis stuff is crazy good.View RecipeCider-Braised Pork Shoulder with Butternut SquashBone-in pork shoulder is one of the least expensive, party-friendly animal proteins you can buy. This recipe will feed 10—with leftovers!View RecipeHerby Napa Cabbage Salad with LimeThis cabbage salad is packed with herbs that make it taste super fresh and green—and it's perfect for a crowd.View RecipeRelated: Check out the original $50 dinner party here.Explore Bon AppétitDinnerPartyPorkEntertaining + StyleRead MorecultureHow to Throw a Chill Sunday Dinner Party for Only $40By Amiel Stanek and Lauren SchaefercultureHow to Have a Fancy Dinner Party for 10 People With Only $50By Amiel StanekcultureIn Defense of Cooking Like a Complete and Total ManiacBy Mari UyeharacookingHow to Throw a Dinner Party Without a Kitchen TableBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Amiel Stanek", "Lauren Schaefer"]}