{"id": "19582a2a9e0340f1f9586b7931267b4d", "url": "https://www.bonappetit.com/story/be-patient-in-the-kitchen", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "There's No Better Time to… Follow Recipes Without Shortcuts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Follow a Recipe Without Making ShortcutsI’ve always been a careless, rushed cook—but now I’m taking a minute to slow down.By Hilary CadiganApril 1, 2020FacebookTwitterEmailFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Set a timer and follow the recipe.For a long time, I could not figure out why, despite my supposed best efforts, I remained a less-than-stellar cook. I had the recipes! The tools! The personal cell phone numbers of colleagues who could (and often did) give me live advice as I stumbled my way through their creations! What was I missing?Then one day, pulling a big brown lagoon of conjoined snickerdoodles out of the oven, far too late to acknowledge in any meaningful way that the key step I’d left out had cost me, I realized what it was: I went too fast. I was careless. I intentionally—even if sometimes subconsciously—cut corners. (Yes, fool, you did need to chill that dough before you baked it.) In short, my kitchen game lacked one very clear ingredient: patience. But while identifying the problem is, as they say, the first step to solving it, I couldn’t imagine a world in which I’d ever become more patient. I mean, I live in New York City. I answer emails on the toilet.Then, this happened. You know what—I don’t need to say it. And suddenly, my calendar full of obligations evaporated into one endless question mark parade. Suddenly, I had nothing but time. Well, time and tidal waves of anxiety crashing through my stomach.But I still had to feed myself. So on about day three, I pulled out some flour, some yeast, some olive oil. I made bread, and then I made brownies. First a relatively simple batch laced with tahini, then a more complicated one, with multiple mixing bowls and camouflage spots of melty cream cheese on top. By day eight I was frying up scallion pancakes, simmering creamy-ish of mushroom soup and then a big silky vat of bean and ham hock stew that I modified with pork knuckle like some kind of inventor (but really just because the ham hock supply at my local grocery store had been decimated). By day ten I’d resolved to work my way through the entire Family Meal section of our March issue—warm chickpea bowls with roasted sweet potatoes and lemony yogurt; turmeric-coconut curry with crushed-up turkey meatballs.Given the situation we’re all in, it’s no surprise that I’m cooking more than I’ve ever cooked in my life. I literally have to, and I have to be creative because the contents of my cabinet and fridge grow slimmer by the day. But what did surprise me is that I’m cooking better. Instead of ad hoc chopping onions into already too-hot skillets with the urgency of the last place guy on Chopped (my usual M.O.), I stop, take a breath, and clear my counters. I open the windows, put some Sade on my little bluetooth speaker, and do totally out-of-character things like mise-ing out teaspoons of chile powder and tablespoons of salt into little bowls and arranging them on my countertop in a careful pattern like Julia Child herself.And as a result, all the stuff that usually goes wrong...isn’t going wrong. My beans are creamy and cooked all the way through. My bread is fluffy and moist. My scallion pancakes are lacy, golden-brown lily pads so beautiful that my esteemed colleague Christina Chaey has no choice but to start referring to me as a “chefluencer.” Turns out slowing down not only makes the process more enjoyable; it also makes the results far better.So here I am with my little bowls and my slow and methodical, if technically questionable, knife skills. Chopping, pouring, stirring, mixing. Slowly, slowly. I used to surf the chaos (with frequent wipe-outs), but now that it’s become so big, so unwieldy, I’ve had to find a place of stillness within it. And in a time when everything feels so abundantly out of control, there’s comfort in measuring out ingredients one by one, reciting recipes like incantations, leaning into the calming monotony of cooking. Here I am in this tiny corner of the world that has suddenly become a much larger portion of my existence. Here I am making something, however small, to sustain myself through this new reality.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-01", "author": ["Condé Nast", "Hilary Cadigan"]}