{"id": "195979069135103813feab9837e21aa4", "url": "https://www.bonappetit.com/story/really-big-bowl", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "A Really Big Mixing Bowl is an Essential Piece of Cooking Equipment  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Kitchen Needs One Really Big BowlA huge bowl is worth making room for.By Sarah JampelSeptember 11, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailOf all the oversized items I’ve purchased in my life—oversized jeans, oversized sweaters, oversized pencils (remember these?), and oversized whisks—the only one I do not regret is my big mixing bowl.It’s so large that I could bathe my cat in it, should he let me, so large that it doesn’t nest nicely with my other prep bowls, and so large that it’s been designated its own area of the kitchen. But you know what? It’s worth it.Because with the exception of running into your boss in your therapist’s waiting room, there’s nothing more awkward than using a bowl that’s too small for the task at hand. Not only does stuff fly or slosh everywhere (a mess!), but you simply can’t do as effective a job of mixing, whether you’re stirring together cookie dough or tossing salad.If you’ve ever tried to dress a salad in a too-small bowl, you know that it’s nearly impossible to get that nest of leaves in the middle evenly coated while keeping the wriggly arugula contained. In our book, the bowl should be at least 25% larger than its contents: Otherwise, it’s like your leaves are trying to do the Cha Cha Slide in a mosh pit.Big bowls aren’t just handy for dressing salads, though. They’re great whenever you need to do thorough mixing. Potato salad. Pasta salad. Okay, I guess those are both salads by name—but you get the point. How about white pesto or red pesto or green pesto? Any circumstance in which you need to marry noodles and sauce off the heat in order to achieve that perfect emulsion, you’ll need a big bowl.Small cucumber, big bowl.\nPhoto by Chelsie CraigBut enough about pasta. An XL bowl is also indispensable when you want to marinate a big piece of meat or just a big volume of meat without wasting a plastic bag (sure, you may need to clear a little room in your fridge). It’s the right size for an ice bath, whether you’re shocking a bunch of jammy soft-boiled eggs, blanching a boatload of vegetables for a grand aioli (hey, it could happen), prepping this Ice Water Salad, chilling a bottle of wine, or cooling down a custard for ice cream. And it’s perfect for foods that will grow in size, like dried beans that plump up as they soak or pizza dough that (if all goes well) will grow and rise. My bowl is roomy enough that I can knead dough inside of it, which saves me the trouble of transferring it to a work surface.If nothing else, a big bowl is instrumental when you’re doubling or tripling recipes for meal-prepping or entertaining. How else will you coat six pounds of chicken wings with buffalo sauce or serve the nutritional yeast-dusted popcorn?So the bowl is big, yes, but it has more than earned its keep. And that’s more than I can say about that humongous pencil (may it give some third grader somewhere some joy).Buy it: 8-Qt. Mixing Bowl, $14 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingequipmentRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Sarah Jampel"]}