{"id": "1967912f38ad9e9f62d37b55b950fc3c", "url": "https://www.bonappetit.com/story/i-had-to-eat-to-heal", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "I Ate Food to Heal Burn Wounds Faster | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAfter a Life-Changing Injury, I Had to Eat to HealI pursued hunger with the hopes that maybe it could fix me.By Bindu BansinathDecember 8, 2020FacebookTwitterEmailIllustration by Anindya AnugrahFacebookTwitterEmailI return, too often, to the kitchen scene that opens Han Kang’s The Vegetarian. A housewife, Yeong-hye, has a violent dream of animal slaughter. She wakes up in the middle of the night, resolved to become a meat-free woman. On his way to the kitchen for a glass of water, Yeong-hye’s husband finds her in front of an open fridge in a nightgown, standing still as a potted plant.By sunrise Yeong-hye is still at the fridge, only this time she’s crouched over and surrounded by trash bags, disposing of everything that was once alive: hunks of striated beef and fatty pork belly, saltwater eel; eggs and milk for good vegan measure. Yeong-hye’s vegetarianism is an act of control and defiance that her husband mistakes for madness. But then her husband is easily maddened: While disposing of the household meat, his wife has forgotten to iron his white shirt. It’s the husband who narrates the kitchen scene as well as the first third of the novel. By the end of that third, he divorces Yeong-hye and his narrative voice disappears.Last autumn I lost my hunger for all things meat and all things otherwise. It’s not what I meant to do—this wasn’t a ploy to become thinner, one of the intentional appetite-reduction strategies of my teenage years—but it’s what I did. No matter how ravenous I got I could not finish a plate in one sitting. Half of everything I packed into takeaway boxes and saved for an indefinite later. I sucked the empty tines of a plastic fork, and whenever I sat down to eat until full, I found that a sadness had already filled me three-quarters of the way.That sadness was owed, in part, to separation: A few weeks before, I separated from my partner of five years. Our break was inevitable but also desolating. I had been with my partner since I was 18, fresh out of a difficult situation. There were parts of my history I had wanted to push away, parts that had grown rotten and dank with trauma, and being loved by this older and put-together man gave me the brief illusion that I could push these parts away.I missed him, but more so I missed the me so preoccupied with another person that she didn’t have to deal with herself.Of course, nothing boiling stays under the lid too long. After all the idiosyncrasies of a relationship, it saddens me just how generic it is, the language of our ending. We grew up with each other. When I was young, I had the tendency to furrow into the shadow of his guidance; I did not grow up into the woman he had wished me to become. It is possible to love someone for so long and so dearly you forget how to be good to each other.Weeks folded into new weeks, and still my appetite grew smaller. Occasionally I ate raw spinach by the handful, to be somewhat good. I wanted to heal, to snap out of the physical drama of heartbreak, but admittedly I am the type of woman who is buoyed by drama, who loves only a particular and painful type of man—someone a little unkind, someone a little or a lot older, whose love I have to earn—and so it’s much easier for me to backslide into bedrooms and sadness and Syrah than it is to recover. I missed my partner. Even the arguments we had at the end (there were many) I found somewhat comforting; the din of him yet another intimacy I didn’t want to let go. I missed him, but more so I missed the me so preoccupied with another person that she didn’t have to deal with herself.Last Thanksgiving, a month after the breakup, I traveled with family to Philly. It was a welcome change of place. A relative had purchased a house in a suburb near the city, and what better way to housewarm than to roast a bird? Sitting at the kitchen island, drinking an effervescent wine, I watched the raw body cavity get stuffed with garlic cloves and whole lemons, the little legs get trussed to keep the insides inside. The smell of the bird roasting turned me and thrilled me at once; this, I suppose, is hunger. That night I went back for seconds and thirds and ate myself to the borderline of sick.The next day we decided to go out, to visit another surrounding suburb. I changed out of sweatpants. My mother popped a fresh pot of drugstore face wax into the high-set microwave, a standard going-out beauty procedure. The timer beeped. I didn’t realize the wax had been heating for as long as it had, or that it had liquefied and broiled. “It might be hot,” my mother said, but by then I’d already tiptoed up to reach the little plastic pot, which tipped over and spilled a stream of hot wax onto my left hand.I screamed, but only after a moment of shock did pain sear me. Someone used a shirt sleeve to wipe the wax off my hand, and with it, layers of epidermis and dermis. Whatever skin remained pooled around the edges of a raw, red core, and there hung like loose drapes. My unburned fingers had fused together with hard wax. My vision blurred; I ran my hand under a stream of cold water. I made the mistake of putting it in a bucket of ice, the way seafood is displayed in supermarkets. EMTs arrived. One was kind and broad-chested; I burrowed into him. In the back of an ambulance he injected me with fentanyl. We played a game of what-is-your-pain on a scale of 1 to 10, how about now, are you sure—you’re sure?A resident in the ER cut away the hardened wax and dead skin with scissors and pliers, plus a chemical he assured me had the power to dissolve asphalt. The wax, alarmingly, didn’t come off easy. “Who knew women’s face wax was so strong?” I said, delirious with painkillers. The resident laughed and covered the burn with a dry napkin.Up in the burns ICU, where I was transferred, my nickname among nurses was the woman with the hand, which all things considered isn’t a bad woman to be. My burn was determined to be second-degree and partially thick, a blistering depression that stretched over my index finger and thumb, all over the adjoining skin, and bits of my palm and palm line. Each time I explained my accident to a medical professional, I was aware of how ridiculous I sounded: I was waxing. Doctors discussed salvaging the functionality and mobility of my hand; they made game plans to make sure that my fingers didn’t heal stuck together. Meanwhile I fussed over aesthetics, cried over the ugliness of the wound. I liked to think of the open skin as a window through my melted surface. What festered there oozed up at me, animal and alive.“Will it scar?” I asked my nurse.“Well,” he said, as he wrapped me up with gauze and a splint, “At least it wasn’t your face.”Burn pains are strange pains. They hit you with the same uneven terror as heartbreak: The moment of impact is so excruciating your vision crosses. Under the sway an Oxy tablet that intensity briefly numbs. And then, just as soon as you start to sleep easy, the pain hits again, and then again, a recurring pattern that each time feels like being burned anew.Perhaps even stranger than burn pains is burn healing. There are, of course, the basics: here is how you wrap and clean the wound; try to use your fingers instead of babying them, squeeze odd objects to regain strength. And then there was this: I was instructed to eat large quantities of meat. This would help me grow new skin faster. “At least while the wound is open,” my doctor said. He talked steaks and chicken breasts and my mouth soured. Looking at the burn made me queasy—how it took the meat of one animal to build up that of another. I told the doctor I’d been on a vegetarian kick as of late. I asked him about the efficiency of pea proteins.“This is probably not the time for that,” he said. The nurse beside him nodded and rolled up his sleeve to show me a small burn scar of his own.“Me, I didn’t take good care of it,” he said. “And you—don’t you want to heal?”I told both of them that I did. And I wanted to, in more ways than one. The doctor cleared me to eat, and within an hour a large unsalted fillet of fish arrived by my bedside, the flesh white all over, slightly purplish where previously the bones had been. I salted it with some cafeteria salt packets, peppered it, and then devoured it. When all the fish was gone, I drank a cup of chicken soup. Come morning, I ate several strips of soggy turkey bacon off a styrofoam plate and downed every last curdle of egg-carton scrambled eggs.Maybe it could be a metric: the hungrier I am, the happier I am. I fell asleep without missing anyone or anything except my own skin.I took an Oxy and fell back into a hospital pillow, oddly satiated. The reemergence of an appetite wasn’t natural, per se—I had to force it, and occasionally gag through it—but it was a clear task toward healing, and I pursued hunger with the hopes that maybe it could fix me. Maybe it could be a metric: the hungrier I am, the happier I am. I fell asleep without missing anyone or anything except my own skin.Come morning my cell phone rang. It was my former partner; I picked up with my good hand. He had heard about the accident and wanted to wish me well. That’s kind of you, I told him, even though I think we both know that everything we say to each other is fraught with the subtext of unkindness. He could be there for me as a friend, he said. The words were formal where once we had been so familiar. He listened quietly as I started crying. Why had I picked up? I had been doing so well; I had been so hungry. A calm as thin as fish skin had washed over me, and then the phantom comfort in his voice cracked something open again. That something was me—I kept opening for him.And I would keep on opening for him. But when I stretched my fingers wide, I saw a part of me that quite literally had to close. Once out of the hospital, I stocked my fridge with proteins of varying queasy shapes and sizes. I became a meat-ful woman. After two or three weeks, a sheen of baby skin had grown over the bright pink of the burn wound. It was a thin boundary at best—my doctor gave me two camel-colored Isotoner gloves to protect it—and yet it was a boundary all the same. Months passed, and a few spots of color cropped up on the oblong shape of a scar, darker than the skin that had lived there before. The spots were evidence that the skin that was growing back was growing thicker, more impermeable with every passing week, as a heart is perhaps not.One year and a pandemic later, I know these losses of skin and men are infinitesimal. But their pains are still recursive. In isolation, and even before it, I feel them. I have reached for my lost man more times than I’d like to admit. Each conversation with him is tinged with the sadness of arriving at the last page of a good book; I am torn between the necessity of shutting it, and the desire to skim the best passages again. My lost skin has grown back, in pieces but not entirely. The color that’s returned is enclosed by a dark brown edge. I trace it and wonder, What will it look like, this second skin, when it’s grown completely, and grown without him? I don’t want to draw that boundary but I draw it, and behind it he disappears.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureMaking Amends With Lean CuisineBy Mariella RudiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-08", "author": ["Condé Nast", "Bindu Bansinath"]}