{"id": "1972a353f896fc5ef880c3561760841c", "url": "https://www.bonappetit.com/story/airport-bar-date-night", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Why Drinking at an Airport Bar Feels So Romantic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Liminal Romance of Drinking at an Airport BarThe drinks aren’t top shelf, but the airport bar is where my husband and I get to pause and connect with each other.By Caitlin Raux GuntherFebruary 11, 2022FacebookTwitterEmailIllustration by Tamara ShopsinFacebookTwitterEmailIn “Underrated,” we review the ordinary rituals we build around food. Next up: drinking at airport bars.We were going to miss our flight out of Venice. My husband, Guillaume, and I were on the last leg of our honeymoon trip from Catalonia to Italy, and we’d already left the honeymoon phase. The night before, at an outdoor terrace in Venice with swingy jazz in the air and expertly stirred negronis in our hands, we had been arguing. (Our subject was an Instagram post; trivial now, but very consequential in the moment.) The sky turned inky, a third round of negronis dried up, and we ended up at a tourist trap near the canal, twirling forks of spaghetti carbonara while the tension hung thicker than gelato. The next morning we snoozed through our 6 a.m. wakeup call—and after navigating a maze of narrow streets and one requisite journey by boat-taxi, heads throbbing from the previous night’s cocktails, arrived late to the airport check-in counter. That was when the ticketing agent informed us that the name on my reservation did not match the name on my passport.In an instant our conflict slipped away as a larger, more pressing issue materialized before us. Wordlessly, as if following some invisible choreography, Guillaume and I snapped into a single synchronized unit. I forgot my head’s dull ache and began rattling off reasons for the discrepancy. “We just got married,” I said, praying our Italian gatekeeper would take pity on honeymooners, “and I changed my legal name but the reservation shows my birth name.” In his decent Italian, Guillaume peppered in words that I didn't understand but sounded very charming. The agent’s mouth curved into a tentative smile. I exhaled.Somehow we advanced to the other side of security. Victorious and thirsty, we perched at the bar of a concourse pizza restaurant and ordered two glasses of prosecco. People hurried past hauling their roll-y suitcases. A solo traveler idled by the illuminated grab-and-go food counter near us. Amid it all we clinked our flutes and took a celebratory sip. The wine was too sweet and the bubbles almost nonexistent, and yet I felt effervescent, buoyed by our successful tag team. I let my eyes trace the profile of my husband’s tanned face as he sipped the barely fizzy drink. At perhaps the most unromantic bar in Venice, I was filled with love and gratitude—for the man who was legally bound to be my lifelong travel partner, and for our continued journey together.My husband and I might throw down at a quaint restaurant as a gondolier paddles past in his striped shirt and straw hat. We might sit in silence, post-argument, over sumptuous plates of pasta. But for us, the airport, stripped of any ambience, tends to be a happy place. It’s where we let the everyday worries slip away to focus on our greater mission: making it through security with our personal effects intact and arriving at our gate with some minutes to spare. And when we can spend those minutes sharing a quick drink before takeoff, we relish the imminent sense of adventure, of leaving the familiar behind in pursuit of the new. It’s the feeling of being fully present for each other for a brief window of time, until an overhead announcement summons us to begin boarding.In the nearly five years since that quixotic honeymoon, we’ve moved to Paris and had a baby. With the pandemic, we fly less frequently, and when we do, between the N95 masks and the milk bottles and the tote bags stuffed with toddler paraphernalia, we don’t travel as light. But a pit stop at an airport watering hole remains our sacred ritual—the drinks might not be top shelf, but it’s a place where my husband and I pause for a moment and reconnect.Recently, we spent time in New York to visit my family. When we arrived at JFK for our return flight to Paris, I felt a certain heaviness as I reckoned with the uncertainty of when we’d return and what the world would look like then. Not to mention, Mimi, now a fiery two-year-old, had been battling a cold and her parents (us) were ragged from lack of sleep. But as we neared the security line, I watched my husband deftly break down the stroller. My heart swelled. I removed my shoes and coaxed our precious cargo, Mimi, through the metal detector. As I waited for Guillaume on the other side, I thought, We really do make a good team.In the concourse, we parked ourselves at a row of seats and under the bright airport lights ordered drinks from an iPad. Mimi plunged french fries into a pool of ketchup. I sipped an oaky Chard poured from a mini bottle. Guillaume took a swig from a draft beer. Nearby a line grew outside of the women’s bathroom. The noise around us dissolved into a steady hum: luggage gliding, heels clicking, the occasional whir of a distant airplane.I looked at my husband and saw a reflection of myself—older and paler than journeys past, but carrying so much more love with us. We finished our drinks and headed toward the gate, ready to get in line for another flight together.Explore Bon AppétitLifestyleCultureUnderratedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-11", "author": ["Condé Nast", "Caitlin Raux Gunther"]}