{"id": "1980395ac149014b5179ce2a4ceeface", "url": "https://www.bonappetit.com/story/how-to-make-refried-beans", "year": 2019.0, "month": 9.0, "day": 5.0, "content": "Refried Beans With 3 Ingredients and 15 Minutes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Make Refried Beans in 15 MinutesThere's nothing stopping you.By Sarah JampelSeptember 30, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWhen Rick Martinez told me that his Chicken Tinga Tostadas (make them!) would have a layer of refried beans, I planted my feet, grabbed Rick by the shoulders, and said \"Rick! Old buddy, old pal. You know this is a Basically recipe, right? We have to keep things simple.\"The refried beans,  I figured, would involve, like in this classic Rick recipe, a) simmering dried black beans for hours and b) multiple pork products. (Either that or they'd come from a can. And while I personally don't mind canned refried beans, that didn't seem like Rick's style.)Well this story has a happy ending because Rick proved me wrong (definitely not the first time). His porky refried beans are made with three ingredients—onion, bacon, canned black beans—and take all of 15 minutes to come together.Here's how it goes: You slice bacon and add it to a skillet with chopped onion. Set the heat to medium-high and cook, stirring occasionally. As the bacon fat renders, the strips will get crispy and the onion will soften and brown. Lower the heat and add the beans and—here's the kicker—their liquid. Many recipes ask you to drain and rinse canned beans, but in this case, that liquid sort of replicates the starchy cooking broth you'd get if you had boiled the beans from dry. It helps make the final product thick, creamy, and luscious.Simmer the beans for about five minutes until some of that liquid has boiled off, then get to smashing. A potato masher will do the most thorough job, but a wooden spoon will work in a pinch. Stop when you've reached a spreadable consistency that's still got some texture.Now that I know how simple it is to make refried beans, no burrito, taco, enchilada, pupusa, or, yes, tostada, will go un-beaned. I will use refried beans as a dip for tortilla chips. For bagel chips, even! Who am I kidding? I'll probably just eat them with a spoon. And since I don't eat meat, I'll use a little olive oil in place of bacon to sauté the onion, and I'll add some smoked paprika to introduce the smokiness that cured pork would otherwise provide. I know it's not exactly the same, but it gets the job done—and I think Rick would be proud of my resourcefulness.Get the recipe:Chicken Tinga Tostadas With Bacony Black BeansEverything you could possibly want in a tostada (and then some): shredded chicken smothered with a smoky, spicy tomato salsa, bacony refried beans, and a smattering of cilantro and cheese.View RecipeExplore Bon AppétitBlack BeansMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-30", "author": ["Condé Nast", "Sarah Jampel"]}