{"id": "19880bbee112d89a0dbe6e585e72ff0a", "url": "https://www.bonappetit.com/recipe/ginger-citrus-cookies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Ginger-Citrus Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGinger-Citrus CookiesBy Marcus SamuelssonDecember 1, 20204.0(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“My grandmother Helga and I used to make a version of this recipe together every holiday season,” writes Marcus Samuelsson, chef of Red Rooster in Harlem, New York, and author of the cookbook Aquavit and the New Scandinavian Cuisine, where these cookies were first published. The fragrant spices in the gingersnap dough against the bitterness of the chopped candied orange peels are exactly what I want this time of the year.” Blanching the citrus peel in several changes of boiling water removes bitterness while still leaving plenty of bright flavor behind.IngredientsMakes about 28Candied citrus peel2cups 1\"–2\"-wide strips lemon, lime, orange, or grapefruit zest (pith removed)2cups granulated sugarCookies1tsp. ground ginger½tsp. ground cardamom½tsp. ground cinnamon¼tsp. ground cloves3½cups all-purpose flour1Tbsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. freshly ground white pepper10Tbsp. unsalted butter, room temperature1cup granulated sugar½cup (packed) light brown sugar2large eggs¾cup mild-flavored (light) molassesPreparationCandied citrus peelStep 1Place citrus zest in a medium saucepan and pour in cold water to cover. Bring to a boil; drain. Repeat process 2 more times.Step 2Combine sugar and 2 cups water in same saucepan; bring to a boil, stirring to dissolve sugar. Add citrus zest and bring just to a simmer. Reduce heat to low and simmer very gently until peels are translucent, 30–45 minutes. Remove from heat and let citrus zest cool in syrup.Step 3Drain citrus zest and finely chop. Spread out on a rimmed baking sheet; let sit until dry.CookiesStep 4Preheat oven to 350°. Toast ginger, cardamom, cinnamon, and cloves in a small skillet over medium heat, stirring with a wooden spoon, until fragrant, about 2 minutes. Remove from heat.Step 5Sift toasted spices, flour, baking soda, salt, and white pepper into a medium bowl or onto a sheet of wax paper.Step 6Using an electric mixer on medium-high speed, beat butter and both sugars in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating well after each addition and scraping down sides of bowl as needed. Beat in molasses. Gradually add dry ingredient in 2 batches, beating on low speed to incorporate after each addition. Stir in 1 cup candied citrus peel.Step 7Drop dough by rounded tablespoons between 2 parchment-lined baking sheets, spacing 2\" apart. Bake cookies until tops feel firm when lightly touched, 10–12 minutes. Let cool on baking sheets about 2 minutes, then transfer to a wire rack and let cool completely.How would you rate Ginger-Citrus Cookies?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleMade these cookies today and followed the advice of doubling the spices and they turned out delicious. Only had dark molasses so they are a little darker but great!Pauline OWhittier, CA4/29/2021Pretty good! Like other reviewers, I think the ratios may be a little off; too much flour, not enough spice. Still good though, and if I make them again I'll play with the portions.KelseyVermont 1/23/2021These are so good! The candied citrus peel is wonderful with the spices - peeling the citrus without the pith takes a little practice but can be done with a potato peeler - you will soon get the knack of i!. Prepare the candied citrus the day before you bake, then the process doesn't seem as long. Once you have your citrus strips candied, let them drip dry in a strainer and chop them very finely - very important to get the good chewiness you want. And save the delicious syrup - can be used to add a good sweet citrusy taste, for ex. to marinades, to drizzle on a pound cake for a great taste, add a little to your salad dressing to give a nice citrus balance to the acidity...maybe invent a new ice cream! I might try making them a bit smaller next timeRobin Lejre,Denmark1/2/2021I thought the candied peel was a bit too chewy/tough, but overall the cookie was pretty good!Anonymous12/25/2020Just tasted these cookies and they are wonderful! I love the burst of citrus and the tongue tingle from the white pepper. Definitely used fresh spices. Used an Oxo peeler to get a nice rind and used all of it! Next time I may try for a finer chop by processing the rind along with some of the sugar. Now I get to decide what to do with that syrup... cocktail ideas? MJoPort Townsend, WA12/24/2020I wanted to like these cookies. I wanted to love these cookies. Ginger cookies are hands-down my favorite. \nBut, the TIME it takes to make these - frankly isn’t worth it. \nSomething also feels off with the ratio of ingredients - the flour in particular. \nI would amp up the spices big time if I made it again; they barely cut through in the finished cookie when following the recipe. \nThey’re good, but not great. And not worth the effort to candy all the citrus. JohnHudson, NY12/23/2020As a guide, it took me 5 lemons, 1 orange, 1 mandarin, 1 lime and 1 grapefruit to get 2 cups of citrus peel. Took 2-3 hours total.  A lot of work, but worth it ultimately.Anonymous12/22/2020That’s a LOT of flour. But no weight supplied. I’m really reluctant to try this recipe without weight measurements. Come on, Bon Appétit, that should be mandatory for all baking recipes. Looks lovely, though.NeedMoreCatsNew York12/19/2020The best ginger cookie recipe you will ever make!!! I ended up doubling all the spices because I like a spicier cookie and it turned out fantastic! Also it’s good that the candied citrus recipe makes more than what it calls for in the recipe, so you can use the candied peels for another purpose, or to make the recipe again.JuliaToronto, Canada12/8/2020Explore Bon AppétitCookieDessertScandinavianEuropeanGingerHerbs & SpicesCitrusFruitWinterSnackNut-FreeVegetarianBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}