{"id": "19897fd657918a0a47f5bb5a239a4285", "url": "https://www.bonappetit.com/story/how-to-make-vegan-creamed-anything", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Make Vegan Creamed Greens, Vegan Creamed Mushrooms, and Vegan Creamed Corn with Nutritional Yeast and Coconut Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Vegan Creamed AnythingNooch to the rescue.By Grace KellyJanuary 7, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As a descendent of Lithuanian immigrants, sour cream runs through my veins. Eastern Europeans are known for their love of dairy. In Simon Bajada’s Cookbook Baltic, he writes, “Of all the exceptional produce celebrated within the region, the Baltic love of dairy cannot be overstated.” My family is no exception.Cream cheese, sour cream, farmer’s cheese, cottage cheese, and butter have always had a welcome seat at the table. A tub of sour cream was always within arm’s reach of my great-grandmother’s pierogi, a welcome dollop of tang to cut through the dumplings’ richness, and one of my go-to after school snacks was a fruit dip made by mixing sour cream with brown sugar.But running concurrently with my love of all things dairy is the great, cruel irony that’s plagued me ever since that first spoonful: I’m lactose intolerant. Cue the tiny violin. Growing up, I pushed through the gastrointestinal discomfort and all its unpleasant side effects, but as I’ve gotten older, the ol’ stomach can’t handle the same quantities of dairy goodness it used to. And coupled with the moral weight of being an environmental reporter, let’s just say I have good reason to cut back on dairy.Andy Baraghani’s vegan creamed spinach uses a slightly different technique but has just as great a result.\nPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaBut it hasn’t been easy. What’s a bowl of chili without a dollop of sour cream? How can you make good pierogi without farmer’s cheese? While I remain stumped for adequate solutions to these dilemmas, I have stumbled upon a way to emulate the luxurious goodness of creamed vegetables—think spinach, mushrooms, or even poblano rajas—without dairy or even vegan cheese products.I happened upon the magic combination—coconut milk, miso, and nutritional yeast—by accident. My cousin and his girlfriend were moving to the West Coast and decided to clean out their pantry predeparture. I was gifted some low-salt salad dressings, sugar-free chocolate chips, and a shakerful of nutritional yeast (a.k.a. nooch). The salad dressings and sugar-free chocolate are still collecting dust in my pantry, but, when mixed with sautéed alliums, coconut milk, and miso, that nooch makes a cheesy, creamy (vegan) sauce for vegetables.It’s simple: Over medium heat, sauté 1 thinly sliced small onion or large shallot in 1 Tbsp. coconut oil until soft and golden, about 10 minutes. Whisk in 2 tsp. white miso and 2 tsp. nutritional yeast—you’re creating a sort of “roux” of flavor here; if it looks a little dry, add another tablespoon of coconut oil. Add 2½ to 3 cups of your favorite greens (or other vegetables), and cook, stirring, until starting to wilt, about 4 minutes. Stir in ¾ cup coconut milk (I like Aroy-D because it’s creamy and doesn’t separate), salt, and pepper, and simmer over medium heat for about 5 minutes, or until about a quarter of the coconut milk has evaporated (the mixture should become thick, creamy, and pale brown).You can swap out the greens for mushrooms to make a vegan stroganoff-ish sauce (add a teaspoon of soy sauce for depth), or for roasted poblano strips to make a vegan take on rajas con crema (add 1 tsp. each cumin and chili powder).Even if they invent some magical way (sorry, lactose pills don’t count) for lactose-intolerant folks to eat creamy, cheesy dishes without gastric distress, I’d still have my shaker of nooch at the ready for this versatile vegan cream sauce.Grace Kelly is a journalist and recipe developer based in Rhode Island. And no, she’s not related to the Princess of Monaco.Explore Bon AppétitBasicallyVegetableVeganCoconut MilkIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-07", "author": ["Condé Nast", "Grace Kelly"]}