{"id": "199babe2204c210ca624970ba81dcf35", "url": "https://www.bonappetit.com/story/adult-acne", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Adult Acne Wrecked My Self-Esteem. Here’s How I Dealt. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAdult Acne Wrecked My Self-Esteem. Here’s How I Dealt.My mood fluctuated between ecstasy and depression, depending on the state of my fickle skin.By Ali FrancisFebruary 22, 2019FacebookTwitterEmailIllustration by Laura CallaghanFacebookTwitterEmailI retired my pimple potion just before Christmas. I was about to fly to Hawaii to spend ten days with my family, and I didn’t have time to run to the store for a new one. And it would have been too much liquid for airport security to handle anyway. Up until that point, the potion had been the second line of defense in my D.I.Y Pimple Eradication Program (PEP), the completely unscientific regime I designed based on my many late nights spent Google-ing “Products that fix adult acne,” and “Why do I still have pimples?”For the last six months of 2018, my nightly facial routine was a complicated affair. It started in the shower, scrubbing my skin with these scratchy blue gloves and a glob of equally scratchy exfoliating wash. I followed this with a zingy swipe of pore-zapping toner and an oil-free moisturizer, then I’d chug a glass of warm lemon water. Before dabbing each angry sore with liberal globs of acne cream, I’d assess the damage.Small red zits circled my chin, and the odd inflamed pore flecked across my nose. A constellation of huge, supposedly-blind pimples lurked under the skin on my forehead like cranky crocs that would shrink and balloon in sync with my period but never really disappear. I’d take a headcount of how many had healed a bit, and how many were getting worse. “To squeeze, or not to squeeze?” was always my question.Despite taking to the PEP routine with fervor, playing whack-a-mole with my face full of zits was not exactly what I envisioned doing with my late twenties. But chronic endometriosis has made my body far less predictable, and not just in the sense of needing to locate a quick tampon at the beach.Endometriosis was kind of like an Australian toilet flush for me; everything happened in reverse. Instead of exiting via the evolutionarily perfect highway, my menstrual stuff flowed back into my internal organs every month and stayed there. Left untreated, it can be pretty scary stuff. After not getting a single period between ages 19 and 23, progesterone shots that induced continuous bleeding for months, and a series of pill-induced anxiety attacks, I finally had surgery to remove the mossy uterine growths in my abdomen.That surgery was almost five years ago, and my period has been basically regular for a bit over a year now; womanhood reinstated! But something else came with it: acne. Up until now, clear skin had been my one true vanity, the rock I clung to in a sea of hormonal drama.To be fair, I don’t even know if seven weird-ass recurring pimples count as acne, but it certainly felt like I was wearing the skin of a teenage Domino’s delivery guy. My self-esteem got so low during that time that my mood fluctuated between ecstasy and depression, depending on the state of my fickle skin. All I could focus on was my face, and I was always more tuned in to my flaws than my strengths. What began as frustration morphed into a deep-rooted fear that my funky face was making me unattractive and unlikable.There seem to be few subjects that aren’t appropriate for brunch conversation these days. STDs, anti-anxiety meds, our poop habits. Relatively benign in comparison, adult acne still seems to be met mostly with awkward silence. Whenever I did see celebrities come out of the pimple closet, they were peddling products alongside stories about how they had cleansed themselves of impurities. The perception on the web wasn’t that acne didn’t exist for adults, it was that it shouldn’t.I knew, intellectually, that my skin was a mess because my body was experiencing puberty 2.0. However, because of the collective belief—that an adult with bad skin, like doing laundry, should be capable of autonomous recovery—I accepted the feelings of failure and unworthiness when my breakouts persisted despite my best efforts.Then, on my flight to Hawaii, I read bell hooks’s earth-shattering novel, All About Love: New Visions. Her words opened my mind to the idea that self-acceptance and love, something I deeply wanted for myself, could never actually exist while hate was present, and that harm negates healing. “To truly love we must learn to mix various ingredients,” she writes. “Care, affection, recognition, respect, commitment.” I’d figured my PEP routine counted as “care,” but hooks helped me realize that “loving” actions are cancelled out when coupled with anger and negative self-talk. It’s okay to want to better myself, but I had to do it out of love, not out of disappointment or insecurity. I could desire change without being self-hating, but it had to start with a foundation of genuine confidence—not the fleeting (and addictive) kind that comes from a magic acne cream or a sparkly Instagram filter. I spent the rest of the ride making a list of things I wanted to do for myself, while cathartically weeping to Crazy Rich Asians.I wish I could say I had a miraculous recovery, but that’s not what happened. Low self-esteem isn’t something that goes away on a plane ride; it takes time and effort and love. Since that trip, I’ve taken up watercolor painting, because trying new things makes me happy. Instead of treating my face like a piece of furniture I want to sand down before staining, I’ve switched to a gentle cleanser and moisturizer and otherwise leave my skin alone. (Okay, I do still love the gloves.) I wear mascara because I like my eyelashes, but I’ve ditched the foundation. My diet consists of foods that are colorful and delicious because I want my insides to feel colorful and delicious. Drinking copious cups of water while sitting in a bath is my happy place (I am Pisces and PROUD). I try to run or go for a long walk every day as a reminder that the world is big and beautiful. And I fiercely safeguard eight hours for sleep.Some would call all of this self-care. But that doesn’t fully cover it. I think each of these small changes represent acts of love, designed to rebuild a battered self-esteem. And yeah, my face looks a lot better right this very moment, but who the hell knows what’s in store for next month. Regardless, my skin’s thick enough to handle it.Buy it: Glowbiotics MD Probiotic Revitalizing Cleanser, $32. Glowbiotics MD Gentle Probiotic Cleansing Lotion, $60.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautySelf CareessayRead MoreLifestyleHow I'm Decoding My Period and Treating My PCOS Through FoodBy Lauren KodiakRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Ali Francis"]}