{"id": "199ddf35376e7087de45d33b59637478", "url": "https://www.bonappetit.com/story/sizzle-platter", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Sizzle Platters are the Versatile, Durable, Inexpensive Tool That Every Kitchen Needs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWithout a Stack of Sizzle Platters, My Kitchen Is IncompleteThese are the wind beneath my wings.By Sohla El-WayllyApril 29, 2020FacebookTwitterEmailMICHAEL GRAYDON + NIKOLE HERRIOTTFacebookTwitterEmailWhile the set-up of my home kitchen looks very different from that of a restaurant, there’s one thing that has remained from my years as a line cook: the stack of sizzle platters that’s always by my side. And it’s not going anywhere.What’s a sizzle platter, you ask? Small aluminum or cast-iron dishes that can be ovular or rectangular (like an ultra mini baking sheet), they’re endlessly useful and incredibly durable. In a restaurant, these little platters take a lot of heat, constantly tossed under broilers and salamanders for cooking steaks or charring vegetables—and that's how you know they can handle anything in your home. Here are a few reasons you need a stack of your own:Cooking for One or TwoAt home I’m usually cooking for two, and sizzle platters let me make the most of my limited oven space. Because I can roast multiple things at once on several small platters rather than all together on one big baking sheet, each item can go in and out of the oven just when it needs to. I can give a couple of chicken thighs a head start so that they can get tender and crispy, then add the asparagus sizzle plate to the party later on so that both components are ready at the same time. If I’m making dinner for just myself, I'll use a sizzle platter to broil just one portion of shrimp (or fish or tofu) and keep cleanup fast and easy.Toasting Nuts and SeedsGiving nuts and seeds a few minutes in the oven deepens their flavors and improves their texture—and it provides more even cooking than the stovetop. But I can’t justify clogging up the oven with a big sheet tray to toast just a handful. Sizzle platters leave enough room for the rest of the meal to get its oven time, too.Michael Graydon + Nikole HerriottMise en Place-ing Like a ProThere are times when mise en place is especially important, like if you’re making a stir-fry, an unfamiliar recipe, or an elaborate, multi-component meal. That’s when I’ll take the time to measure and prep all my ingredients before I get cooking, and sizzle platters are the best for holding and organizing it all. Who wants to wash countless small bowls when you can make neat piles on a few sizzle platters instead?!Dry Brining MeatWith a small wire rack set inside your sizzle platter, you’ve got the perfect setup for dry brining one or two portions of meat. The small footprint of a sizzle platter fits easily in any fridge, while the matching mini rack keeps the meat from hanging out in its own juices.Corralling Your UtensilsI like to keep one sizzle platter right beside the stove as a landing zone for dirty utensils that are currently in use. I can plop my wooden spoon there when it’s not busy stirring or park my rubber spatula when it needs a break. Unlike a traditional spoon rest that can only accommodate one utensil at a time, a sizzle platter can fit any number of small tools, from a fish spatula to my favorite tongs.Maybe a sizzle platter isn't as cute as an official spoon rest, but I ask you: what else can an official spoon rest do? I may be cooking at home rather than in a restaurant, but each piece of equipment must still earn its keep, and my sizzle plates are anything but slackers.Buy it: JB Prince Stainless Steel Rectangular Sizzle Platter, $10 on AmazonBuy it: Winco APL-11 Aluminum Sizzling Platter, $10 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-29", "author": ["Condé Nast", "Sohla El-Waylly"]}