{"id": "19ac139b2cd5857f334347ded66fd775", "url": "https://www.bonappetit.com/story/matt-and-kim-drummer", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "After a Traumatic Knee Injury, Matt and Kim Drummer Kim Schifino Is Back on Her Feet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAfter a Traumatic Knee Injury, Matt and Kim Drummer Kim Schifino Is Back on Her FeetFor the indie-pop musician, recovery was all about pilates, not painkillers.By Alyse WhitneyJune 15, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt’s impossible to listen to Matt and Kim without at least tapping your toes to the strong drumbeats. Live, the indie pop-rock band gets everyone off their feet—if not on stage alongside them. But the duo had to stop performing last year after drummer Kim Schifino suffered a knee injury during a music festival in March 2017, tearing her ACL and meniscus and bruising her bone while doing a stage jump she'd done hundreds of times before. It was the longest break they'd taken in their 14-year career.After surgery and a year-plus recovery, Schifino is healed, and the band is back on the road. They released a new album, Almost Everyday, in May, and the lyrics they co-wrote were “based on a lot of the shit I went through,” Schifino told me over biscuit sandwiches and kale at Marlow & Sons in Brooklyn. Schifino was fresh off two sold-out nights at Brooklyn Steel—one of the last stops of their six-week tour—but still made time for a Pilates session down the street at East River Pilates, an integral part of her post-op healing process. She talked about dealing with depression for the first time in her life, combatting panic attacks caused by painkillers, and finally getting back to drumming (and dancing) again.Photo by Emma FishmanYou injured yourself last March. How has it impacted you physically, mentally, and emotionally?It took me a little while to grasp we would be taking a lot of time off. And that I had to go into surgery. And it wasn’t going to be an easy recovery. And that after surgery, I would have nine months until I get the go-ahead to perform, and then two years until full recovery.It still hurts, but the most difficult part was that I got super depressed. I’m also extremely active and I couldn’t move around, so that was really heavy. Matt said that if it happened to him, he wouldn’t be excited, but the idea of getting to sit around, watch TV and do nothing was appealing to him. Whereas I was losing it on a daily basis because I just wanted to get out of bed and do what I want. I’m also really stubborn, so I tried to do everything on my own. After the surgery, I realized I couldn’t do that. It was about nine months recovery, all in all, and it was some of the worst pain I’ve ever been in. I didn’t do well on the painkillers. I started having panic attacks, so I had to go off them and was in a ton of pain.Photo by Emma FishmanHow you get through the pain—both mentally and emotionally?I cried. And I hate crying. I just gritted through it because there’s nothing I could do. When I started having the panic attacks from the painkillers, I would get these jaw shakes, and my teeth wouldn’t stop chattering. Matt would be like holding my mouth. Or I would wake him up in the middle of the night and be like, “You need to open every door and window. I can’t breathe.” This is what I don’t get. Percocet—not that cool. The [Future] song misrepresents it so much.We thought we were going start recording right away, but I was on a cycle that for six hours a day I had to be in a bendy thing for my knee. We ended up waiting two months to start writing, but I think I was good because I went through some shit, and then I had stuff to write about.You documented your entire injury and a lot of your recovery in a three-part vlog series. Have you gone back and watched the footage?I still have yet to watched the actual injury. When we were editing, Matt would be like, “Look away. Don’t watch this part.” I think at two years I’m gonna go back and watch it. The third and final part of the injury series we didn’t put out for a while. We took two months off the vlog because it just was too overwhelming when I was trying to heal.With drumming, did you lose any strength or forget anything?I forgot how to play so many songs. We have been playing these songs for years, but I would have to watch YouTube videos of us playing to figure out what I did at different parts of the songs. My arms weren’t as strong as they were from taking about seven months off.Dancing is a passion for you and a big part of your live shows. Do you remember the moment when you felt strong enough to dance?Downstairs in our Brooklyn apartment, I have a huge dance mirror. I didn’t tell Matt, so when he was sleeping, I would wake up early and try things out. There are some things I’m still cautious about it and don’t try because they don’t feel right, but by the time we went to shoot our “Forever” video in L.A., I felt ready. He asked, “Don’t push it, but do you think you could dance a little bit?” And then all of a sudden he looked up and saw me dancing and was so shocked. I wish I could have done more, but I just keep moving forward from one milestone to the next.You and Matt are together constantly. Do you have to find a way to carve out time for yourself especially when on tour?Before I got injured, I used to run, especially when we were touring. I don’t run as much now because it’s still a little heavy on my knee, but that was my moment of zen. To think and be away from everyone, and just kind of do my own thing. I miss that.How did you replace that moment of zen?While in Pilates, you are there with a bunch of people. But you’re so focused on yourself and listening to what the instructor’s saying and what position to get into. You’re just thinking about how your body feels. I just started it two years ago after a friend kept pushing me. She told me that Pilates was invented for dancers who were injured to keep working out, and after my first class at East River Pilates, I fell in love. After that hour in class...I feel lame saying it, but you feel centered.Chloe Gregor, Schifino’s Pilates instructor, assists her at East River Pilates.\nPhoto by Emma FishmanDo you feel more balanced overall now?I feel more balanced. I’m still, I think, a centimeter off. On tour, I do PT five times a week. Chloe [Gregor from East River Pilates] created a whole schedule for me to follow. It’s focused more on my thighs, hips, and calves—everything that works around the knee to hold it in place. I have this giant tub with a bosu ball, a Pilates ball, and bands to do exercises backstage. The reps are fucking tough. There’s one where I put a rubber band around my thighs and do 20 jumps with legs spread to keep tension on the band. And then 20 squats, and then you push your legs out and do that 30 times. I’ve tried to have some of the crew do the workout with me and they died. They’ll get through five reps and then tap out.Did you have a breakthrough moment where you felt like you were feeling like yourself again?Yes, but it’s so funny—I have those moments, and then they’re gone because I’ve now reached that point. And then I want be further ahead. I have those moments where I’m like, “Oh my God, remember when I could hardly walk?” Then, all of a sudden, I’m like, “Yeah, but I wanna run.” And then I’m running, but not at the pace I used to. It goes on and on. It kinda sucks, in a way, because I’m getting better, but I just want to be where I used to be. But I’ll get there soon.Explore Bon AppétitInterviewsHealthyishCelebritiesRead MoreLifestyleZoe Lister-Jones on Hiring an All-Women Film Crew and Being a ‘Bone Brothatarian’By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-15", "author": ["Condé Nast", "Alyse Whitney"]}