{"id": "19b0a18cd115b4e04bb76f2367b419ff", "url": "https://www.bonappetit.com/story/spaghetti-squash-feud", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "I Made the Mushroom Pasta. Now It’s Your Turn. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Made the Mushroom Pasta. Now It’s Your Turn.Two great new recipes, one great old one, and Jennifer Lawrence’s…wedding registry?By Alex BeggsSeptember 28, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Fun with mushroomsSorry Michael Pollan, not that kind. This is a family newsletter. And for my family (a cat, an aunt), I made Andy Baraghani’s new creamy mushroom pasta this week. Even with ¼ cup cream instead of ½ (my inside sources tell me Andy tried to get away with 1 cup), it was perfect. Even more perfect with a sprinkling of red pepper flakes.Make it! Creamy Pasta with Crispy MushroomsWant this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie Craig, food styling by Rebecca JurkevichAnother thing I madeBoth Christina Chaey and I made Claire Saffitz’s apple cake, though I went with pecans instead of walnuts in the nutty batter (my favorite cake batter in recent BA history). Chaey’s apples (Jonamac) were high in water and sunk, but mine (Honeycri$p) didn’t. This spurred discussion about the best apples for baking. A tip from Claire when you’re shopping for them: you’re looking for HARD, dense apples that’ll hold their shape, so if you press your thumb into it and it doesn’t indent, you’re good. If it does indent, you better buy that one and eat it as a snack. Above: the recipe photo. Below: Chaey’s (left) and mine (right).Copyright 2019. All rights reserved.Bake it! Apple-Walnut Upside-Down CakeBlankiesA lot of readers screamed “bed bugs!” “cooties!” when I professed my obsession with restaurant blankets. I just want to let y’all know that the restaurants dry clean the blankets often, please chill. If you get too chill, warm up with a nice brushed-cotton blanket at Angler in San Francisco!So exciting, so overwhelmingAs someone generally interesting in poring over your wedding registry and picturing what life is like inside of other people’s homes and hearts, the dropping of Jennifer Lawrence’s supposed wedding registry on Amazon was a huge moment in my week. It just felt so...fake. I’m sure it’s real, corporate overlords who make affiliate money from Amazon! The cheery, first-person copy-writing (“Cooking for two is always more fun!”) was missing that famous Jennifer Lawrence snap. Is that A COPPER FONDUE SET? I just want to let you know, for everything you click on and buy from this registry (consider a copper fondue set), Bon Appétit will make a cut. So please, I’m begging you, consider a copper fondue set.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiIt’s nug seasonA reader (Hi Taylor Kidd!) tagged me recently sharing a gleeful home scene starring POTATO NUGS, a.k.a. the best recipe from our Thanksgiving issue last year. Steam-roasted, pub-style potatoes that have the texture of a deep-fried cloud. Taylor, I believe, covered them in gravy, which is just gilding the lily. This is a PSA to remind you it is now burnished potato nugget season; act accordingly.Get the recipe: Burnished Potato NuggetsPhoto by The Voorhes for The New YorkerTell me more about WilburIt took me three days, but Tad Friend’s 6-month reporting on the Impossible Burger (and other new meat alternatives) in The New Yorker was riveting and I hope you read it too. I’d earlier dismissed Impossible thinking, “They send me too many press releases, I don’t trust that,” and “it’s high in all the bad-for-you artery-clogging ways meat is, why don’t I just eat beans,” but now I get it more fully, and it’s nice to realize your rigid convictions are probably, at least a little bit, wrong. “He has a potbellied pig named Wilbur at home that knows how to open the refrigerator” is an out-of-context quote I’ll leave for you here.Recipe comment of the weekOn Claire’s cake.Unnecessary food meme of the weekSpecial edition! This is Sarah Jampel’s “favorite meme” but otherwise, she said, “I don’t understand them.”Unnecessary food feud of the weekAlex LauUnnecessary food feud of the weekThe markets are stocked with heavy winter squashes and cute little honeynuts—but why are there only four Bon Appétit spaghetti squash recipes? A friend made it recently for me in a cheesy gratin. “I like it, especially given the cacio e pepe treatment [pictured above]” said food director Carla Lalli Music, “but not as a noodle alternative.” Soooo where are the RECIPES, CARLA? “This isn’t a keto magazine,” she replied. Ouch. Emily Schultz hasn’t eaten it since she roasted, shredded, and covered it in jarred pasta sauce in college. Seems for the best. Sarah Jampel lamented, “I was served spaghetti squash at a restaurant last night, underneath spicy cauliflower. I wish it weren’t there!” She backtracked to tell me she likes it “in general.” Sure. “It’s great for babies,” said Meryl Rothstein, “because you don’t have to cut anything.” “It’s the worst of all squash, hate it!” said Sohla El-Waylly, who finds it “watery, bland, and stringy.” A staffer who prefers to remain anonymous to avoid retaliation DMed me: “It’s f****** disgusting!” Another nameless staffer pointed to her father, the last remaining person on the Atkins diet, who looooves it as a pasta alternative. “All the butter and Parm in the world can’t save it because nothing can,” concluded Chris Morocco. I won’t string this along any further.Explore Bon AppétitBeggs NewsletterRead MorerestaurantsI’d Love a Blankie With My Meal, ThanksBy Alex BeggscookingThis One Rule Separates Good Baking Apples From The LosersBy Sarah JampelcookingClaire Saffitz Made the Apple Cake of Our DreamsBy Sarah Jampelrecipes7 Recipes to Get You Through Every Cooking Scenario This FallGallery7 SlidesBy Andy Baraghani and Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-28", "author": ["Condé Nast", "Alex Beggs"]}