{"id": "19c5ccdad6b00629d3bab1386f2dd17b", "url": "https://www.bonappetit.com/story/garlic-peeling-trick", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Garlic Peeling Trick - How to Use Hot Water to Easily Peel Garlic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Never Thought I'd Write About Another Garlic-Peeling Trick BUT…this one actually works!By Sarah JampelMay 20, 2020FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hi Basically readers,For me, one silver lining of quarantine is that I’ve been talking to more people about food—and thus, talking to more people in general—than ever before. It’s not just my colleagues these days. One friend I’d fallen out of touch with texted for the first time in nine months to ask me if I had a good Key lime pie recipe, and another emailed to get my thoughts on pancakes. (Summary: they’ll never be as good as waffles.) My mom has spent hours describing what she’s made for dinner (it’s always something from the New York Times LOL), an inquisitive stranger emailed me about the difference between dried and fresh dill, and someone who was much cooler than me in high school tagged me in her photo of Basically’s ricotta gnocchi.Want this letter before it hits the website? Sign up for our newsletter!I’m talking to more family members, friends, and potential friends than ever before (virtually speaking) because the topic that we have in common—the glory and drudgery of cooking—is also one of the only topics available. Which brings me here:One Good TipI Can’t Believe This Garlic Trick Actually WorksI was surprised and delighted to receive a text from an unknown number this week about a mind-boggling garlic peeling tip. This is what we “journalists” call an anonymous tip! Turns out the person was BA’s art director Christa Guerra, who had learned the technique (honestly, this one does deserve the moniker “hack”) from Nadiya Hussain on her show Nadiya’s Time to Eat: Let separated garlic cloves sit in very hot water for one minute, after which their skins will slip right off.Turn your peeled n' sliced garlic into chips!\nPhoto by Alex Lau“Please try it so I make sure I’m not insane and I’m not wrong,” wrote Christa, whose psychology reflects the times. So I tried it. And it worked great! It’s probably not time-efficient if you only need to peel a few cloves, but if you’re making, say, Chicken with 40 Cloves of Garlic, The Garlickiest Fried Rice, or Meera Sodha’s 100 Garlic-Clove Curry from Made in India, it’s a game-changer. I vastly prefer it to the metal bowl method.Just pull off their hats—no knife necessary.\nPhoto by Laura MurraySomething to Bicker AboutHow Do You Cut a Strawberry?On FaceTime recently, my in-laws asked me to weigh in on an issue they’d been arguing about for 24 hours: the proper way to cut a strawberry. (This is about the only issue I’m even remotely qualified to weigh in on.) They showed me the two methods, trying their best to not reveal whose was whose. For the first, you slice the strawberry right across the top, removing the stem and a small area of flesh; for the second, you angle the knife inwards, drilling out the core (a.k.a. hulling). The first technique is fast but wasteful, which is why I prefer the second for big strawbs, which have those watery cores. But for the little guys (the best guys!), I just pull off the stem—no need to slice at all. No tears were shed when I delivered the verdict.There's a good reason I didn't take a photo of these all rolled up.\nPhoto and Food Styling by Sarah Jampel Best Thing I Ate This WeekTemakiI’ve never made sushi at home because I don’t have access to a mat or to super high-quality fish I’d want to eat raw. (Also, I don’t know what I’m doing.) But after making a public vow to use the oldest ingredients in my pantry—namely, the sheets of roasted nori—it was time for temaki. (It was Christina Chaey who got the idea of a hand roll party into my head.) I roasted salmon, then flaked off the flesh into a bowl and mixed in soy sauce, sesame oil, mayo, Sriracha, rice wine vinegar, and sliced scallions. I spread seasoned sushi rice onto the nori, then layered on more scallions, gomasio, sliced avocado, and the salmon. It tasted great even though I did a really bad job rolling it up (I partially blame the aged seaweed). I’ll do better next time.Don't be jelly of this candy stash.\nMoment of AppreciationJelly BeansHere’s a fun way to spend 10 minutes (or 30 if you’re me!). Grab a selection of jelly beans. Tell whoever you’re with to close their eyes, give them one bean at a time, and ask them to guess the flavor. This is hard and fun. My husband, who has declared jelly beans the only beans he cares about, guessed one of five. I got zero of three (I guessed that two of them were cantaloupe but, in my defense, one was watermelon). I’ll do better next time.See you here next week!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Sarah Jampel"]}