{"id": "19cb2c0cd83101bf367bd0f9dc1384bc", "url": "https://www.bonappetit.com/story/buy-ethical-weed", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "How You Buy Weed Can Make the Cannabis Industry More Ethical and Fair | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYour Weed Buying Habits Can Make the Cannabis Industry More Ethical and FairThe history of cannabis in America is rife with racism and inequality. Here's how to use your spending power to fight for change.By Charlotte PalerminoApril 29, 2019FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailThis story is part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Check out their spring issue, and click here to read more about how to make cannabis delicious.To understand why buying weed is different from buying artisanal kale, you need to understand weed’s history in America. For decades, the media, politicians, and our schools have spread misinformation about what cannabis is and what it does, including that weed is a gateway drug (it’s not), that if you smoke weed you’ll go to jail (those chances are pretty low if you’re white), and that marijuana causes instant addiction (the research shows that, while cannabis can be addictive, tobacco and alcohol are more deadly and addictive, relatively speaking).Robyn Griggs Lawrence, author of Pot in Pans: A History of Eating Cannabis, explains how this misinformation started. In the 1930s, when the Federal Bureau of Narcotics (now the DEA) rebranded cannabis as “marijuana, a frightening ‘new’ drug used primarily by Mexicans and African Americans that could turn upstanding, middle-class (white) kids into helpless victims and raging monsters.” Anslinger’s racist campaign picked up steam with Richard Nixon, who classified cannabis as a Schedule One drug despite the fact that humans have used cannabis medicinally for millennia. In a 1994 Harper’s magazine interview, former domestic policy chief John Ehrlichman said, “We knew we couldn’t make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did.”Today, nearly 80 percent of people in federal prison and almost 60 percent of people in state prison for drug offenses are black or Latino. And according to the ACLU, black people in America are still four times as likely as a white person to be arrested for cannabis possession despite consistent usage rates. Even in states like Colorado, where weed is now legal for adult use, many people are still serving out sentences.So weed is more than a trendy lifestyle ingredient that happens to be great for anxiety, skincare, and pain relief; it’s long been a pawn for racism and oppression. The profits and tax revenue from cannabis have enormous potential to repair the wrongs by terrible leaders and racist policies, but we have to make sure that money actually goes to the right people and places. Collected from activists, dispensary owners, and black and brown people in the cannabis space, here’s how to buy ethical weed.Support organizations that are doing the workOrganizations like National Bail Out, Women’s Prison Association, Black Youth 100, Cannaclusive, Cage Free Cannabis, Drug Policy Alliance, Equity First Alliance, 420 Queer, and many more are doing the work to rebuild communities and ensure that incarceration stops. This work includes creating and funding prisoner reentry programs, paying bail, or investing in communities that have been heavily affected by drug-related incarcerations. Arissa Hall, a director at National Bail Out, an organization dedicated to ending mass incarceration, recommends the organization’s Mother’s Day initiative called #FreeBlackMamas, which aims to help incarcerated black mothers get out of jail.Support as many local and POC-owned businesses as possibleTo give back to communities hurt by the war on drugs, buy from those communities. “People are still reworking and rebuilding their lives decades after incarceration, people are still in prison, people are still dealing with prohibition, and communities that have been hurt need to thrive with legalization of hemp and cannabis,” says Emily Ramos, founder of High Mi Madre. Almost Consulting keeps an ever-growing directory of POC lead businesses, and you should always ask your budtenders about the ethics and diversity of the brands you buy. If they don’t know, look for a new brand. Cannabis educator, legalization activist, and non-binary afrolatinx model Aaliyah Ei says that research should be part of your shopping experience. “Ask your budtenders about the ethics or diversity of brands you buy, and if they don’t know, Google it—and maybe find a new dispensary,” they say.Shop at stores that are doing the work tooHold the stores and dispensaries you patronize to the same standard. “Ask if the brand, dispensary, or store is providing funds and donating to charities. They should be addressing the issues, not just promoting how cool it is to purchase or experience a product,” says Jen Seo, co-manager of LAPCG, a community-driven dispensary in Los Angeles.Vote with your ballotWhile a lot of brands and people will tell you to vote with your dollar, at the end of the day, buying green won’t stop global warming, and neither will buying ethical weed. “I believe anyone who is making money from cannabis has an obligation to work toward making sure everyone, everywhere, has the same right, and no one is being persecuted or imprisoned over the very same plant,” says Lawrence. Whether it’s attending a lobbying day with organizations like Drug Policy Alliance (check their website to see how, where, and when you can take action) or contacting your senators and representatives, if you want to see restorative justice you’re going to have to use your voice.Explore Bon AppétitHealthyishCannabisWomen in CannabisessayRead MoreLifestyleBefore You Buy CBD Oil Online, Ask These QuestionsBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Charlotte Palermino"]}