{"id": "19e26d7d5a6015484f2e19b9a1156587", "url": "https://www.bonappetit.com/story/instant-pot-max", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "The Instant Pot Max Is the Next Generation of the Cult Favorite and It's Coming This Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Instant Pot Max Is the Next Generation of the Cult Favorite ProductIt’s coming this spring.By Melissa MintonMarch 7, 2018FacebookTwitterEmailBlair Gable/Instant PotFacebookTwitterEmailIt seems like just yesterday that Instant Pot hit the scene and became the viral, seven-in-one pressure-cooking sensation it is now. But, as CEO Robert Wang told us at the end of last year, updates will be launching soon that include features you never saw coming. Behold the next-generation Instant Pot Max. Hitting stores this spring (official announcement TBD), the new model improves on the multi-tasking appliance, which can make quick and easy polenta, fast-forwarded Coq au Vin, and even yogurt.New features include (drumroll, please) canning, automatic stirring, new venting options, and a sleek new touch-screen update to the display. According to The Kitchn, the new Instant Pot will reach 15 pounds per square inch (also known as PSI, the unit of measure that determines pressure), which is typical for most pressure cookers but not for the OG cult favorite, which was designed to stay at a max of around 11.6 PSI. Automatic stirring is good news for set-and-forget risotto, and new options for automatic slow venting, a pulse of venting, or a quick-release vent address the needs of different dishes. All new features will make your life easier—and isn’t that what Instant Pot is all about? Plus, the touch screen. About time.Instant Pot Max will reportedly be available in May or June and will first be introduced in a 6-quart size only. The price tag is estimated to land around $200. If you’re not willing to pay an extra $100 for the latest and greatest, there are still millions (probably) of recipes you can try out with the tried-and-true favorite (might we let Mark Bittman suggest a few?).Related: How I Turned Slow-Roasted Short Ribs Into Pressure Cooker Short RibsExplore Bon AppétitInstant PotTrends + NewsRead MorecookingThis Is the Most Underrated Instant Pot FeatureBy Sarah JampelcultureInstant Pot's Nonstick Cooking Pot Is Finally Back In StockBy Elaheh NozaricultureHow to Clean Your Smelly Instant Pot Sealing RingBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Melissa Minton"]}