{"id": "19e372fdea96b32dc6ab8c28efe0b1c4", "url": "https://www.bonappetit.com/recipe/mushroom-youfan", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "Mushroom YouFan (Taiwanese Sticky Rice) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMushroom YouFan (Taiwanese Sticky Rice)By Jessie YuChenJanuary 30, 20224.4(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova. Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintYouFan might be my favorite rice dish of all time. This Taiwanese steamed sticky rice dish is made with glutinous rice mixed together with lots of savory seasonings and often dried ingredients such as dried mushrooms, dried shrimp or scallops, and Chinese dried sausage. While you can commonly find youfan on the streets of Taiwan, more elaborate versions are often reserved for special occasions such as Lunar New Year. YouFan can be time- and labor-intensive to prepare, but this streamlined version is easy to prepare at home using equipment you likely already have (you’re welcome). You’ll need either a rack that can fit inside a large pot or some tin foil to form into balls for a makeshift steaming “rack.”I love using larger dried shiitake mushrooms here to make sure there's lot of mushroom in every bite; if you can only find smaller ones, just use a few more to compensate. The umami of the mushrooms is complemented by seasonings that pack a punch, such as nutty black sesame oil, aromatic fried ginger, and complex-tasting aged soy sauce. The optional small dried shrimp (available at Asian grocery stores and online) adds even more intense umami flavor to the youfan, but you can omit it to make this dish vegan. This dish has a special place in my heart, and I hope it will make it onto your dining table sometime. —Jessie YuChenSee Jessie’s recipes for Jessie's Special Steamed Whole Fish and Mochi-Stuffed Jujubes (Soft Hearts) to complete your Lunar New Year feast, and read about their favorite Lunar New Year traditions here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronHeatproof Measuring Cup$18 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonLarge Pot$55 At AmazonZojirushi Rice Cooker$55 $45 At Nordstrom RackIngredients2–4 servings10large dried shiitake mushroom caps2Tbsp. small dried shrimp (optional)2Tbsp. vegetable oil12\" piece ginger, peeled, thinly sliced2cups long- or short-grain glutinous rice (such as Koda Farms Superior Short Grain Sweet Rice), rinsed¼cup store-bought or homemade fried shallots¼cup dry rice wine (such as michiu or sake)2Tbsp. black sesame oil or toasted sesame oil, plus more for serving2Tbsp. Kimlan aged soy sauce or regular soy sauce½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1tsp. freshly ground white pepper1bunch cilantro, coarsely choppedPreparationStep 1Combine 10 large dried shiitake mushroom caps and 2 Tbsp. small dried shrimp (if using) in a medium bowl and pour in 2½ cups hot water. Let sit at least 30 minutes and up to 1 hour to rehydrate.Step 2Remove mushrooms from liquid and squeeze out liquid over bowl; place on a cutting board. Drain shrimp, reserving soaking liquid; set aside separately. Remove stems from mushrooms; discard. Thinly slice mushroom caps; set aside.Step 3Heat 2 Tbsp. vegetable oil in a wok or large skillet over medium-high. Cook one 2\" piece ginger, peeled, thinly sliced, in a single layer, turning halfway through, until golden on both sides, about 4 minutes. Push ginger to one side of pan and add reserved sliced mushrooms and dried shrimp (if using) to empty space. Cook, stirring occasionally, until golden brown and fragrant, about 4 minutes. Add 2 cups long- or short-grain glutinous rice, rinsed, and ¼ cup store-bought or homemade fried shallots and cook, stirring often, until well mixed but without rice browning, about 1 minute. Transfer rice mixture to a medium heatproof bowl (use one that can fit entirely inside a large pot with a lid).Step 4Add ¼ cup dry rice wine (such as michiu or sake), 2 Tbsp. black sesame oil, 2 Tbsp. Kimlan aged soy sauce or regular soy sauce, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, 1 tsp. freshly ground white pepper, and 2 cups reserved soaking liquid to rice mixture and stir well to combine. (Make sure the mixture fills no more than two thirds of the bowl since the rice will expand as it steams).Step 5Set a rack or 3 tinfoil balls in a large pot (this will keep the bowl of rice from touching the bottom of the pot; you want it elevated above the water when you add it); pour in water to come 2\" up sides of pot and bring to a boil. Place bowl on rack (keep the bowl uncovered so steam can circulate into the bowl as the rice cooks), cover pot, and steam rice mixture until liquid is absorbed and rice is tender, 35–40 minutes. Remove from heat and let youfan sit (still covered) 10 minutes.Step 6Alternatively, if you have a rice cooker, transfer rice mixture to cooker. Add ¼ cup dry rice wine (such as michiu or sake), 2 Tbsp. black sesame oil, 2 Tbsp. Kimlan aged soy sauce or regular soy sauce, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, 1 tsp. freshly ground white pepper, and 2 cups reserved soaking liquid and stir well to combine. Close cooker and steam rice mixture (on the white/sweet rice setting if you have it) until liquid is absorbed and rice is tender, 30–50 minutes, depending on the brand of your cooker. If rice is still not cooked through by the time the liquid is absorbed, add ¼ cup water and continue steaming until cooked through. Let youfan sit (still covered) 10 minutes, then use a spatula or wooden spoon to mix everything together.Step 7To serve, transfer youfan to a large bowl and pat down into a dome shape. Top with 1 bunch cilantro, coarsely chopped, and drizzle more sesame oil over.How would you rate Mushroom YouFan (Taiwanese Sticky Rice)?Leave a ReviewTell us what you thinkReviews (5)Back to TopTrianglethe recipe calls for \"10 shiitake caps, divided.\"  the instructions tell us what to do with 8 of them.  am i missing something?  what do we do with the other 2?  sorry if it's my dyslexia.Anonymousny, ny2/21/2022The texture of the rice was perfectly sticky without being mushy, and the seasoning was great!  I really enjoyed this recipe and will be making it again.  Next time, I will add some finely diced taiwanese sausage and reduce the oil by 1/3, as I grew up eating a less oily version.  MichelleSAN MATEO COUNTY, CA2/13/2022Absolutely delicious! Made this last night and I will definitely be making again. Most of the ingredients I used what I already had (regular soy sauce, regular sesame oil, black pepper) and it tasted pretty good already, but next time I will follow the ingredients exactly bc I can really see how the aged soy sauce, black/toasted sesame oil, and white pepper will result in a more complex flavor. \n\nAlso I love a lot of ginger and think that most recipes could use a little extra, but I shouldn’t have done that lol. I definitely overshot it and next time will only use the amount the recipe says.IzzyNew Jersey2/9/2022I don't know if I did something wrong but my rice turned out horrible. Actually, I know I forgot to rinse my rice, so my rice came out kind of gummy and really mushy, but still it has no flavor, I had to add heaps more soy sauce to even taste anything. I'm really sad, I was so excited for this recipe. I will never make it again. I also didn't understand the part about putting the rice in the pan but not browning it. What was the purpose? It kind of just got a coating of oil and a little warm. I wish that was a little more clear.mabeorCharleston, SC2/3/2022Delicious. I prefer this Taiwanese version called YouFan to the Mainland style  of Lo Ma GaiBig SmokeWhistler, BC2/1/2022Explore Bon AppétitDinnerTaiwaneseEast AsianAsianVeganVegetarianNut-FreeDairy-FreeMushroomVegetableShiitake MushroomRiceRice & GrainsLunar New YearMainSideSteamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-30", "author": ["Condé Nast", "Jessie Yuchen"]}