{"id": "19f9323e25a4652d10b8e62e8396a089", "url": "https://www.bonappetit.com/story/maximize-your-freezer", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "13 Tips to Make the Most of Your Freezer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscooking13 Tips for Making the Most of Your FreezerTreat it right and it will reward you with great riches (like frozen biscuits).By Team BasicallyAugust 26, 2020FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGHFacebookTwitterEmailWe used to treat our freezers like temperature-controlled junk drawers. Three stray taquitos. A half bag of corn. Vintage pesto. But for strategic, economic cooking, something had to change. These are the 13 tips that have helped us unlock our freezers' full potential. Maybe you'll find something useful in here—you know, between the ice cream cartons, the cooler packs, and the unlabeled quart container of…is it soup? too. 1. Always keep track of what's inside.Stick a list on the freezer door that says WHAT’S IN HERE? Cross out as you go.2. Freeze flat, then store vertically.The best way to store cooked grains, ready-to-reheat soups, and mashed bananas is in resealable bags that lie flat. Once solid, you can line them up like magazines.3. Designate zones so you know what's where.Illustration by Sabrena Khadija4. For instant toast, slice your bread before you freeze it.The day you buy a loaf of good bread, slice whatever you won’t eat for lunch and freeze it in a resealable bag. Toast slices directly from the freezer when the urge strikes and never suffer a stale heel again.5. Buy fish once, eat fish forever for many meals.“Ordering fish in bulk and freezing it has been a game changer. There are mail-order companies shipping everything from wild salmon to octopus tentacles. My freezer’s packed with my last shipment from Fulton Fish Market. Because fish defrosts quickly in a bowl of cold water, I don’t even have to think that far ahead about making it for dinner.” —Emma Wartzman6. Don't toss the small stuff. Tiny portions of these leftover ingredients will certainly come in handy:Coconut milk, wine, and stock: freeze in ice cube trays, then transfer to bagsMinced ginger: bag itSave tomato paste: label “NOT BLOOD”Chiles in adobo: use for impromptu cashew salsaCitrus juice: thaw for dressingsCilantro stems: hello, chutney!7. When you have big bunches of greens hogging the fridge, send 'em to the freezer. “I’ve started blanching and freezing leafy greens like kale, Swiss chard, and mature spinach so I can instantly upgrade my omelets, pastas, and soups (and save valuable fridge real estate). I mold blanched, cooled, and roughly chopped greens into balls, squeezing out as much liquid as possible, before freezing them on a baking sheet until solid and transferring to a resealable bag.” —Christina ChaeyThese greens are ready for anything.\nPhoto by Laura Murray, food styling by Susie Theodorou8. A slow thaw is the best thaw.Drastic temperature changes mess with the molecules in food, you know, because science. So when it comes to sausages and pie dough, give them the time they need to defrost (overnight and 20 minutes, respectively) and stop googling shortcuts.9. Scallions and green chiles can go in whole.“I love to freeze whole scallions, which I’ll use to make ginger-scallion sauce for noodles. The frozen scallions are best used in places where they're meant to they disappear into a dish since they don't stay as perky as fresh ones. I’ll also freeze green chiles to grate into dressings, dips, and stews. The Microplane catches the seeds, so you don’t have to worry about accidentally touching your eyes with spicy fingers.” —Priya Krishna10. You can freeze cooked rice. Bag it and fulfill your fried rice fantasies. Since it tends to get freezer burn sooner than other items, use it within a month.11. You'll never regret keeping a bag of frozen shrimp on hand.Toss in a brothy soupAdd to fried rice/stir-friesMake scampiMarinate in adobo for tacosSkewer and grill12. Frozen cookie dough > frozen cookies. “Keep a batch of portioned and frozen cookie dough balls around at all times. As they bake, the centers stay frozen while the outsides melt and start to set, yielding crinkly edges and chewy middles.” —Claire SaffitzLooks freshly made, right?\nPhoto and Food Styling by Emma Fishman13. You’re not livin’ until your freezer contains…Sun Noodle ramenLumpia or egg roll wrappersThose blue squishy eye masksHot dogsA single buttermilk biscuitA piece of royal wedding cake17 overripe bananas and 11 rolls of filmIt doesn't stop there!How to Freeze Tomatoes Without Totally Changing Their TextureDo your dead-of-winter self a favor.View StoryExplore Bon AppétitBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-26", "author": ["Condé Nast", "Team Basically"]}