{"id": "1a025aa118b0aec779324be68cfa52eb", "url": "https://www.bonappetit.com/story/this-roasted-broccoli-recipe-tastes-kinda-like-doritos", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "This Roasted Broccoli Recipe Tastes Kinda Like Doritos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Roasted Broccoli Recipe Tastes Kinda Like DoritosWe have a spiced yogurt marinade to thank for those Nacho Cheese vibes.By Aliza AbarbanelDecember 11, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Frances BoswellFacebookTwitterEmailWhen temperatures drop and our feeds start to fill with other people’s beach vacation photos, we need a little convincing to eat our vegetables. Take roasted broccoli: It's one of our go-to winter staples, but it definitely needs some zhuzhing to take our attention away from, say, baked pasta.Luckily, senior food editor Chris Morocco developed a roasted broccoli recipe that’s going to keep our attention all season long. The weeknight-friendly recipe dunks blanched broccoli in a vibrant yogurt marinade fortified with warm spices like hot paprika, coriander, and turmeric. The yogurt tenderizes the tough broccoli florets while they cook, and, thanks to the dairy and spice-combo,  the broccoli develops a delicious, almost cheese-like crust. It's not not reminiscent of a nacho cheese Dorito, and it's much more delicious than broccoli is normally allowed to be.The first secret to creating craveable broccoli is blanching the florets. This process isn’t totally mandatory, but it helps break down the fibrous vegetables so that they’ll roast faster and become more tender. Just blanch the broccoli in a small pot of boiling salted water until its bright green (which should only take 30 seconds or so). Trust us, you’ll be glad you did.The other key is to create layers of flavor in your yogurt marinade. Morocco opted for a base of hot paprika, ground coriander, and ground turmeric, then added a finely grated garlic clove and a few dashes of hot sauce for a hint of heat. Feel free to experiment with other additions like garam masala or fresh ginger. No matter your flavor profile, be sure to thoroughly toss the broccoli in the yogurt marinade to ensure an even coating. Then roast on a foil-lined baking sheet to save yourself some cleanup. Nobody likes scrubbing roasted yogurt off a sheet tray.Once the broccoli is browned and the stalks are tender, it’s time to serve. I used my broccoli to top a chickpea-quinoa grain bowl, adding a generous dusting of nutritional yeast to double down on the cheesy flavor. After a week of holiday parties (and holiday cookies), it felt good to eat something green. And two helpings of broccoli later, my rugelach equilibrium was rebalanced.Get ready to marinate:Yogurt and Spice Roasted BroccoliYour roasted broccoli recipe could use an upgrade.View RecipeExplore Bon AppétitHealthyishYogurtBroccoliSideRead MorecookingButternut Squash Baked Pasta Is the Ultimate Healthy Winter Comfort FoodBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Aliza Abarbanel"]}