{"id": "1a04de74fc2b855c5703ceaa988cf3dd", "url": "https://www.bonappetit.com/recipe/vegan-cacio-e-pepe", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Vegan Cacio e Pepe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Cacio e PepeBy Chrissy TraceyJanuary 6, 20224.2(31)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintDelicious, a little fancy, and deceptively simple to make, this vegan cacio e pepe is a frequent star in Chrissy Tracey’s weeknight meal rotation. While the pasta is good on its own, sautéed mixed mushrooms stirred into the pasta add a dose of veggies and some intrigue. “I tried to re-create the creaminess, taste, and texture of cheese without using dairy and using only natural ingredients,” Tracey says. “When soaked cashews are blended with spices, miso, and pasta water, a creamy sauce forms that makes for the perfect cheese alternative.”If you don’t want to soak the cashews overnight, we’ve got you: Just cook them in boiling water until softened, about 20–25 minutes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonBlender$32 At AmazonLarge Pot$55 At AmazonWhisk$10 At AmazonTongs$13 At AmazonIngredients6 servings1cup unsalted raw cashews4Tbsp. extra-virgin olive oil, divided8oz. mixed mushrooms (such as maitake and shiitake), sliced or torn into ½\" piecesKosher salt2garlic cloves2Tbsp. white or yellow miso paste1lb. bucatini½tsp. crushed red pepper flakes⅛tsp. onion powder2tsp. freshly cracked black pepper, plus more for serving2Tbsp. fresh lemon juiceZest of 1 lemonVegan parmesan (for serving)PreparationStep 1Place cashews in a large bowl and pour in cold water to cover by 2\"; let soak overnight. Drain cashews; set aside. (If you have a high-speed blender, feel free to skip the soaking step.)Step 2Heat 2 Tbsp. oil in a large high-sided skillet until shimmering. Cook mushrooms, stirring often, until browned, about 5 minutes; season with salt. Transfer mushrooms to a small bowl and set aside; reserve skillet.Step 3Place reserved cashews in a blender. Add garlic, miso, and ½ cup fresh water. Blend on high speed until smooth, adding a little more water if needed to get mixture moving.Step 4Cook bucatini in a large pot of generously salted boiling water until very al dente, about 2 minutes less than package directions (pasta will finish cooking in sauce).Step 5Meanwhile, heat remaining 2 Tbsp. oil in reserved skillet over medium. Add red pepper flakes, onion powder, and 2 tsp. black pepper. Cook, stirring, until fragrant, about 1 minute. Pour in cashew purée and stir vigorously to combine (it’s okay if the mixture seizes up). Scoop out 1½ cups pasta cooking liquid and add to skillet; whisk until sauce is creamy, adding more pasta cooking liquid as needed to achieve a smooth, silky sauce. Stir in lemon juice; taste and season with more salt if needed.Step 6Using tongs, transfer pasta directly to sauce in skillet. Add most of reserved mushrooms to skillet. Cook (still over medium), tossing often, until sauce is hot and pasta is al dente, about 2 minutes.Step 7Top with lemon zest, parmesan, and more black pepper; scatter remaining reserved mushrooms over.How would you rate Vegan Cacio e Pepe?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleIngredients for Cacio e Pepe:\nWater\nSalt\nBlack Pepper\nPecorino Romano\n\nIf you somehow had a miraculous fake Pecorino substitute, fine, call it Vegan Cacio e Pepe, but your recipe is absurd. I nerded out hard on the real dish and this is an insult to Italians everywhere. Sigh. I mean, mushrooms? lemon? Miso???? WT(blank). Do you have any self-respect?\n\nDon't get me wrong. I am not upset about the recipe. I am upset about using \"Cacio e Pepe\" anywhere in the title. It is NOT even remotely close to the real dish, which is absurdly simple, as shown in the actual ingredients list at the top of my post. So, fine, vegans and lactose intolerants everywhere may well enjoy this recipe, but stop insulting the actual dish and the culture that it sprang from. Ack! Call it Magic Vegan Pasta if you like. Alright, I'm belaboring this, but seriously! It's absurd.AnonymousSeattle, WA2/18/2022You asked me to sign in to see a recipe, then would not let me see it. This is bait and switch CRAP. Disgusting and rude.WinenerdDa U.P.2/9/2022Omg this was delicious! Telling everyone I know. LMArlington, Virginia2/2/2022Tasted stunning! 10/10 honestly, the miso was such a good take on the flavour profile. Agreed with the other commenters it can be renamed but honestly that's not important in my eyes. As long as the flavours there then I'm won over! Would make again as a staple definitely.  Anonymous1/18/2022The lactose intolerant (but not vegan) among us thank you! And as for the complaining/purist commenters, if it doesn't sound good to you, then don't...make...it...?AnonymousNYC1/13/2022Always looking for meatless dishes and this looks tasty and Hardy can't wait to try!Mergatroyd1/11/2022This sounds great, and I as a vegan can't wait to try it and will review once I have. Please all you self-appointed critics out there, read what is written before commenting. The ingredient list clearly says VEGAN parmesan. If this is not your lifestyle choice, so be it. Please don't negatively review a recipe you haven't tried based on your perception of the ingredients or how different it may be from the original concept. What difference does it make what it is called? Amelia32034Cincinnati, OH1/10/2022I think the recipe should be renamed since it does not contain cacio (cheese) and in step 7 it calls for to be topped with parmesan (cheese) which is not Vegan, the true Cacio e Pepe calls for Pecorino not Parmigiano-Reggiano (the real parmesan) PaceMilano1/10/2022So glad I'm not strictly vegan.  Cacio e Pepe is a tricky, but easy, dish consisted of just cheese and black pepper.  Simple in ingredients and execution.  Just add pasta water and pasta.  This seems too over-complicated to be considered a named substitution.  Not closed-minded to vegan recipes, or new ways to make pasta, but just think this would have sold me more as a 'new' preparation for pasta, i.e. \"Chrissy's Creamy Cashew Cream and Miso Sauce Pasta.\"  Lost me at blender, though obvious it is full of great flavorsEricJMAstoria, NY1/10/2022think this recipe is better renamed, to do it justice. i'm not those pretentious purists, but this recipe virtually shares nothing in common with the idea/concept of cacio e pepe. in the video, chrissy said \"traditional cacio has eggs\" which makes me think she meant carbonara not cacio? which makes more sense when you think about the richness and decadence the cashews bring to this recipe, which is definitely more carbonara than cacio. also, is it just me or does step 7 write \"top with parmesan\" ......... like what? if you mean vegan parmesan, sure, but cmon, editor! LOL. \n\nbut anyway, this recipe is great, don't get me wrong, just wanted to nitpick because i'm used to a certain standard that BA upholds. Anonymoussingapore1/10/2022I love this recipe. It is delicious, quick to make and vegan. It goes to show that is completely possible to eat healthy and vegan without sacrificing flavor!AnonymousSan Diego1/10/2022Explore Bon AppétitDinnerWeeknightEasyQuickPastaVeganVegetarianDairy-FreeMushroomVegetableMaitake MushroomShiitake MushroomCashewNutMisoCondiments, Sauces & PastesBucatiniPasta & NoodlesMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-06", "author": ["Condé Nast", "Chrissy Tracey"]}