{"id": "1a06cce4e1feb5fc5693322666166647", "url": "https://www.bonappetit.com/story/cleopatra-lee", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Cleopatra Lee Is Hiking Through Her Post-Pandemic Anxiety | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCleopatra Lee Is Hiking Through Her Post-Pandemic AnxietyThe fitness founder is all about elderberry, deep breathing, and taking it outside.By Chala Tyson TshitunduMay 19, 2021FacebookTwitterEmailPhotograph by @jassieuoFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Cleopatra Lee, health and wellness influencer and founder of the Cleopatra’s Army fitness studio and clothing brand. Even via tiny little Instagram squares, fitness influencer Cleopatra Lee’s energy is absolutely infectious. In a video post from September 2020, she’s dancing around her new Los Angeles apartment to Chloe x Halle’s “Do It,” doing high kicks in the mirror and twerking atop a cardboard shipping box. “From Harlem to Hollywood,” she writes in the caption. “You’re witnessing the takeover.” It’s this palpable joy that makes Lee so impossible to ignore—she’s a #CareFreeBlackGirl and she fully owns it.As the founder of Cleopatra’s Army—a virtual fitness studio and apparel company inspired by a need for holistic health education in her hometown of Harlem—the 24-year-old Lee brings this vibe to her community as she supports fellow women of color in building mind-body connection. She learned firsthand the mental and physical benefits of movement growing up, when her dad, a personal trainer and U.S. Marine, encouraged her to take up sports like track, swimming, and kung fu. Now, between teaching workout classes and managing her business, Lee also donates hygiene products to women experiencing houselessness in New York City, Los Angeles, and Atlanta, providing much needed support to an often overlooked community.Earlier in May, Lee partnered with Sad Girls Club, a mental health nonprofit supporting women of color, to host their first in-person event in over a year: the Love Ya From a Distance Hike in Los Angeles. Aimed toward those seeking an open space, literally, to share their fears and anticipations of returning to “normal” life, the hike kicked off Sad Girls Club’s Mental Health Awareness Month, which is happening throughout May. I got a chance to chat with the effervescent Lee ahead of the hike about the importance of movement, her own post-pandemic anxieties, and breaking down wellness barriers.Why is it so important for you to empower women, and specifically women of color, through health and wellness?As a woman of color, I’ve seen firsthand the differences in care between women of color and others, and the difference in health education. Not enough of us are learning about their health and their bodies, and it’s important to me to give that to the younger generation. I only have that education because my father worked in the health and wellness industry. It’s important, especially in Black communities, because we grew up in neighborhoods that don’t offer the resources—like holistic education and physical activities outside of school sports—that we deserve.What are you trying to change for your community?Through my work, I’m trying to create more activities that can keep people active and offer different kinds of health and wellness that we don’t see all the time in the community, such as hikes, recreational sports, and even meditation classes. I want to create more access to them in safe spaces where women of all different body types are welcome. There’s a certain kind of stigma and a certain expectation when you go to the gym—that you’re there to lift weights and get ripped. But Cleopatra’s Army is a place where everybody can feel comfortable at all different levels of fitness because we’re here for the same reason: We want to be healthy.How did you get involved with Sad Girls Club, and how does its mission to fight mental health stigma align with yours?I met Elyse Fox [Sad Girls Club’s founder] through mutual friends, and I just loved how nothing about mental health is taboo with them. I was like, “Wow, I have to be a part of this!” Cleopatra’s Army focuses on connecting the body and the mind. I try not to say that we’re a fitness brand too much because when people hear fitness, they think only about the gym and lifting weights, but your body is already capable of so much. It’s so often your mind that needs a workout.What are some of your anxieties about returning to “normal” life, and how are you working through them?I definitely had a bit of social anxiety just being around people again, but I miss being around people’s energies, so I’m kind of just trusting that as long as I’m safe, I’ll get through it. I think gradually we’ll start to get better to get back to a “normal” kind of way of life. Just do what feels comfortable for you.I know one of my personal fears about things opening up again is this idea that we have to go back to an old “normal,” and forget all of the things the past year has taught us about making our health a priority. Do you have any advice for shaking off those pandemic blues while still prioritizing well-being?Be safe by wearing your mask! Taking immune boosters will also help. I’ve been heavy on my vitamin C, my elderberries, and even doing respiratory exercises where I inhale deep for four counts, hold my breath for four counts, and exhale deep for four counts at least 10 times. I also pour boiling water over [dried] herbs—like chamomile, thyme, lavender, oregano, and bay leaf—and just breathe in the steam to keep my airways clear and open.I’m taking extra precautions to make sure I’m physically healthy while still trying to be comfortable enough to go to places where I know I won’t have to interact with too many people. Hikes in general are great, because one way to shake the anxiety is to go out in a public space that’s not too public. I think being someplace where you can still be separate from people, but be around them and feel their energy, is a great place to start.I think, because the health and fitness industry is inaccessible to so many, that some people don’t realize your healthy lifestyle doesn’t have to look like everyone else’s.Are there ways that our environments can impact our mental health?Totally! I was living in New York for so long and I needed a change of scenery, so I moved to L.A. and it shifted my entire life in a way that helped me work on my business better. It helped me work on everything better. Sometimes you need to change your space in order to change your mentality. If you stay in that same box that you’ve been living in forever, you won’t see a change. So, even doing something as simple as hiking to the top of the mountain will give you more mental clarity and perspective.Do you have any personal routines or rituals that get you out into nature regularly?I try to be outside as much as possible. Even during the pandemic I would take my yoga to the park, and I go hiking a lot now that I moved to L.A., probably once a week. When I travel, I like to go on hikes too. I try to go out into the wilderness and to the beach whenever I can to get in tune with nature and be by myself. I don’t really have a set routine, but I make time at least once a week.How has movement and staying active helped you personally navigate the mental and emotional challenges of the past year?It’s kept me sane; movement is my medicine. I need to be moving around in order to feel good, and it releases endorphins too. It’s not just a personal thing, it’s science! Even if I’m by myself in the mirror or acting a fool with my friends, I’m getting movement in somehow. I think, because the health and fitness industry is inaccessible to so many, that some people don’t realize your healthy lifestyle doesn’t have to look like everyone else’s. You don’t have to be in a gym every day; even something as simple as meditation is a stride forward. There are so many ways to fit health and wellness into your life. It doesn’t have to look like a bunch of weights in the gym.I’ve also seen a lot of gatekeeping in the health and wellness community that keeps it inaccessible to women of color. Why do you think this is?I think these spaces are so prone to keeping women of color out because we see racism all across the board in the health industry. Period. For example, the mortality rate with Black women giving birth—[Black women are three times as likely to die during childbirth as their white counterparts]—we see statistics like that all the time. I just feel like it’s history’s oldest story. We see the gatekeeping because we see it in all other areas of life. This is just another area where we have to break down those doors—which is exactly what I’m trying to do through the community that Cleopatra’s Army has created.Explore Bon AppétitPerson of InterestLos AngelesHealthyishprofileRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-19", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}