{"id": "1a0895930da5a5d83a1e8bba8ffd7648", "url": "https://www.bonappetit.com/recipe/fresh-pepper-kung-pao-chicken", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Kung Pao Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFresh Pepper Kung Pao ChickenBy Chris MoroccoSeptember 25, 20194.3(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWe consulted with Lisa Cheng Smith of Yun Hai, who specializes in importing phenomenal Chinese and Taiwanese pantry staples, for a Kung Pao recipe that stays very close to the original but includes seasonal peppers.Ingredients4 servingsMarinade2tsp. Shaoxing wine, dry sherry, sake, or mirin2tsp. soy sauce1tsp. cornstarch1lb. skinless, boneless chicken thighs or breasts, cut into 1\" piecesStir-Fry2Tbsp. rice vinegar1Tbsp. soy sauce1½tsp. sugar2Tbsp. vegetable oil, divided1bell pepper, cut into bite-size pieces8–10red dried chiles (such as chiles de árbol, bird chiles, or frankly any kind; or ½ tsp. crushed red pepper flakes)2scallions, chopped1Fresno chile, cut into ¼\" rings11\" piece fresh ginger, peeled, finely chopped2garlic cloves, thinly sliced½tsp. Sichuan peppercorns or cracked black peppercorns⅓cup roasted unsalted peanutsKosher saltPreparationMarinadeStep 1Stir wine, soy sauce, and cornstarch in a small bowl. Add chicken and turn to coat. Let sit at least 10 minutes or up to 30.Stir-FryStep 2Stir vinegar, soy sauce, and sugar in a small bowl; set sauce aside.Step 3Heat 1 Tbsp. oil in a large nonstick skillet or wok over medium-high. Add chicken (along with any marinade clinging to it) and cook, tossing occasionally, until lightly browned all over but not cooked through, 3–4 minutes. Transfer to a plate.Step 4Heat remaining 1 Tbsp. oil over medium-high. Add bell pepper and cook, tossing occasionally, until browned and crisp-tender, about 3 minutes. Add dried chiles, scallions, Fresno chile, ginger, garlic, and peppercorns. Cook, tossing constantly, until very aromatic and dried chiles are lightly toasted, about 1 minute. Add chicken and reserved sauce and cook, tossing, until liquid is nearly evaporated and coats chicken, about 1 minute longer. Toss in peanuts. Taste and season lightly with salt if needed.Step 5Divide chicken stir-fry among plates and serve immediately.How would you rate Fresh Pepper Kung Pao Chicken?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleLike this one and it is simple. Agree re black pepper v sechuan. Prefer latter.  Would think marinade is a ratio so 2 2 1 of any measure would work.\nNote recipe says ...or 1/2 tsp chilli  flake not plus.\nand as for fellow Aussie don't see any mention of Keto in recipe description!MarleneWestern Australia 1/12/2022We make this all of the time! love it!\nBTW \"Joppo\"\nRead the recipe... \nAdd dried chiles, scallions, Fresno chile, ginger, garlic, and peppercorns. Cook, tossing constantly, until very aromatic and dried chiles are lightly toasted, about 1 minute. *****Add chicken and reserved sauce and cook, tossing, until liquid is nearly evaporated and coats chicken, about 1 minute longer. \n\nSee???AnonymousToronto10/27/2021The Mala Market recipe, on their blog as “Gong Bao Chicken,” is the one to follow. As they suggest, use raw cashews rather than peanuts. It’s fantastic. Btw, the Mala Market specializes in Sichuan ingredients — peppers, peppercorns, oils (they are the sole American importer of Caiziyou, far as I know), and so much more.Hollis RamseyVero Beach, FL6/12/2021Looks delicious but definitely not keto, beginners on keto bewareJoshPerth Australia4/27/2021This recipe was super delicious and easy to make - I had most of the ingredients already in my house, and the cooking process was very straight-forward. I would recommend this recipe if you like spicy food! I’m definitely making this again. AnonymousPennsylvania1/10/2021this recipe almost drew blood as we fought each other over every scrap.  fabulous.brushjlsolon, oh12/3/2020Is the marinade supposed to be tablespoon and not tsp? Didn’t know if this was a mistake because it’s barely any marinade. Lno76Pennsylvania 6/29/2020@joppo it tells you right here when to return the chicken...\"... Add chicken and reserved sauce and cook, tossing, until liquid is nearly evaporated and coats chicken, about 1 minute longer. Toss in peanuts. Taste and season lightly with salt if needed.\n\nDivide chicken stir-fry among plates and serve immediately.\"AnonymousFlorida11/18/2019Very tasty and VERY spicy! I love it! For all you heat-seekers, this is the recipe for you! \nI couldn't find Fresno chiles in my grocery store, so I used one whole sliced Hungarian pepper in its place and it worked well, as well as providing a bit of a color difference too. I have used the marinade recipe a couple times now and used other ingredients for the veggies, so it's a pretty versatile marinade in that way. I don't know if the dried chiles are intended to be eaten or just served with it and set aside, but a friend and I both ate one when and realized they are an extreme spice kick that made it unpleasant. So maybe they're just to add a little heat to the dish but not to be eaten? The dish also reheated pretty well the next day.Matthew LynessVirginia10/12/2019To me, this didn't have a lot of depth of flavor. All the textures worked really well together but it felt like it needed something to provide some punch or umami.AnonymousBuffalo10/4/2019This recipe is fabulous but warning, 1/2 tsp red pepper flakes, 1 fresno chili WITH seeds, and 1/2 tsp Szechuan peppercorns makes for a very spicy dish, and I have a high heat tolerance. I would recommend cutting back the red pepper flakes and de-seeding the fresno chili if you are serving a more heat-averse crowd. AnonymousWorcester, MA10/2/2019The recipe ought to mention that while substituting black peppercorns for Sichuan peppercorns would certainly be tasty, they are in no way equivalent.  Black pepper just wouldn't give the mouth-numbing effect that Sichuan peppercorns have.AnonymousPennsylvania9/30/2019This appears to be a very straightforward recipe that’s easily adjusted for personal tastes using ingredients I already have in my pantry. Gonna make this very soon. Looking forward to it.Jo HayesIllinois9/30/2019Yes she does tell you when to re add the chicken.  It's a perfect recipe!AnonymousTucson AZ9/29/2019You instruct to remove half cooked chicken to a plate, but never provide instruction as to when to add chicken back. It’s just suddenly back in the pan at the end. Do we add chicken with all the other ingredients? With the sauce? After? Before?JoppoOakland, CA9/26/2019Explore Bon AppétitStir-FryChineseEast AsianAsianChickenPoultryChicken ThighChileVegetableBell PepperChicken BreastSichuan PeppercornHerbs & SpicesChile de ÁrbolFresno ChileWeeknight MealsQuickOne-Pot MealsMainDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-25", "author": ["Condé Nast", "Chris Morocco"]}