{"id": "1a1257ef81e7ec74b88e419b1c353f5b", "url": "https://www.bonappetit.com/story/white-russian-feud", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Once Upon a Time I Foraged for Ramps | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOnce Upon a Time I Foraged for RampsAnd more news, recipes, and food feuds from the week.By Alex BeggsMay 11, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Ramps, ticks, and leaves“What does poison ivy look like” was typed in my phone screen and the blue progress bar wasn’t moving a millimeter. Mosquitos or some other bugs were buzzing in my face and my friends were bent over among the probably-not-poison-ivy, slicing wild ramps from their bulb base. We’d pulled over on the side of a country road in Connecticut, where ramps grow like weeds for a few weeks every spring. Another tab on my phone was open, “illegal foraging connecticut laws”—also not loading. Oh well! My outdoorsy friend Justin led the way, telling us how to clear the brush before cutting the ramp, make sure to leave plenty behind to grow back next year. Justin could spot the fiery-garlic bombs from the road by the plant’s floppy, bunny ear-like leaves, the way they grow in friendly patches. Over a weekend, we collected pounds of ramps to take home and pickle, turn into pesto, grill, scramble with eggs, fritter, and experiment with fancy compound butters. It was as bougie as it sounds.Get the recipe: Ramp FrittersPhoto by Chelsie Craig, styling by Claire SaffitzMake cakeLast weekend, Jesse Sparks and Friends (watch out for their new morning show) made Molly Baz’s Blackout Chocolate Banana Bread. The bananas on top sank a bit, but the rich, chocolatey-but-not-dense cake was a winner, said Jesse. It combines the best of two worlds, chocolate blackout cake and moist banana bread! “I’d make it again in a heartbeat,” he said.Get the recipe: Blackout Chocolate Banana BreadWant this letter before it hits the website? Sign up for our newsletter!Courtesy of Lindsey BrownIsn't it romanticSomething caught my eye in my Texas corner of Facebook. Was that a sparkly diamond ring...around a crawfish claw?! It WAS. Only one chef could have come up with such a devastatingly romantic way to propose to his love, Lindsey Brown, and that’s the big-hearted Houston chef Chris Shepherd. Lindsey told me Chris presented her with a bowl of crawfish at a party that were supposedly extra spicy, so she ate a few, and realized they weren’t spicy at all. And then she noticed the ring. “Chris said that’s exactly how he sees me,” Lindsey added, “stuffing my face with crawfish.” 💖💖💖Photo by Keystone-France \\ Gamma-Rapho via Getty ImagesIt’s asparagus sznSo you should probably make Andy Baraghani’s new recipe for a super easy asparagus stir-fry that you finish off with soy sauce, butter, and orange juice. If those three things make you go: le huh? Do NOT knock it ‘til you try it. There’s sweetness and salt, a little heat from a chile pepper, and the butter coats everything all glaze-y good. We’re obsessed with this Healthyish recipe.Get the recipe: Simple and Citrusy Asparagus Stir-FryPhoto by Daniel Zuchnik/GC ImagesWhen food meets fashionThe Met Gala, fashion’s annual costume party, was this week and in accordance, or defiance, of the “camp” theme Katy Perry changed out of her chandelier dress and into a hamburger (or was it a slider?) getup. It looked heavy on the lettuce if you ask me. Are burgers “camp”? I wondered for three passing seconds. I asked GQ style writer Rachel Tashjian for her professional review of Perry’s burger look. “Well done,” she answered.Unnecessary food meme of the weekLiquid death comes in many formsLate last year, a new canned water came into the marketplace, filling a void with somehow, an even bigger void. Liquid Death, hardcore water from Austria with millions of dollars of funding and recyclable cans, will MURDER YOUR THIRST. Reviewers say it “doesn't decapitate my thirst like the marketing claims,” “it is better than generic water,” and “dragged my thirst down a dark alley and ruthlessly beat it within an inch of its life with a baseball bat.” But the company better watch out, the competition is coming in hot.Unnecessary food feud of the weekSpeaking of liquid death, it’s Mothers’ Day this weekend! When I was a kid, my mom drank a pint glass–sized White Russian every evening while watching Entertainment Tonight in bed. Fond memories. Today, I honor her by drinking it at every appropriate occasion. And you know what? It’s a delicious drink. It’s a liquid coffee milkshake! But others on staff feel it is liquid death, such as Emily “Sunburnt” Schultz who made a vomitous groan when I asked her how she felt about the cocktail. “My stomach is rumbling just thinking about it,” she said. For others, it’s nostalgic. The drink takes Adam Rapoport back to his relatives’ basement in Milwaukee, where the adults would “pound White Russians all day long while eating cold kielbasa and cocktail sauce.” Not a bad life. However, he “can’t handle all that dairy.” Carla Lalli Music ordered a White Russian on the first date with her now-husband, who ordered a Campari and soda and laughed, “You’re kidding, right?” She was not! Love sprungeth forth. “They’re delicious but disgusting,” offered Meryl Rothstein. Molly Baz confessed she went through a pretty serious Black Russian phase in college (i.e. hold the cream). Chris Morocco gave me a look of horror and disappointment: “Didn’t we just leave Kalhua behind?” I had to know what our copy chief Greg Robertson thought about the whole thing. “How do you feel about white russians?” I messaged him. “Cap it (we follow Webster’s for cocktail names).”Explore Bon AppétitBeggs NewsletterRead MorecultureA Tale of Two Buttcheeks: Rating New York’s New Restaurant ChairsBy Alex BeggscultureIs It Ever Okay... To Cancel a Dinner Party If Too Many People Are Paleo?By Alex BeggscultureThe Springy Spring Salad I’m Making This WeekendBy Alex BeggsculturePork Sauce, Salmon Feuds, and Reese's THiNs: The Week at BABy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-11", "author": ["Condé Nast", "Alex Beggs"]}