{"id": "1a234a3a8129364ecf41374c78b3d70e", "url": "https://www.bonappetit.com/story/vancouver-coffee", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "A Coffee-Obsessive’s Guide to Drinking the Best Coffee in Vancouver | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Coffee-Obsessive’s Guide to Drinking the Best Coffee in VancouverI visited 12 cafés in 48 hours to find the most beautiful cafés, nuanced coffee, and flakiest pastries the city has to offer.By Chris MoroccoNovember 7, 2019FacebookTwitterEmailPhoto by Kyoko FierroFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.Vancouver is a coffee-lover’s paradise, capable of impressing even the most hyper-caffeinated and jaded New Yorkers, such as myself. The coffee is fantastic, whether I happened to be craving a world-class espresso served with monastic intensity or a single-origin pour-over at a vibrant all-day cafe. But what truly sets this town apart as a coffee destination isn’t just the quality of the brew. It’s everything that goes along with it, from the buzzy vibes of the independent cafés dotted around the city to the quality of the food and baked goods that most of them offer. The combination of thoughtfully sourced and prepared coffee, beautifully designed spaces, and impeccable house-made food and pastries puts Vancouver in a class by itself.Over the course of two caffeine-soaked days, and I don’t even know how many cups of coffee (I stopped counting at 14), I pushed myself, and my heart rate, to the limit to discover the very best cafés in a city full of them. While my aggressive to-do list kept me from too many repeat visits, there were a few places on this list that I kept returning to, long past the point I could reasonably state I needed to go for “research purposes.” Their There and Nemesis stand out for their considerable commitment to producing excellent pastries, the best coffee, and fantastic food in-house, but all of the cafés listed here offer an experience unique to Vancouver and are exceptional in their own ways. And when you can’t drink any more coffee, recover from your caffeine headache with pasta, more pasta, and a glass or three of natural wine at the notable establishments outlined below.Vancouver’s Best Cafés:We'll take one of each of the pastries from Their There, thank you.\nPhoto by Kyoko FierroTheir ThereOne of my favorites on the list, this indie café sits on Kitsilano’s main shopping street but adds an unapologetically hip spin to the local Lululemon vibes. Plants abound (courtesy of nearby Celsia Florist), as does neon signage, and even the to-go cups have epic illustrations of smiley-face astronauts and rainbow-firing flying saucers. (You really should bring your own reusable mug, but still….) Heart Roasters from Portland, OR, is the house pick, along with Fusée Papillon, a collaboration with a local roaster. Homemade almond milk is a rich diversion from the overly sweet alt-milks at most other cafés. The owners even have an after-hours burger pop-up four nights a week called Hundy, which operates from the back of the café. The brightest star of all is the pastry case, the work of head baker Lucy Kirby. House-made croissants, kouign-amann, yeast doughnuts with rotating fillings and toppings, and not least of all, cronuts, are the best I have had anywhere, ever. Powerful words for powerful pastries.2042 W. Fourth Ave., Vancouver; Monday through Friday, open 8 a.m.–4 p.m.; weekends 9 a.m.–4 p.m.; kitchen open until 3 p.m. daily.  Hundy, same location, open 5 p.m.–11 p.m. Thursday through Sunday.Serious pour over at Nemesis.\nPhoto by Kyoko FierroNemesisNemesis is anything but. Huge windows invite you into a beautifully designed expanse of blond-wood counters and seating, ideal for anything from a quick coffee-and-snack pause or a leisurely meal. While the beans have a starring role here—they source from a range of roasters, such as Lüna, see below—the food is reason enough to come. Cauliflower hash (gorgeous warm-spiced florets piled with crispy fingerling potatoes and a poached egg) leaves corned beef in the dust. If you are craving something meaty, go with a Scotch egg. The pastry case is rivaled only by Their There’s and is stocked with savory tarts, morning buns, danishes, croissants, and a particularly infamous chocolate cashew sea salt cookie. With sunshine streaming through those oversized windows and a Lüna pour-over and a cookie in hand, there may not be a nicer place to be in all of Vancouver.302 W. Hastings St., Gastown, Vancouver; Monday through Friday, open 8 a.m.–6 p.m.; weekends, 9 a.m.–5 p.m.Good light and good vibes at Revolver.\nPhoto by Kyoko FierroRevolverThis slip of a café literally buzzes with energy all day. Revolver is one of the older kids on the block but retains all of its cool, authentic character. The coveted two-person booths that run the length of the café are ideal for intimate conversation (though you may have to compete with the excellent indie-pop loud music). Next door in a quieter, more serene room, books and brewing equipment line the walls and a communal table dominates. The name Revolver refers to the café’s practice of rotating its coffee selection among various roasters, such as Bows & Arrows in Victoria, British Columbia, and Phil & Sebastian in Calgary, Alberta.  The shelves are particularly well stocked with beans from numerous specialty roasters, as well as brewing equipment for home use. Be sure to check out the baked goods sourced from Matchstick (see below) that are generally excellent.325 Cambie St., Vancouver; Monday through Friday, open 7:30 a.m.–6 p.m.; Saturdays, 9 a.m.–6 p.m.; closed Sundays.Looks like a robot, but makes coffee.\nPhoto by Kyoko FierroPrototypePrototype is a fitting name for this carefully considered café that seems to do virtually everything a bit differently. All its coffees are roasted in small batches inside the café in three countertop Ailio Bullet R1 roasters that quietly hum as coffee purists peruse a rotating list of over a dozen coffees and four espresso roasts. Owner Matt Johnson has developed a unique pour-over process unlike anything I have ever seen: Pre-measured hot water (chosen from three precise temperatures) comes from a tap built right into the counter, then is poured into a Gina brewer, a very precise pour-over setup that includes a valve for controlling water flow through the grounds. Tucked nearly out of sight of the street, this tranquil space is ideal for appreciating superbly crafted coffee in an atmosphere that invites quiet contemplation.883 E. Hastings St., Vancouver; Monday through Friday, open 8 a.m.–5 p.m.; Saturdays, 9 a.m.–5 p.m.; closed Sundays.Order up at Matchstick.\nMatchstickOne of several Vancouver-based mini-chains, Matchstick stands out for pairing excellent coffee with fantastic house-made pastries (good enough that they are even sold at Revolver as well). Their ethereal croissants are textbook showstoppers, and I am still kicking myself for not getting a power muffin for the road. All their locations are open until 9 p.m. unlike other cafés that tend to close up a lot earlier. The Chinatown location is full of communal seating, warm wood tables and paneling, and glowing pendant lighting. The Yaletown location keeps things a bit more modern with small tables, plants, and a more minimalist feel. I didn’t get to the last two locations, but any of them are solid choices depending on where you find yourself in the city.Multiple locations; 1328 Richards St., Yaletown shown; open daily, 7 a.m.–9 p.m.Sweets at Small Victory are as good as they look.\nPhoto by Kyoko FierroSmall VictoryI am assuming the name was intended as irony, because there is nothing small about the well-stocked case of impeccable house-made pastries that greets you in this sleek café. Victory even feels like too slight a word for the unbridled joy I felt when walking into yet another prime example of a Vancouver café that pulls off pastries, a delicious all-day menu, and thoughtfully prepared coffee in a chic, open loftlike space. Local photographer and man-about-town Viranlly Liemena swears by the breakfast sandwich, full of fluffy scrambled eggs and Swiss cheese and sauced with tomato jam on a flaky croissant.1088 Homer St., Yaletown, and 3070 Granville St., Fairview, Vancouver; open daily, 8 a.m.–6 p.m.Moving CoffeeTucked into a small corner of Fife Bakery, Moving Coffee shares the coffee-loving passion of owner Edmond Keung. Tasting one of his single-origin espressos, (in my case, the Gesha Village Bangi Lot 70 from Ethiopia) is a revelation, a showcase for fruit flavors, bright acidity, and wildly dynamic flavor unlike any other espresso I have ever tried. The intimate space is geared toward brief stops; my best advice is to ask Edward what he recommends and then let his coffees do the talking. While you’re there, plan on picking up a loaf or two of artisanal sourdough bread baked next door.64 E. Third Ave., Vancouver; Tuesday through Saturday, open 9 a.m.–5 p.m. and Sundays, 11 a.m.–5 p.m.; closed Mondays.Pull up a stool at Elysian.\nPhoto by Kyoko FierroElysianElysian is a small chain that roasts its own coffee, with cafés that have a consistent, pleasantly minimalist aesthetic, in some of the most convenient locations around the city. Its airy Mt. Pleasant location sits on a quiet leafy intersection, a neighborhood that is an eclectic mashup of residential homes and small businesses.Multiple locations; 2301 Ontario St., Mt. Pleasant shown; Monday through Friday, open 7 a.m.–6 p.m.; weekends, 9 a.m.–4 p.m.Bonus: Lüna CoffeeOkay, while Lüna is technically a Vancouver-based roaster and not a café, the colorful, trippy labels on its coffees are on the shelves of the best cafés in the city—and for good reason. Owners Nate Welland and Laura Perry have made their mark on the local coffee scene by specializing in light-roast coffees, a style that many cafés used to have to source from other cities or even countries. The brand’s meticulously sourced coffees are wildly transparent about where they come from and who produced them—which somehow makes the beautifully articulated, bright and complex beans taste that much better. Look for their coffees on pour-over menus around the city, or by the bag and mail order.When You Can’t Drink Any More Coffee…Crash at the Burrard Hotel (1100 Burrard St.). Centrally located with a retro-cool vibe, palm-filled open courtyard, and comfortable rooms, this is the ideal spot to sleep off your caffeine hangover. It’s also a short walk to a great jogging path along False Creek to Stanley Park, the city’s backyard.As far as where to eat and drink (not coffee), I walked into The Magnet (309 W. Pender St.) stuffed from dinner, cranky from jet lag, and planning to politely drink a beer with a friend while pretending not to count down the minutes until I could leave and go to sleep. Ten minutes later I had found room for a crispy potato cake with butter paneer sauce and a glass of natural sparkling rosé whose name perfectly describes its flavor: Pow Blop Wizz by Olivier Lemasson. An hour later I walked out convinced that The Magnet is in fact a fantastic restaurant and serious natural wine and cocktail bar in addition to its reputation for great beer.Kissa Tanto (263 E. Pender St.) makes a lot of best-of-Vancouver lists, and as far as I’m concerned, its place is well-deserved. The artful mashup of Japanese and Italian food, impeccable pastas (a special of house-made shells with pork and sesame ragù and pea shoot pesto sounded singularly delicious the night I visited, and was). The warm service and lamp-lit bar create a vibe that is as inviting as it is cool.33 Acres Brewing Co. (15 W. Eighth Ave.) defies categorization. It is most obviously a brewery with a slightly more minimal/experimental brewpub space next door, but then it’s also kind of an all-day café with a Slayer espresso machine (currently using Phil & Sebastian beans) and an all-day food menu, but there is also a wood-fired mobile pizza oven parked out front...point being, if you are in Mt. Pleasant, it is safe to say that whatever you are feeling, 33 Acres has you covered.It is pretty telling that I went to Savio Volpe (615 Kingsway), kids in tow, and still managed to have a fantastic dinner. Not even a fight about Legos between our kids, carried out under our table, could shake our fixation on superbly executed bold Italian food like rich bagna cauda, simple roast chicken with lemon, house-made pastas, and gelati. A well-timed delivery of crayons and color-it-yourself fox masks possibly saved the night from going off the rails.If you are out in Kitsilano with kids, you may not want to do what I did and take them to Maenam (1938 W. Fourth Ave.), known for bold-flavored, ingredient-driven Thai dishes and a swanky dining room and bar that doesn’t normally attract the under-seven crowd. Then again, the promise of an ice cream involving the sublimely vanilla-and-sugar-fairy-dust-scented house-made waffle cones next door at Rain or Shine Ice Cream, may have a similar effect on your kids: Gamely trying the eggplant and supremely crispy pork stir-fry, the garlicky chicken skewers with nam jim jao dipping sauce, and maybe even a nibble of pad thai before proceeding to eat nothing but rice. Oh, well. More for us.I wandered into Di Beppe (8 W. Cordova St.) while waiting for Juice Bar (a natural wine pop-up inside of The Birds & The Beets, 54 Alexander St.) to open. Di Beppe looks straight out of a Roman alley, worn tile floor and all, with a slicker modern dining room next door. The food is confident but not flashy; think phenomenal pizzas, bright salads, and well-executed pastas. Speaking of Juice Bar, please go. The casual space fills quickly with fans of its rotating list of natural wines in addition to a display case of bottles for sale. An excellent Okanagan Valley skin-contact wine by Rigour & Whimsy was as close as I got to exploring the rest of British Columbia, but if that wine is any indication, there is plenty more to uncover on my next trip.Thank you to  Viranlly Liemena and Eiry Bartlett for help reporting the story.Want more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Chris Morocco"]}