{"id": "1a256f635ce7080f5365793161d671c7", "url": "https://www.bonappetit.com/story/kristyn-leach-restaurant-diary-2", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "I Don’t Know Many Farmers Who Have the Kind of Relationship I Have With This Restaurant Group | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Don’t Know Many Farmers Who Have the Kind of Relationship I Have With This Restaurant GroupIn her second Restaurant Diary entry, farmer Kristyn Leach explains how this partnership benefits not only her but her farm and her produce in the long term.By Kristyn Leach, as told to Aliza AbarbanelMarch 24, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: bartender turned brand ambassador Jenny Feldt, wine educator Kyla Peal, line cook Peter Steckler, and farmer Kristyn Leach. Here Leach reflects on how a relationship with one restaurant allows her to diffuse risk and plan for the long term at her farm in Winters, California. Read Leach’s first diary entry here.I have a grower’s contract with Namu Restaurant Group, a group of three restaurants in San Francisco. This means they commit to buying a season’s worth of my produce at Namu Farm, which gives me consistent cash flow. If I have a crop failure, I can tweak what I’m growing later in the season to compensate and adjust to meet the group’s needs too. They recently opened a new restaurant, Sunset Squares Pizza, and it’s been well received so far! Chef Dennis Lee is doing innovative pizzas that use a lot of my Korean-focused crops—he’s doing a galbi jjim pizza. I asked him, “I’d like to try a bitter melon pizza. What do you think?” He said, “I’ll make you one, but I don't think the public is going to go for it.” Now I’m starting to think about growing more tomatoes than usual.When you’re a tenant farmer like me who leases their land, there's not a lot of incentive to ask yourself, “What is best for this plant, this farm, and this community 10 years from now?” Why bother thinking about that when people are looking for a pristine product instead of investing in a network of relationships? I’m in the Bay Area, and committing to one farmer in a primarily monogamous relationship isn’t that great of an option for chefs. There are so many great farms here and so many farmers markets. But with Namu, we’re committed to each other as people. I don’t really know other farmers that have this level of relationship with a restaurant.Not a lot of farmers have the liberty to tell a restaurant they’re working with, “I might kill half of this crop you asked for,” and still figure out how to get their chef enough produce. But doing this opens up room for me to take risks. Sometimes I say to the chefs at Namu Restaurant Group, “This crop is not that great this week, but I think I understand why and we’ll get it to a good place.” And they’re okay with that. Their talent and flexibility as chefs makes it possible for me to work in the long term.Photo by Eugene Kan of MaekanSpring is always a time of anticipation, especially this year. Farmers are trying to be optimistic, dreaming about what we’re going to grow. We’re holding our breaths to see whether we will get more rain, and we’re also wondering what will happen if restaurants start reopening here in California. Does that mean other channels for selling produce will start to open up? I’m trying to just surrender to the chaos and not expect anything. Generally, I like to underpromise in the hopes of over-delivering. If I set my expectations low, I feel more content.The biggest concern for everyone out here is that our average rainfall is 50 percent less than it should be, and it’s the second year in a row we’re facing some pretty harsh drought conditions. A big focus of my farm over the past decade has been breeding and adapting crops to be more heat- or drought-tolerant. The way I breed for heat and drought means that sometimes I have to kill 50 percent of the crop by withholding water. It’s a form of very traditional breeding, where you apply deliberate stress for the traits you want to see. But not everyone can do that. Some farmers are just trying to think about what they can feasibly grow right now. For example Korean melons are such a solid heat- and drought-tolerant summer crop for us—people really look forward to them.The big question everyone in the food industry needs to ask themselves is: What other players in our food system need to come in and help shoulder the risk that farmers face? Namu has done that for me from day one. I know they’re just hustling so hard to pay for my produce through the whole year, and I'm so appreciative. We’ve worked together for so long that we’re like family.Explore Bon AppétitRestaurant DiariesRestaurantsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-24", "author": ["Condé Nast", "Kristyn Leach", "As Told To Aliza Abarbanel"]}