{"id": "1a3b2e4814de035b0478d7c1e608debf", "url": "https://www.bonappetit.com/story/barolo-chinato-post-thanksgiving-drink", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Barolo Chinato Is the Only Post-Thanksgiving Drink You Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBarolo Chinato Is the Only Post-Thanksgiving Drink You NeedIt’s the digestivo everyone loves—even if they don’t know it yet. By Alex DelanyNovember 22, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by PEARL JONES, PROP STYLING by ELIZABETH JAIMEFacebookTwitterEmailYour old-school uncle only drinks big-name, expensive Italian red wines. Your in-the-know hipster cousin wants to pour something she’s never tried before. Your mom is asking for a drink that’s sweet (but not too sweet!). And your Grandma just needs a splash of something to settle her stomach. You know what they all want for a post-feast drink? They want Barolo Chinato. They just don’t know it yet.This classic Italian after-dinner drink is made by infusing Barolo—red wine made from Nebbiolo grapes grown in Italy’s Piedmont region—with dried herbs, barks, roots, fruits, and vegetables. The result is a sweet, spicy, vegetal wine that could just as easily be confused for vermouth as it could amaro. It doesn’t matter what flavor you’re looking for, you can find it in Barolo Chinato. Plus, at 16-19 percent ABV, a small glass isn’t going to knock your guests off their chairs or send them into a slumber so deep you won’t be able to get them off the couch.When it comes to producers, Pio Cesare makes exactly what I want from Barolo Chinato, with flavors of dark red fruit (think dried cherries and dates) and tannic, palate-cleansing herbs and barks that let your brain and your tastebuds know your feast has finished. At $95, it comes with a price, but if you’re gonna splurge on a bottle for Thanksgiving, I cannot stress enough that this should be it. If it’s not in the budget, Cappellano Barolo Chinato ($75), Barale Fratelli Barolo Chinato ($42), and Cocchi Barolo Chinato ($44) will also do just fine.Regardless of which bottle you snag, the real appeal of a digestivo like Barolo Chinato is that after a huge day of cooking, all you need to do is put out some rocks glasses, a bowl of ice cubes, and the bottle. No mixing. No stirring. Just let your friends and family members who want a drink pour one for themselves (they don’t even need the ice if they want it neat!). You’ve stressed for days (weeks!) about dinner. You don’t need to stress about this.Explore Bon AppétitThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-22", "author": ["Condé Nast", "Alex Delany"]}