{"id": "1a5d2d715002655ce97688414af710b6", "url": "https://www.bonappetit.com/recipe/hummus-with-spiced-summer-squash-and-lamb", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Hummus with Squash and Lamb Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueHummus with Spiced Summer Squash and LambBy Deb PerelmanJuly 9, 20194.3(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintIf you’re making this hummus recipe for a finicky crowd, serve all the toppings in separate bowls and let people help themselves. Lots of toasted pita for scooping up everything is nonnegotiable.Ingredients4 servingsHummus215.5-oz. cans chickpeas, rinsed1garlic clove, coarsely chopped½cup tahini3Tbsp. fresh lemon juice1¼tsp. kosher saltLamb and Assembly2tsp. kosher salt1½tsp. ground coriander1½tsp. ground cumin¼tsp. crushed red pepper flakes (optional)2Tbsp. extra-virgin olive oil, divided, plus more for drizzling1lb. ground lamb or beef3garlic cloves, thinly sliced, divided1lb. summer squash and/or zucchini, cut into ¾\" pieces¼cup chopped parsley or cilantroPreparationHummusStep 1Process chickpeas in a food processor until powdery clumps form, about 30 seconds. Add garlic, tahini, lemon juice, and salt and process until smooth. With motor running, drizzle in ½ cup water and process until hummus is very smooth, light, and creamy. Spoon onto a large plate.Lamb and AssemblyStep 2Mix together salt, coriander, cumin, and red pepper flakes (if using) in a small bowl. Heat 1 Tbsp. oil in a large skillet over medium-high. Add lamb and press into a large 1¼\"-thick patty; sprinkle with half of spice mixture and half of garlic. Cook, without moving, until browned and crisp, about 5 minutes. Turn over in pieces and cook until other side is browned and crisp, about 3 minutes. Continue to cook, breaking up and stirring, until cooked through, about 2 minutes longer. Using a slotted spoon, scoop lamb over hummus.Step 3Pour out and discard fat and wipe out skillet. Heat 1 Tbsp. oil over high. Cook squash in a single layer, undisturbed, until browned, about 4 minutes. Sprinkle with remaining spice mixture and garlic and cook, stirring, until squash is coated and cooked through, about 3 minutes. Spoon squash over lamb. Drizzle with more oil and top with herbs. Serve with pita.How would you rate Hummus with Spiced Summer Squash and Lamb?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleExcellent, made it with lamb for a party. Drizzled lemon juice over top with olive oil, then topped with cilantro!AnonymousSomers, NY8/25/2021YUM! Delicious as written and it came together in no time! Perfect for a weeknight. Riffable too, I can already see this as a rice bowl, salad, wrap...\nNext time though I'd double the squash. Also, I don't see why wiping out the pot in between is necessary? I sautéed my squash in the rendered fat / fond and it was to die for! Now that I think of it, the wiping may be to keep the squash vegetarian... At any rate, I used beef and will try the lamb next time! \nAlso, definitely top with labneh and sumac for utter culinary bliss!!SARosslyn, VA8/23/2021Excellent recipe, I would use ground leg chicken meat for the topping.\nAnonymousToronto Ontario.Canada7/20/2021Made exactly as written. Tasty, but a bit texturally monotone. It would benefit from some acid. I might try it again with a quick pickle, kimchi, or thinly sliced fennel and lemon juice. Salt levels in the recipe were fine as written. Nick TedescoNew York, NY5/10/2021This is one of my all time faves! I make this alll the dang time. It’s so good. I cut it in half to make it for 2 people. I don’t find it overly salty but I may cut down on the salt in the hummus. faithbCalifornia 8/12/2020Delicious!! I’ve made this twice already with ground lamb. I bought hummus from the grocery store. Also, used WAY less salt.AnonymousVienna, VA3/22/2020Absolutely delish! I halved the amount of salt for the lamb as I thought I could add more seasoning later if need be - didn't need it! Will definitely make this again. angelwhe12/5/2019Super tasty! This would be a great party snack! I actually made it with Beyond Meat Crumbles (we like to mix it up) & it totally worked. Can’t wait to try it with lamb or beef!chilliwilli123Los Angeles9/1/2019This was out of this world!!!  I never prepare the same thing two days in a row for dinner because I love to try new recipes, my husband raved so much about this dish I made two days later and its delicious cold too!! If your having a party or just inviting a few friends over for cocktails serve this as an appetizer along with pita chips, I made mine from flat bread I bought from the cooler section in the grocery store......where the pie crusts and pizza dough is located.  Follow the directions on the package and before you bake sprinkle with sea salt, fresh cracked pepper and oregano {I had fresh but you can use dried too) YUMMMMMMM!!!!!!bella1946Michigan8/29/2019This was delicious! Doubled the meat and seasoning, and it came out perfect. So did the squash. Used store-bought hummus. Served with a crumble of feta. Quick, easy, inexpensive and tasty. Will definitely make again.New York8/28/20193 and 1/4 teaspoons of salt for four servings. \n\nI suspect the \"anonymous\" reviewers are staff paid by Bon Appetit to review. The 5-star reviews and their \"alterations\" are always similar.AnonymousZanzibar8/27/2019Horrible. Insanely salty, and before you comment, yes I used Kosher salt. All I could taste was the salt.alaheyCalifornia8/27/2019This recipe was delicious.  I cut it in half and used a 1/4 of the amount of cumin recommended.  My husband is a deer hunter so the lamb was actually ground venison (all lab dishes in our house are made with venison).  So good.  I grilled pitas and sour dough bread.  It was yummyAnonymous8/25/2019I love the use of hummus here, and the thick cut squash as well. It was all delicious, and really quick to put together. I made a few modifications- I’m pescatarian, so I subbed out lamb for a salmon filet rubbed with the seasoning and roasted in butter. Also used pre-made garlic hummus, BUT it was from the farmers market so I feel like I get bonus points. Thanks for putting this up!AnonymousLos Angeles8/19/2019Explore Bon AppétitDipHummusMiddle EasternChickpeaBeanVegetableSummer SquashSquashGround BeefBeefMeatGround LambLambSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Deb Perelman"]}