{"id": "1a660e452eb2928a87dca6f76165dd69", "url": "https://www.bonappetit.com/story/best-insulated-cooler-bag", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "The Insulated Cooler Bag That Takes Beach Snacks As Seriously As I Do | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Cooler Bag That Takes Beach Snacks As Seriously As I DoI’m sorry, what? You have never even thought about an insulated cooler bag once? Oh. You must be one of those people who enjoys drinking nice hot cans of Coke at the beach.By Carla Lalli MusicJuly 23, 2018FacebookTwitterEmailFacebookTwitterEmailIt’s summer, which means we should all be thinking about peach cobbler recipes, restaurants with outdoor seating, and insulated cooler bags.I’m sorry, what? You have never even thought about an insulated cooler bag once? Oh. You must be one of those people who enjoys drinking nice hot cans of Coke at the beach and is known for showing up to picnics with warm, soggy watermelon and mouth-temperature bottles of rosé.On the other end of the spectrum, there are those of us who like “gear” as a category, take beach snacks extremely seriously, and thoroughly enjoy it when our friends say things like, “My god, woman, you’ve really outdone yourself this time.” For those people, there is one cooler bag and one cooler bag only, and that’s the AO Cooler 12-pack Deluxe Canvas Cooler (I have silver but the blue is real purty).I have been using this bag for four years and it still looks like I bought it a week ago. It has been road-tested on sandy beaches from one end of the Hamptons to the other, and has even made the ferry voyage to the North Fork of Long Island, where the beaches are rocky but the people are a lot more chill. What is also chill is everything I’ve ever put in this cooler, including but not limited to: Grain salads; frozen grapes; butter-and-ham sandwiches; cubed watermelon; Caprese salad; BLTs; PB&J’s; smoothies; yogurt and maple syrup bowls; hummus and barely-blanched green beans for dips; frozen yogurt squeeze tube things; ice-cold Cokes; seltzer; and cans of beer. Trust me, you want to come to the beach with me. I’m not playing.I did my research before committing to this brand, and even returned three of these things in various sizes before I settled on the 12-pack capacity, which is just right. The 36-pack was big enough to double as a tent for a golden retriever. Sometimes I wish I had the 24-pack size (that’s what’s featured, in the vinyl version, in the photo up top) but I know in my heart that I would bring way too much and the bag would be too heavy to carry when full. Keep it uncluttered unless you’re going on a four-day fishing trip, which is what these bags are primarily designed for.This cooler is awesome for a few key reasons:It’s soft sided, which means it can expand as you pack it, and it’s a lot more comfortable to carry on your shoulder than a hard-case cooler that bounces around giving you black-and-blue marks on your hips.It’s made of insulated vinyl, so it’s washable, leak-proof, doesn’t get hot in the sun, and won’t sweat on the outside (if it had condensation on it, sand would stick to it and generally make it unpleasant to be touch or use). I usually rinse or wipe it out when we get back from the beach and air dry it, and the inside smells like a brand-new Band-Aid to this day.It’s sturdy AF. The zipper makes that satisfying, deep rumbly sort of zipper sound when you call your child over to pull very hard on it while you squeeze the sides of the bags together because it’s packed maybe a little tighter than it should be. It’s got clips on the sides that you could use as carabiners in an emergency, and the shoulder straps are not going to fray or rip.Most critically, the foam insulation is the real deal. The website says it’s ¾” thick and “dense,” but I’m not about to cut mine open to confirm. All I know is that I like to get to the beach at 9 a.m. and stay until dusk and whatever snacks are left in the bag at the end of the day are still cold. What else matters, really?Free idea: Bring salted watermelon juice to the beach.\nPhoto by Alex Lau, food styling by Rebecca JurkevichWell, why should you believe me? I don’t camp, I don’t fish, and I don’t write equipment reviews for a living. I’m just a gal who loves going to the beach, loves bringing food to the beach (and also onto airplanes, and this bag is TSA-approved). On occasion, I might get super obsessed about researching something online before buying, and then talk your ear off about how great it is forever. If we met up one day on the beach and I had my AO Cooler with me and you had, like, a canvas bag flopped open so sand could blow right inside, I’d probably pass you a Zojirushi filled with frozen grapes and proceed to tell you all of this in person, too.Buy it: AO Coolers Deluxe Canvas Soft Cooler with High-Density Insulation, 12-Can, $60 on AmazonYou could transport a blueberry pie in that thing:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsSnackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-23", "author": ["Condé Nast", "Carla Lalli Music"]}