{"id": "1a799acb9e99a775cdc06ea9141da15a", "url": "https://www.bonappetit.com/story/miso-polenta", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "A Polenta Recipe to Make with Your First Spring Farmers' Market Haul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Miso Polenta with Your First Spring Farmers' Market HaulTake out your tofu and put away your winter coat.By Chris MoroccoApril 25, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailT.S. Eliot wasn’t kidding when he said that April is the cruelest month. For the first half, I was still wearing my winter coat every day, recovering from yet another cold, and contemplating early retirement in Florida. Since then, NYC has warmed up at whatever is slower than a snail's pace. So what does one make for dinner when there is asparagus in the supermarket but your heat is still on?Stir-fried spring vegetables over miso polenta is the meal equivalent of wanting it so badly to be spring yet recognizing it is 40 degrees outside with a brisk headwind no matter which way you are facing. Normally, making polenta means having a convenient excuse to use all the butter, milk, and Parmesan in my fridge. Using miso and water instead builds tons of flavor but keeps the texture light. The only rule is to never, ever, use instant polenta. It becomes a pasty textureless goo, and you are so much better than that. Even the coarsest stuff still cooks in about a half hour, and, no, you don’t need to stir it all the time. Just whisk it a lot as it thickens, then let it cook at a low simmer so it doesn’t plop on you or stick to the bottom of the pan.Once the polenta is going, tear the tofu into big pieces and crisp it in a skillet some vegetable oil (a non-stick skillet is great for this). With some exceptions, we highly endorse ripping tofu because it tends to get crispier and those jagged, non-square edges can also distract tofu skeptics. Transfer the tofu to a plate and brown the mushrooms in the same skillet. Add the spring onion bottoms and garlic once the mushrooms are browned, followed by the asparagus and snap peas. A few minutes of tossing it all together will turn the veg bright green but keep them partly crunchy.Now is the key part that everything depends on. Add the black bean sauce to the skillet; you have that, right? If you don’t, we apologize for making you go find it but please do. It is a literal flavor bomb, combining the earthy depth and funk of fermented black soy beans with soy sauce and often garlic. As Guy Fieri would say, it is a bullet train headed straight to Flavortown. There are many brands out there, all labeled some variant of “black bean sauce”. Just be careful of the ones that have chiles in them as well; they are delicious but can be intensely spicy. Our favorite brand is Lee Kum Kee.So the black bean sauce goes into the skillet with the vegetables along with a few glugs of water to make a rich, instant broth. Now toss the crispy tofu back in. That’s it. Just spoon out the polenta into the bottom of some shallow bowls and top with the vegetables and sauce. Top it all off with some chile oil, sesame seeds and spring onion tops. Then put away your winter coat and never look back.Make miso polenta right now:Miso Polenta with Spring Vegetables and TofuWe used to think making polenta meant deciding between adding butter and milk or taking a flavor hit and just using water. But miso adds the umami and richness we crave without dairy.View RecipeExplore Bon AppétitHealthyishPolentaMisoSpringVegetableVegetarianWeeknightDinnerRead MorecookingThis Millet Polenta Is Our Kind of Comfort FoodBy Laura WrightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Chris Morocco"]}