{"id": "1a7a5a858a3697093d0b30610740018c", "url": "https://www.bonappetit.com/story/plant-kween", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Plant Kween Is Here to Help Our Houseplants Thrive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePlant Kween Is Here to Help Our Houseplants ThriveChristopher Griffin has all the tips on keeping your green gurls alive and well through the winter.By Hilary CadiganJanuary 25, 2021FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailThis article is part of Healthyish at Home, a collection of tips, recipes, and stories about making our living spaces (still) feel great. If you’re not already following Christopher Griffin, a.k.a. @plantkween, on Instagram, know this: The possibility of making your life at least 10 percent more joyous is only a screen tap away. Since the beginning of quarantine, Griffin’s glowing self-portraits (always mid-laugh, decked out in something fabulous, and surrounded by a jungle of indoor plant life) and videos (always with a salutatory “daaah-lings!”) have acted as my digital wellness tonic—moments of verdant bliss in an endless feed of gloom and doom. The captions feel like texts from my most life-affirming friend packed with real usable tips on how to be a less-murderous plant parent: “The easiest way to propagate your Pilea is cutting those lil baby kweens you see popping up from her soil...then place her in water and watch her roots grow, hunty!”Griffin says that their grandmother, locally famous for the thriving garden she once kept in Philadelphia, is their primary botanical inspiration. But it wasn’t until five years ago, when Griffin adopted a struggling marble queen pothos and nursed it back to health (with help from a skylight and south-facing windows), that they began documenting their own personal houseplant journey. “It was such a simple joy, putting love, care, and attention into something like that,” Griffin recalls. “Taking care of my plants is a mirror to how I treat others—and myself. They give me space to be still, to be reflective, to be in nature in the comfort of my own home. And growth is the product, dahling!”This past summer Griffin welcomed an explosion of new Instagram followers to their little corner of the internet. “The Black Lives Matter marches had picked up, and there was a lot of centering of Black stories, Black narratives, and Black voices,” they say. “I think folks were just ready to pay attention, whether it was me talking about the various identities of my Black queer femme non-binary self, or just me being a plant parent, wanting to make my space lush because we’re all spending a lot more time indoors. It was a combination of those two things.”Today Griffin’s tiny Brooklyn apartment is an indoor Eden filled with 185 green gurls and counting—the perfect antidote to a long, dark, quarantined winter. So, desperate for some plant-induced endorphins of my own (and a solution for those scary-looking yellow mushrooms overtaking my bedside cane plant), I met up with the Kween over Zoom to answer all my burning-est botanical questions.What are the easiest-to-keep-alive houseplants for noobs and known plant murderers like myself?The snake plant is the queen of all plants. She is a wonderful air purifier and desert-resistant, so you don't need to water her often—I have about 25 of those gurls! The pothos is a fast grower and really easy to propagate, so if you want to green up your space with plants you already have, just snip, snip, snip, put them in water, wait about three weeks, and then bam, you have a new plant. And the ZZ plant is one of my faves because of its glossy leaves and ability to survive in a bunch of different lighting conditions—she can really bounce back from those plant parent mistakes we all make in the beginning.Where should we buy plants?I prefer small independent plant nurseries, but I won’t denounce anybody. Just make sure you check the plants for pests before you buy. Large shipments mean the plants likely spent a lot of time touching each other in transit, so you want to dig around in the soil a bit, looking for bugs or even mice. Make sure you're not bringing anything home besides the plant!Do you feel you could make any plant thrive at this point?Ooh, chile, no. Ferns are my weakness. If you live in a more humid region you can probably handle them, but in New York, where the seasons are so drastic, it’s hard. The only two ferns I have are the staghorn fern and a bird's nest fern—those are hardy! Folks are like, \"Oh my god. You must have the largest green thumb,\" but I don't believe a green thumb is something innate. It's something you have to grow and nurture over time. I've sent tons of plants to that little botanical garden in the sky, but I've worked hard to build a plant family that really works for me and my routine and my environment. It takes time, you know? And some plants aren't meant to be indoors. With houseplants, we're taking these wild little green creatures and we're trying to domesticate them. And some just can't be domesticated!So, this is a personal question but one that others might also be dealing with. This plant by my bed is growing some scary yellow mushrooms that look straight out of Alice in Wonderland. What should I do?Okay first off: Don't eat them, hunty! They might be poisonous. Mushrooms are usually a sign of overwatering; when soil is too moist, it allows for fungus to grow. So, first off, reduce the watering. And second, after you make tea, sprinkle some of your loose-leaf tea leaves over the topsoil. That acts as a deterrent for fungus to grow.Okay yes, let’s talk about watering. Because I’m pretty sure I’ve drowned every plant I’ve ever owned. How much water is just right?My general rule of thumb is to water once a week. Just make sure you soak the plant—which is best when you have terracotta pots with drainage holes so the excess doesn’t just sit there and rot the roots (also terracotta is inexpensive and she's on a budget, hello!). I'll put down a potting tarp and let all the green gurls' tears of joy drain from the pots so I know the water’s reached all parts of the soil. Then I let them dry, put them back up on their shelves, and don't touch them for another week. But in winter, a lot of plants are going dormant—trying to conserve energy and not sucking up as much water—so I push a lot of plants to once every two weeks. Cacti and succulents? Every three weeks to a month. Folks are drawn to succulents because of all the marketing behind them like, \"Oh, these are very easy to care for.\" And they can be, but they're often not in the vessels that are best for them. They really need drainage. Overwatering is the number one killer of succulents.Yikes. I bought a really cute pot but realized there's no drainage hole on the bottom. Do I have to get rid of it?No! You have two options: One is to drill a hole in the bottom of the pot, if you’re handy with a drill. (I am not, so I don’t do that, but some people do!) The other is to put lava rocks at the bottom of the pot so the plant's roots will sit above any excess water. Just be careful about overwatering from then on! If you name your plants and talk to them, do they live longer?My plants are all my Green Gurls, but I do like to call them by their scientific name when I can. They remind me of drag queen names. I mean, Ficus Elastica? Oh my goodness. That’s the rubber tree. Ms. Ficus Elastica. I don't talk to my plants unless I’m in a mood where I’m like, “You better grow, girl.” But if I knock into them or disturb them, I always say sorry. And I do play music for them—classical, soft jazz music. I have speakers in every room that has a plant in it. It's very intentional. There has been studies that show that if you play music for your plant, they thrive better—something to do with the vibrations from the music helping the cells grow. But it could also just be that people who play music for their plants are just really good plant parents, giving them the top level of care, so you never really know.Fiddle-leaf figs. Are they overrated?Ooh, they are some moody queens. MOODY. But I think they're wonderful plants—very pretty, wonderful leaves. My advice for folks who want to invest in a fiddle-leaf fig is to make sure that you give them a bright, sunny spot. An hour or two of full sun, if possible. Then do not move them around. Just sit that plant where she is and see how she does. If she starts to grow a new leaf, then you're onto something. If she starts losing leaves, wait two or three weeks, because often she just needs some time to adjust to a different environment. Just monitor her and see how she's doing and always look for new growth. New growth is a sign that she's adjusted to that spot.Much like people!That’s right, dahling.Explore Bon AppétitHealthyishHealthyish HomeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Hilary Cadigan"]}