{"id": "1a7c22642196c3198127827bfe9bcde8", "url": "https://www.bonappetit.com/story/best-weekend-ever-fan-appreciation", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "You Make All That We Do at Bon Appétit Worth It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Make All That We Do at Bon Appétit Worth ItIt really was the best weekend ever.By Adam RapoportOctober 22, 2019FacebookTwitterEmailPhoto by Rachel KartenFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Hot take: The best part of Bon Appétitʼs Best Weekend Ever wasnʼt the food (though I am still dreaming about Rick Martinezʼs bubbling vat of crispy carnitas, Konbiʼs Instagram-famous egg salad sandwich, and George Motz’s legendary smash burgers). The best part, as is the case with any great party, was the people.Want this letter before it hits the website? Sign up for our newsletter!Brad, sandwiched by fans!\nPhoto by David AlvaradoOver the course of four days and a suite of events—from intimate dinners and hands-on cooking classes, to a 2,000-person Hot 10 mega bash—I met BA fans from, quite literally, all over the country. At Brad Leoneʼs make-your-own sauerkraut class on Friday, two wide-eyed young women who couldnʼt quite believe they were in the BA Test Kitchen, caught me during my daily 3 p.m. espresso break. They introduced themselves, letting me know that they had jetted in from Wyoming and Nebraska, respectively. Normally, this would have stunned me, but the night prior, I sat down to Georgian-style feast prepared by Washington, D.C.ʼs Maydan restaurant, and dined next to a couple who had come down from Ottawa and across the table from two food-loving buddies who had traveled from a small town just outside Madison, Wisconsin. And so it went all weekend long. At Saturday nightʼs Hot 10 party, it was a roll call of podcast fans, video die hards and, yes, good old fashioned magazine readers, who arrived from Boston, Baltimore, D.C., Virginia, Dallas, and, of course, Brooklyn.At BA, we spend all day every day developing recipes and writing and recording and filming our stories. But we rarely get to meet all the people who consume our work. And so when the gentleman from outside Madison raised a wine glass to give a toast, he noted how appreciative he was “for a small town of just 2,000 people” to be able to get the quality and quantity of content on a daily basis from Bon App. Well, that was pretty cool. We love what we do at BA, and we try hard to convey that enthusiasm in all our platforms. To see firsthand that this is working meant the world to us.Alex Delany holding one of those killer smash burgers.\nPhoto by Rachel KartenIn the coming months, weʼll continue to expand our notion of what an editorial brand can do. We have live podcasts tentatively scheduled for January and April. Our Making Perfect: Thanksgiving six-part series just launched on our free streaming channel and will be rolling out on a weekly basis on YouTube. And keep an eye out for a much more dynamic online merch shop, coming to you just in time for the holidays.Sometimes we wonder why we give ourselves so much work to do. But when we get to meet so many BA fans out there, we remember why.Explore Bon AppétitAdam NewsletterHot 10 2019Read MorerestaurantsThe Hot 10: America's Best New Restaurants 2019By Julia KramercultureThe Hot 10 Is Here—and It Took a Ton of WorkBy Adam RapoportLifestyleThree Months, 200 Meals, and a LOT of Time on the RoadBy Amanda ShapirorestaurantsOur 50 Nominees for the Hot 10: America’s Best New Restaurants 2019By The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Adam Rapoport"]}