{"id": "1a855549204177a179b5b013c52ecc1b", "url": "https://www.bonappetit.com/recipe/fall-fruit-galette", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Fall Fruit Galette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueFall Fruit GaletteBy Carla Lalli MusicAugust 13, 20194.7(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOur favorite apples for baking are Pink Lady, Honeycrisp, and Granny Smith; they hold their shape well and don’t turn mushy when cooked. This would also be excellent made with Comise or Bartlett pears. You can play around by adding: 2 tsp. of fresh spices (think cinnamon, nutmeg, coriander, fennel), 1 tsp. citrus zest (lemon, lime, orange, grapefruit, added to the fruit filling), or a touch of heat (1 tsp. black pepper, 2 tsp. Taijín or Aleppo-style pepper, or ½ tsp. crushed red pepper flakes). For more galette inspiration, check out our Any Berry Galette and Peach-Plum Galette.Ingredients8 servingsDough1½tsp. sugar¾tsp. kosher salt1⅓cups (180 g) all-purpose flour, plus more for surface¾cup (1½ sticks) chilled unsalted butterFilling and Assembly2tsp. fennel seeds (optional)1tsp. kosher salt⅓cup sugar, plus more for sprinkling2lb. apples (such as Pink Lady, Honeycrisp, or Granny Smith), scrubbed, cored, thinly sliced1Tbsp. apple cider vinegar1tsp. vanilla extract1Tbsp. heavy creamSoftly whipped cream or vanilla ice cream (for serving; optional)Special EquipmentA spice mill or mortar and pestlePreparationDoughStep 1Whisk sugar, salt, and 1⅓ cups flour in a medium bowl. Cut butter into 6 rectangular pieces (if using ½-cup sticks, cut them in half crosswise, then in half again lengthwise). Toss butter in dry ingredients to coat, then dump mixture out onto a work surface. Most recipes start by pulverizing fat into small bits, but here you’ll use a rolling pin to flatten flour-coated butter into sheets that will puff into layers when baked.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 2Roll butter into flour until it is in long flexible strips, using a bench scraper to scrape butter off rolling pin or surface as needed.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 3Use bench scraper to gather mixture into a loose pile, then drizzle 4 Tbsp. ice water over.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 4Using your hands and the bench scraper, toss mixture until water is distributed, then gather into a rectangular pile.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 5Roll out dough to a long rectangle with short ends about 8\" wide, then use bench scraper to fold dough into thirds, like folding a letter. It will be very crumbly and loose; don’t panic. This turns the floury mass into a cohesive unit while creating flaky-making stacks of fat and flour.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 6Using bench scraper to help, turn rectangle 90° and repeat rolling and folding, gathering loose bits of dough from outer edges into the center and flouring surface as needed.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 7Repeat rolling and folding a third time. Dough should be somewhat homogenous and creamy-looking with some dry bits around edges. Squeeze a bit in your palm; it should loosely hold together. If not, repeat rolling and folding.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 8Wrap folded dough in plastic, then press it into a compact disk about 1\" thick. Chill 30 minutes.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 9Roll out dough on a lightly floured surface to a 12\"–14\" round or oval about ⅛\" thick (don’t worry about cracks around perimeter). Dust surface and rolling pin with flour as needed and rotate dough often to prevent wider cracks. If dough sticks to surface, lift on one side and scatter flour underneath before continuing. Roll dough onto your pin, then unfurl it on a sheet of parchment paper. Slide onto a rimmed baking sheet and chill while you prep the filling.Step 10Do Ahead: Dough can be made 3 days ahead. Keep chilled, or transfer to a resealable plastic bag and freeze up to 3 months. Thaw overnight in the refrigerator before rolling out.Filling and AssemblyStep 11Preheat oven to 400°. Toast fennel seeds (if using) in a small dry skillet over medium-high heat until golden brown and fragrant, about 3 minutes. Let cool, then finely grind in spice mill or with mortar and pestle. Transfer to a medium bowl and add salt and ⅓ cup sugar. Toss with your hands to combine, then add apples and toss to coat. Add vinegar and vanilla; toss gently.Step 12Arrange apple mixture in the center of chilled dough (still on parchment on baking sheet) and spread out evenly, overlapping slices if desired and leaving a 3\" border. Fold edges of dough up and over fruit, pleating as needed and being careful that folded edge of dough doesn’t tear (if it does, patch with dough scraps and pinch to seal). Pour cream into a small bowl and brush all over dough. Sprinkle sugar evenly over dough.Step 13Place galette in oven and immediately reduce heat to 375°. Bake, rotating halfway through, until crust is deep golden brown everywhere, apples are softened, and juices are bubbling, 45–50 minutes. Let galette cool 2 hours.Step 14Serve galette with whipped cream or ice cream if desired.How would you rate Fall Fruit Galette?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI have made this recipe over a dozen times and it has come out perfectly every single time. I use different fruit mixes as well. I always make this for my family and guests, who are always so impressed. Thank you Carla!! Tara New York, New York11/5/2020I love Bon Apetit’s series of galette recipes. I have made every one. I recently experimented with combing this galette dough with the apple filling from BA’s best apple pie and it was divine. Essentially you toss your apples with sugar, spices, lemon juice and vanilla, and then let them sit for an hour. Then you boil down apple cider, and add the accumulated juices from your bowl of apples until it becomes a thick appley-caramel, and the finally combine the appley-caramel with the apples. The filling cooked down to an almost apple-butter consistency. Everyone in my family has asked me to make this every weekend since. Also, I’ve noticed with the galette dough it really helps to let it sit overnight after you’ve completed the rolling and folding. The flakey laters increase ad infinitum.zpawlischMadison 10/3/2020the dough is much more simple than it appears! do it !!Long Island Aist?Kaunas, Lithuania8/27/2020I doubled the dough recipe portions for about 3 lbs of cape golden berries & blackberries. Who doesn't love buttery flaky goodness? ;) I wanted some height to the galette and intense overlap of dough with a 6 inch round peek-a-boo center, because it is so rare that we get to eat pie (cuz of my husband's allergy) My hubby is celiac, so to make it GF, I subbed Cup-4-cup flour and added about 2 tbsps more water than a (double) recipe called for. We loved this so much we've made probably 4 of them since the recipe was published. If you use a GF flour or make your own blend, make sure there is Xanthan gum in the mix, because you will need the binder to hold the dough together once all the filling juices and the melted butter gets going. When using GF dough also make sure to bake on a flat sheet. If you trap the liquids you'll just get mush instead of a flaky pie-y- crispity crunchetty goodness.  kcsandoval1992Rochester, NY12/11/2019my girlfriend made this for the first time tonight and followed the recipe exactly. Not sure about the rave reviews of this recipe but our final product was dry and tasteless. ~~sigharjunahawaii12/9/2019This was my first time making a Galette and i was a bit nervous, but it was so easy! I added the cinnamon and nutmeg and loooved the flavor. My whole family was happy. It was so easy that my little sister helped me and she enjoyed being in the kitchen. So good for a comfy family nightLupsMexico City11/2/2019This is my absolute go to dessert now! I didn't have fennel seeds but used a bit of nutmeg and cinnamon and it was great. I've made the dough from Carla's book many times and each time, it has been perfect! It is the first pie/galette dough I've ever made, thanks Carla!AnonymousSeattle10/19/2019I made this with the Bob's Red Mill 1:1 Gluten Free blend and Miyoko's vegan butter. I'd never made a galette or pie dough from scratch before. What a great exercise in patience and believing in yourself! The first portion went okay but when I went to roll it into an oval after chilling the dough just shattered. Not sure if I needed to let it warm more or if it was from the lack of gluten. It still worked out pretty well. I used a little of the vegan butter, melted, in place of the heavy cream. I would probably try a different blend or buckwheat flour next time, but the butter swap worked perfectly and the taste was great. Can't wait to slowly perfect my galettes! deadheadcyclistCalifornia10/9/2019This really was so good! I'm not usually good with dough, but this one was easy to work with and came out beautifully. I made the dough and chilled it for a day before rolling it out. I was also delighted that I didn't have to peel the apples! That seemed too good to be true, but I didn't notice the skins at all. The crust was flaky and delicious, and the vinegar added a tang I didn't know I was missing in apple desserts. I used a few varieties of apples, cinnamon, cloves, and nutmeg this time, though I'd like to try the fennel sometime. I made it a day ahead, covered it with plastic wrap and left it at room temperature, and then reheated at 300 for about 10 mins before serving with vanilla ice cream and my friend's beautifully candied pecans. We all loved it!AnonymousSaint Paul, MN9/20/2019I got the magazine in the mail today and had a bushel full of granny smiths from a friend's tree, so I decided to make this. Came out incredible, the crust was both crispy and flaky and the filling was not at all sweet, which I liked. The vinegar, sugar, and salt in the apple maceration made my extremely bitter and crunchy granny smiths, soft and sweet.  2lb of apples is too much though. I measured 2lb on the scale but still had probably 25% of the apples left over after. This quantity of dough just does not allow for that many apples if you want to fold over the crust as much as they do. Overall will repeat though. I served with some hand whipped fresh cream. acfzConnecticut8/21/2019Explore Bon AppétitGaletteDessertFruit DessertAppleFruitFallNut-FreeVegetarianBakingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Carla Lalli Music"]}