{"id": "1a898d5d214203d88fd10579f1663eaf", "url": "https://www.bonappetit.com/story/cucumber-chow", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "How to Make Trinidadian Cucumber Chow | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf It's Not Spicy Enough to Make You Sweat, It's Not ChowTrinidadian chow is refreshing, versatile, customizable, and ready in five minutes flat.By Lesley EnstonAugust 4, 2020FacebookTwitterEmailPhoto by Justin Bridges, Food Styling by Tyna HoangFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My first chow experience was in the kitchen of my mom’s childhood friend in Port of Spain, during one of our many visits from Toronto. As she and my mother laughed about their wild times as kids growing up in the countryside, she worked on several ingredients. No measurements were used, no cutting board. She just sliced things up, paring knife in one hand and green mango in the other, dropping pieces in a bowl without missing a beat, or, in fact, even looking at what she was doing. A long-leafed herb was torn into pieces and thrown in—I later came to find out this was shado beni. A copious amount of lime was squeezed over everything. She tossed it all together a couple of times, then put it down in front of me. I was suspicious (were those raw onions? Teenage me hated raw onions) but I was also raised right so I went ahead and dug in.“What is this?” I asked, heaping more forkfuls into my mouth. She chuckled and simply replied “chow.” I looked at my mom accusingly for never having made it for me. This simple snack was one of the most incredible things I’d ever tasted. I interrogated my mother’s friend on all the ingredients, and kept insisting there must be something else. She just kept laughing (as Trinidadians are wont to do). Why it’s called chow I don’t know, but I do know I chowed down so... too easy?This chow recipe uses both mangoes and cucumbers.\nAlex LauThis simple Trinidadian salad can be made with green mangoes, ripe mangoes, pineapple, apples… the options are theoretically endless. My personal favorite is a version with cucumbers. Their refreshing flavor and texture combines with the smoky heat of the peppers, bite of the garlic, herbaceousness of the shado beni, and zip of the lime to create a dish that is so much more than the sum of its parts and can be on the table in five minutes flat.In Trinidad, chow might be found for breakfast, as a snack, a topping for grilled steak, or fresh fried shark on the beach (that’s a whole other story). This cucumber version is a refreshing foil to grilled meats or fried foods, and a welcome addition to backyard cookouts or picnics.To make it, grab yourself a bowl. Peel and chop some cucumbers. How many you want is up to you—how many people are we serving? Two medium cucumbers will feed four as a side. It can be diced into cubes or cut into rounds—personal preference! Throw them in your bowl. Finely mince or grate a clove of garlic. You could add less, but you probably won’t want more. Chop a few shado beni leaves. A staple herb in Trinidadian cooking and a key ingredient in chow, shado beni—often called culantro or recaito in Latin America—is a distant, more pungent cousin to cilantro. It’s easy to find in Caribbean or Latin American markets, but cilantro can be substituted.Look for shado beni, a staple herb of Trinidadian cooking, at Caribbean and Latin American markets.\nPhoto by Justin Bridges, Food Styling by Tyna Hoang Using a small spoon, scrape out the seeds of half a Scotch bonnet pepper and discard—or leave them in if you can take the heat—then very finely mince the flesh. This is important. Biting down on a chunk of Scotch bonnet pepper is not for the faint of heart! (You can substitute jalapeños, serranos, or any other hot pepper for the Scotch bonnet, but you’d be missing out on the flavor.)Everything goes in the bowl. Generously sprinkle with salt. Juice a lime. A trick to get the most out of your limes: Roll them on a hard surface under your palm until you feel it start to soften. Even better, roll it on the floor with your foot, a trick my friend’s Dominican grandmother would call “going to the spa.” Stir it all together. This can absolutely be served immediately, but an hour or so in the refrigerator will allow the flavors to meld and the garlic to mellow out. Give it a taste and add more of whatever you like. Don’t have a lime? Try a lemon! Love onions? Throw them in there!Every Trinidadian makes theirs differently but all would agree: If there isn’t enough heat to make you sweat, it’s not chow. To this day I delight in first-time eaters insisting there’s got to be some secret ingredient I’m not sharing, to which I simply respond with laughter.Lesley Enston works in the arts and events space in Brooklyn, and enjoys testing, developing, and writing recipes centered around her Caribbean heritage. Skirt Steak With Grilled Pineapple ChowDial up the flavor of your summer steaks with chow, a sweet and spicy Trinidadian staple. View RecipeExplore Bon AppétitIt's That SimpleTrinidadianSaladCaribbean/Central AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-04", "author": ["Condé Nast", "Lesley Enston"]}