{"id": "1a9f172712012788f688d9fcbfc77335", "url": "https://www.bonappetit.com/story/flambe-guide", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "How to Flambe Safely | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Light Your Dessert on Fire Without Singeing Your EyebrowsBooze + flames = a total spectacle.By Kendra VaculinFebruary 25, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The only fires I start in my kitchen on purpose are for flambéed desserts. Standing at the stove, with a few friends seated at the table behind me, I’ll shout, “Are you ready?!” and then lower my lighter to the pan. With a whoosh, a crown of blue flames jumps up from the bananas (it’s usually bananas) swimming in a now rum-soaked caramel. The fire dies out, but the oohs and ahhs echo for hours afterward.A majestic way to end a meal, a flambé (“flamed” in French) is any dish that is doused in alcohol and lit on fire—usually sweets, though the technique can be applied to savory items and sauces as well. Nothing about a flambé is subtle: From the boozy flavor to the (gonna say it again) literal fire, it’s an attention-grabber deserving of its stereotype as a tableside spectacle at a fancy restaurant. But desserts made using this technique are much simpler to execute at home than they may seem. With the right tricks up your sleeve, you can collect the same oohs and ahhs without a dinner reservation or any risk of burning your sleeve.Pick the right bottle.Potency and flavor are important when choosing a liqueur or spirit to use in your flambéed desserts. Look for something that measures around 40 percent alcohol by volume (i.e., most spirits and liqueurs)—less and you won’t get real flames, more and you’ll have a blaze on your hands. Choose a liqueur that will act as a complement to the other flavors in your dessert. Crêpes Suzette calls for Grand Marnier to echo the orange flavor, cherries jubilee leans toward Kirsch, and anything with winter fruit would benefit from a splash of Calvados or pear brandy.A little goes a long way.Even the tiniest drizzle of booze with the appropriate alcohol content will light on fire, so you don’t need to glug very much onto your dish to get your flame on. Of course, the more alcohol you add, the longer it will burn and the boozier the finished product will taste. For the best of both worlds—a balanced flavor and impressive but controllable burn—max out around 1 Tbsp. alcohol per serving.Turn off the heat.The fire in a flambé is all show—aside from burning off the alcohol in the added liquor, it’s not cooking anything. So once your bananas or pile of saucy crêpes reaches your ideal state of doneness, move the pan off the heat or simply turn off the burner. This way you won’t risk overcooking anything during the fiery display.Use a long-reach lighter.The flames are liable to get pretty high, so it’s best to keep your face (and clothing!) away from the danger zone. Some recipes suggest lighting your flambé by turning on a burner and tilting your pan slightly toward the flame so it licks the edge and catches on the contents—I find that unnecessarily tricky and also a little spooky. Instead, I start the fire with a long-reach lighter, the kind I use to light deep candles. You have more control over the lighting process and don’t have to get too close to the action.Bic Multi Long-Reach Lighter$16 at AmazonLean in to the hot-and-cold.Play up the fire component of your dessert by serving it with something cold. Vanilla ice cream is a classic addition, but a swoosh of yogurt on the serving plate or a drizzle of cold cream straight in the pan works just as well.Relish in the ease.Especially with fruit-forward flambé desserts, the process is much simpler than the final plating (and blue-flame display) would suggest. Once you make bananas Foster at home, you’ll turn to the recipe again and again—in large part because it takes mere minutes and almost every ingredient is a fridge or pantry staple. When people come over for dinner and ask what they can bring, I’ll often say a bunch of bananas and a pint of vanilla ice cream. Little do they know they’re in for dinner and a show, and I’ll only have one extra pan to clean.Go bananasClassic Bananas FosterOur method for lighting this retro New Orleans dessert on fire delivers maximum drama with none of the danger.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-25", "author": ["Condé Nast", "Kendra Vaculin"]}