{"id": "1aa026180aebb890c5df2d7154154fb5", "url": "https://www.bonappetit.com/story/butternut-squash-morning-glory-muffins", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "These Butternut Squash, Coconut, and Ginger Morning Glory Muffins Will Make You a Morning Person | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Butternut Squash, Coconut, and Ginger Muffins Will Turn You into a Morning PersonA breakfast classic gets a nutty, zingy update that’s actually worth getting out of bed for.By Jesse SparksOctober 8, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailIf you know me, you know I have mixed feelings about mornings. Sure, sure, a steaming mug and a scenic sunrise is quaint, but I’d rather spend those 30 minutes tangled in my warm sheets instead. Never have I ever had one of those idyllic coffee commercial moments where I gleefully spring out of bed before my alarm, just to sit at the kitchen counter by myself at 6 a.m. BUT, I will always hop out of bed for muffins. Moist, fluffy, pillowy muffins. And this brand new recipe for butternut squash, coconut, and ginger morning glory muffins from senior food editor Anna Stockwell is no exception. If you weren’t a morning person before, trust: these muffins will get you.Normally, morning glory muffins are chock full of grated carrots (and maybe some raisins for pizzazz), but this new riff exponentially increases the cozy factor with doses of nutty coconut, fresh squash, and a bright ginger zing. I already know what you’re thinking: “Vegetables? In the morning?!” To which I’d respond, “Have you seen the dazzling brown sugar crystalline crust!?”It helps too that they come together so easily you could make them half asleep. And let’s be real, we know you will be. But after just 30-ish minutes in the oven (i.e. the amount of time you spend staring into space in the shower), you can be chowing down on a batch of muffins so satisfying, you’ll question why you ever hated mornings in the first place.Get the recipe:Butternut Squash, Coconut, and Ginger MuffinsLike the best possible Morning Glory muffins but with grated butternut squash instead of carrot.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-08", "author": ["Condé Nast", "Jesse Sparks"]}