{"id": "1ab35c927d5a65b032e1b48bca7d2a6b", "url": "https://www.bonappetit.com/recipe/pork-and-kimchi-dumplings", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Pork and Kimchi Dumplings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork and Kimchi DumplingsBy Christina ChaeyJanuary 28, 20224.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susan Ottaviano EmailPinterestPrintEmailPinterestPrintThese crispy, pan-fried little parcels are filled with ground pork and kimchi which, like cilantro and lime or dal and rice, just go together. Make the filling up to a day in advance, then enlist friends or family members to help you wrap. You can get as basic or as fancy as you’d like with your pleats; for a step-by-step tutorial on the pleat instructions I describe in the recipe, check out this terrific guide on The Woks of Life  under “#4: The Bi-Directional Pleat.\" For maximum efficiency use a very large lidded nonstick skillet so you can cook up to 25 dumplings at once. The technique of steam-frying the dumplings in a combination of water and oil ensures the filling stays juicy while the bottoms get nice and crispy.If you don’t plan on eating all the dumplings at once, freeze any leftover uncooked dumplings in a single layer on a rimmed baking sheet lined with parchment paper for a couple of hours. When the dumplings are frozen solid, transfer them to a resealable bag and store them in the freezer so you’ll always have a 10-minute meal at the ready when you have no idea what’s for dinner. —Christina ChaeyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonMesh Sieve$13 At AmazonLarge Nonstick Skillet$50 At AmazonWooden Spoon$6 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes about 502Tbsp. black (Chinkiang) vinegar or unseasoned rice vinegar¼cup plus 2 Tbsp. soy sauce2½tsp. sugar, divided1½tsp. gochugaru or other mild red pepper flakes, divided116-oz. jar Napa cabbage kimchi1lb. ground pork (not lean)4scallions, thinly sliced2garlic cloves, grated12\" piece ginger, peeled, finely grated¼cup low-sodium chicken broth or water3Tbsp. toasted sesame oil2tsp. oyster sauce1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. freshly ground white or black pepper50fresh or frozen thawed gyoza or other round dumpling wrappers2Tbsp. vegetable oil, dividedPreparationStep 1Stir black vinegar, ¼ cup soy sauce, ½ tsp. sugar, and ½ tsp. gochugaru in a small bowl until sugar is dissolved; set dipping sauce aside.Step 2Drain kimchi in a strainer set over a medium bowl in the sink. Wearing gloves, squeeze all juice out of kimchi; reserve kimchi juice for another use (it’s great in soups!). Chop kimchi and set aside (you should have about 1½ cups).Step 3Using clean hands, mix pork, scallions, garlic, ginger, broth, sesame oil, oyster sauce, salt, white pepper, remaining 2 Tbsp. soy sauce, remaining 2 tsp. sugar, and remaining 1 tsp. gochugaru in a large bowl until well combined. Switch to a wooden spoon and mix, stirring in one direction, until a thin white film forms on the sides of bowl, about 4 minutes (this ensures the filling will hold together when spooned into wrappers and also doubles as your arm day workout.) (Alternatively, mix filling in a stand mixer fitted with the paddle attachment on low speed until a film forms on the sides of bowl.) Mix in reserved kimchi. Chill filling while you set up your dumpling wrapping station.Step 4Line 2 rimmed baking sheets with parchment paper. Set wrappers on a small plate and loosely cover with a damp paper towel to prevent them from drying out while you are folding dumpings. Place a small bowl of water near your work surface.Step 5You’re ready to wrap! Lay a wrapper flat in the palm of your nondominant hand. Spoon a heaping teaspoonful of filling into center of wrapper. Dip a finger of your dominant hand into bowl with water and moisten the half of wrapper nearest to you. Bring moistened wrapper half together with dry half to form a semicircle and pinch middle to seal. Working from one corner toward the middle, create 1 or 2 pleats along one edge of dumpling; repeat working from the opposite corner. Place dumpling on a prepared baking sheet so the pleated side is facing up and the dumpling has a flat bottom (this is the side that’s going to get maximum crisp!). Cover with a damp kitchen towel or a sheet of plastic wrap and repeat process with remaining wrappers and filling.Step 6Pour 1 Tbsp. vegetable oil into a cold large nonstick skillet with a lid and swirl to coat bottom of pan. Arrange half of dumplings, flat side down, in a single layer in skillet, then carefully pour in enough water to cover bottom third of dumplings (about ½ cup). Cover skillet, place over medium-high heat, and bring to a simmer. Reduce heat to medium and simmer dumplings until water is almost completely absorbed, about 5 minutes. Uncover and cook until skillet is dry and bottoms of dumplings are deep golden brown and crisp, about 3 minutes. Transfer dumplings to a platter. Swirl remaining 1 Tbsp. vegetable oil into skillet and repeat cooking process with remaining dumplings (or freeze the rest for a rainy-day snack).Step 7Serve dumplings hot with reserved dipping sauce alongside.Do Ahead: Filling can be made 1 day ahead; cover and chill. Dumplings can be formed 2 months ahead; freeze in a single layer on a baking sheet until solid, then transfer to a resealable plastic bag. Cook dumplings from frozen as directed above.How would you rate Pork and Kimchi Dumplings?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleCan you cook these in an air fryer, and for how long?AnonymousShenandoah Valley, VA1/29/2022How is the kimchi made!!!?????Anonymous1/29/2022Explore Bon AppétitDinnerAsianEast AsianNut-FreeDairy-FreeDumplingPorkMeatGround PorkKimchiMainStarterSteamFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-28", "author": ["Condé Nast", "Christina Chaey"]}