{"id": "1ab47843c0b2024948df69ad03f5878c", "url": "https://www.bonappetit.com/story/braised-turkey-legs-thanksgiving", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Maybe You Shouldn’t Roast Your Turkey This Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaybe You Shouldn’t Roast Your Turkey This YearWhy editor in chief Adam Rapoport would rather make braised turkey legs.By Adam RapoportNovember 13, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Don’t roast your turkey this yearIf I could offer one piece of Thanksgiving advice, it would be this: braise your turkey.I know, I know—am I insane! Am I really telling you not to roast your bird, to not present a Norman Rockwell-worthy centerpiece for your holiday table?Yes, that is exactly what I’m telling you.A couple years ago, I riffed on Bon App’s braised turkey legs recipe and it was a revelation—rich, tender, fall-off-the-bone meat, cloaked in a silky, oniony, wine-y gravy. It was like turkey carnitas.Want this letter before it hits the website? Sign up for our newsletter!And I was even able to cook the entire dish ahead of time, so I never had to worry about frantically checking the doneness of the bird, or comparing the temperature of the dark meat to the white, or fretting about opening the oven door too often.The the most important step in the braising process is your first step: Call your butcher or ask the meat counter of your go-to grocery store if they can break down a turkey for you. You want the legs and thighs removed (I like them separated, so you’re left with four large pieces), and then have the breast meat taken off the bone.Christopher TestaniThis will allow you to braise your dark meat in a Dutch oven early in the day. And if your butcher counter is a full-service type joint, they’ll roll and season and maybe even wrap your turkey breast in pancetta or bacon. Then you can roast it in the oven to pin-point doneness as a porchetta-style roast turkey, in far less time than it would take to cook a whole bird.When my wife and I last hosted two years ago, the rolled breast was...good. Ideal for next-day leftover sandwiches.But the braised dark meat stole the show. Just before sitting down, I hit the slow-cooked legs and thighs with the broiler to crisp up the skin. Then I pulled the meat off the bone, shredding it with a couple forks and set it on a large platter. I  studded it with cipollini onions from the pot and bathed the whole thing with the fragrant braising liquid.There were no leftovers. And what’s a better compliment than that?Get the recipes:Stock-Braised Turkey LegsPorchetta-Style Turkey BreastExplore Bon AppétitTurkeyThanksgivingAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Adam Rapoport"]}