{"id": "1ab8ab015514ec55479b7f4a376651ab", "url": "https://www.bonappetit.com/recipe/bourbon-fruit-tea-punch", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Bourbon Fruit Tea Punch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueBourbon Fruit Tea PunchBy Vivek SurtiSeptember 17, 20195.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrintThis recipe is from Vivek Surti of Tailor in Nashville, No. 7 on our Hot Ten list for 2019. His spiked fruit tea is intentionally not too boozy, but you can also leave the bourbon out. “When I was growing up here,” the Nashville native says, “restaurants had three drinks: water, sweet tea, and fruit tea. Our welcome cocktail is an homage to the latter, as well as to punch’s Indian heritage. (Punch comes from the Hindi word paanch, which means ‘five’ since originally there were only five ingredients.) I love fruit tea and wanted to bring it back—with bourbon.”IngredientsMakes 86black tea bags or 3 Tbsp. loose black tea½cup sugar¾cup fresh orange juice¾cup pineapple juice½cup plus 2 Tbsp. fresh lemon juice1½cups bourbon (such as Buffalo Trace)Mint sprigs and lemon wheels (for serving)PreparationStep 1Brew tea in 2 cups boiling water in a teapot or measuring glass 5 minutes. Remove tea bags; discard. Add sugar to tea; stir to dissolve. Let cool 10 minutes, then transfer to a pitcher. Add orange, pineapple, and lemon juices and 4 cups cold water; stir well to combine. Chill fruit tea until cold, at least 2 hours, or cover and chill up to 2 days.Step 2To make cocktails, pour 1½ oz. bourbon into each of 8 ice-filled glasses. Add 6 oz. fruit tea to each and stir to combine (you may have tea left over). Garnish with mint sprigs and lemon wheels. Alternatively, combine 6 cups fruit tea and 1½ cups bourbon in a pitcher. Pour among 8 ice-filled glasses; garnish.How would you rate Bourbon Fruit Tea Punch?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllAmericanBourbonWhiskeyAlcohol & Other DrinksFallEasyDrinksThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}