{"id": "1abad6dde989c2cc3455165ca9bd3c41", "url": "https://www.bonappetit.com/recipe/karak-chai", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Karak Chai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKarak ChaiBy Zaynab IssaApril 26, 20214.1(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintKarak chai is a style of masala chai that translates from Hindi to “strong tea.” It’s rich and creamy thanks to evaporated milk and is usually made with fewer spices than masala chai. Recipes vary family to family and some may include saffron.  This version is adapted from my cookbook, Let's Eat. —Zaynab IssaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonSmall Sieve$8.99 At AmazonIngredients6 servings4Tetley British Blend or Orange Pekoe tea bags13cardamom pods, cracked13\"-long cinnamon stick3Tbsp. (or more) sugar1tsp. vanilla extract1cup evaporated milkPreparationStep 1Bring 6 cups water to a boil in a medium pot or tea kettle. Add tea bags, cardamom, cinnamon, sugar, and vanilla extract and return to a boil. Stir in evaporated milk and return to a boil again, watching carefully to ensure the tea doesn’t boil over. Reduce heat to medium-low and simmer until thick, creamy, and caramel in color, about 30 minutes. (The longer the tea simmers the stronger and creamier it will be.)Step 2Strain tea through a fine-mesh sieve into mugs; discard spices and tea bags.Adapted from LET'S EAT by Zaynab Issa. Copyright © 2020 by Zaynab Issa. Reprinted with permission. All rights reserved.How would you rate Karak Chai?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangle13 cracked cardamom pods? Does this mean that I should smash the pods, or that I should remove the seeds from the pods and smash them? It would release much more flavor if the seeds were removed and cracked.AnonymousHalifax, Nova Scotia 1/27/2022I don't care for the taste of evaporated milk but whole milk works just fine. I like to add a few cracked peppercorns to the mix along with some star anise. CarswellCanada12/6/2021Delish recipe. And it perfumes the whole apartment. I'll add a couple whole cloves or star anise on occasion. GA ChristensenChicago, IL7/26/2021This is my favorite chai drink. I am now buying evaporated milk to make this. Sometimes I add whole cloves too. Yummy!  So much better than mixtures from spice shops. Amy SpiegelSanta Monica, CA6/2/2021The best easy drink I’ve had. I used a store brand (read: cheap!) breakfast blend black tea and it was delicious. AnonymousMN5/27/2021This recipe is great - I used whole milk instead of evaporated and it still tasted deliciousHannahDallas, Texas5/26/2021Explore Bon AppétitHot DrinkDrinks AllIndianSouth AsianAsianCardamomHerbs & SpicesCinnamonEasy5 Ingredients or FewerDrinksVegetarianNut-FreeGluten-FreeKetoNonalcoholicRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-26", "author": ["Condé Nast", "Zaynab Issa"]}