{"id": "1abbe4a4e3a375cceffde26f6253589d", "url": "https://www.bonappetit.com/story/nice-day-nyc", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "My Perfect Nice Day Order Includes, Uh, One of Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Perfect Nice Day Order Includes, Uh, One of EverythingBy which I mean: Get the shake shake shrimp.By Ali FrancisOctober 19, 2020FacebookTwitterEmailPhoto by Mischelle MoyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I consider myself to be very easy-breezy when it comes to ordering takeout from new spots. I will say, “Surprise me!” to the voice on the line, then quickly clarify my preferences. This frustrating dance translates into: Feed me whatever you want...so long as it is also what I want. Like I said, easy-breezy!The folks at Nice Day—a new Chinese American pop-up by Junzi Kitchen, which has been running out of its Bleecker Street location since August—handled this conundrum expertly. In addition to my very unsubtle pleas for mapo tofu, kung pao chicken, and beef chow mein (“Ha ha, oh, truly, whatever you recommend though!”), they added a surprise to my ticket: shake shake shrimp, a.k.a. an excellent take on the Chinese American classic orange shrimp.Executive chef Lucas Sin’s goal is for the restaurant to carry on the legacies and techniques—like velveting and egg drop—developed by Chinese people living and cooking in the United States for over 150 years. In his mind, that is authentic. “It’s just authentic to a community and to a culture that isn’t in China itself,” he says. “Our job, opening a restaurant like this, is to stay faithful to our understanding of this regional cuisine.”While conceived before the pandemic, Nice Day is certainly a child of our current crisis. According to Sin, many of the Chinese takeout joints across the U.S. lost business not just because of COVID-19 closures but because of the associated anti-Asian and anti-Chinese sentiments. Combine this with a wave of Chinese restaurant owners retiring and you have another crisis on your hands—a whole cuisine in mass decline. Sin hopes to “double-down” on making and serving Chinese American food “the way it’s supposed to be.” To the chef, that means a menu full of fresh takes on old favorites, perfected for this new era of takeout and delivery.My chicken wings, an order ubiquitous to most Chinese restaurants across the country, arrived encased in an impossibly light batter. “It’s just salt, garlic, and onion,” says Sin, upon further interrogation. “No funny tricks here.” The kung pao chicken packed a perfectly spicy and peanutty punch. The beef chow mein was loaded with a rainbow of fresh bell peppers and bean sprouts and the chewiest egg noodles I’ve ever eaten. And the mapo tofu was rich, thick, and laced with tingly Sichuan peppercorns.Then came the wildcard: shake shake shrimp. The crunchy little nuggets are fried in the same barely-there coating as the wings and delivered with a sauce—orange, General Tso’s, or sweet and sour—on the side. The idea, as you may have guessed, is that the sauce is poured on top of the piping shot shrimp and shaken up right before eating. Why? “Because I love when crispy food is delivered crispy,” Sin says, of America's favorite texture.As someone who is not only not-Chinese, but also not-American ( 🐨), what I can say is that everything at Nice Day is delicious. Towards the end of our meal, the friend I had over for my living room floor picnic eyed our almost-empty paper box of shrimp, looked back at me, and demanded: “How is this so good?” Sin is not only making exceptional food but honoring the generations before him while building a restaurant for the future. Starting a new restaurant in a pandemic may seem like a gamble, but maybe it’s for the best that sometimes the path chooses us. By which I mean: GET THE SHAKE SHAKE SHRIMP.Go there: Nice DayExplore Bon AppétitRestaurantsHighly RecommendChineseNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-19", "author": ["Condé Nast", "Ali Francis"]}