{"id": "1acf1aa6d1f06856c91ade0f75680df0", "url": "https://www.bonappetit.com/story/i-miss-my-bar-white-noise-app", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "I Miss My Bar Is a Website That Lets Me Create the Perfect Bar Ambiance at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Website Lets Me Create the Perfect Bar Ambience at HomeSome people listen to waves crashing on beaches to unwind. I prefer a mix of “bartender working” and “people talking.”By Priya KrishnaMarch 11, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailBefore the pandemic I had this very specific routine whenever I would meet someone out for dinner. I’d show up to the place about 20 minutes before the reservation, find a spot at the bar, and order a drink. I’d eavesdrop on conversations, strike up a chat with the bartender, glance at other tables to see what looked most exciting to order. The frenetic energy of a busy New York restaurant always brought a deep sense of calm, erasing any impulse to scroll Instagram or check my texts. In those moments, I could just sip my drink and feel at ease (a feat for this type-A, anxiety-riddled human).It’s been almost exactly a year since I last sat alone at a bar. I’d showed up early to a friend’s birthday dinner at Hearth in mid-March, ordered a glass of red wine, and surveyed the restaurant. But things felt different. The dining room was empty. The bartenders were visibly nervous. I couldn’t resist the urge to keep getting up to wash my hands.For months during the pandemic I tried to recreate some version of my bar ritual at home. I’d wrap up work, put on Ella Fitzgerald or Sam Cooke, and pour myself a glass of wine or a cocktail. It was nice, but never as good as going out. Sitting by yourself just doesn’t hit the same way when you’re actually alone.Then, about a month ago, Andréa Hernandez (creator of the Snaxshot newsletter) Tweeted about a site called I Miss My Bar. It was launched last June by René Cárdenas and Oscar Romo, who run the popular Maverick Monterrey in Mexico. The idea behind the project was to help users (me!) recreate their ideal bar ambiance at home. It’s incredibly straightforward yet extremely effective. The single page site lets you toggle between familiar sounds: A bartender shaking a cocktail or muddling herbs, the thrum of cars driving down the street, or the gentle pop of a wine bottle and the slow, easy pour into a glass. You can turn on multiple tracks at once, raising and lowering their volumes to create a custom mood. My perfect evening is a combination of “bartender working,” “serving drinks,” and “rain on window” (on full blast), with “people talking” and “street ambiance” in the background. There are also rotating playlists on the site, curated by different bars, that accompany the sounds.Cárdenas’ creative studio, Tandem, designed the look and feel, and Lagom developed the site. Most of the sounds were recorded at Maverick itself (if you listen closely to “street ambiance,” you can hear the shouts of the local bread guy selling his goods), while others were borrowed from online sound libraries. “A bar is not just about the actual cocktail,” Cárdenas says. “It is about the experience. It is about being there with friends, yet being surrounded by strangers. Even though they are strangers, you feel some company [with them]. It is about the music, the smell, the sound. We tried to make this some sort of companion of the experience—giving people a tool to take the bar home.”I usually head to I Miss My Bar during the last few hours of work, or when I’m starting up a happy hour in my living room for my partner and me. I know friends who have come to rely on listening to other sounds—a busy coffee shop or waves crashing on a crowded beach—that evoke pre-pandemic moments. But the bar noises are what do it for me (and over 500,000 other unique monthly site visitors). I know it will probably be a while until I can set foot in a busy bar and perch on a stool, taking in the energy of the place. I Miss My Bar gives me a taste of those serene moments, while reminding me of what I have to look forward to post-pandemic. And for now, I’ll drink to that.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-11", "author": ["Condé Nast", "Priya Krishna"]}