{"id": "1add4f2f55629e83b7fcb46aa51a61cb", "url": "https://www.bonappetit.com/story/2022-resolutions", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Why I'm Doing Resolutions Differently This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Doing Resolutions Differently This YearOur latest print issue is all about ditching that diet and eating to feel good.By Dawn DavisJanuary 16, 2022FacebookTwitterEmailPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranFacebookTwitterEmailWe’ve had our holiday excesses. Too many parties—yes, that’s a thing! Too much rich food. Too many cocktails. Now we’re making promises to ourselves. Raise your hand if you’ve made any of the following pledges:I’m going to eat healthier and maybe even pursue a dry January (Christina Chaey’s plan to cook, eat, and drink “Healthyish” in 2022 to the rescue). I’m going to cook more meals at home so I can save for that vacation I’ve been craving (enter quick and flavorful weeknight recipes developed by our test kitchen, like Creamy Spinach and Chickpeas and this Sheet-Pan Chicken and Squash Salad). I’m finally going to renovate my kitchen (with the help of designer Elizabeth Roberts’s kitchen layout advice). For these New Year’s resolutions and others, Bon Appétit has you covered. Plus, we’ve got a rice story by Jessica B. Harris, whose book, High on the Hog, was the basis for the popular Netflix documentary series. And as we make our way through the gloom of February, test kitchen director Chris Morocco adds a little color to our lives with a bright and seasonal series of winter salads. We love these bright and crunchy dishes because they’re hearty and delicious—not because we’re on a diet. As you’ll note, that wasn’t on the pledge list, and after reading senior staff writer Alex Beggs’s deep dive on what she calls “The Diet Delusion,” you’ll know why. So here’s to ditching that diet and eating in ways that make us feel good in 2022.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-16", "author": ["Condé Nast", "Dawn Davis"]}