{"id": "1adfeac8c90898ae74690ff4861faca7", "url": "https://www.bonappetit.com/recipe/mezcal-sour", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Mezcal Sour Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueMezcal SourBy Arley MarksJanuary 8, 20194.9(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis tangy-sweet cocktail gets its lofty, fluffy froth from egg whites and a two-step mixing technique. The first shake, without ice, helps create the foam. After adding ice, the second shake chills the drink and further aerates the whites. This recipe is from Honey's in NYC.IngredientsMakes 11½oz. fresh lime juice1½oz. Yola Mezcal1oz. Amaro Montenegro or Nonino1tsp. light agave nectar1large egg whiteAngostura bitters and lime twist (for serving)PreparationShake lime juice, mezcal, amaro, agave, and egg white in a cocktail shaker (or in a tightly lidded 1-qt. glass jar) until frothy, about 1 minute. Fill shaker with ice, cover, and shake again until outside is frosty, about 30 seconds. Strain through a fine-mesh sieve into a coupe glass. Garnish with a few drops of Angostura bitters (drag a toothpick through drops to create a swirly pattern if you wish). Top with lime twist.How would you rate Mezcal Sour?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleReally enjoyed this. I'm new to the mezcal scene and was looking for new mixers for it. Bought the amaro montenegro just for this recipe. Now I need to find other mixers for the amaro. Veloholicsouth louisiana3/18/2021Wonderful riff on a traditional sour. I used Amaro Nonino this time. Am looking forward to trying other Amaros. MJLas Vegas, NV3/3/2021Delicious. Used Amaro Siciliano because it was all I had but the drink was very tasty. Into the rotation it goes. AnonymousToronto, ON Canada 12/8/2019good articleAgave10/20/2019So yummy!AnonymousNYC1/14/2019Explore Bon AppétitCocktailDrinks AllMezcalAlcohol & Other DrinksLimeCitrusFruitAmaroDrinksHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Arley Marks"]}