{"id": "1b0287f9c082d2924cb0531eaad227f8", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/chambar", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Chambar Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverChambarCivilized debauchery for breakfast, lunch, and dinner in CrosstownFacebookPinterestTwitterEmailScott Little GO HERE: for fine dining with cheek. Chef Nico Schuermans weaves together Belgian, North African, Persian, and Mediterranean influences, and the result is consistently excellent food. Unrelenting attention to detail is Chambar’s hallmark, applied both to the restaurant’s food and its atmosphere.ORDER THE: mussels Congolaise with frites (a side of sourdough for broth-dipping is essential), the tajine d’aziz à l’agneau (lamb shank tagine), and the flétan et noix de cajoux (halibut with cashews and pomegranate molasses). The morning options are imaginative and skillfully executed—think the gaufre au saumon with yuzu-dill hollandaise and bol santé with savory granola and a marinated egg. Not everyone has caught on to the fact they now do brunch, so seize the moment.THE VIBE IS: slightly racy and rebellious. It’s fine dining that doesn’t take itself too seriously, set to ’60s soul and served by a team that always seems like they’re all in on some wicked secret. They’ve been doing things their own way since 2004. Schuermans and his business partner and wife, Karri, have managed to make each section feel intimate despite the large space, with a gilded interior of wood, brick, tile, and a constellation of sculptural lighting.PRACTICAL STUFF: Open every day,  from 8 a.m. to late (a.k.a. whenever the Schuermans’ party is over). Reservations accepted online or by phone.—Lindsay AndersonJenna LowWE ALSO LOVEUpstairs at Campagnolo“Camp Upstairs” in Strathcona is the only carpeted dive bar you’ll want to spend time inCafé MedinaThe city’s downtown brunch institutionSt. LawrenceTake a “trip” to Quebec via Vancouver’s Downtown EastsideExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}