{"id": "1b1c675dac754c7344680b686a35651f", "url": "https://www.bonappetit.com/story/my-life-with-edna-lewis", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "How Edna Lewis Taught Scott Peacock to Embrace His Heritage as a Southern Chef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Life With Edna LewisChef Scott Peacock reflects on his decades-long friendship with Edna Lewis, and what it means to be a Southern chef.By Scott PeacockMarch 23, 2021FacebookTwitterEmailPhoto by John T. Hill, courtesy of Alfred A. KnopfFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.Before I met Edna Lewis, I thought the South was something to recover from. I was eager to put my Alabama childhood behind me. Eager to forget summers spent picking peas in fields of hard red clay and cutting okra at dawn and dusk to escape punishing heat. And even though my Grandmaw Peacock’s slow-stewed-till-sticky chicken and rice (made with hens she raised and plucked herself) remains one of the most transcendent dishes I have ever been blessed to eat, I was eager to escape her too. Uneducated and poor, my grandmother was a struggling sharecropper’s wife whose only bathroom for much of my childhood was an outhouse.Southern cooking and culture were stereotyped punchlines for most of the 20th century: overcooked, lard-laced and “less than,” in need of gussying up. Even the most staunchly proud Southerners, when extolling with misty-eyed fervor the glory of their mother or grandmother’s hot water corn pone, felt the need to qualify their appraisal with some version of, “Now she wasn’t any fancy cook, she was just a good ol’ Southern cook.”Photo by John T. HillI was in second grade in 1971, when Miss Lewis finished writing the eponymous first cookbook she’d publish the following year. But I didn’t meet her until 1989. I was 26, working as a chef in Atlanta for the Governor of Georgia. She was 73, had just published her third book, and was head chef at the iconic Gage & Tollner in Brooklyn.Nervous and eager to make an impression on this majestic woman, I told her about my job. “Oh, a chef,” she said. “Where did you go to cooking school?” My face flushed. I hadn’t, and I was embarrassed. “Great,” she replied. “Let’s go have a drink!”For the next half hour, we sipped mint juleps and talked nonstop. She spoke about the flavor and importance of vegetables grown from open-pollinated seed, her love of quail, wild blackberries, and turtle soup. All was going well until I told her my dream of moving to Italy to learn about Italian cooking. I’d expected encouragement, but instead she grew serious. “I love Italian food too,” she said, “but you should really learn about your own cooking before running off to study someone else’s.”Chastised and confused, my face burned.A year later Miss Lewis returned to Atlanta for a food festival and I was asked to be her assistant. For four days we shopped and cooked together as our friendship slowly took hold. Enough so that a few months later she invited me to visit her in Manhattan.There, we spent an entire day wandering Miss Lewis’s favorite haunts. It was magical, but I began to notice a pattern: the party crasher that was Miss Lewis’ steely obsession with Southern food. Drinking coffee at the original Dean & DeLuca’s, she’d say, “It’s real good, but no better than my grandfather’s.” Eating duck confit at Gotham Bar & Grill, she’d say, “Well, duck is real Southern.” Every sublime culinary experience New York could offer would be interrupted with some kind of Southern comparison or connection.Initially, I felt unable to make peace with her dogged expectation of the kind of chef that I should be. Cooking was supposed to be my escape from where I’d come from, and I wasn’t interested in going back.But the next day, I was struck with a vivid realization, one that came on strong, like some kind of religious conversion, the blind given sight: The things I admired about Italian cooking—a cuisine built upon the short distance from field to table, where ingredients are always fresh and seasonal—had nothing on my father and his edict that okra be cut twice a day, at dawn and dusk, and corn eaten within hours of harvest or not at all.I was relying on cooking as a way to get somewhere else, but what Miss Lewis was trying to show me was that I had no reason to apologize for where I already was. In her written accounts of the people, recipes, rituals, and landscape of her early childhood in Freetown, Virginia—a small settlement founded at the end of the Civil War by her formerly enslaved grandfather—she found no shame or need to escape. Only integrity, dignity, and value in humble rural culture.From that moment on, I dedicated my career to the food of the American South. At my restaurants in Atlanta, Horseradish Grill and then Watershed, there was no gussying up—only a distillation of the dishes we both loved: buttermilk biscuits, bread-and-butter pickles, and of course, roast duck. For 17 years, our friendship continued to grow; she eventually moved to Atlanta, where we lived together for the last seven years of her life. Miss Lewis saw my essence and helped me distill it, even when I didn’t realize what it was.One day, still early in this journey of self-acceptance and understanding, I had to make a cake for a magazine spread. After deciding to make one inspired by my Grandmaw Peacock’s 15-layer caramel cake with creamy boiled chocolate frosting, I FedExed a slice to New York to get Miss Lewis’s opinion.She called me back the next day. “I only have one suggestion to make,” she said. “Don’t change a thing.”Scott Peacock is a James Beard awarded chef and co-author with Edna Lewis of the best-selling cookbook, The Gift of Southern Cooking. He lives in Marion, Alabama, where he hosts private cooking explorations of the Southern culinary canon, including his celebrated Biscuit Experiences.Explore Bon AppétitFirst PersonPeopleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Scott Peacock"]}