{"id": "1b2419d9e3a1f74cb531eb8e3ac5f441", "url": "https://www.bonappetit.com/story/zhajiangmian", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "How to Make This Beijing Zhajiang Noodle Dish at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingZhajiangmian Is the Perfect Combination of Salty, Sweet, and SavoryTwo aged sauces + high heat + oil = magic.By Clarissa WeiSeptember 18, 2020FacebookTwitterEmailPhoto and Food Styling by Clarissa Wei FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.In Mandarin Chinese, the word zhajiang means “fried sauce,” and that sauce is composed of a hodgepodge of various aged and salty sauces slung together over high heat and then draped over wheat noodles to make zhajiangmian. A deep and pungent gravy originally from Beijing and its northern neighbors, traditional zhajiang is made with two main ingredients: gan huangjiang (fermented yellow soybean paste) and a bit of tianmianjiang (sweet fermented wheat paste).Gan huangjiang is a chunky mixture of soybeans, salt, and water. In a fermentation process similar to that of miso, time breaks down beans and grains into a condiment with punchy, complex layers of taste. But while texturally similar to miso, yellow soybean paste is much saltier. Tianmianjiang, on the other hand, is an aged sauce composed mostly of wheat flour, salt, and a bit of soybeans. It’s syrupy, and because sugar is a by-product of the fermentation process, it’s sweet.Cook these pastes together in oil at high heat and they transform into a rather complex sauce with notes of anchovy, molasses, and maybe even blue cheese. “For me as a chef, it’s all about the aromatics,” says executive chef Lucas Sin, who makes a version of zhajiang noodles at Junzi Kitchen, a fast-casual modern Chinese food chain in New York City. “It’s about the flavorful umami aromas that happen only when you cook something in oil at relatively high temperatures.”While zhajiang originates from the north of China, variations exist all over East Asia. I grew up with the Taiwanese rendition heavy on sugar and ground pork with an almost Bolognese-like consistency. Korea has its own variety known as jjajangmyeon with an inky jet-black soybean sauce. While there’s no official rubric, many in northern China swear that proper zhajiang should consist mostly of gan huangjiang.Unfortunately in the West, gan huangjiang is almost impossible to procure. Instead, I like using huang doujiang, or soybean sauce, from Lee Kum Kee, which is a less concentrated version of the aforementioned. Others consider red miso a more accurate substitute. Tianmianjiang, the other key ingredient, adds a much needed layer of sweetness. But if that can’t be found, hoisin sauce—a sweet fermented soybean paste—is a good and more common alternative. Lastly I add a splash of dark soy sauce for color. In his zhajiang, Sin likes throwing in doubanjiang (spicy fermented fava bean paste) from Sichuan and douchi (whole fermented black beans) for added depth. “I know it’s not exactly traditional,” he admits. But it works really well, since there isn’t as much complexity or variety to the soybean sauces available in America compared to China.All these different types of fermented soy-based sauces and pastes can get really confusing, especially since they are all variations of salt, aged soybeans, and water. But once you get your basics down, it’s as simple as making a salad dressing. Here’s my quick and easy recipe: Make your zhajiang first. In a small bowl or cup, combine 3 Tbsp. soybean sauce, 1 Tbsp. tianmianjiang or hoisin sauce, 1 tsp. sugar, 1 Tbsp. Shaoxing wine or cooking wine, and 1 Tbsp. dark soy sauce. Stir to incorporate and set the sauce aside for later.In a frying pan or wok over medium-high, heat up 2 Tbsp. vegetable oil, and when hot, add 2 minced shallots and 1 minced garlic clove and cook until they are slightly brown on the edges, about 5 minutes. On medium heat, add ¼ cup ground pork (around 50–60 grams). Stir, then add in the reserved zhajiang. Stir-fry until it’s dark and sticky. Top off with 1 cup water, and when it starts bubbling, turn the heat to low. Simmer until reduced, about 20–30 minutes. At this point the sauce should be thick and shiny like gravy. Turn off the heat, and pour the sauce over a bowl of thick wheat flour noodles. Look for slender, flat noodles that are at least ¼-inch wide. Finally, garnish freely with fresh and crunchy vegetables. In northern China, cucumber, carrots, and blanched bean sprouts are the classics, but there’s nothing wrong with adding a bit of radish or slivered scallions.The important part is finding your right balance of sweet, savory, and saltiness. While soybean sauce is the foundation of my recipe, it doesn’t have to be yours. Maggie Zhu, a Beijing-born food writer behind the blog Omnivore’s Cookbook, swears on her grandmother’s rendition, which, when it comes to the aged pastes, is 100% tianmianjiang. She says soybean sauce is too salty. “Tianmianjiang is much more delicate and sweet,” she says.Feel free to get creative with it too. I love using lard instead of vegetable oil and chicken broth instead of water. Zhu prefers onions as her base aromatic, which she fries until crispy, and diced cuts of fatty pork belly rather than ground pork. “We like to add more pork and make it a little bit more indulgent,” she says. Or lose the meat and sub it all out for minced shiitake mushrooms. If it’s too salty, add a bit more water. Next time, take out a tablespoon of soybean sauce or edit out the dark soy sauce.Just remember: High heat activates the aromatics and then a low-and-slow simmer blends it all together. “Honestly, a lot of these bean pastes on their own are just salty and kind of dull,” says Sin. “But when you start cooking them, that’s when the flavors start to come out.”Clarissa Wei is an American freelance journalist based in Taiwan.Explore Bon AppétitIt's That SimpleChineseSoy SauceRead MorecookingChè Ba Màu Is Pure Bliss in Summer’s Sticky HeatBy Sovi WellonscookingGyeran Bap is What’s For Lunch (or Breakfast or Dinner) When You Can’t Be BotheredBy Joy ChocookingWhen I Crave Simplicity, I Make This Chinese Steamed Pork PattyBy Kate KassincookingMore Nori Nut Mix, PLEASEBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-18", "author": ["Condé Nast", "Clarissa Wei"]}