{"id": "1b38fdbbdd4b383471792fe671e849de", "url": "https://www.bonappetit.com/recipe/spicy-chicken-stir-fry-with-celery-and-peanuts", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Spicy Chicken Stir-Fry With Celery and Peanuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Chicken Stir-Fry With Celery and PeanutsBy Molly BazApril 19, 20204.8(230)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Molly Baz EmailPinterestPrintEmailPinterestPrintThis one-skillet recipe is fast and furious—ideal for those nights when you have 10 minutes to stand at the stove, tops. The cooking technique is in the tradition of Chinese stir-fry, in which proteins and vegetables are chopped small so that they cook quickly over high heat, then bound together with a cornstarch-thickened sauce. If you have a wok, now's the time to use it, though a cast-iron skillet will also do the trick. The wildcard ingredient is Medjool dates. They may not be a common stir-fry ingredient, but their jammy sweetness is a welcome surprise between bites of crunchy celery, salty peanuts, and spicy chicken. Let's talk subs: If you don't have sambal, you can use sriracha but start with 2 Tbsp. and increase from there. Golden raisins make a good swap if you don't have dates, and flour will work in place of cornstarch.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWhisk$10 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonCast Iron Skillet$30 At AmazonLarge Basting Spoon$16.37 At AmazonWooden Spoon$6 At AmazonIngredients4 servings 2tsp. plus ¼ cup soy sauce2½tsp. cornstarch, divided1½tsp. sugar, divided½tsp. kosher salt, plus more1lb. skinless, boneless chicken thighs3Tbsp. sambal oelek2Tbsp. unseasoned rice vinegar4garlic cloves12\" piece ginger6scallions4celery stalks4oz. dates, preferably Medjool (about 5)1½cups cilantro leaves with tender stems, divided⅓cup vegetable oil¾cup roasted, salted peanutsRice (for serving; optional)PreparationStep 1Whisk together 2 tsp. soy sauce, 1½ tsp. cornstarch, ½ tsp. sugar, and ½ tsp. salt in a medium bowl; set marinade aside. Cut 1 lb. skinless, boneless chicken thighs into ½\" pieces. Transfer to bowl with reserved marinade and toss to evenly coat. (The cornstarch will tenderize the chicken and lock in its juices.) Set chicken aside.Step 2Whisk 3 Tbsp. sambal oelek, 2 Tbsp. unseasoned rice vinegar, remaining ¼ cup soy sauce, 1 tsp. cornstarch, 1 tsp. sugar, and ¼ cup water in a small bowl or measuring glass. (Here, the cornstarch serves the role of thickening agent.) Set sauce aside.Step 3Using the side of your chef’s knife, lightly smash 4 garlic cloves, then peel and finely chop. Finely chop one 2\" piece ginger (skins and all unless they scare you!) Combine garlic and ginger in a small bowl.Step 4Trim roots from 6 scallions, then slice crosswise into ½\" pieces. If there are any leaves attached to 4 celery stalks, remove and coarsely chop them; set side for serving. Cut stalks in half lengthwise, then crosswise into ½\"-thick pieces. Tear open 4 oz. dates and remove pits; discard. Cut flesh into ½” pieces. Combine scallions, celery, and dates in a medium bowl.Step 5Coarsely chop 1 cup cilantro leaves with tender stems. Reserve remaining ½ cup cilantro leaves with tender stems unchopped for serving.Step 6Head over to the stove with all of your prep work (gathering it all on one baking sheet will make this easy!). This stir-fry comes together fast, so you want to be sure to have it all at the ready.Photo and Food Styling by Molly Baz Step 7Combine ⅓ cup vegetable oil and ¾ cup roasted, salted peanuts in a large cast-iron skillet. Set skillet over medium heat and cook nuts, stirring often to encourage even toasting, until they are a few shades darker and fragrant, 5–7 minutes. Remove skillet from heat and, using a slotted spoon so you leave the oil behind, transfer nuts to a small bowl or plate.Photo and Food Styling by Molly BazStep 8Set skillet with oil over medium-high heat. Cook garlic and ginger, stirring constantly with a wooden spoon, until very fragrant but not yet browned, about 30 seconds.Step 9Add reserved chicken and cook, stirring to break it apart, until it is no longer pink on the outsides, about 3 minutes . At this point, it will still be slightly undercooked inside, but it will cook a few more minutes with the remaining vegetables.Photo and Food Styling by Molly BazStep 10Add scallions, celery, and dates and cook, stirring often, until scallions are bright green and slightly softened, about 2 minutes. The celery should still be quite crisp and crunchy (taste as you go!).Step 11Give reserved sauce a good stir to be sure cornstarch is incorporated (it loves to settle at the bottom), then add to skillet. Cook, stirring often, until sauce thickens and turns glossy and chicken and vegetables are evenly coated, about 2 minutes.Photo and Food Styling by Molly BazStep 12Remove skillet from heat and stir in fried peanuts and chopped cilantro. Taste stir-fry and add a little more salt if you think it needs it. Serve straight out of the skillet or transfer to a shallow bowl. Scatter reserved celery leaves (if you have them) and cilantro leaves over. Serve with rice alongside.Photo and Food Styling by Molly Baz How would you rate Spicy Chicken Stir-Fry With Celery and Peanuts?Leave a ReviewTell us what you thinkReviews (119)Back to TopTriangleAwesome the dates are the secret to this! SHTXHouston Tx3/12/2022Five Star, followed the instructions to the full, and we had an amazing meal. You could easily make a vegetarian version. Will be having this againRodjAustralia2/26/2022The only think I was missing was the dates, and it was still amazing. Definitely a keeper, and I’ll be adding this into the dinner rotation! The only thing I would do differently is to drain off a bit of the oil after frying the peanuts as it was a bit oily for my preference. But it took nothing away from the flavour, which was 5 star! I can’t wait to try it with dates next time! If you like it really spicy, you could throw in another tablespoon or two of Sambal Oelek, or a chopped up Thai red chili. Excellent recipe!Brent HardyVancouver, Canada2/14/2022SO GOOD!!! I made this because I basically ONLY had these ingredients in my fridge tonight and was so happy with how it came together. The dates are something I would’ve never thought to add but I loved the sweetness and the soft texture contrasted with the crunchy celery. I’ll definitely make this again Shelby Ontario Canada2/11/2022This recipe is amazing. It's got everything you need: crunchy, soft, spicy, sour, salty, sweet. It's a bit of chopping, but why not improve on your knife skills?! The recipe is detailed and gives you easy steps to be successful in making this. This is a regular meal rotation for me, and I often throw in some asparagus cut into the same length as the scallions for extra ~health~\n\nI serve this over rice or as a lettuce wrap.MDPowell River, BC2/2/2022Love this recipe. Tasty and simple. I'm a slow worker, so the prep work takes me quite a while, but the cooking does go fast once you get there. Sambal oelek is not easily found at grocery stores around here, but I've subbed sriracha and gochujang and had good results. This is certainly becoming a staple meal in our household. AnonymousSpringfield, Il1/30/2022SO GOOD. This one is in the regular rotation at my house. We don't much care for dates so I add a tablespoon of brown sugar in with the celery instead for sweetness. Chopping everything takes a while, but its totally worth it\n LeslieLong Beach, CA12/4/2021The best thing I have ever made from BA. GraceSacramento, CA10/14/2021Pretty sure I have reviewed this one before but it's defintely a fan fave around here. I always make it veg tofu,  tempeh, fake chicken,  soy curls, all great here. We love that this is a great balance between salt, acid, fat, spicey, & sweet. Yes, it's a bit of prep work, although probably less so if you use a veg protein.  I usually start the prep when I put the rice in the instant pot and all are ready around the same. Probably faster than take out!AnonymousSeattle, WA7/14/2021The best! I make a vegetarian version of this at least once a month, with cauliflower subbed for the chicken. AnonymousIllinois6/26/2021This is so, so good and easy! Make it exactly as written - the combination of flavors is fantastic. One word of caution - keep an eye on the peanuts! I make this in my Le Creuset cast iron which heats rapidly and holds the heat. The first time I made this I swear I turned my back for only a minute and the peanuts turned dark brown before I knew it. I spooned them out and started over with fresh peanuts. Mine are done just before the 3-minute mark. All in all, an easy and lovely dinner.AnonymousSan Francisco, CA6/24/2021SO GOOD. Definite more than the 10 minute “easy weeknight” dinner, but not a whole lot more. Worth every minute of chopping, stirring, and then some. Subbed chopped pitted prunes for the dates, and I have a feeling that’s probably better than the original.  Perfectly sweet and spicy, with just the right amount of heat. Served it over coconut rice, and yum!  This is a keeper!!Andi PChicago IL4/19/2021This is so flavorful. All the textures and flavors work alongside each other and balance each other out. We forgot the cilantro and didn't even feel like we were missing anything! Can't wait to make this again.Rikki S.Columbus, OH4/13/2021This is a wonderful recipe and all who have tried it have commented that it has a real Chinese restaurant flavor/texture/everything and I LOVE it...probably make this one once every 2 weeks, if not more often; a true classic. I serve it alongside steamed rice and make no substitutions, though I've tried it with the golden raisins and it has a much different texture than the dates as the raisins tend to plump up as they cook and don't have that fudgy texture that works so well with the dates. However, the reason I'm not giving it the true 5-stars it sounds like I should be awarding it is the misleading time to prepare/cook it. 10 minutes is a gross under-statement and while maybe the time to COOK it is indeed 10 minutes but from the time you start to the time you're sitting down is going to be 30-35 minutes.  That may seem petty but my introduction to the recipe was \"I'm looking for something quick and easy, not a knifework or mise en place party...oh hey, here's a good looking stir fry that takes 10 minutes?? DONE.\" And I suspect a lot of others arrived at this recipe for the same reasons and so I will 100% vouch for this recipe being delicious and I will 0% vouch for it being even close to finished in the 10 minutes they elude it will take. It's become a nice recipe to turn on some music and work my way through the prep work and take my time and when I do that, the results are absolutely worth it.AnonymousSeattle, WA3/17/2021This was delicious!  All the ingredients work so well together.  Not sure if this is a weeknight supper recipe as the prep took a good 30 minutes.  My husband commented it was yummy, but I did not reply, not sure I would make it again during the week next time.  LOL  I'm adding this recipe to my favourites.  AnonymousMontreal, Canada2/17/2021Explore Bon AppétitStir-FryAsianChickenPoultryChicken ThighCeleryVegetablePeanutNutWeeknight MealsQuickEasyMainDairy-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-19", "author": ["Condé Nast", "Molly Baz"]}