{"id": "1b3fa37d48156694338420383f93cd54", "url": "https://www.bonappetit.com/story/make-braised-short-ribs", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Make Braised Short Ribs This Weekend, Because I Said So | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake Short Ribs This Weekend, Because I Said SoI mean, there are other good reasons too.By Alex BeggsMarch 2, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Ayesha PatelFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the _BA_offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“Did you skim the fat?”No. My better half made the March cover star recipe for Sohui Kim’s braised Korean short ribs last weekend and WOW, WERE THEY GOOD. So rich and fatty and shreddy. I made the sides: Andy’s crispy Persian rice, crunchy gochujang fennel (necessary to cut the fat of the short ribs), and this nutty napa cabbage salad my colleague Elyse Inamine talks about all the time (lived up to the hype, thanks Elyse!). Rachel Karten and Emma Wartzman also made the short ribs, and we compared notes. They skimmed fat off the top, I didn’t. Rachel served hers with big lettuce cups (and made epic leftover fried rice cooked in the jus); Emma made a side of pickled cucumbers, sticky rice, and kimchi. Sounds to me like you should all make this!Get the recipe: Red Wine and Soy–Braised Short RibsWhat are the oddsOn Tuesday, I was in the Test Kitchen tasting a few upcoming dishes and avoiding writing. Molly Baz was toiling over a matzoh ball recipe, and didn’t hold back when asking everyone what they preferred: “A tightly rolled ball, or a delicate crumbly ball, or a bouncy ball?” She set out three versions cooked in various combinations, some with seltzer, some without, one with dill (the underdog), etc. The journey for that continues. Chris Morocco was sitting at his station with his head in his palm and asked me wearily: “Beggs, do you want a not very good chocolate chip cookie?” I thought about it for a good six seconds. Then I whispered to Chris as I broke a cookie in half, “it is my birthday”—a fact I hadn’t shared with anyone in the office. “Wait, really?” He asked, perking up from his cookie failure slouch. Yes, really. “It’s my birthday too!” And that’s when we discovered we have the same birthday, and keep the same secrets.Here’s a chocolate chip cookie recipe you can count on.Want this letter before it hits the website? Sign up for our newsletter!Get moderately rich, moderately quickBy following this entrepreneurial couple’s guidelines for reselling Trader Joe’s Everything But the Bagel Spice on Amazon. Oh wait, because of their eagerness to share their trade secrets, the price of the spice mix can fluctuate and make the whole thing not very worth it. Womp womp. Looks like the spice is going for $6.25 right now—it’s $1.99 in stores. 6 Amazon reviews out of 958 point out this difference, the rest of the world doesn’t seem to care.The best part of the story: “the Herberts don’t actually like the Everything But the Bagel seasoning. (Juston admits in the video that it’s “not bad” on eggs, but otherwise they’re over it.)”Need a little crafty project? Make your own everything spice and upsell it online. Or just make this new everything bagel quiche!Unnecessary food meme of the week(Don’t worry! He’s okay. I think?)Photo by Chelsie CraigUnnecessary food feud of the weekClaire Saffitz was working on an [undisclosed] project that included a few (somewhere between 6 and 12) pans of cooling cakes, including carrot cake—hold the raisins. It turns out Claire has two raisins on her shoulders where most people have a little devil and a little angel. One of the raisins is wrinkly, shriveled, snuck into an oatmeal cookie. “I don’t want to eat them ever,” she said definitively. “I know they’re just grapes but I don’t even like grapes. Except wine.” The other raisin is a Raisinet. “Wellllll, don’t put this in there, but I do like a Raisinet. Oh, and I’m fine with raisins in a mostarda.” Claire, pick a side! Pro-raisin Alex Delany addressed the heated debate on Basically this week, where we published a new recipe that includes raisins with...fish? Yep. Raisins rarely appear in Bon Appétit recipes, revealed Carla Lalli Music, because “they have the power to divide us.” Carla doesn’t mind, say, throwing back a little box of them at a preschool mixer. But she has a philosophical question: “I don't understand why raisins are so hate-inducing, like do people FREAK OUT over other dried fruit? No. No they don't. Dried cherry. Date. Currant even. No one gets mad.” In the background, Alex Lau crept out of a photo studio, grabbed a croque monsieur from a sheet pan, and disappeared into the night.My favorite raisin-adjacent recipe is this decadent duck confit with pickled raisins. TRUST ME.Explore Bon AppétitBeggs NewsletterRead MoreculturePork Sauce, Salmon Feuds, and Reese's THiNs: The Week at BABy Alex BeggscookingBA’s Best Bolognese Is a Sunday Gravy for All TimeBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-02", "author": ["Condé Nast", "Alex Beggs"]}