{"id": "1b5668f2ea55ab465b20a7b0798f385c", "url": "https://www.bonappetit.com/story/dinner-party-rules", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Throwing a Dinner Party in 2021? These Are Our New Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur New Rules for Dinner Partying, Emphasis on “Party”As the legendary hostess Dua Lipa says, I got new rules.By The Bon Appétit StaffOctober 14, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story about dinner party rules is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.It’s been too long since we’ve thrown dinner parties. And now that we’re beginning to get together with vaxxed and boosted company, we want to do things a little differently. As it turns out, the time off from hosting has given us a new perspective. Like: Life is too short to spend all that time in the kitchen! And our guests actually do want to help, so let them. And so much more. So these are our new rules: the things we’re trying out, ditching, and embracing for the first time. We hope they help you feel empowered, inspired, or at least a little more relaxed. Because dinner parties are supposed to be parties, not pressure. And in the end, that’s the only rule that counts. Skip the main. If you’re worried or want to ease into the idea of hosting after the past year plus, a dessert party (or snack party) may be a more doable endeavor. It’s easier on you too, requiring much less prep and cleanup. —Zaynab Issa, associate food editorStop hiding in the kitchen. I used to serve coursed dinners to friends, doing mains like risotto that basically require you to be in the kitchen at exactly the same time that your friends are loosening up with wine and cheese and things are getting interesting. Unless you’re serving pasta, you shouldn’t really be cooking anything after your guests arrive. —Chris Morocco, test kitchen directorApply the “clean as you go” rule. Get everyone to do one round of cleanup in between dinner and dessert or before your guests leave. Trust me, they won’t mind, and you won’t be left with the dreaded leaning tower of dirties. Assign away so each person is only doing a little bit! —Rachel Gurjar, associate food editorEmbrace clutter. Clean your apartment and maybe light a candle or two. But it’s okay to leave out the pet toys, the coffee mugs, the mail, all the detritus that any apartment accumulates. Your friends can know that you actually live here. —Karen Yuan, lifestyle editorDitch the place settings—or the table entirely. I used to spend so much time folding napkins and filling water glasses, but my guests inevitably left both untouched. Not sure what that says about my friends...but I’m over it. When I moved, I sacrificed a dining room table for a sectional couch and never looked back. —Amanda Shapiro, digital editorial directorSet up a DIY bar. Let guests assemble their own tacos, build their own chaat, or make their own hand rolls with prepared fillings. It saves you from fretting over serving people, accommodates a variety of dietary restrictions, lets everyone mingle and eat at their own pace, and makes the event so much more memorable. —Antara Sinha, associate cooking editorJust plan ahead. From my experiences of both hosting dinner parties and throwing pop-up events, that’s my one tip. Make a list for the ingredients, equipment, and tabletop needs. Plan out how you’re going to use your oven, stovetop, and fridge spaces. —Jessie YuChen, associate food editorThrow a “come as you were” party. The hostess Elsa Maxwell once threw one where everyone had to show up dressed in whatever they were wearing when they got the invite. Text/email your invitations at all hours of the night and see what your friends show up in. Alternate theme: “Come as your enemy.” —Alexandra Beggs, senior staff writerGet even more dinner party rules:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitPartiesDinner PartiesCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "The Bon Appétit Staff"]}