{"id": "1b65b7ad605340764d7684734ebf50f0", "url": "https://www.bonappetit.com/recipe/spicy-coconut-grilled-chicken-thighs", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Spicy Coconut Grilled Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Coconut Grilled Chicken ThighsBy Molly BazJune 26, 20194.8(125)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWelcome to your newest go-to summer marinade, featuring some spicy sambal, brown sugar and coconut milk to balance out the heat, and lots of fresh ginger and lime juice. This one’s just as awesome with shrimp or flank or skirt steak as it is with chicken thighs.Ingredients4 servings13\" piece fresh ginger5garlic cloves¾cup coconut milk¼cup hot chili paste (such as sambal oelek)¼cup fresh lime juice2Tbsp. light brown sugar1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt2Tbsp. vegetable oil, plus more for grill2lb. skinless, boneless chicken thighs½cup cilantro leaves with tender stemsLime wedges (for serving)PreparationStep 1Prepare a grill for medium heat. Finely grate ginger and garlic into a medium bowl. Add coconut milk, chili paste, lime juice, brown sugar, salt, and 2 Tbsp. oil and whisk to combine. Add chicken and toss to coat. Let sit at least 15 minutes or up to 4 hours.Step 2Remove chicken from marinade, letting excess drip back into bowl, and transfer to a rimmed baking sheet. Pour marinade into a small saucepan. Bring to a boil, then reduce heat to medium-low and simmer, stirring occasionally, until slightly reduced and thick enough to coat the back of a spoon, 2–3 minutes.Step 3Clean and generously oil grate of grill (if there are a few flare-ups while you do so, not to worry, they will burn off). Grill chicken, turning once and basting occasionally with marinade, until you see some good grill marks and chicken is cooked through, 8–10 minutes.Step 4Transfer chicken to a platter. Brush with remaining marinade. Top with cilantro and serve with lime wedges alongside.How would you rate Spicy Coconut Grilled Chicken Thighs?Leave a ReviewTell us what you thinkReviews (67)Back to TopTriangleWow I made this with chicken breast and wow! Packed with flavor, OMG so good. I used to coconut milk from the van so the marinade was a little thick but that’s alright. Since I only cooked for two I saved half of the marinade and threw it in the freezer. Highly highly recommend!!JCSan Diego CA10/13/2021Yum ! I don't have a grill, so I use a cat iron skillet in a really hot onion, skin side down.  Really good and looks nice. Easy date meal! Jack NFar side of the moon8/26/2021I love this recipe, Molly! Served the chicken thighs up with rice and stir fried garden veggies. This is one recipe that is getting the honor of being written down on actual paper and going in my recipe box! I can’t wait to try it with flank steak!JJ HardyThe Dalles, OR8/20/20211\" ginger = 1/4 oz.JOHN M.Cortez, CO8/6/2021What does a 3 inch piece of ginger amt to?  ginger comes in many sizes... grrrrAnonymousDenver7/7/2021Love this recipe and make it regularly alongside BA's Big-Flavor Broccoli! The sauce packs in amazing flavours and the chicken thighs are really tender. Works on the BBQ or on a stovetop grill pan.Rosie MOntario, Canada4/18/2021We made this recipe with shrimp instead (Like Molly did in the video) and it did not disappoint!!! just the right amount of heat. So wonderfully bright with the lime and the ginger. Will definitely be making again! With chicken... or steak... or shrimp :)Blake D4/14/2021This recipe is so delicious and my family loves it! I've mad it with breasts and thighs, both come out great! I highly reccommend using the Huy Fong Foods Chili Garlic Sauce. Mayrav EstrinBrooklyn, NY3/4/2021Absolutely fabulous! I didn't have lime juice or hot sauce, but added lemon pepper and red pepper flakes. Added shrimp, sesame oil and Skinny Girl Fetticini, fabulous! The ginger really kicked it up a notch! AnonymousMoses Lake, WA 2/27/2021This recipe packs a flavor punch! I can't wait to try the marinade on shrimp and steak as others have suggested.AnonymousCharlottesville, VA11/22/2020I'm always trying to find new ways to cook up chicken Thighs and this was a definite winner. After reading reviews, I did make some minor adjustments. Another reviewer noted that 1 tablespoon seems like a typo and I would agree. Sambal chili is already pretty salty om it's own so I only added 1/2 a teaspoon which was plenty of salt. I also threw the cilantro into the marinade and blended it up before marinating the chicken and omitted the added oil completely since full fat coconut milk has plenty of fat on its own and chicken thighs are already juicy. I also didn't bother reheating the marinade (out of laziness) and baste the thighs and felt they still had plenty of flavor. AnonymousLos Angeles 10/27/2020Very tasty! Used gochujang because that's all I had, should have added some more spice, but the marinade/sauce was still delicious. Pan fried it since I don't have grill access right now, and still good. Excited to try with different proteins!muzac_luver_121621Phoenix, AZ8/21/2020So flavorful! AnonymousMill Valley, CA8/1/2020I added a bit fish sauce to this marinade - highly recommend for more umami!!AnonymousCT7/17/2020This recipe is unbelievable and is universally liked by all when I cook it. It has it all. So delicious. Good with ANY protein. And super easy to throw together and grill. Great for summer or winter. BeSomeoneH-town TX6/7/2020Explore Bon AppétitSoutheast AsianAsianIndonesianChicken ThighChickenPoultryCoconut MilkOther IngredientsGingerHerbs & SpicesSummerEasyWeeknight MealsMainDairy-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-26", "author": ["Condé Nast", "Molly Baz"]}