{"id": "1b67d614a4452eda688b0c3d43f1fcd7", "url": "https://www.bonappetit.com/story/heads-of-the-table", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "Introducing BA's Heads of the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat It Means to Be an Outstanding Restaurant This YearOur October issue honors 12 Heads of the Table: the trailblazing restaurants supporting their communities, serving great food, and changing the industry for good. By Dawn DavisSeptember 23, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.We know BA’s Annual Hot 10 is the restaurant guide for many of you. Once the list drops we’ve heard how readers rush to get reservations at the places we highlight, which often changes the financial trajectory of these establishments. We take that responsibility seriously. For much of the last year and a half, however, it simply wasn’t possible to travel to the restaurants that even managed to open, and it certainly didn’t seem like the right time to have them compete against one another for the 10 slots.The time did seem right, though, for us to rethink what it means to be an outstanding restaurant. Of course, it’s about the food—bold flavors, local ingredients, and unexpected preparations. But the pandemic reinforced that restaurants are much more than that—they can inspire, reform, and build community. So this year we asked ourselves, Who is putting others first? Who is making the industry better? We came up with a dozen restaurants, people, and organizations that stood out for their outside-the-box thinking, deep impact, and yes, often their stellar food. These are the Heads of the Table.Our Restaurant Issue also includes a thought-provoking piece on parenting in the industry, as well as recipes from the places making food we dreamt about during lockdown. Collectively, these stories show the ways restaurants innovate even as they struggle. You can see that in the recipes, from the Picarones With Fig Chancaca Syrup, doughnuts made with sweet potato and cardamom, to the Flip Side Pizza sauce, a brew of molasses, black pepper sauce, and tomato paste.In our drinks column, The Pour, you’ll meet Tara Gomez and Mireia Taribó, the winemakers behind Camins 2 Dreams. I first encountered their wines last fall at restaurateur Simon Kim’s Cote in New York. Cote’s steaks and Dwen-jang Stew are always memorable, but it was the wine that sommelier Victoria James poured that night that got my attention. Here James shares what makes Camins 2 Dreams so special.Finally, each month I ask notable people who they’d invite for the Dream Dinner Party column. In an issue that highlights the givers, we give chef José Andrés the last word.Explore Bon AppétitLetter From The EditorCultureRead MorerestaurantsHeads of the TableBy The Bon Appétit Staff & ContributorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-23", "author": ["Condé Nast", "Dawn Davis"]}