{"id": "1b7df3f6a700607a61bcd98dcd06199f", "url": "https://www.bonappetit.com/recipe/clams-with-spicy-tomato-broth-and-garlic-mayo", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Clams with Tomato Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueClams with Spicy Tomato Broth and Garlic MayoBy Andy BaraghaniMay 21, 20195.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintIf you don't have a grill, don't sweat it: Just heat the cast-iron skillet over medium on your stovetop. Inside or out, you’ll still have buttery clams to enjoy.Ingredients4 servings½lemon5garlic cloves, 1 whole, 4 thinly sliced½cup mayonnaiseKosher salt¼cup plus 3 Tbsp. extra-virgin olive oil2large shallots, thinly sliced1red chile (such as Holland or Fresno), thinly sliced, or ½ tsp. crushed red pepper flakes2Tbsp. tomato paste2cups cherry tomatoes1cup dry white wine36littleneck clams, scrubbed6Tbsp. unsalted butter, cut into pieces3Tbsp. finely chopped chives4thick slices country-style breadPreparationStep 1Prepare a grill for medium heat. Finely grate zest from lemon half into a small bowl, then squeeze in juice. Finely grate whole garlic clove into bowl and mix in mayonnaise. Season garlic mayo with salt and set aside.Step 2Place a large cast-iron skillet on grill and heat ¼ cup oil in skillet. Add sliced garlic, shallots, and chile and cook, stirring often, until just softened, about 2 minutes. Add tomato paste and cook, stirring often, until paste darkens slightly, about 1 minute. Add tomatoes and a pinch of salt and cook, stirring occasionally, until tomatoes soften and release their juices, about 4 minutes. Add wine and cook until it is almost reduced by half and no longer smells boozy, about 3 minutes.Step 3Add clams and butter to skillet and cover (if you don’t have a lid that fits, use a sheet of foil). Cook until clams have opened, 6–10 minutes, depending on size of clams and heat level. Remove skillet from grill; discard any clams that don’t open. Sprinkle with chives.Step 4Meanwhile, drizzle bread with remaining 3 Tbsp. oil and season lightly with salt. Grill until golden brown and crisp, about 3 minutes per side.Step 5Serve clams with toasted bread and reserved garlic mayo.How would you rate Clams with Spicy Tomato Broth and Garlic Mayo?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis was amazing! Didn’t have tomato paste just used tomatoes  and no have shallots on hand so we used chives. It still turned out delicious and hit the right spotTabbiePhoenix,AZ9/1/2021Outstanding! Not a big clam fan but this changed my mind. I did it on the stovetop and used basil instead of chives. It was amazing. Savannah Chattanooga, TN1/15/2021This was absolutely delicious. I doubled the sauce and added clams, scallops, shrimp, and cod and served it over linguine. A top ten meal. I'm making it again tonight and can't wait. (I made it on my stovetop.)HenderKevinsonCA10/12/2020This is an amazing grilled clam recipe.  I do not eat it with the mayo but love the sauce and sopping it up with grilled sourbread.  I also cut the butter in half (3TBLS).  You will not be disappointed!AnonymousNew Jersey8/18/2019Amazing recipe, used 2 Thai chilies and it was nice heat without overwhelming the dish. Subed cherry stone clams but this would also be great with mussels. Made the mayo and it filled a void in the meal with the acid but definitely didn’t use as much as the recipe calls forAnna297/19/2019Outstanding!! I loved the broth, couldn’t find the chile so I used red pepper flakes instead. Perfect balance of flavors and spiciness. Didn’t make the mayo since I’m not a huge mayo fan.nick016NYC6/4/2019This is amazing. Skipped the mayo  - but I'm sure that would add another element to this but didn't need the extra calories. This sauce is simple and really delivers. Anonymous6/2/2019Sauce was delicious. My husband is on a low sodium diet, so didn't use it with bread, instead put it over spiralized zucchini for me and whole wheat pasta for him. I plan to make the sauce again and perhaps poach a piece of fish in it! ErinP13Florida5/27/2019Absolutely amazingAnonymousNorfolk, VA5/26/2019Explore Bon AppétitClamShellfishSeafoodCherry TomatoTomatoVegetableMainStarterNut-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Andy Baraghani"]}