{"id": "1b93a42d9191c51f42150134bd594b3b", "url": "https://www.bonappetit.com/story/kitchen-products-online-sale", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "The Best Kitchen Products to Buy Online This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Kitchen Products to Buy Online This WeekendKitchenAid stand mixers, Vitamix blenders, and all that good stuff.By Bon AppétitMarch 23, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailDo you ever set out to buy, say, a chef’s knife, and two hours later, look up from your computer screen to realize you’ve fallen into a black hole of kitchen products, some necessary, others not so much? One minute you were lying in bed with no plans in sight, the next you’re planning a dinner party around Le Creusets in trendy Pantone-inspired colors and deciding what kind of chicken recipe you’ll christen your cast-iron pan with. Been there, done that, seen the movie. That’s why we’ve culled through the clutter of the internet to bring you the best kitchen products to buy online this weekend.Courtesy of KitchenAidKitchenAid Appliances from Bloomingdale’sIf you’re a “Loyallist” at Bloomingdale's, there’s a special sale that’ll get you discounts in $25 increments, starting at $125. Even if you aren’t, you’ll find KitchenAid stand mixers, hand mixers, and coffee grinders up to 20% off until March 25.Buy It: All of the KitchenAid products can be found hereCrate & BarrelCrate & Barrel DinnerwareUntil March 31, get 20% off full-price dinnerware and flatware at Crate & Barrel’s “Wine & Dine” (lol) sale. A random assortment of dinner party essentials are marked down, including ceramic baking dishes, tons of wine glasses, and European-inspired matte silverware. Entire 16-piece dish sets are on sale too, for less than $130.Buy It: The entire Wine & Dine sale can be found here.Vitamix Blenders from HayneedleHayneedle’s sale section is stacked with kitchen products, some you might actually need (a Vitamix blender, a glass baking set from Anchor Hocking), others that honestly just might be nice to bring out every once in a while, like a breakfast-in-bed tray. There are a few food dehydrators marked down as well (including this one for 24% off), which will change your homemade beef jerky game forever.Buy It: All the sale items can be found here.Royal Electric KettleOne of the best-selling electric kettles on Amazon is 48% off for a limited time. The cordless glass kettle can hold up to 1.7 liters of water and has stainless steel accents and a BPA-free plastic lid. It has 4.3 stars out of 5, and a lot of Amazon reviewers note that it boils water quickly and stays warm without any special features, even when filled to capacity. One loves it so much she brings it on vacation.Buy It: Royal Electric Kettle, $42 on Amazon (originally $80)Start working your way through these stand mixer recipes:1 / 61ChevronChevronBA's Best BreadView RecipeExplore Bon AppétitToolsShoppingRead MoreshoppingThe Best Kitchen Scales and Why You Need One, Even If You Never Bake a ThingBy Alex BeggscultureThey Would Know: The Best Containers for Leftovers, According to Test Kitchen EditorsBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-13", "author": ["Condé Nast", "Bon Appétit"]}