{"id": "1b9ba5dceeef9fc2e047997d09aa8e5e", "url": "https://www.bonappetit.com/recipe/kale-salad-with-pecan-vinaigrette", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Kale Salad With Pecan Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueKale Salad With Pecan VinaigretteBy Kendra VaculinOctober 19, 20214.8(34)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintThis dressing checks all the boxes: It’s nutty, salty, savory, and just sweet enough, with a hefty texture that holds its own against sturdy kale. Make it ahead of time and dress your salad before you put the finishing touches on your Thanksgiving meal; the salad should sit for a few minutes before serving to ensure the kale is tender. If you don’t have a food processor, you can chop your ingredients by hand—the finished dressing won’t be as creamy, but it will still taste great.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMicroplane Grater$16 At AmazonCutting Board$10 At IKEAIngredients8 Servings1½cups pecans2garlic cloves, finely grated½cup extra-virgin olive oil2Tbsp. drained capers1Tbsp. honey⅓cup apple cider vinegarKosher salt, freshly ground pepper2large bunches Tuscan kale, ribs and stems removed, leaves thinly sliced1bunch radishes, trimmed, thinly slicedPreparationStep 1Preheat oven to 350°. Toast pecans on a rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool.Step 2Transfer a handful of pecans to a cutting board and coarsely chop; set aside for serving.Step 3Pulse garlic, oil, capers, honey, and remaining pecans in a food processor until nuts are in small pieces. Transfer to a large bowl and stir in vinegar; season dressing with salt and pepper.Step 4Add kale and radishes to bowl with dressing; toss to coat. Taste salad and season with more salt and pepper. Top with reserved chopped pecans.How would you rate Kale Salad With Pecan Vinaigrette?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleNew favorite salad, even for my salad hating son! Yum!AnonymousSeattle, WA12/3/2021The most delicious kale salad recipe. AnonymousNew York, NY11/29/2021This is a delicious salad that I will definitely make again. Holds up good for leftovers also. StephanieRichmond,VA11/27/2021Awesome salad!! Had to thin out the dressing with more vinegar and olive oil. Made for thanksgiving and it was a hit, will definitely be added to our regular rotation!AnonymousColumbus, OH11/26/2021This salad has quickly become a family favorite!  It's so delicious and very easy to make.  It's been requested 3 Sundays in a row.  Even if I make a different salad next Sunday, I will definitely keep a jar of the vinaigrette on hand.GenevaCedar Rapids, Ia11/14/2021I also ended up with a paste for dressing, but the flavor was great and I just thinned it out with a little more oil and vinegar.  AnonymousSeattle, WA11/13/2021Ratio for dressing is off. I have a paste. Needed much less pecans and more oil Anonymous11/5/2021This was fabulous!!! My husband had 3 portions.  We both loved it and I expect it to be a regular this winter.Peggy WNC11/3/2021I used walnuts instead of pecans because that’s what I had, warmed the salad up a little bit in the oven as I wanted more of a ‘warm’ salad, and topped with roast chicken and grated Parmesan. Was amazing!!! Would absolutely make again. MeganNashville, TN11/2/2021Excellent flavor, but it came out very thick. Will need to add more oil or less pecans.AnonymousChicago10/30/2021Explore Bon AppétitKaleLeafy GreensVegetableSaladSidePecanNutThanksgivingFallWinterVegetarianDinnerLunchGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}