{"id": "1b9cb69868304e78efb201d4279c638b", "url": "https://www.bonappetit.com/recipe/citrus-and-dill-gravlax", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Citrus-and-Dill Gravlax Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCitrus-and-Dill GravlaxBy Chris MoroccoNovember 20, 20184.1(11)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintMany gravlax recipes will instruct you to drain, turn, and babysit the fish while it cures. Not this one: Set it and forget it. Three days later it will be done.Ingredients12 servings1bunch dill, plus sprigs for serving2grapefruits3lemons1¼cups kosher salt1cup (packed) light brown sugar1Tbsp. cracked black peppercorns13-lb. boneless side of salmonBagels, bialys, pumpernickel or rye bread, cream cheese, sliced red onion, capers, and/or lemon wedges (for serving; optional)PreparationStep 1Place dill bunch in a food processor and finely grate grapefruit and lemon zest directly into bowl; save fruit for another use. Add salt, brown sugar, and peppercorns and process until combined (you can also chop the dill by hand and mix it with the other ingredients in a medium bowl).Step 2Place a large sheet of parchment paper on a large rimmed baking sheet and pour one-third of cure lengthwise down the center of parchment. Lay salmon skin side down on top of cure and pack remaining cure in an even layer onto flesh side. Fold parchment up and over fish and cover with another sheet of parchment paper. Wrap tightly with plastic. Place another large rimmed baking sheet on top of fish and set a heavy pot or cast-iron skillet in baking sheet to weigh down. Chill 3 days.Step 3Unpack fish and wipe off cure with a damp kitchen towel (do not rinse). Make sure fish is cold. Slice very thinly with a long, thin, sharp knife, wiping down blade occasionally with another kitchen towel to keep it clean. Slice at a 45-degree angle until you get wide ribbons (the first few won't be perfect—keep going!). Arrange salmon on a platter; serve with bagels, bialys, bread, cream cheese, red onion, capers, dill sprigs, and/or lemon wedges if desired.Step 4Do Ahead: Wrap leftover salmon and refrigerate for up to 3 days.How would you rate Citrus-and-Dill Gravlax?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleHorrendously leathery. Three days is (far) too long. The grapefruit smells great, but imparts a weird aftertaste. Did y’all really make this in the retest kitchen exactly as you e written the recipe?!A cook from BuffaloBuffalo, NY8/27/2021I just checked my salmon after 36 hours and it is quite dry and a little salty, but the zest gives it a beautiful flavor.  I'll definitely use this recipe again, but next time I'll only let it  cure 24 hours.lilsickles3189Burlington, VT8/13/2020Not sure where I went wrong, but the fish was inedible. SO salty. It turned out more like jerky. I would like to give this another try with much less curing time. \nkenzieforrestcanton, ohio12/25/2019I've made this recipe 2 times now and have been so happy with the results.  I've made it for events with friends and never get to take home any leftovers!  I wipe down the salmon post cure with a damp towel like mentioned, but some of the dill/grapefruit/salt mixture remains, which honestly just adds to the flavor is a good way.  Highly recommend to new curing enthusiasts!AnonymousWilmington, DE7/3/2019What an AWESOME recipe. So easy, yet so phenomenally elegant and impressive. Followed directions to the t and would do it exactly the same all over again.  AnonymousColorado1/7/2019This recipe is a game changer. I made this for New Years and It was flawless! Thinner pieces I would definitely check on after 2-2.5 days but thicker pieces need the full three. Overall this was simple, stunning, and a work of art dish. AnonymousChicago1/3/2019So disappointed with this recipe! Followed it exactly and what we got Christmas Eve was a gravlax with the consistency nearing jerky, salty to the point of inedible. This was a waste of time and money,Connecticut12/30/2018Explore Bon AppétitScandinavianEuropeanSalmonFishSeafoodDillHerbs & SpicesGrapefruitCitrusFruitLemonEasyDairy-FreeGluten-FreeNut-FreeHealthyishPickle and PreserveBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}