{"id": "1bb5abcb903da44712872f94e5a96f97", "url": "https://www.bonappetit.com/story/what-is-zaatar", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "What is Za’atar, the Spice Mix That We Can’t Stop Sprinkling? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll About Za’atar, the Spice Mix That We Can’t Stop SprinklingWhat, is it our fault that za'atar goes with just about everything?!?!By Sarah JampelJuly 24, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThere are the spices and dried herbs that seem to be bottomless pits (allspice berries, dried basil, herbes de provence)...and then there’s za'atar.I go through the jar of this spice mix so quickly that I end up grabbing it only to find it empty, right next to the still-full sweet paprika. There’s so much to love about za’atar! Bright, earthy, herby, and toasty, it makes plain stuff (boiled eggs, garlicky yogurt, canned chickpeas) taste exciting and exciting stuff (roast chicken, green sauce, homemade hummus) taste special. Let’s just say that if I were in a life or death situation where I had to pick a favorite spice mix, za’atar would be it.*What it is:Za'atar is so multifaceted and dynamic because it's a blend of so many different flavors, textures, and fragrances. Even though it varies greatly depending on where you are in the Middle East (specific recipes are sometimes closely-guarded secrets!), za'atar is generally a combination of dried oregano, thyme, and/or marjoram (woodsy and floral), with sumac (tangy and acidic) and toasted sesame seeds (nutty and rich). And, as if that weren't enough, za'atar sometimes contains salt, dried orange zest, dried dill, or the wild herb za'atar (also called hyssop, it grows throughout the Levant and is the mixture's namesake).How to eat it:Za’atar encompasses such a wide range of flavors that it can be the bright note that both enlivens and anchors sliced tomatoes, the unifying force in a salad of refreshing smashed cucumbers and salty, fatty feta, and the replacement for lemon and herbs on a roast chicken. Consider adding it when you're looking for a spice mix that's earthy, savory, and tangy, all in one. In the Middle East, za'atar is often eaten with oil-dipped bread or labneh, or spread onto flatbread dough before it’s baked into man’oushe.If you’re cooking with za’atar, you don’t need any other spices—it can hold its own. But I’m not going to stop you from pairing it with garlic, fresh tender herbs, lemon, toasted nuts, and chile flakes.And if you’re not going to be heating up za'atar in the cooking process, you can bring out the most flavor by blooming it in hot oil or butter. Heat the fat in a small skillet, take it off the heat, and add the za'atar—then drizzle over popcorn or toast.How to buy it:Za'atar is made with a wide range of ingredients in varying proportions. Senior food editor Andy Baraghani recommends seeking out za'atar that’s extremely fragrant, very green (a sign that the dried herbs are new and potent), and not clumpy. While Andy prefers za'atar that’s heavy on thyme and sesame, with seeds that are slightly crushed, you should explore the ratio that tastes best to you. If you can find locally-made za’atar, that’s even better, since it’s likely to be fresher. Andy recommends NY Shuk’s za’atar, which is made with traditional za’atar leaves, as well as roasted chickpeas for any even nuttier flavor.No matter what kind you track down, za’atar is like any spice and will lose flavor over time. Buy it in small batches that you’ll use up before your stash goes stale (you’ll know it’s no good when it no longer smells fragrant).How to make it yourself (kind of):If you can’t find za’atar at the store, experiment with making an approximation at home. Play around with different quantities of crushed dried oregano, dried thyme, and dried marjoram, and add sumac, toasted sesame seeds, and, if you want, salt.Sprinkle, eat, repeat.Now make a tomato salad:Fancy and Beautiful Tomato SaladHere’s the first thing you should make when you want to show off the peak-season tomatoes you’ve been waiting all year for.View Recipe*Oh, I also really like vadouvan. :)Explore Bon AppétitZa'atarIngredientsSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-24", "author": ["Condé Nast", "Sarah Jampel"]}