{"id": "1bc04ef1d54e4102bb5b020a36b5cd67", "url": "https://www.bonappetit.com/story/teranga-jollof-fonio", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Chef Pierre Thiam of Harlem’s Teranga Makes Classic Jollof Feel Fresh | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsChef Pierre Thiam of Harlem’s Teranga Makes Classic Jollof Feel FreshHe pulls from his West African roots for a perfect bowl.By Jesse SparksOctober 17, 2019FacebookTwitterEmailPhoto by Jesse SparksFacebookTwitterEmailEveryone loves a classic. At least, that was my “If it ain’t broke, don’t fix it” mentality when I strolled into chef Pierre Thiam’s airy all-day café Teranga in New York’s Harlem neighborhood. I’d been lured in by the array of fresh takes on classic West African staples: caramelized plantains, black-eyed peas salad, grilled chicken with a peanut Yassa sauce, and most of all jollof fonio. For his riff, Thiam switches out the rice, stewed in a rich, soul-warming tomato sauce, for the small West African supergrain fonio. On my first bite, I knew I had to rethink my theory. By the time I finished, I decided I had to track down Thiam to hear the secrets behind his recipe. Here, he explains every step of the process.The TomatoJollof isn’t jollof without tomato, and Thiam’s begins with a hearty dollop of fried paste. A crowning scoop of purée ties the dish together, adding a hit of acid and tang.The SidesBowls come with any two of Thiam’s five side options. We’re particularly into the lime-ginger black-eyed-pea salad and the Ghanaian kelewele: spicy caramelized plantains.The BaseJollof is a one-pot dish almost always anchored by rice, but Thiam’s version uses fonio, a fluffy quinoa-like grain he grew up eating in Senegal. He sources his from a women-led farming collective in Kédougou called the Koba Club.The CondimentsWest Africans love to debate which regional style of jollof is best, so Thiam’s sauces cross the map: pico de gallo from Côte d’Ivoire, Ghanaian shito, Nigerian Scotch bonnet paste, and this garlicky Senegalese rof, which pairs perfectly with spiced roast salmon.The Special IngredientInstead of meat, Thiam adds ground fermented locust beans (which are actually seeds!) to the stock he uses to cook the fonio for a funky but vegetarian-friendly punch.Explore Bon AppétitWest AfricanRestaurantsNew YorkRead MorecultureThis Dive Bar Is Turning Out the Best Burger in OaklandBy Julia KramerrestaurantsTurkey Tails Are The Most Delicious Thing You Didn’t Even Know You Could EatBy Elyse InaminecultureThe Senegalese Chef Behind America’s New Favorite SupergrainBy Elazar SontagRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Jesse Sparks"]}