{"id": "1bcc56fee4b1bb4cf32677b80d04fd1c", "url": "https://www.bonappetit.com/story/white-label-mate-soda", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "It’s 4 a.m. and White Label Mate Soda Is the Only Reason I’m Still Standing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s 4 a.m. and White Label Mate Soda Is the Only Reason I’m Still StandingIt’s like Red Bull but...good for you?By Amanda ShapiroApril 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I really like dancing, and I really like sleeping. These two passions have long been in conflict, considering that the music I dance to usually gets good between 2 and 6 a.m. There are many ways, legal and otherwise, to deal with this problem, but I hadn’t found a solution that worked for me until I found White Label Mate Soda. Allow me some brief background: For decades, the club kids of Europe have been drinking a carbonated, lightly sweetened beverage called Club-Mate to fuel their all-night raves. (And mate, made from the naturally caffeinated leaves of the South American holly tree, has been steeped and sipped as tea for thousands of years.) But the soda was very hard to find in the States until recently, when an enterprising trio of music nerds began making a knockoff version right here in Brooklyn. You can find their White Label Mate Soda in bodegas, bars, and clubs around the borough, and it’s the most delicious energy drink I’ve ever tasted. It’s naturally low in sugar, it gives me the gentlest bump when I’m starting to flag, and—could it be? yes it’s true!—there’s ashwagandha, a stress-reducing adaptogen, in there. Who knew that partying could be so good for you?Buy It: White Label Mate Soda, $3 at mercato.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Amanda Shapiro"]}