{"id": "1be20a87f17d16178d2382fbed7d1282", "url": "https://www.bonappetit.com/story/has-the-queen-ever-eaten-pizza", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Has the Queen of England Ever Eaten Pizza? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHas the Queen Ever Eaten Pizza?A question we may never know the answer to, and more updates from the week at Bon Appétit.By Alex BeggsJanuary 19, 2019FacebookTwitterEmailPhoto by Tolga Akmen/Getty ImagesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Duchess of PepperoniI’m not going to get into hamberders at this point in the week. There are (actually) 2.7 million other places you can seethe and salivate over that one. The biggest food news for me this week was KATE MIDDLETON MAKING PIZZA with ADORABLE CHILDREN. Not nearly enough fanfare for this. Oh wait. (38,400,000 results.) When a kiddo asked if the Queen’s ever had pizza, the Duchess replied: “You know, that’s such a good question. I don’t know. Maybe next time I see her, shall I ask?” YES, PLEASE ASK. A million royal bloggers across the world pondered this historic question. No one had answers. In fact, I believe this is what you call Small Talk, but no matter, it’s the Duchess of Pepperoni, and it gets us one step closer to “Royal Secrets REVEALED!” Peter Morgan, get your research team on this! I need this addressed in the next season of The Crown more than I need anything else, other than ibuprofen and a Diet Coke, right now.When you really love black pepperWee-ooo, wee-ooo! Do you know what that noise is? THE PEPPER POLICE. On Basically this week, Molly Baz wrote about how salt and black pepper work in a dish, daring to suggest pepper isn’t as big of a deal as salting. The headline alone provoked over 1,000 Facebooks comments. My favorite were about the pepper police, which I might add, are a volunteer police department, subsidized by the passion in their hearts for public pepper safety. Rhys turned down the volume on MSNBC, threw his or her hands up in the air, and wrote, “Really? We’ve come to this? Spice shaming?” Katie double checked her notes and declared it the “Dumbest argument ever.” Leah time traveled in from 1867 and dropped the word “Poppycock!” David, who can't resist us, said: “this is why I cancelled a subscription years ago.” While multiple living readers shared the sentiment: “How bout dont tell me how to live,” “you should really mind your own business.” And then we all went on our ways, salting and peppering to our hearts discontent. I ...kinda want this on a t-shirt:Here we goMy Trader Joe’s reviews for 2019 have begun. NO, I haven’t been able to find the pancake bread yet. The jackfruit cakes are strange celery-salt patties, chewy, but interesting. The best new thing I tried this week: gluten-free toffee cookies. Heavy on the salt, in a good way. FOR CRUNCHY COOKIE LOVERS ONLY. No softies.Want this letter before it hits the website? Sign up for our newsletter!BYO-crab rangoonAlyse Whitney, a karaoke queen and the biggest pop culture fiend on staff, left us this week to go to Every Day with Rachael Ray. Alyse, thank you for introducing me to the Scrub Daddy and the best damn seaweed snacks on the market. But Alyse, curse you for making me go to one of my biggest social anxiety-fueled nightmares: karaoke. Also, Alyse had to produce and CODE this newsletter, which is a technical, tricky job on an outdated program. Congrats, Alyse!Photo by Chelsie Craig, Food Styling by Kate BuckensCook this, why dontchaWe were so psyched to have nacho expert Rick Martinez back in the Test Kitchen to develop this Super Bowl nacho recipe. The chile-chicken topping (made with rotisserie chicken, no sweat!), is so good I plan on making it on its own for hashtag meal prep. After the recipe was cross-tested for quality control (seriously), the tray sat on a stove getting cold and soggy. But I watched as bite by bite, hour by hour, people ate every last cold nacho. It’s THAT good.Unnecessary food meme of the weekUnnecessary food feud of the weekAlex LauIn honor of our 200th podcast episode, Rice 3.0 (if you haven’t heard rice episodes 1 and 2, I highly recommend it; you’ll laugh out loud in your car), we’re debating: RICE. PUDDING. The comfort food that we should all be making the next snow day. Chris Morocco agrees with me: “Who doesn’t like rice pudding? Kozy Shack, love it! A really extra chewy rice like Arborio—” then he made this guttural “oomph!” noise. “Coconut milk, cinnamon, vanilla, a little lemon peel—” another “Oooh!” But Julia Kramer is horrified at the thought. “Rice pudding is the most disgusting dessert of all time. First of all, it’s borderline savory, second, do you want to eat oatmeal for dessert?” Rice has a bounce that oats don’t have, JULIA. “It’s wet sand,” she concluded. “The texture is—” Meryl Rothstein then made a face that looked like she’d just sniffed a dirty diaper. “But it’s dessert, so I’ll still eat it.” “Kozy Shack? Put that in front of me and I’ll inhale it,” said Amiel Stanek. Adam Rapoport reported from his Mystery Location Out of Office to comment: “Yuck.” I guess I won’t be pitching any 15-page rice pudding features anytime soon.Make it! Carolina Rice PuddingLittle grains of sadness,Alex BeggsSenior Staff WriterExplore Bon AppétitBeggs NewsletterRead MorecultureMarie Kondo’s Kitchen Is So Tidy, She’s Trying to Fill It With StuffBy Alex BeggscultureIs It Ever Okay... To Take Home the Wine You Brought to a Party?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-19", "author": ["Condé Nast", "Alex Beggs"]}