{"id": "1be65f3071d57e6fd0ae0d7ea368eeee", "url": "https://www.bonappetit.com/story/choux-pastry", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Choux Pastry Unlocks a Universe of Sweet and Savory Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChoux Pastry Unlocks a Universe of Sweet and Savory BakingMaster choux pastry, feel like a mad pastry genius.By Tanya BushMarch 10, 2022FacebookTwitterEmailAlex LauFacebookTwitterEmailTo the novice baker, choux pastry brings to mind the sort of fear-inducing, tear-jerking mess of a technical challenge assigned for maximum drama on The Great British Bake Off. Choux is intimidating—maybe because it’s the foundation of sophisticated desserts like glistening towers of croquembouche and refined éclairs displayed neatly in the windows of French pâtisseries. The name itself inspires confusion. “What’s a shoe pastry?” my partner asked when I mentioned researching the dough.Allow me to assure you that the pastry’s reputation for fussiness belies its myriad of applications. First, these crispy golden pastries with supple, nearly custardy centers are made from ingredients you already have in your pantry and take less than an hour from start to finish. Flour, butter, water, milk, and a bit of sugar and salt are cooked on the stove; eggs are streamed in, acting as a natural leavening agent; and then the glossy mixture is piled into a piping bag and baked or fried. In its final form the tender, hollow pastry is endlessly versatile—it can be filled with all manner of creams, custards, or jams. Choux is also make-ahead friendly—both baked and unbaked, it freezes beautifully and retains its freshness. And finally, the pastry is forgiving. If your dough doesn't rise properly or your piping isn't practiced, you’ll still be left with hot, buttery goodness. (And if you need more hand-holding, Claire Saffitz has plenty of tips, from piping to filling, here.)Through my pastry-making adventures, I’ve come to view choux not as a laborious project, but rather, as a low-effort and versatile opportunity for a meal or snack. Once you master the simple process, I promise that the possibilities choux provides—plopped or piped, sweet or salty—are boundless.Savory ChouxRecently, I found myself confronted with the tragedy of a bread-less household. Nary a stray tortilla, bread-heel, or crust in sight, my traditional weekend breakfast sando seemed hopelessly unattainable. Suddenly, I remembered my freezer contained choux dough leftover from a prior pastry escapade. I waited (less than patiently) for the dough to come to room temp and once it was ready, piped it into clumsy circles, and baked them at 400°. In just 20 minutes I had a salty, rich, crisp vehicle for my egg and cheese sandwich.After this discovery I embarked on a savory choux breakfast expedition. I made gougères, a traditional cheesy French choux, with goat cheese and scallions. I filled oblong-shaped éclairs with smoked salmon, cream cheese, dill, and red onion, brushing the dough with toasted sesame seeds. Soon I was branching out to other meals. I used a cookie scoop to create egg-size puffs, then cut them in half and filled them with all manner of lunch ingredients. BLT choux? Yes please! Steak sammy but in an éclair? Be still my beating heart.This savory croquembouche is filled with seasoned ricotta.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensI felt like a mad pastry genius, a pioneering member of the choux-as-sandwich lobby. High on my choux supply, I decided to make mini pâte à choux hors d'oeuvres for a gathering I was hosting, filling some of the tiny puffs with Italian peppers and artichokes and others with black fig jam and pâté. The snacks proved to be an elegant—and facile—party snack, and I froze the leftover choux puffs to repurpose for later use.Sweet ChouxThere are a number of swift and creative approaches to choux that will satisfy even the most urgent yearning for sweets. For a decadent breakfast or snack, the sumptuous combination of choux and hot chocolate proves unrivaled. Churros, in fact, are made of choux dough piped into strips, deep-fried, and tossed in sugar. But if frying isn’t your jam, that’s okay too: Baked choux in any shape, whether sprinkled in sugar post-bake or left plain, pairs beautifully with hot cocoa. If you’re feeling particularly energized, infuse the milk for the pâte à choux dough with cinnamon, cardamom, or other spices for an extra hint of flavor. And if hot chocolate isn’t a staple at your breakfast table, choux with milky coffee or chai is certain to delight.For dessert itself, the possibilities are, naturally, endless. Most pastry aficionados are familiar with the profiterole, an ice-cream-filled cream puff, but perhaps a lesser-known invention might awaken your childlike whimsy: the Chaco Taco Choux. For an elevated version of this nostalgic classic, pipe your choux dough into a circle, bake until extra-crisp, fold, and then fill with vanilla ice cream and chocolate sauce.We now declare you éclairs.\nAlex LauFor another take on a sweet choux sandwich (that is, if you consider a taco a sandwich), you might take a playful approach to the French pastry the Paris-Brest. This baked ring of pâte à choux is traditionally sliced in half and filled with praline crème mousseline (pastry cream whipped with butter). Perhaps you might try a strawberry shortcake Paris-Brest with crème fraîche whipped cream and strawberry compote or jam. You might even attempt a tiramisù-inspired version, with mascarpone coffee cream and crumbled ladyfingers, or a deconstructed hot fudge sundae, with malted vanilla custard and a cherry on top.Finally, consider nun’s puffs, which are tiny choux balls that get frittered and rolled in sugar—I suggest you dash to your kitchen and get to deep-frying. These tiny delights, dipped in your morning coffee or slathered with mascarpone and jam, will bring you joy.Hopefully, I’ve been able to impress upon you that the possibilities for choux-making, baking, and consuming are endless. Next time you find yourself without a carb in sight, I propose that you forsake any anxious hesitation and consider the world of the choux.A total choux in:Jalapeño Popper GougèresThese light and eggy cheese puffs are channeling your favorite bar snack.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-10", "author": ["Condé Nast", "Tanya Bush"]}