{"id": "1c0208505e3bbf0af367797ead17353c", "url": "https://www.bonappetit.com/recipe/coconut-cold-brew-coffee", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Coconut Cold Brew Coffee Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueCoconut Cold Brew CoffeeBy Kat BoytsovaFebruary 12, 20194.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintMixing toasted coconut into your coffee grounds before brewing creates a pleasant coconut flavor without any added syrups. If you’re in the habit of buying an iced coffee from a shop every day, this economical homemade version will save you time—and reduce your plastic use.IngredientsMakes 3 cups16oz. coffee beans (about 4 cups), coarsely ground1½cups toasted unsweetened shredded coconut3cups milk (cow’s, oat, or nut) or water2Tbsp. (or more) pure maple syrupPreparationStep 1Place coffee and coconut in large bowl, jar, or pot. Slowly pour in 8 cups cool water and stir very gently until grounds are just moistened. Cover and chill 24 hours.Step 2Strain coffee grounds through a fine-mesh sieve into a large measuring glass or bowl. Discard grinds. Line sieve with a coffee filter and add as much coffee as will fit. Strain gradually into a 1-qt. airtight container or jar, adding more coffee as space is available until all the coffee has been added. Allow grounds to sit in strainer and continue to drip 20 minutes.Step 3To serve, pour ½ cup coffee into an ice-filled glass; add ½ cup milk and 1 tsp. maple syrup and stir to combine.Step 4Do Ahead: Cold brew (without milk and maple syrup) can be made 2 weeks ahead. Keep chilled.How would you rate Coconut Cold Brew Coffee?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI wouldn’t say the cold brew tasted spectacularly coconut-y, but it did give my typical cold brew a different (and better, imo) flavor. Toasting the coconut takes a little time, so I only do this when a have time to spare, but it’s fun and delicious to add into the mix. AslockeNashville, TN4/8/2019Explore Bon AppétitCold DrinkDrinks AllCoffeeAlcohol & Other DrinksCoconutFruitDrinksDairy-FreeGluten-FreeVeganVegetarianNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}