{"id": "1c0d3aeaf5850aeb51bb8fa876ea9a9c", "url": "https://www.bonappetit.com/story/i-dont-like-thanksgiving", "year": 2019.0, "month": 11.0, "day": 5.0, "content": "[whispers] I Don’t Like Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle[*whispers*] I Don’t Like ThanksgivingSubversive Thanksgiving thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 29, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Sue Li, Prop Styling by Amy Wilson FacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,We have a “don’t yuck my yum” policy here at Bon Appétit, which means we don’t tell people that a thing they love—food or otherwise—is gross. (Though did you see Andy’s face when Brad says “pink peppercorns”?) And nothing would be more of a “yuck” than admitting that I don’t like Thanksgiving, which is why I generally keep my mouth shut around the office this time of year. But this is my newsletter; therefore I’d like to explain my feelings just a little bit.I don’t like celebrating excess—eating, drinking, spending, colonialism—all things that this week has come to represent. I’ve always felt that way (ask my family about the time I refused to come out of my room for dinner), but this year I’m trying to have a better attitude, to do as the Hallmark cards say and focus on the “giving thanks” part of things.My Virgo nature loves nothing more than an arbitrary challenge, so I decided I’d send three unconventional thank yous out to the universe: no family members, friends, or co-workers (though I love you all), only people who it felt a little awkward to reach out to but who I felt an honest desire to thank.First I emailed the broker who helped me get my apartment last spring. I told him how desperately I’d wanted the place and that I truly think that living there has changed my life. He wrote back, basically acknowledging that I’d been a total mess when we met and saying he was glad he could help.Then I texted an ex-boyfriend from years back, who probably doesn’t even realize it’s Thanksgiving because he’s Canadian, and thanked him for acting like a kid with me well into our twenties, for splurging on motel rooms with jacuzzis, and for very patiently trying to teach me guitar. He hasn’t responded and maybe he never will, and I’m okay with that.I haven’t decided who my third thank you will be, but I’ll let you know when I figure it out. In the meantime, I’m with staff writer Alex Beggs: enough with the turkey burn workouts. Instead I’ll be jamming to jammers, unsubscribing to marketing emails (my annual purge), and awaiting my mother’s instructions with apron strings tied tight.Still need wine? Maybe, dare I say it, some merlot? We got you.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterThanksgivingessayRead MoreLifestyleThese Are My Favorite Healthyish Thanksgiving RecipesBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-30", "author": ["Condé Nast", "Amanda Shapiro"]}