{"id": "1c131d88500d3ac901eed9a7e12d172a", "url": "https://www.bonappetit.com/story/wild-arc-farms-piquette", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "It's Hot. I'm Day Drinking. I Require Wild Arc Farm's Piquette | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt's Hot. I'm Day Drinking. I Require Wild Arc Farm's PiquetteThis low-ABV, fizzy wine is what’s getting me through summer.By Emily SchultzAugust 22, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The Tortoise and The Hare has more similarities with day drinking than you make think. Day drinking isn’t about being the fastest one. When done properly, a slow and steady pace leaves you feeling like you’ve accomplished enough fun to go to bed at 10 p.m., FOMO-free. That’s very much my thing. So when it’s peak summer and I’m spending my Saturdays  at the beach, I'm reaching for Wild Arc Farm’s piquette; the tart, bubbly, and responsible day-drinking beverage.But first, a history lesson. Piquette is an old French method where you add water to grape pomace, the grapes leftover from the wine pressing process, to make a second wine. Centuries ago, French field workers took home those scraps and poured in water and something sweet to kickstart fermentation. The result was a refreshing, effervescent drink that’s now making a comeback.Todd Cavallo is the winemaker behind Wild Arc Farm, a biodynamic farm in the Hudson Valley that started in 2016. He’s made a four-tiered rainbow of bubbly piquettes from the grapes he grows: floral Traminette, blackberry-like Teroldego, Cabernet Franc, and Riesling. I first tried the Riesling piquette from Henry’s in Brooklyn, which has a mild sour taste that reminded me of licking a Warheads candy wrapper and the slightest fizz. It didn’t take me long to try the rest, which you can now snag at Tiny’s Bottle Shop in Philadelphia, Riverview Wine in Jersey City, or Kinsfolk Wine on Washington's Bainbridge Island.As I drank my way through the piquettes, I was constantly reminded of the wine coolers my mom brought to our beach house at the Jersey Shore. It had that same cloudy look but none of the syrupy-sweet aftertaste. And while my mom’s wine coolers clocked in at around 5 percent ABV, the Wild Arc Farm’s piquette sits pretty at 7 percent. It’s the cool wine cooler, and I’ll be sipping it on the beach all summer long.Find a bottle or join the mailing list to purchase directly: Wild Arc FarmExplore Bon AppétitHighly RecommendWineNew YorkRead MorecultureLeon and Sons’ Wine Club Is the Only Kind of Club I’ll JoinBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-22", "author": ["Condé Nast", "Emily Schultz"]}