{"id": "1c4c180b94aed6b5686894136e95eb04", "url": "https://www.bonappetit.com/recipe/trouble-cookies", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Trouble Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueTrouble CookiesBy Roxana JullapatJanuary 12, 20214.8(15)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Once you eat one, you just can’t stop,” says Roxana Jullapat in her cookbook Mother Grains (out April 2021). Hence how these cashew-and-toffee-loaded cookies got their name. Naturally sweet sorghum flour becomes caramelly when combined with butter and brown sugar. Look for whole-grain unbleached organic sorghum flour (Bob’s Red Mill makes one), which has more flavor (and fiber) than the refined version. Can’t find sorghum flour? Play around with any heirloom wheat flour in its place—like spelt, buckwheat, rye, or einkorn—each will bring its own special something.IngredientsMakes 16¼cup plus 2 Tbsp. (60 g) raw cashews½cup (1 stick) unsalted butter, room temperature¾cup (packed) plus 2 Tbsp. (175 g) dark brown sugar1large egg1tsp. vanilla extract½cup plus 2 Tbsp. (80 g) sorghum flour½cup plus 2 Tbsp. (78 g) all-purpose flour1tsp. baking soda½tsp. baking powder¼tsp. kosher salt¾cup (70 g) unsweetened shredded coconut, plus more for serving½cup (90 g) English toffee chips (such as Heath Bits O’ Brickle)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Toast cashews on a rimmed baking sheet, tossing halfway through, until golden, 8–10 minutes. Let cool before chopping into pea-size pieces.Step 2Beat butter and brown sugar in the bowl of a stand mixer fitted with the paddle attachment on medium speed until light and fluffy, about 5 minutes. Add egg and vanilla and beat 1 minute. Add sorghum flour, all-purpose flour, baking soda, baking powder, and salt and beat just until combined. Add cashews, coconut, and toffee. Mix just until combined. The dough will be very soft at this point. Wrap tightly and chill at least 30 minutes or up to 2 days (if chilling for more than 30 minutes, transfer to a sheet of parchment paper or plastic wrap, flatten into a disk, and wrap tightly to prevent drying).Step 3Place racks in upper and lower thirds of oven; preheat to 375°. Divide dough into 16 equal portions (about 1½ oz.; 45 g each). Working quickly so that the dough doesn’t warm up, roll each portion into a ball with your hands. Divide cookies between 2 parchment-lined baking sheets, spacing at least 3\" apart. Press gently with palm of your hand to flatten and decorate with a sprinkle of shredded coconut.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until edges are brown but centers are still a little gooey, 12–14 minutes. Let cookies cool on baking sheets before serving.Do ahead: Dough can be formed into balls 2 weeks ahead; freeze on a baking sheet until solid. Transfer to an airtight container or freezer bags and keep frozen. Bake from frozen; cookies may take a few minutes longer to bake. Cookies can be baked 2 days ahead; store airtight at room temperature.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Trouble Cookies?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleGiven all that I'm going to say below, these were pretty great. I think I still need to work on them a bit to make them amazing. \n\nI'm still working on getting these right and I'm not sure if it is an altitude thing but both cookie recipes I've made from BA have needed the temperature adjusted 30-50F lower. No other recipes have needed that. I cooked these @350F for 13min and they were a bit overdone. I am going to try 325F for 14min next. \n\nI'm in Colorado @ 5,000 ft so I'm also going to check and see what adjustments are normal at altitude for cookies for the next batch because these are worth a few attempts :) Aaron ToddFort Collins, CO9/27/2021What a wonderful subtly sweet, buttery, salty cookie with just the right amount of crisp and chew! I followed the recipe exactly because that's just me, (the first time I try a recipe) if I am able to gather all the ingredients. I don't think I'd change a thing.Emily M.Niskayuna, New York4/30/2021FABULOUS!!AnonymousSeattle 3/9/2021These are DELICIOUS! And I didn't have toffee chips and was too lazy to make them, so I used chocolate chips instead. So so good- the texture and flavor was to die for. Kat HChicago, IL3/7/2021These are delicious cookies.  Only change I made was putting more Heath Bar crumbles on top rather than coconut.  My husband really likes them so I have made them at least 4 times.  However, they tend to flatten out when cooking.  I'd love to know the secret to keeping them from doing that.  I've tried everything and measured ingredients by grams.ShermanSeattle, WA2/21/2021Any suggestions for toffee replacement? Could you just use chocolate chips?Cal2/3/2021Holy cow these cookies are seriously delicious. Made no adjustments but I did make my own toffee chips (it’s super easy, just google it) and sprinkled on some Maldon salt before cooking along with the shredded coconut. 5 star.Lauren GCalgary, Canada1/24/2021Explore Bon AppétitCookieDessertCashewNutCoconutFruitSorghumRice & GrainsEasyVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}