{"id": "1c51b90f0750e51b6a317f8ec563f24d", "url": "https://www.bonappetit.com/story/grilled-turkey-thanksgiving", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Thanksgiving, Put Your Turkey on the Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Thanksgiving, Put Your Turkey on the GrillFood director Carla Lalli Music shares why taking the turkey outside is the best thing you can do for your bird.By Carla Lalli MusicNovember 1, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The best turkey is grilled turkeyI got a message from a friend last night asking for my all-time Thanksgiving hit list, and since we are officially within the three-week training period leading up to the holidays, I figured we should just jump right in.Want this letter before it hits the website? Sign up for our newsletter!There are a lot of recipes that Bon Appétit has published over the years that have weaseled their way into my family’s holiday menu, and some of them have even been invited back. There’s the famous salted butter apple galette; the already-legendary-even-though-they-were-just-published burnished potato nuggets (check them out below); the world-famous hasselback butternut squash; and these sticky, garlicky sweet potatoes that my father now demands every year. But the one dish that I will literally never not make—even if it means we have two competing birds on the table—is a barbecue-inspired, spiced, brined, and smoky grilled turkey. It is, as the kids say, legit.This recipe wins at everything because it optimizes every element of turkey cookery and fool-proofs the entire process. I can prove it!Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiTrue or False:Turkey is blandFalse! Turkey is bland when you don’t season it. This turkey is blanketed with hot paprika, mustard powder, ground cumin and cayenne, light brown sugar, and salt. (Okay, fine, I skipped one ingredient: dried savory. With all due respect to Rick Martinez, the ace food editor who created this edible creature, dried savory is ridiculous and no one is going to go buy it. I prefer to use dried oregano. My house, my rules!) This spice mix sits on the turkey for a half-day, but I’ve done it overnight to no ill effects.The turkey hogs all the oven spaceNot when it’s grilled, it doesn’t! Cooking your turkey over live fire is a brilliant decision on so many levels. For starters, it puts you, the cook, in the great outdoors, where you can both appreciate nature and avoid pesky family members and guests that you’ve had enough of. It’s the holidays, after all. If you love everyone who’s coming over, then they can join you at the grill. Maybe they’ll bring you a hot cider or a beer. Between you and me, you don’t even need to stay out at the grill the whole time, since the turkey cooks with the grill lid closed, and doesn’t need to be flipped once. Don’t tell anyone that, make them think you’re doing extremely important pitmaster stuff that only you can do, and it would be a lot better for everyone’s dinner if they could fetch you another beer, thanks. Smoke and turkey meat are a match made in heaven—there’s a good amount of richness in turkey meat (especially in the legs and thighs) that makes it particularly well suited to wood-charred flavor.Cooking turkey takes all dayNot true this time! Giant whole turkeys take a long time to roast, no doubt, a problem that is worsened when Great Aunt Jeanette puts a still frozen bird in the oven. Our cooking process is hastened dramatically because we call for a split turkey, and those halves, with all their exposed surface area, only need an hour on the grill. One. Hour!Turkey is dryGigantic turkeys that roast for a million hours are dry. Split turkeys that are brined, then cooked over moderate heat for 60 minutes, are juicy to the bone, with tobacco-colored skin and smoky-spicy meat.© Peden and Munk LLCEveryone will get mad if I do something “non-traditional”Extremely false. There is plenty of butter, parsley, sage, rosemary, cranberry, sweet potato, white potato, and stuffing on the table. This particular turkey has some spice, yes, but it’s 100 percent complementary to everything else on offer, and if my own personal focus group is any indication, absolutely no one will have a problem with having one new thing in the mix. If someone you love really wants a classic bird, that’s fine, too. Give them this crowd-pleasing recipe and let them have at it. After all, the oven’s free!Get the recipe:Barbecue Spice–Brined Grilled TurkeyRead MorecookingHow to Spatchcock a TurkeyBy Carla Lalli Musicculture33 Thanksgiving Turkey RecipesGallery33 SlidesBy Josie AdamsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Carla Lalli Music"]}