{"id": "1c5655e0e3b97871ddbc79c7d9e66fd8", "url": "https://www.bonappetit.com/story/fiona-bakery-los-angeles", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "The Chocolate Chess Pie at Fiona in Los Angeles Turned Me Into a Pie Lover | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Thought I Hated Pie, Then Fiona’s Chocolate Chess Changed EverythingImagine a mashup of all the chocolate dessert greats (brownie, soufflé, flourless cake) nestled in a buttery, crisp crust.By Christina ChaeyApril 8, 2019FacebookTwitterEmailPhotograph by Dylan + JeniFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are two kinds of pie I truly lose my dough over: pot and pizza. But try to tempt me with a fat slice of pumpkin or pecan, apple or cherry, and my reaction will always be a solid “meh”—unless there is also ice cream involved, in which case I will just be extremely excited about the ice cream. But the decadent chocolate chess slice I was recently goaded into ordering at Los Angeles’ charming all-day café Fiona is anything but pie-like...which is probably why I fell completely in love with it. Delightfully fudgy and gooey with a shiny, crackly top, the filling was closer in spirit to the boxed brownies my mom would make when I was a kid (the greatest dessert of all time to eight-year-old me) than any pie I’d ever eaten. A big dollop of unsweetened whipped cream on the side is optional, but IMHO is not really optional. And after having eaten so many mediocre pie crusts—tragically underbaked and crispy-gone-soggy in the rare, bad way—I was in no way prepared for pastry queen Nicole Rucker’s take, which flakes into a million crisp, buttery shards at the touch of a fork, the way a well-made croissant does. I polished off my slice and found myself walking out the door...with an entire pie to-go.Go there: FionaExplore Bon AppétitHighly RecommendRestaurantsLos AngelesDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Christina Chaey"]}