{"id": "1c5b100d2a3ec3dcd9f63fc62582bfce", "url": "https://www.bonappetit.com/recipe/honeysuckle-red-drink-punch", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Honeysuckle Red Drink Punch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueHoneysuckle Red Drink PunchBy Omar TateJune 2, 20203.8(7)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintOmar Tate, chef-owner of the pop-up dinner series Honeysuckle, draws on his childhood Kool-Aid-making memories and a bit of grown-up kitchen chemistry for his version of the traditional Juneteenth Red Drink. It’s a blend of sugar, citric acid, and powdered dried strawberries and cherries. “It’s a natural version of Kool-Aid,” he says of the tangy-sweet booze-free beverage. “I serve it to my pop-up dinner guests in individual powder packets to stir for themselves as an exercise in destigmatizing Black food traditions.”Ingredients8–10 Servings2oz. freeze-dried strawberries   (about 3 cups)1.25 oz. freeze-dried cherries (about 1 cup)1cup sugar1Tbsp. plus 1½ tsp. citric acidPinch of kosher saltPreparationStep 1Process strawberries, cherries, sugar, citric acid, and salt in a food processor until finely ground, about 1 minute.Step 2Pour 10 cups water into a large pot  or bowl. Whisking constantly, sprinkle  in powder; whisk until sugar dissolves, about 2 minutes. Strain into a pitcher.Step 3Pour into ice-filled glasses to serve.Step 4Do ahead: Powder can be made  1 month ahead. Store airtight at room temperature.How would you rate Honeysuckle Red Drink Punch?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleSo sour!HarrisonSacramento, Ca11/23/2020As soon as I read this article in the magazine, I knew I had to make this drink. I love Kool-aid but never drink it anymore because it's basically colored sugar water. The recipe seemed a bit complicated because of needing to strain it but it's well worth the effort to remove the seeds. But, this is no Kool-aid. It is sooo much better. It's more like a delicious, fresh tasting Hawaiian Punch, without the corn syrup and artificial additives. I will be making this again. I also bought other freeze dried fruits to try different variations. I think this would make a great base for a summer spritzer or a shot of hard stuff like Vodka or Rum if you want to spice it up.\n\nTo answer the person below, weigh the powders based on the measurements given. (2oz and 1.25oz) RobbieKPennsylvania6/23/2020I see the freeze dried strawberries & cherries already available as a powder.  Can you say how much powder this would translate to?  It looks amazing!\nartichokesMedway, MA6/11/2020Explore Bon AppétitPitcher DrinkDrinks AllPunchCold DrinkSoul FoodAmericanStrawberryBerryFruitCherryStone FruitSummerEasyQuickDrinksNonalcoholicJuneteenthFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Omar Tate"]}