{"id": "1c6165fe44326b31ecb07df0fcde766a", "url": "https://www.bonappetit.com/recipe/celery-and-turnip-pickles", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Turnip and Celery Pickles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueTurnip and Celery PicklesBy Susan KimFebruary 9, 20215.0(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintPouring hot vinegar over raw vegetables makes a brightly flavored condiment that can be used to make Korean doshirak (pictured here)—or added to breakfast tacos and sandwiches. It can be eaten right away but will taste even better after a night in the fridge.IngredientsMakes about 1 quart1cup unseasoned rice vinegar3Tbsp. sugar1bunch Tokyo turnips or radishes, trimmed, quartered lengthwise5celery stalks, sliced on a diagonal ¼\" thickPreparationStep 1Bring vinegar, sugar, and ½ cup water to a boil in a small saucepan over medium-high. Remove from heat and stir until sugar is dissolved.Step 2Pack turnips and celery into a 1-qt. jar or place in a large heatproof bowl; pour hot pickling liquid over. Let sit, tossing every 15 minutes or so, until cool, about 1 hour. Seal jar or transfer vegetables and brine to an airtight container (a 1-qt. deli container works well) and chill.Do ahead: Turnips and celery can be pickled 2 weeks ahead. Keep chilled.How would you rate Turnip and Celery Pickles?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentPickleTurnipVegetableCeleryEasyGluten-FreeNut-FreeDairy-FreeVeganVegetarianPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Susan Kim"]}