{"id": "1c6fb57a7bd67f109006d3b4f867a18f", "url": "https://www.bonappetit.com/recipe/frijoles-de-la-olla", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Frijoles de la Olla Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueFrijoles de la OllaBy Rick MartinezAugust 18, 20205.0(32)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“I don’t soak beans. Ever,” says Rick Martinez. “Think about it: Dried beans are very absorbent, and when you let them puff up in a bowl of water overnight, what they’re absorbing is just that—plain water. To me, the hour or two that process shaves off your cook time simply isn’t worth a plain-water-flavored bean. Instead, I do like most Mexican households and toss my beans straight into a flexible five-ingredient blend of water, salt, herbs, garlic, and some kind of allium. After a few hours of simmering (fresher beans cook faster, but any will work), every last bean is suffused with rich, savory flavor.” A good rule of thumb is to check for tenderness every hour to make sure they don’t overcook and start breaking apart. But if they do, it’s a great excuse to refry them—no one will ever know!IngredientsMakes about 3 quarts3spring onions or scallions, trimmed, or ¼ medium onion2sprigs hardy herbs (such as avocado leaves, rosemary, thyme, or bay)3small sprigs tender herbs (such as epazote, cilantro, basil, or mint)3garlic cloves, crushed1lb. dried beans (such as pinto, black, cannellini, or kidney), rinsed, picked through2Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher saltPreparationStep 1Bring scallions, herbs, garlic, beans, salt, and 4 quarts water to a boil in a large pot. Reduce heat to medium-low and simmer gently, uncovered, skimming surface and stirring occasionally and adding more water as needed to keep beans covered, until beans are tender, 1½–3½ hours. Cooking time will depend on how old the beans are. Remove scallions, herbs, and garlic.Step 2Do Ahead: Beans can be cooked 3 months ahead. Transfer to an airtight container and freeze.How would you rate Frijoles de la Olla?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleJust wanted to update my post.  I used this method again, only with fresher beans from Rancho Gordo and it took 2.5 hours this time, instead of 5.  So good.  Won't use soak method anymore.  KristineSanta Clarita, CA7/16/2021Used mayocoba beans, of unknown age, following directions exactly.  It took almost five hours until they were done, and they were so delicious. Will do it again.  KristineSanta Clarita, CA7/13/2021Never ever ever soaking beans again or buying canned black beans. This recipe is so easy and they taste AMAZING!!  Used them to make the enfrijolada recipe which was equally amazing!LaurenSuffolk, United Kingdom3/12/2021I can't believe I used to soak beans. This is so much easier and flavorful! Thank you Rick! Yannin2/3/2021I've always wanted to make homemade beans but never had time to soak (or forgot to soak).  This recipe was easy to make and smelled delicious.  I'm intrigued to try avocado leaves, but all I had was fresh thyme and it was delicious.  At the end, I added cumin and ancho chili powder.  It was wonderful and satisfying.  KarinSan Clemente, CA1/21/2021This is the BEST recipe for  beans, so easy to adapt to whatever aromatics you have in your pantry/kitchen/fridge.conniethecook11/14/2020Made these today.  Didn't have onions or fresh leafy herbs so used onion powder and dried oregano.  Still delicious.  Beat the instant pot hands down (except during the dead heat of summer when it's too hot for stove tops)AnonymousNYC!10/23/2020I really like the energy savings with reduced cook times.  Why not just soak the beans in the flavored liquid?\nAnonymous10/12/2020This nails it.  Just as I learned to do them in S. Texas. AnonymousBoise9/23/2020Oh man. Never pre-soaking beans again! These were bomb and only took a few hours. Anonymous9/15/2020Made these with some Rancho Gordo black beans. Delicious ! I tend to skip soaking my beans when I can, and I love the rationale that they soak up more flavor with this method. I also used them in the enfrijoladas recipe that came out in this issue which was also amazing!Anonymousphiladelphia9/9/2020An excellent recipe. I made this with a bag of pinto beans, 1/4 onion, smashed garlic and used fresh herbs that I had on hand - bay leaves, thyme sprigs, oregano. This created a layered, subtle broth. I was surprised to see mint included in the list of tender herbs, so out of curiosity, I threw a few in at the start of the simmer. I could immediately sense their impact to the flavor so I pulled them out. Personally, I liked the subtle affect to the flavor of the beans, but my girlfriend did not. Next time, I'll pick up some fresh epazote (and avocado leaves if I can find them) from the local mexican grocery store and use that for the simmer. a.goekler7491Denton, TX9/2/2020I’ve been waiting fo a recipe for that bag of beans in my cupboard that I bought at Costco for a good price..  thank you so much for putting this in the magazine!  It was delicious and I wowed my mom too.AnonymousLubbock, Tx8/30/2020Rick, I'm with you, I never soak my beans.  I just let them go.  And this is a great recipe, thank you so much for sharing.AnonymousKerrville, TX8/29/2020Explore Bon AppétitMexicanLatin AmericanPinto BeanBeanVegetableBlack BeanCannellini BeanWhite BeanKidney BeanEasyMainSideGluten-FreeDairy-FreeNut-FreeVeganVegetarianHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}