{"id": "1c73a32955f6e09f06741cfc2eba4598", "url": "https://www.bonappetit.com/story/best-cannabis-gifts", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "The Best Gifts for Cannabis Enthusiasts, According to BA Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Cannabis Gifts, According to BA’s Own Herbal EnthusiastsYOU get a weed! And YOU get a weed!By Ali Francis, Chala Tyson Tshitundu, and Hilary CadiganDecember 14, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Here at Bon Appétit we love a holiday gift guide. But we, the staff stoners herbal enthusiasts, love something a little more specific. Weed. The best gift of all. And now that it’s legal in 18 states and counting—and even your grandparents are like, “So, will this stuff help my aching hip?”—we decided it was high time (sorry) for our first-ever Cannabis Gift Guide. Here you’ll find actually delicious edibles, gorgeous glassware, tools for aspiring canna chefs, and even a THC-laced perfume. In other words, everything your family and friends—and you—need to chillllllll out this holiday season, tested by us and conveniently categorized for all your Weed Santa needs. (Just keep in mind that because we’re still waiting for many states to hurry up and go green, the THC products on this list are not available nationwide.) Read on for our favorite cannabis gifts—and happy holidaze.For the ’90s kid who never really grew up:Pop rocks but make ’em weed. Sonder’s Cheers Queers! Space Crystals are everything you loved as a kid, with an extra special adults-only addition: 10 mg of full spectrum THC derived from sun-grown Californian cannabis plants. Let the strawberry Champagne–flavored crystals burst on your tongue until dissolved, then go for the most euphoric nature walk of your life. Or you know, spend a throwback day playing Mario Kart in mom’s basement.Sonder Cheers Queers! Space CrystalShop Now at ProperFor the person whose SAD lamp is no longer cutting it (🙋🏻‍♀️): Beat the winter blues with 1906’s Bliss Drops, a mix of four potent plant medicines—magnolia for tension relief, kanna for energy, theobromine for brain function, and a 1:1 CBD and THC cannabis blend for truly euphoric vibes—combined in one easy-to-swallow pill. Pop one before the office holiday hang and your social anxiety will melt; Bob from Sales will become utterly fascinating; and you’ll take the crown for (bubbliest) employee of the year. Be warned: A fave among BA staff stoners, this product has been known to incite impromptu dance parties. 1906 Bliss DropsShop Now at 1906For the aesthete with a sweet tooth:These ultra-luxe Cloud 11 Salted Peanut Chocolates, nestled in a custom cloud-printed tin, are elevating edibles to a whole new echelon. Crafted by actual chefs Nick Pritzker and Manuela Sanin (who used to lead the pastry program at Eleven Madison Park), each little pine-tree-shaped bonbon is a work of art, with rich dark chocolate and creamy roasted peanut butter ganache. Intentionally low-dose, with only 2–4 mg of THC and CBD in each piece, you can enjoy one or two (or three) without worrying about flying off the face of the earth. Oh, and did we mention each order is hand-delivered by the studio’s in-house courier service? Yeah, that.Cloud 11 Salted Peanut ChocolatesShop Now at Cloud 11For the Martha Stewarts among us:Love cooking and cannabis? The LĒVO II (in chic licorice black, obviously) is for you. This intelligent countertop gadget “takes the confusion out of infusion,” by helping you make your own weed butter, oils,  honeys, and more. Use your spoils to whip up just about anything, or buy one of the brand’s easy-to-use baking or gummy kits. Sure, Mom, you can use oregano.Levo Oil Infusion Machine$300 $290 at Levo$300 at AmazonFor that pal who loves happy hour but quit booze:Pure Beauty’s Little Strong Drink is exactly what it says it is: a whopping 100 mg of THC in a 2-oz. bottle. Made with Concord grape juice, cardamom, and destressing ashwagandha, it’s cute, complex, and perfect for wellness-minded teetotalers looking to catch a buzz. Mix ¼ to ½ capful (2.5 mg and 5 mg THC respectively) with sparkling water or kombucha for the hottest take on a nonalcoholic cocktail your holiday house party has ever seen.Pure Beauty Little Strong Drink$22 at SavaFor the coworker whose apartment was recently featured on Clever (and won’t let anyone forget it):This Honey Tanjun Pipe, made from handblown saffron-colored glass that feels fancy in your palm, is one of the most beautiful bowls out there, and doubles as both an incense holder and an objet d’art. Set it out on your bookshelf next to some plants and few will ever guess its true function. But you’ll know. Laundry Day Honey Tanjun Pipe$48 at Laundry DayFor your favorite Libra:October-borns need to maintain emotional equilibrium at all costs, but they’re not the only ones who’ll benefit from Camino’s Yuzu Lemon “Balance” Gummies. With a yummy sweet-tart citrus flavor, harmonious blend of uplifting sativa and mellow indica strains, and a 1:1 ratio of CBD and THC, expect a distinctly stabilizing high—one that’s a little bit euphoric, a little bit calming, and suitable for a night alone in front of the BewbTewb or that white elephant party you only sort of want to go to.Camino Yuzu Lemon “Balance” GummiesShop Now at KivaFor the (aspiring) beauty blogger:True beauty comes from within, and this superfood-rich CBD supplement will have you feeling glowy inside and out. Made with functional mushrooms and stress-relieving adaptogens, NFZD’s Hey Beauty Wellness Blend works to improve gut health while providing balanced nourishment for hair, skin, and nails. One scoop of this superpowered blend will transform your favorite morning beverage into a daily beauty tonic.NFZD Beauty Wellness Blends$100 at NFZDFor that cousin who is “very into Y2K fashion”:Okay, not to get all “when we were your age,” but when we were your age there was always that dude with a finished basement full of snacks and parents who never came down to sniff around—and that dude always had a Volcano. The granddaddy of vaporizers and a true feat of German engineering, this sleek convection heater warms your flower to produce an immaculate vapor that’ll fill up a balloon the size of your head. Inhale it straight to the face if you want to feel like you’re underwater for several hours, or go with small doses if that’s more your thing. Regardless, its Y2K charm and all-around intensity is sure to impress any of-age young person you’re trying to convince that you’re cool. (Just probably don’t open with, “When I was your age.”) Volcano Classic Onyx Edition$479 at Storz & BickelFor the off-duty designer who loves rolling spliffs and going to the MoMA:Psychedelic, sturdy, and artful, this Sunrise to Dusk Ashtray by Balefire Glass is the perfect gift for the aesthetically minded stoner—or, um, person who loves a paperweight—in your life.Sunrise to Dusk Ashray$96 at TetraFor your brother who wanted a Tesla (but definitely isn’t getting one):Ever wondered what would happen if NASA made weed products? Wonder no more. It would almost definitely be ALT’s Premium Liquid Cannabis, a matte black box filled with glass vials of liquid ‘erb that purportedly “fuses nature with science and exists to ENHANCE HUMAN POTENTIAL™.” (Yes, that’s an actual quote, and an actual trademark, from the website.) But it’s pretty cool! The near flavorlessness of the liquid means you can mix it into anything; the measurements on the vials offer precise dosing; and the high is very clean.ALT Premium Liquid CannabisShop Now at ALTFor the glamourpuss who values function as much as form:Laundry Day’s golden shell-shaped Paola Herb Grinder looks like a makeup compact that was custom-designed for Ursula from The Little Mermaid (all hail). It also grinds weed to uniform perfection. Hurry home, princess.Laundry Day Paola Herb Grinder$65 at Laundry DayFor the parents who claim they’ve “never tried grass”:These Wyld Strawberry 20:1 CBD + Hybrid Enhanced Gummies are the perfect place to start for any canna-noob (or, ahem, anyone pretending to be). With 20 mg of CBD and 1 mg of THC per serve, they’ll relax the old bod while keeping your mind focused and alert. Ideal for easy hikes, group hangs, stressful work days, or any situation where it’s inappropriate to get totally lit.Wyld 20:1 CBD Strawberry gummies$22 at MedMenFor the stressed out eco-activist:A raw honey naturally infused with CBD by BEES? Yes, please! By supplementing bee diets with full-spectrum hemp nectar, active cannabidiol is organically introduced into their digestive systems and, subsequently, the honey they produce: Red Belly Raw Hemp Honey. As a bonus, these helpful little buzzers get rewarded in turn: A recent study showed that bees exposed to hemp extract are actually more resistant to certain pesticides. Nature knows what she’s doing!Red Belly Honey$80 at Red Belly HoneyFor the candy-head:If you also house PB M&M’s like it’s your literal job, you’re gonna love Grön’s Dark Chocolate Peanut Butter Pips. With 2.5 mg of THC and 2.5 mg of CBD per candy, they’re the perfect edible for daytime playtime or a BYO movie theater snack: light, fun, and balanced. That’s presuming you don’t eat the whole bag at once. Who, us? Never.Dark Chocolate PB Pips$19 at DutchieFor the herbal enthusiast who owns BOTH Mina Stone cookbooks:These Stoned Fruit CBD Rosin Delights—the latest collab from Gossamer and Rose Los Angeles—are like the natty wines of hemp. Made from a heady blend of plums, peaches, thyme, and CBD (only), these Turkish delights are complex, truly delicious, and perfect for your food friend who’s vowed to stress less in 2022. Nosh on them throughout the workday (or at the annual family reunion) for an uplifting dose of chill. Note: A THC-laced variety will be coming to a dispensary near you in the New Year. Check back in for the deets.Gossamer x Natasha Pickowicz Turkish Delights$30 at SavaFor the novelty glass collector:Fruit bowls take on a whole new meaning with this adorable Flower by Edie Parker Grape Pipe. Made from durable molded borosilicate glass and shaped like a bunch o’ grapes, this funky pipe will keep things fresh and fruity while you enjoy your after-work wind-down routine.Glass Fruit Pipe$135 at Flower by Edie ParkerFor your cool aunt with the Cruella De Vil vibesDitch the vape and go back to the basics with a pack of these top-shelf Stone Road Pre-Rolls (we like the indica-dominant Garlic Cookies strain for a blissful body high, but the possibilities are many). Elegantly tucked into 100% post-consumer cigarette-style cartons, these hand-rolled joints are packed with high-quality organic flower from Stone Road’s solar-powered biodynamic farm. It’s cannabis the way nature intended: sun-grown, minimally processed, rolled with care, and very, very glam.Stone Road Pre-RollsShop Now at ProperFor the herb lover who has it all (but still wants more):Every holiday gift guide has this: that item for the person who needs nothing. But we’d wager that none offer a solution like The Herbalist Eau de Parfum, by Drew Martin and Heretic. It’s PERFUME! With WEED in it! And it smells like what we imagine that alpine meadow from The Sound of Music smells like. It won’t get you stoned per se, but it does contain THC (specifically the sativa-hybrid, euphoria-inducing Jack Herer strain) and when spritzed onto pulse points and sniffed, we noticed a mild dreamy-happy feeling that exceeded the usual “hey that smells good” pleasantness. Also the packaging is extremely pretty.Drew Martin X Heretic The Herbalist PerfumeShop NowFor the person who bought a tiny tree on Etsy for their one-bedroom apartment:Insa’s Peppermint Candy Cane Dark Chocolate Bar is peppermint bark but with weed in it. What else do you need to know?INSA Peppermint Candy Cane Chocolate Bar$30 at INSAExplore Bon AppétitShoppingCannabisCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-14", "author": ["Condé Nast", "Ali Francis", "Chala Tyson Tshitundu", "Hilary Cadigan"]}