{"id": "1c8e5f3ea77715539a15c1b6157a0728", "url": "https://www.bonappetit.com/recipe/spring-chicken-salad-with-smashed-green-beans", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Spring Chicken Salad with Smashed Green Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpring Chicken Salad with Smashed Green BeansBy Kat BoytsovaMay 26, 20195.0(11)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintProperly-poached chicken breast is truly a thing of beauty—juicy, tender, and a blank canvas for big flavors. And if your only experience with poached chicken is the dry-as-a-bone stuff from the salad bar, then this method will be a revelation. The trick is to cook the chicken very low and slow, so paying attention to your heat level is of the utmost importance. Add some crunchy veggies and a punchy Dijon vinaigrette, and you've got exactly the kind of simple, satisfying composed salad you need when a reset dinner is in order.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Saucepan with Lid$39 At AmazonTongs$13 At AmazonInstant-Read Thermometer$35 At ThermoworksCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonWhisk$10 At AmazonPlastic Bag$11.70 At AmazonRolling Pin$13 At AmazonPlatter$29 At AmazonPaper Towels$13.45 At AmazonIngredients4 servings2large chicken breasts (about 1 lb., 4 oz. total)Kosher salt1lemon2Tbsp. Dijon mustard6Tbsp. extra-virgin olive oilFreshly ground black pepper8oz. green beans1small bunch chives1large head of Bibb lettuce1cup basil leaves1bunch radishes1cup whole peperoncini1avocadoPreparationStep 1Cover 2 large chicken breasts with 4 cups cold water in a large saucepan. Season with 3 Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt. It sounds like a lot, but most of it will be discarded in the end, and well-seasoned poaching water is the key to flavorful chicken breasts.Step 2Bring to a gentle boil over medium heat, then immediately turn chicken with tongs. Cover pot with a tight-fitting lid, remove from heat, and let sit until an instant-read thermometer inserted into the thickest part of breast registers 150°, 5–10 minutes (depending on thickness of the breast). Transfer chicken to a cutting board and let rest 10 minutes.Step 3Meanwhile, make the dressing. Cut 1 lemon in half and squeeze cut side up into a medium bowl. Whisk in 2 Tbsp. Dijon mustard. Whisking constantly, very slowly stream in 6 Tbsp. olive oil until dressing is thick and emulsified. The word “slowly” is key here—if you add the oil all at once, you won’t get the creamy, nicely incorporated vinaigrette you’re after. Season with salt and pepper.Step 4Trim ends off of 8 oz. green beans and transfer to a large resealable plastic bag. Seal bag and whack beans with a rolling pin to split the skins and soften the insides without completely pulverizing the flesh.Step 5Drizzle 2 Tbsp. dressing into bag. Massage with your hands to break beans down further and coat. Season with salt and let sit at room temperature until ready to use.Step 6Slice 1 small bunch chives into 2\"-long batons. Transfer to a medium bowl. Separate lettuce leaves from 1 large head of Bibb lettuce and add to bowl with chives. Add 1 cup basil and toss to combine. Arrange on one side of a large platter. Cover lettuce and herbs with damp paper towels and chill until ready to use.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Rinse 1 bunch radishes, trim, and slice in half (or into ½\" wedges if large). Transfer to a medium bowl. Tear 1 cup whole peperoncini into bowl. Mix in 1 Tbsp. dressing; season with salt. Let sit at room temperature until ready to use.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Slice chicken into ¼\"-thick slices. It might be the tiiiiniest bit pink inside, which is okay! Much better than it being grey and rubbery.Step 9Halve 1 avocado, remove pit, and thinly slice. Fan out slices.Step 10Remove platter with lettuce from fridge. Arrange green beans, radish salad, avocado, and chicken separately on platter. Drizzle more dressing over and serve remaining dressing alongside.How would you rate Spring Chicken Salad with Smashed Green Beans?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleOutstanding recipe!  Surprised by how delicious the radishes and peppers were.  Love poached chicken and this recipe is right on for that.  Seattle4/18/2020Poached chicken surprised me with the flavor! Super good dressing and a lovely way to celebrate spring veggies! AnonymousPortland, or3/24/2020This poached chicken is the real deal. I was skeptical, but I followed the poaching directions exactly as written and it turned out delicious! It does take a little bit of time so be prepared, but it is well worth the wait. \nThe salad together was delicious as well. Not a big radish fan but they are perfect in this recipe.ClaireW17Dallas, Texas6/19/2019In Singapore, poached chicken is the backbone of Hainanese chicken rice, often claimed to be the “national dish.”  One thing a hawker stall always does to their poached chicken is cool the bird off so it doesn’t overcook.  Just like with shrimp.  Use running water, or better, an ice bath.  Cool the chicken quickly, don’t rest it.fredricksonArizona6/3/2019goodAnonymousGarden Grove, CA5/29/2019so easy & delicious! i started whole 30 today, and as long as you check the ingredients on your mustard & peperoncini, this recipe is 100% compliant. the chicken poaching method worked perfectly. added jammy eggs for my vegetarian husband. memahonybrooklyn 5/29/2019Explore Bon AppétitSaladSalad DressingChicken BreastChickenPoultryGreen BeanVegetableLettuceLeafy GreensAvocadoSpringQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-26", "author": ["Condé Nast", "Kat Boytsova"]}