{"id": "1cae03fece7e029f48138483841f326d", "url": "https://www.bonappetit.com/story/wedding-gifts-registry-liquor-store", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "I Registered for Wedding Gifts at a Liquor Store, and I Regret Nothing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Registered for Wedding Gifts at a Liquor Store, and I Regret NothingThink silver tequila instead of sterling silverware.By Gray ChapmanJanuary 11, 2018FacebookTwitterEmailCourtesy of Holeman & Finch Bottle ShopFacebookTwitterEmailIt started, as many moments of brilliance do, with a dumb tweet.Deep in the morass of wedding planning, beleaguered by RSVP spreadsheets and vendor contracts, and desperately in need of a drink, I asked my favorite liquor store if I could just register for our wedding gifts there. It was sort of a joke, at first. But a few weeks later, I found myself inside Atlanta’s Holeman & Finch Bottle Shop, surrounded by glimmering bottles and feeling, for the first time in months, at peace.Twitter contentThis content can also be viewed on the site it originates from.Having lived in sin for a few years before marriage, my partner Dane and I were well-situated on domestic necessities by the time we got engaged: no fancy stand mixer, but enough linens and cookware to cover our bases. So the idea of zapping tea towels with a scanner gun in a Bed Bath & Beyond seemed deeply unnecessary.\nGood booze, however, is a different story.We aren’t party animals by any stretch of the imagination (I prefer a prompt 10 p.m. bedtime) and at home, we aren’t particularly heavy drinkers. But we both like to mix drinks, especially for friends and family. I’m drawn to the prospect of having a well-stocked home bar because I like to offer friends something interesting—something besides vodka and seltzer with a hunk of lime. Making a good drink for a friend gives me as much pleasure as feeding them a good meal. And I like tinkering behind the bar. But when many craft spirits run $30-$60 per bottle, cultivating a well-stocked home bar can become an expensive hobby really fast.Inside H&F Bottle Shop, Atlanta.\nPhoto by Henri Hollis/Courtesy of Holeman & Finch Bottle ShopSo, two or three months before my wedding day, I skipped out of work for a few hours and made my way from Old Tom gin to rhum agricole in the aisles of H&F Bottle Shop. Unlike nearly every other wedding planning-related interaction I’d had, the process was unrehearsed and informal (and, I imagine, more fun than being shuffled around a department store by an overbearing sales associate). Amber, the manager, led me through the spirits side of the shop and provided her guidance when needed, steering me toward the shop’s most interesting bottles, like a gin from Germany’s Black Forest (Monkey 47) and a tequila whose production process involves crushing the agave with a massive, Flintstone-esque stone (Fortaleza).We ended up with a list of 2-3 high-quality examples of each major spirits category: Kentucky bourbons like Jefferson’s and Johnny Drum, gins from Sipsmith and The Botanist, and both spiced rum (Old New Orleans) and rhum (Clement). We also added some curveballs, like Westland’s sherry-aged single malt, a Bigallet aperitif, and electric-yellow Ungava gin.Amber jotted down the picks on a slip of paper they kept on-file at the cash register, and Dane and I included the shop’s information on our wedding website. Our guests could walk in, ask for the list, pick out a bottle to take home, stick a bow on it, and call it a day. No scanner guns, no spreadsheets. The process was so lo-fi, it seems like the kind of thing most boutique bottle shops could pull off, if you ask (or tweet) nicely. And, okay, yes, we did register for some non-booze items we really did want. But choosing to register for silver tequila instead of sterling silverware continues to be one of the best nuptial-related decisions I made.Those gift bottles offered us a means with which to celebrate and toast to our new two-person family, and two years in, the wedding liquor is still flowing freely in our home. In the midst of navigating all the outdated customs that come with planning a wedding, any chance to stray from tradition—like registering for whiskey instead of Waterford—is a revelation. When my friends come over for dinner and we break out the barrel-aged gin they gave us, it’s meaningful and special because we can enjoy it together. The liquor store “registry” offered a best-of-both-worlds scenario for gift-giving and receiving: a bridge between thoughtful, tangible objects, the ones that remind you of the giver every time you use (or pour) it, and memorable experiences you share with the people you love. Good spirits can be both of these things.Related: 6 Kitchen Tools Your Wedding Registry Doesn’t NeedExplore Bon AppétitWeddingShoppingRead MorecultureOpen Bar or Nah? How to Get Wedding Guests Drunk Without Spending a FortuneBy Rachel Tepper PaleycultureWhy a Sheet Cake Is Better Than Any Expensive Wedding CakeBy Rachel Tepper PaleycultureWhere to Splurge vs. Save on Your Wedding's Dining BudgetBy Rachel Tepper Paleyculture5 Food Mistakes to Not Make at Your WeddingBy Rachel Tepper PaleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Gray Chapman"]}