{"id": "1cb59434bd3d9fb91d875b64b3b30e1b", "url": "https://www.bonappetit.com/story/chefs-at-home", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "What We Can Learn From Chefs Cooking at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat We Can Learn From Chefs Cooking at HomeEvery week, there’s something new…By Adam RapoportMay 19, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When you’re an editor in chief, the truth is, you’re not totally on top of every little thing that goes on at your brand. So when Bon App’s social media team of Rachel Karten and Emily Schultz launched our Chefs at Home series on Instagram, I saw the first episode the same time our 4 million followers did.And, just like them, I was hooked.Cramped galley kitchens, microwaves installed over tiny four-burner ranges, rice makers stowed on crowded counters. Hey, big-shot professional chefs—they’re just like us!Over the past two months, Karten and Schultz have reached out to everyone from Parnass Savang at Atlanta’s Talat Kitchen to Nina Compton of New Orleans’ Bywater American Bistro. And they have graciously invited us into their homes to show us how they cook for themselves—step by helpful step—when they’re unable to operate their restaurants.Each episode, I walk away not only starving, but feeling like I have a new home cook–friendly dish I’m itching to add to my arsenal.Take the charming, playful Savang, who demo’d khai jiao, a Thai omelet. After beating two eggs and adding to them chopped scallions and crisped-up pork-belly (I think I’ll just be going with basic bacon), he pours the mixture into a skillet of smoking hot oil. The egg instantly inflates into a puffy, crispy, custardy pillow. Magic. On to a bed of steamed jasmine rice it goes. Hello, dinner.Want this letter before it hits the website? Sign up for our newsletter!Parnass Savang’s khai jiao!!!\nPhoto by Parnass SavangCompton, meanwhile, confidently commands a chocolate-brown roux before piling in andouille sausage and fresh crawfish. I can almost smell it through the screen. And it reminds me that when this whole crisis finally subsidies, I need to get back to New Orleans, America’s most unique food city, and Compton’s Bywater Bistro.Rounding out the weekly series is the exuberant Yia Vang from Union Hmong Kitchen, teaching us how to make the grilled tri-tip with tiger bite sauce from our June Grilling Issue cover. Ashleigh Shanti, of Asheville’s Benne on Eagle, greets us in her favorite cozy robe with a big mug of coffee, while making glossy, syrupy strawberry compote for a stack of cornmeal pancakes.Oh, and I can’t forget Lucas Sin of Junzi Kitchen, who absolutely schools us on the art of fried-rice making with his golden rice technique. He coats each grain with egg yolk before adding it to a shimmering hot pan. Just when you think you know what you’re doing, a technique like this comes along and resets your dials. (Recipe coming online, soon!)Like everyone, my inbox and Instagram feed overflows each day with lord knows what. But each week I eagerly await the newest Chefs at Home installment, because just like you, I have no idea who’s up next.Explore Bon AppétitAdam NewsletterRead MorecookingThere's No Better Time to… Add Brown Butter to Your OatmealBy Alex BeggsLifestyleMy Pantry Spreadsheet Is Bringing Me So Much Joy Right NowBy Christina Chaeyculture32 Highly Achievable, Totallllllllllly Normal Quarantine Cooking ProjectsBy Alex BeggscultureWhere To Order Meat OnlineBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-19", "author": ["Condé Nast", "Adam Rapoport"]}