{"id": "1cbfee8a14f93edc3e91094a21022025", "url": "https://www.bonappetit.com/story/blk-girls-green-house", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Blk Girls Green House Is a Lush Home for Oakland’s Black Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis New Nursery Is a Lush Home for Oakland’s Black CommunityFounders Kalkidan Gebreyohannes and J’Maica Roxanne will find the perfect plant for everyone. By Flora TsapovskySeptember 10, 2020FacebookTwitterEmailFacebookTwitterEmail“It’s a beautiful time to grow,” proclaims the mission statement of Blk Girls Green House. For Kalkidan “Kalu” Gebreyohannes and J’Maica Roxanne—the founders of the new Oakland plant nursery, retail concept, and community space—growth comes in many forms. The multi-hyphenate business is the answer to what has been, according to Gebreyohannes, “a double pandemic” for people of color nationwide. Located in a city that has been both a symbol of Bay Area gentrification and the heart of California’s Black Lives Matter protests over the past few months, their joint venture offers a welcoming space of pause, joy, and calm for Black people (that’s also the perfect COVID-19-friendly outdoor hangout).“I was sick recently and J’Maica was taking care of me,” Gebreyohannes says. “As I was feeling better, I wanted to go to a plant nursery. We went together and it just was such a healing, therapeutic feeling. And then we just talked about what it could feel like if we had our own space—inclusive, open, and inviting in particular for Black people—during these times.”Affordable retail space is notoriously hard to come by in the Bay Area, but Axé (pronounced “a-sh-eh”), a gym and wellness space Gebreyohannes belonged to, offered its adjacent lot for rent. Open on Friday–Sunday, it features houseplants from tiny cacti to supersized palm trees (some displayed in a custom rose-gold greenhouse), a coffee cart by Black-owned Blythe Coffee, and merchandise made exclusively by Black-owned businesses, such as candles by BLK by Amina and coffee mugs by Reflektion Design. The community response was more than welcoming with plenty of foot traffic and requests to book the space for photo shoots. Outside of the Bay Area, they’ve already been approached about potential pop-ups in D.C., L.A., and Atlanta.Below, the two share their thoughts on breaking wellness stereotypes, the power of plants, and creating a truly accessible space in turbulent times.On buying plants while BlackGebreyohannes: There are Black people who own nurseries, gardens, and farms; we want to be clear about that. Anybody who understands history knows that we’re very much connected to plants—medicinally, nutritionally. But there’s been a stereotype that it's an almost privileged, elitist experience to be able to go to a nursery and buy a plant, specifically the indoor plants and home goods type of store. It’s been an experience that has really alienated a lot of like Black people and minorities in general. I know that I’ve gone to plenty of these places and have not felt at home.Roxanne: It was mandatory for us to open in Oakland, where there are people who want to take advantage of the space. Oakland for a long time has been, and still is, synonymous with some very key parts of Black history. The Black Panthers and other activist and social movements have come through Oakland or originated here. I think we’d be doing a disservice if we said that we wanted to be inclusive but opened [the business] somewhere else, where we know Black people don’t have access.Gebreyohannes: We are on Martin Luther King Jr. Way. We are in the heart of a part of Oakland that people don’t want to invest in, that people are not thinking about twice.Merchandise for sale in the space is made exclusively by Black-owned businesses.\nOn bringing a community space to lifeGebreyohannes: We both felt super affected by the protests, and it’s what I consider to be an ongoing trauma. Just thinking about Breonna Taylor’s killers still not being arrested is super triggering for me. We realize the importance of prioritizing our space and making sure that people, especially Black people, are taking the time to take inventory. Fighting for our rights, our causes, securing some peace for ourselves—it’s exhausting. But it’s not all in vain. A lot of beautiful things have come from those unfortunate situations and it proves to me that Black people are very, very resilient.Roxanne: It feels good to just pause and be able to focus on something else. When we started bringing this space to fruition, at the end of the day we felt exhausted, but for a different reason. It’s fulfilling. It’s key for us to bring that to life for other people, to give them a deep breath, a moment of space. Especially now, when we’re almost confined to our homes.On finding the right plant for everyoneGebreyohannes: Both J’Maica and I grew up around older women, a mom or an aunt who loved plants. When we connected, after meeting at the annual Black Joy Parade in Oakland in February, almost every single one of our conversations was around plants. When you’re passionate about something, you learn a lot about it, so over the course of the past eight years I learned about seasons, air quality, filtration systems, the sun, and the temperatures certain plants can sustain (since we’re entirely outdoors, it’s an important factor). We choose plants based on categories, like people just starting off and plant enthusiasts. A Philodendron birkin, for example, is pricey for its size, but people who are in the plant game really understand that it’s a great, sophisticated plant to have. But when people ask, “what's good for someone who’s not good with plants?” we point them to cacti and succulents.On creating a space for Black rest and joyRoxanne: My grandma recently passed away—that’s her photo in the golden frame [leaning against the wall of the greenhouse]. She was 92 years old and she used to do yoga, you know what I mean? People are finally deciding to pay attention to it, but wellness is something we’ve been doing.Gebreyohannes: It’s not just yoga—Black women are actually really great at self-care. The problem is that institutional racism has made it so that we have to be burdened by many other things. We’re worried about our children getting shot and murdered; we’re worried about dying at alarming rates while giving birth. America has been set up so that we have to focus on trying to stay alive as opposed to enjoying and living. So our space requires people to just relax.We’re very intentional about the way things look and make you feel. If a Black woman coming in sees photographs of Black people and things that are created by Black people, and hears that the music is coming from our people, it creates a sense of familiarity and acceptance. It’s a reflection of us that feels celebratory, positive, and joyous.Explore Bon AppétitOaklandHealthyishSelf CareInterviewsRead MoreLifestyleHow to Grow Your Own Food, Even If You Don't Have a GardenBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-10", "author": ["Condé Nast", "Flora Tsapovsky"]}