{"id": "1cd21153e2542e706caea4ec7d49f669", "url": "https://www.bonappetit.com/recipe/brown-butter-and-sage-parathas", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Brown Butter and Sage Parathas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueBrown Butter and Sage ParathasBy Sohla El-WayllyOctober 20, 20204.6(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis is your standard laminated paratha, using the browned, nutty milk solids from brown butter to laminate the dough. For the flakiest results, form the dough coils the night before and let them rest overnight, tightly wrapped in plastic. And if you have time, parcook the parathas in advance too so they can chill fully in the fridge before the final cook. (To parcook, cook them over moderate heat until the dough is cooked through and no longer sticky, but not browned. Then you can easily stack them.) This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.IngredientsMakes 81cup (2 sticks) unsalted butter, cut into pieces24sage leaves1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus more1Tbsp. sugar3cups (375 g) all-purpose flour, plus more for dustingPreparationStep 1Melt butter in a small skillet over medium heat until foamy, about 6 minutes. Continue to cook, stirring occasionally, until butter begins to sputter, about 2 minutes more. Add sage leaves and cook, stirring constantly, until sputtering subsides, milk solids are light golden brown, and sage leaves are crisp, 5–7 minutes. Using a slotted spoon, transfer sage leaves to a plate and lightly season with salt; set aside. Continue to cook butter, stirring constantly, until milk solids are deep golden brown, about 1 minute more. Pour brown butter into a heatproof measuring glass, scraping in milk solids. Let sit undisturbed until milk solids fall to bottom of glass, about 2 minutes. Carefully pour all but ¼ cup brown butter into a small bowl, leaving milk solids behind. Chill brown butter with milk solids until thickened and creamy but still soft; set aside for layering in the parathas.Step 2Whisk sugar, 3 cups (375 g) flour, and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt in a large bowl. Add 1 cup warm water and 3 Tbsp. melted brown butter and mix with a wooden spoon until no dry spots of flour remain and dough comes together in a shaggy mass. Cover with a plate and let sit at room temperature 15 minutes.Step 3Knead dough in bowl until it forms a smooth mass, about 2 minutes. Transfer to an unfloured surface and continue to knead until smooth and elastic, about 8 minutes. (The dough will feel very sticky at first but will grow smooth and soft as you go. Try to avoid adding more flour if possible.)Step 4Roll dough against surface to form into a ball; return to bowl. Drizzle with 1 Tbsp. melted brown butter and turn to coat. Arrange seam side down and cover with plastic wrap. Let sit at room temperature at least 1 hour and up to 4 hours (if you poke the dough with your finger it shouldn’t spring back).Step 5Using a bench scraper or chef’s knife, divide dough into 8 pieces. Working with 1 piece at a time, cup dough in your palm and roll against work surface to form into a ball. Coat each ball with brown butter; cover with a damp towel, plastic wrap, or overturned bowl and let sit 20 minutes.Step 6Stir reserved chilled brown butter to evenly distribute milk solids into fat and make sure it’s creamy and spreadable. Roll out 1 piece of dough on a lightly floured surface until as thin as possible. Don’t worry about size or shape at this point; you just want it to be superthin. Using your fingers or an offset spatula, spread a heaping teaspoonful of chilled brown butter across dough (it doesn’t have to be even, just get it on there), dust lightly with flour, and break 3 sage leaves into pieces and scatter on top.Step 7Starting from the top, roll dough into a long snake. Fold ends inward until they meet at the center, then stack the 2 coils onto each other and press together firmly. Lightly dust with flour and place on a parchment-lined baking sheet. Repeat with remaining pieces of dough. Once all pieces have been coiled, cover and let rest at room temperature at least 2 hours or chill overnight.Step 8Heat a dry medium cast-iron skillet (10\" or larger) over medium. Working one at a time, roll out dough coils on a lightly floured surface to 7\"–8\" rounds about ⅛\" thick, rotating after each roll to keep evenly round. Brush off any excess flour with a pastry brush. Parcook paratha in skillet until just set but without taking on any color, about 2 minutes per side. Transfer to a clean baking sheet as you work.Step 9Brush pan with brown butter and place a parcooked paratha in middle of pan. Brush paratha with more brown butter and cook, turning every 30 seconds and adding more brown butter as needed, until golden brown and crisp, about 3 minutes. Wrap in a kitchen towel to keep warm and quickly scrunch to release any steam (this will keep them from getting soggy). Repeat with remaining parathas, stacking in towel as you go.Step 10Do ahead: Parathas can be parcooked 1 day ahead. Wrap tightly and chill, or freeze up to 3 months.How would you rate Brown Butter and Sage Parathas?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleOMG, love the new flavor for this breadararlaWoodbury, NJ1/29/2021Could not wait to try this once I saw the recipe. Made them last night and they turned out great! Switched out half the all-purpose flour for  wholewheat flour.Purnima PatelBethesda, MD12/2/2020Saw this recipe today and I'll be making it tomorrow!!Edward Szczerba New York 11/18/2020These sound delicious! I have a dairy allergy, would I be able to make these with olive oil instead of browned butter?Anonymous10/29/2020Explore Bon AppétitFlatbreadBreadBangladeshiSouth AsianAsianIndianSageHerbs & SpicesSideNut-FreeVegetarianBakingThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}