{"id": "1cd97af680e1c82808c914dac29bbd02", "url": "https://www.bonappetit.com/story/what-is-tahini", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "What Is Tahini, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Tahini, Anyway?The ingredient that fueled your obsession with hummus is good for much, much more.By Alex DelanyFebruary 13, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailThere will be movies about tahini, possibly titled something like The Great Invasion or Tahini Attack or When Tahini Ruled the World. Tahini is everywhere. But what is tahini, really? It used to be an ingredient that was obscure and exotic to a lot of American home cooks, but now it’s practically ubiquitous; these days you're just as likely to find it in your hummus or salad dressing as you are to see it swirled into brownies or drizzled over fruit at a cool, healthyish restaurant. We need to understand it. And understand it we shall.You might already know that tahini comes from sesame seeds. Congratulations. You are on the path to true tahini enlightenment (TTE for those in the industry. JK, not really.). If you were to describe tahini to a third grader, you’d say, “Tahini is ground, toasted sesame seeds.” They’d understand, and then you’d keep talking to them about Pokémon. But we’re going to give you a little more credit than your third grade friend. We’re moving past the ground sesame seed thing.There’s a difference between good and bad tahini. The best tahini is mildly nutty, creamy, and savory—you should want to eat it with a spoon. It's rich and luxurious, with a texture like a loose nut butter. Bad tahini, on the other hand, can be bitter and astringent, bordering on acidic, and can be dry with an almost chalky mouthfeel. Which is all to say, it's important to grab the best you can when you're strutting through the aisles at your local grocery store. Trusting a brand is the easiest way to avoid a negative tahini experience, which everyone dipping their freshly toasted pita at your party will appreciate.If you’re the type of person who’s down to order something online (maybe by the case) because it’s the best, Soom tahini is what you’re after. We happen to think it has the perfect texture and flavor, but don't take our word for it—it's the only tahini that chef Mike Solomonov uses at Zahav, his famed Israeli restaurant in Philadelphia, and Dizengoff, his chain of hummus restaurants. When it comes down to it, you can use Soom tahini just as you’d use peanut butter. (They have a tasty chocolate version too.) It’s our favorite tahini around. But it you’re looking for a quick pick-up at the grocery store, Whole Foods 365 brand tahini and Roland tahini are both great options. You might also come across black tahini, which is tahini made from black sesame seeds and has a darker, more intensely roasted flavor.Tahini cookies. Yeah.\nPhoto by Laura Murray, styling by Judy ManciniSo now you have the good stuff. What do you do with it? Well, remember how we said you can essentially use it like peanut butter? Yeah, do that. Swirling tahini into cakes and brownies creates cool patterns and a nutty flavor. Baking it into cookies takes you down a similar but different path than a classic peanut butter cookie. You can also use it to create some heft and mild, toasty flavor in creamy salad dressings and vegetable dips, or you can add it to sauces for stir-fried noodles or vegetables. A quick spread over some toast with honey or bunch of pickles works well too. And yeah, of course, there’s always hummus.Whether you’re swirling, drizzling,  mixing, dipping, or swimming in it, tahini is a lot easier to get into your dinner game plan than you think.This isn't some specialty ingredient that should sit in the back of your fridge for a couple months after you use it once. It's worth more than that. Tahini is a giver. You just need to accept its love.Buy a 4-Pack of Soom Tahini right now on Amazon for $32.80We know you've been thinking about hummus for the last four paragraphs.Let’s Do This: Easy Homemade HummusHow to get it nice and smooth—and you might never buy it again.View StoryExplore Bon AppétitBasicallyTahiniHummusSesame SeedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Alex Delany"]}