{"id": "1cd94836363452959a64847a6d602fb4", "url": "https://www.bonappetit.com/story/rejected-advent-calendars", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "The Advent Calendars That Never Made It to Market | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 7 Advent Calendars That Never Made It to Market‘Tis a shame!By Alex BeggsDecember 3, 2018FacebookTwitterEmailIllustration by Jay Daniel WrightFacebookTwitterEmailEvery holiday season, new advent calendars hit stores that go way beyond the traditional daily chocolate, causing a downright frenzy. Countdown to Christmas with CHEESE?! Okay, yes! Mini bottles of wine, little jars of jams. NEED! Sold out! What will they think of next? But behind every genius invention are a handful of ideas that never got their chance to shine. These are the advent calendars that never made it to market.Illustration by Jay Daniel WrightWhat’s Inside Aunt Cathy’s Purse Advent CalendarThis calendar counted down the days until Christmas with select offerings from Aunt Cathy’s purple faux croc Brighton Collectible handbag: a hanky that once belonged to Great Grandma Milly, a glow-in-the-dark rosary, piña colada Tic-Tacs, the business card of the Panera manager who owes her a salad, a bottle of Herbalife Cell-U-Loss® vitamins, a Starbucks gift card down to .45 cents, and a tube of burgundy tinted Burt’s Bees. But the real treasure is on Christmas day: a police-strength pepper spray keychain.Illustration by Jay Daniel WrightThe Hot Soup Advent CalendarWatch out! All month long, these hot soups will scald you with holiday spirit, somehow kept heated by a cheap cardboard box. Look forward to a bowl of split pea, followed by lobster bisque, an extra chunky clam chowder every Friday, and on Christmas morning: a big bowl of bison chili.Illustration by Jay Daniel WrightThe Restaurant Mint Advent CalendarEvery day is a different mint your dad stole from various mid-range restaurants over a span of 14 years of business travels. Pastel buttermints from Ponderosa, chocolate peppermints from Red Lobster, crinkly Lifesavers from Denny’s, spicy cinnamon ones from Ninfa’s, ice blue ones from the Macaroni Grill that closed in 2002, those not-quite Andes mints from Olive Garden, a stray golf ball from Hooters, and on Christmas morning, greet the lord’s birthday with: a half-eaten tin of Altoids and loose change.Illustration by Jay Daniel WrightThe Raisin Advent CalendarWake up, run to your advent calendar, and behold: a single shriveled raisin, every single day until Christmas.Illustration by Jay Daniel WrightThe Expired Food That’s Still Good* Advent Calendar [*Keep Refrigerated]With at least six cups of Yoplait key lime pie, this expired food that’s still good advent calendar promotes a less wasteful food system as much as it tests the biochemical strength of your gut. Tear open one surprise after the next: still painted hard-boiled Easter eggs, takeout lo mein from three weeks ago, half-eaten container of hummus turned to spackle, speckled shredded Parmesan, a salami stub, a few old Babybels, a jar of fuzzy manzanilla olives, and a nearly new jar of Prego alfredo. If you survive until Christmas, look forward to that tuna salad stored in a festive old cottage cheese tub! #Upcycle.Illustration by Jay Daniel WrightThe Tap Water Advent CalendarIt’s local! Try a sip of tap water from half of every state in this limited-edition advent calendar that celebrates Christmas with a cloudy cup of North Dakota rain water. Stir up the flavorful sediment with a Candy Cane for even more festivity [not included].Illustration by Jay Daniel WrightThe Dirty Dishes Advent CalendarUnwrap a new soiled dish that needs washing as we countdown until the birth of Christ: pint glasses with dried bubbles of beer on the side, oily popcorn bowls, mystery meat speckled cast iron pans, box graters with hardened cheese, a bloody knife, a mixing bowl with cemented flour, and on Christmas: a salad spinner with tiny shards of kale in the panes.You know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools for holiday cookies. More details here.Explore Bon Appétitholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Alex Beggs"]}