{"id": "1cdb0668dc58ddd895bdff67e5445171", "url": "https://www.bonappetit.com/story/how-to-hot-pot", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "How to Make Hot Pot At Home, From the Broths to the Add-Ins to the Condiments | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEverything You Need to Know to Make Hot Pot At HomeThe method (and the madness) behind our favorite communal, choose-your-own-adventure meal.By Elyse InamineFebruary 19, 2022FacebookTwitterEmailPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.You cannot feel lukewarm about hot pot because hot pot does not feel lukewarm about you. Commonly found in East and Southeast Asian cooking, hot pot is centered around a vessel of roiling broth, into which diners plunk meats, seafood, vegetables, and starches. It’s a communal dining experience that calls for your attention and participation, as you throw handfuls of chrysanthemum greens or blocks of fish tofu into the broth. It demands that you be hospitable as beef slices reach peak medium-rare or thin rounds of potatoes soften to the perfect snappy texture—a signal for you to swiftly ferry them over to your fellow diners’ bowls. “Everyone is part of the journey with you,” says Eric Sze, the chef-owner of 886 and wenwen in New York City. “That’s why I love hot pot so much.”When he was growing up in Taiwan, Sze was surrounded by many different types of hot pot restaurants. But he was stunned to find virtually none in his college town of Ithaca, New York. A homesick student, he decided to make it himself for his then-girlfriend (now wife) with whatever meats he could find in the nearest grocery store’s freezer section along with Napa cabbage, lettuce, enoki mushrooms, and vermicelli. Immediately, he was hooked and started ordering hot pot at restaurants wherever he traveled and perfecting his own game at home. If you’ve made hot pot once, he explains, it becomes something you know and from there you can riff. “Every time, I pick up new things, like I’m going to try adding taro, or beef top blade instead of just short rib,” Sze explains.That’s the beauty of hot pot: It’s choose-your-own adventure once you’ve learned the basics. And if you haven’t? Well, you’ve come to the right place. Welcome to our hot pot primer. Taking our lead from Sze, we’re sharing broths that’ll be the foundation of your meal, the perfect variety (and prep) of fixings to dip into those broths, gear that guarantees the smoothest hot pot experience, and our very chill rules to turning all these elements into the dynamic, delicious feast we love. By the end of it, you won’t be lukewarm—you’ll be a hot pot obsessive.Skip Ahead:The GearThe BrothThe IngredientsThe TechniqueThe Condiments1. Get Your Gear In OrderBefore you begin laying out your aesthetically pleasing hot pot spread, you need the right equipment. There is only one piece of gear we’d say is a must-buy for hot pot. The rest of our recommendations are purely optional, though we’re sharing them here because they’ve made our hot-pot-making lives easier and we imagine they’ll do the same for you.Electric BurnerIf you invest in only one piece of equipment, make it this—the experience of hot pot is all about cooking whatever you want at the table, as you eat. You will typically come across two types of hot pot burners: butane and electric. Sze is team electric. “Electric cooks more evenly, plus you won’t run out of electricity like butane,” Sze says. I love this Cuisinart Cast-Iron Single Burner, which is quick to heat up, pretty powerful, and easy to clean.Cuisinart Cast-Iron Single Burner$60 at AmazonDivided PotThe reason for this is simple: “You can have two broths at once, buddy! It makes life more exciting,” says Sze. Assistant food editor Jessie YuChen, who worked on this story, highly recommends this stainless steel pot. It has a clear lid, so you can easily see when the broths are boiling and ready for ingredients. In a pinch, use whatever short-sided stock pot or Dutch oven you have.Stainless Steel Divided Hot Pot$43 at AmazonWire SkimmerAlong with being just so darn adorable, this nifty tool is great for keeping track of the ingredients you’re cooking. Sze uses it like a fishing net. “You can put your meat or manila clam in the skimmer and take it out once you see it’s at the temp you want it at,” he says. No skimmer? Just use chopsticks.Brass Spider Skimmer and Strainer$9 at AmazonBack to the top.2. Let’s Make Some Broths“Broths are the building blocks of your hot pot,” Sze says. He's shared two recipes—a Mala Beef Broth inspired by Taiwanese beef noodle soup and an Herbal Mushroom Broth—meant to be served side by side in a divided pot for two different but complementary experiences. “You want a spicy broth, verging on too spicy, that you can’t stop eating, and another that is milder and refreshing for a little break,” he explains. “You switch between the two, and that makes your palate dance.” Ideally, you’d make both broths, but you’re still good if you go with just one.Herbal Mushroom Hot Pot BrothUmami-rich and flavorful all on its own, this vegan hot pot base is also a welcome palate cleanser when served alongside a spicy broth.View RecipeMala Beef Hot Pot BrothThis fiery red broth is a labor of love, but it’s worth it—your hot pot spread depends on a rich, flavorful base.View RecipeAll that said, hot pot is what you want it to be, so there is zero judgment if you don’t have the time or energy to make your own broth. These store-bought broth bases come either in powder or sauce form, but either way, you add them to water or stock and bring to a simmer. Here are the ones we reach for in a pinch.Fly By Jing Fire Hot Pot BaseIf nose-clearing, tongue-tingling spice is your thing, this Sichuan-peppercorn-infused broth is for you. “It’s really pepper-centric and you can taste the quality of the red chile peppers,” Sze says.Fire Hot Pot Base$20 at Fly By JingHaidilao Hot Pot Seasoning“It tastes like Chinese medicine, herbal and clean,” Sze explains. Which, for the record, is a high compliment.Haidilao Hot Pot Soup Base$4 at Weee!Little Sheep Mushroom Soup BaseMy personal recommendation, this makes a ridiculously umami-rich broth that’s great with a veg-forward hot pot spread; it imbues Napa cabbage and 'shrooms with a savory-sweet flavor.Little Sheep Hot Pot Soup Base Mushroom Flavor$10 at WalmartBack to the top.3. Now, The Fun Stuff: The SpreadThe key to hot pot lies in the variety of your spread. You want a rich and salty moment to linger on your tastebuds, a fatty and chewy moment for body, a fresh and crunchy moment to reset your palate, and a starchy moment to bring it all together and finish out the meal. The way Sze ensures his hot pot hits all those notes is by following a seemingly strict but actually quite flexible categorization of inclusions: protein, seafood, leafy veg, hardy veg, mushrooms, accessories (more on those later!), and starch.This is a lot of ingredients, so a word of advice: “Pick one ingredient from each category,” Sze says. “Hot pot is a really simple way to just eat whatever the hell you want and tailor it to your needs.” Since all of the ingredients start out raw, you can easily repurpose leftovers into other dishes the next day.Here, he breaks down each category, along with his tips for prepping and cooking.Photograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieProteinMeat does double duty in the hot pot, “since broth takes on [its] flavors,” according to Sze.Beef short ribs: Sze’s cut of choice (it’s pure nostalgia)Prep: Par-freeze to firm up, trim off the silver skin (connective tissue), and cut against the grain in thin slices or cubesCook time: About 15 seconds for slices and up to 30 minutes for cubes, which is good for forgetful eatersPresliced fatty beef: Usually brisket or chuck, which can be found in the refrigerated or freezer section of most Asian supermarketsPrep: Thaw, if frozenCook time: 8 seconds (which is about when this quick-cooking meat hits medium), but up to 1 minute depending on your preference. Cook it the way you like your steakLeg of lamb: A study in textures!Prep: Get the calf muscle (more uniform in terms of fat, connective tissue, and lean parts), ask your butcher to remove the bone, and slice narrowly, like the short rib.Cook time: Around 90 seconds for super tender, more cooked-through meat, though Sze likes his rare (dipped for 15 seconds)Presliced pork belly: Also found in the refrigerated or freezer section of most Asian supermarkets; it should be about a ⅛\" thickPrep: Thaw, if frozenCook time: Since it’s got a lot of fat, it can really languish in the broth (10 minutes!)Photograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieSeafoodBalance—that’s what briny shellfish brings to this hot pot spread. “It cuts through everything,” Sze says.Manila clams: As they open up, they add a distinct saltiness to the brothPrep: Scrub clean and purge in water 30 minutes before cookingCook time: “I babysit them,” Sze admits, putting one clam in at a time and watching until it opens up, from 30 seconds to around 5 minutesShrimp: Because who doesn’t like shrimp?!Prep: Sze goes with tiger shrimp, but feel free to go with your shrimp of choice. Whatever you pick, salt them, set aside for 15 minutes, then rinse. This ensures a slightly bouncy textureCook time: About 1 minute, or until the shrimp are opaque all the way throughPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieLeafy VegHere are a few of Sze’s favorites, which you can find at many Asian grocery stores. But really, he says, “Any vegetable you can think of, you can put in a hot pot.”Napa cabbage: An absolute flavor spongePrep: Pull the leaves from the head and cut vertically into three long slices. “It’s really pretty-looking and also easier to pick up with your chopsticks,” Sze shares.Cook time: 10 minutes, so it’s soft and bursting with brothy flavorChrysanthemum greens: Herbal flavor and fresh texture to fight palate fatiguePrep: Rinse once more! Cook time: No more than 3–4 minutes—you want textural contrastYu choy: A perfect mix of crunchy and squishyPrep: Chop off the roots and cut stalks into thirdsCooking time: 30 seconds for the stalkier portions, to maintain the texture, and a few seconds for the leafier partsHardy VegThink of these ingredients as the buried treasure of the hot pot spread. “They hold up really well in the broth, so it’s like a treat for yourself in the future,” Sze says.Mountain yam: For a juicy, sandy texture similar to a Korean pearPrep: Peel and cut into 3\" sticks, like a steak fry.Cook time: No more than 3 minutes.Taro: Creamy!Prep: Peel and cut into ½\" slices or big 1 ½\" chunks. Whichever route you go, be sure to soak the taro in water for 5 minutes to wash off excess starch, which can thicken the broths.Cook time: About 1 minute for the slices or 10 minutes for the chunks for a tender biteLotus root: For a much-needed burst of crunchPrep: Peel and cut into ½\"-thick roundsCook time: 5–10 minutesCeltuce: One of Sze’s all-time favorite vegetablesPrep: Peel off the tough fibrous skin, then either cut into chunks or slice into wafer-thin roundsCook time: 5 minutes for the chunks, which will become tender, or 5 seconds for the rounds to keep them crisp and still sweetKabocha squash: Winter’s finestPrep: Cut into thick wedges and keep the skin on—it's edible and keeps the squash intact while it's cookingCook time: About 10 minutes, until it's velvety but not falling apartPotato: Russets, for solid structure that won’t dissolve in the brothPrep: Slice into thin rounds, which will cook fast and won’t add too much starch to the brothCook time: 10–15 secondsPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieMushroomsA variety of textures and flavors is the name of the hot pot game, and that is why these funghi are crucial to Sze’s hot pot spread. “They have a very grassy flavor and bring a chewy, meaty moment,” he says. They’re also a great meat sub, so vegetarians, load up.Enoki and beech mushrooms: Bundles of bouncy joyPrep: Chop off the roots and pull apart into smaller clumpsCook time: 10 minutes or soShiitake: Like meat, fresh shiitake impart umami into the broth as they cookPrep: Pop them in whole, for vanity. “It just looks better,” Sze saysCook time: At least 10 minutes to cook them through, but as long as 30 minutes if you want to season the brothKing oyster: “The most meat-like sub for when you’re greased out from the meat, or if you’re vegetarian,” Sze declaresPrep: Cut into 1\" chunks or ¼\" slices.Cook time: About 6 minutes for chunks or 2–3 minutes for the slicesPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieAccessoriesHands down, the best-named category of this hot pot ingredient spread. “I call them accessories because I don’t think they’re absolutely necessary, but if you can get them, they just make the hot pot better,” says Sze.Fried bean curd rolls: Think of these as Fruit Roll-Ups but toasty and soybean-yPrep: You're off the hook for this oneCook time: 5 seconds, or “as long as it takes to unravel,” Sze says. “One side of it is soft and tender, the other is crunchy.”Fish tofu: “It’s squishy but also snappy, since it’s fish paste that’s been whipped with a ton of air and then fried,” Sze says. “It tastes like junk food.”Prep: Look for these golden-yellow squares in the frozen section of any Asian supermarket.Cook time: 3 minutes or soFish balls: Made in a similar fashion as beef balls, these chewy orbs are often fried (check out the golden ones) or filled with roe (the Smurfs’ hat-shaped one!)Prep: Head to the frozen section of your go-to Asian groceryCooking time: 3–5 minutes, or until the fish ball floats (this indicates they're cooked through)Beef ball: “How it’s made is pretty poetic,” Sze muses. “Cuts of beef that would normally be disposed of are pounded until the fibers break down and moisture is released. This turns it into a paste, which is shaped into balls. It’s bouncy, meaty, and so fun to eat.”Prep: Pick up any frozen ones that catch your eye at Asian supermarketsCook time: They’re pre-cooked, so they just need to be warmed through in the broth, about 3 minutesFrozen tofu: Freezing it forces the water in the tofu to expand. Once it thaws, those crystals turn back to water and are drained, but the tofu retains that expanded structure. “The tofu takes on an extra spongy texture, which sucks up more broth,” Sze explainsPrep: Take whatever tofu you want—silken, medium, hard—cut it into blocks and freeze it fully, then thaw it, and freeze it for another day before serving it at hot potCook time: 10 minutesEgg dumpling: Another nostalgic pick for Sze, and one that adds a pop of color to the spreadPrep: Found in the frozen dumpling aisle of most Asian supermarkets. Look for Sze’s favorite brand, Laurel.Cook time: 5 minutesPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieStarchYou’re already eating a ton of food, “so why not add a bowl of vermicelli?” Sze jokes. “It’s a cultural thing, to round out your meal.” But it’s also the best way to fully enjoy the hot pot broths, since noodles will pick up the flavor that’s been building all dinner long.Instant ramen: For the people with a well-stocked pantryPrep: Use the noodles; save the flavor packets for something else.Cook time: As little or as long as you’d like, since the noodles have already been fried. “You can throw them in and boil to oblivion and they won’t overcook,” Sze says.Rice: To make congee, so you don’t waste a bit of that precious brothPrep: Remove any lingering hot pot ingredients from the broth before adding in leftover cooked riceCook time: 10 minutes, stirring often so the congee doesn’t burnGlass noodles: This is Sze’s go-to starch: “They’re not too heavy, they soak up the flavor best among other noodles, and they cook really fast”Prep: Buy the mung bean version; compared to other noodles they have less starch, which can burn at the bottom of the potCook time: Follow package instructionsBack to the top.Photograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole Louie4. You’re Prepped and Ready—Now Here’s How to Do ItYou’ve made it. Welcome to heaven’s gate, the magical moment before your hot pot extravaganza begins. You’ve got some amazing tasting (and smelling) broths about to reach a boil at the table, surrounded by plates and bowls of all the ingredients you’re in the mood for. Now, it’s time to cook—here’s how:Bring the broths to a boil. Then take it down to a simmer and you’re ready to dunk.Start by adding whatever takes the longest to cook (hardy veg, mushrooms) or will impart more flavor (like meats, which will make a meat broth even meatier). A word to the wise: Be prepared when adding flavor sponges (tofu, Napa cabbage) to spicy broths because they absorb heat and can become overwhelming to eat.Then it’s a free for all. You’ve got all the intel on how long everything should hang out in the broth, so cook whatever you want at whatever pace. Some hot pot enthusiasts might disagree with this approach, proposing that you start with meat, then veg, then starches, but Sze believes that “the whole point of hot pot is to experience different flavors and textures throughout your meal, and to have strict rules defeats the purpose.” Instead, he pays close attention to each item added in order to ensure perfect cooking.And remember: Feed your friends. “There is absolute accountability and responsibility at the hot pot table,” Sze explains. If you see the short ribs hit the perfect temp or the taro about to reach its crumbling point, scoop it up and drop it off at a dining companion’s bowl. “This kind of etiquette is part of the communal experience of eating hot pot.”Back to the top.5. But What About the Condiments?Sze believes the broth is the only flavoring agent you need, but for some folks, condiments are essential to the meal. Many hot pot restaurants have a salad bar-esque set-up (I create a similar buffet at home!), where you can build your own bowl of chopped aromatics (scallions, garlic, cilantro), sauces (soy, peanut, sesame), vinegar, oils, and seasonings (sacha, chile flakes) to stir together and plunge your broth-cooked ingredients into before eating. So if you live to dip and drizzle, here are a few to try:Black VinegarFor a much-needed hit of acid, Sze likes this inky vinegar. He opts for Eastlake Shanxi (more savory) or Fly By Jing (slightly sweeter).Eastlake Shanxi Black Vinegar$7 at Coco Island MartSacha SauceAlso known as barbecue sauce, this aromatic seafood paste is a staple in barbecue as well as soup. Sze’s go-to brand is Bull Head from Taiwan.Bull Head Sacha BBQ Sauce$12 at Umami CartSesame PasteSze likes to thin it out with soy sauce, black vinegar, and water for a dipping sauce with a balanced bite. Wang Zhihe is a fave, but tahini works in a pinch. Wang Zhihe Pure Sesame Paste$14 at AmazonScallions, Cilantro, and GarlicMince these bad boys and sprinkle them into whatever condiments you’re using to add brightness. “Scallion and cilantro provide freshness and counteract the fats in the meat and sesame paste, while garlic can punch through the heavier flavors,” Sze says.A Final Word From the Hot Pot Nerds: “Be adventurous,” Sze says. “If you live in Germany, put in some sausages. If it’s springtime, add fiddlehead ferns. This spread reflects my preference for hot pot; it’s not the universally accepted way to do it. Whatever you like, try it. Hot pot is a blank canvas, and you can go in so many different directions.” In other words, you got this.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-19", "author": ["Condé Nast", "Elyse Inamine"]}