{"id": "1cdcf48fa1dae58644a93e4bf9a32e93", "url": "https://www.bonappetit.com/story/a-dozen-cousins-beans", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "I’m Always Ready to Eat A Dozen Cousins Ready-to-Eat Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Always Ready to Eat These Ready-to-Eat BeansA Dozen Cousins makes beans you can feel good about buying, eating, and praising!By Sarah JampelJuly 21, 2020FacebookTwitterEmailPhoto courtesy A Dozen Cousins FacebookTwitterEmailThis is Highly Recommend, a column dedicated to what we‘re obsessed with eating, drinking, and buying right now.Confession, reader: Canned beans aren’t quite as convenient as I’ve made them out to be. They’ll get to the dinner table faster than dried, but open up the can, rinse off those bad bean boys (or not), and you’ve still got a product that needs some help: A few minutes to marinate in oil and vinegar. A dance through hot oil fragrant with garlic and spices, a handful of greens and a glug of wine. Mayonnaise.  And that’s where A Dozen Cousins comes in. This line of ready-to-eat beans, which come in bags rather than cans, are actually ready to eat. Warm them up in the microwave or on the stove and...that’s it. Because they’re already seasoned and spiced, bolstered by real vegetables, like garlic, onions, and peppers, and avocado oil, you don’t have to dig through the pantry or break out the cutting board. They’re delicious on their own. They’ve been there for me when I’ve been near-stupefied with exhaustion. I’ve had the Mexican Cowboy Beans tucked in tortillas, the Cuban Black Beans with leftover rice, and my personal fave, the Trini Chickpea Curry, with roti from the freezer and sautéed greens.The beans are the brainchild of Ibraheem Basir, who worked at a number of national food brands before launching his own. He loved the ethos of the natural food space, with its emphasis on health, but noticed that there weren’t many (or any) products that channeled the food he grew up eating in the Fort Greene and Clinton Hill neighborhoods of Brooklyn, with flavors from the West African, Caribbean, Latin American, and African American communities. And most were devoid of the feelings of comfort and love that those foods of his childhood provided. He saw an opportunity to merge health, comfort, and culture in beans: While the Bean Biz is worth nearly three billion dollars, Basir told me, the products don’t reflect the ingredients’ culinary significance or range. In most stores, the selection of ready-to-eat beans is limited—either refried or baked. A Dozen Cousins, on the other hand, expands the scope, drawing inspiration from the American South, Latin America, and the Caribbean.And, in a time when some big bean brands are hard to stomach (I’ll leave it at that, thankyouverymuch), I can feel good about buying A Dozen Cousins, which provides an annual grant to a different non-profit working to counter the socio-economic health disparities that disproportionately affect Black and brown communities. In 2019, the recipient was Austin-based organization The Happy Kitchen/La Cucina Alegre (the 2020 recipient hasn’t been announced yet!). Basir started this fund as a way to provide support to individuals, families, and communities who wouldn’t necessarily have the means to buy his products. “In an ideal world,” says Basir, “your health wouldn’t be tied to your socio-economic status at all.”There’s a lot of work that needs to happen before we can get to that point—and these beans will fuel it.Buy it: A Dozen Cousins Cuban Black Beans, Trini Chickpea Curry, Mexican Cowboy Beans, $20 at WalmartAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingBlack BeansRead MoreCoronavirus7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstBy Caroline LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-21", "author": ["Condé Nast", "Sarah Jampel"]}