{"id": "1cec02cea5a4eb498e3ab6f65548498f", "url": "https://www.bonappetit.com/story/how-to-make-a-martini", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "How To Make a Martini | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Speak Fluent MartiniLearn how to make, order, and enjoy the cocktail-iest cocktail of all.By Al CullitonSeptember 19, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.We’re going to do something very important here. We’re going to help you and your pals figure out exactly how you like your martini. For those of you who already have your preferences, this will just be a chance to drink a martini. But for those of you who haven’t yet developed a preference (or feel intimidated by the whole martini mystique), consider this your chance to figure out what the hell a martini is and how you take yours.Yes, you have a martini. You just don’t know it yet.The cocktail we now know as the martini has a muddy origin story; its name has changed over the years, as have its contents (sometimes including sweet vermouth, absinthe, and/or various bitters). But by the early 20th century, what we now refer to as the martini was codified as a mix of London Dry gin and dry vermouth, garnished with an olive or a lemon twist. Since then it has permeated American culture and become an unrivaled symbol of sophistication. While its most notable proponent is, of course, James Bond and his famously fussy order in Ian Fleming’s Casino Royale, the drink goes beyond associations with those who have loved it dearly. In its famous conical glass, the martini is a visual currency the world over, on millions of menus and neon signs. In many ways the martini is the cocktail.Today we’re going to make a few different versions so you can determine exactly what to say when you’re at a steak house with great aunt Mary who has just deftly ordered one for herself. This isn’t about showing her up. It’s about getting comfortable with this unparalleled icon of American cocktail culture.Your Shopping List:1 bottle London dry gin1 bottle good-quality vodka (I still favor European brands)1 bottle dry vermouth (Dolin is my choice)1 bottle orange bitters1 jar Spanish Queen olives2 lemonsCocktail picks (I like bamboo swords)Plenty of iceSome advice: Put some martini glasses or coupes in your freezer before you start mixing. Very cold glasses are best here.And a word on garnishes: There are two main garnish camps in the martini world, a lemon twist or an olive. Both are great and right and true! In the recipes below I list my personal garnish of choice for each drink, but you should feel free to experiment with what you like. The lemon has the effect of brightening up the drink and bringing out the botanical notes in both the gin and the vermouth. The olive, on the other hand, is iconic and has the effect of giving the drink a savory tinge. I prefer the almost cartoonish Spanish Queen olives, which are stuffed with little pimiento peppers, to the fancy ones from the antipasti bar. Call me crazy! And please, pick up some proper cocktail picks. An olive (or three) on a toothpick that sinks to the bottom of your glass is just sad.1. The Dry MartiniPhoto by Chelsie CraigThe word dry sure does pop up a lot when it comes to martinis. First you’ve got your London dry gin and then you have dry vermouth. But most confusing of all? Dry martinis. In this case, the word dry refers to how much or how little vermouth is desired in the cocktail. Drier martinis contain less vermouth. We are going to start our journey with a classic dry martini, one employing a 3:1 ratio of gin to vermouth. A fitting cocktail to begin a great evening of dining out.How to Make It:Before we start, martinis are one of those all-spirit-no-juice cocktails, so they should be stirred! (See The vodka martini, below, for the shaken kind.)Pour 2¼ oz. gin and ¾ oz. vermouth into your mixing glass.Fill with ice about three-quarters of the way up and stir for 20 seconds. The outside of the mixing glass should get nice and frosty.Grab one of your chilled glasses from the freezer.Strain your drink into the glass and garnish with a single olive on a pick. (And, by the way, to make it extra dry, rinse the chilled glass with vermouth and toss it out. Do as above, but with a ¼ oz. more gin and no additional vermouth.)Now have everyone try it! If you thought it was a bit heavy on the gin, you might like to try…2. The 50/50Photo by Chelsie CraigSome would say that this 1:1 ratio martini is a different animal altogether. But I think it has its place here; not only is it historically important, but it’s also had a resurgence in modern bars. It’s relaxed and effortless, a delightful aperitif.How to Make It:Pour 1½ oz. gin, 1½ oz. vermouth, and 2 dashes orange bitters into your mixing glass.Add ice and stir for 20 seconds. Strain into a chilled cocktail glass.Using a vegetable peeler, cut a nice wide piece of lemon peel. Take the peel in both hands, yellow side facing down over the drink. Pinch it down the length using thumbs and fore- and middle fingers of both hands (like pincers) so that the oils from the peel spritz the top of the cocktail.Drag the yellow side of the peel around the rim of the glass, twist it into a nice shape, toss it in the glass and serve.Time to sip this one. Nice, right? If you’re not into gin for your martini, you’ll probably prefer…3. The Vodka MartiniPhoto by Chelsie CraigWhen gin was all the rage in England and, later, the U.S., vodka was the preferred spirit of faraway lands. But since the end of World War II, the colorless, odorless, tasteless wonder has overtaken American drinking culture and, as a matter of course, has come to be a very common base spirit for the martini. Though it’s not the most flavorful, it’s still a very refreshing drink when properly diluted and chilled.How to Make It:You can make this as dry as you desire, but for the sake of comparison, let’s use the same proportions as in our classic dry martini above.Pour 2¼ oz. vodka and ¾ oz. vermouth into a cocktail shaker.Fill the shaker with ice and seal. Shake hard for 15 seconds. Yeah, you’re shaking this one. Trust me.I think the only appropriate garnish is three olives on a pick.Now give it a try. Far less bracing than the dry and less herbaceous than the 50/50, no? By now you’ve chosen between dry, 50/50, and vodka, but there’s still that last question: What about dirty martinis?4. The Dirty MartiniA martini becomes a dirty martini when olive brine (you know, the juice in the olive jar) is added to the cocktail. Any of the above recipes can be made dirty, but I’d say dry and vodka martinis are the best candidates to start down the dirty road.How to Make It:Prepare your martini to one of the ratios described above, but before stirring or shaking, add olive brine. You can start with a few drops, but most lovers of this version would start at about a ½ teaspoon brine and work up. Call me conservative, but I like to cap it at ¼ oz. There are, after all, other flavors worth tasting here. Garnish with 1 or 3 olives. (Two just doesn’t seem the thing, does it?)So now you know what’s in a martini. You can go to that steak dinner with your older relatives and rattle off your martini order like never before. And, more importantly, you can finally say that you truly know yourself! No meditation apps necessary.Or maybe you're in the mood for something a bit less boozy?3 Sherry and Vermouth Cocktails That Are Low-ABV and Downright DeliciousProving you don’t need hard liquor to make cocktails.View StoryAl Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlHappy Hour with AlCocktailMartiniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Al Culliton"]}