{"id": "1cecf75943a685b851c029a6a85a2846", "url": "https://www.bonappetit.com/story/wellness-beers", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Drinking Beer for \"Health\" Is a Thing Now —Here’s What You Need to Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle“Wellness Beers” Are a Thing Now—Here’s What You Need to KnowBeers with names like Race Pace and Long Run are hoping to edge out Gatorade. But do they work?By Annie DalyMarch 1, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailI come from a big family of craft beer nerds. For us, time together is basically synonymous with IPAs, whether we’re checking out new breweries or taking long walks on the beach with our “coffee cups” in hand. We even call brews by their ABV count rather than their actual names. “Oof, had a bunch of 8s last night,” my dad will text me after a particularly big night out. “Rough morning over here.”For better or for worse, this particular brand of post-IPA commiseration has become a staple in our lives. And that’s why, when I first heard about “wellness beers,” sometimes referred to as “recovery beers,” I dismissed them as an oxymoron. Everyone knows that beer can’t help you recover, I thought. Beer is something you need to recover from!Recovery beers, which are brewed with sea salts, electrolytes, and other ingredients to help you refuel, first gained popularity among the hardcore athlete set. It’s no secret that endurance athletes have always looked forward to celebrating with a delicious beer at the finish line — but as craft beers have gotten stronger and stronger, many such athletes have found that the whole “will run for beer” thing takes too big a toll on their tired bodies. That’s why Caitlin Landesberg, the founder and CEO of Sufferfest Beer Company, one of the top wellness beer breweries on the scene, set out to create “the Gatorade of beers” in 2016. “It’s so ingrained in our community to finish a workout with a commemorative pint, so I thought, ‘If I’m going to have one at the end of the race, I may as well have one that’s delicious and complements my needs as an athlete,’” she told me.Her intuition was right on point. Sufferfest now produces five kinds of wellness beer, all of which are free of gluten, and the newest of which—the FKT (“Fastest Known Time”) Pale Ale—even has as much electrolyte-replenishing salt as a common sports drink.The brand has gathered a loyal following, including folks like professional skier Cody Townsend. “I love Sufferfest because they have a microbrewery philosophy, yet they produce a lighter beer with recovery benefits, so you don’t have to choose between a heady IPA or a Budweiser at the end of a long day on the slopes,” he explains. “Sufferfest still amplifies the stoke from the day without going against what I was just in the mountains for.”And Townsend is clearly not the only one paying attention: Sufferfest was recently acquired by Sierra Nevada.Other breweries are on the trend too. Boston-based Zelus Beer Company, launched in 2015, produces six different recovery beers in different styles, with names like Race Pace and Long Run; Harpoon Brewery just released a recovery beer called Rec League, and Avery Brewing Co. in Colorado sells a brew called Go Play IPA. And there may be many more recovery beers in our future. “Conventional craft beer sales have been pretty stagnant over the past couple years, which has forced distributors to modernize and think hard about today’s consumer. We believe that functional beer is where craft beer is going,” says Landesberg.Turns out, I’m not mad about that. Rec League, which is my favorite of all of them, is only 3.8 ABV and is brewed with Mediterranean sea salt and chia seeds — but to me, it just tastes like a lighter IPA; I can’t even pick up the salt undertones. And that’s the thing: Although these beers are loaded with salt and electrolytes and other very un-beer-sounding ingredients (one Sufferfest beer is even brewed with bee pollen!), for the most part they just taste like beer. And while most of these breweries have strong ties to the athletic community, sponsoring local races and run clubs, there is also a developing fan base made up of people like me who simply want a delicious craft beer that won’t get them tanked after, like, three sips.“When we debuted Rec League back at a five-mile race we sponsored in May, there were definitely runners who appreciated having something that could help them replenish the things they lost in the run. But now, for other folks, the craft flavor is more than enough,” confirms Chris Bonacci, Vice President of Marketing at Harpoon. Geoff Pedder, the founder of Zelus, has reached a similar conclusion: “We do really well in pizzerias like TGI Fridays and Pizzeria Uno,” he told me. “The craft beer market has gone so high in alcohol that our lower ABV volume is a big selling point, regardless of the recovery aspect,” he says.Sports nutritionists are still skeptical about using recovery beers as anything more than a drink to go with your pizza. But if you’re going to toast after a race, going with a recovery beer as opposed to a regular one is certainly a better choice, says sports nutrition and fitness expert Edwina Clark, MS, RD, APD, CSSD.“Low ABV beer with additional carbs and electrolytes is a better option than standard beer post-race, but it’s not a replacement for real food, sports drinks, and water,” she cautions. “It’s true that beer contributes to post-workout carb needs, but the carb contribution is still fairly low. People generally need somewhere between 30 and 90 grams of carbs immediately after exercise, and recovery beers provide around 5 and 12 grams,” she continues. And the benefits are often negated by the impact of alcohol anyway, Clark says—so make sure you refuel and rehydrate first to mitigate the effect.Or, you know, you can just skip the marathoning and go straight to the surprisingly delicious, wellness-forward drinking part. That’s what I did last night, and I’ll be texting my dad today: “Had a bunch of 3s yesterday. Feeling amazing.”Explore Bon AppétitHealthyishBeerTrendsRead MoreshoppingA Marathon Runner Reviewed 5 Sports Drinks and Only 1 PrevailedGallery5 SlidesBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Annie Daly"]}