{"id": "1cf11d30cc168573c36536f1748c4b52", "url": "https://www.bonappetit.com/story/francese-soggy-meat-delicious-sauce", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Francese Is the All-Time Best Soggy Meat Soaked in Delicious Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFrancese Is the All-Time Best Soggy Meat Soaked in Delicious SauceBut how could I convince my Italian brother-in-law of this indisputable fact?By Tyler KordApril 16, 2019FacebookTwitterEmailPhoto by Cole WilsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.You know how really good Buffalo chicken wings are still super crispy, despite being drenched in buttery sauce? Well, what if I told you that there was a way to bread chicken, or any kind of meat, that would absolutely not hold up against being soaked in sauce, and would in fact absorb the sauce and become a kind of soggy, bloated layer of wet breading? If you are the kind of person who bemoans a soggy sandwich or just generally can’t stand the word “moist,” then you may stop reading this now because our relationship was tenuous to begin with and the internet tells me that I don’t need to waste emotional energy on toxic friends, and the rest of us will talk about one of my all-time favorite dishes/soggy meats soaked in delicious sauce: the Italian-American classic, Francese.Actually, first let’s talk about my brother-in-law for just a second. Luca is from Castelrosso, a tiny village near Chivasso, a tiny town near Turin, a city where they make dope gelato and where Jesus’ last used towel is kept. Luca is a great dude who is married to my sister, and I don’t think I have ever spent any time with him without my family around. The night before he and my sister, Emily, were married, the whole village got together and cooked a giant feast during which I consumed a great deal of Birra Moretti, approximately 100 tiny sandwiches filled with tiny fish and parsley, and a whole lot of some kind of meat (I’m guessing veal?) pounded out, breaded, and soaked in vinegar—a dish called bistecca in carpione. About 10 years later, I am still thinking about it. Also I found out the day of the wedding that I was the best man, and when my mom said, “Tyler, they asked you months ago,” that’s when I realized that they must have asked me months ago. So I still owe Luca a bachelor party from a decade ago.The scene at Frost, a Williamsburg restaurant that’s been around since 1959.\nPhoto by Cole WilsonWhy are we talking about Luca? Oh, right! Luca doesn’t like Italian-American food very much. And he’s never had Francese sauce! Have you ever had Francese sauce? Basically, you take a chicken breast or chunk of veal, pound it thin, dredge it in flour and then in raw egg (but you very specifically do not put it back in the flour because we are going for soggy crust, remember?), and then you sauté the meat and add garlic, white wine, a lot of butter, and a lot of lemon juice, and you finish cooking the meat in that sauce, and oh my god I just ate my computer. At Cataldo’s in Brooklyn, the Italian restaurant nearest my house, chicken Francese is served on a plate with a pile of spaghetti tossed in the Francese sauce itself, and it is heaven. At Randazzo’s Clam Bar in Sheepshead Bay, a flaky white fish filet is used in place of the meat, and I know it’s hyperbole to say that it lands right behind The Reformation as one of the most important moments in World History, but, well, here we are. It tastes absolutely nothing like bistecca in carpione, but something about the breading, sogginess, and acidity brings me right back to Emily and Luca’s wedding.There’s more to Frost than Francese (but don't skip the veal Francese).\nPhoto by Cole WilsonI wanted to see if Francese is really so good that even my stubbornly Northern Italian brother-in-law could get into it. So I took an Italian to an Italian restaurant to try to get him to like Italian food, and I realize that that seems stupid, but if you have ever met a Northern Italian, they are perhaps the least into Italian-American food of all of the people on earth. Luca’s parents literally bring food when they come to visit New York City. So I took Luca and my nephew Matteo to Frost, a Williamsburg Italian restaurant that opened in 1959, to try the veal Francese (Note: It appears on the menu as “veal scaloppine French style.”), and it was predictably magnificent. We also had some of the best stuffed clams I have ever eaten, a giant platter of shrimp parmigiana, and we each had a side of spaghetti with tomato sauce. It was like a pre-wedding feast of over-sauced dishes, which is decidedly not a problem since Frost supplies ample amounts of bread for dipping and scooping and living life to its fullest. My nephew said that his spaghetti was “awesome,” and Luca said that he liked his food!!Luca’s very polite, and I didn’t totally believe him, so afterward I texted my sister, who pointed out that Italians do not like cheese and fish together (which is ludicrous) and thus the shrimp parmigiana was a little horrifying, and that the very notion of a side of spaghetti is a little silly (I don’t see what’s funny about that at all). But he did, in fact, kind of like the Francese. “He’s more open-minded than his parents, but it’s still hard for him. ;)” my sister texted, without even hinting at an imminent divorce. Just kidding, and I’m sorry about the best man thing, Luca!Tyler Kord is the chef-owner of No. 7 and No. 7 Sub in New York and the author of A Super Upsetting Cookbook About Sandwiches.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Tyler Kord"]}