{"id": "1cfa314f2218f8c5300df54959abd351", "url": "https://www.bonappetit.com/story/difference-between-light-and-dark-roast-coffee", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "What's the Difference Between Light and Dark Roast Coffee? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat's the Difference Between Light and Dark Roast Coffee?They taste really different. Best to know what you're into before you go any further.By Alex DelanyFebruary 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailHave you ever noticed how some coffee tastes different than others? Some taste bright and fruity. Others taste deep and dark. Some taste like toasted graham crackers or dark chocolate-covered raisins or green tea. When it comes to drinking a cup of coffee, there’s a ton of stuff to unpack.But the reason some coffee beans taste more intense than others isn’t necessarily about the origin or the climate or how the beans are processed (although those factors certainly do play a part). The most pronounced flavor of the coffee is usually determined by how intensely the beans were roasted. Light and dark roasts are the first indicator as to what your coffee is going to taste like. So what’s the difference between dark and light roasts, anyway?Let’s start with a light roast. Light roasted coffee sees less heat than a dark roast. Heating coffee beans is like cooking any other ingredient: You’re essentially forcing water and moisture out of the bean by evaporation. Since light roasted beans aren’t left on the roasting machine for as long as dark roasted beans, they’re left with more moisture inside the bean, making it denser.A denser coffee bean will give you more caffeine, more brightness (also referred to as “acid,” but not actually chemically acidic), and more fruit-forward, herbal flavors. There will be more going on in terms of complexity in a light roast coffee. But the body will actually be thinner than that of a dark roast, and will almost drink more like a strong black tea. And yes, the caffeine thing: If a serious coffee buzz is what you’re after, light roast is definitely the move.Dark roast coffee beans stay on the roasting machine for a longer time or at a higher temperature. This means the beans will lose more moisture, making them less dense, less caffeinated, and more single-note in flavor. The complexities that light roast coffee start to disappear the longer you leave the beans on the roasting machine.Whether they're dark or light, you best buy your beans whole.\nPhoto by Chelsie CraigIf you like coffee that tastes like toasted nuts, caramel, and graham crackers, these are the coffee beans for you. Dark roast coffees taste how you think coffee tastes, reminiscent of an old-school diner cup, or what your parents make in the drip machine at home. And since the beans are roasted long enough to develop their oils and bring them to the surface, the body of your coffee will be thicker.If you want to give your friends the crash course, you could paraphrase this whole thing by saying that light roast coffees have a thinner body and more delicate flavors. And dark roast coffees are more full-bodied with bolder, more straight-forward flavors. But that’s no fun. The best way to really understand the ins and outs of both light and dark roast is to take the time to brew a pot of each and figure out what you like more. But don’t think you have to pick a side. You can have your beans and drink them too.But before you buy dark or light roast, you better know what to look for:Everything You Need to Know to Buy the Best Coffee BeansWhole or ground? New or old? Here or there? We break it all down.View StoryExplore Bon AppétitBasicallyCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-05", "author": ["Condé Nast", "Alex Delany"]}