{"id": "1d17a639b8b861c756ea30c2d98b266e", "url": "https://www.bonappetit.com/recipe/curry-cucumber-dip-with-fried-shallots", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Curry-Cucumber Dip with Fried Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCurry-Cucumber Dip with Fried ShallotsBy Lauren SchaeferApril 5, 20183.1(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis addictive yogurt-based dip is like tzatziki dressed up for a party. Those fried shallots—which are available at Asian supermarkets—put it over the top, but regular ol' jarred fried onions will work great too.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMicroplane$16 At AmazonSmall Bowl$13 At AmazonSpoon$24.69 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings1garlic clove¾cup plain whole milk yogurt (not Greek)1Tbsp. garam masala1tsp. kosher salt1Persian cucumber½cup pomegranate seeds (a.k.a. \"arils\")½cup store-bought fried shallots or onions17-oz. bag pita chipsPreparationStep 1Using a microplane, finely grate 1 garlic clove into a small bowl.Step 2Add ¾ cup yogurt, 1 Tbsp. garam masala, and 1 tsp. salt and stir with a spoon to combine.Step 3Finely chop 1 cucumber and gently stir into yogurt.→  These are our favorite grocery store cucumbers.Step 4Top cucumber yogurt with ½ cup pomegranate seeds and ½ cup fried shallots. Serve with pita chips alongside.How would you rate Curry-Cucumber Dip with Fried Shallots?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMine came out strangely watery, way over spiced and too salty. I ended up not serving it to my quarantine pod and instead just brought a bottle of wine.Anonymous9/26/2020It was great! I had no issues finding the ingredients, and I found there was just enough spice in the recipe. Make sure to taste your Garam Masala, since it can vary by brand.AnonymousColumbia, SC1/11/2020@Audrey Bock, or anyone who can't find an ingredient: Type into your search engine\nwhat can i use in place of pomegranate seeds\nand you'll get at least a few hits (some will be more useful than others).\nIn this case. a site called gourmetsleuth had some ideas (I didn't insert the link bc I don't know whether this site allows them). Good luck.D WUSA12/12/2019The recipe calls for too much garam masala. I think it should have been only 1 teaspoon as opposed to 1 tablespoon.AnonymousHouston, TX11/24/2019Calls for too much salt/garam masala.  Next time I'm gonna cut back on those two and beef up the cucumber dosage and I think its gonna be pretty good then.foodoUSA11/9/2018Easy to make, refreshing and a crowd pleaser. However, I couldn't find pomegranate seeds, had to go without - any recommendations on substitutions for next time?Audrey BockNYC7/4/2018Explore Bon AppétitDipCucumberVegetableShallotYogurtOther IngredientsEasyQuickStarterSnackNut-FreeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-05", "author": ["Condé Nast", "Lauren Schaefer"]}