{"id": "1d21a3ccaa8b132cb5e776c15fd33cdf", "url": "https://www.bonappetit.com/story/ingredient-swaps", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "How to Make Do With Some Smart Ingredient Swaps | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingHow to Make Do With Some Smart SwapsWhen the getting isn’t good, your dinner can still be great.By Carla Lalli MusicApril 16, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.One thing I’ve learned from a month in self-imposed quarantine is that this is no time to be a stickler. If you have a favorite anything, prepare for it to not be there for you right now. This applies as much to your protein of choice (I’m talking to you, non-existent whole chickens) as it does to sunny Saturday activities (remember meeting up with friends?). The combination of cooking more and trying to shop less, along with unpredictable inventory when we do venture out for ingredients, means the home cook is encountering curve balls almost constantly. When supplies are uneven and the home pantry starts to get a little thin in spots, we need to be malleable. Creatively and emotionally, I’ve found! Here's how to get what you get and not get upset.Any grain (or a mix of grains!) goes well in this herby buttermilk side.\nPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioGrains are grains are grainsYou know what I can’t get right now? Sushi rice (a.k.a. short grain white rice). Everybody wants some. You know what I have no trouble finding: Every other kind of rice. I have basmati, I have Bhutanese red rice, and I have long grain brown. Of course they vary in taste and texture, and yes their cook times vary, but they’re all rice, and they’re all right. My point being, if you’re serving rice as a side dish, don’t get too attached to which variety is in stock. Generally speaking, long grain rice tends to be fluffier when cooked, and short grain rice is chewier and naturally stickier, so if you have a choice, substitute long for long and short for short. But don’t stress it too much. Remember, the world of rice extends seamlessly into the wider world of whole grains, so when I run out of farro I’ll put brown rice into my soups, and when the rice runs low, I’ll turn to a grain like barley to pinch hit.A broccoli Caesar no one can resist.\nIt’s a cabbage world, and I’m a cabbage girlI am super tight with the cruciferous family—some of my best friends are brassicas! I’m talking about everything from kale to broccoli rabe, Savoy cabbage to brussels sprouts, cauliflower to broccolini. Even though they don’t look it, all of these vegetables are in the cabbage family, and they are some of the best produce to keep in stock, since they have a long shelf life when refrigerated, are very high in fiber, vitamin C, and antioxidants, and they can be utilized in raw, quickly cooked, and long-cooked preparations. They’re also highly substitutable. If you’re making a slaw, you can use ribbons of Tuscan kale, thinly sliced green, red, Savoy, or Napa cabbage, or put a pint of brussels through the slicer attachment of your food processor. You can even use regular old broccoli in salads, like this Caesar-ish take that my kids love. You can sauté any and all of these things with garlic and oil, or cook them grandma style if you prefer something soft and braised. All of them are delicious tossed through pasta and topped with parm and chile flakes. Try making this classic pasta with sausage and broccoli with cauliflower and kielbasa, or with diced green cabbage and andouille. I’m sure it would be incredible! True team players, those cabbage types.Want this letter before it hits the website? Sign up for our newsletter!Spices you may—or may not!—have in your cabinet right now...\nPhoto by Gentl and Hyers, Food Styling by Susie Theodorou, Prop Styling by Nina LalliSpices—not so special after allHere’s a list of all essential spices:SaltHere’s a list of all optional spices:Literally every other spiceI know, I knoooowwww, I’m oversimplifying this. Obviously! But seriously, a half teaspoon of any spice is not going to make or break any dish. (Unless, of course, it’s defined by it. Cacio e pepe isn’t itself without black pepper, and paprikash is a sad affair without Hungarian paprika.) In most cases, the spice is there to enhance or accessorize, so if you don’t have what’s called for in a recipe you have two choices: Simply omit it—just make sure you’ve seasoned well with salt and it will be fine. Or, substitute a different one from your cabinet. Rather than give you hard and fast rules about how much of one is equivalent to a quantity of another, my advice is to start with a pinch, taste, and work your way up as needed.Spicy: Crushed red pepper flakes, cayenne, gochugaru, Aleppo are on all the dried spicy pepper continuum.Warming: Warm earthy spices like cinnamon, allspice, star anise, anise seed, and nutmeg play well together or in place of one another. Blends like chili powder and garam masala can also be deployed.Vibrant: Zippy spices like coriander, cumin, fennel, mustard seed, sumac, and cardamom will bring a certain bright, citrusy, high-register flavor to the recipe you use them in, so feel free to substitute when one is called for but you have another.Dead-simple Chinese broccoli with soy paste.\nPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaFree to be you and greensLike brassicas, leafy greens are very valuable body doubles, and can be used in raw, lightly cooked, and long-cooked preparations. I would divide them into two categories: tender and sturdy, and within those groups, treat all variants equally.Tender: Baby or mature spinach, Swiss chard, arugula, most salad greens (ie, Boston, green- and red-leaf lettuce, romaine, Iceberg). Obviously you can use these to make salads or tuck into sandwiches, but they’re also tasty if you want to stir them into a brothy soup right at the end, or dress with lemon and olive oil and pile onto that frozen pizza you just pulled out of the oven.Sturdy: Tuscan or curly kale, escarole, dandelion greens, beet greens, collards, bok choy or yu choy. I love these lightly steamed and seasoned with something assertive and salty, like this dead-simple Chinese broccoli with soy paste.Photo by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiThe crunchy club has many membersCucumbers. Gotta love ’em, and we go through a lot of them, but they have a pretty short shelf life and are in high demand. Here are things that can be cucumber-ish when thinly sliced: Any small radish, or big ones, such as daikon or watermelon radish; celery; fennel; carrots; bamboo shoots; kohlrabi; romaine hearts or little gems; snow peas or snap peas. Set yourself free. We have a plate of a cucumber-esque thing almost daily for a snack, sprinkled with flaky salt and dressed with a little rice vinegar.Some ingredients have no easy substitutes, especially when it comes to baking. That might mean you have to shelve your desire for buttery pie dough if you don’t have any butter, or put off the next batch of cookies till the baking chocolate has been restocked. But that’s life these days. I miss a lot of things, like going outside and talking to my friends, but I’m relying on other things to fill the void, like opening the window and having long conversations with my cats. It’s certainly not the same, but it’s going to get me through this.Explore Bon AppétitCoronavirusCarla NewsletterRead MorecultureWhere to Order Your Favorite Pantry Staples OnlineBy MacKenzie Chung FegancultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffCoronavirusThere's No Better Time to… Break Out The Good StuffBy MacKenzie Chung FegantechniquesYou've Got This: A Step-by-Step Guide to Making Ravioli at HomeBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-16", "author": ["Condé Nast", "Carla Lalli Music"]}