{"id": "1d2e64ef96a895dea8c2fdd16be8b87c", "url": "https://www.bonappetit.com/recipe/trini-callaloo", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Trini Callaloo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTrini CallalooBy Brigid WashingtonMarch 8, 20214.5(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintCallaloo is deeply rooted in the history of the Caribbean, with origins tracing back to the 16th century, when enslaved Africans used local plant life and ready aromatics to create a masterful meal out of seemingly nothing. In Trinidad and Tobago, where I was raised, callaloo is so significant, it’s considered the twin Islands’ national dish—even without an official governmental designation. Callaloo has many variations throughout the Caribbean and its diaspora, but the one I grew up with uses taro leaves, okra, pumpkin, coconut milk, onions, garlic, and Scotch bonnet peppers. My version uses my mother’s recipe as a starting place, with a few adjustments. Because taro can be difficult to source in the States, I like to use a mix of spinach and collard greens—the latter serving as a nod to the South (my current home) and its rich Black culinary traditions. And when pumpkin isn’t available, I’m happy to sub with butternut squash, which makes for a strong, delicious proxy.Read more about Brigid’s recipe and how she learned to love the dish here.Ingredients4 - 6 Servings2Tbsp. vegetable oil1small onion, finely chopped6garlic cloves, finely chopped4scallions, chopped1large bunch cilantro, finely chopped2Tbsp. thyme leaves1bunch collard greens, thick stems trimmed, thinly sliced4cups baby spinach8large okra, stems removed, thinly sliced2habanero chiles, 1 finely chopped, 1 whole2cups 1\" pieces peeled butternut squash113.5-oz. can unsweetened coconut milk1tsp. freshly ground black pepper, plus moreKosher saltSteamed rice or baked macaroni pie (for serving)PreparationStep 1Heat oil in a large Dutch oven or other heavy pot over medium-high. Add onion and garlic and cook, stirring often, until softened and translucent, about 1 minute. Add scallions, cilantro, and thyme and cook, stirring, 1 minute.Step 2Stir in collard greens and spinach just to wilt slightly, then add okra, chopped chile, squash, coconut milk, and 1 tsp. pepper; season with salt. Stir well, then place whole chile on top. Reduce heat to medium-low, cover pot, and simmer until squash is tender and greens are wilted and softened, 40–45 minutes.Step 3Remove and discard whole chile (it should be shriveled but still intact). Using an immersion blender, purée Callaloo until smooth. (If you don’t have an immersion blender, blend in batches in a regular blender). The Callaloo should be thick and viscous. Taste and season with more salt and pepper if needed. Serve with rice or baked macaroni pie.How would you rate Trini Callaloo?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleSo delicious!!! Wouldn’t change a thing except to maybe use smaller habanero as mine turned out quite spicy. I did also add some broth but that’s because I put in extra greens. Will definitely make again!NdJBondville, VT1/10/2022I ADORE Callaloo. We have taro all over West Africa but we don't prepare the way it's done in the Caribbean. Absolutely delish!!LadyZBrooklyn, NY5/4/2021I was born and raised in T&T, but have been domiciled in Florida for the past 26 years. Callalo was always part of a Sunday lunch along with Stewed Chicken and Macaroni Pie. I used frozen Spinach and Okra instead of fresh and it came out exactly how I wanted it and remembered it. Thank you for a wonderful recipe and a reminder of fond memories.John AFlorida4/18/2021So good. Unfortunately, I had to omit the okra because it's out of stock near me, but it was amazing either way.Anonymous3/15/2021Oh my goodness! You took me back to my childhood so many decades ago - in Europe! My mother was Trinidadian and my path to loving callaloo was eerily similar to yours from green goop in my childhood to green deliciousness in my young adult years.  Thank you so much for the recipe. My family's matriarchs never wrote down the recipe - they just knew it. They brought it (and many others such as Pastels and black eyed peas and rice) to Europe when they emigrated. I now live in Australia and will definitely give your recipe a go.  I really appreciate this Bon Appetit cultural entry - thank you.AnonymousAustralia3/12/2021Served with rice, baked tofu, and a squeeze of lime. Licked the bowl (and the pot)!AnonymousUK3/10/2021I am fortunate to live in a tropical island location, and part of the \"states:\" many miles and another ocean away from the Caribbean where Taro was, and still is abundant and a staple in local cooking.  While Squid luau and Laulau (fish/chicken/pork steamed in taro leaves) are the most common use of taro leaves in cooking, the root portion of the Taro plant also gives us Poi.  It is wonderful to be introduced to a dish like Callaloo that has such far a way and wonderful history, but yet seems so familiar.  Thank you for giving me a wonderful new dish for use of this wonderful plant.  Aloha Jeff AlvesHonolulu, HI3/9/2021Explore Bon AppétitCaribbeanCollard GreensLeafy GreensVegetableOkraSpinachButternut SquashSquashEasySideDairy-FreeVeganVegetarianGluten-FreeBraiseJuneteenthKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-08", "author": ["Condé Nast", "Brigid Washington"]}