{"id": "1d3ae488768f944b1fbd317f800ed1e4", "url": "https://www.bonappetit.com/story/fried-rice-pancakes", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Fried Rice Pancakes Made With Leftovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChinese Fried Rice Pancakes Are My Mom’s Brilliant Way of Maximizing LeftoversMy mom's been perfecting this dish for decades. By Diana YenSeptember 3, 2020FacebookTwitterEmailPhoto and Food Styling by Diana Yen FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I come from a family that pretty much lives for leftovers. I’m talking about the type of people who can’t let a good meal end. While we’re eating, everyone is already chatting excitedly about the next meal we’re going to make out of the scraps. Whenever we’re having Chinese roast duck, my mom will always make us stop halfway through so she can pick all the meat off the bones and save everything for duck congee (including the bones, which give the stock a rich flavor). The first meal is good, but the leftovers meal is even better.When I’m back in California visiting, my mom always saves a bowl of rice in the fridge from dinner the night before. The next morning we wake up to the sound of rice sizzling and crackling on a hot cast-iron pan and know that she’s making her Chinese fried rice pancakes. To make this dish, Chinese fried rice in pancake form, she uses day-old jasmine rice straight out of the fridge, pours an egg mixture over to bind it, and tops it with Spam, Chinese sausage, and vegetables. The pancake is covered, steamed until it’s creamy and custard-like, and then uncovered and sizzled to golden perfection.If you’ve never seen fried rice pancakes in a restaurant or even heard of them, well, neither have I. From what I can tell, my mom invented this dish out of our love for all things crispy. Annie Yen is a freestyle cook—you’ll never see her use a measuring cup or any kind of timer when she’s in the kitchen. But she’s obsessive about perfecting her technique and will make a dish over and over until she gets it just right.Here’s how she does it: First, prep all of your toppings. You can use ½ cup diced Spam or ham, 1½ links Chinese sausage (lap cheong), sliced into rounds, ½ cup quick-cooking vegetables like bell peppers, corn, carrots, or peas, cut into bite-size pieces, if necessary, and 1 scallion, sliced on a diagonal.Then, make the egg mixture. In a small bowl, whisk together 2 eggs, 2 tablespoons soy sauce, ½ cup water, and a pinch of white pepper. This mixture is used as a binder for the rice pancake.Heat 1 tablespoon of grapeseed or other neutral oil in a 10-inch cast-iron or nonstick skillet over medium-high heat. Add Spam and sausage pieces and cook, stirring often, until golden brown and crispy, about 3–4 minutes. Using a slotted spoon, remove the Spam and sausage, and set aside in a bowl. Leave the rendered fat in the skillet for the rice.Turn the heat down to medium. Add 2 cups day-old jasmine rice to the sizzling hot pan and press down with a spatula to form an even layer covering the bottom. Pour the egg mixture over the rice, swirling the pan to coat evenly. Top the rice mixture with the Spam, sausage, and vegetables. Place a lid on top. Cook for about 8–10 minutes, until the eggs are custardy and cooked through. Take the lid off and keep cooking until the bottom of the rice is crispy and perfectly golden. Use a spatula to gently lift the sides, checking for browning on the underside, which will take about 3–4 more minutes. For those who like to live dangerously, try not to touch it at all and wait until you smell the rice beginning to burn, then pull it immediately off the heat. Phew! It’s perfect. This way you know that the Maillard reaction (browning) is in full swing and you’re going to get the maximum crispy crust.Top the pancake off with scallions and let it rest for a few minutes to firm up. When you cut it into wedges for serving, you’ll hear a satisfying crunch from all the crispy rice bits at the bottom.I’ve cooked professionally for over a decade now, writing recipes and styling food in New York. I have spent years perfecting French farm-to-table dishes, traveling to Italy to learn about everything pasta, and chasing down the trendiest grain bowl in L.A. After all of that searching, it’s only now, when everything that’s important to us has risen to the surface, that I’m rediscovering what it means to be Chinese American. The best food I have eaten will always be our family dishes that have no name and no recipes. I’m giving this dish a name now and celebrating my mom’s clever ways of using up leftovers to feed our family.Diana Yen is a food stylist, photographer, and recipe developer in Brooklyn, NY. She’s the owner of Jewels of New York studio and author of A Simple Feast.Explore Bon AppétitIt's That SimpleRiceChineseRead MorecookingWhen I Crave Simplicity, I Make This Chinese Steamed Pork PattyBy Kate KassincookingSingapore Noodles Are Best Eaten Immediately (Which Presents No Issues)By Hetty McKinnoncookingAny Soup Can Be Egg Drop Soup If You Want It to BeBy Lucas SinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Diana Yen"]}