{"id": "1d5a39cfbb21dca4f4da665478af8604", "url": "https://www.bonappetit.com/story/garden-gifts-2021", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "The Best Gifts for Gardeners According to a Chef-Turned-Green-Thumb | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Gifts for Gardeners According to a Chef Turned Green ThumbGive your favorite gardener harvest baskets, pruners, and hot pink garden twine and reap the rewards come summer.By Natasha Li PickowiczOctober 8, 2021FacebookTwitterEmailPhoto by Yunhee Kim, Prop Styling by Christopher WhiteFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Last winter my friend and downstairs neighbor, Celeste, decided to move out of the ground floor apartment she had shared with her husband for nine years. My studio had a pair of skinny windows that faced onto a noisy gas station and body shop, but Celeste’s unit received bright southeastern sun and opened directly into a secret garden. I called my landlord, signed the paperwork, and waited to move downstairs.Celeste, an avid gardener, had spent the last decade nourishing this Brooklyn space into a lush, dappled paradise—planting frilly ferns and pothos lillies against the shaded back fence, winterizing the fig tree in thick blankets before the first snow, and building and tending to three large raised beds where she grew vegetables and herbs that she’d harvest and leave on my doorstep, edible bouquets stuffed into a mason jar. Now the garden was mine.I was eager to keep it going, but though I had worked with plenty of beautiful fruits and vegetables in my past job as a pastry chef and was a general produce enthusiast, I’d never gardened and had no idea how to start. But friends came to my rescue, gifting me their time and expertise as well as actual amazing stuff, like the tray of onion seedlings Mindy drove up from Florida; a trio of worn tomato cages Bob dug out of his garage when I complained about my drooping vines; and giant bags of hay Jared brought over to keep my topsoil warm. They gave me exquisite heirloom starts, including psychedelic varieties like “reisetomate” tomatoes and “sugar rush peach” peppers and taught me how to make compost tea (a compost-and-water concoction that nourishes your plants).I filled bucket after bucket in my bathtub and trudged the length of my apartment every day to keep the beds watered. I felt heartbreak, so deep, when squash vine borers killed my first zucchini plant, then my second, then my third. I cried when I ate my first tomato, sweet with skin split from rain. I had big messy parties in the garden, the slugs sliding up our thighs once the sun went down. I made new friends who gardened. I gave away food. I ate everything else. I forgot about my old kitchen job, at least until I felt the deep, familiar ache after a long gardening session. I’d really missed that feeling.The advice and items from friends and family members kept my garden alive, and while I can attest that the best gift for gardeners is the gift of self-sufficiency, a beautiful mosaic flower pot does not go unappreciated. I've culled these gardening gift ideas based on my own experiences over a season spent digging, watering, weeding, and harvesting. These tools may not be the flashiest or fanciest, but they are the ones I use myself, and they'd make a thoughtful gift to anyone just starting out—even with just a few indoor plants.Organic top soilTo prepare my raised beds for a late spring planting, I tilled (fluffed) all of the preexisting soil, which was compacted and dry from winter exposure, with a small trowel. Then I bought 160 pounds of organic top soil and scattered it on top using a pint container as a scoop. I tossed it all together with my hands—using the same technique I use to mix biscuits and scones—and was rewarded with the garden equivalent of a blank canvas.Michigan Peat Organic Top Soil Blend$45 at AmazonPink twineThere are many ways to stabilize tall, spindly plants like indeterminate tomatoes (which are vining varieties, like Sungolds, that produce fruit throughout a season), but I use waterproof braided twine to loosely tie vines to wooden stakes. Besides being my favorite color, the hot pink hue is easy to spot while I’m literally in the weeds, and the stakes provide just the right amount of support for tall tomatoes, peas, and beans.Pink Twine$9 at AmazonBlundstone gardening bootsBack when I’d spend 12 hours on my feet on hard tile, these used to be my kitchen boots. Now, they’re my gardening boots. They’re already perfectly worn in, and unlike clogs, they keep my ankles dry and safe from the clouds of mosquitoes that haunt my garden underbrush.Blundstone boots$185 at BackcountryTomato cagesConical steel wire cages are my go-to for determinate tomatoes (which have a shorter season of producing fruit and often grow fast, compact, and wide) and other high-yield bushy plants like peppers. They provide structural support on all sides once the plant starts producing heavy, fat fruit. The key is to lift the plant off the ground and encourage air circulation; the closer to the soil, the more likely the plant will be exposed to blight, rot, bugs (and, in NYC, um, rats).Tomato Cages (10-pack)$45 at TargetLiquid kelp fertilizerI dilute a few capfuls of this organic cold-processed liquid kelp fertilizer into my watering cans during the early growth stages of my plants, when the tiny, vulnerable seedlings in my raised beds rely heavily on the soil for nutrients. My potted plants need even more love; because potted soil dries out so quickly, I like to supplement with extra nutrients.Peaceful Valley Organic Liquid Kelp$30 at Grow Organic2 Gallon Watering Can$20 at TargetThe Good ShearsThese indestructible stainless steel scissors are sharp and strong as hell. Cookware brand Material designed these with kitchen and cooking use in mind, but honestly my pair lives outside, where I use them to prune the unruly, thick branches of my lilac and fig trees and quickly snip herbs, salad greens, and flowers for my home. These make a great gift for gardeners and home cooks alike.The Good Shears$35 at MaterialNontoxic pesticidesChemical insecticides, while being terrible for both animals and humans alike, also wipe out bee populations and pollute our water supply. So I stay away. Instead, I bought this organic, non-toxic Bonide BT spray (short for the bacterium Bacillus Thuringiensis) from Crest Hardware in Williamsburg (where I also stock up on immune-boosting elderberry lollipops #selfcare). It doesn’t hurt beneficial insects (like pollinators and earthworms), but does kill the infuriating, destructive worms and caterpillars that gobble up my lacinato kale and other brassicas.Bonide Pesticide Spray$19 at AmazonFor everything else I mix a 1:2 dilution of Tabasco sauce and water for a DIY insecticide. Hot sauce contains capsaicin—the zippy chemical compound that I squirt over my noodle soups and fried eggs—which causes damage and dysfunction to most invasive insects (bonus: it’s also a turn-off to bigger city beasts like squirrels, rats, and birds). For best results, transfer the mixture to a small spray bottle and spritz all over your plants on a dry day with no rain in the forecast and reapply every few days.Tabasco Sauce$6 at TargetSpray Bottle$4 at TargetGarden harvest basketsI keep a stack of durable woven straw baskets—like these fair trade, pine needle Mayan baskets, which I picked up at the food bookstore Archestratus—outside with my gardening tool set. When I’m ready to harvest, I grab a basket and fill it up with veggies. It would even make a thoughtful gift for a non-gardener—it looks as beautiful outside as it does inside, resting on my kitchen counter.Rosa Basket$24 at Mayan HandsClean-Cut Mosaic plantersAlthough the majority of my vegetable gardening happens in raised beds, I keep about a dozen smaller plants (mostly drought-resistant herbs like rosemary, lavender, thyme, and rue, as well as persistent herbs that are prone to sprawl in beds, like mint) in ceramic pots lined up on a ledge. My most prized pieces are the pearlescent mosaic-coated terracotta pots from Brooklyn-based glass artist Kevin Newcomb. Whether your favorite gardener has indoor succulents or an outdoor herb garden like mine, every cluster of pots deserves a personal disco ball.Mirrored Mosaic Planter$40 at Clean Cut MosaicsRow 7 seedsGrowing a full garden from seed still feels too intimidating, but I did direct sow (that’s when you drop the seeds right into the tilled soil as opposed to in a small container indoors) about a third of my garden, focusing on quick growing, immediate-gratification greens like lettuces, arugula, and cilantro, and prolific vines like zucchini.Seed packets offer way more bang for your buck than starts and are a great way to explore esoteric breeds, which are much harder to find in seedling form. Row 7 is based at the Stone Barns Center for Food and Agriculture and breeds organic, non-GMO seeds with poetic names like midnight roma tomato, beauregard snow pea, and badger flame beet that are meant to be planted in moderate New York climates. At about $3.75 for half an ounce of seeds, it’s definitely cheaper than a visit to Blue Hill.Row 7 Vegetable Seeds$22 at Food52 (Pack of 4)Chef-y startsAlthough hardware stores and nurseries are a great place to pick up basic seeds and starts, for me gardening was a chance to grow the unusual, rarified edible plants I would otherwise find only at the farmers market early in the morning. Star Route Farm in the Catskills, known for its commitment to social justice as well as its flawless produce, sells seedling versions of their beloved, organic vegetables (sign up for email alerts on their website). At the beginning of the summer, not only did I order 10 pounds of stinging nettles and spinach for some savory pies, I also bought starts of lemongrass, tulsi, anise hyssop, lemon verbena, golden amaranth, bird’s eye chilis, and marjoram at about $5 each. If you don't live in New York, visit your local farmer’s market in the late spring—some farms will have starts nestled into their other produce, often at an incredible value.Badger Anti-Bug SprayI’m one of those “bugs LOVE me!” people—a quick lap in my garden, and I’ll have upwards of 25 welts all over my body. I wanted to avoid DEET-based repellents, so I took to Instagram to crowd-source more gentle remedies. Though I received hundreds of mosquito repellent recommendations (Stickers! Pumps! Fans! Full body mesh covering!), I’ve personally found this non-synthetic, organic Badger Anti-Bug Spray to work the best for me, and its essential oil blend of citronella, rosemary, and wintergreen smells lovely, too.Badger Anti-Bug Shake & Spray$11 at TargetMayan copal incenseCopal, a sacred tree found in Mexico and parts of South America, produces a sap that has been burnt by indigenous Mesoamerican cultures for thousands of years. Camille Becerra suggested I burn copal incense while gardening. Its bewitching scented smoke helps keep mosquitoes away (mosquitoes are weak fliers and hate smoke and wind!) and brings me peace and clarity.Mayan Copal Incense (10-pack)$14 at EtsyAfter BiteI always carry a stick of After Bite because no bug spray is perfect and I cannot resist scratching. The solution tingles and burns in a very satisfying, sinus-clearing way while the baking soda dries out the bite. It works instantly—and for the first summer I did not have the scabby legs of an 8 year old.After Bite Advanced Itch Relief (4-Pack)$16 at AmazonSupergoop SunscreenIt’s expensive, but I love the non-greasy, scentless formula, which dries with a satiny finish. I slather it on before I apply bug spray.Unseen Sunscreen 40 SPF$34 at NordstromAnd finally, shout out to my alma mater Cornell University for its stellar vegetable and flower growing guides, which are organized in a way even a gardening dummy like me can understand.Explore Bon AppétitGiftsShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-08", "author": ["Condé Nast", "Natasha Li Pickowicz"]}