{"id": "1d5b6cdfcaf4a8f4d592b80c1a5ee766", "url": "https://www.bonappetit.com/story/oreos-helped-my-family-heal", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "We Were a Family Defined by Illness and Restriction. Oreos Helped Us Heal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Were a Family Defined by Illness and Restriction. Oreos Helped Us HealThey were a good choice for us then: a lot of calories packed into a bite full of sugar and fat.By Debi LewisMay 25, 2021FacebookTwitterEmailIllustration by Kissi UssukiFacebookTwitterEmailNearly two months after my daughter Sammi’s surgery, we visited her pediatrician for a checkup. Sammi was eight and had been struggling to consume enough calories for years. Eating had been an excruciatingly slow task, and sometimes she refused certain textured foods altogether. Doctors had prescribed elimination diets and medications to treat possible acid reflux or protein intolerance. It turned out Sammi had a kink in her esophagus, causing food to get trapped after each swallow; an operation helped untangle it. Now, for the first time in her life, she was free to eat whatever she wanted.In the examining room, we got the post-surgery all-clear from the doctor. Before leaving she advised that Sammi put on a few pounds.“However you want to do it,” she said. “Let it be junk food for now if that works.”That wasn’t as easy as it sounded. Sammi’s favorite foods were raspberries and watermelon not cupcakes or pizza. While most parents would be thrilled about these “healthy” preferences, fresh fruits weren’t going to help Sammi put on those missing pounds. I knew I’d need to relax my ideas about what constituted healthy food for a while. But I never imagined how embracing “junk” might change our family for the better.While I wouldn’t describe myself as a “natural foods only” parent, I’ve always encouraged healthy eating habits—without vilifying carbs, fat, or even sugary cereals. In fact, the nutritional balance I’d managed to create was partly thrust upon me by the exceedingly restrictive diets doctors had prescribed for Sammi over the years. We’d always eaten whatever Sammi did, so I’d learned to cook for four without dairy, soy, eggs, nuts, and wheat during one phase and without fat for another. Dishes I’d learned to make out of necessity became family favorites: pan-seared brussels sprouts with garlic; crunchy tostadas with refried black beans; warm baked lentils with sweet potatoes. But cooking everything from scratch became exhausting. Any time I found a packaged or processed food that fit Sammi’s needs, I was relieved. Though these weren’t really adding much vitamin content, I learned that Sammi needed more than pure nutrition. When she couldn’t eat whole wheat crackers or trail mix, plain potato chips made her feel less left out at snack time. When milk was forbidden, neon ice pops allowed her to enjoy the ice cream truck with friends at the beach. I didn’t hesitate to include these snacks in her diet because they helped her feel less isolated.Now that she was done healing from surgery, calorie-dense, high-fat “junk foods” were our best bet to help Sammi gain weight. I was willing, as always, to do whatever it took, but I worried about demonizing any food by calling it “junk.” I’d always taught my daughters that we ate both for fuel and joy. Anyone who saw my kitchen—always stocked with beautiful local produce and salty tortilla chips—knew balance was important to me.After Sammi’s appointment with the pediatrician, a supermarket display of Oreos caught my eye. I’d eaten them only a few times as a child; my mother seldom purchased store-bought cookies (they were to her, of course, “junk”). As an enthusiastic baker, I rarely felt the need to buy them either. But something about these Oreos, with their bright blue packaging and pink-bordered font announcing twice the filling, piqued my curiosity. When I flipped the package over, I saw the nutritional information reflected a good choice for us then: a lot of calories packed into a bite full of sugar and fat.Sammi loved them. And within six months she had gained enough weight to look healthy. As she’d learned to trust her newfound ease in swallowing, we’d started adding other foods to her diet, like Thai noodle dishes and granola bars. But we still kept Oreos around; they had become a family staple. We mindlessly snacked on them whenever we breezed past the kitchen counter. I kept the pantry chock-full of blue packages; they became as usual a sight as the mountain of local fresh veggies I stocked in the fridge. I even packed the crunchy, creamy cookies in everyone’s lunches; they were as tasty as the cookies I baked myself.Our Oreo tributes have transformed us from a family defined by foods we had to avoid into a family gleefully unencumbered by the many foods we enjoy.This routine lasted for three years. Then one day, after noticing the Oreos alongside our hoard of chips, sugary cereals, and Halloween candy, my husband asked gently: “Could we just…tone it down?”It may sound silly, but I couldn’t help but feel embarrassed. Up until this point I’d relished our new relaxed outlook on food. I’d managed to mostly ignore the constant “healthy food” messaging around me: the stares from judgmental parents with their quinoa chips and natural almond butters, the women’s magazines at the checkout counter, the fad diets. Sure, our family may have gone a little too far in our new direction. But it seemed the real problem wasn’t the Oreos; it was our attitude about them.We called a family meeting and settled on a compromise. When a new Oreo flavor came out (as they do three or four times a year), we agreed to buy a package. If we were simply craving cookies, we would make them from scratch.Soon after we started filming our own Oreo “unboxing” videos, taste-testing and giggling through each review like playful connoisseurs. Is this delicious? How’s the crème-to-cookie ratio? Does it taste like the flavor it advertises?We’ve been posting our Oreo videos on Facebook for four years. I’ve also often shared pictures of other things we love: our brussels sprouts; the rosemary and garlic braided challah topped with sea salt; the bright beet and carrot salad we swoon over every summer. No one has ever criticized these dishes, regardless of the volume of our intake. But plenty of people have expressed their opinions about our Oreos; some have even suggested we lacked self-control. I try to ignore them. Indulging in a few packages each year hardly counts as reckless behavior. Our Oreo tributes have transformed us from a family defined by foods we had to avoid into a family gleefully unencumbered by the many foods we enjoy.Last July we tried the new Team USA Oreos. We cheered on camera while ceremoniously opening the package and noted the delineation of the red, white, and blue frosting. We commenced our usual bit, treating the cookies at first with mock respect, then with real respect, and then, finally, with careful, genuine deliberation. Our verdict? They were okay. They didn’t hold a candle to the juicy, musky sweetness of the Georgia freestone peaches we bought that same month. Did we eventually polish off the package anyway? Absolutely.Explore Bon AppétitHealthyishFamilyRead MorecultureMaking Amends With Lean CuisineBy Mariella RudicultureWonder Bread, Government Cheese, and the Comfort of My Foster Mom’s KitchenBy Nicole JohnsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Debi Lewis"]}