{"id": "1d63340acfa90c307b1c07540c55728a", "url": "https://www.bonappetit.com/story/party-tricks-wine-beer-cold-party-bathtub", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "How to Keep All That Party Booze Cold—Without Using Your Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Keep All That Party Booze Cold—Without Using Your FridgeWhen Alison Roman hosts, the wine goes in the bathroom, not the kitchen.By Alison RomanMarch 22, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Amy Wilson.FacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Parties are a time to embrace the absurd—and if there is anything more absurd than filling your bathtub with an ungodly amount of ice and using it to store all your drinks for the evening, I don’t want to know about it. That's right: If you come to a party at my house with a bottle of wine in hand (thank you!), I will point you in the direction of the bathroom, not the refrigerator. And you'd better get used to it.This is something I do mostly out of necessity (thought the photo op ain’t bad, either). See, the refrigerator in my Brooklyn apartment has the capacity for about seven things at a time, making it impossible to store an evening's worth of wine and beer. Even if you're the proud owner of a regular-sized fridge, chances are it’s already stuffed with snacks for your party or things for your regular life. (By which I mean: condiments. Your fridge is full of condiments.)So I do what any person serious about very cold drinks would do: I fill a bathtub or large kitchen sink halfway with ice, add all the beverages it can hold, then top with more ice. This accomplishes a few things. First, it keeps every single can and bottle furiously cold and RTD (ready to drink). Second, it eliminates the temptation to buy that very \"cool\" steel ice bucket you'll use only twice a year and don't have space for anyway. (I don't care if you don't live in a Brooklyn hovel with no closet space like me—you don't need that ice bucket.)Should you decide to embark on this journey, there are a few logistical things to keep in mind. Here are the most pressing, broken down into a list of DO’s and DON’Ts.DO: Clean the tub and clear the area of clutter before the party starts. This should go without saying, but the bathtub is a very intimate space and you’re trying to turn it into a highly trafficked area, so put away that loofah—this is a bar now, not a day spa.DON’T: Keep anything else in the bathroom. Glasses, garnish, openers, etc. should all go elsewhere. This is strictly for storage; it's not a hangout zone.DO: Have your ice delivered. (You deserve it!) Grocery delivery sites will often deliver, as will local ice companies. Call around. If I don't have it together to place an order in time, I’ll ask my closest friends, the ones who expect this kind of thing from me, to bring a couple of bags with them when they arrive. Most oblige, and most still like me after.DON’T: Leave a bag of ice on the floor next to the radiator—it will melt and drip into your neighbors' downstairs apartment and they will text you at 7 a.m. the next day asking what the hell happened. (Sorry about that again, guys!)And should you find yourself with leftover wine...Bad Wine Is Just a Great Cocktail Waiting to HappenIn Alison Roman’s new column, Party Tricks, the ‘Dining In’ author defends the wine spritzer.View StoryExplore Bon AppétitBasicallyParty TricksWineEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Alison Roman"]}