{"id": "1d6adf995d327c8fa2158b18ce05102b", "url": "https://www.bonappetit.com/story/room-temperature-butter-baking", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Room-Temperature Butter: When We Say You Need It, We Mean It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRoom-Temperature Butter: When We Say You Need It, We Mean ItWhy room-temperature butter is so important in baking, and how to warm the cold stuff up in a hurry.By Claire SaffitzApril 10, 2018FacebookTwitterEmailFacebookTwitterEmailWhen the urge to bake strikes, it strikes hard and fast. You want to get in the kitchen and start breaking eggs right away, so it can be real buzzkill to find out that the recipe you're using calls for room-temperature butter. Who has the time or patience to wait for fridge-cold butter to warm up? Do you really need to use room-temperature butter every time a recipe calls for it? We’ll explain when you need to exercise patience, when you don’t, and how to cheat the laws of physics to soften butter fast.First things first: Why is room temperature butter important in the first place? Because butter has certain unique properties that distinguish it from other fats used for baking. It’s solid at room temperature, but unlike other saturated fats, it’s whippable—in other words, it’s capable of holding air. This is important in baking because during the “creaming” stage, in which butter and sugar are beaten together, the sharp edges of sugar crystals cut into the soft butter to create air pockets. This action aerates the batter or dough, which helps lighten the final baked good during baking. For baked goods where lightness is a prized attribute—almost all cakes, some cookies—it’s important to start with room-temperature butter.Light aaaaaaaand fluffy, just the way we like it.\nWhen it comes to butter, “room temperature” refers to the semi-solid stage where butter is extremely spreadable but still holds its shape. It should be soft enough that your finger will make an imprint with zero resistance, but not so warm that the butter looks shiny or greasy (or is melted completely, which happens around 90°F). Butter that is too warm won’t aerate properly when beaten with sugar, leading to a decidedly un-fluffy result. As a general rule, whenever a recipe starts with creaming butter and sugar, it’s a good idea to really let your butter reach room temperature so the final result has the optimal texture. In some cases, though, using melted butter that is then cooled (but still liquid) can have a different but not undesirable effect. When it comes to chocolate chip cookies, for example, I like to use melted and cooled butter because it leads to a chewier—rather than cakier—finished cookie.Allowing your butter to sit at room temperature (68°-70°) until it’s softened is ideal for uniform temperature and consistency, but this takes several hours. One work around? If you bake all the time, just leave your butter on the counter so it’s always ready. If that’s not practical, you can speed up the softening process a couple of ways. Cut up a stick into ½” pieces and scatter across a plate, because smaller pieces will reach room temperature faster. In a pinch I will also microwave a whole stick of butter in 15-second intervals on low power just until it yields to the touch. Microwaving butter is risky business because it can go from solid to liquid literally in seconds, so I keep a very close eye.If you're making Blackout Chocolate Banana Cake, room-temp butter is a must.\nPhoto by Chelsie CraigOne last thing to remember: If a recipe calls for room-temperature butter, make sure your other ingredients, namely eggs and any liquid dairy like milk or cream, are also room temperature. Because if cold eggs hit soft butter, the butter will immediately firm up and the final texture won't quite be the same. While it might feel like a bummer to have to wait patiently for your ingredients to temper, it's a good habit in baking (and in cooking, and in life) to get yourself organized and set up well in advance. And if you have a craving to bake and you absolutely can't delay, make brownies, olive oil cake, or any number of other recipes where you can just dive right in.Now that you keep room-temp butter around all the time, how about some apple butter cake?Apple Butter Spice Cake with Cinnamon CrumbleCINNAMON. CRUMBLE.View RecipeExplore Bon AppétitBasicallyBakeButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-10", "author": ["Condé Nast", "Claire Saffitz"]}