{"id": "1d720ffa22e325b6c604c5e380bd20bf", "url": "https://www.bonappetit.com/story/the-most-common-chicken-soup-mistake", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "The #1 Chicken Soup Mistake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe #1 Chicken Soup MistakeExcluding “there's never enough of it.\" By Sarah JampelJanuary 9, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThere are a lot of desirable textures when it comes to food—chewy, crispy, tender, bouncy—but, unless you’re talking about jerky, it's rare that the end goal is \"tough\" and/or \"dry.\" Unfortunately, chicken breasts are often both of these things, even when shredded in a bowl of beloved Chicken Noodle Soup. You know the scene: You're making your merry way through a bowl of soup when you come across a piece of meat that takes forever to chew (it's immediately followed by mushy carrot that requires zero teeth at all—that's the #2 chicken soup mistake).Why is the meat in chicken noodle soup often the opposite of tender and juicy? Well, the problem with cooking any whole chicken is that the breasts and the legs are inherently incompatible (who invented this thing?!). By the time the legs, which consist of strong muscle fibers that take a long time to break down, are fall-apart tender, the delicate chicken breasts have gone too far, toughening up and drying out.There are lots of ways to get around this, from choosing a fella of the right size (that is, on the small side), to tying its legs together, to taking the time to dry-brine, to performing spatchcock surgery, to dropping the oven temperature way down, to simply forgoing the whole chicken conceit and cooking the bird in parts, as you might a turkey.But the solution when simmering a whole chicken for soup is to carve up the chicken before it’s completely cooked through. In Molly Baz's Classic Chicken Noodle Soup recipe, she grabs the whole chicken out of the pot once the breasts register 155° F on an instant-read thermometer. (Technically, chicken is finished cooking at 165° F but the breast meat, once shredded, is going to get returned to the pot for an additional few minutes at the end.) The whole chicken gets broken down, the breasts are set safely to the side (phew!), and the legs get returned to the pot along with the cartilage-rich wings that provide the soup with body. When the legs are finished, all of the meat gets shredded and added back to the stock.Sure, this takes a little handiwork with your tongs and carving knife, but it ensures that neither the breast nor the legs are compromised. Your chicken soup will thank you.Get the recipe:Classic Chicken Noodle SoupThis chicken noodle soup recipe is about as comforting as they come. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-09", "author": ["Condé Nast", "Sarah Jampel"]}