{"id": "1da03e395cf909dfdeaf0e100cc8d491", "url": "https://www.bonappetit.com/story/mochi-cake-with-black-sesame", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "This Mochi Cake Is the Only Thing I Want to “Ring in the New Year” With | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Mochi Cake Is the Only Thing I’d Like to “Ring in the New Year” WithMy 2020 resolution is to eat more mochi, HBU? By Sarah JampelDecember 26, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Yekaterina BoystovaFacebookTwitterEmailSince I started working at BA, I’ve worried that my colleagues suspect I’m operating for the mochi lobby (“Big Mochi”), pushing the “Mochi Agenda” at every opportunity with recipes, story ideas, and general unbridled enthusiasm. And while I am not an undercover mochi agent at the moment, if the opportunity were to arise, I can’t say I’d turn it down. (Koda Farms, sponsor me!)The truth is, I have an organic, unsponsored love for mochi—the family of Japanese confections made primarily of ground or mashed glutinous rice—and its springy, stretchy, chewy, gummy, soft, squishy relatives around the globe, from black sesame-filled Chinese tangyuan to Indonesian kue moci or Filipino bibingka.While I seek out mochi and its varietals whenever I’m traveling, the one I’m most likely to make at home is Hawaiian butter mochi. It’s a super simple one-bowl cake made with eggs, coconut milk, evaporated milk, butter, and, of course, the glutinous rice flour that gives it its characteristic bounce (that’s where the mochiko comes in). The ingredient list is short and the results are great: Why wouldn’t I suggest that we develop a recipe when given the chance?I want to bounce right off that speckled slice!\nPhoto by Laura Murray, Food styling by Yekaterina BoystovaThis cake is the result of that (probably annoying) persistence. It’s like Hawaiian butter mochi dressed up for an evening out. In place of subtle coconutty richness, you’ve got big, bold black sesame. The earthy, nutty seeds are both in the sparkly caramel sauce that shellacks the surface and in the cake beneath. Gray, buoyant, and chewy (I’ll go ahead and call it “supple,” if my editor allows me to leave that description here) [Editor’s note: I will!], the cake is good at room temperature, it’s good straight from the fridge, and it’s good for surprising your friends who might expect a flourless chocolate cake at your New Year’s party but are instead getting something so much more fun and lively and resilient.One note of caution, from experience: Mochi cake tends to sort of expand in your stomach so even though it is tempting to eat a huge piece, proceed with caution. Reader, would someone working for Big Mochi be so honest? You be the judge.Get the recipe:Black Sesame Mochi Cake With Black Sesame CaramelAttention, lovers of squishy and chewy foods! This moody-glam dessert packs tons of bold sesame flavor into one super simple one-bowl cake.View RecipeExplore Bon AppétitHoliday 2019CakeNew Years EveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Sarah Jampel"]}