{"id": "1da1d9446c63ffbf34a79f51bbbe793c", "url": "https://www.bonappetit.com/recipe/strawberry-rose-agua-fresca", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Strawberry-Rose Agua Fresca Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueStrawberry-Rose Agua FrescaBy Claire SaffitzMay 22, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThis refreshing drink recipe makes the most of peak-of-the-season strawberries. Look for the best you can find. You can skip the rose water, but its delicate flavor goes really well with berries and will add something special.Ingredients4 servings1lb. strawberries, hulled, plus whole strawberries for serving¼cup mint leaves, plus sprigs for serving2Tbsp. fresh lime juice2Tbsp. light agave nectar1tsp. rose water (optional)Club soda and lime wheels (for serving)PreparationStep 1Purée hulled strawberries, mint leaves, lime juice, agave nectar, rose water (if using), and 2 cups cold water in a blender until smooth. Transfer purée to an airtight container, cover, and chill until cold, about 1 hour.Step 2Skim off any foam from surface and pour purée into four 12-oz. glasses filled with ice (glasses should be about two-thirds full). Top off with club soda and garnish with mint sprigs, lime wheels, and whole strawberries.How would you rate Strawberry-Rose Agua Fresca?Leave a ReviewTell us what you thinkExplore Bon AppétitAgua FrescaCold DrinkDrinks AllMexicanLatin AmericanStrawberryBerryFruitRose WaterAlcohol & Other DrinksMintHerbs & SpicesSpringEasyDrinksDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}