{"id": "1db71057c939ceb96f587637ea7af25f", "url": "https://www.bonappetit.com/story/spice-ana-sortun", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "'Spice' Is the Middle Eastern Cookbook That Inspires Everything We Cook at Botanica | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Middle Eastern Cookbook That Inspires Everything We Cook at BotanicaSpice, the cookbook by Ana Sortun, is like gospel for the co-owners of Botanica in LA.By Emily Fiffer and Heather Sperling February 25, 2019FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailEmily Fiffer and Heather Sperling are two editors-turned-restaurant-owners in L.A. We'll catch up with Emily and Heather regularly for stories, recipes, and dispatches from the front lines of Botanica, their women-led, vegetable-first kitchen.Way back in 2006, before Ottolenghi was a household name and tahini was a pantry staple, a chef named Ana Sortun published her first cookbook, Spice.Spice is 380 pages long and has just 16 color photos, none of which contain speckled ceramics, sauce swooshes or artfully-strewn table crumbs. Unlike the highly stylized cookbooks of today, this is not one that woos with aesthetics. Rather, it draws you in the old-fashioned way: words! Specifically, words about herb- and spice-filled eastern Mediterranean dishes—a cuisine that is indisputably craveable and wholly au courant.Not familiar with Sortun? We’re not surprised: She’s one of the food world’s most undersung (s)heroes. After studying French technique in Paris and working in restaurants in and around Boston, Sortun traveled to Turkey, where she was fed by groups of local women and home cooks. Coming from French kitchens, she was swept away by the way this part of the world used herbs and spices in lieu of fat and salt to enhance flavor. So began her love affair with all things eastern Mediterranean (and so explains our love affair with her).Today, Sortun has three beloved restaurants in Cambridge, Massachusetts: Oleana, Sofra and Sarma. Sofra especially makes our hearts sing; it’s a cafe, bakery and market whose menu has a decidedly Turkish lilt, and whose shelves are stocked with imports—baharat, rose syrup, date preserves—and products from Siena Farms, the farm Sortun runs with her husband.Those in the know make pilgrimages to Cambridge to eat her food—which, she notes in the intro of Spice, you’re meant to feast upon and then go out dancing. In other words: It’s luscious, flavor-forward and satisfying, yet light and bright enough to propel you into your night. Heather detours to Sofra or Oleana nearly every summer, en route to Cape Cod, for a dose of mezze and Middle Eastern-style tea and a flurry of photo-taking (images of Sofra’s carrot kibbeh, ayran (a chilled salty yogurt drink) and packed market shelves live forever in the “biz inspiration” photo album on her phone).Spice is an enticing, inspiring glimpse into this world of flavor and technique—and at 13 years old, it’s more relevant than ever. Its pages are filled with things we consider elemental and essential: roasted carrot-harissa dip with dukkah; tahini sauces galore; orange flower water and pomegranate molasses; and a reverence for herbs and spices so elemental, it dictates the way Sortun chose to organize the book. We have fierce respect for her chapter titles: The Three C’s: Cumin, Coriander, and Cardamom; Gold and Bold: Curry Powder, Turmeric, and Fenugreek; Flower Power: Cooking with Nasturtium, Orange Blossom, Rose.Peppered throughout are personal stories from Sortun’s travels and nods to the Turkish home cooks, most of them female, who inspired her recipes. Her reverence and expertise are clear from the first page, as is her ahead-of-her-time-ness. This is a woman urging you to sprinkle cardamom and sugar on your grapefruit segments, use nuts as a thickening agent and seek out linden blossom honey from the Internet in 2006, for goodness sakes.We crack open Spice when we’re craving elevated Turkish grandma food (squash kibbeh with brown butter and spiced feta; beet tzatziki; fried halloumi with pears and spiced dates), when we’re ideating for Botanica, when we’re planning dinner parties, and when we simply want to daydream with our palates. We strongly encourage you to do the same. Only delicious things will come of it.Ana: You inspire us! Thank you for all that you do. (Now, will you please open an outpost of Sofra in Silver Lake?)Readers: Get your hands on a copy (and prepare to bow down to the original queen of the Levant)!All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishCookbooksBotanicaessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-25", "author": ["Condé Nast", "Emily Fiffer", "Heather Sperling"]}