{"id": "1dbe15b84386c8003e3ca906d24fbf7a", "url": "https://www.bonappetit.com/recipe/aloo-tikki-with-hari-chutney", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "Aloo Tikki With Hari Chutney Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAloo Tikki With Hari ChutneyCrispy, bronzed potato patties and a fiery green sauce to dip them in.By Shayma Owaise SaadatFebruary 21, 20214.5(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThese bronzed, crispy-on-the-outside spiced potato patties, or aloo tikki in Urdu and Hindi, take me back to my school years in Lahore. We used to line up for the school tuck shop owner Apa’s aloo tikki: Each one was placed neatly in the middle of warm naan and folded for a mobile snack during recess. This street food–style snack—which is enjoyed from Pakistan to India to Bangladesh—pairs beautifully with a cup of late afternoon chai, as a side with morning eggs (move over, hash browns), or with a glass of bubbly during cocktail hour. The fritters themselves are scented with fresh cilantro, mint, and cumin seeds, but dunk them into fiery hari (green) chutney to fully enjoy. This recipe calls for cayenne pepper, but if you prefer more heat, use the ground red chili powder found in South Asian grocery stores. It’s worth sourcing rice flour, as it provides a really amazing crunch, but all-purpose flour will work. —Shayma Owaise SaadatAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8-Inch Chef's Knife$47 At AmazonFish Spatula$14 At AmazonBox Grater$13 At AmazonCutting Board$10 At IKEAParing Knife$10 At AmazonLarge Saucepan$60 At AmazonColander$11 At AmazonCuisinart 14-Cup Food Processor$230 At AmazonMedium Bowl$17 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketSpatula$12.99 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMedium Skillet$60 At AmazonWire Rack$23 At BA MarketIngredients1lb. red-skinned potatoes (6–8 small or 3–4 medium)1bunch cilantro1small bunch mint1lime1red or green Thai chile1garlic clove1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided, plus more1large shallot2Tbsp. rice flour or all-purpose flour½tsp. cayenne pepper½tsp. cumin seeds¼tsp. ground turmericVegetable oil (for frying; about 3 cups)PreparationStep 1Slice 1 lb. scrubbed red-skinned potatoes (6–8 small or 3–4 medium) in half with a chef’s knife. Place potatoes in a large saucepan and pour in cold water to cover by 2\". (Starting potatoes in cold water ensures even cooking.) Bring to a boil over high heat; reduce heat to medium and simmer until you can easily pierce with the tip of a paring knife, 15–30 minutes, depending on their size. Drain in a colander and let sit until cool enough to handle.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Meanwhile, make the hari chutney. Remove tough stems from 1 bunch cilantro and coarsely chop leaves with tender stems until you have ½ cup. Coarsely chop leaves from 1 small bunch mint until you have ½ cup; place in a mini food processor or blender. Set remaining herbs aside for aloo tikki. Cut 1 lime in half and squeeze juice into processor. Remove stem from 1 red or green Thai chile. If you prefer less heat, cut in half lengthwise, then remove ribs and seeds with paring knife. (Wear food-safe disposable gloves and be careful not to touch your eyes!) Add chile, 1 garlic clove, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt to processor; process, scraping down sides as needed, until chutney is smooth and pourable. If you prefer a thinner chutney, add ice water a tablespoonful at a time (up to 4 Tbsp.), until you reach the desired consistency.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3For the aloo tikki, place a rack in middle of oven and set a rimmed baking sheet on rack; preheat oven to 200°. Finely chop 1 large shallot, then finely chop reserved cilantro leaves with tender stems until you have ½ cup. Stack 6 reserved mint leaves and roll tightly lengthwise; thinly slice into ribbons. (This is called chiffonade.) Transfer shallots and herbs to a medium bowl.Step 4Using your hands, remove skins from cooled potatoes; discard. Grate potatoes on the small holes of a box grater directly into bowl with shallots and herbs. Add 2 Tbsp. rice flour or all-purpose flour (patties won’t be as crispy with all-purpose flour), ½ tsp. cayenne pepper (cut back to ¼ tsp. for less heat), ½ tsp. cumin seeds, ¼ tsp. ground turmeric, and remaining ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Mix with your hands or a rubber spatula until well incorporated. Turn potato mixture out onto a cutting board and shape into a 2\"–3\"-diameter log. Be firm and really pack it down—that will prevent the patties from falling apart. Using chef’s knife, cut log into ½\"-thick rounds (about 10). Coat hands with oil (to prevent sticking) and form slices into 2½\"-diameter patties.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Pour vegetable oil into a medium skillet to come ½\" up the sides. Heat over medium-high until an instant-read thermometer registers 350° (oil should be shimmering). Working in 2 batches, fry patties, turning once with a slotted spatula, until crispy and golden brown, about 3 minutes per side. (If you're having trouble with the patties falling apart, you can transfer them to the freezer until well-chilled.) Transfer to a paper-towel-lined wire rack to drain; season with salt. Transfer patties to baking sheet in oven to keep warm while you work.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Serve with hari chutney for dipping.Do ahead: Hari chutney can be made 3 days ahead. Cover and chill.How would you rate Aloo Tikki With Hari Chutney?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThese were really good, like restaurant level, crispy, aromatic, delicious. However, it was a ton of work for what it is. I would probably save this recipe for really special occasions. A couple things that will make my life easier next time: 1) DO freeze them - my first batch disintegrated (the oil wasn't quite hot enough but still, I had zero issues after freezing even if my oil wasn't ready). It takes a good hour or so for them to freeze, so I would split this into two steps - prep and freeze in the morning and fry when ready. 2) Peel potatoes before-hand (maybe this produces worse results, but I will never again waste a half hour of my life hand peeling potatoes) and use a ricer to shred the potatoes. MarcyBrooklyn, NY2/16/2022These are really good, but they were disappointingly greasy, even though I used my instant-read thermometer and made sure to bring the oil pack to 350º before my second batch. I used brown rice flour and the crunch was amazing! I wasn't great at making a tightly packed log so I took each slice and make it the way I would make hamburger patties (just compressed a lot more tightly), which worked well. Reduced the heat in the hari chutney which I wish I didn't do, since the lime juice really mellows out the heat (it was still earthy and delicious!). Reheated the leftover (already fried) aloo tiki at 325º for 15 minutes, and they got crunchy again! Delicious and glad leftovers are still possible since I couldn't eat all 10 alone!ChristinaNew York, NY5/7/2021Very delicious. My attempt didn't quite work out, because I used leftover boiled potatoes, that had been cut & peeled prior to boiling. They were too waterlogged, as a result (of course), so I had to add breadcrumbs & a couple eggs. I doubt it changed the flavor much, so I would still recommend the dish. AnonymousAustin, TX4/6/2021Followed the recipe but  I did boil the potatoes with salt! Delicious!!!\nCan the patties be made a day before and then fried the next day or at least a few hours before needed?SJZMaryland 3/8/2021I made just the tikki, not the chutney (had leftover chutney from another dish). Super flavorful and easy! I only had golden potatoes, not red and only had red onion instead of shallot, but I tried it anyway...could be the reason I had some trouble getting it all packed together...moisture content in potato type? Rice flour is a must for the crisp factor. I also added more salt than this called for. One tip - for the forming of the patties, REALLY PACK EM TOGETHER. They fall apart if you don't. Also, WAIT for your oil to be HOT HOT HOT. My later batches were TIGHTLY packed patties in HOT oil and they turned out MUCH better than my first batches (although it all tasted great). These fry up pretty quickly so the oven thing was a bit unnecessary for me. Next time, I'll add finely chopped green chilis to this for a bit more zing.SmitaMinneapolis, MN2/24/2021Explore Bon AppétitFritterPotatoVegetableRed Skin PotatoEasySideStarterSnackDairy-FreeNut-FreeVeganVegetarianRamadanBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-21", "author": ["Condé Nast", "Shayma Owaise Saadat"]}