{"id": "1dd0370764c1c53022101eb8bd3296b0", "url": "https://www.bonappetit.com/story/al-dente-potatoes", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "This Chinese Potato Stir Fry Proves That Al Dente Potatoes Are Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAl Dente Potatoes Are Delicious, and This Recipe Proves ItThis dish is reminiscent of salt and vinegar chips and tastes perfect with a bowl of rice.By Hetty McKinnonNovember 9, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailIn the food world, there is much debate over the perfect crispy roast potatoes, the silkiest, airiest mash, the creamiest gratin. I get it: A good mash can make our knees weak and crispy potatoes never fail to bring satisfaction. For much of my formative years, however, the years when I gleefully lived under the culinary sovereignty of my mother’s cooking, my idea of the perfect potatoes was very different. I lived for stir-fried potatoes.In Chinese cuisine potatoes occupy a very different role on the plate. They are generally cooked as a savory vegetable dish to be eaten with rice. My mother’s potatoes were stir-fried with chiles and green peppers, and sometimes she would pour beaten eggs over the top to make an omelet. There were other dishes too: potatoes sliced into bite-size chunks and tossed with vegetables and pork, smothered in brown gravy.In many ways understanding the joy of stir-fried potatoes asks us to rethink everything we previously considered necessary when cooking and eating these beloved tubers. Stir-fried potatoes won’t be crispy nor completely tender, but they will be ready in mere minutes and delicious in their own right.For this recipe, as with all stir-fry dishes, preparation is key. It’s imperative to slice the potatoes as uniformly as possible in order to ensure even cooking. I write this, but, admittedly, I am notorious for my haphazard slicing skills. Lucky for me I don’t mind an undercooked vegetable (I tell myself it adds texture). Yet even with my undisciplined knife skills, I resist a mandoline or a food processor and julienne by hand. It’s not the quickest or most consistent method, but it’s how my mother prepared her potatoes and I cannot resist the allure of tradition and ritual.For the most satisfying eating experience, I aim for the longest strips possible from large potatoes. Russets are perfect here, but waxier potatoes will work. Peel the potatoes—for stir-frying, the peel gets in the way of the velvety texture—and then slice lengthwise into uniform slices. Now stack the slices up into a manageable pile and slice again to make long, thin strips. (Of course, you can opt for a mandoline or the julienne attachment on your food processor if you’re not a glutton for punishment like me.) Submerge them into a big bowl of water for a few minutes to wash away the excess starch that threatens to make your potatoes gummy. This soaking step also means you can prep your potatoes a few hours in advance without fear of them oxidizing and then finish the dish off right before you’re ready to eat. (For extra insurance, add a squeeze of lemon juice or a splash of vinegar to the soaking water, then keep the cut potatoes in the fridge for up to 24 hours.) For the cooking, you want a pan big enough to toss the potatoes around. In stir-frying, movement of the ingredients is key to achieving even cooking over such high heat. A wok is perfect, but for those without one, a large, heavy cast-iron pan works just as well.The cornerstone of stir-frying is aggressive heat, so start off by heating your cooking vessel for a few minutes—wait until you see wisps of smoke lift off the surface. You’ll want to have all of the ingredients ready to go before you start cooking, an essential when a recipe comes together this quickly. After your aromatics, your potatoes will only take 4–5 minutes of tossing until they are just tender. Al dente is a good description here–just soft enough that the potato will still offer slight resistance when you take a bite. Finish with a dash of black vinegar (though white vinegar or rice vinegar would be acceptable here) for a potato dish that’s reminiscent of salt and vinegar chips but somehow tastes perfect with a bowl of rice. There are no lashings of fat, no long cook time, no golden brown edges, and no crispy exteriors. To me it’s the perfect potato dish.Get the recipe:Spicy and Sour Stir-Fried PotatoesTingly Sichuan peppercorns and tart black vinegar pack a one-two punch in Hetty McKinnon’s shredded stir-fried potatoes.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-09", "author": ["Condé Nast", "Hetty Mckinnon"]}