{"id": "1dd97f2233292bddaa673105e738c2e5", "url": "https://www.bonappetit.com/story/six-stir-fries-to-keep-summer-alive", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Six Stir-Fries to Keep Summer Alive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSix Stir-Fries to Keep Summer AliveWhether it’s a slapdash concoction born of refrigerator leftovers or a thoughtfully prepared cornucopia of proteins and veggies, stir-fries are easily one of the most lauded combos.\nPair this powerhouse mixture with summer’s long days, lazy weekends, and bright, crisp veggies, and well, you’re going to be just fine.By All-CladSeptember 16, 2018FacebookTwitterEmailFacebookTwitterEmailA great stir-fry demands a variety of texture and flavor, which is why fresh summer veggies are a must. They can be saucy or sticky. Asian flavors like rice wine, soy sauce, and gochujang, a fermented red chili paste, are important because without them, your stir-fry would resemble something more like a casserole. And casseroles are like the anti-stir-fry.The single most important element to a great stir-fry, however, is sizzle, so choose your cookware wisely. We like All-Clad D3 Compact pans and D5 collection for their fast, even heating, and exceptional searing. And heat is everything to a stir-fry—that’s how you get the good crispy bits, which, let’s be honest, are one of the best parts. See above shot for cookware inspiration.Summer may be coming to a close, but there’s still plenty of time to snag fresh loot from the farmer’s market and toss up a stir-fry combo that keeps the heat in your kitchen a little bit longer.AW, SNAP!Fresh, in-season snap peas are the popcorn of the vegetable world: crunchy, easy to eat, and delicious any time of the day. A flavorful asparagus is nothing to overlook, either. In this steak, snap pea, and asparagus stir-fry, crunchy veg is king, but when mixed with shallots and ginger, it’s easy to see that summer is alive and well. Try whipping this one up in the All-Clad D3 Compact skillet , which is great for grilling meats.A TALE OF TWO TOFUSNo matter how long you close your eyes and dream of sunbathing on the idyllic beaches of Thailand, you just won’t be transported there (we’ve tried). But with a few easy-to-find ingredients, you can whip up this spicy Thai tofu stir-fry. Peanuts, onion, and red bell pepper give the fry its necessary crunch, while basil, spinach, lime juice, and soy sauce add major flavor and additional texture. The best part is that the actual cook time is under 10 minutes and you can wow your dinner guests by flipping the dish around a few times.If spice isn’t your thing, but vegetarianism is (though meat lover’s will dig this one, too), we suggest this tofu and mushroom stir-fry that pits crispy, flavor-soaked tofu and scallions against mushrooms and ginger, all bathed in a mixture of soy sauce, rice vinegar, and rice wine. Mm-hmm, that’s right.WHERE’VE YOU BEAN ALL MY LIFE?This is not your momma’s string bean recipe (though we’re sure your mom is lovely). A simple yet extraordinary combo, this chicken green bean stir-fry gets its kicks from Chinese-fermented rice wine, and is made bright and crunchy with market-fresh green beans. A little cornstarch thickens up the sauce while a sprinkling of chopped-up cashews, sesame seeds, or peanuts delivers a ferociously textured finishing touch. Because stir-fries like this one are a bit like a one-pot meal, it’d be ideal to cook it in something like the All-Clad D5 3-Qt Saute Pan, which combines a wide base for searing and sautéing over higher heat with sloped, rounded sides to contain liquids while you're thickening up your sauce.ALL VEGGIE, ALL THE TIMEColor is key in this summer vegetable stir-fry. It’s optimal for emptying the fridge of your latest CSA farm share, with major summer players like zucchini, squash, carrots, and radishes leading the charge. A mixture of herbs is essential, too. Go all in on mint, cilantro, tarragon, or celery leaves, or just pick your favorite two and run with it.GOING GREENNot all heroes wear capes, and not all stir-fries require rice. Whether you’ve exhausted all your ideas for a summer salad or you’re just in the mood for a heartier form of vitamin K, this Stir Fried Greens with Bacon recipe is exactly what you’ve been waiting for. Use a pan like the All-Clad D3 Compact 10 inch skillet.  New contoured handles fit perfectly in hand and are securely riveted to the pan, while flared edges allow for accurate, drip-free pouring , which has a riveted matrix on the interior for natural stick resistance, and is ideal for cooking on high heat with oils for full, rich flavors (eh-hrm, that’s the definition of a great stir fry). The trick is in the timing—let each handful wilt before packing in another. Then bring it home with a secret sauce, scallions, and, of course, bacon.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-16", "author": ["Condé Nast"]}