{"id": "1ddb10f6470e77d20057b270b88add8f", "url": "https://www.bonappetit.com/story/raw-carrot-and-date-salad", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Shaved Carrot Salad with Charred Dates Will Make You Ditch Lettuce for Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Shaved Carrot and Charred Date Salad Will Make You Ditch Lettuce for GoodSometimes leafy greens just won’t cut it.By Aliza AbarbanelOctober 25, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery meal deserves a stunning centerpiece, but vegetables rarely get the glory. I get it: There’s something about a prodigious hunk of meat or platter of jeweled rice that feels festive in a way that spinach and kale simply do not. Still, I’m a vegetables-first kind of cook, which means I’m constantly searching for a high-impact dish that also helps me hit my RDA. So when I heard about this new shaved carrot and charred date salad, it was basically like finding my salad Holy Grail. And yes, I realize how lame that sounds.Take it from a true salad obsessive: This recipe is fancier and more flavorful than any of its siblings. That’s because it’s built around a base of tender-but-crisp shaved carrots, which look striking and soak up a punchy citrus dressing like a pro. Time to break out your mandoline (and finger guard!) or practice your knife skills.The second key component of this salad is citrus. Grapefruit or blood oranges would both work great here, but I went with deep purple blood oranges for a heady contrast to my orange carrots because I’m a sucker for aesthetics. After cutting the flesh off the core in lobes (a cheff-y technique called “supreming” that’s much less fussy than it sounds), I squeezed out some juice to build a zingy, bright dressing and fortified it with unseasoned rice vinegar for a little extra kick.While the carrots hung out in their citrusy bath, I moved on to the final fancy component: the blackened dates. It’s just a bit of simple charring, accomplished in a hot cast iron skillet, but the key part here is to wait until they’re cool before popping out the pits and tearing the sticky fruit into bite-sized pieces. (Learn from my mistakes and save your fingers the pain!) Then sprinkle some tarragon on top of the whole thing, because you’ve come this far.All together, this salad is a whole lot more than the sum of its parts. There’s something about the combination of crunchy carrots, soft charred dates, and a tangy-sweet citrus dressing that feels much more complex than any raw vegetable deserves to be. It’s a kaleidoscope of color and flavor that goes toe-to-toe with any hearty main—and leaves limp lettuce in the dust.Get the recipe:Shaved Carrots with Charred DatesTangy, crunchy carrots meet soft and sweet blackened dates for literally everything you want in one bite.View RecipeExplore Bon AppétitSaladCarrotDateCitrusBlood OrangeRice VinegarRead MorecookingThe Glazed Brussels Sprouts You’ll Be Making All FallBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Aliza Abarbanel"]}