{"id": "1ddd64b4548604d238c13cbd8d1069d5", "url": "https://www.bonappetit.com/recipe/granola-crumb-cookies", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Granola Crumb Cookies Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishGranola Crumb CookiesSponsored by VitamixFacebookPinterestTwitterEmailJerrelle GuyMakes about 12 cookies.These dairy-free crumb cookies with granola, almonds, cashews, and chocolate chips are both delicious and healthyish.PrintIngredients1 cup favorite cinnamon granola½ cup sliced raw almonds½ cup raw cashews½ cup dark chocolate chips (dairy-free)¼ cup almond butter¼ cup applesauce½ cup canola oil, or other neutral oil½ cup granulated sugar⅓ cup packed light brown sugar½ tsp. salt2 Tbsp. coconut milk powder1 tsp. instant coffee½ tsp. baking soda2 cups oat flourRecipe PreparationPreheat the oven to 350°, and have 2 baking sheets lined with parchment nearby.In the Vitamix A3500 Blender, combine the granola, almonds, cashews, and chocolate chips. Start pulsing at level 1 for two to three times per level through level 4 until roughly chopped. Transfer to a large mixing bowl and set aside.Back in the Vitamix Blender, add the almond butter, applesauce, oil, sugars, and salt, and blend on level 1 for 1–2 minutes until smooth. Add the coconut milk powder, coffee, baking soda, and oat flour, and blend on level 1 for one minute until a thick batter is formed. Dump the batter into the mixing bowl with the granola and nuts, and fold until combined. Using a 2\" scoop, drop mounds of cookie batter (about 3 Tbsp.) onto the cookie sheets, leaving at least 2–3 inches of space between each mound. Bake the cookies, rotating halfway through, until puffed, spread, and lightly golden around the edges, about 14 minutes. Cool slightly before serving.Sponsored by VitamixGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitVitamixSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}