{"id": "1ded433f9f6040e9c898fc260b9899cb", "url": "https://www.bonappetit.com/story/basque-burnt-cheesecake", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "A Basque Cheesecake Recipe That’s More Like a Cloudcake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Burnished, Fluffy Cheesecake That’s Closer to CloudcakeThis is the anti-cheesecake, and it’s all we’ve ever wanted.By Alex BeggsJanuary 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailMolly Baz went to Spain. She walked into a tapas spot in San Sebastian, but no one was eating the tapas. The counters and walls were filled with shelves lined with burnt parchment paper bouquets. Inside each were fluffy, custardy cheesecakes that the restaurant La Viña is famous for—the opposite of your dense, New York–style cheesecake. Like everyone else who visits La Viña, Molly came home and Googled the recipe. She had to recreate it. She had to eat it again and again.“It’s the anti-cheesecake!” She told me, frantically pulling up Google images to show me bad tourist photos taken inside the real cheesecake factory: La Viña. The stacks of cheesecakes reminded me of cheese caves, though the cheesecakes probably smell 1000x better than aging cheddar. When Molly sought to develop a recipe based on La Viña’s, she made a few tweaks. A little more flour to help the cake set fully in the center, some vanilla and salt for flavor, decreased sugar. The final recipe is jiggly and cloud-like, wet but not pudding-wet, burnt on purpose for a caramelized crust, and barely sweet.I made it this weekend, and it was the least stressful cheesecake I’d ever baked. The batter was thin and liquidy: 4 blocks of Philadelphia’s finest, six eggs, sugar/salt/vanilla, and a ton of heavy cream. It turns out mine was especially liquidy because I forgot the flour and had to take it out of the oven after 8 minutes, whisk in the ⅓ cup of flour right there in the springform pan, and put it back in the 400 degree inferno. Everything was FINE. This recipe is failure-averse: It burns in patches on purpose and looks like “my dad’s well-worn leather wallet” (per Molly), it falls dramatically out of the oven, and cracks and craggles around the parchment-lined edges. Like a galette, it’s rustic and therefore perfectly imperfect. It forgives you for your sins. I need that kind of cheesecake in my life.And most important, you serve it with sherry, the best dessert beverage, according to me. The sweet, raisin-y fortified wine takes you back to Spain (even if you’re never been), and its subtle creaminess falls into line with that creamy, light cheesecake. Also: you eat the cake at room temperature so it melts in your mouth, a different experience from that icebox-chilled cheesecake you’ve known before. Isn’t it nice to make new friends?Get the recipe:Basque Burnt CheesecakeThis is the light, fluffy, cloudlike cheesecake that wants to get burnt, cracked, and cooked at high heat. Which also means this is the cheesecake that’s impossible to mess up.View RecipeExplore Bon AppétitWeb RecipeCheesecakeSpanishDessertCream CheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Alex Beggs"]}