{"id": "1dee90f9f3bf5c8e20472e3e87d14194", "url": "https://www.bonappetit.com/story/outdoor-entertaining-essentials", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "The 11 Outdoor Entertaining Essentials That 'Bon Appétit' Editors Swear By | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll the Outdoor Entertaining Gear You NeedThis summer’s hottest club is your own backyard.By The Bon Appétit StaffJune 9, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Outdoor entertaining season is upon us! Time to slap on the sunscreen, fire up the BBQ, and assemble a summer bop-heavy playlist to blast on your Bluetooth speaker. What’s that, you say? Your sole outdoor space is a 3-by-3-foot patch of dead grass or a rusty fire escape that’s technically only supposed to be used in case of an emergency? We can work with that. We’ve rounded up our editors’ favorite outdoor entertaining essentials—from space-saving patio furniture to home decor that can be used outside or in—that will transform any backyard/driveway/patch of park grass, no matter how modest, into the place to be all summer long.Colorama BowlsWe love enamelware, but sometimes that classic speckled finish can look a little Maine-cabin-in-the-woods-circa-1932, a great vibe, to be sure, but perhaps not appropriate for every soiree. These bowls, handmade in Turkey, feature bubbly, modern color combos like coral and flamingo pink that will brighten up any tabletop. Snag the matching dinner plates and tumblers for a full alfresco dining set.Photo by Balarama HellerColorama Bowls$16 at Coming Soon New YorkDeparto Folding Cafe TableNo room for a full-size outdoor dining table? This three-legged café table made of ash, steel, and linoleum folds flat for easy storage and comes with a leather strap so you can hang it out of sight when not in use.Departo Folding Cafe Table$345 at West ElmSolo Stove Fire PitWhat outdoor bash is not improved by a fire feature? Senior commerce editor MacKenzie Chung Fegan got her mom a Solo Stove last year after tiring of excuses about how it was “too cold” to host friends in the backyard and therefore needed to hang indoors during a pandemic. The Bonfire—Solo Stove’s medium-size fire pit—is dead simple to use, throws great heat, and is almost entirely smokeless. Although the Bonfire isn’t suitable for grilling, it’s perfect for roasting weenies or toasting marshmallows for s’mores.Photo courtesy Solo StoveSolo Stove Bonfire Fire Pit$300 $255 at Bed Bath & BeyondMetal Slat Patio Folding ChairsBecause you can always use extra seating, especially in cheery cobalt. These lightweight metal chairs fold flat and are rust-resistant, so no need to worry about passing summer thunderstorms. There’s also a matching 20-inch folding bistro table if you want to go all in on blue.Metal Slat Patio Folding Chairs$35 $30 at TargetSkeem Design Citronella CandleThese triple-wicked candles smell so good that editor in chief Dawn Davis would still use them even if they didn’t keep mosquitoes away. That they contain citronella, a natural repellent made from lemongrass, is icing on the cake. Dawn is partial to the sea salt and eucalyptus scents, which keep her outdoor area bug-free for up to 80 hours.Photo by Emma FishmanSkeem Design Citronella Candle$46 at NordstromStargazer Garden LightsString lights can transform even the drabbest outdoor space into something a little lovelier, but if your backyard really needs help, reach for a multicolored set. These 21 LED bulbs come in a spectrum of warm hues from cantaloup to tomato red. (Note that the compatible light socket strand for these bulbs is sold separately.)Stargazer Garden Lights$58 at TerrainDuraClear Tritan Double Old-Fashioned GlassesNothing ruins a pool party like a minefield of broken glass, so stick to drinkware that won’t shatter. This set of six multicolored glasses is made of super durable Tritan plastic, and they’re also dishwasher-safe, BPA-free, and won’t cloud or discolor.DuraClear Tritan Double Old-Fashioned Glasses$80 at Williams SonomaPermasteel 80-Quart Rolling Cooler CartWhen former social media manager Emily Schultz is expecting a crowd, she wheels out this bar cart/cooler that can keep 110 bottles of beer and cans of the White Claw flavor of her choice (it’s black razz) cold for up to 36 hours. She loves that it has a built-in bottle opener and cap catcher. That means she isn’t sweeping up errant bottle caps post-party.Photo by Emma FishmanPermasteel Rolling Cooler Cart$194 at OverstockPineapple StoolThis is a stool shaped like a pineapple. Fifteen inches high and made of molded resin, it’s fit for outdoor use but would also look pretty fab as a living room side table. Use it as extra seating for when a friend brings a surprise plus-one to your dinner party or to hold a serving tray of sliced pineapple. Meta! The perfect conversation starter—and after a year of socializing with the same three people, we need all the help we can get.Photo courtesy Coming Soon NYPineapple Stool$250 at Coming Soon New YorkUtilitario Mexicano Aluminum TumblersArt director Christa Guerra purchased these handmade aluminum tumblers in Mexico as a “gift for her boyfriend,” but somehow they’ve found a permanent home in her picnic bag. They’re her on-the-go wine glasses, but they’re also cute enough for use at home as part of a real table setting. Christa recommends grabbing a few in different colors so the guests at your next outdoor party can remember whose cup is whose.Photo by Emma FishmanUtilitario Mexicano Aluminum Tumblers$10 at Utilitario MexicanoURI Portable Table LampDaylight hours during summer are longer, but they’re not infinite—so make sure your outdoor entertaining lighting plan is in place before nightfall. This rechargeable lamp delivers up to 20 hours of gentle light and can be dimmed or brightened as the mood requires. Set it on a picnic table or hang it from a tree branch by its colorful handle. Also cute for camping!URI Portable Table Lamp$50 at MoMA Design StoreExplore Bon AppétitShoppingEntertaining + StyleSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-09", "author": ["Condé Nast", "The Bon Appétit Staff"]}