{"id": "1df55e984d7b49b1628a47ee0afb9c57", "url": "https://www.bonappetit.com/recipe/swiss-chard-beer-garden-salad", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Swiss Chard Beer Garden Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSwiss Chard Beer Garden SaladBy Ali Slagle February 8, 20214.3(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintSwiss chard is the star of this salad that is full of attention-getters. The dark leafy green is silky like spinach but has chew like a gentler kale as well as edible ribs and stems with celery-like crunch. Among the ribbons of Swiss chard, you’ll find briny, salty pops of mustard-macerated onions, aged or sharp cheddar, and crushed pretzels. Not intended to be confused with Wurstsalat, the southern German salad that features sausage, this recipe is instead an ode to the flavors often found at beer gardens—okay, minus the beer. Use large hard sourdough pretzels or nuggets, which have a good amount of dry interior, ideal for soaking up dressing.Ingredients4 servings4Tbsp. (or more) extra-virgin olive oil, divided8oz. kielbasa sausage or bratwurst, sliced ½\" thick3Tbsp. (or more) apple cider vinegar2Tbsp. whole grain mustard½tsp. sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus moreFreshly ground black pepper1small red onion, thinly sliced into rings1bunch Swiss chard, trimmed1cup coarsely crushed hard sourdough pretzels2oz. aged or sharp cheddar, coarsely grated (about ½ cup)PreparationStep 1Heat 1 Tbsp. oil in a large skillet over medium-high. Add kielbasa in a single layer and cook until lightly browned on both sides, about 2 minutes per side; set aside.Step 2Whisk vinegar, mustard, sugar, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large bowl until sugar and salt are dissolved. Add several cranks of pepper, then mix in red onion and set dressing aside.Step 3Roll up a few Swiss chard leaves and thinly slice crosswise ¼\" thick (stems, ribs, and all). Repeat with remaining leaves.Step 4Add pretzels to bowl with dressing and stir once to coat. Add Swiss chard and remaining 3 Tbsp. oil, season with salt and pepper, and toss to combine. Add cheddar and reserved sausage and toss once more to incorporate. Taste and add more oil, vinegar, and/or salt if needed.How would you rate Swiss Chard Beer Garden Salad?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSpatzle Judith I live for you; thank you so much for your insight and expertise. Spatzle Judith STANFlorida1/9/2022This was unbelievably sour and gross. Anonymous10/22/2021Im sure this salad tastes great but it is the direct antithesis of beer garden culture. ill give it a try but make some adjustments:\n- real (soft, yeasty) pretzels\n- butter instead of olive oil\n- lamb's lettuce instead of swiss chard (much too french and lamb's lettuce has more crunch)\n- Thüringer Rostbratwurst because it's simply the best bratwurst. \n\nIll let you know hot it went :)\nJudith from Swabia \nSpätzleJudithSwabia, Germany4/8/2021This salad is fabulous! I subbed in Field Roast Italian Garlic & Fennel (plant -based) sausage to make it vegetarian. Delicious! Ana2/9/2021Explore Bon AppétitSaladSwiss CheeseCheeseKielbasaSausageMeatCheddarEasyQuickWeeknight MealsMainSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-08", "author": ["Condé Nast", "Ali Slagle"]}