{"id": "1df7d71368cece95a25f2a47881245ed", "url": "https://www.bonappetit.com/recipe/crunchy-baked-saffron-rice-with-barberries", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Crunchy Baked Saffron Rice (Tachin)  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCrunchy Baked Saffron Rice with Barberries (Tachin)By Andy BaraghaniJanuary 9, 20184.7(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintAlso known as tachin, this crispy baked Persian rice is often layered with meat, dried fruit, spices, and presented in a rectangular shape. We omitted the meat to keep things simple and went with a round shape to change things up. Rinse the rice to keep it from getting gummy, and parboil it so it will be soft and tender after baking. The yogurt, eggs, and oil are what create the golden color and crispy texture, which will have you coming back for bite after bite.Ingredients4 servings2teaspoons kosher salt, plus more2cups basmati rice2tablespoons unsalted butter½cup dried barberries or 1 cup dried tart cherries1teaspoon rose water (optional)1teaspoon saffron threads, finely ground3large egg yolks1cup plain whole-milk yogurt (not Greek)½cup grapeseed or vegetable oil, plus more for dishPreparationStep 1Bring a large pot of water to a boil and add 2 large palmfuls of salt (about ½ cup). While you’re waiting for the water to boil, place rice in a strainer or sieve and rinse with lukewarm water, swishing rice around with your hands to get rid of excess starch. Continue to rinse until water from rice runs clear.Step 2Add rice to pot and give it a few stirs to prevent rice from sticking to the bottom. Cook, stirring occasionally, until rice begins to rise to the top and is tender but still has a slight bite to it, 6–8 minutes. Drain and rinse with cold water.Step 3Meanwhile, melt butter in a medium skillet over medium-low heat. Cook barberries, stirring often, until plumped slightly and warmed through, about 2 minutes. Remove from heat and stir in rose water, if using.Step 4Place rack in lower third of oven; preheat to 400°. Combine saffron and 2 Tbsp. hot water in a large bowl. Let sit 10 minutes to allow saffron to steep and draw out as much color as possible. Mix in egg yolks, yogurt, ½ cup oil, and 2 tsp. salt. Scatter rice over yogurt mixture and gently toss to ensure every grain is coated.Step 5Coat a 10\"-diameter glass pie dish with oil (glass lets you check on the color from underneath). Add half of rice mixture and use the palms of your hands or a measuring cup to gently pack and compact rice into dish. Scatter half of barberries over and top with remaining rice. Press down again, this time more firmly (this helps with unmolding).Step 6Cover dish tightly with foil and bake until rice on the bottom and around edges is a deep golden brown, 65–80 minutes. Let cool 10 minutes; discard foil. Loosen the rice around the edges using the point of a knife. Place a large plate on top and invert rice onto plate like a cake. Scatter remaining barberries over top.How would you rate Crunchy Baked Saffron Rice with Barberries (*Tachin*)?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleOne of my favourite dishes to make! I love the smell of saffron and this recipe is so simple yet rich and satisfying. It's one of my go to dishes to make during the holidays and becoming a personal traditionAndyBonandyUK12/25/2021I absolutely love this recipe.  I'm making it again this weekend.  The video made the recipe so much easier for me to make it accurately.  Bravo!!  Julie Boise, Idaho6/19/2021Just made this and our family thought it was delicious.  Had 7 people over for dinner so doubled recipe and made it in 2 dishes.  One recipe would have been enough but now we have leftovers! Served it with grilled fish but tonite leftovers will be used with a Persian inspired quince and lamb braise.\n\nDefinitely use saffron for this dish.  It was so easy to get a crust on the rice which isn't always so easy with the other methods of making Tachin.  And it came out of the glass dishes super easy.   Added the golden raisins along with barberries as Andy did in his video.  And you really should watch the video for details of the technique (like grinding saffron in mortar and pestle and then adding the hot liquid to steep).Amy SSanta Monica, CA5/11/2021Does anyone have any suggestions for replacing the egg yolks to make it vegan?AnonymousSydney6/27/2020Saffron has been linked to several other potential health benefits, such as improved heart disease risk, blood sugar levels, eyesight, and memory. However, more studies are needed to draw stronger conclusions.\nزعفرانیکZafaranicIran5/15/2020It was surprisingly easier than expected and the flavor was delicious. Would definitely make again, another sure fire recipe from Bonappetit.com AnonymousHaw River, NC 5/13/2020First time trying and attempting this dish! Made it for my family and they loved it as much as I loved making it. I did however double the amount to serve 8 instead of 4 and found that I didn’t really have to use 6 egg yolks to double 4 did the job really well! With some grilled chicken on the side, all the flavors combined nicely. Thanks for the recipe!! ShammaDubai 3/18/2020This looks so delicious, but I'm rationing eggs and dairy during the COVID 19 pandemic, so it'll probably be a while before I make it. Something to look forward to!AnonymousDallas, TX3/17/2020I followed the recipe exactly and found it to be too salty, but otherwise too bland. Next time I will reduce the salt and I think I will add chopped dates, chopped chicken, and maybe an additional spice. (Still trying to identify the best spice to add. Maybe sumac? za'atar? lemon zest? cumin?).  Another option would be to reduce the amount of rice in the mixture.Jean-ClaudeChesterfield, Missouri3/10/2020I subbed dried cherries for the barberries and added toasted macadamia nuts. Really good! Next time, I will use cranberries b/c the cherries were black and I think cranberries would be prettier. I also may try to mix in the raisins, cranberries and nuts so that they are distributed throughout, and I'm going to try it with brown rice. The video was super helpful - watched it several times before attempting. And that Andy guy is fun to watch. thanks for a great recipe!Anonymoushonolulu3/9/2020I used coconut cream mixed with lemon juice instead of yogurt (I know, I'm sorry but I really can't digest dairy) and it came out amazingly. AnonymousToronto3/6/2020Very good recipe. Also, to the person who said \"the saffron alone is $40.\"  Really? 1 tsp of saffron threads is exactly .72 grams.  10 grams (14 servings) of Persian Saffron is $50.  So, yes...it's an expensive spice; however, it's under $4.00.Anonymoustampa, fl11/11/2019Wonderful, but even better with chicken. And how about with chicken with biryani flavorings? And the ultimate, with lamb biryani filling?!?AnonymousSan diego8/29/2019This is so delicious.  The only reason I knocked off a star was because the amount of saffron would cost about $40 and that is just not reasonable.  I use what comes in the package and that works.  I would LOVE to use an entire teaspoon of saffron as it is my all time favorite spice but it is just too much money. AnonymousNapa, CA8/24/2019This was SO GOOD. It does call for a lot of saffron but it is an absolute requirement for the full experience of the dish. The flavor is complex and rich even though the only real seasoning besides salt is the saffron. I actually did not add the barberries, so for me it was just the saffron rice mixture. I split the rice mixture among a pie pan and 2 medium Pyrex containers, and it turned out great and allowed me get more of the delicious crust. Bake until you get the beautiful golden crust shown in the video; I would not rely too much on the cooking time alone since ovens and baking dishes vary. Best eaten warm, but it's still delicious after a day or two.cynthiaaagghhMissouri, USA8/17/2019Explore Bon AppétitPersianMiddle EasternSaffronHerbs & SpicesDried CherryDried FruitFruitRiceRice & GrainsYogurtOther IngredientsSideGluten-FreeNut-FreeVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}