{"id": "1e08f205da6d9dc14c7f2614660d5042", "url": "https://www.bonappetit.com/recipe/almond-and-raspberry-swirl-ice-cream", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Almond and Raspberry Swirl Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueAlmond and Raspberry Swirl Ice CreamBy Sarah JampelJune 2, 20204.5(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis beautifully swirled no-churn ice cream reminds us of berries and cream. If you don’t have almond extract and don’t want to go to the store, vanilla extract or vanilla bean paste will make a good substitute.IngredientsMakes about 2 quarts3cups (600 g) fresh raspberries2Tbsp. sugar1tsp. kosher salt, divided114-oz. can sweetened condensed milk1tsp. almond extract2cups heavy creamPreparationStep 1Bring raspberries, sugar, and ¼ tsp. salt to a simmer in a medium saucepan over medium heat and cook, stirring often, until raspberries begin to burst and lose their shape, about 4 minutes. Strain through a fine-mesh sieve into a large measuring glass, pressing on solids; discard solids. Pour back into saucepan and return to medium heat. Cook, stirring occasionally, until sauce is thick enough to coat a spoon, 10–15 minutes. (You should have about 6 Tbsp.) Transfer back to measuring glass and chill until cold, about 30 minutes.Step 2Mix condensed milk, almond extract, and remaining ¾ tsp. salt in a medium bowl to combine.Step 3Using an electric mixer, beat cream in a medium bowl, starting on low speed and gradually increasing to medium-high as it thickens, until billowy and stiff peaks form, about 4 minutes.Step 4Add a dollop of whipped cream to condensed milk mixture and mix in with a rubber spatula (this is just to lighten it so that the next stage—folding—is easier). Add remaining whipped cream; fold in, running spatula down sides and along bottom of bowl, then lifting up through center and over top while rotating bowl to integrate without deflating, until very few streaks of condensed milk mixture remain.Step 5Scrape about one third of ice cream base into a loaf pan that’s at least 8½x4½\". Drizzle over one third of raspberry syrup. Repeat layers 2 more times, ending with raspberry syrup (no need to be precise). Using a small offset spatula or butter knife, make figure-eight motions through ice cream base to swirl raspberry syrup throughout. Cover with plastic wrap or an airtight silicone lid and freeze until solid, at least 8 hours.Step 6To serve, transfer loaf pan to refrigerator and let ice cream soften 10 minutes before scooping into bowls.Step 7Do ahead: Ice cream can be made 1 week ahead. Keep frozen.How would you rate Almond and Raspberry Swirl Ice Cream?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI have made this many times with many different flavours. I have made birthday cakes in a spring form pan, using 4 flavours in layers, “icing” it with Nutella.  A big hit with my granddaughter.  I also use 3 cups of whipping cream instead of 2 and it is not as sweet.  I divide each batch into 2 and flavour them differently.  One I did was a chocolate hazelnut “cake” very yummy!\nAnonymousCanada11/17/2020Awesome recipe and super easy. I definitely suggest cutting down the salt also. Next time I will try it with orange juice and add the zest. Jennifer APasadena 9/8/2020Made this today, and followed the recipe to a T, with the exception of reducing the salt to 3/4 tsp total (based on that one bad review).  6 hours later, it’s ready to eat, and totally delicious.  Would make this again, and am looking forward to using the basic recipe with other flavours.  The smooth texture of the ice cream and the tartness of the raspberries almost gives it a cheesecake-like quality.. will try it with strawberries next and maybe mix in some shortbread crumbs!AnonymousToronto, Canada7/13/2020I made this recipe with my ten-year-old son because the idea of making ice cream at home without an ice cream churned appealed to us. The raspberry sauce turned out nicely. It was the perfect gelled consistency for swirling. Using a butter knife as the recipe suggested, my son was able to achieve a terrific swirled effect throughout the white base.\n\nThe fault of the recipe lies in the salt content. 1/4 teaspoon of kosher salt in the raspberry reduction made sense. No doubt it brought out the natural flavor of the fruit without leaving any trace of saltiness in the swirl. However, 3/4 teaspoon kosher salt in the ice cream base ruined this recipe. My son and I followed the recipe verbatim. (We did substitute the almond extract with vanilla as suggested above.) It froze well and scooped nicely after the brief thaw in the refrigerator. It looked and had the texture of conventional, churned ice cream. The problem was that every taste was overwhelmed by saltiness. I was concerned about that 3/4 teaspoon when I read the recipe, but I pressed on.\n\nMy son was wholly disappointed, but he embraced the idea of this being a setback as opposed to a failure. I checked the ‘Will make again’ option because eliminating the salt called for in the base (or reducing it to something nominal like 1/8 teaspoon) should solve this problem. However, at $4.99 for the four 6-ounce containers of raspberries needed for the swirl, I would have liked Bon Appetit to have saved me the trouble of making this twice in order to have one edible batch by recipe testing this ice cream effectively.jgr9778817Chicago, Illinois7/3/2020Was honestly shocked how well this worked and how delicious it is. It is sweet, but I don't mind :)\nAlso, is there any reason you can't continue to use the mixer once you add in the condensed milk? I would think it would continue to aerate rather than deflate the whipped cream.AnonymousDC6/22/2020Really good. So easy. Looks beautiful! The ice cream kind of tastes like frosting on its own - the swirl of fruit really is what makes it delicious. I had rhubarb on hand and did a rhubarb swirl instead of raspberry. Anonymous6/19/2020What a delicious treat --- melted in our mouths.  Placed one scoop over a Pavlova, and we all felt we had gone to heaven!!!!  Try it! Anonymous782576/15/2020amazing texture but WAY too sweet - also didn’t seem to be enough fruit throughout ! is there a way to lighten the sweetness ? would substituting half of the condensed milk for more heavy cream change the texture ? Anonymouscalifornia 6/14/2020Very easy - I used slightly more almond flavoring. I had extra raspberry syrup leftover that I'm using on yogurt, but next time will use more with the ice cream.mastolzeIllinois6/12/2020This came out beautifully. I used Vanilla Bean instead of almond, but still incredible. It took longer than 8 hours to freeze, but that may have been our freezers fault. The raspberry was bright, the cream silky- and the recipe was SO. EASY. emmykSeattle6/8/2020Explore Bon AppétitFrozen DessertDessertIce CreamRaspberryBerryFruitSummer5 Ingredients or FewerEasyGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}