{"id": "1e09a73d444370755ddd93931c50fbd3", "url": "https://www.bonappetit.com/story/sierra-tishgart-great-jones-cookware", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "How I Went From Writing About Food to Founding Great Jones Cookware—And What Was I Even Thinking? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Left My Dream Job to Make Pots and Pans. What Was I Even Thinking?Great Jones co-founder Sierra Tishgart abandoned everything she knew to start from scratch.By Sierra TishgartMarch 5, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailFor more than five years, I spent my days running around New York City’s boroughs, interviewing chefs, ranking the best ice-cream sundaes, and attending restaurant openings. I was a food writer and editor at New York Magazine, a total dream job.Then, about one year ago, I left it all behind to start a kitchenware company with my friend of 20 years, Maddy Moelis. It took us nine months to build Great Jones, which we launched in November, and my job suddenly entailed designing handles, sourcing factories, and trying to convince total strangers to invest millions of dollars of their money.How did I end up here, you might be wondering? Some days, I still wonder that myself.It all started with a simple desire to become a more confident cook. All kinds of things were holding me back—an insistence that I was just “too busy”; my dependence on delivery pad Thai—but a lack of dependable pots and pans was chief among them. So I looked into purchasing a few pieces of cookware that would last and also look nice—something that would motivate me to cook more. The choices were overwhelming. Why did one brand sell dozens of “different” stock pots? Carbon steel or cast-iron? The “perfect” collection would include 20 different pieces and cost well over $1,000. Why did this feel so complicated? Why wasn’t there a new brand that had modernized this? With the direct-to-consumer revolution underway, surely someone was going to do this soon. I could imagine myself writing a story about this kind of company. And then I thought I could start this kind of company.I invited Maddy—my brilliant friend who had built her career in the startup space as an early employee at Warby Parker and Zola—over to my apartment for dinner. We started brainstorming. Together, the thought evolved from, Someone is going to do this, to, Why shouldn’t it be us?Three months later, Maddy left her job. Nervous, I stalled. As excited as I was, I wasn’t sure if I was ready to give up my work—a key part of my identity for as long as I could remember. I worried people only knew me as, “Sierra from New York Magazine,” and that I was nothing without it. Was I ready to leave a career I loved, after years of working to achieve senior-editor status (never mind journalism school), to prioritize something I had no experience doing at all? And then all the other questions and doubts popped up: Would anyone take Maddy and me seriously? When could we feasibly launch a company? How would we pay for it? And on an even finer point, if I left my job, how would I pay for my life in New York?I had benefited for years from the support of my family (financially, emotionally), but they didn’t want to fund what they saw as a free-fall. I had saved up enough for a few months of rent and living expenses, but I couldn't take the plunge without taking in a small salary. Maddy and I decided to see if we could raise venture money instead of bootstrap our business.We spent a weekend making a preliminary pitch deck—it had title “Cookware Company” because we didn’t even have a name—and sent it around to friends and family for feedback. It was easier to put financial parameters around this choice, rather than make it purely emotional. If we got a few bites from interested investors, we’d move forward.The thing about raising money is that people rarely turn you down outright; they just keep you on ice. It’s like dating someone awful. Someone told us to start a blog instead of designing products. One investor asked me to return once I had quadrupled my Instagram followers. Two grown men spent a whole meeting referring to us as “the girls.” But there was a lot of good feedback from people who mattered: Nic Jammet, co-founder of Sweetgreen, encouraged us to emphasize the educational component of the business. Steph Korey, the CEO of Away, loved our idea and said we should move quickly. Their votes of confidence gave us the push we needed. I felt ready to take the plunge.The full range of Great Jones pots and pans.\nPhoto Courtesy of Great JonesI started sketching designs, dreaming of color palettes, and writing down ideas for campaigns. Maddy sent a survey to hundreds of our friends quizzing them on their purchasing habits, their ability to recall brands, and their “pain points” in the category.Priorities started to emerge: Craft a more comfortable handle. Weld that handle, so food doesn’t get stuck in rivets. Make sure that handle doesn’t get hot. Create space-saving solutions. Cross materials (offering a mix of ceramic nonstick, stainless, and cast-iron enamel), but keep the look of the collection sleek and consistent. It was also important to us to make sure that as much as our designs were functional, that they were beautiful too.Through a friend of a friend, we met a husband-and-wife industrial design team who helped us translate our vision into renderings on a computer screen. It happened that the designers were also looking to leave their full-time jobs to go freelance and establish themselves. We selected them over more veteran designers who talked down to us; it was powerful to feel we could grow and prove ourselves together, and that outlook has informed all of our hires since.Together, we agonized over handle grips and colors and the curves of the bottoms. It was a seemingly endless process in which we learned a hard lesson that you can never please everyone. It was tough to figure out when to take a poll of the masses, when to consult the chefs in our network, and when to simply trust our own instincts. Ultimately, starting your own company means getting comfortable with decisions being highly personal and selfish, which makes launching all the more vulnerable.After four months, we completed our renderings. Hooray! They looked so lifelike investors thought we had already gone into production. But we landed on designs that required a completely custom build—something, we only learned then, that was actually quite rare. Many cookware companies, especially startups, say to factories, “We’d like this preexisting base and that standard handle.” Here we were trying to break the mold. A major concern lurked: Would any factory agree to bring our designs to life?We obsessed over getting the handles just right.\nPhoto Courtesy of Great JonesCookware is made all over the world, in thousands of different factories. We not only had to find one we liked—that adhered to our high standards for quality and ethical labor—but that liked us in return. After all, it’s a risk for any factory to take a chance on a new business, and were told the optics of us being two young women, with no cookware-making experience, didn’t exactly help our cause. We kept hearing that we needed male translators to act as a buffer between us and the factories.We had to track down total strangers and convince them to talk to us. We took deep-dives into manufacturers, walked the floors of international housewares shows, and milked our networks. Similar to fundraising, having access to the right partners (and convincing them to take a chance on you) is a real privilege, and our connections opened doors for us. David and Grace Chang introduced us to a friend in Hong Kong who introduced us to a friend who introduced us to a friend who owned a factory. One potential investor passed on giving us money, but introduced us to his cousin, a cast-iron specialist.Maddy and I planned a trip to Hong Kong and China so we could closely vet our leading choices. It would be a dozen or so visits in a week. A whirlwind. Then, right before we left, we learned it was customary for us present business cards. Our first afternoon overseas, we rushed to find a printer to make ourselves seem more legitimate and show cultural respect. On our tours, we inspected not only how they produced their cookware (some factories make pots mostly by hand; others are filled with robots), but also how they treated their teams. They studied us in return. I remember standing inside an enormous room in a factory, looking around at all the equipment, and thinking, in astonishment, I used to be a writer. It felt like a distant life I panicked I’d never be able to revisit.Emotionally, this was the hardest time for me. It was filled with uncertainty and self-doubt; I had no idea if or when or how our designs would get made, and as a result, I was too nervous to share the idea with anyone. Everything was happening in secret, and I felt embarrassed to talk about something that didn’t exist yet. Instead, I was evasive (at parties, my annoyed fiancé would sometimes interject, “She’s trying to be a pot dealer!”). As a classic oversharer, it was all so isolating.It didn’t help that a lot of my contacts in the food world ghosted me after I left New York. And as I asked chefs for input and advice and sometimes investment money for Great Jones, I knew I was compromising source relationships I couldn’t recover. I felt particularly vulnerable; I didn’t realize how much my sense of self-worth and satisfaction relied on my work being consumed by the public. I didn’t know how long it would take until I felt proud of myself and my work again. In darker moments, I wondered what the hell I would do if we failed, as most startups do.After weeks of debate, we settled on two factories: one that specialized in cast-iron enamel Dutch ovens, and another in stainless steel and ceramic nonstick. At the latter, we saw an entire room dedicated to stress-testing that looked like a Pixar lab (think: a sponge rubbing a pan on loop to make sure it doesn’t scratch). We met a woman named Yuki who believed in us and clearly treated her team with respect and kindness. Above all, we felt convinced because these factories didn’t just agree to make our custom designs—they seemed excited about how we had innovated.The next step was to test out our samples at home. We roasted lamb ribs, seared salmon, and flipped blueberry pancakes. Then, we handed off our samples to trusted friends. My butcher at Hudson & Charles took a Dutchess home in her Citibike; Missy Robbins worked our stainless pieces on the line at Lilia. We conducted infrared thermography testing to make sure our handle dissipated heat and stayed cool to the touch. We had a third-party lab test our welded handles to ensure they supported at least 85 pounds of weight.Maddy and I are both perfectionists—an attribute that any entrepreneur will tell you is a serious detriment. We both wondered: When do you stop testing? It could go on forever in the name of creating a perfect pot. But we had the added challenge of a looming deadline: We wanted to launch before Christmas. With gifting season in full swing, it would mean a strong start for Great Jones.Then came the moment of panic. We realized we needed to shorten the handle of our Small Fry so it had better weight distribution, but if we made this change, we would have to push back our launch. That would mean we’d likely miss our holiday shipping cutoff. We reluctantly decided to wait. But then, in an act of luck or goodwill or who knows, Yuki agreed to rush a small order to us. We were back on track.The mold for our enamel cast-iron Dutchess!\nPhoto Courtesy of Great JonesAll these months, while we worked on our physical products, we were also bringing a living, breathing brand to life. Naming the company was particularly challenging; Great Jones is actually a nod to the cookbook editor Judith Jones, as well as the New York street. (We designed a logo inspired by 1970s New York typefaces.) We wanted Great Jones to feel as warm, nostalgic, and joyful as opening your favorite vintage cookbook—an ode to the past instead of a “disruptive” future. All this we had to keep under wraps too.Finally, in September, six weeks before our launch date, we posted our teaser site and started sharing a peek of our designs on social media (it was basically a cookware striptease). I braced myself for the worst of internet trolls. We threw a Jewish brunch-themed party that felt like a hallucination: friends cooking and gathering around our collection, just as Maddy and I had imagined from day one.The night before our official launch, we very quietly pushed our site live, just to make sure it didn’t crash. The team had grown from just Maddy and me to a group of five, and we were all in the office, nervously eating Superiority Burger and clicking around. Suddenly, we received a notification! Someone had placed an order. It wasn’t my mom or Maddy’s mom or any of our moms. It was a total stranger. Our first customer.Explore Bon AppétitToolsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-05", "author": ["Condé Nast", "Sierra Tishgart"]}