{"id": "1e12a8a3321a4d37a3101ac50628c9ab", "url": "https://www.bonappetit.com/story/bread-lame", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "This Bread Lame Takes the Stress Out of Scoring My Homemade Loaf | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Little Tool Takes the Stress Out of Scoring My Homemade BreadLet’s be real: Scoring is still scary, but it’s infinitely easier with this double-sided lame from Baker of Seville.By Aliza AbarbanelJuly 23, 2020FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I got into sourdough for the stress relief. I love watching my starter balloon in size, squishing dough between my fingers, and gently poking a shaped loaf to see if it’s proofed. There’s only one part of the process that I dread: scoring the dough.Scoring, a.k.a. cutting the surface of the dough, is the very last step before baking. Slashing holes into the airy dough I spent hours nurturing is nerve wracking, but necessary: The oven’s intense heat prompts yeast to undergo a final burst of fermentation, forcing the dough to spring up and expand. The weakest spots on the dough’s surface are prone to bursting open, so slicing the dough encourages the bread to grow through those openings instead of erupting into weird, uncontrollable rips.At first, I used a sharp kitchen knife to quickly slash a gratuitous line atop my shaped loaf before baking. It worked, but it made my novice attempts at scoring even more challenging. Instead of yielding smooth slashes that would curl upward into prized raised areas of crust (called “ears”), it ungracefully tugged down at the dough, which risked deflating the air bubbles and creating a dense, stodgy loaf. I’m sure a more practiced baker could make the Mona Lisa of bread armed with just a kitchen knife, but my admittedly beginner technique wasn’t up to the task.After a few months, I decided to invest in a lame from Baker of Seville on Etsy. A lame is basically a razor attached to a long stick, and it's the instrument of choice for many professional bakers. Unlike my trusty chef’s knife, which pulls double shifts chopping onions and carving roast chickens, a lame’s single-use nature means it stays sharper. The curved edge encourages flaps of dough to form into ears, while the straight side creates decorative detail cuts. If I’m going to spend six hours kneading, folding, and generally babying a big lump of dough, I want it to look good! Crucially, the long, slender handle provides more control, which goes a long way towards reducing my self-injury anxiety.The dazzlingly skilled bakers of Instagram use lames to create delicate monstera leaves, intricate self-portraits, and constellations, all enshrined in gluten. I’m still sticking to the basics, but my double-sided lame has helped me pick up some new tricks. Each loaf is a little prettier than the last, and I’m even gathering my nerve to attempt some leafy tendrils. Scoring is still the most stressful part of making bread, but now I have something that makes it a little easier.Buy it: Baker of Seville Bread Lame, $22 on EtsyAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingBreadRead MorecookingThe Secret to My Award-Winning Bread is a $4 Foil Roasting PanBy Emma BarkerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-23", "author": ["Condé Nast", "Aliza Abarbanel"]}