{"id": "1e39d8199299de531aba2d65aa4ebfdf", "url": "https://www.bonappetit.com/story/problem-with-chicken-breast", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The More Boneless, Skinless Chicken Breasts I Sell, the Worse I Feel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe More Boneless, Skinless Chicken Breasts I Sell, the Worse I FeelFor whole-animal butcher Sophia Hampton, this ubiquitous cut of meat is actually the most problematic item in the case.By Sophia HamptonMay 9, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf there’s one guarantee when I show up for a day of work at Hudson & Charles, the New York butcher shop where I’ve worked for over a year, it’s this: I will put boneless, skinless chicken breasts in a plastic bag, weigh them out, slap them with a price sticker, beep them through a POS system, and sell them to a customer. Following this transaction, this very normal and common occurrence, I ask if she wants a receipt. I say, “Have a good one,” instead of, “Have a nice day.” I watch the customer walk out the door. A green compostable shopping bag that she will not compost hangs from her arm, weighted down by her purchase.Sorry, did that come off as snide? Judgmental, perhaps? What did Chicken Breast Woman do to deserve such a particular size up? She was nice. She even looked up from texting to place her order, and asked me how my day was going. It didn’t matter, though. I had already written her off the moment she asked for the slimy, conformable lobes of nude poultry, now jiggling helplessly in their baggie as they move toward their certain fate as protein strips on a salad.These shapeless blobs are a staple of the American diet. When it comes to chicken, the most popular animal protein in America, most people prefer just the white breast meat to the whole bird or leg meat. This is true according to some hard data, and it is also true according to the countless customers who walk into the butcher shop and ask for chicken. They are surprised to see that there are legs and wings attached, and “No, no. Do you have regular chicken breasts please? I need something easy tonight.” I nod and grab the limp oval flesh, but not without thinking about how inefficient the equation of eating has become for everyone involved here.Today’s chicken is a buxom creature. Breeders have worked hard to concentrate most of their poundage in a heart-shaped bosom—where two bulbous halves cling desperately to a flimsy keel bone—because that is where demand is highest. “Shake your moneymakers,” they seem to say to the chicken. Dolly Parton’s plastic surgeon could only dream of developing the technology that has swelled a chicken’s breasts to its curvaceous standard.You see, the whole point of boneless, skinless chicken breasts is to eliminate some of the inconveniences associated with home cooking in today’s modern world. According to our customers, chicken breasts are supposed to be healthier, they’re supposed to be faster, and they’re supposed to be easier. Than what? Everything else, it seems. What we are left with is an unquenchable demand for stripped chicken boob and piles of that unwanted everything else.Even in a butcher shop as ethical as the one I work in—one that uses every part of the animal, from cheeks to feet; one that works only with small farmers who raise their animals on those greener pastures, which do exist—we reluctantly sell boneless, skinless chicken breasts. The realities of rent and labor costs in Manhattan make it financially foolish to stand in the way of the shopper who wants to eat a chicken cutlet. At Hudson & Charles, chicken breasts make up a significant portion of our monthly sales, enough that the owners accept them as a compromise to get customers in the door. From there, it is up to us, the butchers, to convince customers to buy something, anything else. I will talk about the superior flavor of a crispy pork cutlet or even offer to break down a chicken into parts if they will just buy the whole bird. It is futile, though, because for each person I sway, there are at least 20 more intent on buying chicken breasts.This dynamic creates a sort of helplessness on our part, as we sell customers something we ourselves would never consider buying. How many cutlets did you want, sir? We slice them, we pound them thin, smacking the slick meat with a mallet. Sometimes I feel like one of those doctors selling cigarettes in the 1930s, who knowingly undermine the health of their patients for a check from the tobacco company. Some of my coworkers think I’m being extreme. Let the people have their chicken parm! Except as a butcher with a conscience, I’m worried about more than just the customer here.Chickens were once a scrappy yardbird, pecking around homes providing an inconsistent supply of eggs. The whole bird arrived at the dinner table only on special occasions—or once she stopped laying eggs. Until 1923, chicken was a whole chicken. This all changed when a woman named Cecile Steele in Delaware ordered 50 chicks for her own backyard flock, but due to a rogue zero she ended up with 500. She kept the chicks and decided to raise them for meat only in a long rectangular shed. She sold them all at 62 cents a pound. It was so profitable that she did it again the next year with 1,000 chicks, and then again with 10,000.A decade after Steele had worked out how to raise thousands of chickens all at once, the U.S. entered World War II and the government started rationing red meat. When 400,000 German prisoners of war were sent to America, many of them ended up in the Delmarva Peninsula slaughtering the chickens the American public were eating instead. Because of this increased demand, the industry around broilers—chickens raised for meat only (as opposed to layers, raised for eggs only)—grew from a typo in 1923 to more than 100 million birds a year in 1942.At first, broilers were sold whole in a style known as New York–dressed. This meant they sat on the shelf at the grocery store with everything except blood and feathers. If you, a home cook, wanted boneless, skinless chicken breasts, you had to peel them off the breastplate yourself right after tugging out the intestines and chopping off the head and feet. (This was also known as a waste of time.)By 1959 the broiler industry had reached such a scale that it warranted federal regulation. When inspections started picking out substandard carcasses, processors started cutting them up and selling them as chicken parts. Boneless, skinless breasts started showing up in recipes thereafter. The rest is history written on grocery lists that call for two chicken breasts and five chicken thighs, but there is no footnote to remind shoppers their recipe actually requires the use of three whole chickens. Maybe people will buy leftover neck, wings, feet, or drumsticks, but maybe they won’t.The chicken breast has made a name for itself as an easy and malleable protein. Tossed in mayo, served on sandwiches, eaten on checkered blankets in Central Park. Crisped in a pan, a vehicle for melted mozzarella and red sauce. Breaded and fried. Mushrooms and white wine. One hundred percent white meat nuggets. Chicken breasts are fast. They’re clean. Look at how white they are after they’re cooked. Chickens themselves are pure and small. Chickens don’t have the same dirty farting habit cows have. Let’s have chicken for dinner.Today’s industrial broilers live short, cramped, painful lives. They’re engineered to grow at such staggering rates that by day 9 the chick’s baby legs can barely hold up their disproportionately large breasts. They are kept in the same rectangular sheds that Cecile Steele invented to hold her 500 chicks, although 30,000 is now standard. Some poultry processing plants are still maintained through prison labor and other vulnerable hands. There are approximately 250,000 poultry workers in the country, most of whom are Latinx, women, or undocumented. It is a low-paying job and has a workplace-related injury rate twice the national average. Workers are exposed to chemical-laden feces, violent machinery, and speeding production lines. One bird every two seconds. Twenty thousand birds a day. There are reports of employees wearing diapers to work because they are often not granted bathroom breaks. Frank Dwayne Ellington, a black inmate in Alabama state prison, showed up for a day of work in October and got pulled into the same machine meant to decapitate dead birds. He died on the spot. From 2015 to 2018, there were eight human deaths on the processing line along with countless chickens.Boneless, skinless chicken breasts are only possible because they depend on this dark economy of scale that controls how a chicken gets from chick to shopping cart. There is a reason you can’t find boneless, skinless breasts from chickens raised outdoors, from chickens that are allowed to partake in an avian life. At our butcher shop, we sell those happy pastured chickens, but only whole because it is too expensive to risk wasting any of their weight to consumer preference for just breasts. Pastured chicken breasts would have to cost at least $20 a pound because of all the labor associated with raising, killing, and deboning one whole chicken for two breasts that may feed just two people for one night. It might be helpful to think about a cow here, which for all its bad press about methane emissions, provides hundreds of pounds of edible meat to many people. While some parts of the cow are priced differently, most of the animal is utilized in some way (namely, hamburgers). In contrast, because American consumers don’t think much about the rest of the chicken, the wings, feet, back, and legs are understood as a necessary inconvenience to breast production. But the industry has managed to solve for that too.In 2005 food scientist Daniel Fletcher was named a fellow to the Poultry Science Association for his research at the University of Georgia on turning dark meat into white meat by spinning it around in a centrifuge in an effort to remove the proteins responsible for the darker color within chicken legs. His research and funding is a testament to America’s penetrating appetite for whiteness. They’re also indicative of a lack of accountability to the lives, both animal and human, who must be understood as disposable in order to indulge the consumer demand for cheap, spineless chicken.Nine billion chickens are slaughtered every year in the U.S. for meat, and 80 percent of them are sold off in parts (in 1962 only 15 percent were). After slaughter, chickens move to a processing facility where human hands pull back layer after layer of plucked chicken skin to reveal two slippery breasts underneath. Another set of hands then yank the lobes downward to disconnect the flesh from bone in one hunk of clean white meat. They’ll eventually show up on a shelf near you, pressed up against plastic, rendered utterly replaceable among a tray of countless other displaced chicken boobs.My hands are there organizing them into straight lines, grabbing them, weighing them out, charging people money for them, and indecently exposing them to meet the demand.Sophia Hampton is a New York–based farmer, whole animal butcher, and writer. She is just about finished earning her bachelor’s degree at New York University, where she studies the relationship between healthy soil and healthy people.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Sophia Hampton"]}