{"id": "1e40d6a39b3c560d9125bbb37f5858a5", "url": "https://www.bonappetit.com/story/covid-travel-guidlines", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "What's the Safest Way to Travel During the Coronavirus? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersWhere to eatWhat’s the Safest Way to Eat Your Way Around America Right Now?Essential road trip questions, answered.By Ali FrancisAugust 14, 2020FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailAs COVID-19 continues to cause very real and lasting damage around the globe, it feels strange to be writing about travel, even the low-key domestic kind. But after spending the past 155 days staring at the same four walls, a lot of us could use an escape. Enter the all-American road trip. After talking to two experts—Maria Sundaram, MSPH, Ph.D., an infectious disease epidemiologist and postdoctoral fellow at ICES Ontario, and Darria Long, M.D., author and clinical assistant professor at the University of Tennessee—I learned not only that road tripping is the safest way to travel right now but also how to plan accordingly. They answered my most pressing questions: What are the risks? How can we mitigate them? Is there a way to eat safely on the go?So without further ado, here are their tips for staying as safe as possible while traveling, stopping, staying, and eating your way across the country.Travel by CarTo be clear, staying home is the surest way to minimize your potential exposure to the virus. But unlike trains, buses, and planes, which are packed with potentially germy humans, driving is the safest travel option because you can manage those variables. “You have a lot more control over your environment: You can roll down the windows [for extra ventilation] and you can choose who is sharing your space,” Sundaram says.She suggests traveling with a small group of friends or family who you feel confident have been isolating, wearing their masks, and washing their hands. Then continue to do those things together.Order Food To GoAs certain states continue to debate reopening guidelines, some restaurants have welcomed customers back to their tables. But just because you can dine in doesn’t mean you should dine in, because we know the virus spreads via respiratory droplets that are expelled when folks cough, sneeze, or even talk emphatically. Also: You can’t wear a mask, the main defense against spreading said particles, and eat at the same time.But one of the best parts of any road trip is the journey—those unexpected food gems you find along the way. So what should we do when the mood strikes? Order takeout or pickup, according to Sundaram. “Don’t eat in the restaurant; it’s not worth the risk,” Long adds. And if eating at a restaurant is a must, settle only for places with outdoor patios, masked staff, and plenty of space between tables. And of course: Wash.Your.Hands.Embrace the Great OutdoorsNature is an effective COVID-19 repellant, for a couple of reasons, Sundaram says. The virus tends to live longer on indoor surfaces rather than outdoor ones where it’s exposed to differences in temperature, humidity, and UV radiation that can essentially kill it. Staying outside, where there’s increased airflow and increased ventilation, means you’re less likely to breathe in someone else’s recently expelled, possibly contagious air—both a rancid and reassuring thought.Assuming you can avoid crowds, approved outdoor activities include hiking, swimming, biking, etc. Hard no: visiting shared and indoor facilities, like gyms, pools, and saunas. Whatever you do, have a mask accessible and “try to think about ways that you can protect others and yourself,” Sundaram says.Batch Grocery TripsGrocery shopping while on the road is inevitable. But when you're crossing over into a new community, there is always a chance you could jeopardize the health of locals. Sundaram recommends reducing their exposure—yes, to you—by ordering ahead on grocery apps and arranging for curbside pickup. When that’s not an option, Long is all about batching socially distanced trips and keeping them to a minimum. Read: If you forget the fancy choc chips, you’re making trail mix cookies with those bars you stashed in the glove box instead.Being considerate of the communities you enter is key, no matter what. “It’s really, really important to remember that it’s not just that we’re trying to reduce our own exposure risk; we’re also trying to reduce the risk of everyone else around us,” Sundaram says.Pack a CoolerStrategically packing a cooler when you’re on the road is also a great way to “eliminate those extra trips to the store,” Long says. That being said, food safety is still important, so make sure your cooler stays, well, cool. (Check out our main gallery for tips from self-described “Yeti guy” Brad Leone on how to do that.) “We don’t want people to be so wary of the grocery store that they give themselves salmonella,” she says. Heed Good Bathroom EtiquettePlaying roadside bathroom roulette might be the worst part of a road trip. Maybe you’ll stumble upon that rare, empty, and pristine rest stop, maybe you’ll find yourself in a human litter box. In general, Sundaram says to avoid small, enclosed areas with lots of people. Meaning, if you stop somewhere and 20 people are lined up, consider pushing on.In the more, uh, urgent cases, Long says to keep your mask on, touch as few things as possible, use toilet seat covers, and stand away from the toilet as it flushes. Wash and sanitize your hands thoroughly before returning to the car or taking off your mask. She carries a little bottle of Dial soap in the car for the likely event that a public bathroom has run out or is sporting a crusty millennial pink bar of who knows what. (Alternative resort: Find a socially distanced tree—Shewee optional.)Minimize Snack StopsSundaram knows snacks are a crucial part of any road trip. But just like your to-go meals and curbside grocery pickup, gas station snack stops should be limited to when you’re actually getting gas. Another idea? Nominate one person who can go inside the store, grab the goods, and pay for the gas—rather than everyone going indoors. A primer for snack leads: Take car orders by opening the notes app and immediately writing, #1. Lake Champlain’s Peanut Five Star Bar. Plan Ahead, and Know Where You’re GoingDriving around willy-nilly is a bad idea. The U.S. is like a cluster of small countries right now, in that each state has its own conditions and guidelines for handling the virus. Before you leave, check COVID-19 caseloads by county, see whether cases are generally increasing or decreasing by state, and grab a quick overview of state-by-state restrictions. Then opt for lower-traffic areas and national parks.As for accommodation, both experts recommend camping or caravanning outdoors, or staying in isolated Airbnbs that have been properly sanitized. Hotels have the most shared facilities and thus should be avoided. No matter where you’re going, Long suggests calling ahead to ask about capacity (100 percent is decidedly not ideal), ventilation (the more fresh air, the better), and when the last guest left your room (ideally you want a buffer period of a couple of days or more). And always, always bring your own sanitizers to give high-touch surfaces a once-over.Explore Bon AppétitRoad TripCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-14", "author": ["Condé Nast", "Ali Francis"]}