{"id": "1e416667053497a4d6826c844415d74c", "url": "https://www.bonappetit.com/story/make-ahead-turkey-gravy", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Make-Ahead Turkey Gravy Is a Savior | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Umami Gravy Is the Best Gravy You Can Make With Boxed StockWe doctor it up until it’s bursting with savory flavor. No turkey juices necessary.By Alex BeggsNovember 9, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailThanksgiving week is what we call GO TIME. The flickering grocery store lights become too familiar. The fridge begins to lose every inch of free space. Printed recipes taped to different cabinets make the kitchen look like a war room on a crime show. Planning what to make ahead—from three days before to the morning of—is a home cook’s final exam. We waited all year for this! And usually, gravy is assumedly a day-of dish, made with scalding turkey drippings, frantically stirred with the one roux you make a year, maybe too thick or too thin but hurry and get that thing on the table!Let’s make it ahead this year.Andy Baraghani wanted a velvety, flavor-packed gravy that you can get over with days in advance, reheat on Thanksgiving, with no one ever knowing the difference. You can either use turkey stock or boxed chicken stock (the Bon Appétit Test Kitchen likes Pacific brand). But because store-bought stock lacks complexity and depth and can veer to the sweeter side, Andy doctors it up with a burst of umami—that savory fifth taste triggered by good Parmesan cheese and funky mushrooms. Here’s how he does it.Look who planned ahead.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiWith a Turkey NeckYou know how your turkey comes with a bag of giblets and other turkey...innards? In this recipe, you brown the turkey neck, creating a fond—the French term for a layer of caramelized fat on the bottom of a pot. That fond (🙄) adds backbone and depth and turkey flavor. It’s the base layer of our umami gravy.With Some OnionsWe don’t normally think about onions as being sweet, but damn, they are sweet. In this recipe, you need to cook them until they’re tender and browning around the edges, a quick cook, not the low-and-slow caramelized onion method, which makes them waaaay too sweet. That almost burnt edge gives the gravy a deep savory note.With Shiitake MushroomsThese add mega-umami. Absolute must.Spooning the stock into the roux.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiWith a Fortified StockOnce all of the base aromatics and elements have browned and done their thing, you add the neck back in the pot with whatever stock you’re using and cook it like a stock, then strain. After that you follow the usual gravy steps: Make a roux with fine flour and butter, gradually whisking in the fortified stock. It’ll thicken into a smooth, dreamy gravy and we call it quits when it coats the back of a (very necessary) taste-testing spoon.That final hit.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiWith a Final Drop of Soy SauceJust a teaspoon, at the end (so it won’t cook off). The final umami hit. The extra credit. Then you can refrigerate it two days before the big day, reheating and whisking it to perfection on the stove.Get the Recipe:Umami GravyWe made it our business to create an excellent gravy with store-bought broth—no ham hocks, chicken parts, or hours-long simmering involved. You're welcome.View RecipeExplore Bon AppétitThanksgivingGravyMake AheadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Alex Beggs"]}