{"id": "1e4452737452651c82942cd793e68e21", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/rt-rotisserie", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "RT Rotisserie Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoRT RotisserieRotisserie chicken gets the spotlight at this unfussy Hayes Valley spotFacebookPinterestTwitterEmailKassie BorresonGO HERE: for truest form of \"fast casual\" dining. Don't let the order-at-the-counter vibes fool you at RT Rotisserie: This is really good food, from the folks behind non-fast casual restaurant Rich Table.ORDER THE: rotisserie chicken, obviously. But please also get the RTR Salad, a bracing mix of greens, herbs, pickled onions, cotija, and seeds. We recommend it with rotisserie duck, a steal for only $3 more. For sides, we're partial to the dirty rice but understand if you want a vegetable—there's charred cabbage, Brussels sprouts Caesar, and seared broccoli.THE VIBE IS: tech dude grabbing food to-go meets a family getting a quick dinner meets two female friends catching up over chicken and a glass of rosé (oh yeah, there's also beer and wine).PRACTICAL STUFF: Open every day, from 11 a.m. to 9 p.m. RT Rotisserie also does delivery and catering.—Carey PolisKassie BorresonKassie BorresonWE ALSO LOVETartine ManufactoryThe megabakery-slash-wine-bar-slash-ice-cream-shop-slash-restaurantAL's PlaceObsession goes casual at this hard-to-get-into Mission hot spotArsicault BakeryCroissants and pastries worth waiting for Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Carey Polis"]}