{"id": "1e44970ed409be5353c70fe05359a19b", "url": "https://www.bonappetit.com/story/feel-good-food-plan-lunch-strategy-2019", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "How to Meal Prep a Week’s Worth of Not-Boring Lunches in Two Hours | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Meal Prep a Week’s Worth of Not-Boring Lunches in Two HoursDo more with less for your weekday lunches this year.By The Healthyish TeamJanuary 26, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailThis story is part of the 2019 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.This year’s Feel Good Food Plan lunch strategy is all about doing more with less. This weekend you’ll make three big-batch recipes (Chickpeas! Roasted vegetables! Eggs!) and two flavor-packed sauces. Grab some fresh greens at the store, and you’re set for a week of never-boring lunches. Here’s how it all comes together:Cooked chickpeas are the anchor of this plan; you’ll turn them into a week’s worth of soups, salads, and creamy hummus. Before all that can happen, though, you’ll want to soak 1 pound of dried chickpeas overnight to cut down on tomorrow’s cook time. (If you’re using an Instant Pot or pressure cooker, there’s no need to soak.) The next day, when you’re ready to meal prep, start with the chickpea recipe below. Luckily the hands-off cooking method, inspired by Mina Stone, makes it easy to prepare everything else while you wait.Quite Possibly the Best ChickpeasAdding lemon zest and olive oil to chickpeas leads to brightness and full-on flavor.View RecipeIf you’re using an Instant Pot, combine the chickpeas with 8 cups of water and cook for 33 minutes on high pressure. After the beans are cooked, use a manual pressure release.While the chickpeas are simmering, you’ll tackle the roasted vegetables. Use sweet potatoes, carrots, cauliflower, asparagus, brussels sprouts, onions—whatever you’re going to want to eat this week. Just make sure to chop them into relatively equal sizes so they cook at the same time.Meal-Prep Roasted VegetablesRoasted vegetables are the perfect, hands-off way to prep healthyish lunches for the week.View RecipeWhile the roasted vegetables and chickpeas are going, cook any hard-boiled (or soft-boiled) eggs you’d like to eat this week. You’ll use around six eggs throughout the week, but add in a few more if you’d like to prep for breakfast too.For hard-boiled eggs, bring a large saucepan of water to a boil over medium-high heat. Using a slotted spoon, carefully lower eggs into the water one at a time. Once the water comes back to a simmer, cook for 10 minutes, then carefully transfer eggs to a bowl of ice water and let cool until just slightly warm, about two minutes. Gently crack eggs all over and peel, starting from the wider end, where there’s a handy air pocketFinally, take a few minutes to prep two essential super sauces that will liven up the simplest middle-of-the-week lunch. We suggest a creamy tahini-ranch and a just-basic-enough shallot vinaigrette, but choose any dips or dressings that call to you from this list.Tahini-Ranch DressingWe would never ask you to use your blender if it didn’t make a smoother and better dressing. The effort is worth it; you’ll have enough sauce to get you through a week of lunches.View RecipeJust-Basic-Enough VinaigretteThis is a great excuse to treat yourself to some seriously delicious vinegar.View RecipeFinally, creamy hummus is an excellent base for roasted vegetables, hard boiled eggs, and any raw vegetables you have on hand. Plus, it can be prepped up to five days in advance. Make the hummus by blending 1.5 cups drained chickpeas with the juice of 1 large lemon, 1 garlic clove, ½ cup tahini, ¾ tsp. salt, 10 cracks pepper, ¼ tsp. cumin, and 2 Tbsp. water. Adjust seasoning to taste.Two hours later, everything you need for a week of great lunches is at your disposal. (If you’d like to save some of the chickpeas for another week, submerge them in their cooking liquid and freeze. When you’re ready to eat them, reheat the chickpeas and liquid in a saucepan with a splash of water.)Monday through Friday, you’re just a few steps away from any of the lunches below.Photo by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiLunch idea 1: Easy Mezze PlateIf you haven’t prepped your hummus, follow the above instructions. Once it’s made, all that’s left to do is assemble. Snip some tender stemmed cilantro or mint, halve a hard boiled egg, and crumble up some feta. Place the toppings onto the hummus with some of your meal-prepped roasted vegetables, then freshen it up at lunchtime with a lemon wedge or drizzle of olive oil.Photo by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiLunch idea 2: Chickpea Salad with Bitter GreensRadicchio is wonderfully bitter and crunchy, and makes a hardy base for cooked chickpeas,  eggs, and any vegetables you have on hand. Those meal-prepped chickpeas and eggs are the only cooked components you need, so all that’s left to do is a bit of quick assembly. Prep any sturdy green, slice a few Persian cucumbers, chop up your favorite herbs, and halve two hard-boiled eggs. Put down a layer of radicchio or any green you fancy, then scatter your toppings on top and finish with a generous drizzle of tahini ranch (or another dressing) and a few cranks of black pepper.Photo by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiLunch idea 3: Smashed Chickpea SandwichTuna salad goes vegetarian with this creamy, crunchy chickpea sandwich recipe. Crush a generous scoop of drained chickpeas with the back of a spoon, then add yogurt, olive oil, or tahini ranch for creaminess and heft. Mix in chopped celery, capers, or pepperoncini, then layer with thinly sliced vegetables and lettuce on whole grain bread. Wrap your sandwich tightly with butcher paper or parchment paper to keep stray chickpeas from falling out.Photo by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiLunch idea 4: Brothy Chickpea SoupThis soup is made by doctoring up the delicious brothy, super flavorful chickpea cooking liquid with two teaspoons of white miso. Place chickpeas and their liquid in a small saucepan, drop in chunks of roasted sweet potato or other roasted vegetables (which you already meal-prepped!), and gently heat. Tear and add sturdy greens like kale or collards for additional heft. Add a thinly sliced egg once it’s all hot, and a dash of hot sauce or chile crisp. If you’re working with a microwave, thin the miso with a splash of chickpea liquid before adding the rest of the chickpea mixture, then add vegetables and heat. Add the egg and hot sauce once the soup is hot.Explore Bon AppétitHealthyishFeel Good Food PlanLunchMeal PrepRead MorecookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "The Healthyish Team"]}