{"id": "1e6c62a3013f10056b5997fa047c3a46", "url": "https://www.bonappetit.com/story/samantha-irby-salad-bar-questions", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Samantha Irby Ponders the Salad Bar’s Greatest Questions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDoes Three Pounds of Croutons With Organic Ranch Count as a Salad?Pondering the salad bar’s greatest questions.By Samantha IrbyMarch 23, 2021FacebookTwitterEmailPhoto by Anjali PintoFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.“What kind of person am I going to be today?” I think to myself as I sidle up to the salad bar at the local Overpriced Fresh Vegetable Emporium, my single seltzer (do I wish it was a Diet Coke? I absolutely do, but they don’t sell those here) and modestly sized square of healthy dark chocolate (revolting!) rolling around my basket. Salad bars offer the opportunity to reinvent yourself for the time it takes to wolf down a bowl of damp lettuce while hunched over your sink or your desk or wherever lonely people eat. The possibilities are endless! Am I healthy today? Do I give a sh*t about being alive? Do I spend half a paycheck on minerals and fiber when my doctor isn’t even around to give his approval, or should I just buy three pounds of croutons with organic ranch poured over them, which is what I actually want to eat?Am I a marinated artichoke person? Should I pretend to be interested in beets? Do I care about vitamin K? And a follow-up: Do I care enough about vitamin K to spend $14 on an environmentally friendly (read: rapidly disintegrating) clamshell filled with the kind of dark leafy greens magazines are always insisting I try? Is that guy peering skeptically through the sneeze guard judging how many scoops of chickpeas I’m getting? How much meat and cheese disqualifies this from being labeled a \"salad\"? Do I like nuts on salad or do I just like the idea of nuts on salad? Do I have enough money in my checking account to risk this much herb-roasted salmon? Why do bacon bits taste like burnt charcoal and why can’t I stop myself from sprinkling them on everything? Hang on, what was that NPR thing about phytonutrients from the other day? If I use as much of this dressing as I want to, will the cashier think I don’t love myself? Hang on, should I actually get the nuts? Or should I just time travel back to 1971, when salad bars were new and cool and no one cared how much shredded cheese and Thousand Island you dumped on your watery iceberg lettuce???Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Samantha Irby"]}