{"id": "1e76c5c765b2a3bf66e0f177ebc91ce4", "url": "https://www.bonappetit.com/recipe/crispy-olives-with-calabrian-chile-sauce", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Crispy Olives With Calabrian Chile Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCrispy Olives With Calabrian Chile SauceBy Zaynab IssaNovember 23, 20214.5(22)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintHow to take olives from snack to PARTY snack? Buy pre-stuffed olives, then coat them in panko, fry until deep golden brown, and serve with Calabrian chile sauce. Pre-stuffed olives—we like them with garlic or cheese—make this appetizer easier, but feel free to switch up the type of olive you use and experiment with different stuffings of your own.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronInstant-Read Thermometer$35 At ThermoworksMesh Sieve$13 At AmazonSpider$6 At AmazonDutch Oven$80 At AmazonWhisk$10 At AmazonIngredients4 - 6 ServingsSauce1½–2Tbsp. Calabrian chile paste (depending on heat preference)1Tbsp. extra-virgin olive oil1Tbsp. red wine vinegar1Tbsp. double-concentrated tomato paste½tsp. honey½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltOlives and assembly8oz. stuffed green olives, preferably with garlic or cheese¼cup all-purpose flour¼cup cornstarch½tsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, divided1cup pankoVegetable oil (for frying; 4–5 cups)Flaky sea saltPreparationSauceStep 1Mix chile paste, oil, vinegar, tomato paste, honey, and salt in a small bowl to combine. Cover and chill.Do ahead: Sauce can be made 3 days ahead. Keep chilled.olives and assemblyStep 2Drain olives in a fine-mesh sieve, discarding any liquid. Thoroughly pat each olive dry (moisture can prevent coating from sticking or cause excess splattering during frying).Step 3Whisk flour, cornstarch, baking powder, ¼ tsp. Diamond Crystal or ⅛ tsp. Morton kosher salt, and ¼ cup water in a medium bowl to make the batter. Combine panko and remaining ¼ tsp. Diamond Crystal or ⅛ tsp. Morton kosher salt in another medium bowl. Rub some of the panko between your fingers to create a finer texture.Step 4Working with about 5 olives at a time, add to batter and turn to coat. Transfer olives to seasoned panko mixture and turn to coat completely, pressing firmly to adhere. Place on a rimmed baking sheet.Step 5Pour oil into a large heavy high-sided skillet to come 1½\" up sides. Heat oil over medium-high until an instant-read thermometer registers 400°. Working in batches to avoid crowding the pan and returning oil to 400° after each batch, very carefully lower 10–15 olives into skillet with a slotted spoon and cook until deep golden brown, 1–2 minutes. Transfer olives to paper towels with slotted spoon; sprinkle with sea salt. Let cool 5 minutes, then serve on a plate with sauce.How would you rate Crispy Olives With Calabrian Chile Sauce?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleTo all of you Philistines using an air fryer: an air fryer is not a deep fryer. You can sub one for the other for things that are freshly battered. An air fryer is a glorified convention oven. Anonymous12/29/2021Is there an error here in the amount of liquid? The batter is too thick to coat olives. I had to add more liquid, almost double the amount. Dee CeeHartford, CT12/22/2021The sauce alone is amazing, I now put it on everything.  Get Trader joes fried olives instead! Anonymous12/18/2021I think the dipping sauce is flipping incredible and have already made it a bunch of times. Small complaint - we are salting olives dipped in a salty/spicy sauce? I'm sure it's so that it looks pretty, but it seems insane. AnonymousSan Francisco, CA 12/16/2021I made these olives with an air fryer and was not very impressed. Dipping sauce was so so. I will not be making these again.SeanPort Coquitlam, Canada12/12/2021Has any body tried this in air fryer???Anonymous12/6/2021Calabrian chile pasteKathy CooperSandia Park New Mexico12/4/2021What is a good brand of chili paste to use for this recipe?funk88Houston, TX12/1/2021Gonna try this... got addicted to the ones at OLEABrooklyn Olive BroNYC11/27/2021Explore Bon AppétitSnackStarterEasyVegetarianDairy-FreeNut-FreeOliveOther IngredientsChileVegetableFryChristmasNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}