{"id": "1e7b691c39af6ccde13fa61c42379927", "url": "https://www.bonappetit.com/story/september-11-memorial", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "9/11 Brought NYC Restaurants to Their Knees. 20 Years Later, How Are They Facing Down COVID? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture9/11 Brought NYC Restaurants to Their Knees. 20 Years Later, They Face a Different CrisisRestaurants were badly impacted by the terrorist attacks—and critical to the city’s recovery. After the pandemic, will they play a similar role?By  Peter KaminskyAugust 18, 2021FacebookTwitterEmailIllustration by Jackson JoyceFacebookTwitterEmailOn September 11, 2001, Wilson Tang was selling insurance for Morgan Stanley on the 74th floor of 2 World Trade Center. When the first plane hit the neighboring tower at 8:46 a.m., Tang didn’t feel the impact, but he did notice paper flying everywhere.Next, the fire alarm sounded, followed by the order to evacuate. Still, Tang figured, it was no big deal. When he reached the 44th floor, the elevators were out of service, so he took the stairs the rest of the way. When he reached floor 16, he passed firefighters coming up. On the street he paused for a cigarette and took measure of the scene: “Fire trucks and police cars were already there, but as a New Yorker you get used to that. What struck me was the crowd, their necks craned, looking up, not yet comprehending what had happened.”Tang wanted to reassure his parents that he was okay, but his cell phone had no service. So he walked to Chinatown, where his father had a restaurant supply business and his uncle owned Nom Wah Tea Parlor, the area’s first dim sum restaurant. As he walked, the second plane plowed into the south tower. “That’s when I knew it was terrorism,” he recalls. “On the way to my dad’s, there were TVs on in every store.”Less than an hour before Tang evacuated his office, Michael Lomonaco, the executive chef and restaurant director at Windows on the World atop the north tower, arrived at the World Trade Center. As usual, Lomonaco was early for work, so he detoured to LensCrafters to have his reading glasses adjusted. After a few minutes he felt a shudder. Within minutes building security staff evacuated everyone from the shopping concourse underground. Just over an hour later, both towers had collapsed.On the afternoon of September 12, Don Pintabona, the chef at Tribeca Grill, convened a meeting of some prominent chefs at Chelsea Piers. He laid out a plan to feed the firefighters, cops, and soldiers at Ground Zero. Starting the next day, and continuing for weeks, a fast boat would ferry 50 or so chefs, restaurant workers, and friends of the restaurant community (myself included) to a much larger ship. It was moored in the North Cove Marina, a few hundred feet from the remains of the towers.Recovery workers came from all over the country. They’d step onto the boat red-eyed and exhausted, uniforms infused with the bitter scent of smoke and burnt electronics—an odor that lingered over the city for months. Many restaurants, including Pintabona’s, were closed. Rather than let their ingredients spoil, the chefs brought trencherman portions of luxury comfort food. Daniel Boulud manned an assembly line making foie gras sandwiches. Another chef ladled out mac ’n’ cheese with summer truffles. I remember one firefighter calling out to his comrades, “Hey, guys, filet mignon, for real!”Michael Lomonaco sensed that his survival of the attacks was a calling to provide a financial life raft for the families of his murdered coworkers. Many of them were immigrants and people of color and often the main breadwinners in their households. Along with chefs Waldy Malouf and Tom Valenti and restaurateur David Emil, Lomonaco started the Windows of Hope Family Relief Fund to assist with rent, mortgage payments, medical insurance, and education for the bereaved families. “Restaurants from all over the world jumped on board,” he says, recalling the nationwide fundraiser they held on October 11, 2001. “We wound up raising about a million dollars that night. And over the course of the next 12 or 14 months, we raised another $22 million.” Lomonaco and the other founders hoped that the fund would last until the youngest child reached 21. That child was born on September 13, 2001, the son of a banquet staffer who perished in the fall of the Towers. Today he is studying at a community college with assistance from the Windows fund.The 9/11 attacks brought New York, and the nation, to a halt. We were shocked, saddened, grieving, and, for a time, united. Nobody imagined that nearly 20 years later, America would be struck again. This time not by jets but a microscopic strand of genetic code.This tragedy was different, of course. The destruction of the Twin Towers killed 2,753 people in one day. At the height of the pandemic, in January 2021, COVID-19 killed an average of 3,100 Americans every day. The attack’s effects on the national psyche were significant, but the economic effects on restaurants were transitory. By contrast, the pandemic crippled the industry: 4,500 New York restaurants closed and more than 200,000 restaurant staff lost their jobs.And yet, just like their colleagues nearly 20 years earlier, restaurant owners and chefs stepped in to provide aid. World Central Kitchen, founded by José Andrés, deployed text-to-order software that enabled 21 New York restaurants to deliver more than 110,000 free meals for those most in need. There were also ad hoc responses from local restaurants. In March 2020 chef JJ Johnson, owner of Harlem restaurant FieldTrip, tweeted, “Looking for contact at Harlem Hospital.” Responses came quickly. The next day he delivered 40 of his signature rice bowls to the facility, one of the city’s early (and overwhelmed) COVID-19 treatment centers. This effort grew into Johnson’s “Buy a Bowl” program, through which he delivered 100,000 meals, at cost, to frontline workers and food-insecure families.Crises have a tendency to reorganize priorities. After 9/11, Wilson Tang took a fresh look at his career: “I thought, the insurance business kinda sucks and my DNA is in entrepreneurship, just like my father and uncles.” For the next few years, he ping-ponged between insurance (his parents’ preference) and the restaurant industry. In August of 2010 he finally committed full-time to Nom Wah, taking the reins from his uncle. The enterprise flourished, with three locations in Manhattan, one in Philadelphia, and two in Shenzhen, China.Then came the pandemic. When the city shut down in March 2020, New Yorkers had already deserted Chinatown in fear of COVID-19. Rising xenophobia stalked the streets, impacting the East Asian community in much the same way it did for Muslims in the wake of 9/11. This time racial animus was stoked by the president himself. Providing hospitality in this environment was especially difficult; many Asian restaurants had to do things like close early so staff could get home before dark for their safety. Tang still often finds himself on guard. “When I’m out walking with my young son, I hold his hand a little tighter,” he said. “My street antennae are more sensitive to the people around me. It’s sad.” Despite the challenges, Tang continued to find ways to weather the storm, like selling frozen dumplings in local markets as a new revenue stream. The stopgap maneuver proved successful and is continuing to expand.Other restaurateurs have used a variety of strategies to stay afloat. Through a combination of government assistance, rejiggered leases, delivery apps, expanded sidewalk dining (which is hopefully here to stay), and contracts to provide low-cost or no-cost meals to those in need, many restaurants in the city scraped by with skeleton crews. And with the arrival of widespread vaccination in late spring 2021, New Yorkers returned en masse to their beloved restaurants, discovering that they’d missed the buzz of table talk and the rumba rhythm of cocktail shakers as much as they missed the food—maybe more.Where the 1963 assassination of John F. Kennedy punctured the pipe dream of idyllic 1950s America, 9/11 demolished the privileged notion that America’s oceans provided a barrier against bloody geopolitical conflicts that happen “over there.” And despite the advances of modern medicine, COVID-19 has shown that America is as vulnerable as the rest of the world to the depredations of the Horsemen of the Apocalypse: in particular, Plague and Famine (or at least Hunger).Yet history shows that New Yorkers are nothing if not resilient. We’ve recovered from crises before. Pandemic rehabilitation will require years of creative solutions and a long-term commitment to social equity. But New York will prevail, and restaurants will contribute, as they always have, to a city reborn.Peter Kaminsky is a longtime writer for the ‘New York Times’ and others. He has authored 18 cookbooks, most recently, ‘How to Dress an Egg’ with chef Ned Baldwin.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-18", "author": ["Condé Nast", "Peter Kaminsky"]}