{"id": "1e818e339b5674d21624573627fd7bb0", "url": "https://www.bonappetit.com/story/face-gyms", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Face Exercises Are A Thing Now, But I'm Not Doing It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNope, Sorry, I Won't Exercise My FaceIn case you haven't heard, face gyms are a thing now.By Leah PrinzivalliJune 12, 2018FacebookTwitterEmailIllustration by Igor BastidasFacebookTwitterEmailBoutique fitness, like any other cult, requires a suspension of disbelief most often combined with exorbitant amounts of money. Still, like any other follower, I’m generally happy to do both. I recently signed up for a workout called “BRRR” that takes place in a cold room. My favorite song to hear at SoulCycle is an EDM remix of “Smells Like Teen Spirit” that is certainly ruining Kurt Cobain’s time in the afterlife. I wasn’t searching for my fitness breaking point, but I found it: You cannot make me exercise my face.Facial exercises are the latest workout trend, galvanized by studios like FaceGym, soon to open at Saks Fifth Ave, FaceLove in NYC, or Skin Fit Gym in Los Angeles. The “exercises” are so named because they most resemble the awkward movements one might recognize from a physical therapists’ office or a particularly finicky barre class. Movements have instructions such as smile with no teeth, then purse the lips, then keep lips pursed, then smile again, then hold the smile for 20 seconds. The goal, of course, is to achieve long-calcified standards of physical perfection in the form of youthful, sag-free skin.Does it look and sound ridiculous? Sure. But the research backs it up. A Northwestern University study found that 30 minutes of daily facial exercise, after 20 weeks, resulted in fuller cheeks and lifted brows for middle-aged women. The researchers evaluated their findings by asking dermatologists to rate the ages of each participant. By the end of the study, patients’ average age appearance dropped from 50.8 years to 48.1 years. So it took 20 weeks—five months, almost half of a year of their lives—for people who looked almost 51 to magically look like they had just turned 48.Since these facial contortions provide a modest benefit at best, “they are not going to replace fillers, neuromodulators, or lasers for wrinkles,\" says Dr. Murad Alam, the lead author on the study. \"But it is possible that facial exercises may augment or improve the results of medical treatments for aging.\" People with the time and money (ahem, Meghan Markle) to prioritize anti-aging practices may find that a move like Happy Cheeks Sculpting does indeed make the cheeks a bit more plump—especially if they’ve already been Botoxed or Restylaned. But for me, no plumpness is worth the horror of being asked to exercise yet another body part.Facial exercises are at the intersection of two highly lucrative demographics. The natural beauty movement is on the rise, which means people may be more open to smiling themselves silly in the mirror. But even as we stray from injecting toxins into our faces, the forces at play still encourage women to look younger. The anti-aging market is now valued at 250 billion-dollars. It’s unsurprising that someone has found a way to target women looking to take responsibility for their God-given disappearing youth with $90 face yoga. Capitalism finds a way.For those of us without the time and money to spend on facial exercise classes, I recommend their snotty, lazy cousin: The facial. These spa treatments typically involve a version of facial massage that can stimulate the muscles in a similar and, crucially, passive way. Celebrity esthetician Ildi Pekar also suggests taking a few extra moments to give yourself a facial massage when putting on skincare products. “Don’t just put eye cream on. Massage it in; tap it in,\" Pekar says. \"Any stimulation is better than nothing. It just gives you a more a glowy and dewier look.\"But unlike a facial or a quick self-massage while patting on your night cream, facial exercises seek to a role adjacent to ab work or tricep dips. That, for me, is where I draw the line. I will not do reps for my smile, even if they turn me from 51 to 48. I've earned these lines with decades of refusing to smile. Middle-aged me may have wrinkles, but at least she will have her $90.Explore Bon AppétitHealthyishTrendsRead MoreLifestyle5 Ways to Get Your Skin as Psyched About Spring as You AreBy Mia Adorante ChristiansenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Leah Prinzivalli"]}