{"id": "1e8706c7f5f8db1a03cf9903fb4c56e9", "url": "https://www.bonappetit.com/recipe/creamy-spinach-and-chickpeas", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Creamy Spinach and Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueCreamy Spinach and ChickpeasBy Shilpa UskokovicJanuary 4, 20224.9(34)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah MortonEmailPinterestPrintEmailPinterestPrintFrozen greens are a meal-prep miracle—not only are they space-saving, they’re also infinitely more convenient than a large bunch of the fresh stuff. Here frozen spinach simmered in cream becomes a plush canvas for spiced chickpeas, fried shallots, and, for added punch, pickled peppers. —Shilpa Uskokovic, food editorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonGlass Measuring Cup$19.99 At AmazonSmall Saucepan$155 At AmazonCan Opener$14 At AmazonIngredients4 servings1Tbsp. vegetable oil2large shallots, thinly sliced110-oz. package frozen spinach, thawed, drained1Tbsp. all-purpose flourKosher salt¾cup heavy cream, divided115-oz. can chickpeas, rinsed¼cup harissa paste (preferably New York Shuk)½cup giardiniera, coarsely chopped, or sliced pickled cherry peppers¼cup sliced pickled cherry peppers½cup store-bought fried shallotsWarm flatbread and lemon wedges (for serving)PreparationStep 1Heat oil in a large skillet over medium. Cook shallots, stirring occasionally, until softened and translucent, about 3 minutes. Add spinach, flour, and a large pinch of salt; cook, stirring constantly, until flour is well combined, about 1 minute. Add ½ cup cream and ½ cup water and cook, stirring occasionally, until spinach is thick and creamy, about 4 minutes. Taste creamed spinach and season with more salt if needed.Step 2Meanwhile, cook chickpeas, harissa paste, a large pinch of salt, and remaining ¼ cup cream in a small saucepan over medium heat, stirring often, until sauce is clinging to chickpeas, about 5 minutes. Remove from heat and stir in giardiniera; taste and season with more salt if needed.Step 3Spoon creamed spinach into a large shallow bowl. Pile chickpea mixture over and top with pickled peppers, then fried shallots.Step 4Serve creamed spinach and chickpeas with warm flatbread and lemon wedges alongside for squeezing over.How would you rate Creamy Spinach and Chickpeas?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleWhat everybody else said, and: I think you can do giardiniera or cherry peppers but not necessarily both. That said, this recipe helped me finish up a lot of mostly empty jars. A little lemon at the end was the citrus icing on this unlikely combo, which is being added to the rotation.MarciaChicago area2/21/2022This is SO so good - ideal weeknight meal. Don't question the recipe at all and get the NY Shuk they recommend. This just became a new staple. Alex GAtlanta, Georgia2/10/2022Delicious! Substituted heavy cream with coconut cream with great results (did not taste coconutty). I do think all ingredients are necessary, really good, will make again. SvetlanaScottsdale, AZ2/3/2022Loved it—the spicy/pickled/creamy combo is absolutely great. Didn't have any fried shallots unfortunately—turns out Lunar New Year is not the day to hit up an Asian market as all the ones in Chinatown were closed! (Duh.) But even without them, we highly enjoyed—spouse said it needs to go in the regular rotation. Ate it with TJ's naan on the side.RitaOakland, CA2/2/2022As many reviewers indicated, I thought this an odd combination of ingredients.  But, also, as many reviewers indicated, this recipe produced an amazingly tasty dish and one  that is so easy to put together.  I did make my own fried shallots (in evoo heated to about 250 F for about 4 minutes and then drained on paper towel).  The harissa is the key to this dish so make or purchase one with the heat to your liking.  I served this to my husband, daughter, and her husband by layering the spinach, then the chickpeas, the giardiniera,  the peppers and fried shallots on the warmed bread.   They all loved it so this one is a keeper.P Casey Silver Spring MD1/30/2022This was delicious! So many flavors and textures. Complex, but so easy to throw together. Chickpeas took a tad longer to cook on my stove for the sauce to get clingy and thicken. I also fried my own shallots - 2 large shallots thinly sliced in about 2 tbsp of veggie oil for about 5-7 minutes on med/hi until they were browned and crispy. Worth the minor additional effort. AnonymousSan Francisco 1/27/2022I don't know how someone came up with this blend of ingredients but it's genius! Delicious, comforting, nourishing, and easy, simple fast! I ordered the recommended harissa, and it is worth buying for sure. This is a keeper of a recipe, and perfect for a vegetarian, but I'm an omnivore who loves my veggies, and this is really terrific.SusanNew Jersey1/24/2022I heard about this recipe on the BA podcast about favorite COVID ingredients. (In this case, frozen spinach). Do not be turned off by the seemingly strange ingredient list! This hits every savory note: creamy, spicy, crunchy, salty. I would have never thought of putting these pantry items together but it comes together quickly and is out of this world. Will make again and again! Strange Sounding Ingredients - Absolutely Delicious ResultSan Francisco1/24/202210/10 would make agin. I forgot harissa - like a MORON - so I used sundried tomato pesto kicked up with some chili flakes, as it was what I had. It was fabbbb and even my “where’s the meat” husband loved it. Plotting how I can make this again ASAP. AnonymousCanada 1/24/2022This was really pleasantly surprising and had a great effort to reward ratio. Big pinches of salt really are the key here; the components are really easy to under season. You could make this vegan with coconut milk. Next time, I'll double the garbanzo bean mixture. That stuff is addictive. NytashaOakland1/19/2022Is this one of the top 10 recipes on BA, or is that just the cream talking?KonstantinDurham, NC1/16/2022This recipe was great! It took 15 min from start to finish and the only chopping required was the shallots. I also used sliced banana peppers instead of giardiniera and pickled cherry peppers. 1/3 cup of harissa was too spicy for me (low tolerance) so I’ll probably cut back next time. But excited to make this again!Lisa CSan Francisco, CA1/13/2022Explore Bon AppétitDinnerMainEasyWeeknightVegetarianNut-FreeHealthyishHarissaCondiments, Sauces & PastesSpinachLeafy GreensVegetableChickpeaBeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Shilpa Uskokovic"]}