{"id": "1e8eabdccd4400655eae037694f7d8a7", "url": "https://www.bonappetit.com/story/i-have-feelings-about-asparagus-ok", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "I Have Feelings About Asparagus, and Yes, I Peel It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Have Feelings About Asparagus, and Yes, I Peel ItYou have like, mere weeks of peak asparagus season. You need to spend it wisely.By Adam RapoportMay 23, 2018FacebookTwitterEmailFacebookTwitterEmailIf you are not running to the market to buy one of those rubber-banded, fistfuls of asparagus this week, well then, we should talk. Because, despite what your wide-aisled megamart insists—with its year-around selection of spindly-stalked options—asparagus really is a seasonal vegetable. And the season is now.Finally.Here on the East Coast, we’ve had an extra-crappy spring (or what our associate social media manager Emily Schultz refers to as “sprinter”; you know spring + winter). So when I wandered into Sang Lee Farm in Peconic, New York, last weekend and saw robust green and purple stalks, standing tall, I smiled. Maybe spring really has finally sprung.Instagram contentThis content can also be viewed on the site it originates from.As with most vegetables, the better they are, the less you have to do to them. Though, you still gotta do something.I’m partial to blanching my asparagus. First I snap off the ends—bend a stalk with both thumbs and forefingers, and the woody ends will break off at their point of inflection (if that’s the correct use of that phrase). Then I lay them flat on a cutting board and peel their lower halves. It was at this point during our daily ideas meeting here at bonappetit.com where the decidedly younger staff stared at me like I was IN-sane.“You peel your asparagus!?!”“What, you guys don’t!?!”I just assumed everyone decent home cook did. Why? Because it looks really cool, and because you eat with your eyes, and because this is what the French do, and the French know asparagus. So there.Or go ahead, grill it, and add this ginger-miso dressing.\nLaura MurraySpeaking of the French, they also like their asparagus really thick. Follow their lead. Thick stalks allow you to achieve a nice al dente texture without having to worry about ending up with those limp, pencil-thin asparagus you’re served at weddings. You know that saying, “You can never be too thin or too rich”? Well, asparagus can be too thin.Okay, back to the blanching. Liberally salt your water. When it’s boiling, drop in your trimmed and peeled asparagus. (Or, if you’re fancy, like Amiel Stanek’s parents, you can buy one of these vertical asparagus cages. Oh, an Amiel sidebar: When he was home last spring, he diced up some asparagus and dropped them into a pot of green minestrone. His parents looked on horrified. “You cut up your asparagus!?!” Apparently, I’m not the only one with feelings about asparagus.) Cook your asparagus in the vigorously boiling salted water for just a couple minutes. You want the asparagus firm-ish in the center, soft on the outside.At this point, you can remove the asparagus and immediately douse it with lots of lemon juice and a bit of olive oil, and sprinkle with sea salt, and serve it. Or you can plunge it in an ice bath and serve it cold, maybe with a fast and easy hollandaise, speaking of fancy.Sure, you can also roast it or grill your asparagus, too. Both are great options. Just don’t do it at Thanksgiving or Christmas. That’s not asparagus season—this is.1 / 43ChevronChevronVegetarian CarbonaraView RecipeExplore Bon AppétitAsparagusSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Adam Rapoport"]}