{"id": "1e917a661c1a4d5fef96dad4cf3a6704", "url": "https://www.bonappetit.com/recipe/creamy-cauliflower-soup-with-cheesy-mustard-croutons", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Creamy Cauliflower Soup With Cheesy Mustard Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy Cauliflower Soup With Cheesy Mustard CroutonsBy Christina ChaeyFebruary 16, 20224.7(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintActive Time1 hourTotal Time1 hourMost permutations of cauliflower (roasted florets, cauliflower rice, yes, even cauliflower gnocchi) rarely tempt me. But when you simmer a whole head of cauliflower with onion, garlic, and half-and-half, then blend it all until thick and velvety, it makes a sublime creamy cauliflower soup that’s all the more remarkable because it's so quick to prepare. Half-and-half adds just the right amount of rich dairy flavor to help the cauliflower taste its best, but you could also use milk, heavy cream (or mix equal parts of both for DIY half-and-half), or plant-based milk. Don’t skip the white pepper or the fresh lemon juice—they’re the secret ingredients that’ll have you craving spoonful after spoonful. The cheesy mustard croutons on top offer an ideal mix of sharp and rich flavors, but this creamy soup would also be delicious topped with toasted sunflower seeds, a spoonful of chili crisp, or some pesto. —Christina ChaeyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonImmersion Blender$100 At AmazonBlender$32 At AmazonDutch Oven$80 At AmazonBox Grater$13 At AmazonIngredients4 servings3Tbsp. extra-virgin olive oil, divided, plus more for drizzling1medium onion, chopped1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, plus more3garlic cloves, finely chopped1large head of cauliflower (2½–3 lb.), florets broken into small pieces, core chopped¼tsp. freshly ground white or black pepper, plus more¾cup half-and-half1Tbsp. Dijon mustard1Tbsp. unsalted butter, melted5cups country-style bread, preferably day-old, torn or sliced into 1\" cubes½cup finely grated Gruyère or cheddar1Tbsp. plus 1½ tsp. fresh lemon juicePreparationStep 1Place a rack in middle of oven; preheat to 350°. Heat 2 Tbsp. extra-virgin olive oil in a large saucepan or small Dutch oven over medium-low. Add 1 medium onion, chopped, and season with kosher salt. Cook, stirring occasionally and reducing heat if onion starts to brown, until softened but without taking on any color, 5–7 minutes. Add 3 garlic cloves, finely chopped, and cook, stirring, until softened and fragrant, about 2 minutes. Add 1 large head of cauliflower (2½–3 lb.), florets broken into small pieces, core chopped, 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, ¼ tsp. freshly ground white or black pepper, and 5½ cups water (the water should just barely cover the cauliflower). Bring to a boil, then reduce heat, and simmer, uncovered, until cauliflower is completely tender and starting to fall apart, 15–20 minutes. Stir in ¾ cup half-and-half and simmer 5 minutes; remove from heat.Step 2While the soup is simmering, whisk 1 Tbsp. Dijon mustard, 1 Tbsp. unsalted butter, melted, and 1 Tbsp. extra-virgin olive oil in a medium bowl to combine; season with salt and pepper. Add 5 cups country-style bread, preferably day-old, torn or sliced into 1\" cubes, and toss to coat in mustard mixture. Scatter ½ cup finely grated Gruyère or cheddar over and toss again to combine. Transfer bread mixture to a parchment-lined rimmed baking sheet and bake in a single layer, turning halfway through, until cheese is melted and croutons are golden brown and crisp, 10–15 minutes.Step 3Working in batches, carefully purée soup in a blender until very smooth, transferring to a medium bowl as you go. (Alternatively, you can use an immersion blender to blend soup in pot until smooth.) Return soup to pot and reheat over medium-low, stirring and adding more water to thin if needed (you’re going for the consistency of heavy cream). Stir in 1 Tbsp. plus 1½ tsp. fresh lemon juice. Taste and season soup with more salt and/or pepper if desired.Step 4Ladle soup into bowls. Top with cheesy mustard croutons and drizzle with more oil.Do ahead: Soup can be made 3 days ahead. Let cool; cover and chill. Reheat soup over medium-low, adding a splash of water to thin if needed.How would you rate Creamy Cauliflower Soup With Cheesy Mustard Croutons?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleWould add vegetable or chicken broth instead of water to cook the cauliflower not water and cream not half and half  would have been tastier and added some parsley at the end AnonymousNew Jersey 3/18/2022Whether you choose to use them with this soup or to float on some other soup or to top a salad or to serve them in a bowl as snack to accompany a libation (a nice Belgian ale comes to mind) or to include them as part of a charcuterie or crudite board, make these croutons.  They are \"keeper\" with this soup or not.  Sharp white cheddar (as example Cabot's extra sharp) works deliciously well.  dimmerswitchBoise3/8/2022Delicious and easy to make. GloLouisiana 2/22/2022Simply amazing!!AnonymousFt Myers Beach FL2/21/2022Delicious! The croutons with Dijon added a lot of flavor to the soup. Soup needed a little salt, otherwise it was perfect.CarieSt. Charles, IL2/21/2022Pretty good, the croutons had great flavor and crunch. I think the soup could use some extra salt and garlic but I would definitely make this again.KeiraVancouver 2/20/2022Explore Bon AppétitSoupSoups and StewsDinnerMainCauliflowerVegetableHealthyishNut-FreeVegetarianEasySimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-16", "author": ["Condé Nast", "Christina Chaey"]}