{"id": "1e9393bbc2e14c2f10dfdb17a447e2ae", "url": "https://www.bonappetit.com/story/lamb-and-winter-squash-soup", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "This Lamb Soup Is Warming, Spicy, Sweet, and Straight-Up Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Lamb and Winter Squash Soup Is Warming, Spicy, Sweet, and Straight-Up DeliciousWe're talking layers of flavor without homemade stock and all-day prep.By Andy BaraghaniJanuary 17, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenFacebookTwitterEmailThe beauty of this soup is twofold: It is deeply flavorful with a meaty base, toasty spices, charred onions and chiles, sweet squash, and bright toppings. But it also doesn't take all day to make. There is no homemade stock that must be simmered on the stove for hours on end. It's just a crazy-tasty broth without a million ingredients, tender browned meat, and a genius roasted-vegetable puree.I started by roasting a chile in the oven (both guajillo and ancho work great) until it was puffy, which takes about two minutes. Then the onions and garlic get scattered on that same baking sheet, only this time they're broiled until dark, which will take about 12 minutes. Don't be afraid of black spots because that char is what gives the flesh inside a deep smokiness, which in turn will give your soup a smokiness. All those ingredients then get blended into a puree with some added water in a food processor until smooth.Next comes the meat. In truth you could use almost anything here and it would taste good (like pork shoulder, beef stew meat, or even bone-in, skin-on chicken thighs) but I think the lamb makes it special with its fattiness and earthiness. First, heat some oil in a heavy-bottomed pot, then sear the cubes away until they've got a beautiful brown crust. Next comes all the spices, and there are a lot of them. Adding the bay leaves, allspice, coriander, cumin, and oregano to the lamb before the liquid allows them to bloom and develop and really show their stuff.Finally in goes the liquid, which is just six cups of water. That all simmers away for about an hour, maybe more, until the lamb is tender and the water isn't just water anymore. The next few steps are a cinch. Add your rings of squash—I used delicata, but you can pick your favorite here—and it will work great, whether it's butternut, acorn, or anything else.Remember that chile-garlic-onion puree? That goes in next, after the squash is almost-but-not-quite tender. It only needs about 10 minutes before the spiciness has made its way into the backbone of the dish, the flavors are all melded, and the squash has the perfect creamy bite.Last but not least, I thought about toppings. There are three here, and each brings brightness in its own way. First, feta, which is briny and creamy (but not a straight-up sauce texture, like yogurt). Then cilantro, which is bright and herby. And, lastly, a lime wedge to squeeze over top, which is acidic and bracing and pretty much makes everything better than it already is.There you have it. It's a few hours later and you're sitting down to a satisfying, warming bowl of soup that tastes like it's been two days in the making.Get the recipe:Lamb and Winter Squash SoupIf you can’t find delicata squash in your neck of the woods, acorn or butternut will do the trick.View RecipeExplore Bon AppétitHealthyishRead MorecookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Andy Baraghani"]}