{"id": "1ea07b4e69abd84d74d9ca5df66f4ff2", "url": "https://www.bonappetit.com/story/fellow-electric-kettle", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "My Fellow Electric Kettle Grounds Me in the Morning | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Extremely Precise Electric Kettle Grounds Me in the MorningMy Fellow electric kettle not only provides hot water boiled to an exact degree, but also a sense of calm.By Rachel KartenApril 13, 2020FacebookTwitterEmailPhoto Courtesy of FellowFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Mornings are my sanity saver. If everything else about the day is unknown and anxiety-inducing, at least I have the grounding calmness of my routine. Wake up. Do a free online workout. Make oatmeal. Boil water for a French press. Do whatever I can to avoid Twitter (unless it’s for my job).And there’s one thing making this whole routine a little better: my Fellow electric kettle. Unlike most electric kettles, it’s not an eyesore. It’s matte black, super sleek, and doesn’t have the see-through-glass-aquarium-bubble vibes like most versions do. Since I know I’ll get a Slack about it from Alex Delany, I should add that I have the normal spout option because I live in a French press and tea household. But I know many of my BA colleagues love the pour-over, stovetop version. The long neck of the spout allows you to pour at an even, slow pace, which is crucial for a good pour-over. You do you, but let me make a case for this electric kettle.There’s a spinny button that allows you to set the temperature to the exact degree you want, meaning my boyfriend can have his 170 degree water for his tea and I can have my 200 degree water for my French press. Oh, and it heats up QUICKLY. It takes only about five minutes to get to 200 degrees, which just so happens to be about how long it takes me to gather my coffee accoutrement. It brings certainty, in a time of, well, the opposite.Stagg EKG Electric Gooseneck Kettle$149 at The BA MarketPhoto courtesy of NordstromCorvo EKG Electric Kettle$149 at Food52Explore Bon AppétitHighly RecommendShoppingproductRead MorecultureThis Turmeric Chai Is My Proven Winter Coping Mechanism By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Rachel Karten"]}