{"id": "1ea3c1776036355dbd89003c5de68790", "url": "https://www.bonappetit.com/story/3-comforting-italian-recipes-to-bring-your-family-together-at-dinner", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "3 Comforting Italian Recipes To Bring Your Family Together at Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Comforting Italian Recipes To Bring Your Family Together at DinnerThe secret is in the sauce.By Rao’s Homemade®May 23, 2019FacebookTwitterEmailFacebookTwitterEmailIf you’ve ever dined at one of the legendary Rao’s restaurants, you know the drill. You’re like family, and your meal is proof of that: warm, comforting, time-honored flavors and textures make you feel like it could very well be your own Nonna in the kitchen whipping up hearty, homemade entrées. It was this motivation–– to bring diners into the family and Rao’s into the home––that led them to start bottling their sauces back in 1992.Not only are Rao’s Homemade sauces lovingly crafted in small batches and slowly simmered for maximum flavor, they also come in a range of preparations. From Arrabbiata to Tomato Basil, there’s a sauce for every profile and preference. And with these three featured recipes specially developed with Bon Appétit, there’s a saucy Italian dish for every kind of home cook. It’s just the way Rao’s intended it to be.Show us someone who doesn’t love lasagna and we’ll show them the door. This easy-to-make weeknight version is a crowd pleaser, blending both greens and ground beef, and mozzarella and ricotta for a rich, robust taste. It’s perfect for hosting a dinner party on a whim or feeding your family on a Friday night. And since you haven’t got all day to prepare, this recipe takes advantage of frozen chopped spinach, pre-made lasagna noodles, and Rao’s Homemade Marinara sauce. That’s what we call minimum effort for maximum flavor.Weeknight Skillet Lasagna\nMaybe it’s you or maybe its your kids, but there’s always someone in the family who would eat eggs in any form, any time of day. This spinach and sausage frittata is a savory solution to all-day eats, using Rao’s Homemade Arrabbiata sauce, which has a spicy kick. It’s made with tomatoes, garlic, and crushed red pepper, and in this recipe, is the perfect complement to the natural sweetness of Italian sausage, spinach, and basil.Spicy Spinach and Sausage Frittata Affogato\nThis toasty, saucy, cheesy veggie sandwich is a hit among vegetarians or for anyone looking to take five from main-course meats. The combo of lightly fried panko-crusted eggplant stacked between warm buns and covered in provolone cheese with Rao’s Homemade Tomato Basil sauce is both fresh and indulgent. Whether you’re whipping up lunch for a crowd or treating yourself to a week of veggie meals, this sandwich is sure to make it into your regular rotation.Fried Eggplant Sandwiches\nRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-23", "author": ["Condé Nast", "Rao S Homemade"]}