{"id": "1ea5d720d395b60992eeb85d8d26cd07", "url": "https://www.bonappetit.com/recipe/roasted-pepper-caprese", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Roasted Pepper Caprese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Pepper CapreseBy Chris MoroccoAugust 1, 20183.3(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThe hands-off approach for this summery caprese recipe means no blistering the peppers on the stovetop and no need to peel them—although some of the skins will slide right off after cooking if you nudge them along. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings3lb. mixed bell peppers and chiles (any more than 2 hot chiles and the peppers will end up spicy, which is delicious as long as that is what you are going for; a handful of shishitos are great in the mix as well), large peppers seeded, cut off of cores into quarters6garlic cloves, lightly crushed⅓cup extra-virgin olive oilKosher salt, freshly ground pepper12oz. fresh mozzarellaBasil leaves (for serving)1Tbsp. white balsamic vinegarPreparationStep 1Preheat oven to 325°. Toss peppers, chiles, garlic, and oil in a Dutch oven or heavy roasting pan; season with salt and pepper and toss again to coat. Cover and roast, tossing occasionally, until peppers are very tender, 2–2½ hours. Let cool.Step 2Arrange half of peppers on a platter. Top peppers with mozzarella and basil. Measure out 3 Tbsp. of the oily juices left behind and transfer to a small bowl (save remaining peppers and their juices for another use; we love them tossed with pasta, layered into sandwiches, or stirred into frittatas). Add vinegar; season with salt. Stir to combine, then drizzle dressing over salad.Step 3Do Ahead: Peppers can be roasted 1 week ahead. Cover and chill.How would you rate Roasted Pepper Caprese?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made this recipe using about 12 ounces of peppers.  I used mini bell peppers, split them in half to remove the seeds and white part.  I also added in one poblano and quartered it.  I only had to cook them for about an hour and had no issues with the skins being left on.  I really liked this recipe but will use a spicier pepper in the future.  Highly recommend you salt well, especially if using fresh mozzarella.AnonymousAustin, Texas5/26/2020Question for the other reviewer here….what herbs do you recommend? Also, I see that many italian cooks only remove the skins, and then marinade in a combination of olive oil, garlic, herbs and maybe capers. Doen's the slow roasting for 2 hours make them too soft or even mushy? Vinyljunkee3Michigan7/18/2019Love peppers, but I would always skin them, Italian style. Few things are worse than soggy pepper skins, in my book. Get them nice and blistered, skin them and the cook them low and slow (way lower than 350 degrees, more like 225) for a couple of hours in ample olive oil with garlic and herbs. Delicious and a staple in my fridge. andreasduessToronto8/26/2018Explore Bon AppétitItalianEuropeanItalian AmericanAmericanBell PepperVegetableMozzarellaCheeseBasilHerbs & SpicesSummerEasy5 Ingredients or FewerSideVegetarianGluten-FreeNut-FreeHealthyishRoastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast", "Chris Morocco"]}