{"id": "1eae245909ae86d904e0f133d9853c3d", "url": "https://www.bonappetit.com/recipe/corn-plum-and-farro-salad-with-nuoc-cham-dressing", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Corn, Plum, and Farro Salad with Nuoc Cham Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCorn, Plum, and Farro Salad with Nuoc Cham DressingBy Rachel GurjarJuly 6, 20214.7(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis super-summery grain salad is easy to switch up: Stone fruits like peaches or nectarines would be just as good as plums, and other grains like quinoa are an easy swap for the farro. Typically a dipping sauce, nuoc cham is used in a variety of ways in Vietnamese cooking, which inspired the tangy, sweet, and salty condiment’s use as a dressing in this recipe. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWeber Propane Grill$569 At AmazonMedium Pot with Lid$155 At AmazonCitrus Juicer$7 At AmazonGlass Storage Containers$36 At AmazonIngredients4 ServingsNuoc ChamJuice of 2 limes3Tbsp. fish sauce2Tbsp. seasoned rice vinegar1Tbsp. light or dark brown sugar2garlic cloves, finely choppedsalad and assembly½cup semi-pearled farro1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more3ears of corn, husked4red plums (such as satsuma or Santa Rosa), cut into wedges2red or green Thai chiles, thinly sliced⅓cup chopped mint½cup chopped Thai basil or cilantro, plus leaves for servingPreparationNuoc chamStep 1Whisk lime juice, fish sauce, vinegar, brown sugar, and garlic in a small bowl until sugar is dissolved; set dressing aside.Do ahead: Dressing can be made 1 day ahead. Cover and chill.salad and assemblyStep 2Bring farro, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 1 quart water to a boil in a medium pot. Reduce heat, cover, and simmer until farro is tender but still chewy, 20–25 minutes. Drain off any excess liquid and let cool.Step 3Prepare a grill for medium-high heat. Grill corn, turning occasionally, until kernels are charred, 10–15 minutes. Transfer to a cutting board and let sit until cool enough to handle. Cut kernels from cobs.Step 4Combine farro, corn, plums, chiles, mint, and ½ cup Thai basil in a large bowl and drizzle reserved dressing over; toss to coat. Taste and season salad with more salt if needed. Transfer to a platter and top with more Thai basil leaves.Do ahead: Farro can be cooked 1 day ahead. Transfer to an airtight container; cover and chill.How would you rate Corn, Plum, and Farro Salad with Nuoc Cham Dressing?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis was outstanding!  Flavors and textures work incredibly well together.  Don't skip grilling the corn - that charred flavor really makes the dish.Jackie MMadison, WI9/11/2021This was really good!  Fast, easy and delicious.  I used leftover corn on the cob (about 2.5-3 cups of kernels cut off the cob) and just charred it a little in a frying pan.  I also had fresh small purple plums with yellow flesh so I used more and they were great.  I only had a jalapeño pepper, but that worked well too.  The farro gave it a nice chewy texture.  I served it as a main course on a bed of arugula with a bit of leftover grilled mint chicken sliced up on top, but it would be great on its own.LizOttawa, ON8/24/2021This was an amazing dish! The flavor is fantastic and it looked  gorgeous for our dinner party! I cannot wait to make it again and I wouldn’t change a thing.AlisonColorado 8/23/2021Excellent, we used some local peaches and it was amazingAnonymous8/11/2021Delicious! My husband said it was “restaurant quality…no, really good restaurant quality”. I only did one pepper (with seeds) and added some arugula in at the end, but otherwise followed the directions exactly. I found a recipe for a Thai inspired marinade and grilled some chicken on the side. Will definitely make again!Samantha Los Angeles, CA8/2/2021This is good and the flavors develop really well as it sits in the fridge. I often love to eat a side dish for dinner but for me, even after swapping in quinoa for farro, this was crying out for a protein. I added some quick fried tofu on top and it brought the whole thing to life. The interplay of the grilled corn was fun with the plum!AnonymousChicago7/9/2021Explore Bon AppétitSaladFarroRice & GrainsCornVegetablePlumStone FruitFruitThai ChileChileSummerSideDairy-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}