{"id": "1eb148c8020a6175349f871cb41e9406", "url": "https://www.bonappetit.com/recipe/brothy-pasta-with-miso-butter-turnips", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Brothy Pasta With Miso-Butter Turnips Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueBrothy Pasta With Miso-Butter TurnipsBy Carla HallFebruary 8, 20223.7(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrint“Turnips and their greens do not get enough love, in my opinion,” says chef Carla Hall. When simmered in butter and miso, delicate hakurei turnips turn tender and sweet, providing a perfect contrast to their peppery greens. Building on Hall’s Smoked Paprika and Sun-Dried Tomato Potlikker, this brothy pasta is hearty and warming without being too heavy. Making the Smoked Paprika and Sun-Dried Tomato Potlikker is a crucial first step here, so be sure to read through that recipe first.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidLarge Straight-Sided Skillet$290 $199 At AmazonLarge Pot$55 At AmazonHeatproof Measuring Cup$18 At AmazonLadle$8 At AmazonIngredients6 Servings2Tbsp. freeze-dried tomato flakes or tomato powder½tsp. crushed red pepper flakes¼tsp. kosher salt, plus more2bunches hakurei turnips (about 1½ lb. total), trimmed, greens reserved, cut into wedges4Tbsp. unsalted butter1Tbsp. sugar1Tbsp. white miso1lb. orecchiette1quart Smoked Paprika and Sun-Dried Tomato PotlikkerFreshly ground black pepperMicrogreens (optional) and shaved Pecorino Romano (for serving)Special equipmentA spice mill or mortar and pestlePreparationStep 1Grind tomato flakes, red pepper flakes, and ¼ tsp. salt in spice mill or with mortar and pestle to a fine powder. Transfer spiced tomato dust to an airtight container; set aside.Step 2Combine turnips, butter, sugar, and miso in a medium high-sided skillet. Pour in water to cover turnips halfway (about 1½ cups). Bring to a boil, stirring to dissolve miso. Reduce heat to medium-low; simmer, uncovered, until turnips are tender and liquid is reduced by half, 7–9 minutes. Remove from heat; set aside.Step 3Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente. Drain pasta, reserving 2 cups pasta cooking liquid.Step 4Meanwhile, bring potlikker to a boil in another large pot. Add turnip greens; cook until tender, about 2 minutes. Stir in pasta; reduce heat and cook, thinning with reserved pasta cooking liquid as needed to keep the sauce slightly brothy, until pasta is al dente, about 2 minutes. Season with salt and pepper.Step 5To serve, ladle pasta and greens into shallow bowls; top with reserved turnips and their sauce. Sprinkle reserved spiced tomato dust over; top with microgreens (if using) and Pecorino Romano.How would you rate Brothy Pasta With Miso-Butter Turnips?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleAbsolutely amazing to make & eat ~ I saved the strained contents to make a homemade chilli. \nthank you B.A. for the inspirations that amaze me & those who enjoy our family meals,  daily. :) \nKallistoNorthern Ontario Canada3/12/2022I really really wanted to like this. The process of making all the parts was fun but once it came together, the miso butter turnips overpowered the dish in a bizarre and sweet flavor that overpowered the whole meal. It looked gorgeous plated though. Jenna C. Los Angels, CA3/10/2022Made the potlikker first thing in the morning so that the flavors could come together a bit.  The entire house smelled amazing!  Dinner came together super quickly after that.  Husband kept naming other ways we could use the potlikker and son didn't say a word as he gobbled it all up.  We love turnips and the only small ones I could find were purple, but they worked well.  I would think any large turnip would also work, if cut to smaller pieces.  Only wish was that I had also gotten a good loaf of crusty bread to soak up the extra sauce.  Leftovers were great the next day as well.  We'll be making this again!LBinTXTexas2/22/2022Explore Bon AppétitDinnerVegetarianNut-FreePastaTurnipVegetableSouthernAmericanSoul FoodMisoCondiments, Sauces & PastesMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}