{"id": "1ec842d28dc40315c6af807aed7d550d", "url": "https://www.bonappetit.com/story/canned-tomato-questions-answered", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Canned Tomatoes: Your Most Pressing Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll of Your Canned Tomato Questions, AnsweredAlmost everything you need to know about the workhorse pantry staple.By Sarah JampelFebruary 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailOpen the pantry of any member of the BA team and what will you find? Lots of dried beans, perhaps—and definitely a can or two of whole peeled tomatoes. It's dinner insurance: With a can or two on hand, you're halfway to tomato sauce, tomato soup, chili, minestrone, pasta e fagioli... we could go on and on.We've even gone so far as to say that canned tomatoes are better than fresh ones (and we're not taking it back!): They've got all of the flavor (and less of the water content) and they're consistently rich, tangy, and sweet even when tomato season is long, long in the future.But how do you navigate the literal wall of canned tomatoes at the grocery store? And what's the deal with fire-roasted versus diced versus crushed? Behold, our canned tomato 101, which will help you choose the best can for the job and then put it to work.How do I know which one to buy?Choose cans with the fewest ingredients: We prefer tomatoes packed with salt, but avoid sugar, garlic, or any preservatives other than calcium chloride and citric acid.Okay, but there are so many kinds. What are the differences?Whole peeled: Packed in juice or purée, it’s the versatile matriarch of all the rest. When in doubt, stock this can: It can be turned into the other types in a pinch.Crushed: A mix of smushed tomatoes and juices, it’s a handy shortcut to smooth sauces or soups. Look for “no added purée” to avoid weird thickness.Diced: Tomato chunks in juice, often with added calcium chloride to help the pieces stay firm. Use only when you want distinct bits of tomato.Fire-Roasted: Charred over an open flame and sometimes enhanced with natural flavors like onion and garlic powder, they have a smoky flavor.Paste: Hyper concentrated tomato juice. Use a tablespoon or two to add intense tomato flavor to sauces like bolognese; to release its full potential, caramelize it in olive oil until brick red (5 minutes over medium heat, stirring often).Canned cherry tomatoes: a thing!\nAre canned cherry tomatoes a thing?Yes! For extra sweetness and texture in stews, braises, and sauces, seek them out. We like those from Parma-based company Mutti.Buy it: Mutti Cherry Tomatoes, $4 for 14 oz. on AmazonWhat's a San Marzano?Sweet and low acid, with firm, thick flesh, the San Marzano is a super-hyped plum tomato that racks up a hefty price. Certified San Marzanos are grown in the region of Campania in Italy, while those grown elsewhere are technically wannabes. But certification doesn’t guarantee flavor, so ignore the marketing and find a brand you love.How do I store the cans?For best flavor, use within 18 months. Once a can is open, transfer any leftover contents to a glass or plastic container to avoid a metallic taste and refrigerate for up to one week.Can I ever use the tomatoes without cooking them?Um, no. Canned tomatoes should always be cooked and have no place in a BLT or salsa fresca. A long simmer in soups, braises, and sauces will soften them up, concentrate their flavors, and get rid of any bitter or tinny tastes.Canned tomatoes take rotisserie chicken to the next level.\nPhoto by Alex Lau, food styling by Sue Li, prop styling by Elizabeth JaimeWhat's the first thing I should make?Tomato sauce! Purée one 28-oz. can whole peeled tomatoes in a food processor. Transfer to a heavy pot; add 3 smashed garlic cloves, 5 Tbsp. olive oil, and a pinch of salt. Bring to a boil and cook, stirring, until reduced by a third, 20 minutes. Stir in 2 Tbsp. unsalted butter.Then what can I make?Try shakshuka, chana masala, salsa roja, or tomato-braised rotisserie chicken.Any other tips?Slow-roasting whole peeled tomatoes brings out a ton of flavor. Here's how you do it: Drain two 28-oz. cans whole peeled tomatoes. Gently crush and transfer to a rimmed baking sheet where they’ll fit snugly. Season with salt, drizzle with  ¼ cup olive oil, and roast at 250°, tossing twice, 2–2½ hours. Coarsely chop, then mix with cooked grains and Parm, fold into scrambled eggs, or toss with pasta.Explore Bon AppétitCanned TomatoesRead MorecookingYour Most Pressing Maple Syrup Questions, AnsweredBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-18", "author": ["Condé Nast", "Sarah Jampel"]}