{"id": "1eca00da4bf761fb1d71c591167b0697", "url": "https://www.bonappetit.com/story/gourmet-makes-tools", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "11 Crafty Cooking Tools Claire Saffitz Has Rigged on Gourmet Makes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture11 Crafty Cooking Tools Claire Saffitz Has Rigged on Gourmet MakesFrom a blowtorch Reese’s smoothing devise to a….potato?By Alex BeggsMarch 19, 2020FacebookTwitterEmailFacebookTwitterEmailAh yes, the ol’ National Geographic-branded rock tumbler. “Polish everyday rocks into dazzling gemstones!” promises the $59 product on Amazon aimed at avid geology enthusiasts. Or, if you’re Claire Saffitz and stressing to re-create a gourmet version of Jelly Bellys, use it to tumble your homemade jelly beans into industrial-level smoothness.The rock tumbler was one of many unlikely cooking gear Claire has used on her hit show Gourmet Makes. Not to mention all the normie baking tools—offset spatula, a cake tester, metal straws—put to work in unconventional ways. Claire likes to do arts and crafts. She’s creative! Innovative! Like Claire herself, these tools had no intention of making it big, and yet, here we are. Let this list of truly random things inspire you to think outside the baking sheet when you’re cooking. Rewrite the rules. Do your thing. Be free. (And watch all the moments below.)ContentThis content can also be viewed on the site it originates from.SyringeClaire carefully injected pomegranate molasses into her homemade Gushers with a syringe. She also used the syringe needle to create “air escape valves” in her pizza rolls. Both were pilfered from Brad Leone’s unexplained stash of medical supplies.ContentThis content can also be viewed on the site it originates from.National Geographic rock tumblerYou’ve never seen anyone as excited as Claire when she received her National Geographic rock tumbler to smooth out the surface of her jelly beans. “It’s been years that I’ve been requesting this,” she says. The show’s producers purchased it on Amazon, and now, so can you.ContentThis content can also be viewed on the site it originates from.Salad spinnerWhen it came time to coat M&Ms and Warheads, Claire’s creative solution was to shake them around in a salad spinner to imitate a candy drum, a confectioner’s tool that can cost over $1,000—not in the Gourmet Makes budget.ContentThis content can also be viewed on the site it originates from.Metal strawClaire shaped her tubular gourmet Combos dough around a metal straw. Nifty!ContentThis content can also be viewed on the site it originates from.A potatoInspired by making stamps out of potatoes in elementary school, Claire tried to create a mold for Mentos with a raw potato. “That was Dan’s idea,” says Claire, referring to the show’s director, Dan Siegel. “It was a tremendous failure.”ContentThis content can also be viewed on the site it originates from.BlowtorchClaire used a blowtorch to smooth out the tops of her Reese’s peanut butter cups. She’d also tried keyboard dusting spray, which was “extremely toxic—but it worked well,” she said. That was edited out.ContentThis content can also be viewed on the site it originates from.Cannoli moldsIt’s handy to keep cannoli molds around, you know, in case you need to create a core for fudge in homemade Ben & Jerry’s ice cream.ContentThis content can also be viewed on the site it originates from.Dremel rotary power toolWith a Dremel rotary power tool and the proper protective eye gear, Claire sharpened a wavy mandoline blade to make Ruffles ridges.ContentThis content can also be viewed on the site it originates from.Amazing Mold PuttyShe’s used the food safe putty to make molds for Tagalongs in the Girl Scout cookies episode, as well as M&Ms, Oreos, and Jelly Bellys. The show’s producers buy it on Amazon for $18.ContentThis content can also be viewed on the site it originates from.Styrofoam photo bounce boardsClaire cut up a board from the photo team (used to reflect light) so she could create a drying rack for Mentos, and then later, Jelly Beans, as well as a display for Pocky. The “Mentos torture devise” is currently on display in the Gourmet Makes Museum (along with all of those molds she’s made), which is a random desk on the video department floor of the Conde Nast offices in New York.ContentThis content can also be viewed on the site it originates from.Airbrush kitThe Test Kitchen’s trusty airbrush kit has made a few appearances: for Skittles, M&Ms, and Jelly Bellys. Claire has to suit up in several aprons when she uses it to avoid getting stained.Read more: Sing Alongs and Tagalongs: What Goes Down on the Set of Gourmet MakesRead MorecultureSing Alongs and Tagalongs: What Goes Down on the Set of Gourmet MakesBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Alex Beggs"]}