{"id": "1ed71cfa9f8ae54f1a37f67bf5270710", "url": "https://www.bonappetit.com/recipe/one-pot-puttanesca", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "One-Pot Puttanesca Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueOne-Pot PuttanescaBy Ali Slagle February 8, 20224.7(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, food styling by Pearl Jones, prop styling by Marina BevilacquaEmailPinterestPrintEmailPinterestPrintIn this hearty-yet-streamlined puttanesca from Ali Slagle’s cookbook I Dream of Dinner (So You Don’t Have To), the dried pasta cooks directly in a tomato-rich broth full of capers and olives for maximum flavor absorption with one fewer pot to clean. The crunchy anchovy panko topping is optional but highly recommended.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonWooden Spoon$6 At AmazonHeatproof Measuring Cup$18 At AmazonMedium Skillet$60 At AmazonIngredients4 servings6garlic cloves, thinly sliced4oil-packed anchovy fillets, divided⅓cup plus 2 Tbsp. extra-virgin olive oil½cup Kalamata olives, coarsely chopped6Tbsp. double-concentrated tomato paste3Tbsp. drained capers½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more¼tsp. crushed red pepper flakes, plus more for panko8oz. small pasta (such as ditalini, orzo, or mini shells; about 1½ cups)5oz. baby spinach (about 4½ cups)½cup pankoPreparationStep 1Cook garlic, 2 anchovies, and ⅓ cup oil in a medium Dutch oven or other heavy pot over medium heat, stirring and smashing anchovies with a wooden spoon, until garlic starts to brown around the edges, about 3 minutes. Add olives, tomato paste, capers, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and ¼ tsp. red pepper flakes and cook, stirring, until tomato paste turns a shade darker, about 3 minutes.Step 2Add 4 cups water to pot, increase temperature to high, and bring to a boil. Add pasta and spinach, tearing leaves into smaller pieces as you go. Stir to combine, then reduce heat to medium and simmer, stirring often to keep pasta from sticking, until cooked through, 10–12 minutes.Step 3Meanwhile, heat remaining 2 anchovies and 2 Tbsp. oil in a medium skillet over medium. Add panko and a pinch of red pepper flakes and salt and cook, stirring often and breaking anchovies apart, until golden brown, about 2 minutes.Step 4Divide pasta among bowls and top with panko mixture.Recipes excerpted with permission from ‘I Dream of Dinner (So You Don’t Have To)’ By Ali Slagle. Copyright © 2022 By Alexandra Slagle. Published by Clarkson Potter. \n\nBuy it on Amazon or Bookshop.orgHow would you rate One-Pot Puttanesca?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis is so good.  Definitely a keeper.  As one other reviewer said I also added the baby spinach in at the end along with sliced calamari for some protein.  Served to guests, it could be made up through adding the water and then finishing just before serving.  I used shells and the Panko is a must for both flavor and crunch.SherwoodSeattle, WA3/19/2022This was delicious but I would make it with less water- probably a half cup less. The sauce was too loose for me and I couldn’t cook it off without overcooking the pasta. I also had to add a little extra salt (even with these salty ingredients), and I think reducing the water slightly would fix that too. Otherwise it was fast, easy, and tasty! Will be cooking again. Sara MSt. Petersburg, FL2/22/2022Loved this dish! Made a couple of changes to the recipe: I opted to add the spinach at the end to keep it fresh and also added some shrimp which worked so well with the flavors of the recipe. StephanieNew York2/21/2022Perfect in every way. Very comforting! Didn’t have kalamata or spinach, subbed tapenade + lacinato kale. Highly recommend.LPBrooklyn, NY2/20/2022Delicious. Did not have kalamata or capers in the house, subbed Morrocan olives and used more anchovies in both parts. Next time would roughly chop the spinach ahead of time and wait until the pasta was 1/2 cooked before adding the spnach, it got a bit overcooked and stringy with with 12 minutes of simmering. Make 2x the anchovy breadcrumbs because they're genius and hands-down the best part.KT2/17/2022I happened to have every ingredient already in my pantry so I eyeballed it (just make sure you taste along the way), and it came out super tasty and savory! Extremely easy.skskskGreenpoint, Brooklyn2/10/2022Explore Bon AppétitDinnerOne-Pot MealsDairy-FreeWeeknightEasyPastaDitaliniPasta & NoodlesOrzoOliveOther IngredientsSpinachLeafy GreensVegetableMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Slagle"]}