{"id": "1ed94658f06b9aa93443a22aa173dc20", "url": "https://www.bonappetit.com/recipe/chicken-and-rice-meatballs-with-hummus", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Chicken and Rice Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueChicken and Rice Meatballs With HummusBy Chris MoroccoDecember 26, 20194.6(68)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintGluten-free meatballs are as easy as adding cooled cooked rice instead of bread to ground meat. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings6scallions, thinly sliced2garlic cloves, finely chopped11\" piece ginger, peeled, finely chopped1lb. ground chicken1½cups cooled cooked white rice¼cup extra-virgin olive oil2tsp. hawaij, baharat, curry powder, or other spice blend1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1small white onion, thinly sliced4small dill pickles, sliced2Persian cucumbers, sliced2cups parsley leaves with tender stems1Tbsp. fresh lemon juiceHummus and lemon wedges (for serving)PreparationStep 1Preheat oven to 425°. Gently mix scallions, garlic, ginger, chicken, rice, oil, hawaij, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl (don’t overwork). Form mixture into 12 balls (about 1½\" in diameter). Place on a rimmed baking sheet and bake until lightly browned and cooked through, about 15 minutes.Step 2Toss onion, pickles, cucumbers, parsley, and lemon juice in a medium bowl to combine; season salad with salt.Step 3Spread hummus on plates; top with meatballs and salad. Serve with lemon.How would you rate Chicken and Rice Meatballs With Hummus?Leave a ReviewTell us what you thinkReviews (45)Back to TopTriangleReally liked this, the meatballs cam out flavorful and juicy and the hummus and salad really went well with everything. AxelMalta3/18/2021One of our favorite healthy recipes. We typically substitute brown rice for white, and can't tell the difference. So easy, fast, and deliciousNYC Cats12/31/2020So great. I always double (or triple!) and freeze for soups.\nI don’t have hawajj but make my own - turmeric, cumin, and coriander. used the bottom of a mug in a bowl as my mortar and pestle. Everytime I make them I remind myself that I can have a heavier hand with spices next time - the balls can handle it!BiancaBrooklyn NY11/28/2020I quite enjoyed this dish. The aromatic meatballs were complementary to Asian, Latin, and Mediterranean flavors, and will work well in other dishes.  I plan to use the leftover meatballs to upgrade store bought ramen, in albondigas, or in a riff on Italian Wedding Soup (i made smaller meatballs yielding about 18, so perfect for soup)!\n\nAs per others commenting about the amount of oil, i cut it in half to about 1/4 of a cup, and was able to brown the meatballs on a quick spin under the broiler.   The meatballs were still tender, although perhaps not quite as soft as they would be with the full complement of olive oil, \n\nI used Ras el Hanout seasoning, about as much as called for.  I imagine cumin would be a nice addition, and possibly cilantro to make a more Latin or Asian inspired dish.  I served with a slightly modified version of the recipe salad, homemade hummus, labneh, and freshly baked pita bread from aa local Turkish market. brainyzanyLos Angeles, CA10/22/2020Incredibly delicious! When I read through the recipe I thought, \"hmm, this could be less than great,\" but the reviews were so glowing that I had to try it. My pickiest child, after his first taste, said \"Why haven't you ever made this before? You need to make this again, soon!\" The meatballs contain a really fabulous combination of flavors and are not difficult to throw together. I subbed shallots for scallions, and used ras el hanout for the spice mix, and cobbled together a quick cucumber/onion/tomato salad. I feel like you could riff on this recipe in any number of ways and it would still be wonderful. I credit the magic that is Chris Morocco.AnonymousNYC adjacent8/7/2020I don't know why I was surprised that these meatballs were so good. I was worried that they would be too soft with adding the olive oil but they held their shape and the garlic, ginger, and baharat created great flavor. I served them over store bought hummus and a tomato cucumber and lime juice salad that paired well with the flavors.AnonymousMontana7/7/2020Loved this recipe, so good! The chicken and rice meatballs are so flavorful and without the heavier greasiness of a beef or pork meatball. I added roasted red pepper to my homemade hummus which really paired well with the whole thing. adamleclairOsaka, Japan 5/16/2020Like most recipes, this is a great one to fiddle with to make it work for your personal taste.  I made it strict to recipe the first time and thought it was okay, but not fabulous.  This week, I added a tsp. each of turmeric and cumin, added a scant 1/4 tsp. of cayenne, and changed up the scallions for a shallot (because that is what I had).  I liked them so much better, and just served with a nice salad on the side.  Today, I sliced up the leftover meatballs, put them on toasted sour dough with some avocado mayo, salty pickled onions, and some crunchy romaine.  Yowzah!  I would make the meatballs again just to have that sandwich.AnonymousColorado5/15/2020I thought this was interesting but the proportions were off. Agree with other posters that there was too much rice in the meatballs. The salad that accompanied it wasn't great. I'd try making something similar again with some tweaks. It needed some sauce so we made a simple yogurt sauce and served it with flatbread as well.Anonymous5/5/2020I made the meatballs with Baharat spice mix using recipe from food.com and used arborio rice. Everyone in family liked which is always a bonus. Made my own hummus and served with different side salad.Anonymous5/3/2020I've made this recipe twice now, and with a few tweaks it'll definitely stay in my rotation. The first time I made it I thought the amount of rice was too much and made the balls difficult to form even when raw, then impossibly crumbly once cooked. The next time I cut the rice to 1 cup and thought the texture was way better. I wish the outsides were more browned like the photo, but the recipe is super tasty. katadams934848Los Angeles, CA4/19/2020Make this recipe.  These meatballs are so good and the hot meatballs with the cold hummus and the crunchy salad is all a really good combo.  If you are thinking that putting meatballs on hummus is weird, trust me -- you'll be going back in for more hummus.  Also, the meatballs reheat well and make a great leftover in a pita or with breakfast the next day!AnonymousSeattle4/6/2020These. Are. Dope. Seriously, they're so versatile and can be de and reconstructed into whatever you'd like. I made tacos out of them the other day, and it was a revelation. Whatever you're doing, you're doing it wrong if this recipe isn't in your rotation. Octopus1Asheville, NC4/2/2020There was no hummus of choice in the store so I made them with Greek yogurt + Green Italian Salsa and it turned out suuuper delicious! Sergey ZMoscow, Russia3/6/2020these meatballs are a revelation. they’re so easy and so dang good. i didn’t think i likes hummus particularly until eating it with these! didn’t love the pickles in the salad the first time, so on the second round, substituted chopped hot banana peppers instead (maybe 1/4-1/3 cup) and it was delicious! nyc3/1/2020Explore Bon AppétitMeatballRiceRice & GrainsGround ChickenChickenPoultryQuickEasyWeeknight MealsMainGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Chris Morocco"]}