{"id": "1ee71b0b6fc1810b8632abcb06a82d18", "url": "https://www.bonappetit.com/story/how-two-chefs-bring-their-top-notch-standards-home-to-dinner", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "How Two Chefs Bring Their Top-Notch Standards Home to Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow Two Chefs Bring Their Top-Notch Standards Home to DinnerCafé Modern Glass are chef-inspired appliances for home cooks. But what if you’re already a professional chef? The standard stays the same.By Café AppliancesDecember 4, 2019FacebookTwitterEmailFacebookTwitterEmailMokbar’s Esther Choi and personal chef Brandon Crowe spend their careers in kitchens, so unsurprisingly, their food and service philosophies spill over into their at-home entertaining. While menu inspirations vary, there is a natural overlap that you'd expect from professional chefs. They both rely on what’s in season, and each is hyper-organized. Brandon likes to be 80 percent finished cooking by the time guests arrive. ”I’m still in the kitchen cooking, but I’m not so busy I can’t have a glass of wine and conversation with them,” he says. Esther makes sauces, chops veggies, and, of course, does all the shopping ahead of time. “You never have enough time the day of, so make sure you already have everything you need at home. Otherwise, it’s not going to happen,” she says with a telling laugh that she’s learned from experience.For both chefs, family-style is the way to go. “We’re big on collaboration in the kitchen,” Brandon says of the parties he and his wife like to host. “I think guests enjoy feeling like they learned something, even if it’s simple, that they can incorporate into their cooking at home.” He notes that he’s fortunate to have a great home kitchen––a large workspace and island countertop––that was designed with his and his wife’s love of entertaining in mind.“I take a lot of pride in the design elements of my home,” he says, explaining that what he appreciates about the Café Modern Glass Collection, the array of smart, chef-inspired appliances meant to reflect one’s personal style, is their effortless minimalism. “There’s a lot to be said about appliances with a clean, understated design. When they’re high-performing, they don’t need to be flashy.”Both Brandon, who is anti serving plated food at dinner parties, and Esther agree that immersive dining experiences are the most fun. “Asian food is very interactive,” says Esther, whose professional specialty is Korean food. “People usually want to get their hands dirty with me.” She leans into dishes like dumplings with a variety of fillings, cooked different ways, or hot pot. “I set out pots of boiling stock and lots of seasonal veggies––whatever is fresh at the market––plus upscale meat like Wagyu and a nice seafood variety like scallops or head-on shrimp. I’ll have noodles and at least four or five dipping sauces. It’s the ultimate hot pot experience.”For Esther, smart, innovative appliances could work wonders for her dinner parties. “I need to be able to control the temperature and turn off my oven from my phone,” she says, referring to the Wi-Fi–enabled feature on Café Modern Glass ranges. “If I need to run errands, I don’t want to have to babysit a roast that’s going to take four hours. Timing and control are very important when you’re hosting a dinner party because you have a million things you need to do!”The two chefs also agree that the most important element of a dinner party is making guests feel comforted. Brandon explains: “In my work as a personal chef, sometimes that hour––breakfast, lunch, or dinner––is the only hour where they can forget about their email or put down their phones. I want to create a familial environment where everyone can relax, and I do the same for my dinner parties: hope they forget about everything else and just be completely satisfied with the food, drinks, and company.”Esther, who learned to cook from her grandmother, still models her cooking after the lessons she learned when she was a child. “My grandmother believed that when you’re hosting, you're cooking for those people; you’re pouring your whole heart and soul into every part of the meal, from the menu planning to buying and cooking the ingredients, right down to clearing the plates,” she says. “At the end of the night, I want people to have the feeling of a happy belly and soul, to feel like they just ate at their grandma’s place.”Even when they’re off duty, these professional chefs don’t stop thinking about food––how it builds new relationships and connects existing ones. But with a little help from the right appliances, it makes entertaining a little easier, and more stylish too.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-04", "author": ["Condé Nast", "Café Appliances"]}