{"id": "1ee7074cd73b8d34ba8a8d64d2d725a8", "url": "https://www.bonappetit.com/story/light-versus-dark-brown-sugar", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Light Versus Dark Brown Sugar: What’s the Deal? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLight Versus Dark Brown Sugar: What’s the Deal?We've got some good news.By Sarah JampelMay 28, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailYou probably have a lengthy list of items you need to keep stocked in the house at all times: coffee, toothpaste, conditioner, coffee, eggs, beer, bandaids, coffee, hand sanitizer, laundry detergent, TOILET PAPER… You’ve got a lot to take care of, so it’s understandable that you wouldn’t always have both light brown and dark brown sugar on hand whenever a desire to bake something strikes. Just having one is a victory!And yet, some recipes demand light and others dark. The good news is that light and dark brown sugar are interchangeable: You’re not going to ruin your cookies, your crumble, or your banana bread by swapping one for the other.But let’s take a step back: What even is brown sugar? Refined brown sugar (as opposed to raw brown sugars like turbinado or muscovado) is simply white sugar with the addition of molasses. And the amount of molasses is what distinguishes light brown (less molasses) from dark brown (more). Dark brown sugar actually contains nearly twice as much molasses as light (6.5% as compared to 3.5%), which gives it a richer caramel flavor.While light and dark brown sugar are interchangeable, they’re not exact substitutes. Using dark brown sugar when a recipe calls for light will give your final product a more robust taste and a darker color, and it might slightly affect the texture. Because acidic molasses reacts with baking soda, using dark brown sugar in place of light might cause a higher rise and/or a wider spread. This probably isn’t something you’ll notice unless you’re conducting a side by side test of two batches, but it could be a reason that your cookies don’t come out exactly like the ones in the photo.It’s also worth noting that the more brown sugar the recipe calls for—a whole cup as opposed to a couple of tablespoons—the bigger the impact a substitution will make. If you’re whisking together a marinade and you only have light brown sugar, NBD. But if you’re baking a crumb cake that calls for a whopping 1¾ cups dark brown sugar for the streusel, you’ll probably want to get your hands on the right stuff since so much of the flavor is going to come from the additional molasses.All that being said, if you’re only going to keep one kind on hand, let it be light brown sugar. It’s more common, a bit more versatile due to the subtler flavor, and many pro bakers (like Dorie Greenspan, Joanne Chang, and Sarah Kieffer) use it to develop their recipes.Just add it to the mental list, right after the toilet paper.A muffin!Butternut Squash, Coconut, and Ginger MuffinsLike the best possible Morning Glory muffins but with grated butternut squash instead of carrot.View RecipeExplore Bon AppétitBasically BakingBrown SugarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "Sarah Jampel"]}