{"id": "1ee9c4ad145568585611a1589ae2d0a2", "url": "https://www.bonappetit.com/story/a-skeptic-tries-decaf-coffee", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "A Skeptic Tries: Decaf Coffee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: Quitting CoffeeIn an era that glorifies hustling, keeping calm and caffeine-free is my small act of resistance.By Luna AdlerDecember 6, 2021FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmailA Skeptic Tries is a series examining our food resistances and what happens when we try them anyway. Next up, writer Luna Adler—after a few too many caffeine-induced, sweat-soaked anxiety spirals—finally decides to give decaf coffee a shot.One morning a few years ago, I woke up and traipsed downstairs for my morning cup of decaffeinated coffee. I removed the jar of brown liquid I’d brewed the night before (from where it sat on the refrigerator shelf beside my roommate’s identical jar of regular coffee), added what has been described to me as an “upsetting” amount of whole milk, and downed the entire thing.An hour later, I was sitting at my office desk, shaking and feeling nauseated. As my state worsened, I could tell my coworkers were beginning to get nervous. By noon I was shivering like a wind-up toy and had wrapped myself dramatically in a sheath of blankets. Before lunchtime I’d discarded said blankets and was experiencing what I reported to one colleague as, “a strange pattering of the heart.” By 3 p.m., my manager—thinking I was (at best) coming down with something deadly and (at worst) coming down with something deadly and highly contagious—sent me home.Sitting at the dining room table that night, cocooned in my warmest pair of raccoon-themed footie pajamas, my roommate walked in. Dark circles wreathed her eyes. “I had the worst day,” she said. “I was so exhausted. It was like I couldn’t wake up.”“My manager sent me home because I was acting like a squirrel on speed,” I said, proffering a quivering hand. We looked at each other, the realization percolating between us.“I think we may have switched coffees this morning,” she said.Listen, I wasn’t always a decaf drinker. And, in the past, I certainly never wanted to identify as one. We all know that decaf is largely imbibed by those who have to drink it: pregnant people, the elderly, those who take caffeine-averse medications. Plus, there’s some sort of bad boy charm to regular coffee. (Check me out! I’m housing stimulants at 7 a.m.!) A cup of coffee is an accessory. But unlike sporting a designer handbag—which tells others that you prioritize buttery-soft leather and class signaling—carrying a vessel of desperately needed caffeine has become synonymous with being Very Busy and Very Successful. It says, “Look how hard I’m grinding.”I did drink real coffee when I was an undergrad in college. A lifelong insomniac, there were mornings when I’d watch the sun crest the horizon and knew I’d need a boost. So, instead of trying to nap, I’d house a triple-shot latte and white-knuckle my way through the day, perspiring while I took exams and forcing myself to write papers through chattering teeth. What would I be sacrificing by foregoing the desultory cup of coffee? I wondered. Would I fail my classes? Sleep through midterms? Tank a job interview? As a hopelessly type A person, the idea of not being able to deliver was petrifying to me, especially when it could be so easily avoided with the aid of a legal stimulant, purchased without fuss—and only for a few dollars!—from one of the 3,000-plus coffee shops littering New York City.Looking back, I don’t remember my first sip of decaffeinated coffee, but I know that the transition was catalyzed by a few too many sweat-soaked anxiety spirals. And after nearly a decade of steady decaf drinking, it is one of the few daily rituals in which I indulge. I wake up, shuffle to the kitchen, and pack decaffeinated grounds into my trusty Bialetti. I breathe in the nutty smell that permeates my apartment as it heats; revel in the throaty rattling as the espresso pot starts to bubble over; marvel at the silken swish as I pour a long, thin stream into my mug. I add milk, stirring until the liquid is a chestnut color, akin to the eyes of a newborn foal, a lacquered oak dresser, an acorn. And then: the first velvety, Dionysian sip. Coffee is often described as floral, sometimes sour, maybe astringent. But I find it to be equal parts malt-like and buttery, blooming with delicate, chocolaty undertones.Now, I know that some of you are sitting in front of your computers with your third espresso at your elbow, speed reading this article and silently screaming that I’m missing the whole point. The taste is good but the caffeine high is the fun part; that buzzy afterglow that allows us to push ourselves harder, get shit done. And in a performance-crazed society, it makes sense that mass messaging would reinforce caffeine. That start-ups would boast communal kitchens stocked with slender white cans of La Colombe cold brew and draft lattes on tap. That the internet would be rife with mugs and merch boasting loopy-lettered slogans like “Death Before Decaf” and “Decaf? Decline.” We drink caffeinated beverages so we can push our bodies to produce more, convince ourselves we absolutely adore our jobs, and toil harder. Caffeine is a productivity enhancer, the little blue pill of the capitalist machine. And in this light, opting out almost feels like a form of resistance.Once I stopped using caffeine as a crutch, I found that after an unusually late or sleepless night, it actually felt good to skip the “full-strength” latte and instead resign myself to a slower day, where I achieved less. Canceling an appointment or being a little late on a deadline felt better than the physical and emotional ramifications of showing up. Since switching to decaf, my morning joe doesn’t derail my day. Its pleasure is no longer tempered by the fact that I know I’ll be paying for it later with a first-class panic attack. Drinking a cuppa decaf is simply the thing I do before I scramble my eggs, or saunter to the park to watch the bike-riding MAMILs (Middle-Aged Men in Lycra), or find myself getting sucked down an internet rabbit hole discussing whether or not Prince Charles is a closeted vampire.Caffeine stans may bristle, but I’d argue that I harbor the purest love for coffee. Now I drink it for the taste, the ritual—not the amount of hours I can or can’t clock after ingesting it. I love the way it tastes so much that I’ll brave the criticism and rain-drenched odysseys to find that lone café offering something I can consume. I have yet to find a kitschy mug that says it, but “I’ll Drink Decaf ’Til I Die.”Convinced? How to Quit Caffeine without Becoming a Miserable PersonView StoryExplore Bon AppétitA Skeptic TriesCultureCoffeeRead MorecultureA Skeptic Tries: OatmealBy Joel WigelsworthcultureA Skeptic Tries: Dairy Queen's Dipped ConeBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-01", "author": ["Condé Nast", "Luna Adler"]}