{"id": "1eebc58f41d6dd422dc19647e9a46882", "url": "https://www.bonappetit.com/story/is-pre-minced-garlic-ever-okay", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Is Pre-Minced Garlic Ever Okay? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIs Pre-Minced Garlic Ever Okay?You know the tub of little garlic cubes that might be sitting in your fridge right now? Yeah, we have some thoughts.By Alex DelanySeptember 4, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailHaving a tub of pre-minced garlic in the fridge seems like a smart move. If you need a hit of garlic and don’t have any, it’s there. Pop the lid, scoop some out, and throw it in your braise. But if you open the doors of our fridges (or step into the walk-in of our Test Kitchen), you won’t find pre-minced garlic anywhere. That’s because we don't think you should be using pre-minced garlic at all*.This might sound like we’re on a high horse, preaching some gospel of food snobbery. We’re not. We’re serious about this. Allow us to explain.The culprit.\nPhoto by Chelsie CraigThe minute you slice, crush, grate, or chop garlic, the flavor starts to change. Garlic develops strong, bitter, sharp flavors when the cell walls of the bulb are broken. This is a defense mechanism, like deflecting a valid critique of your character by turning it into a joke. When this sharp flavor develops and then sits, it becomes more unpleasant, which is exactly what’s happening in that jar of minced garlic. The more it hangs around, the less it tastes like the sweet, spicy, assertive garlic we know and love.Also, pre-minced garlic is actually not just garlic. These containers of garlic have added ingredients, like citric acid and phosphoric acid, to help stabilize the garlic as it sits on grocery store shelves. And, as another stabilization technique, most brands will pasteurize the garlic, heating it to kill any unwanted microorganisms. This sounds like a good thing in terms of food safety, but when it comes to fresh ingredients, we like ours to be alive. There’s more vibrance and flavor in a freshly peeled clove than there is in a pasteurized garlic cube.If you like garlic bread, a Microplane is the way to go.\nPhoto by Marcus NilssonReal talk: This supposed product of convenience isn’t really saving you much time at all. If you needed 3 cups of garlic for the largest batch of pasta sauce you’ve ever made, sure, we get it.But really, we don’t mince garlic all that much after all. Chopped garlic is a pain in the ass. We co-sign techniques like smashing cloves with the flat side of a knife or grating garlic with a Microplane, both of which take very little time.Grocery store minced garlic is a food product of convenience that is just not that convenient—and certainly not that tasty. At this very moment, pre-minced garlic is 0-2 in our book. Fresh garlic? That stuff remains undefeated.Now, let's smash some garlic for this pomodoro:Basically Spaghetti PomodoroAlmost as easy as opening a can of the store-bought stuff, and one hundred times more delicious.View Recipe*We do recognize, however, that pre-minced garlic can be a huge help for people with limited mobility, who might find it easier to scoop from a jar rather than peel, mince, or grate.Explore Bon AppétitGarlicBasicallyIngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-04", "author": ["Condé Nast", "Alex Delany"]}