{"id": "1eeefa1a817c818ef73aa3ee2288317e", "url": "https://www.bonappetit.com/story/tea-quest", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Getting Reaaally Into Tea Was My Best Decision of 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGetting Reaaally Into Tea Was My Best Decision of 2019 (So Far)Inside my highly caffeinated, slightly manic quest to become a “tea person.”By Aliza AbarbanelMarch 22, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’m going to level with you: I’m not a “tea person.” I don’t frequent modernist tea shops with sans serif menus, I don’t sip Earl Grey while completing a crossword in bed. I am, however, a cold person. When December’s chill sets into my bones and claims squatters’ rights until late April, I start supplementing my morning coffee with endless cups of, well, whatever battered teabags are in my desk drawer.It’s not a good look, especially for someone who works at a food magazine. That’s why I decided to skip the usual New Year’s promise to go to the gym more often and give myself a fun goal: Stop using budget teabags and figure out how to steep properly. Several months later, my habits have changed, largely for good. Here’s how my quest to become a tea person went down.Wednesday, 8:15 a.m.I begin my education at a New York institution: McNulty’s Tea & Coffee Co. It’s held down a small piece of the West Village since 1895—plenty of time for the scent of sumatra beans and Earl Grey to steep into the floorboards. I arrive with a mission: Buy jasmine pearls for senior staff writer Alex Beggs, a real tea person, and upgrade my raggedy tea collection. Sounds easy enough, except I have no idea what jasmine pearls are.Co-owner Wing H. Wong explains they’re just regular tea leaves that have been carefully rolled into a spherical shape, which unfurl and get better with each additional infusion of water. I ask him to recommend an “interesting” black tea for me, because I truly have no idea what I’m looking for. He hands me a jar of Golden Monkey, a gold-tipped black tea from China’s Fujian Province that’s popular with customers. (Read: Easy for a clueless person like me to like.)I drank endless cups of green genmaicha when working at a cafe in college, so I grab a bag for nostalgia’s sake and check out in a blur of scooping and weighing. The $45 receipt gives me pause, so I attempt to ease the pain by calculating the cost per cup. I give up on the mental math and just hope it lasts a long time.Thursday, 3 p.m.Now that I’ve transitioned to loose-leaf, I need to find a way to make it. I consult The Tea Sommelier (an encyclopedic book lifted from the office library) and learn that my beat-up strainer ball won’t make the cut. For optimal flavor, tea leaves need room to expand as they steep. Beggs already went through the trouble of searching for the perfect device—a little glass teapot she uses daily—but I go with an infuser basket because, well, I got one as a gift. I read that I’m also supposed to consider temperature control: It turns out that green tea should be steeped at a lower temperature than black tea, and if you’re going to buy expensive leaves, you might as well prepare them right. Luckily, there’s a temperature-controlled tea kettle in the Bon Appétit Test Kitchen. (Work perks are real.)Friday, 9:30 a.m.I skip my morning coffee and bring my new teas to work instead. After braving my morning commute without caffeine, I rush to the office tea kettle and peer inside to assess the water level. There’s no water, but plenty of mold. It’s an inauspicious sign, and any pretense of glamour goes out the window. I get hot water from the crappy espresso machine and wait a minute for the temperature to dip below boiling so I don’t burn the Golden Monkey. It works, or at least I think it does. The black tea is smooth and surprisingly aromatic—I taste cocoa and dried apricots.Friday, 3 p.m.I’m too sleepy to work. One cup of Golden Monkey does not have enough caffeine to sustain me, so I brew a cup of genmaicha and decide to take a break. I sit and sip the toasty tea, which is studded with rice. The starch makes it surprisingly filling. I clean my strainer basket, and the wet tea leaves stick everywhere.Saturday, 12 p.m.Time to enter New York’s ecosystem of high-end tea shops. My coworkers suggest Belloq, a “tea atelier” specializing in single-origin products. It’s full of houseplants and golden canisters, plus a group of chic women in clogs discussing an oolong’s “second steep.” I eye powdery dishes of matcha and try not to sneeze. The women behind the counter start pouring me tastes of oolong while explaining what makes it so special. (Apparently, the leaves are oxidized in direct sunlight, creating a particular, peachy fragrance.) I leave with an oolong called The Phoenix, plus a golden turmeric chai laced with rose petals that, I’ll be honest, is destined to appear on my Instagram.My Bellocq haul: Canyon Chai and The Phoenix oolong. Is this what being a tea influencer feels like?\nPhoto by Chelsie CraigMonday, 11 a.m.Word about my growing tea stash is out at work. A coworker recovering from a cold comes over to beg for something soothing. I send her away with oolong fortified with a drizzle of pricey manuka honey for maximum #luxury.Monday, 2 p.m.The one downside of drinking a lot more tea? A lot more bathroom trips.Wednesday, 10 a.m.I have a bad habit of leaving my tea to steep and forgetting about it entirely. Normally I wouldn’t care too much, but considering how much I paid for these, I start setting timers. It feels a little precious at first, but it works. Then I lose my phone and find it buzzing in a conference room. It’s a learning curve.Saturday, 4 p.m.It’s the kind of winter day that makes me question why I ever left California. Snow sticks to my glasses, slush seeps into my socks. Magically, a few friends ignore the weather report and trek over to my apartment. As a gesture of gratitude, I brew mugs of my new turmeric chai and wait for them to steep for 8 minutes before passing them out. Am I peaking? It’s definitely not a proper tea party (Eloise would be ashamed), but it’s a start. Next time, I’ll make finger sandwiches.Explore Bon AppétitTeaRead MorecultureThe Little Teapot I Love So Much I Bought 2By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Aliza Abarbanel"]}