{"id": "1efe238de0e322f5e4497d7cb428166f", "url": "https://www.bonappetit.com/recipe/seven-spice-grilled-lamb-chops-with-parsley-salad", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Seven-Spice Grilled Lamb Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueSeven-Spice Grilled Lamb Chops with Parsley SaladBy Kamal MouzawakApril 16, 20194.6(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintIt’s not like we’re gonna stop you from making five- or six-spice chops, but this seven-spice blend is typical of Lebanon and its surrounding region, and full of dimension. Try it on chicken or pork chops, too. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe.Ingredients4 servings1cup plain whole-milk yogurt (not Greek)1tsp. freshly ground black pepper1tsp. ground coriander1tsp. ground cumin1tsp. paprika½tsp. ground cardamom½tsp. ground cinnamon½tsp. ground nutmeg12untrimmed lamb rib chops (about 3 lb.), patted dryKosher salt1small red onion, very thinly sliced1cup coarsely chopped parsley1Tbsp. fresh lemon juice2tsp. sumacIngredient InfoSumac, a tart, citrusy spice generally sold in ground form, can be found at Middle Eastern markets, specialty food stores, and online.PreparationStep 1Mix yogurt, black pepper, coriander, cumin, paprika, cardamom, cinnamon, and nutmeg in a large bowl.Step 2Season both sides of lamb chops generously with salt and add to bowl with marinade. Turn lamb in marinade to coat; cover and chill at least 3 hours and up to 12 hours.Step 3Let lamb sit at room temperature 1 hour before grilling.Step 4Prepare a grill for medium-high heat. Grill lamb to desired doneness, about 3 minutes per side for medium-rare. Let rest 5–10 minutes.Step 5Meanwhile, toss onion, parsley, lemon juice, and sumac with a pinch of salt in a medium bowl.Step 6Serve lamb chops with parsley salad on top.How would you rate Seven-Spice Grilled Lamb Chops with Parsley Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThe lamb was perfect! We made the entire Lebanese dinner party for a pot luck and everything we had was incredible!! Really fun and interesting flavors! AnonymousPhilly7/8/2019I thought this recipe was amazing and would make again. I skipped the onion, parsley, lemon juice and sumac finish and served it instead with the sides from the same article: tomato salad with pine nuts and molasses and the cabbage tabbouleh (substituting farro for the bulgar). This would make a lovely summer barbecue dinner with a lot of the work ahead of time and just grilling at the last minute. Anonymous5/2/2019I liked the spices on this lamb but the yoghurt seemed to just get in the way, especially at grilling time when there was just a big mess all over my grill and the lamb didn't caramelize because of the excess moisture of the yoghurt. Next time I'm going to make a rub of the same spices and keep the yoghurt as a dressing for the parsley saladAnonymousCincinnati4/28/2019Explore Bon AppétitLebaneseMiddle EasternParsleyHerbs & SpicesLamb ChopLambMeatYogurtOther IngredientsMainNut-FreeGluten-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}