{"id": "1f083ff11fd7cb006872caccfc9c05b8", "url": "https://www.bonappetit.com/story/golpeados-reunion-bakery-co", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Venezuelan Sticky Buns at Reunion Bakery Co. > Regular Sticky Buns | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsVenezuelan Sticky Buns > Regular Sticky Buns, Always and ForeverDo your sticky buns have salty cheese in them? Didn’t think so.By Amiel StanekJune 13, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I wouldn’t call myself a sticky bun person. I’ve just never really understood what all the fuss was all about. A spiral of wan, eggy, underdeveloped dough, a dusting of cinnamon, a sticky, too-sweet mess of caramel. Not hating; just not my cup of tea.But then I met golfeados. And everything changed.I was cruising around Denver, minding my own business, when I found myself in the food hall attached to The Source Hotel. I smelled Reunion Bread Co. well before I saw it, an aromatic cloud of crusty sourdough and browned butter and caramelized sugar that practically dragged me by the nose into Ismael de Sousa’s tidy little stall. A spread of impossibly delicious looking breads and pastries were arrayed jewel-like on creamy white marble, a glass half wall the only thing keeping me from reflexively divebombing them like some kind of sugar-crazed bird with a deathwish. Cinnamon-sugar dusted “churro” croissants filled with dulce de leche. Perfect little pasteis de nata—delicate, lemony Portugese egg tarts. Crackly-crusted rounds of country bread. But it was a sheet pan checkered with deeply browned, sticky-looking spirals of dough flecked with what appeared to be crumbs of cheese (!!!) that stopped me in my tracks. “Golfeado,” read the little sign in front of this tray of glorious madness. “(Venezuelan Sticky Bun).” I ordered one immediately.Instagram contentThis content can also be viewed on the site it originates from.I took a bite before I had even finished tapping through the Square reader’s payment menus. (One thousand apologies to the person behind me in line; I swear I had no idea how long I was standing there chewing with my eyes closed.) It was everything I’ve ever wanted in a pastry. A flaky coil of buttery laminated dough—as in, what they make croissants out of—lacquered with a rich, raw sugar syrup and pushed right to that beautiful, bittersweet razor’s edge between browned and burnt. At once crispy and yielding and chewy, it was shot through with toasty walnuts and perfumed with anise seeds. But it was a shower of what I later found out was cotija cheese that secured this golfeado’s spot in my personal pastry pantheon. Mouthwateringly salty, tangy, and just the right amount of aged cheese–funky, it felt simultaneously like a left-field wildcard and something that belonged there the entire time, the perfect foil to that dense wall of sugar and butter.Now this was a sticky bun I could get behind.On one hand, I’m forever grateful to de Sousa for redeeming what I thought was an irredeemable dessert. On the other hand? I will forever pass rows of basic-ass sticky buns, my hopes forever up, forever wishing they were golfeados.Go there: Reunion Bread Co.Explore Bon AppétitHighly RecommendRestaurantsDenverRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-13", "author": ["Condé Nast", "Amiel Stanek"]}