{"id": "1f1669045ff8dfc7138f86f1dc76f499", "url": "https://www.bonappetit.com/recipe/sarciadong-isda", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Sarciadong Isda Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueSarciadong IsdaBy Melissa MirandaFebruary 9, 20214.3(28)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintThis version of sarciadong isda is from Melissa Miranda of Seattle’s Musang, a Filipinx community space and restaurant. “My dad used to go offshore perch fishing in Ocean Shores and he’d make this sauce for me and my mom. Then we’d fight over it, because it’s so good—but also so simple. It’s just sauteed garlic, onion, tomato, Johnny’s seasoning salt, and a little fish sauce if you want it.” Miranda uses a cornstarch slurry to help bind the egg into a velvety, rich sarciado sauce, an ideal counterpart to the fish, which she serves on top so it stays crispy.Ingredients4 Servings½cup Diamond Crystal or ¼ cup Morton kosher salt, plus more46-oz. skin-on salmon fillets2Tbsp. vegetable oil, divided3large garlic cloves, chopped1small onion, finely choppedJohnny’s seasoning salt or kosher saltFreshly ground black pepper (optional)2fresh or canned plum tomatoes, coarsely chopped1Tbsp. cornstarch2large eggs2dashes of fish sauce (preferably Squid brand)Thinly sliced scallions (for serving)PreparationStep 1Whisk salt into 8 cups cold water in a large bowl to dissolve. Add salmon and cover. Let sit at room temperature 1 hour. Remove salmon from brine; pat dry.Step 2Heat 1 Tbsp. oil in a medium saucepan over medium-high. Cook garlic, stirring often, until golden, about 2 minutes. Add onion, season with seasoning salt (or kosher salt and pepper), and cook, stirring often, until translucent, about 3 minutes. Add tomatoes; cook, stirring and mashing, until beginning to stick to pan, about 35 minutes. Add 1 cup water. Bring to a simmer; cook, reducing heat if needed, until saucy, about 5 minutes. Let tomato sauce cool at least 1 minute.Step 3Stir cornstarch and ¼ cup water in a small bowl. Lightly beat eggs in another small bowl to blend. Add tomato sauce a little at a time, whisking to blend after each addition. Return tomato sauce to pan; whisk in slurry. Bring to a simmer over medium heat; cook, stirring, until thickened, about 1 minute. Season with fish sauce. Reduce heat to low and keep tomato sauce warm.Step 4Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high.  Season salmon lightly with salt and pepper. Cook, skin side down, pressing fillets gently with a fish spatula, until skin is deeply browned and crisp, about 5 minutes. Turn over and cook until flesh is opaque throughout, about 3 minutes.Step 5Divide tomato sauce among plates; top with fish, skin side up, then scallions.How would you rate Sarciadong Isda?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleNO! The original recipe does not look like this! Why does it look like vomit?!? Horrible execution! Zero stars!AnonymousLos Angeles1/10/2022This is hands down the WORST recipe from BA I’ve ever made. 35 minutes on medium high with tomatoes, garlic and onion? Turns into a burnt paste. I LOVE BA and cook their recipes at least once a week, stay as far away from this one as you canDanNashville, TN9/29/2021Good, I definitely made some changes to make this lunchtime friendly and add a bit more as the idea of just the slurry and fish seemed barren to me. I made tomato polenta instead of the slurry, the sauteed some kale and shallots in a  bit of white wine and garlic and added my salmon fillets on top. Wonderful lunchtime meal, I feel rejuvinated!BPittsburgh, PA5/24/2021Super delicious. I will confess that I was confused by the ingredient list—2 tomatoes or two cans? It’s two tomatoes. 🙂AnonymousSeattle, WA3/16/2021Tasted good (even better with a drizzle of sriracha!) but not sure if worth the prep time etc... might be more doable on a weeknight if you make the tomato sauce ahead?KavLondon, England3/15/2021We try a new Bon Appetit recipe weekly, and while we have come to expect excellence, this surpassed our expectations and was an instant classic. Instead of salmon we used some frozen barramundi that we thawed, salted, and pan seared. Otherwise we followed the recipe. We loved it and cannot wait to make it again. We were not able to get the sauce as thick as pictured, but since we served it with rice, the rice soaked it up so we were able to enjoy every drop. RachelTexas2/27/2021I have been planning my meals around Bon Appetit since 1989 and I can definitely say this is the worst thing I have ever made out of the magazine.  It was quite bland and not worth the time.EllenJacksonville Beach, Fl2/25/2021Delicious! Made this exactly as directions state. Appreciated the use of simple ingredients. Sauce was rich and flavorful, mine came out a bit thick, but my partner and I enjoyed it regardless. Will definitely make this again! AnonymousRichmond, Virginia2/23/2021Bangin'.Anonymous2/16/2021Explore Bon AppétitFilipinoSoutheast AsianAsianSalmonFishSeafoodEasyWeeknight MealsMainGluten-FreeDairy-FreeKetoNut-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}