{"id": "1f1e176ff936a0cc44cffdc8cb937fcf", "url": "https://www.bonappetit.com/story/akua-kelp-burger", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Of All the Veggie Burgers, the Best Is Made of Kelp  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Perfect Frozen Veggie Burger Doesn’t Exi—AKUA’s salty-smoky kelp burgers are all I want to eat this summer.By Amanda ShapiroJune 4, 2021FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!I love a good burger, but I’m always more interested in the bun (gotta be a potato roll) and the condiments (charred onions, Dijon, and a juicy tomato, please!) than whatever patty is in between. So when I decided to start eating less meat, veggie burgers were an obvious swap. I knew I’d find some palatable options—and I did—but I didn’t expect to find a burger I truly craved. And I definitely didn’t expect that burger to be made of kelp.The veggie burgers I speak of are the newest launch from AKUA, a company that’s been selling kelp in the form of dried jerky since 2019. What I love about these burgers, along with the fact that the ingredient list includes mushrooms, pea protein, black beans, and quinoa, is that their texture is uniform—no stray corn kernels or bean skins in sight. It’s chewy, salty, and smoky, and while nothing about the taste screams “seaweed,” there’s definitely a note of brine in there. Size-wise, this veggie burger is thick enough to make its presence known but thin enough to leave room for all those toppings I love. I’d eat it even if it weren’t made of a super-cool, planet-saving seaweed.Quick primer on kelp: When it’s ocean-farmed, kelp is a zero-input crop, meaning it doesn’t need to be watered, fertilized, or fed in any way, nor does it need cleared land to grow—it’s under the sea! And not only is kelp lower maintenance than your pandemic haircut, it also gives back: The crop actually pulls carbon dioxide out of the atmosphere. According to the BBC, scientists estimate that seaweeds of all kinds (including kelp!) sequester nearly 200 million tons of greenhouse gas every year—which is as much as New York State’s total annual emissions. It’s so nice when sustainability and deliciousness work together.AKUA veggie burgers ship frozen and are made to go straight from freezer to grill (or skillet). When I make them, I start my onions first, then throw on the burgers five-ish minutes before the alliums are charred to my taste. Just a few minutes on each side is enough to heat the burgers through and get a nice sear going. Then all that’s left to do is assemble and crack open a cold bev. AKUA, if you’re reading this, I have three words for you: kelp beer, please.Photograph Courtesy of Akura / Yellow ImagesThe Kelp Burger$49 at Akua – 12 PackExplore Bon AppétitHealthyishHealthyish Loves ItShoppingBurgersVeggie BurgerRead MoreLentil BurgersEasiest-Ever Grilled Veggie BurgersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-04", "author": ["Condé Nast", "Amanda Shapiro"]}