{"id": "1f21a11a417840373de03fa389f91d18", "url": "https://www.bonappetit.com/story/travel-guide-books-matt-goulding", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "The Travel Book Series That Goes Deeper Than Google | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Travel Book Series That Goes Deeper Than GoogleThe food recs are great, but the context that shows you an entire city is even better.By Carey PolisAugust 7, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailLast month, I was wandering through an outdoor festival in Hokkaido, Japan snacking on a giant bag of shrimp chips and watching an amateur sumo wrestling competition. I had eaten a double scoop of corn and sesame gelato for lunch and then cheesecake for dessert, after I met a goat named Yuki.How did I decide to visit this bizarro version of Provence (lavender fields, yogurt everywhere, lots of cows...)? It wasn’t a slapdash combo of friend recommendations, Trip Advisor, and Google research but rather one source that has been sitting on my bookshelf since 2015.Rice, Noodle, Fish: Deep Travels Through Japan’s Food Culture, written by Roads & Kingdoms co-founder and publisher Matt Goulding, doesn’t fall into the too-familiar look-I-ate-somewhere-cool-now-I’m-going-to-wax-way-too-poetic world of travel books.Instead, in it, and his subsequent two books published in 2016 and this past June—Grape, Olive, Pig about Spain and Pasta, Pane, Vino about Italy—he focuses chiefly on the people behind the food: tempura chefs, pig butchers, mozzarella makers. Sure, Goulding eats a lot of multi-hour wine-soaked meals too. But the books work so well because he includes conversations about clashes of tradition versus modernity, and highlights how immigrant communities have changed traditional foodways for the better.Take the Sicily chapter in Pasta, Pane, Vino in which Goulding interviews Palermo’s three-time mayor Leoluca Orlando and asks him at what point migrants can consider themselves palermitani.“From the second they arrive in this city,” says Orlando. “The resident card is the new form of slavery, the migrant boats the new slave ships. We need to accept globalization isn’t just an economic reality but a human one, too.”The Ballaro market in Sicily.\nChelsie CraigGoulding then ties Orlando’s point of view to food. No longer is Sicily a region solely devoted to Southern Italian classics. Instead, you find arancini—the traditional Sicilian fried rice ball—stained with saffron as a nod to Africa. You find couscous with chunks of lamb on the same trattoria menu as pasta alla Norma.I trust Goulding as a writer—and someone to take vacation advice from—because he doesn’t only show the happy side of travel. Goulding might love Italy, but he also acknowledges how easy it is to get a mediocre gelato in Rome (same rules as New York City, but instead of avoiding Times Square food options, avoid restaurants around any gladiators or famous fountains). While he’s made Barcelona his (part-time) home, he addresses the impact of the “homogenous cruise-ship economy,” the constant political strife tied to Catalan independence, and other daily realities that wear off some of that Gaudi sheen.A full-page “amazing shit in the middle of nowhere” spread.\nChelsie CraigEach chapter is about a different region or city, and can focus on a singular story (like the gooseneck barnacle gatherers of Galicia) or encompass multiple aspects—I got hooked on Hokkaido from Goulding’s vignettes on artisan breadmakers, his summary of the sheer amount dairy around, a profile of a soba noodle chef, and the fact that he ate nothing but donburi for several days. Between each chapter, there are full-bleed photos with one-page breakdowns of dishes, or a recurring series of “Amazing Shit in the Middle of Nowhere.” It’s a chance to highlight aspects of food and travel that maybe don’t make sense within a chapter, but are still worth writing about.And, each book starts with impassioned back and forth emails between Goulding and the late Anthony Bourdain—this series is part of Anthony Bourdain’s book imprint. You feel a little bit of Bourdain on the pages—never too shiny, with food descriptions containing just the right level of effusiveness and not a drop more. In the intro for Pane, Pasta, Vino, Goulding asks Bourdain if the world needs another book about Italian food. Bourdain responds:“To me, after thirty years of cooking, of garnishing, of torturing and manipulation food into being pretty enough or ‘interesting’ enough to sell to an ever-fickle dining public, another two decades of experiencing every type of culinary genius or frippery, there is a deep satisfaction and joy in food made with enough confidence and love to take three or four good ingredients, cook them right, and dump them unceremoniously on a plate. Better yet is if the cook feels good enough about the food to serve it with a rough, not particularly good, local wine. That makes me happy.”Me too—I’ve booked a trip to Italy next month.Get the books for $20 each on Amazon:Rice, Noodle, Fish Grape, Olive, PigPasta, Pane, VinoThen hit the road:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBooksShoppingRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Carey Polis"]}