{"id": "1f2296d919dacd9b1bdf8457add8f8c4", "url": "https://www.bonappetit.com/story/bon-appetit-shop", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "The Bon Appétit Shop Is Live | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Bon Appétit Shop Is LiveThere are hats, tees, and more!By Bon AppétitAugust 20, 2019FacebookTwitterEmailFacebookTwitterEmailWe’re very excited to announce that after years of coveting and covering the status tote bags and limited-edition fusilli tees and custom jumpsuits of the restaurant world, we’re rolling out our own collection of merch. Like pretty much everything we do at BA, these hats, tees, and (soon) more are inspired by our eccentric, passionate, and occasionally funny crew. There’s a tee dedicated to Claire Saffitz’s beautiful hair. There’s a tee dedicated to the unlikely catchphrase of one Brad Leone. There are not one but two tees that speak to our collective love of tie-dye. And it’s all designed by the same amazing art department that makes the pages of our magazine look so good. Here’s what you’ll find in our launch collection, now live at shop.bonappetit.com; we’ll keep you posted as we launch new products on the regular.The Tie-Dye ShirtsWhich is the safest bet: taking that ayahuasca trip, going to a Dead & Co. concert, or buying this T-shirt? We’re gonna go with that last option. Hand-dyed in NYC by tie-dye maven Kalen Kaminski of Upstate, these limited-edition tees come in two colors: “spirulina” and “Aperol spritz.”The Bone Apple Tea HatThis hat features three painstakingly embroidered emoji: a bone, an apple, and a cup of tea. Get it?Adam’s Favorite ShirtBe like Adam Rapoport, our editor in chief! Wear a shirt with words on it to the office! This shirt looks great with a nice jacket! Or not!The All-Day, Every Day ShirtThis is the lemony yogurt sauce of T-shirts. You wear it once, then you realize you can wear it every day, because it goes with everything. And if one day you decide you want to change it up, tie-dye it yourself!Extremely Subtle Fan HatIt’s like the white T-shirt, but you won’t spill BA’s Best Bolognese on it.Legally We Cannot Say What Is Pictured on This ShirtAn essential accessory for die-hard Gourmet Makes fans as well as anyone who enjoys the-candy-that-rhymes-with-the-word-pieces, this T-shirt features Claire Saffitz’s recipe for a peanut butter cup on the back.The Iconic Claire ShirtWill an elegant streak of silver hair become the modern-day equivalent of “The Rachel”? Make it happen by purchasing this homage to Bon Appétit’s pastry genius, Claire Saffitz.It's Alive! The Shirt!We are all lucky to live in a world with Brad Leone, a man with his very own understanding of how words are pronounced. Celebrate him with this iconic It’s Alive! Tee.If You Have to Ask, Don’t Buy This ShirtWhether you’re fermenting garlic honey or making your own miso, the same piece of advice from It’s Alive! host Brad Leone holds true: Crush the garlic; release the allicin. If you’re not going to get this tattooed on your body or engraved on your tomb, at least buy the shirt!Shop: The Bon Appétit StoreExplore Bon AppétitShoppingRead MorecultureThe Best Souvenir From Maui Isn’t a Tan But These Serene CeramicsBy Elyse InaminecultureI Can Schlep Without Worry, Thanks to This Mesh ToteBy Aliza AbarbanelcultureThe Take-Anywhere Plates I’m Using Instead of DisposablesBy Sarah JampelcultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-20", "author": ["Condé Nast", "Bon Appétit"]}