{"id": "1f290adc1c3e42d13f97a6377560da54", "url": "https://www.bonappetit.com/story/heads-of-the-table-farm-club", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Farm Club Has Big Ambitions (And the Best Onion Rings) in Northern Michigan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFarm Club Has Big Ambitions (and the Best Onion Rings) in Northern MichiganIn a region dominated by Big Ag, this restaurant on a small farm is about as local, and delicious, as it gets.By Alex BeggsSeptember 14, 2021FacebookTwitterEmailWalking by the market inside Farm Club, a truly farm-to-table restaurant in Traverse City, MichiganPhotograph by Jesse David GreenFacebookTwitterEmailThis story is part of Heads of the Table, our celebration of 12 restaurants, people, and organizations that led the industry through the pandemic and beyond. Meet all the winners here.At least once a year, I shake the moths out of my padded-butt shorts and ride the TART trail from downtown Traverse City to Suttons Bay and back, with a stop for fried smelt in between. It’s a gorgeous ride that weaves through 17 miles of sleepy northern Michigan farmland with minimal car encounters. I inhale the green watermelon scent of mowed grass, greet each and every biker/runner/rollerblader with a nice Midwestern wave, and ask my partner, “Was that a Confederate flag?” when we pass one of the homes tucked into the woods. (On my last ride the flag appeared to be taken down.) Bumper stickers and signs won’t let us forget that this is the one of the areas that helped get Trump elected in 2016. But I’m here to talk about organic onion rings, sorry!As of last year there’s a little sign that points off the paved trail: “Farm Club .2 miles.” Take that, and you’ll crunch up a gravel path toward a big modern-looking barn and a horizon of postcard-perfect trees. The barn is a restaurant-slash-bakery-slash-brewery-slash-general store, selling wool socks, wine, and loaves of sourdough. It’s time for a beer.Farm Club is a collaboration between Gary and Allison Jonas—owners of The Little Fleet, a downtown Traverse City bar with food trucks—and Nic and Sara Theisen of Loma Farm, an organic farm with an always sold-out CSA. Farm Club is about a mile and a half from Loma on the Leelanau Peninsula and about a 34-minute bike ride from downtown TC. (So okay, you don’t need the padded shorts if this is where you’re headed.) The space was designed by local architects Designsmiths, who made sure every detail takes you outdoors, with big windows that look onto the yard and farm. The building’s unfinished cedar siding will age with time, like the rest of us.You’d think that a place like Farm Club wouldn’t be such a big deal in this farm-y part of the state, but so far the demand and profit for burgers and wings has been higher (and I can tell you a great place for both: Brady’s Bar.) What makes Farm Club so special is that it takes an arguably bougie concept—farm-to-table—and makes it accessible, low-key, and familial. No tasting menu, no waiting list, ingredients aren’t revealed from under a smoking cloche. We’re sitting on a picnic table, looking out at some onion stalks, having a few cold beers while kids kick a soccer ball around.You can wander through the small farm on the property (the larger farm, Loma, is up the road), which is what I did with Farmer Nic, who’s 43 and looks like the photo interpretation of Tom Joad on the cover of the Penguin Classics paperback of The Grapes of Wrath, if Tom Joad kept Google spreadsheets of planting schedules and had a sourdough side hobby. Deeply tanned and intense, quick to laugh. His wife, Sara, tells me that if you check Nic’s pockets, there’s probably a half a cucumber in there, which he’ll pull out and snack on throughout the day.“This is our onion ring patch,” he says, pointing to a field of 3,000 tall green stems with his baseball mitt hands. “We’ve been growing this sweet onion variety called Ailsa Craig, it’s an old variety from Scotland. It gets huge, really high sugar content. I said, Man, our restaurant needs to be making onion rings, and last year we did it. So we have a seasonal onion ring.” One of the nights I visited, they were made with garlic scapes instead of onions, quickly blanched and coated in a tempura batter, served with a sweet chili sauce. I should’ve ordered a second.Nic pointed out a plot of cover crop (oats and field peas that’ll help replenish the soil for next year), budding Brussels sprouts, and apple cider trees two or three years away from getting any action. You can tell that when he looks out over the fields of crops, his mind is racing into the weeks, months, and years ahead. Sam Stachon, the chef at Farm Club, calls Nic a “savant.”His approach to farming deserves a TED talk. A few years back he read The Lean Farm, which outlines how to run a farm using a system of efficiency called Lean manufacturing that originated at Toyota sometime before the term was coined at MIT in 1991. Now he’s introducing it to every aspect of Farm Club. Sara laughs when I ask what Lean is. “You’re gonna be here all day!” But Nic gives me the one sentence summary: “The whole principle is the elimination of waste, but waste is expanded to not include just product waste but time waste, movement waste, and potential [for waste].”One way they implement Lean manufacturing is by creating basically the opposite of an assembly line (which was, ironically, invented in this state). When the Farm Club team packages food for the market, for example, one person packs, lids, and labels say, hummus, one tub at a time rather than taking up a table of space to set everything out and pack them all, then lid them all, then label them all. This eliminates potential errors like putting the wrong label on 50 tubs of hummus.Following the Lean method, they actually scaled back the acres they grew on, planting more crops in each bed. It improved how they managed the farm, helped with weed control, and decreased crop loss. “In the year we pulled back, we increased our profits by 20 percent,” Nic says, “so that really proved to us that bigger isn’t really necessarily better for business.”Farm Club brings the outside in.\nCourtesy Farm ClubBefore Farm Club opened, Loma Farm supplied a number of restaurants in the area and was a fixture at the Traverse City farmers market. But scaling back also meant they had to pull back their accounts with restaurants and at the farmers market in order to have enough produce to supply Farm Club. This’ll open up space for other organic farmers to swoop in and grow in this area otherwise dominated by Big Ag. Per Nic: “As the population, hopefully, gets more exposed to [organic produce], these farms will have more and more market. But Loma stepping out creates a really big opportunity because we were primarily a restaurant supplier.”“But the thing is, people get into [farming] and quickly realize that it’s a racket,” he continues. “It is so hard and the margins are tiny.” We laugh, because this crazy bastard clearly loves this racket. He’s been farming for 20 years—first in Colorado, now here. (His father’s family were dairymen in Wisconsin, but his dad opted out.) He picks a bulb of garlic, peels off the outer layers, and hands it to me so I get a close-up of his permanent soil manicure. In July they hung bundles of garlic from the awning of Farm Club to “cure” for winter storage. There’s no Cracker Barrel decor here; it’s all real.When Farm Club opened during the pandemic, it was tested from all fronts. Global pandemic, Michigan winter, and then the labor crisis combined with the lack of affordable housing in the area. “When people do want to move up here to work here,” Sara says, “if they can’t find housing, we lose out on them.” The nights I visited, the waitstaff was largely made up of local high school kids and college students home for the summer.Farm Club not only hung on, it’s become both a destination restaurant and a neighborhood gathering spot on Tuesday and Friday nights when it’s CSA pickup day. They’ve even been able to attract staff because a job requirement for all positions is to put in a weekly farm shift. “We hire these bartenders who have been in the industry forever, and we’re like, ‘Heads up, you’re going to have to work in the field once a week,’” says co-owner Allison Jonas, “And, they’re like, ‘Yeah, that’s why I’m here interviewing. I want to. I want to be outside. I want to get that experience.’” Chef Sam told me his last duty was pruning the elderflower bushes and weeding sugar snap peas and fava beans. His wife joined him—for fun.Could that practice spark a younger generation to get into farming? The average age of farmers in Michigan is 56, and as the industry profit margins dwindle, the sons and daughters of farmers aren’t staying in the business—a story you’ve heard before. Yet we want to eat better for our bodies and the planet. So...maybe?Chef Sam also comes from a farming family in northern Michigan, where he learned how to butcher a chicken and preserve everything under the sun. “I’m 35, but I feel like I grew up in the early 1900s,” he says, laughing, before telling me about how they’re freezing gooseberries for the winter this week. He worked in whole-animal butchery in North Carolina and then opened two not-for-profit community restaurants that employed and trained people without housing and other neighbors in need before finding his way back to Michigan. When we sat down to talk at a table outside, he used the kitchen towel around his shoulder to wipe the rainwater off my seat. His heart radiates off his sleeve. When he started at Farm Club this spring, he told his fiancée, “It never feels like I’m at work. It feels like I get to come to play land every day.”Every Friday at 8 a.m., he has a “Farm Walk” with Nic, where they scope out what’s finally ripe, how much they have, and how they’ll cook it. Loma farms only around five acres; it’s not a huge farm, so they tend to run out of things pretty quickly and have to think on their feet. There’s a polenta dish on the menu that can easily sub in different vegetables (and don’t even ask; of course they mill the polenta themselves)—I had it with turnips in early July and beets in late July. As I write this in August, I’m trying to plan a trip later in the month because I want a “hot melon,” which, contrary to what I thought, is not a spicy melon but a watermelon cracked open and served still warm from the sun. “It’s an unparalleled experience,” Nic says, eyes wide. I believe him.More Stories from Heads of the Table:Introducing Heads of the Table, the trailblazing, community-building, future-making leaders changing the restaurant industry for good.How Michael Carter’s time in prison shaped his perspective on the justice system and gave him purpose at Down North Pizza in Philadelphia.When COVID brought NYC restaurants to a halt, Send Chinatown Love helped Ruth Li’s restaurant survive.Restaurants are still struggling, but chef Edward Lee is optimistic about what’s to come.During the pandemic, Francesca Hong went from chef to politician—and she’s not done fighting for food workers.Explore Bon AppétitRestaurantsHeads of the TableFuture of RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Alex Beggs"]}