{"id": "1f2a273f80546bcde2e8c4bd0ae9ac43", "url": "https://www.bonappetit.com/story/a-skeptic-tries-oatmeal", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "A Skeptic Tries: Oatmeal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: OatmealWhen oatmeal for breakfast was deemed essential for my health, I decided it was finally time to choke down those gooey grains.By Joel WigelsworthOctober 25, 2021FacebookTwitterEmailIllustration By Alexis MontoyaFacebookTwitterEmailA Skeptic Tries is a series examining our food resistances and what happens when we try them anyway. Next up, in the name of good health, contributor Joel Wigelsworth finally faces his longtime breakfast nemesis: oatmeal.I’ve always hated oatmeal. Loathed it. For as long as I can remember, I found it bland, unpleasant tasting, and repulsively snot-like. And not regular snot either. It reminded me of the extremely thick and lumpy mucus one develops during a severe flu or cold. Even oatmeal’s non-color was direly unattractive to me.A profound hatred of benign, even beloved, oatmeal is one of the many factors that has, throughout my lifetime, marked me as a misfit. People are always astounded to find out how much I dislike the stuff. “What? Who hates oatmeal?! It’s like one of the most wholesome, simple, and cheap foods available. You’re a monster!” Yep. Rawwwrrr.Fast-forward through several years of desk jobs and stress-eating and I found myself the beneficiary of quite a few extra pounds. The pandemic, along with a heap of other personal and professional circumstances, landed me in a phase of existential revelations and a commitment to realign my life to better nurture my authentic self. The real me had been buried beneath corporate constraints on visual identity, ​​the militant banality of American “professionalism,” and the excess flesh accumulated by eating my way through mountains of chips and rivers of salsa every night to soothe my addled soul. Plus, I had become too pudgy to fit into all my Bauhaus and Sex Pistols T-shirts.The diet program I was starting declared oatmeal to be an essential food because of its high protein and fiber quantities—and I was aghast. I knew dieting would have its challenges, but come on, oatmeal?! I was about as eager to embrace my lifelong breakfast nemesis as I would be to lick a toilet bowl at a truck stop. But if those gooey grains truly were that critical to the plan, then I would have to find a way to choke them down. I pride myself on my desire to overcome challenges, I love to eat, and I’m a “creative” by trade. So I became determined to finally face my oat-rage.A lot of people—most, it seems—enjoy sweet, almost dessert-like oatmeal. This was a twofold dilemma for me: first, sweetening adds sugar, which is not exactly ideal for dropping pounds; second, I've never really had much of a sweet tooth. I trawled the internet for various recipes to breathe life into the culinary corpse that was oatmeal, but to my dismay the results were largely unimaginative, differing only slightly from one another. “Try adding blueberries instead of strawberries! It’ll change your life!” Yawn, no.What I needed was to wring big flavors out of just a few wholesome ingredients.I did find a plethora of savory oatmeal riffs that sounded delicious—and, of course, many cultures around the world enjoy savory grains for breakfast—but most recipes online were lavishly decorated with far too much bacon, cheese, fried eggs, and oil to fit into my diet plan. What I needed was to wring big flavors out of just a few wholesome ingredients.As I bemoaned my oat woes to my mom over the phone one afternoon, she was compelled to reach into the furthest depths of her pantry and dust off a 1979 edition of The Quaker Oats Wholegrain Cookbook from my childhood. Some of the recipes my mom read aloud from the volume positively reeked of desperation to fill pages and shill oats: “Italian Meat Pie” with oat and beef crust, “Corn and Frank Chowder,” and a scabby-looking “oat-stuffed” tuna salad. But an oat pilaf using salty bouillon sparked an idea.The next morning, sporting my wife’s Wonder Woman apron over my Star Wars pajamas, my hair enlivened by a night of frenetic anxiety dreams, I was filled with the manic spirit of experimentation. I added Caldo de Tomate—a Mexican tomato and chicken bouillon indispensable in the Southwest, where I live—to the water I would boil my oats in. The resulting cooked oatmeal developed a pleasantly savory aspect that perfectly masked its customary dusty cardboard flavor. Yet something was still missing.Rubbing my chin like a mad scientist obsessing over which wig and color of nail polish would achieve the peak aesthetic of their monster, I brainstormed potential ingredients that might upgrade my oats. After a moment or two an idea flashed, like a fuse blowing in a macabre castle laboratory, and I dashed outside to nab some jalapeños and green onions from my garden. My ever-present dichotomy of pessimism and hope continued their perpetual thumb-wrestling war as I sat down with my unorthodox concoction. The whole thing felt like a make-or-break moment upon which the entire fate of my diet plan might rest.I gripped an antique spoon from my British grandparents’ wedding silver in my reluctant fist, squaring off against a bowl of loathsome grains I was hoping to turn from adversary to accomplice. I lifted the spoon from my Scooby-Doo bowl to my mouth and gave the artwork on the bright yellow dining room wall a thousand-yard stare as I chewed that crucial first bite.The oats were laced with much-needed salt and complexity, thanks to the Caldo de Tomate, and slightly undercooking them had reduced the mushy viscosity. This isn’t so bad, I thought, an eyebrow cocked like Spock. The diced green onions provided a freshness that cut through the starchy and salty porridge, and the sliced fresh jalapeño built upon that brightness and added an invigorating burn. (I was raised in New Mexico and pain is one of our most-cherished flavors.)When I tell people about my recipe for spicy and savory oatmeal, I’m mostly met with puzzled looks. But as with many things slightly offbeat, it has worked out decidedly well for me. I found a way to enjoy a healthy and affordable breakfast—which has contributed to me losing 42 pounds in three and a half months—and set in motion a whole new lifestyle that accommodates self-care and hoisting my freak flag high. Having left the job from hell behind to pursue freelance writing and photography, I’m now free to schedule my days on my terms. I can go for a walk, hike, or bike ride during the day, and I can work in cargo shorts, striped knee-high socks, and an Elvira: Mistress of the Dark hoodie.I freed myself from the confines of what caused all this unhappiness in the first place, and I’m no longer compelled to stress-eat junk food all night. My clients are happy, I’m happy, and my old band shirts no longer face the threat of violent extinction. I guess you could say this ol’ misfit is feeling quite fit.It's an Oat-Rage:All the Ways to Make Oatmeal Taste Actually AmazingYou deserve better than those little packets of sweet oat dust.View StoryExplore Bon AppétitCultureA Skeptic TriesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-25", "author": ["Condé Nast", "Joel Wigelsworth"]}