{"id": "1f2eec717edc7350fa433625900140a4", "url": "https://www.bonappetit.com/story/beggs-guide-learning-to-cook", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "My 5-Step Guide to Learning How to Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy 5-Step Guide to Learning How to CookIf you’re starting to get into this whole cooking thing, please don’t start with a salad. I’ve got some better ideas.By Alex BeggsApril 4, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Raise your hand if you’re cooking for the first timeBlack smoke was billowing out of my friend Will’s oven when his roommate realized it was probably time to call the fire department. Grease at the bottom of the oven, from Will’s first steak the night before, was the culprit. “You’re supposed to clean that before you use the oven, I guess,” was what he learned about cooking this week. Once the oven was clean (“I went full French maid on it”), he roasted some frozen broccoli. Another first.I’m so proud and happy for Will, who otherwise loves a good low-carb frozen dinner and refers to his Instagram followers as his “disciples” lol. He’s learning to cook, because what the hell else are you going to do right now?! And there’s not one path to doing so. I’m sure hundreds of cookbooks would argue otherwise, but from my experience, the best way to learn how to cook is to cook what you want to eat. I don’t want to learn how to make chicken pot pie because frankly I hate it! I skipped that chapter and I turned out just fine.On that note, I’m going to dedicate this newsletter to Will. Okay, and for anyone else who is getting sick of all the Stouffer’s french bread pizzas. Who isn’t sure how to boil water. Who needs to feed themself, but not elaborately. As they say on the Internet: I love this journey for you.Want this letter before it hits the website? Sign up for our newsletter!Start with something nutritionally terrible for youA pot of queso. A buttery pound cake. A batch of chocolate chip cookies. Adult mac n cheese (pasta queso). A properly microwaved hot dog (poke holes in it so it won’t explode).The junk food will make you happy. You’ll be fed and rewarded. Some people say the first thing they learned to cook was a nice vinaigrette. Excuse me, I don’t want to celebrate my independence with a SALAD. Oh wow this salad is positively palatable! Can’t wait to do it again! Wahh. Pass. Salads can come later, and I’d suggest going full green goddess before you’ve decided to emulsify boring ol’ oil.The first thing I cooked for myself when I was 22 was a tray of nachos, and it was a huge learning moment when I realized that preheating the oven matters (you’ll never forget rubbery nachos), and that it was important to wait for the cheese to bubble to signify they were ready. That’s the kind of nuance I could handle.Take on a huge project that’ll go wrong in 17 different waysA chocolate cake. Focaccia. Lamb tagine. A roast chicken. These are simple recipes, but the results are dramatic. Just go for it. Take the leap, see what happens. If 17 things go wrong, you’ll remember each one and next time will go smoother. If everything turns out, you’ll feel like a fucking CHAMPION. Skip the composed weeknight sheet-pan dinners. Go for the gold.Ted CavanaughMake a drinkMost classic cocktails are three ingredients and delicious. Mix it in your Hydroflask for all I care! Plus, you get a little buzz as a reward. Pro tip: Any time a cocktail recipe calls for simple syrup, I sprinkle a little sugar in the shaker and hope for the best. Works every time.Get the recipe: Whiskey SourPhoto by Chelsie Craig, food styling by Rebecca JurkevichGet acquainted with ground meatIf you’re a meat-eater who’s never actually cooked meat, as I was, ground meat is your entry point. These flavor-packed chicken lettuce wraps, specifically (if your condiment situation is stocked). Then simple Japanese soboro beef. Then Andy’s lamb meatballs. Then a bolognese-type thing. You don’t have the weirdly shaped body parts to stress over, you don’t have to poke a hot steak in a pan and wonder if it’s still raw or far past well-done. You don’t need an actual knife.Photo by Emma Fishman, Food Styling by Sue LiAsk for helpIt’s usually faster than falling down a reddit thread trying to figure out if you can use yogurt in place of sour cream (you usually can). I have three cooking friends who I regularly text when I have a question like, “can I use ground cardamom if I don’t have pods” and “why is my fried rice so mushy?” Sometimes they ignore me or get back to me too late but sometimes they don’t!!! And hey, if you’re planning on making a BA recipe like that beautiful cod and tomato curry pictured above, DM the recipe author on Instagram and see if they reply (please, though, not mid-cooking). The more specific the question, the better. Don’t be creepy.I have a hundred other thoughts but my word count’s up. But hey. This cooking thing is going to be messy. You’re going to forget to read the recipe all the way through and realize something has to rest overnight. You’re going to substitute a ton of ingredients and wonder why the recipe sucked (it was the Stevia). Smoke will billow. Rice will be mushy! Cakes will definitely be dry. And you can decide to forge ahead, or not, and get back to those frozen pizzas. You have the right.Quick q for ya: What Bon Appétit recipes are you cooking in your isolation time? How’d they turn out? Send pics! Email me at staff.bonappetit@gmail.com!Explore Bon AppétitBeggs NewsletterRead MorecookingThis Pasta Is So Creamy, Tangy, and Delicious, I Can Never Look at Mac n’ Cheese the Same Way AgainBy Sohla El-WayllycookingThere's No Better Time to… Start a Virtual Cookbook With Your FriendsBy Ella QuittnercookingHow To Cook With What You HaveBy Carla Lalli MusiccookingWe're Glad to Keep You CompanyBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-04", "author": ["Condé Nast", "Alex Beggs"]}