{"id": "1f3dabb34ad66e03aa5a3c0c8b364eb0", "url": "https://www.bonappetit.com/recipe/seven-hour-leg-of-lamb", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Seven-Hour Leg of Lamb Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueSeven-Hour Braised Leg of LambBy Rebekah PepplerMarch 15, 20224.5(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joann Pai, food and prop styling by Rebekah PepplerEmailPinterestPrintEmailPinterestPrint“I’m not a lamb person unless it’s this leg of lamb,” writes author and food stylist Rebekah Peppler in her masterful ode to French cooking, À Table. In this version of a Provençal classic, a whole leg of lamb is braised low and slow with a few aromatics and some dry wine until the meat is so tender you could eat it with a spoon—in fact, this dish is commonly known as gigot à la cuillère (or “spoon lamb”) in France.A popular mainstay on the table of Peppler’s Parisian home, this succulent lamb is paired with a vibrant green, garlicky persillade, providing a sharp counterpoint to the rich meat. Serve with cheesy new potatoes and a citrusy radish salad for a well-rounded meal. Any leftover lamb can be deliciously repurposed in sandwiches with bitter greens and plenty of mayo.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonFood Processor$49 At AmazonTongs$13 At AmazonMesh Sieve$13 At AmazonIngredients6 ServingsLamb14–6-lb. bone-in leg of lambKosher salt, freshly ground pepper¼cup extra-virgin olive oil1large onion, chopped5garlic cloves, lightly crushed8sprigs thyme2bay leaves2cups dry roséPersillade and assembly1cup (packed) parsley leaves with tender stems6garlic cloves½cup extra-virgin olive oilKosher salt, freshly ground pepperPreparationLambStep 1Place a rack in middle of oven and preheat to 275°. Season lamb liberally with salt and pepper. Heat oil in a large Dutch oven or other heavy ovenproof pot over medium-high. Cook lamb, turning occasionally with tongs, until golden brown, 8–10 minutes; transfer to a plate.Step 2Add onion, garlic, thyme sprigs, and bay leaves to pot. Pour in rosé and bring to a boil, scraping up any browned bits with a wooden spoon.Step 3Return lamb to pot, cover with a lid, and transfer to oven. Roast until meat is very tender and nearly falling off the bone, 5–7 hours.Persillade and assemblyStep 4At least 2 hours after the lamb has been cooking, pulse parsley and garlic in a food processor until finely chopped. Pulse in oil just to combine. Season persillade with salt and pepper; transfer to a small bowl.Step 5Carefully remove lamb from cooking liquid and transfer to a platter. (Strain cooking liquid through a fine-mesh sieve into a medium bowl and skim fat; save liquid to use in soups, in braises, or for making beans.) Serve lamb with persillade alongside.Do ahead: Persillade can be made 5 hours ahead. Store tightly covered at room temperature.Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Seven-Hour Braised Leg of Lamb?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerMainDairy-FreeNut-FreeGluten-FreeLeg Of LambLambMeatBraiseFrenchEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}