{"id": "1f6ede3a4bf5f57d41fea5f06aa85fc7", "url": "https://www.bonappetit.com/recipe/sheet-pan-turkey-and-gravy", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Sheet-Pan Turkey and Gravy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueSheet-Pan Turkey and GravyBy Kendra VaculinOctober 19, 20214.6(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintStop hunting for that roasting pan you never use! This Thanksgiving turkey with a simple gravy made from the drippings requires nothing more than a trusty rimmed baking sheet and a wire rack that fits inside. Give the bird plenty of time to dry-brine in the refrigerator—at least 24 hours and up to 2 days—for maximum flavor. Once you get roasting, a 12–14-lb. turkey will need only about 2 hours (plus 30 minutes of resting time) to turn golden brown and perfectly moist.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronInstant-Read Thermometer$35 At ThermoworksBrush$7.99 At AmazonWire Rack$23 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketHeatproof Measuring Cup$18 At AmazonSmall Saucepan$155 At AmazonLarge Basting Spoon$16.37 At AmazonWhisk$10 At AmazonIngredients8 - 10 Servings112–14-lb. turkey⅓cup Diamond Crystal or ¼ cup Morton kosher salt¼cup (packed) light brown sugar1Tbsp. smoked paprika1cup (2 sticks) unsalted butter, divided3cups turkey stock or low-sodium chicken or vegetable broth⅔cup all-purpose flour1Tbsp. Worcestershire sauceFreshly ground black pepperAssorted herb sprigs (for serving; optional)PreparationStep 1Line a rimmed baking sheet with foil and set a wire rack inside. Pat turkey dry with paper towels and place, breast side up, on rack.Step 2Mix salt, brown sugar, and paprika in a medium bowl to combine. Pat dry brine all over sides and in cavity of turkey, working into any crevices. Chill turkey, uncovered, at least 24 hours and up to 2 days.Step 3When you are ready to roast turkey, preheat oven to 400°. Arrange turkey, breast side up, on a wire rack set inside a rimmed baking sheet (if using the same baking sheet, throw away foil and rinse pan to remove any accumulated salty liquid). Pour ¾ cup water into baking sheet (this will keep the drippings from burning). Roast, rotating baking sheet halfway through, until golden brown, 35–45 minutes.Step 4Meanwhile, melt ½ cup butter in a small saucepan over medium.Step 5Remove turkey from oven and brush or spoon half of the butter over turkey. Pour an additional ⅓ cup water into baking sheet.Step 6Reduce oven temperature to 300°. Return turkey to oven (if any spots are overly dark, like the wing tips, cover with small pieces of foil) and roast, rotating baking sheet and brushing turkey with remaining melted butter halfway through, until well browned and an instant-read thermometer inserted into the thickest part of the breast registers 155° (temperature will continue to rise as the turkey rests), 70–80 minutes. Let rest on baking sheet at least 30 minutes.Step 7Lift and tilt turkey so that all the drippings from the bird and inside the cavity run onto the baking sheet, and transfer turkey to a cutting board. Pour drippings into a large measuring glass, scraping in browned bits stuck to baking sheet with a spatula. Pour in stock as needed to measure 4 cups.Step 8Melt remaining ½ cup butter in a medium saucepan over medium heat. Add flour and cook, whisking constantly, until smooth and light golden brown, about 3 minutes. Gradually pour in drippings mixture, whisking constantly until combined. Reduce heat to low and simmer, whisking often, until gravy is thickened, about 5 minutes. Add Worcestershire sauce and whisk well. Season gravy with salt and lots of pepper.Step 9Carve turkey and arrange on a large platter. Tuck herb sprigs around turkey if desired. Serve with gravy on the side.How would you rate Sheet-Pan Turkey and Gravy?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis is the among the top 3 best turkey I have ever tasted. I don’t even like turkey that much, but when it’s cooked as perfectly as this one was, I had to make another one so I could eat more of it. I’ve never dry brined any meat before and was skeptical, but now I’m a convert. I left the bird in the fridge uncovered for 2 days and did not pick up any refrigerator odors. I used a leave-in meat thermometer to hit the perfect temperature. My family loved it and there weren’t enough leftovers for a sandwich! The gravy presented as a little salty on first bite, but the other flavors  were nicely balanced. It went nicely with mashed potatoes. We have a winner. PatriciaSan Francisco12/12/2021This was the first time I have ever roasted a turkey in my oven.  I followed the directions to the 'T' and it turned out wonderful.  I had a remote temperature sensor in the breast for the entire cooking time and with 40 seconds left in the allotted time in recipe, the breast hit 155*F.  Guests could not believe that I cooked a 14.6 lb Turkey in 2 hours.  Lazlo HollyfeldByram, NJ11/29/2021Used this recipe through step two.  Step 3 for temp guidance and then roasted in an old fashion electric roaster, which reduced the cook time a bit.  This was the best turkey I have made in a very long time.  My family picked right up on smoked paprika and loved it.  The bird came out moist and tender.  We are making this our go-to Thanksgiving turkey recipe!AnastasiaCCanton, MI11/27/2021This turkey turned out perfectly. Nicely browned and very flavorful. I don't stuff my turkey, so this was a good recipe for me. I appreciate the easy prep and clean-up!Alice F.Flagstaff, AZ11/26/2021Can I cover the turkey while it’s dry-brining in the fridge? I have a big plastic bag it was wrapped in. I don’t want it to take on any fridge-flavorsCasie Saint Paul, mn 11/24/2021Listened to the podcast and want to clear up the mystery about roasting a turkey for such a long time in the old days. We always roasted the stuffing inside the bird, and low and slow was pretty important. Judy VallasIllinois11/18/2021Excellent recipe!AnonymousSan Francisco 11/2/2021Explore Bon AppétitGravyTurkeyPoultryThanksgivingRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}