{"id": "1f7b5a771e5170d9244c531b9830926e", "url": "https://www.bonappetit.com/story/shop-less-often", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Food Tastes Better When You Shop Smarter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFood Tastes Better When You Shop SmarterThe schlep-less, annoyance-free path to better meals.By Carla Lalli MusicMarch 20, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.My birthday is in August, but a lot of people have been wishing me a happy “book birthday” or congratulating  me on my “book baby” this week. That’s because the cookbook that I wrote, Where Cooking Begins, arrived in the world yesterday (!) after a two-year gestation period.That’s right, I’ve been working on this thing for two years, which feels like an outrageous amount of time, especially in cat years. But that’s how long it takes to come up with an original book idea, develop dozens of recipes (in my case, 70, plus seven techniques), write a lot of words, take a lot of pictures, then design, print, and ship a book.As someone who is used to seeing a new issue of our magazine or batch of digital recipes released every month, 104 weeks with little to show for it was a slow torture. But at least it gave me plenty of time to work on my elevator pitch. Go ahead, ask me what the book is about! I’ve got the one-liner down pat: “I wanted to write a cookbook that would make people excited about shopping for food.”Want this letter before it hits the website? Sign up for our newsletter!I know, I know. Food shopping: so fun. Maybe I’m weird, but I actually very much enjoy picking out the ingredients for my meals. In fact, over the years, buying food has become less of a chore and more of a creative undertaking. I use in-person shopping trips to find things that actually make me hungry—peak vegetables, ripe fruit, sparkly fish, and nice-looking cuts of meat—and have totally embraced online shopping for the rest of my staples. I’ve gone from big-batch cooking and giant weekend shopping hauls to frequent, small trips to buy groceries in smaller quantities. I’ve definitely noticed that I waste less food, and I have a lot more fun cooking when it’s not all-day projects like triple-batches of meatballs or organizing the various types of crackers I felt compelled to buy. I buy good food, season it simply, and use basic cooking techniques. Somehow, we always eat well.There she is!\nIf there’s one recipe that encapsulates the spirit of the book, it would be the Aioli and All The Things for Dipping. This is my take on “le grand aioli,” the classic French spread that combines seasonal produce, fresh fish (often salmon), hard-boiled eggs, crusty baguette, and a rich homemade mayonnaise for saucing everything. The fun part is choosing the vegetables that you want to feature—that’s the “whatever looks good” part. You could use one or two types, or lots and lots, depending on what’s popping at your market or neighborhood store. If the salmon looks great, use salmon. If not, any fish will work, including a nice oil-packed tuna from a jar or can.At home, trim and prep your veggies. I leave lettuces and cucumbers raw, but will cook things like potatoes, carrots, green beans, asparagus to make them more palatable. I like to use a steamer because it’s fast, easy, and works on every type of vegetable imaginable, and is also convenient for cooking the fish and the eggs (especially in large batches).The only specific measuring you need to do is for the aioli, and the ingredients required should be in your larder at all times: half a cup each of vegetable oil and olive oil, an egg plus a yolk, a teaspoon of Dijon mustard, a small clove of garlic that you finely grate, and a few tablespoons of vinegar or lemon juice. First you whisk together the egg, mustard, garlic, and vinegar, and then slowly whisk in the oils until the aioli is light and thick (about a cup’s worth will do it). Season that with salt and pepper and then set it out with the rest of your haul.For me, this meal always feels like an indulgence, and guests think you’re a genius. You can make it for yourself, for dinner for two, to feed a family, or to serve a crowd, simply by scaling up. The techniques are entry-level—peeling and trimming, mostly. But there’s magic in the emulsion and satisfaction when the egg and oil decide to become a new thing together. It’s everything I love about being in the kitchen, especially because the effort leads to feeding other people without taxing myself in the process.If only writing a book were more like making aioli, I could have gotten this one done in a lot less time.Explore Bon AppétitCarla NewsletterAioliCookbooksRead MorecultureOur March Cookbook Club Pick Is Our Very Own Carla Lalli Music’s Where Cooking BeginsBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-20", "author": ["Condé Nast", "Carla Lalli Music"]}