{"id": "1f8780d2ee7445ece0f7e4aabcc986f4", "url": "https://www.bonappetit.com/story/how-to-get-the-most-flavor-out-of-canned-tomatoes", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "How to Get the Most Flavor Out of Canned Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Get the Most Flavor Out of Canned TomatoesThis simple maneuver will bring your pasta sauces and soups to the next level.By Alex DelanyJanuary 29, 2019FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailHow’s your tomato trivia bank looking these days? Oh. There’s a little room in there? In the “Canned Tomato” section? Perfect. Because we figured you’d like to know a couple things about canned tomatoes, particularly how you can get the most flavor out of them and make all of the dishes containing them taste (approximately) ten times  better.Here’s a fact for you: Canned tomatoes aren’t fully cooked. They are cooked, just not to the point or with the method that we’d like them to be. When tomatoes are canned, they get soaked in hot tomato juice, sealed, and then heated to kill any potentially harmful organisms. Basically, canned tomatoes are cooked to make them shelf stable, not to make them tasty.This is why canned tomatoes still have a raw tomato flavor to them. They sit in tomato limbo, somewhere between cooked and raw. (If you’ve ever eaten a tomato right out of the can, you’ll know what we’re talking about here.) The sugars in the tomato aren’t developed, and they taste pretty watery. But we can fix this! It’s up to us to make sure they actually taste like something by the time you’re eating your pasta pomodoro.There's the colander, sitting on top of the bowl. All the liquid falls right through!\nSo here’s what you do: Grab a colander and place it on top of a medium-sized bowl. Open your can of whole peeled tomatoes and pour them into the colander so the liquid strains into the bowl below and the tomatoes are left up top. Separating the tomatoes from the liquid is step number one. (Keep that liquid, by the way!) Cooking the tomatoes is step number two.You want to give your tomatoes contact with a direct heat source. That means cooking them at the bottom of whatever saucepan or Dutch oven you’re using. The goal here is to remove water from the tomato solids and allow them to caramelize somewhat, which will concentrate their flavor. Less water and more caramelization means more sweetness, acidity, and complexity in whatever dish those tomatoes are a part of—what's not to like?Adding the drained tomatoes to a Dutch oven to develop flavor. Classic.\nOnce you concentrate the flavor of the tomato solids, you can add the liquid back in. That tomato liquid will lose water content and concentrate over time as well, but the tomato solids would have never developed as much flavor if we had skipped that first step and thrown everything in at once. From there, it's business as usual, whether you're building a sauce for pasta, simmering some soup, or whipping up a big batch of chili.Oh. Damn. That was only one piece of tomato trivia. We still owe you a second fact. Well, the world’s tallest recorded tomato plant was measured at a height of 65 feet. That’s pretty tall! And if every tomato on that plant got canned, we'd eat them all—just as long as they were drained and cooked first.Now, let's put that method to work with some simple ribollita:Simple RibollitaThis (vegetarian!) Italian classic is about as comforting as it gets, packed with hearty greens, meaty beans, and plenty of rich olive oil and umami-packed Parm.View RecipeExplore Bon AppétitBasicallyCanned TomatoesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Alex Delany"]}