{"id": "1f96b7ef17a64cc61291cb7a8c46b86e", "url": "https://www.bonappetit.com/recipe/chicken-rice-soup", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Chicken and Rice Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFeel-Better Chicken and Rice SoupBy Andy BaraghaniDecember 26, 20184.7(176)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you want this take on classic chicken soup to have a similar consistency to congee, add 10–15 minutes to the cooking time so that it can become nice and thick. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2–4 servings¾lb. skinless, boneless chicken thighs⅓cup jasmine rice, rinsed4garlic cloves, thinly sliced12\" piece ginger, peeled, thinly slicedKosher salt2small sweet potatoes, unpeeled, cut into ½\"-thick rounds2Tbsp. fresh lemon juice2Tbsp. soy sauce½bunch cilantro, coarsely choppedFreshly ground black pepperPreparationStep 1Bring chicken, rice, garlic, ginger, and 5 cups water to a boil in a large saucepan. Add a big pinch of salt. Reduce heat to medium-low and simmer, uncovered and stirring occasionally, until rice has swelled and chicken is firm, 10–12 minutes.Step 2Add potatoes to pan and cook over medium-low heat, still uncovered and stirring occasionally, until soup is thickened and potatoes and rice are tender, 15–20 minutes longer. Transfer chicken to a bowl and shred with 2 forks, then return to pot. Stir in lemon juice and soy sauce; taste soup and season with salt if needed.Step 3Divide soup among bowls. Top with cilantro and lots of black pepper.Step 4Do Ahead: Soup (without cilantro) can be made 3 days ahead. Transfer to an airtight container and chill. Reheat over medium-low, adding water to thin as needed.How would you rate Feel-Better Chicken and Rice Soup?Leave a ReviewTell us what you thinkReviews (115)Back to TopTriangleI added kale and Better Than Chicken Broth. Very tasty and SIMPLE.SusanBoise, Idaho1/10/2022Added a shallot, acorn squash, and carrot to the mix as well as a 1/2 tablespoon of Chinese red Chilli powder.  Turned out wonderfully. AnonymousWashington, DC1/2/2022I substituted the chicken thighs with beef, and the rice with barley. Then I grabbed a recipe for beef and barley soup and I made it. It was delicious! ScottLouisville, KY12/23/2021I was beginning to wonder if anyone really made it as written!Anonymous12/23/2021Okay I don't usually love rice in soups since it loses texture but something about this recipe made me think about it constantly until I had to make it tonight. I did the following things after reading comments:\n\n1) doubled the recipe since that was the size of my chicken package\n2) added an extra 2 cups water bc I was worried it'd be too thick and I wanted brothy\n3) used short grain brown rice\n4) added 2 heaping tbs of better than bouillon to the water\n5) used about 6 frozen minced ginger cubes instead of the sliced ginger \n6) added 2 thinly chopped leeks and about 8 oz thinly sliced shiitake mushrooms for extra veg at the time of the sweet potato, which I diced instead of sliced\n7) topped soup with cilantro, jalapeño, and chopped scallions\n\nFrankly, this soup was delicious and I will probably do the above steps when I make it again!! It didn't even need the extra toppings. The broth tastes incredible. I do think the shiitake mushrooms are a super tasty element that adds to the flavor, though. Yummmmm! AMSSan Diego11/9/2021THIS is my go-to soup ....easy and delicious ! I usually reduce the amount of rice, and increase the ginger to taste. Love this so much! Susan A. RSF, CA4/26/2021Can you use basmati rice instead of jasmine? AnonymousLondon 1/31/2021Andy Baraghani is a wizard.Sam JenningsNashville, TN1/18/2021This is probably my favorite soup EVER. I substitute short pasta like orzo, adding it at the end, instead of the rice. I'm not a fan of wet rice (sorry). It's so comforting, so flavorful and so quick. Ten out of ten, fantastic recipe.Paula PérezSpain11/29/2020This turned out great! I made chicken stock thinking I would freeze it and use it later, then decided I wanted soup today since it's cold/ rainy. I didn't have the ingredients for my usual chicken noodle soup so I went searching for something new. I  used leftover rotisserie chicken- breast/ thighs, grated the ginger, sliced the garlic and increased everything since I had 8 c. stock. I used 1 c. rice and it turned out pretty thick but it is delicious. I decreased the soy sauce a bit since the stock was already pretty salty. I had a piece of sourdough toast on the side and inhaled it for dinner. The rest will go into the freezer for another day.amyJacksonville, FL11/20/2020stick a fork in me cause i'm donerainwaterSanta Clara CA11/11/2020Super delicious! Perfect for this cold snowy day. I used skin-on bone-in chicken thighs and fried them first, and then fried up the ginger/garlic and added in some scallions and cilantro stems. I used a little less soy sauce (about 1.5 Tbsp) and only the juice of half a lemon, and didn't add any salt. It was super flavourful! Served with the tops of the scallions, fresh cilantro, and hot sauce. Charlotte Calgary, Alberta11/10/2020I love this soup and make it whenever I have an extra sweet potato lying around. I have found I refer to sear the chicken highs and then cook the garlic and ginger in the chicken drippings and then add liquid, rice, etc....just tastier chicken and richer broth. AnonymousWashington, DC10/12/2020Great recipe; I’ve made this many times, both exactly as stated, and with variations. I find biting into thinly sliced ginger unpleasant. I usually instead make small matchsticks by stacking the slices and running the knife through one more time. If you can find juicy ginger pieces (I’ve noticed these are usually refrigerated), they have a sweeter smell and make a huge difference. I’ve tried grating the ginger, but I find the flavor too strong and also don’t enjoy the resulting texture. I find shredding the chicken with forks to be fussy, especially since you have to wait for it to cool. I’ve just thinly sliced it while still hot and it’s almost as good. I’ve also tried making this with 1-2 tsp of oyster sauce added, which was delicious. AnonymousSan Francisco, CA8/25/2020My husband and I make this soup at least twice a month. We end up doubling the recipe so we have plenty of extra. We always grate the ginger and garlic so that it mixes into the broth better (the ginger flavor is too strong when it's sliced). We also use extra lemon juice and zest a whole lemon. We always top it with a drizzle of hot chili oil along with with the cilantro to add a little heat. Even without any of the extras, it's still such a great recipe.AnonymousHouston, TX8/4/2020Explore Bon AppétitSoupSoups and StewsChicken ThighChickenPoultryRiceRice & GrainsSweet PotatoPotatoVegetableWinterEasyWeeknight MealsOne-Pot MealsMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Andy Baraghani"]}