{"id": "1f9fdec2fab6f4a92f84bb156aa501f3", "url": "https://www.bonappetit.com/story/how-to-poach-chicken-breasts", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "How to Poach Chicken Breasts That Are Juicy and Delicious, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Poach Chicken Breasts That Are Juicy and Delicious, Every TimeIt's about gentle heat, folks! Here's how to poach chicken breasts that are never dry or boring.By Alex DelanyMay 29, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailPoached chicken breasts are either offensively bad or transcendently good—and, sadly, the scale tips drastically in favor of the former. But that’s just because most people don't know how to poach chicken breasts properly. From this point forward, you will not be one of those people. You will poach chicken perfectly, leaving dry, chewy poached chicken in the rear view mirror.But wait, what is poaching? It's a cooking method we mention a lot less frequently than roasting or frying or grilling. To poach something is to cook it while submerged in a liquid at a low temperature (read: not boiling). That liquid could be oil, milk, or wine, but we most frequently poach in seasoned water.Cooking chicken breast in water does not sound glamorous. And most of the time—when people overcook and mistreat their chicken—it isn’t. But the gentle, gradual heat that poaching provides can actually lead to one of the most tender, succulent, perfectly cooked pieces of white-meat chicken you’ll ever eat. Here’s how to nail it every time:Start with 4 cups of cold water and 2 large chicken breasts (about 1 lb., 4 oz. total) in a sauce pan. (This ratio of water-to-meat is important; larger breasts will take longer to cook, and smaller breasts will overcook more quickly. And if you want to cook more chicken, add another 2 cups of water per breast.) Cold water is key here, because it allows the chicken to cook way more gradually than it would if you just dumped them into already-boiling water.Season the water with 3½ tsp. of kosher salt. This might seem like a ton of salt, but trust us. Only a portion of it ends up on the chicken. Seasoning your water aggressively ensures that your chicken will be well-seasoned and actually taste like...chicken. (But in a good way!)Turn the heat to medium and bring the water to a gentle boil. As soon as you see the surface of the water start to roll, flip the breasts over with tongs, remove the pot from heat, and cover it with a tightly fitting lid. The chicken breasts will continue to cook gently in the hot water.Once the chicken breasts register an internal temperature of 150° on the ol' instant read thermometer, remove them from the water. This will usually take about 5-10 minutes, but remember that it all depends on how large or small the chicken breasts are. Always check sooner than later if you're not sure—you can always cook them longer, but you can't uncook them.Once you’ve removed them from the water, let them rest on a cutting board for at least five minutes. Then slice them up and throw them over rice, in a salad, or onto your grand aioli platter. Whatever you choose, you’ll be adding the best possible poached chicken breast you’ve ever cooked into the mix. In case you haven't noticed, you’re living on the transcendently good side of that scale we mentioned earlier. Welcome, friend: We've been expecting you.Now that you know how to poach chicken breasts, go make a salad!Spring Chicken Salad with Smashed Green BeansProperly-poached chicken breast is truly a thing of beauty—juicy, tender, and a blank canvas for big flavors.View RecipeExplore Bon AppétitBasicallytechniqueChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Alex Delany"]}