{"id": "1fa6c08ab5ea4e95b391951d2a176baf", "url": "https://www.bonappetit.com/recipe/hemp-milk-chai", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Hemp Milk Chai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueHemp Milk ChaiBy Chris MoroccoJanuary 9, 2018EmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintHemp milk makes the fastest, creamiest alt-milk with very little waste, but any nondairy milk works.Ingredients4 servingsHemp Milk½cup hemp seedsSuperdust (Optional)2teaspoons chlorella powder1teaspoon reishi or cordyceps powder¼teaspoon ground cardamomChai and Assembly23-inch cinnamon sticks1½-inch piece ginger, peeled, finely grated16cardamom podsVery small pinch of kosher salt4bags strong black tea3tablespoons pure maple syrupIngredient InfoChlorella and reishi powders are available at health foods stores and online.PreparationHemp MilkStep 1Purée hemp seeds and 3 cups cold water in a blender until very smooth. Strain through a fine-mesh sieve (a sheet of cheesecloth or nut-milk bag also work) into an airtight container.Step 2Do Ahead: Hemp milk can be made 5 days ahead. Cover and chill.SuperdustStep 3Mix together chlorella, reishi, and cardamom in a small bowl.Chai and AssemblyStep 4Bring cinnamon sticks, ginger, cardamom pods, salt, and 2 cups water to a boil in a large saucepan over medium-high. Reduce heat to low, cover, and simmer until very fragrant, 10–15 minutes. Remove from heat; add tea. Cover and let sit 5 minutes.Step 5Strain chai mixture through a fine-mesh sieve into a clean saucepan. Add maple syrup and 2 cups hemp milk (save the rest for another use); cook over medium heat, whisking if milk separates, just until hot. Divide among mugs; top with superdust.How would you rate Hemp Milk Chai?Leave a ReviewTell us what you thinkExplore Bon AppétitHot DrinkDrinks AllSouth AsianAsianCardamomHerbs & SpicesGingerCinnamonQuickEasyDrinksDairy-FreeGluten-FreeVeganVegetarianNonalcoholicHealthyishSimmerBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}