{"id": "1fa96b1e1d28f8a125cfd81031d66839", "url": "https://www.bonappetit.com/story/never-fail-crispy-skin-salmon", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "This Crispy-Skin Salmon Method Never Fails and Makes Me Feel Fancy AF | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Crispy-Skin Salmon Method Never Fails and Makes Me Feel Fancy AFThe best part? It works on pretty much any fish.By Alex DelanyApril 17, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the crispy-skin salmon recipe that associate web editor Alex Delany just couldn't live without.I rarely mistake my kitchen for a restaurant. Its meagerness is noteworthy. There somehow seems to be a negative amount of counter space. There’s only one rack in my compact oven, and the shelf I store my pots and pans on also houses our garbage bags, aluminum foil, and, every so often, a basketball. Pieces of dried pasta surface days after I’ve cooked them, after they’ve decided to check out of the Under the Fridge Motel. There is nothing professional about my kitchen...unless I happen to be making crispy-skin salmon. When that's going down, my kitchen is a restaurant—and I am the chef, the waiter, and the guest.For beginner cooks, there are inevitable anxieties associated with cooking fish at home. Will it be dry and overcooked? Will I die from eating raw fish? Or even worse, will I smell up the whole apartment building and be called Smelly Smelly Fish Boy for the rest of time? Let me just say this: You don’t need to worry about any of that when you’re making crispy-skin salmon. It’s both attainable and impressive. Crispy-skin fish is one of those dishes that makes you feel like you’ve accomplished something. Because you have. The fish you just cooked looks like it could've come out of a restaurant kitchen, and it tastes just as good. Here's how it goes down.The fish you use matters. Starting with good fish is key, and that means avoiding the previously-frozen-then-thawed stuff, which is usually what's sitting on ice at your grocery store being sold as \"fresh.\" You should use fresh fish from a trusted fishmonger or frozen fish (that you buy frozen) from a sustainable farm or fishing service. And for this cooking technique—which works well with all kinds of fish, from mackerel and branzino to black bass and snapper—we want to pick filets that are as flat and even as possible.To start, put your filets on a plate, skin-side up and uncovered, and chill them in the fridge for an hour. This sounds like a step you’d skip, right? Please: don’t. The fridge will dry out the skin, making it crisp-able. This is crucial, like learning to read and write or obtaining a drink after you get out of work on a Friday.Once your fish is chilled, season both sides with kosher salt. Now, put some olive oil in a stainless steel skillet and...don’t turn the heat on. We’re going to place our fish in the room temperature pan, skin-side down, and then turn on the heat to high. Just trust. We call this the cold pan method, and it will ultimately give the skin on our fish a crispier skin.Lookin' suuuuuuuuper crispy.\nIn the first two minutes that the pan is heating up, keep a spatula (hopefully a fish spatula) pressed firmly over the fish. This will keep the edges from curling up. We’re trying to make our kitchen restaurant-ish, remember? Restaurants don’t serve curled fish filets.After removing the spatula, the fish should start to visibly cook. You’ll see the edges of the fish move from translucent to opaque. Once the flesh of the fish has turned opaque all the way up to the thickest section of the filet (this usually takes about 3 minutes for a thin filet; thicker pieces will take longer), we’re going to turn off the heat and flip the fish. At this point, 90% of the fish has cooked through, so we’re going to use the residual heat in the pan to finish off the filet. Let the filet rest on the skin-less side for a little over a minute.Woah. Look at that skin! It’s so beautiful, crispy to the point of textural royalty. It’s calling to us. BUT WAIT. We need to serve this filet with something. Maybe it’s over some rice. Maybe it’s over a green curry. Maybe it’s over a salsa verde or yogurt sauce. Just remember that if you're serving your fish with sauce, make sure that the fish is always served OVER it, skin-side up—we don’t want any moisture-heavy sauce to ruin that crispy skin we worked so hard for.And that’s it. You might have noticed that the cook time on this is only about 6 minutes, and the result is pretty professional. Your kitchen is small; my kitchen is small. But the payoff? HUGE.Yeah, the kitchen is starting to feel restaurant-ish right? This fish technique is pretty professional. It’s impressive. It’s empowering. This is some real restaurant-level stuff. Oh, no. I’m so sorry, we’re booked for the evening. You can leave your number if you’d like, just in case we get a cancellation. It doesn’t look promising though. My roommate is using one half of the couch. And the coffee table is the only place to eat.A little cabbage stir-fry sounds like a pretty good fish companion:Crispy-Skin Salmon with Napa CabbageThis method guarantees perfectly-cooked, crispy-skinned salmon every time. We promise.View RecipeExplore Bon AppétitBasicallyFishNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-13", "author": ["Condé Nast", "Alex Delany"]}