{"id": "1fab001af30adba18ce171f80e97cff3", "url": "https://www.bonappetit.com/recipe/cider-braised-pork-shoulder-with-butternut-squash", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Cider-Braised Pork Shoulder with Butternut Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCider-Braised Pork Shoulder with Butternut SquashBy Amiel StanekJanuary 18, 20184.9(8)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintBone-in pork shoulder is one of the least expensive, party-friendly animal proteins you can buy. Boneless will work for this recipe as well, but it will cook through a bit quicker. If you end up with skin-on pork shoulder, either take it off yourself—easy to do with a sharp knife and a YouTube video—or simply cook it with the skin on and remove it after the pork is fully cooked. This pork is the star of the $50 dinner party; see the rest of the menu here.Ingredients10 servings, with leftovers16–7-pound bone-in pork shoulder (Boston butt), preferably skinless3tablespoons kosher salt, plus more2medium butternut squash (about 7 pounds total; pick ones that are about the same size and shape)1tablespoon extra-virgin olive oil, plus more2cups apple cider or juice½cup low-sodium soy sauce or tamari½cup distilled white vinegar, plus more1head of garlic6scallions, trimmedSteamed white rice (for serving)PreparationStep 1Place pork shoulder on a rimmed baking sheet and rub all over with 3 Tbsp. salt. Let pork rest, uncovered, at least 1 hour and up to 2 to come up to room temperature. (This will help it to cook more evenly.)Step 2Arrange racks in upper and lower thirds of oven; preheat to 300°. Slice squash in half lengthwise and use a spoon to scoop out seeds and stringy parts. Season all over with salt, then rub with a bit of oil. Transfer cut side down to another rimmed baking sheet.Step 3Once pork is room temperature, pat dry thoroughly with paper towels. Heat 1 Tbsp. oil in a large Dutch oven over medium-high until shimmering and almost smoking. Cook pork on all sides until well browned, about 15 minutes total—be patient! Carefully transfer pork back to rimmed baking sheet, turn off heat, and even more carefully pour out whatever fat has accumulated in bottom of pot.Step 4Return pot to medium-high heat and add apple cider, soy sauce, and ½ cup vinegar, scraping bottom to get up any crispy, stuck-on bits. Slice head of garlic in half crosswise and add to pot. Lower pork back into pot. Cover pork with a piece of aluminum foil and tuck it around pork. Cover pot and transfer to lower rack of oven. Place baking sheet with squash on top rack. Bake pork, turning after 1½ hours, until meat is very tender and pulling away from the bone, 3–3½ hours total. Bake squash until a fork poked through skin slides easily into flesh, 1–1½ hours.Step 5Transfer pork to a large plate or platter, reserving pot with cooking liquid, and let rest until cool enough to handle—it’s a big piece of meat, so this will probably take close to an hour. Remove garlic with a slotted spoon and squeeze out cloves into braising liquid; discard skins. Tear pork into shaggy pieces, discarding any sections of fat or gristle, and return meat to pot with cooking liquid. Season pork and liquid with salt and a splash of vinegar. Slice scallions crosswise as thinly as possible.Step 6To serve, reheat pork in liquid over low heat. Using a large spoon, scoop out pieces of squash and arrange on plates. Spoon pork and some juices over squash and garnish with sliced scallions. Serve with rice alongside.How would you rate Cider-Braised Pork Shoulder with Butternut Squash?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleFantastic, even greater next day in a fried rice with freezer peas, eggys and some more spring onions. Next time I’d  pull back on that soy sauce. Anonymousphully 7/31/2020Question vs a review - any issues with NOT discarding fat from the pork shoulder upon completion? browne75Las Vegas2/8/2019I thoroughly read through recipes before I try them for the first time.  I found two things that could have tripped me up and led me to edit this recipe for my own records:\n\n1. The instruction to \"turn off the heat\" in step/paragraph 3.  This is referring to the stove-top, not the oven (I know... \"duh!\").\n2. The steps for prepping and cooking the squash are scattered throughout the instructions.  I noticed that the squash requires only 1 1/2 hours to bake, so why start roasting it at the same time as the pork, which braises for 3 to 3 1/2 hours?  I'd either have squash sitting for 2 hours after it was done, or sitting for 2 hours before it needs to go in the oven.  It makes more sense to execute all of the steps for the squash at the point where the pork is turned, i.e. 1 1/2 to 2 hours after it goes in the oven.  For my records, I pulled those instructions out and inserted them after step 4, and this how I proceeded with making this recipe.\n3.  I used Rice Vinegar instead of distilled white vinegar (to me, that's a cleaning product) in step/paragraph 4, and used about 1 tablespoon aged balsamic vinegar to finish at the end.  No other changes.  \n\nMy kitchen smelled wonderful as the pork was braising in the oven, and the flavor combination with the roasted squash was outstanding!  This will go on our regular winter recipe rotation!AnonymousIdaho12/6/2018This was excellent! I highly recommend. I used regular (not low-sodium) shoyu and the jus was a bit salty but not overwhelming. We paired it with a 2014 Riesling from Alsace and it was an exquisite combination. Well done BA!AnonymousPhilly2/15/2018Explore Bon AppétitApple CiderAlcohol & Other DrinksPork ShoulderPorkMeatButternut SquashSquashVegetableAcorn SquashFallWinterMainDairy-FreeNut-FreeBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Amiel Stanek"]}