{"id": "1fb749cbfb967bb65e436e5bf8ab58f8", "url": "https://www.bonappetit.com/story/eating-off-dates-plate", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Is It Ever Okay...To Eat the Food Off Your Date’s Plate? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Eat the Food Off Your Date’s Plate?And more of your truly open and honest date-night etiquette questions, answered.By Alex BeggsFebruary 12, 2019FacebookTwitterEmailHulton ArchiveFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appetit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.How much PDA is too much PDA at a restaurant? —Touchy TrevorAny. Footsie? Violent, should be illegal. Putting food in someone else’s mouth who isn’t in a high chair? Repulsive. Holding hands across a table. I HATE THAT. GET A ROOM.Is it okay to eat off your date’s plate? (A hungry guy friend is asking.) —Audacious AdamHow dare you, sir. NO. Unless you’re in a loving, committed relationship and this clause is included IN YOUR WEDDING VOWS, thou shalt not fork a single radish off my plate unless you’ve been invited to. Especially French fries. There’s a three fry rule of fry theft (and only one if steak fries), and after that, you better order a side for yourself. The nerve! This question comes from a place of patriarchal entitlement mixed with some stereotypes about delicate ladies who can’t handle an entire quarter pounder. I’m huffing and puffing. I’ll blow this house of pancakes down! I’M HUNGRY TOO. And don’t you dare ever ask me, “gonna finish that?” I will m u r d e r.The following date night restaurant scenarios are RED FLAG indicators that the relationship needs to end right here and now:They’re rude to waitersThey’re bad tippersThey ask “gonna finish that?”They tease you for not drinkingThey call the bathroom “the little boy’s room”They reveal they’re a starred Yelp reviewerHow do you get strong food tastes out of your mouth before making out on the sidewalk? (And without making it obvious that you anticipated the make out)? —Attagirl AnnaleeAm I the only one who finds super minty kisses sort of jarring and dental? Halitosis is unfortunate and that’s a whole other ball game, but just like, food tastes? WHO CARES. I love food! We probably ate the same things and have the same flavored saliva! (Martini-French-fries-mayo if things went as planned.) My first kiss was at the movies and he was eating a huge, bulging, veiny... pickle. It was a pickle juice kiss! Delightful. Things didn’t work out.SNACK BREAK!Alex LauGet it? Dates. This almond and date mix gets roasted in a cast iron skillet and it’s pure ROMANCE. The dates get gooey and caramelized, the almonds get toasted, there’s some citrus and herbs in there to keep things interesting, and you can eat it by the handful or smash it onto crusty bread.What would you make for a Valentine's Day meal ...for one? —Lone LinaPersonally? Nachos. Double layer. Tostitos (REGULAR. NOT SCOOPS), refried beans, shredded cheddar. Jar of pickled jalapeños to apply to each individual chip. But that answer isn’t going to offer the opportunity to plug a Bon Appétit recipe or three. Soooo. In that case. I’d do this easy yet decadent skirt steak with pan sauce with a side of Trader Joe’s frozen hash browns. Drink the rest of the white wine you used in the sauce, on ice. In this scenario, however, you aren’t going to watch Netflix and get all cozy. You’re going to eat that steak and do some laundry, gather all the forms you need for your taxes, pay your credit card bill. Then you have my permission to pay for porn. The high quality stuff. It’s called financial health.What date number is a burp okay? —Belching BrittanyOne if the date’s at a brewery and you do that thing where you cover your mouth and burp under your breath, which I find impossibly sexy, alluring, and mysterious. What are you doing under there? Burping? Oh you sly devil! Get into my bed!Photo by Chelsie Craig, Food Styling by Pearl JonesWhat's a good Valentine's Day cake or dessert? —Jovial JustinThese molten caramel cakes, hands down.What is your strategy to make sure Valentine’s Day dinner feels rich and indulgent, but not so heavy as to put the damper on any other evening activities? —Caring CeiliI’m pretty sure you’re asking what dinner will still make you want to have sex afterward. Too heavy a meal, and you’ll just want to lay on your left side and yell at the kids on MasterChef Junior. Too light and you’re what, on a diet now? Here’s the thing. Just make a rich and indulgent meal. I’d like these lamb meatballs, please, with a crispy fennel salad. The problem with feeling gross and bloated is that our portion sizes are too big. Serve dinner on a smaller plate, make a salad, and then here’s my pro move: go for a walk after dinner. It’ll feel all romantic and stuff but it’ll help you digest and you can crop dust the neighbor’s begonias. A few hours later, after you’ve cuddled under the blankets and finished the day’s crossword puzzle, you’ll realize morning sex is better anyway.That’s all for now, but if you have any etiquette questions on the theme of TRAVELING (or anything else, honestly) or recipe requests, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexExplore Bon AppétitIs It Ever OkayEtiquetteValentines DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Alex Beggs"]}