{"id": "1fcaabb7f410d39c6d25462b0983f996", "url": "https://www.bonappetit.com/story/callaloo-box", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "This Caribbean Grocery Store Eased My Homesickness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Caribbean Grocery Store Eased My HomesicknessCallaloo Box packages the flavors of the islands.By Shanika HillocksSeptember 8, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It’s been nearly six months in quarantine, and admittedly, I didn’t hop on any of the popular shelter-in-place food trends: no sourdough starter or mini scallion farm for me. What this isolation did ignite, though, was homesickness and a desire to reconnect to the pantry sights and smells of my Caribbean upbringing. The spices from my local grocery store just wouldn’t do. I needed the real McCoy, the truest representation of being “back home.” After sharing this sentiment with my cousin, a surprise delivery made its way to my doorstep: the Caribbean Pantry Essentials subscription box from Callaloo Box.This unboxing was better than any reveal from my favorite influencer. Upon opening, I could smell the aromas of spices like ground roasted geera—commonly known as cumin and the perfect base spice for curries, chili, and slow-cooked beans—and mauby bark, which is used to make a bittersweet iced beverage called mauby, hailed for its medicinal benefits and often found in a large pitcher inside my grandparents’ refrigerator. I could see the uniquely pigmented Chief brand curry powder escaping from the plastic packaging, a familiar sight in the kitchens of grandma and aunts. As I happily stocked my pantry, I imagined all the ways I would use these ingredients: the West Indian version of soffritto called green seasoning, great for marinating meat or poultry; Bertie’s pepper sauce (my scrambled eggs’ BFF); refined coconut oil for frying plantains; and coconut milk powder for thickening rice and peas. Swiss macaroni and tomato ketchup were newer items to me, but my cousin assured me both would come in handy for a macaroni pie, the Caribbean’s version of baked mac and cheese. Other items like Shirley tea biscuits and a slew of seasonings for fish, chicken, and cook-up made their way to my cabinet. Now I was ready for some big cooking projects.I queued up soca and reggae on my speakers and prepared shrimp curry and chana dal, an Indo-Caribbean staple in Guyanese households made with split peas, fresh curry leaves, and warming spices like turmeric and cardamom. After finally acquiring the taste for Mauby, I conjured my own rendition, which included a little less cinnamon, a splash more lime juice, and some whiskey. I got back into my cooking ritual—grabbing a large Dutch oven, layering spices, and cooking everything on low heat—and embraced the art of slow-cooking, even in this never-ending pandemic time. With a single inhale of everything going on in my kitchen, I was transported back home.While you can’t buy this particular box, because Callaloo Box’s subscriptions change every month, you can purchase each item on its grocery website. I may not be making my way to islands this year, but my pantry staples tell me otherwise.Photo by Laura MurrayCallaloo Box$40 at Callaloo BoxExplore Bon AppétitHighly RecommendCaribbean/Central AmericanGroceryShoppingRead MorecultureTweezer Tongs Are the Superior TongsBy Sohla El-WayllycultureOmsom Asian Seasonings Have a Whole Lotta Flavor and a Whole Lotta CredBy MacKenzie Chung FegancultureI’m in Love With This Mustard, Partly Because of Its Name, Mostly Because It’s Just So GoodBy Amiel StanekcultureThis Apple Cider Vinegar Has Changed My Salad Game for GoodBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-08", "author": ["Condé Nast", "Shanika Hillocks"]}