{"id": "1fce246e8570df508e1d796c1165d3d7", "url": "https://www.bonappetit.com/story/bon-appetit-foodcast", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Food People: A New Podcast From Bon Appétit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFood People: A New Podcast From Bon AppétitA show made by, for, and about people who love foodBy Bon AppétitAugust 19, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to Food People, a show from Bon Appétit made by, for, and about people who love food. Each week BA’s editorial director, Amanda Shapiro, asks a serious or not-so-serious food question: What’s the best way to grill chicken? Can meal prep be less terrible? Are air fryers worth the hype? In search of answers or at least a spirited debate, she’ll bring in staffers, chefs, writers, and experts from across the culinary universe. Expect strong opinions, tons of recipe inspiration, and more food puns than we'd like to admit.Episodes air every Thursday. Subscribe here, or listen wherever you get your podcasts.The Latest:ContentThis content can also be viewed on the site it originates from.And ICYMI…Check out our six-episode Healthyish series below. ContentThis content can also be viewed on the site it originates from.ContentThis content can also be viewed on the site it originates from.ContentThis content can also be viewed on the site it originates from.ContentThis content can also be viewed on the site it originates from.ContentThis content can also be viewed on the site it originates from.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitPodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Bon Appétit"]}