{"id": "1fd3abb3be659f91f87d7b9e5aeb2b89", "url": "https://www.bonappetit.com/story/amazon-prime-day-deals-2021-day-2-update", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "37 Best Kitchen Deals During Amazon Prime Day 2021 According to Bon Appétit Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Kitchen Deals We’re Snapping Up This Amazon Prime DayVitamixes, Le Creusets, Instant Pots, and all the cold brew you need to keep you shopping these deals, Deals, DEALS.By MacKenzie Chung FeganJune 22, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.It’s Amazon Prime Day, and the deals are hotter than a preheated Lodge cast-iron skillet, which, yes, is on sale. These are the best kitchen deals you’re going to see until Black Friday, so if you’ve been waiting for a mondo sale to purchase that Vitamix or Instant Pot or pellet ice maker from TikTok, now is the time. Thousands of items are discounted, from big-ticket appliance splurges—check ’em all out here—to our favorite pantry items. Grab a mattress while you’re there. Maybe a robot vacuum and a Bahama Breeze Yankee Candle because you, my friend, are worth it. Amazon Prime Day runs until midnight tonight (if you’re not a Prime member, sign up here), and we’ll be updating this post frequently to feature all the currently active best kitchen deals. Check back because those Lightning Deals go faster than Jeff Bezos’s space rocket.Vitamix Immersion BlenderThe Vitamix name we know and trust, but in stick form. With five speed settings and a powerful motor, this immersion blender is what you reach for when you don’t want to futz with pouring hot soup from a heavy Dutch oven into a normal blender.Vitamix Immersion Blender$150 $120 at AmazonWeber Propane GrillIf you’re dreading firing up your rusty, finicky grill for Fourth of July, consider an Amazon Prime Day upgrade. This Weber comes with three burners, two prep tables, and a built-in lid thermometer. Weber Propane Grill$569 at AmazonCalphalon Toaster OvenA good toaster oven can do anything a real oven can. An entire 12-inch pizza can fit tidily inside this particularly even-heating toaster oven, which has convection, broiling, and, of course, toasting capabilities. Save 35% (over $100) this Amazon Prime Day.Calphalon Toaster Oven$350 at AmazonBoos Butcher Block OilJohn Boos Mystery Oil may sound like a health tonic peddled by an itinerant charlatan with a handlebar mustache, but it really isn’t a mystery—if you want to keep your wooden cutting board in tip-top shape, oil it once a month.John Boos Mystery Butcher Block Oil$14 at AmazonCuisinart Food ScraperA bench scraper is a must for portioning biscuits and handling bread dough, but it’s not just for bakers. Use it to transfer diced veggies from the cutting board to the pot or to quickly clean up a counter after you’re done cooking.Cuisinart Food Scraper$18 $12 at AmazonLe Creuset Square Skillet Grill PanNo outdoor space for a grill? The next best thing is this cast-iron grill pan from Le Creuset. Get it rip-roaring hot and toss on steaks, strips of summer squash, and anything else that could benefit from high heat.Le Creuset Grill Pan$170 at AmazonHandheld Vacuum CleanerA hand-vac belongs in your kitchen. Use it to zap up flour after a countertop kneading session, those little bits of onion that go AWOL between the cutting board and the pot, the pile of ground pepper that invariably gathers beneath your grinder. This is another Lightning Deal, so if you want it, grab it now.Holife Handheld Vacuum$62 $50 at AmazonCosori Air FryerDoes it sometimes feel like you’re the only person not air-frying? Just me? There are two main styles of air fryers—ones with baskets that pull out like drawers and ones that are more like multitasking toaster ovens. For basket air fryers, which take up less counter space, BA editors like Cosori.COSORI Air Fryer, 5.8 Quart$119 at AmazonCuisinart Air FryerBut if you’d rather go with a toaster oven–style air fryer, opt for this one from Cuisinart. It can handle a whole chicken.Cuisinart Air Fryer$200 $125 at AmazonCalphalon Espresso MachineThere are plenty of fun, bitsy Amazon Prime Day deals—seven bucks off bike shorts here, $3 off a bag of Red Hots there—but you came for the capital-D deals. Like this Calphalon espresso machine with all the bells and whistles, which is 33% off. You’ll save $200—that’s 40 lattes, not that you will ever need to purchase a latte again.Calphalon Temp IQ Espresso Machine$680 at AmazonBialetti Pasta PotYou may most closely associate Italian brand Bialetti with stovetop moka pots (also on sale), but it makes other cookware as well—like this 5-quart pasta pot, which has a lid that doubles as a strainer. Bialetti Pasta Pot and Strainer$44 at AmazonSpicewalla Spice SetSpicewalla, founded by chef Meherwan Irani, is one of our favorite spice companies, and this 10-pack of Middle Eastern spices is an excellent way to kit out your kitchen. May I recommend it for a recent graduate, someone newly single moving into their own place, or a parent whose spices are all 10 years old?Spicewalla Middle Eastern Spices Set$55 $44 at AmazonZojirushi Rice CookerI’m a Chinese American food writer, and I can tell you with complete honesty that I didn’t know how to cook rice on the stove until last year, when my rice cooker broke. A rice cooker is the ultimate in set-it-and-forget-it convenience, allowing you to turn your attention to mastering khai jiao instead of wondering whether your rice is burning. This 10-cup model from Zojirushi is the official appliance of the test kitchen, and it’s currently 26% off.ZojirushiZojirushi NS-TSC18 Rice Cooker, 10-Cups$235 $174 at AmazonCitrus JuicerHere’s how to get every last drippy drop out of a lemon: Roll fruit on the counter to make it juicy, slice it in half, and mash with this citrus juicer. Citrus Juicer$7 at AmazonStasher BagsJoin the cult of the Stasher bag (One of us! One of us!) and get one step closer to a kitchen free of single-use plastics. Stasher bags are not only reusable, they’re also dishwasher-, freezer-, microwave-, and oven-safe, and they can even replace single-use plastic sous vide bags. Take 30% off over 50 Stasher Bag products this Amazon Prime Day.Photo by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)Instant Pot Did you buy a ton of dried beans last year? Are they still sitting in your pantry? You need an Instant Pot. We love Instant Pots for beans (feast your eyes on these pressure-cooker gigante beans in tomato sauce) as well as stock and rice. At 54% off, don’t sleep on this deal.Instant Pot Duo Plus, 6 Quart$120 $50 at AmazonLodge Dutch OvenYou really do need a Dutch oven, and Lodge makes a great one. Grab one for 40% off and go make soup.Lodge 6-Quart Dutch Oven$115 $80 at Amazon$80 at TargetMandoline Slicer With Protective GlovesGifting someone a mandoline without also throwing in a set of protective gloves is like dating someone when you know you’re emotionally unavailable—someone’s gonna get hurt, and it’s going to be your fault. Don’t be that guy.Mandolin Slicer With Protective Gloves$34 $27 at AmazonKitchen Tongs, Set of 2In the eternal words of Sisqo, sort of, “Tongs tongs tongs tongs tongs.” Save nearly 50% on this 9-inch (test kitchen director Chris Morocco’s preferred tong length) and 12-inch set of silicone-tipped tongs.Silicone and Stainless-Steel Tongs – 2 Pack$17 $9 at AmazonFoodsaverFoodsaver vacuum sealers are great if you shop in bulk and want to make sure 60 chicken thighs don’t develop freezer burn. But they’re also an essential tool if you want to sous vide. Throw our favorite sous vide machine, the Breville Joule, into your cart and you’re ready to go.FoodSaver Vacuum Sealer$154 $125 at Amazon24-Piece Glass Food Storage Container SetWith this 24-piece glass food storage set (now 40% off), you’ll be well on your way to banishing single-use plastics from your kitchen.Bayco 24-Piece Glass Food Storage Containers$50 $37 at AmazonFish SpatulaIn 2017 we boldly asserted that a fish spatula is the only spatula you need, and we stand by it. Delicate enough for lacy pancakes but sturdy enough to flip a burger, a fish spatula is a multipurpose kitchen tool that every home cook needs. Save over 50% this Amazon Prime Day.Stainless-Steel Fish Spatula$9 at AmazonCoravinLiving alone has many benefits—you only have yourself to clean up after, no one eats your fancy yogurt, and pants are entirely optional. But what are you supposed to do if you live alone and want a half-glass of wine? Enter the Coravin, which siphons out a portion of wine through a thin needle that you insert through the cork. Unlike a normal stopper, the Coravin fills that negative space with inert argon gas so the remaining wine doesn’t oxidize.Coravin Wine Opener and Preserver$165 at AmazonFlexible Cutting Mats (Set of 8)Our workhorse cutting board is a Boos block (also on sale), but when you’re handling raw meat, reach for one of these plastic mats. They take up almost no counter or drawer space and can be chucked in the dishwasher for easy sanitization. Plus, they each have a grippy back—so even your butterfingered family member can chop away safely. Flexible Plastic Cutting Board Mats$30 $19 at AmazonReusable Produce BagsYou know how you go to the farmers market and you don’t want to take a single-use plastic bag, so you end up awkwardly juggling six peaches, four ears of corn, a bunch of kale, and a pocketful of fava beans? It doesn’t have to be like that. Grab a set of these washable mesh sacks and you’ll never need a plastic produce bag again.Photo by Chelsie CraigPurifYou Reusable Produce Bags (Set of 9)$15 $10 at AmazonLodge Cast-Iron SkilletAs far as price-to-utility ratio goes, a pre-seasoned $27 Lodge cast-iron skillet is one of the best kitchen deals out there. But an $18 Lodge cast-iron skillet? That is VALUE.Lodge Cast-Iron Skillet$20 at AmazonKitchenAid Pasta Maker Attachment SetTurn your KitchenAid stand mixer into a pasta machine with this three-piece expansion pack. KitchenAid  3-Piece Pasta Maker Attachments$130 at AmazonWire Storage Baskets (Set of 4)If you, like digital editorial director Amanda Shapiro, are a Virgo who loves a good system, stock up on these wire pantry baskets, currently 32% off.Wire Storage Baskets – 4-Pack$46 $37 at AmazonEast: 120 Vegan and Vegetarian Recipes from Bangalore to BeijingMeera Sodha’s East was one of our favorite cookbooks of last year. Take it from senior staff writer Alex Beggs: “The range of recipes, based on Sodha’s travels around the globe, hop from a Sri Lankan cake here to an Indian curry there to a Japanese okonomiyaki over there. There are so many flavors at your fingertips. And the recipes are EASY. Every recipe is weeknight dinner material that happens to be vegetarian.” Check out Sodha’s recipe for Brussels Sprouts Nasi Goreng and grab a copy of her book while it’s on sale for Prime Day.East by Meera Sodha$35 $23 at AmazonHeadlampIf you’re wondering why a headlamp is on a roundup of the best kitchen deals, hear us out—it’s an essential grilling tool. If you’ve ever waved your cell phone flashlight above a hot grill while trying to baste and flip, this deal is for you.BioLite Rechargeable Headlamp$71 at AmazonCashew Milk ConcentrateThis creamy cashew paste is a favorite of BA staffers who never remember to buy enough nut milk. One tub makes 7 quarts of nut milk. Think of all the smoothies! And cappuccinos! And nondairy cookie dunking milk!Joi Cashew Milk Concentrate$22 $16 at AmazonLodge Cast-Iron GriddleBacon. Pancakes. Burgers for 10. If you’re feeding a crowd or just want to casually say, “Oh this? I cooked it à la plancha,” you need a cast-iron griddle. At 50% off, this pre-seasoned number from Lodge is a steal.Lodge Cast-Iron Griddle$60 $30 at AmazonBrave Good Kind Tender Chicken BitesThe notion of chicken jerky weirded me out at first, but Brave Good Kind’s bite-size chicken pieces are now in regular snack drawer rotation. They’re tender, not tough or stringy—think dried apricot texture rather than dried mango—and although they’ve got a craveable savory-sweet thing going on, they aren’t loaded with too much sugar.Brave Good Kind Tender Chicken Bites, 10 Pack$56 at AmazonCoconut & Sambal: Recipes From My Indonesian KitchenThe Indonesian recipes in Bon Appétit contributor Lara Lee’s first cookbook, Coconut & Sambal, pack a punch. Whether you’re after an anchovy-studded green chili sambal or a tangle of pork and prawn rice noodles, you’ll find that every recipe in this book makes one big-flavor, attention-getting sort of dish.Coconut & Sambal$35 $27 at AmazonSpringform Cake PanHas only the lack of a springform pan been holding you back from making a Basque burnt cheesecake? Your time is now.10-Inch Spring Form Cake Pan$16 $13 at AmazonGooseneck KettleFor my pour-over princesses, save on this handsome stainless-steel electric kettle.Stainless-Steel Gooseneck Electric Kettle$60 at AmazonS’well Water BottleIn our very scientific insulated water bottle test (it involved a Thermapen, okay?), the S’well water bottle emerged as the clear winner. It kept hot beverages hotter than any of its competitors, and the temperature of ice water only rose 7°F after a full 24 hours. We tested the 17-ounce version, but the 9-ounce and 25-ounce bottles are also on sale.Photo by Chelsie CraigS'well Stainless-Steel Water Bottle$31 at AmazonGE Profile Opal Nugget Ice MakerIYKYK. Search #nuggetice on TikTok and you’ll see scores of videos made by ardent fans of this obsession-worthy ice machine. (Read all about it here.) Yes, it’s expensive, but today and tomorrow it’s $100 off.GE Profile Opal Nugget Ice Maker$529 $499 at AmazonExplore Bon AppétitAmazon Prime DayShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-13", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}