{"id": "1fef52f40d90b3eeca7e192b200f09f5", "url": "https://www.bonappetit.com/story/stojo-cup", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "Stojo Cups Are the Crocs of Reusable Coffee Cups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingStojos Are the Crocs of Reusable Coffee CupsThey’re collapsible, sturdy—and, honestly, cute.By Victoria CavazosNovember 4, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Every morning, my husband and I would wake up at 5:30 a.m, frantically pull on our steel-toed boots, blouse our trousers, and rush about the apartment in near darkness, gathering last-minute provisions before our commute to the naval base where we work. Ryan would fill his mug of coffee to the very brim and he’d charge, helter-skelter, down the steps of our apartment, sloshing dark liquid onto the stairway carpeting.More liquid would splash on our drive to base. I’d admonish him: Get a travel mug. He’d retort: Unnecessary. A waste of $30. We recycled this exchange over and over until we couldn’t bear the amount of coffee on the floor of our Ford. One last petty squabble over spilled coffee convinced him to leave Nordstrom Rack one day with a solution: a 12-ounce, synlawn-green, collapsible Stojo cup.Stojo Coffee Cup$15 at Amazon$15 at StojoI was impressed. Unlike my stainless-steel thermos, the cup easily collapsed into a round disk small enough to fit in the pockets of our Navy Working Uniforms. This feature alone convinced me to buy myself one too. On especially busy days, we could crush our coffee and then, literally, crush the food-grade silicone cup for stowage—a useful feature on ships, where there is never enough space. In my husband’s opinion, even useful enough to justify the already reasonable price of $15.The Stojo cup is not new. The company was founded in New York in 2014 by a group of dads who wanted a sustainable future for their children. (In addition to its being reusable, it’s free of BPA, BPSs, phthalates, lead, and adhesives.) But since we’ve started using our Stojos, I’ve seen them pop up frequently on the Instagrams of planet-saving, remote-working, cropped-cardigan-wearing 20-somethings who match their nail polish to the cups’ muted colorways. Even though we hadn’t bought our Stojos to make fashion statements, I suddenly felt on-trend carrying around my baby blue collapsible cup. The rise of the Stojo is a little like that of the Croc: Both formerly basic, unremarkable dad products that are now staples of every hip cabinet and closet. Trending or not, we love our Stojos and we’ll be using them for years to come. I’m sure our Ford (and the planet) will thank us.Now fill that Stojo up:Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-04", "author": ["Condé Nast", "Victoria Cavazos"]}