{"id": "200a74d278ad75114865f4244ce188af", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/admiralgade-26", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Admiralgade 26 Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenAdmiralgade 26Make yourself at home, if home’s got smoked duck hearts, at this styled-out Indre By spotFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for delicious, not-trying-too-hard food in an extremely chic dining room that’s unlike anywhere you’ve been. Co-owner Christian Nedergaard first won over Copenhagen with Ved Stranden 10 around the corner, a natural wine bar that happens to be one of the planet’s cooler spots to drink.ORDER THE: squid with poached egg and harissa; Iberian pork with kimchi; and smoked duck hearts with pickled rhubarb, if you see these dishes on the constantly changing menu. The wine list? Smart. Funny! Broken into “uses,” there are bottles for everything, from conversational use to indulgence. Saturdays, starting at 11:30 a.m., there's an exquisite Japanese breakfast.THE VIBE IS: Apartamento magazine meets World of Interiors. The restaurant looks and feels like a wealthy Dane’s living room from the ‘70s, possibly ‘80s. Nedergaard creates new groupings of tables, chairs, and even floor lamps—you will appreciate this if you are over 42, trust us—whenever he feels like it. Other details, like original Jean Prouvé sconces in the kitchen, will have design geeks clutching their hearts. Stylish local couples and foursomes of all walks of creative life treat this as their second dining room.PRACTICAL STUFF: Open Monday to Saturday, from 11:30 a.m. to midnight. Closed Sunday. Many places are closed on Mondays, but every second Monday is movie night here, complete with a set menu inspired by whichever film is screened.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVECafé Atelier SeptemberThe breezy Indre By café that’s turned avocado toast into an art formVed Stranden 10Get lost in natural wines at this living room-esque Indre By barRestaurant PalægadeHead to Indre By to eat all the open-face sandwiches (and herring)Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}