{"id": "200d1eb0bfe2c5b0a0c2df3d6b0160ab", "url": "https://www.bonappetit.com/story/escali-scale", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "The Best Kitchen Scales (2021) and 10 Ways You’ll Use Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Kitchen Scales and Why You Need One, Even If You Never Bake a Thing10 ways you’ll use it around the kitchen in casual encounters, not just special occasions.By Alex BeggsNovember 6, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I never believed I needed to own the best kitchen scale—or any kitchen scale for that matter. I’m a pro at getting by with what I already have, which is why I wrapped your birthday present in paper grocery bags. I rewash resealable plastic bags and hang them to dry! I tear paper towels in half! I’m cheap as hell. Why would I want to fill my house with unnecessary kitchen tools?But all that changed when I decided to try my hand at bread baking, which calls for the utmost precision. Apparently, you need to measure with extreme accuracy to achieve perfect dough hydration yada yada yada. After intense deliberation with my bread guidance counselor Claire Saffitz, I ordered the test kitchen’s favorite digital food scale, made by Escali.Escali Primo Digital Scale$25 at Amazon$22 at TargetWhy is the Escali our top pick for home cooks?BA test kitchen director Chris Morocco loves the Escali scale for a few reasons: “It comes in a ton of fun colors; it’s virtually indestructible; and it’s under $25.\" That's music to my cheap-as-hell ears. Made of molded plastic, it features just two buttons for ease of use—a power/tare button that fires the thing up and resets the scale back to zero when needed, and another button to switch between units of measurement (pounds, grams, and ounces). The Escali is compact, lightweight, and has a maximum capacity of 11 pounds and a four-minute auto-shut off function to save battery (it runs on two AA’s).But do I really neeeeed a kitchen scale?My Escali kitchen scale arrived the next day, but as it turns out, bread-baking mastery is not something I can buy on Amazon Prime. But while I work on becoming a Loaf Queen, I’ve discovered a ton of other uses for my trusty kitchen scale. If you think you don’t need one because you don’t cook that much, will definitely never bake bread, or only make pancakes once a month, stay with me. You want this little electronic wonder in your life (and it is, of course, a great gift for bakers), and here are all the glorious ways you can put it to use.Stop guesstimating, start measuring.\nPhoto by Chelsie CraigCoffee, but not in a snobby wayI am not a coffee snob. I don’t kiss each individual bean before I toss it in the grinder; I dump beans into a filter in a DRIP MACHINE DEAL WITH IT and press go. But it turns out, by not measuring my beans with a kitchen scale, I’ve been depriving myself of maximum caffeine because, depending on the grind of the coffee (coarse coffee pebbles vs. fine coffee dust), you might be off by, like, 80 grams. I don’t like the idea of not getting the amount of caffeine I deserve. Whether you're using whole beans or preground, measuring out the coffee in ounces or grams on your shiny new scale guarantees that you make a perfect cup. (Unless you’re using crappy beans. Even the best kitchen scale can’t help you there.)Meat/meatballs/burgersYou like meat? You ever notice how recipes will ask for a pound, or 11 ounces, or these specific numbers that don’t match the numbers on the package you got at the grocery store? Usually I assume I’m a half pound off and then blame the recipe when dinner sucks. With my food kitchen scale, I have no excuse! Actually measuring my meat means that my burger patties are perfectly uniform, so no one at the cookout can grumble about getting the runt of the litter. I make meatballs so consistent I could balance my checkbook on them. I even, on occasion, eat a doctor-recommended serving size of meat instead of an amount that induces meat sweats!Sweet potatoes and other lumpy thingsRecipes always call for produce in pounds, but I absolutely never use the analog bucket scales in the grocery store produce department. Those things are not designed for short people. It’s humiliating. Instead, I buy too many sweet potatoes, go home, and hold my cat in one hand and the potatoes in the other until I’ve decided I’m not measuring anything tonight. When the kitchen scale came into my life, I did measure my cat on it—he’s 4084.74 grams–but now I can also easily measure potatoes and other lumpy produce items that come in annoyingly random sizes.Weirdly sized cansI have a stash of 15.5-oz. cans of chickpeas stacked in my pantry because when things go on sale—$5 for 5 cans!!!—I’ll buy 11 of them. But have you seen the 13.4-ounce boxes of beans? That’s a confusing number! Whenever a recipe calls for a Very Specific amount of chickpeas or beans, I want to make do with whatever bizzaro unit of legume I already have in the house, and my kitchen scale is here for this. It turns out measurements in recipes are specific for a reason, so follow them.PastaOnce someone told me a dirty-joke way of measuring spaghetti, but I’ll tell you that outside of school hours. Did you know a portion of pasta is 100 grams? Well it is. Measure that shit!Now you know.\nPhoto by Chelsie CraigLegit bakingHave you ever found an incredible-sounding recipe and all of the precise measurements were metric so you moved to France and stopped answering all non-essential emails? With a kitchen scale, what was once an annoying math equation is now a better scone or biscuit or almond cake. For me, this mostly applies to pancakes. Make Smitten Kitchen’s fluffiest pancakes by measuring in grams and you’ll thank me later.Nuts and dates and chopped thingsSometimes a recipe calls for things like chopped dates, chocolate, shredded cheese, peanuts, and other irregularly-shaped things in both fractions of a cup and gram measurements, and you’ll get a more accurate amount if you weigh them instead of smashing all of the dates into a measuring cup, where there might be pockets of air. You might be able to squeeze 30 cashews into a cup one afternoon, but only 20 the next because of their crazy comma shapes. Don’t you want accuracy in your life? Don’t you want ORDER?Just sayin’: weed butters and oils and bakingThis is a scenario when accuracy matters. There are consequences beyond getting a little too much chocolate in a cookie. To control the dosage of THC in your Special Brownies, you MUST weigh the important ingredients out. Period.T.H.GheeView RecipeRise and brineBrad “It’s Alive” Leone weighs everything he’s fermenting because it’s science, which is why I wear goggles around Brad. But even if you’re not doing elaborate kimchi projects, all salt brines—like for that Thanksgiving turkey!—are a lot easier to scale by measuring the salt by weight and water in liquid volume. Percentages! Science!For when you don’t want to wash 1,000 dishesSpeaking of those pancakes—and any cooking where you mix a ton of stuff in a bowl—the kitchen scale saves you from the stack of 14 different dirty measuring cups and spoons. Once you toss the flour in the bowl on the scale, use the tare function (i.e. reset it to zero) and keep adding ingredients. Measure, zero out. Measure, zero out. I thought it wouldn’t detect an angel’s eyelash of baking soda, but it did! Technology is amazing.Just because the Escali is the scale for me doesn't mean it’s the scale for you.If you want to spend a little bit more than $25, go for the Oxo Good Grips Scale, which takes four AAA batteries and comes with a backlit display. Like the Escali, it also has an 11-pound weight limit, but the square stainless-steel platform is bigger than the Escali’s plastic round one—easier for weighing ears of corn and apples directly on the surface. It also comes with a pull-out display that allows you to see measurements regardless of how big your container is, which can be an issue with the Escali if you're using a huge mixing bowl.OXO Good Grips Food Scale$52 at Amazon$52 at Bed Bath & BeyondAn 11-pound capacity is going to be plenty for most bakers, but if you’re making big batches of bread, consider the My Weigh Bakers Scale, which has a hefty 17-pound capacity, a backlit LCD display, and provides accurate measurements in pounds, grams, ounces, and kilograms. Avid breadheads will really appreciate its high degree of precision and ability to weigh in baker’s percentages, which indicates each ingredient’s proportion to the amount of flour. (If you know, you know.) The ability to measure by increments and ratios makes it easy to scale recipes up or down so that your breads, cakes, and muffins come out perfect every time. The My Weigh also features a removable stainless-steel weighing platform as well as covers to protect the LCD screen and buttons for easy clean up.My Weigh KD-8000 Kitchen Scale$48 at Amazon$59 at WalmartSleek, minimalist, and equipped with a discreet digital display, the Zwilling Enfinigy Scale has a 22-pound weight capacity and looks like a gadget designed by Apple. Unlike most other stainless-steel food scales, the Zwilling Enfinigy has a large, shiny glass surface that is super easy to wipe clean—no nooks or crannies to trap flour or coffee grounds. Plus, it features a built-in rechargeable battery, so you never have to worry about running out to the store for a replacement in the middle of a project. Both black and white colorways are attractive enough to leave on your countertop full-time.Zwilling Enfinigy Digital Food Scale$65 $50 at Amazon$50 at ZwillingLoaf Queen: This article was originally published in 2018 and was updated by Tiffany Hopkins in 2021.Explore Bon AppétitShoppingToolsBA RecommendsStaff PicksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Alex Beggs"]}