{"id": "2019f0e8f8d88414a4ea15bc1e9536ed", "url": "https://www.bonappetit.com/recipe/fennel-potlikker", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Fennel Potlikker Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueFennel PotlikkerBy Carla HallFebruary 8, 20223.7(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintPotlikker (or “pot liquor”) is the brothy, nutrient-dense liquid gold traditionally left behind after boiling greens and beans. An ingredient whose use sheds light on the complex racialized history of Southern cooking, potlikker was once valued only by diligent enslaved Africans who saved the nourishing broth for their families after cooking greens. Chef Carla Hall, for whom potlikker was an essential element of her childhood, switches up the order, making potlikker from scratch to use as an ultra-concentrated broth—for Hall, that’s often the first step in imbuing a dish with layers of powerful flavor. In this herbaceous version, Hall doubles down on the fennel’s licorice notes by adding a glug of Pernod, an anise-based liqueur that’s a natural pairing with seafood and vegetables.Use this potlikker as a base for Hall’s Shrimp and Grits With Fennel Potlikker, her Lemony Spring Vegetable and Barley Bowl, or any dish that would benefit from an intensely aromatic broth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonLadle$8 At AmazonMesh Sieve$13 At AmazonHeatproof Measuring Cup$18 At AmazonIngredientsMakes about 3 cups3Tbsp. extra-virgin olive oil1large onion, chopped1large fennel bulb, cut into 8 wedges1celery stalk, chopped1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2Tbsp. Pernod¼tsp. crushed red pepper flakesPreparationHeat oil in a large pot over medium. Add onion, fennel, celery, and salt; cook, stirring often, until vegetables are translucent, about 4 minutes. Add Pernod and red pepper flakes; cook, stirring, until Pernod is evaporated, about 1 minute. Pour in 5 cups water and bring to a simmer. Reduce heat to medium-low and cook 45 minutes. Strain through a fine-mesh sieve into a medium heatproof bowl; discard solids.Do Ahead: Potlikker can be made 5 days ahead. Let cool. Transfer to an airtight container and chill, or freeze up to 3 months.How would you rate Fennel Potlikker?Leave a ReviewTell us what you thinkReviews (7)Back to TopTrianglePerfect recipe! Terrible website and app but wonderful recipe. Trying to leave five starts but website won’t let me, for instance….Anonymous3/4/2022This is an amazing base recipe with so much flavor!  I made both the shrimp and grits and the asparagus barley recipe, and they were excellent.  I will use this potlikker often as a building block to add flavor to lots of recipes.  Thanks, Carla!  And I agree with others that the bad reviews aimed at the website are in poor taste and misleading about the awesomeness of this recipe.ShannonMadison, VA3/1/2022I had no Pernod so I addede a few fennel seeds to make up for that. The broth is insanely aromatic! I used it to make brothy bean stew and added a bit of lemoni omani. Great combination!\n\nThe BA series about potlikker has also inspired me to collect my veggie water for a week and experiment with it. Leek potlikker and fennel potlikker are my favourite so far. Gertrude Europe2/27/2022This is an amazing base for the grits in Shrimp and Grits with Fennel Potlikker.  Altha2/27/2022Full disclosure, haven't tried this recipe. But I saw the other two reviews rated this dish poorly based on the quality of BA's website, not on the dish itself. I thought that was in poor taste, so I'm rating this recipe five stars in advance and trying it as soon as I can get the ingredients. Friends, don't rate a chef's recipe poorly because you don't agree with the way the website is run. AnonymousBrooklyn, NY2/26/2022This website is awful. Signed up for full access and can’t save recipes and constantly having to log back in. AnonymousBoston MA2/26/2022Your website sucks.  I subscribed to the site when I saw a dish I would like to try the Fennel Potlikker.  However the recipe disappears almost immediately and is replace by an ad   Lee BuzalekLandenberg PA2/20/2022Explore Bon AppétitDinnerVegetarianVeganNut-FreeDairy-FreeGluten-FreeStockFennelVegetableSouthernAmericanSoul FoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}