{"id": "2035c6c057ae93fb107c034e36a93855", "url": "https://www.bonappetit.com/story/everything-you-need-to-know-about-corn", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "What You Need to Know to Make the Most of Summer Corn Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat You Need to Know to Make the Most of Corn SeasonIt's the most wonderful time of the year.By Sarah JampelJuly 11, 2019FacebookTwitterEmailFacebookTwitterEmailSweet, juicy summer corn is here and I am here for it. But seriously: The prospect of a tall pile of corn was the only thing that got me out of my air-conditioned bedroom and to the sticky, humid farmers market this past weekend. (Well, that and the deeply ingrained belief that it was my civic duty to stand by and correct any fellow shopper who insisted on peeling back the corn husks before they purchased, thereby ruining it for the rest of us. JK, JK. I would never!)But before you go planning for corn salads and soups and crisps, you'll want to know how to pick it, how to store it, and how to make it taste good even if you made a not-so-good choice. Read on for the answers.What should I look for when I’m selecting my cobs?First, know that the fresh, local corn is sweetest (and bicolor, white, and yellow are equally good—the color isn’t an indicator). Since peeling back the layers will dry out the corn for other shoppers (as I've mentioned before, this is an etiquette no-no!), look for full, heavy ears with gapless rows of fat kernels and tight, green husks, and glossy silk.And once I have it, how should I store it?Sadly, corn starts to lose its sweetness as soon as it’s picked (which is why local is best). Happily, that’s all the more reason to eat it fast (ideally, the same day you buy it). Keep unhusked ears in a plastic bag in the fridge and use within three days. If you’re ambitious, blanch the cobs in boiling water, then cut off the kernels and store them in bags in the freezer for up to one year. You'll have corn muffins in December—whatta world!How can I cut off the kernels without losing a finger?No, you don't need to prop the corn on a bundt pant or in a small bowl stacked in a big bowl or buy a special kernel-stripping device. Simply lay a shucked ear on your cutting board, then use a sharp knife to zip off a strip of kernels, creating a flat side. Roll the cob onto that flat side and continue to slice off kernels until you’ve gone all the way around. That’s it!Get ready to eat corn salsa all summer long.\nPhoto by Caleb AdamsCan I do anything with those spent cobs?After you’ve stripped the cobs and used the kernels for salad or pasta or salsa, scrape the bare cobs with the dull side of a knife, pressing the “milk” into a large pot. Add the cobs and a handful of aromatics (like herbs and black peppercorns), cover with cold water, and bring to a boil. Reduce heat and simmer until sweet and golden, about 1 hour. Use in place of veg broth in risotto, chowder, or polenta.Should I boil or grill?For the purest, sweetest corny-corn, you’ll want to boil. Cook market-fresh ears in a large pot of boiling water for 1-3 minutes. Grocery store cobs, which are likely older, are less sweet and tender and will take a few minutes longer: figure 5-8 minutes.For charred, still-juicy smokiness, go for the grill. Place ears in their husks (no need to soak!) over a grill prepared for medium-high heat. Cook, turning occasionally, until the outsides are evenly charred, 16-20 minutes. If you want more color on the kernels themselves, loosen the husks slightly before grilling.Your future elote.\nAnd now that you have grilled corn, you're legally obligated to make elote!To make this iconic Mexican street snack, brush an ear  of hot-off-the-grill corn  with 2 tsp. mayonnaise. Sprinkle with 1 Tbsp. crumbled Cotija cheese, a pinch of chili powder, and a pinch of cayenne pepper. Squeeze 1 lime wedge over and devour.Harissa-mint butter will make your corn siiiiiing!\nPhoto by Chelsie Craig, Food Styling by Frances BoswellWhat can I slather on corn that’s not just plain butter?Don’t get us wrong: Corn on the cob slathered in butter is one of summer’s great joys. But for something a bit fancier, season 1 stick softened unsalted butter with kosher salt, the mix in…6 Tbsp. harissa paste + ½ cup finely chopped mint3 oz. Parmesan, coarsely grated + ½ tsp. freshly ground black pepper½ cup finely chopped tender herbs + ½ tsp. finely grated lemon zest2 Tbsp. miso + 1 Tbsp. toasted sesame seedsTransfer leftovers to an airtight container and store in the fridge for up to 1 week (or freeze for up to 2 months).Okay, but what do I do if my corn is quite...elderly?If you suspect your corn is past its prime, add ¼ cup sugar for every 4 quarts of water when you’re boiling. No one has to know that not all of the sweetness is au natural. (If your corn still needs a little help, check out even more ideas for how to help a blah brother out.)There's only one thing left to do:One-Skillet Corn ChilaquilesThis recipe makes just enough salsa verde to coat one bag of chips, but it's so tasty and versatile that we always make a double batch. If you can, choose a heftier chip that will hold up when stirred into the sauce.View RecipeExplore Bon AppétitCornSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Sarah Jampel"]}