{"id": "203f07952ea2498417e98187c401857b", "url": "https://www.bonappetit.com/story/tomato-galette", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "How Interesting That This Tomato Galette Could Serve 8...or 1 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Interesting That This Tomato Galette Could Serve 8...or 1Personal pan galette or cocktail party appetizer—YOU DECIDE.By Alex BeggsJuly 16, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailYou know how you’re biologically wired to salivate like a dripping air conditioner when you smell the combination of baking dough, cheese, garlic, and tomato?That would be pizza. But swap the yeasty pizza dough with buttery pie dough, use a hard and salty cheese instead of milky mozz, slices of peak-season tomatoes instead of sauce, and you’ll have something just as mouthwatering and beautifully caloric. This tomato galette. Recipe by Andy Baraghani.I made it for lunch on a 90 degree summer afternoon recently—a personal pan galette!—and I can’t wait to make it again and again for actual humans the rest of the summer. My plan is to slice it into dainty wedges to serve with lakeside martinis (can you imagine?!). These layers don’t lie: flaky pie crust, shredded cheddar or gouda, sliced and drained tomatoes (more on that in a sec), thin coins of fresh garlic, a shower of chives, and a sprinkle of lemon zest. It’s from our simple issue, so the rules must apply. And it was simple, I swear.It can come together fast if you follow these tips:Make pie dough ahead, even if it’s just one day. And freeze it. I make double batches of pie crust so that Future Me can make impulse pies/galettes. (You can imagine what else Future Me has in store—so much backup Charmin Ultra Strong.)Salt ya tomatoes. Slice and salt your tomatoes so you can drain the liquid off them before building the galette. Those few tablespoons of tomato goo will otherwise soak into the dough and cause the dreaded soggy-bottom boy.Use scissors to cut the chives right on top of the finished galette. Why was I ever cutting chives with a knife before?But don’t rush beauty. It has to bake for an hour. And, huh, wow, that’s just enough time to mix up another batch of Future Dough...Get the recipe:Tomato GaletteA savory galette topped with peak season tomatoes, cheese, and garlic.View RecipeExplore Bon AppétitTomatoGaletteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Alex Beggs"]}