{"id": "204980508c7aa2b0076b34bcf2fed7a4", "url": "https://www.bonappetit.com/recipe/french-onion-beef-noodle-soup", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "French Onion Beef Noodle Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrench Onion Beef Noodle SoupBy Amiel StanekMarch 5, 20204.5(163)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThis super-savory dish draws its inspiration from Taiwanese beef noodle soup, then gilds the lily with a Dutch oven’s worth of sweet, slow-simmered onions—the best part of French onion soup, if you ask this recipe’s developer, Amiel Stanek. It takes some doing, but the effort is worth it. If you’re not planning on serving a crowd, the leftover soup base freezes beautifully, meaning you can have a big-flavor weeknight dinner in your back pocket.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSun Ramen Noodles$6 At AmazonMesh Sieve$13 At AmazonTongs$13 At AmazonIngredients6-8 Servings2Tbsp. vegetable oil3lb. English-style bone-in beef short ribs, cut into 2\" segmentsKosher salt6scallions, white and dark green parts separated8garlic cloves14\" piece ginger, scrubbed, thinly sliced6star anise pods23\" cinnamon sticks8whole cloves2tsp. black peppercorns2tsp. coriander seeds1cup dry white wine½cup (or more) low-sodium soy sauce3Tbsp. unsalted butter5lb. onions (about 10 medium), thinly sliced2Tbsp. (or more) unseasoned rice vinegar30oz. fresh or 18 oz. dried ramen noodlesPreparationStep 1Heat oil in a large Dutch oven or other heavy pot over medium-high. Season short ribs with salt and, working in batches, cook, turning occasionally, until well browned on all sides, 12–14 minutes. Transfer to a platter as you go. Carefully pour off fat left behind in pot until there is just enough to cover bottom of pot; discard.Step 2Return pot to medium heat. Cook whole white scallion parts, garlic, and ginger, stirring occasionally, until they are starting to brown, about 4 minutes. Add star anise, cinnamon, cloves, peppercorns, and coriander seeds and cook, stirring often, until fragrant and oil is sizzling, about 1 minute. Add wine, scraping up any browned bits from bottom of pot with a wooden spoon. Simmer until almost completely evaporated, about 3 minutes. Return beef to pot and add soy sauce and 12 cups water. Bring to a boil, then reduce heat and cover partially with a lid. Simmer until meat is not quite falling off the bone, about 1½ hours.Step 3Meanwhile, heat butter in another large pot or Dutch oven over medium-high until foaming subsides. Add onions, season with salt, and cook, stirring often, until they begin to take on some color, about 15 minutes. (If they don’t fit in your pot, add as much as you can, cover, and steam 5 minutes. Stir in remaining onions and continue cooking.) Reduce heat to medium-low and cook, stirring occasionally, until onions are deep golden and softened but not mushy, 30–45 minutes.Step 4Using tongs, remove beef from broth and let cool until you can handle. Tear meat into bite-size pieces, discarding any bone and excess fat as you go. Strain broth through a fine-mesh sieve into a large bowl; discard solids.Step 5Add meat and broth to pot with onions. Bring to a boil, reduce heat to low, and simmer until liquid is reduced a bit and flavors have melded, about 30 minutes. Add vinegar; taste and add more vinegar and/or soy sauce if needed.Step 6Thinly slice remaining scallion greens. Cook noodles according to package directions. Divide among bowls. Ladle soup over noodles, making sure each bowl gets some meat and plenty of onions. Top with scallion greens and serve.How would you rate French Onion Beef Noodle Soup?Leave a ReviewTell us what you thinkReviews (92)Back to TopTriangleWooo, this dish took work, money, and time. It was worth all of it! I made the broth the night before and stuck it in the fridge overnight. It really helped with getting the extra fat out and letting the flavors deepen. I simmered it a bit with the meat while the onions were cooking and then had them all sitting in the pot together for about 40 minutes. It was so delicious! This makes quite a bit of soup and fed five adults with lots of leftovers. \n Delightfully challenging and delicious Portland, OR3/14/2022Not my favorite. Followed the recipe to a T and came with an overpowering taste of cinnamon flavored broth with a hint of licorice. Despite cooking with beef it did not give the beef broth flavor. I may substitute beef broth for some of the water in the future. I’ll eat what I have but it definitely needs more beef flavor than what it calls for. Anonymous3/7/2022I’ve made this soup twice, and love it. I’ve cut down the amount of onions, and added more liquid. The short ribs really commingle with the Asian spices well. I’ve used fresh udon noodles which I love. The only draw back, these days, is the high price of short ribs. I’m going to experiment with other cheaper beef cuts  to see if they’ll work as well.PeterBellingham, Wa2/24/2022This is a wonderful, flavourful dish.  I recommend making it over two days. Do the ribs and broth. Then let it si on fridge overnight. The flavours develop more and you can also de-fat the dish.\n\nNext day caramelize the onions, and to broth and beef as it reheats. Let them simmer together while you prepare the noodles.\n\nSo very good!BettyBritish Columbia2/24/2022There aren’t a lot of foods that my husband does not like. In fact our children refer to him as ”the disposal” This was a huge, HUGE, nope. It was right up there with the”Too Busy to Cook”(a cookbook)  Turkey, tomatoes, lemon and cinnamon over pasta. That almost 40 years ago. I guess a one off every 40 years is OK. And yes, I am a really good cook and know my way around the kitchen. Followed the directions exactly except I halved everything because it’s just the two of us now. Even then, it’s a lot of soup! oh well.  CrytstalBeachHrammyFL2/18/2022Fabulous combination of French Onion with Beef short rib - Chinese style.  One of the best soups I have made and enjoyed by many people.  Does need the 2 day to get rid of the fat but all the ingredients work very well. Making another batch now & recommended as a surprise to Guests.Mike DeeMaidenhead, UK1/16/2022Fantastic recipe. Making it over two days is a great tip, as is reducing the water to about 10 cups. For the love of god don’t use beef broth, you’re literally making broth with beef short ribs. The only funny thing about this recipe is that 5 lbs of onions will take on color in “about 15 minutes”. Kevin 1/15/2022Followed the recipe exactly.  The broth was excellent.  Wonderful flavor.  Will make it again soon….   The blend of spices was perfect.  BobberQueenBrookfield, WI1/15/2022Not worth the time it took to make and there are better ways to cook short ribs. Really disappointed, won't be making it again.KCMArlington, VA1/12/2022Winner!\nI made this last night and we were both extremely pleased. I followed the recipe to the letter. In the end, after I combined all the ingredients and let it simmer for 10-15 minutes, I added extra a couple extra Dashes of soy sauce. I felt the broth was too rich and overpowered the flavor of the beef. \nWord to the wise, this recipe requires generous amounts of time and attention, and it’s worth it!\nNext time, I intend to add a couple of pierced jalapeños to the broth!\nWhat would the substitution of a dry red for the dry white wine do to the overall body and depth of flavor?Frank3RPasadena, CA1/11/2022Wow!!! A keeper in our repertoire. I divided this recipe in half and was surprised at the intensity of  flavors using only 3 short ribs, 2 star anise pods, 2 cinnamon sticks and 6 cloves (they’d been on hand for ages). I followed the recipe for all ingredients but after scrolling through other reviews did add 1 T sambal oleo make this over 2 days to allow the stock to cool and skim much of the fat. We did also add extra  grilled sliced beef (rib eye and sirloin) and cilantro, jalapeño, sprouts and other Pho toppings. Used udon noodles because that’s what we had but ramen would have worked better. Froze the leftovers for another a cold winter weeknight. My husband raved about this recipe to neighbors…. He’s NEVER done that! MsLizzPhiladelphia PA1/7/2022I really enjoyed this dish! I used 3 quarts of beef stock, instead of water, and cut the soy sauce in half. Next time will replace the rice vinegar with 2 Tbsp Sambal. It needs a kick. Amazing for a cold night. Warms you to your bones. Logan S.Denver, CO1/4/2022This recipe is the first beef dish I've eaten in over 20 years and it was magnificent..!!!  Because of dietary issues I had to adjust some of the ingredients and also not having every item on hand was another adjustment I had to make. My family enjoyed the dish as well, so I'm  guessing we will try this one again..!!!R. JACKSONSPRINGFIELD, VA1/4/2022I love these recipes, but would love if gluten-free options were mentioned as an alternative.   SandraVermont 1/2/2022This was so so good, so easy, and maybe even better served pho-style with appropriate accoutrements which largely negates the need for the labor intensive caramelized onions. Best broth ever.AnonymousPhiladelphia, PA1/2/2022Explore Bon AppétitSoupSoups and StewsTaiwaneseEast AsianAsianShort RibBeefMeatOnionVegetableRamen NoodleNoodlePasta & NoodlesMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-02", "author": ["Condé Nast", "Amiel Stanek"]}