{"id": "20520168e4c1007732e314594082104c", "url": "https://www.bonappetit.com/recipe/baking-sheet-bacon", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Bacon in the Oven  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueBacon in the OvenBy Rick MartinezFebruary 13, 20185.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintNot only does this oven method recipe free you from needing to constantly tend the bacon while it cooks, but it also produces superior results. Other pros: no bacon grease splatter all over your stovetop, no flipping (so you won't scald your forearms with oil), and always-crisp-but-never-burnt-bacon. Use this bacon to make the ultimate BLT.Ingredients8 servings 2lb. thick-cut bacon (about 16 slices)PreparationPlace racks in upper and lower thirds of oven; preheat to 400°. Divide bacon between 2 wire racks set inside large foil-lined rimmed baking sheets. Bake, rotating baking sheets front to back and top to bottom halfway through, until brown and crisp, 35–50 minutes (depending on the thickness). Transfer to paper towels to drain.How would you rate Bacon in the Oven ?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleLove making bacon this way. However, I prefer the rack. The bacon does not sit in any grease.Sarah JayOrlando, FL1/3/2022I always cook my bacon this way. You definitely don't need the oven rack though. Just line your baking sheet with foil and it'll be fine. I like to check it after 20 minutes though and monitor it every 5 minutes after that to make sure it doesn't burn. Drain off the fat after cooking so you can make Rick's bacon fat tortillas later. Love you Rick!lifeis_shortLos Angeles, CA5/30/2020Really good recipe. Put parchment paper on the baking sheet for a really easy clean-up.Jackson S5/24/2020I do recommend this method! Good luck cleaning the cooling rack off afterward though. EagleM16Denver, CO10/14/2019Explore Bon AppétitBaconCured MeatMeatEasyDairy-FreeNut-FreeGluten-FreeKetoBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Rick Martinez"]}