{"id": "2059d42a7655983338dcab493da8be65", "url": "https://www.bonappetit.com/story/the-best-knife-sharpener", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "The Best Knife Sharpener Is a Whetstone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Knife Sharpener Is a WhetstoneThe nicest thing you can do for your knife is sharpen it.By Sarah Jampel and Tiffany HopkinsMarch 11, 2022FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Knife sharpening is a capital-C Chore, but once you’re wielding a knife that cuts through tomatoes and onions like butter, you’ll know the task was WORTH IT. A lot of tools can bring dull blades back to life, but professional chefs and experts agree that the best knife sharpener is a whetstone. That’s because every time you sharpen a knife, you remove metal from its edge, wearing away at your precious blade. Depending on the tool you use, it can be easy to take off too much. A whetstone offers the most gentle, gradual solution and gives you the most control. Plus, it’ll work on almost any kind of kitchen knife and different types of cutlery, including chef’s knives, paring knives, cleavers, and pocket knives.While you can pay a professional to sharpen knives for you, they are likely to remove more from the cutting edge than you would at home (like a haircut versus a trim). Sending your knives away too often can actually decrease their lifespan, so if you want to get them professionally sharpened, do it once a year max. And, in the meantime, check out our favorite tools for sharpening (and honing) knives.Okay, but what is a whetstone and why is it the best knife sharpener?A whetstone, a.k.a knife sharpening stone, is a rectangular stone block that sharpens a knife’s blade as it is pulled across the stone’s surface. Whetstones come in two forms: Natural and synthetic. Synthetic whetstones are typically made of silicon carbide or aluminum oxide as opposed to real stone, or they may be coated with a fine layer of diamond particles. Synthetic stones are manufactured to have consistent density and grit size, which makes them more efficient and easier to use. You’ll find that many have two sides—one with coarse grit and one with fine grit—like this one from Japanese knife maker Mitsumoto Sakari. If you prefer natural, test kitchen director Chris Morocco likes this Zwilling J.A. Henckels sharpening stone because unlike some waterstones which need to be submerged prior to use, it just requires a splash of water.Using a whetstone gives you control over the angle of the blade and the pressure that’s placed on the blade—something that isn’t true with manual pull-through and electric knife sharpeners. You also won’t find a sharpener that works on as many types of knives.Mitsumoto Sakari Japanese Knife Sharpening Stone$40 at AmazonZwilling 250/1000 Combination Japanese Water Stone$113 $90 at Zwilling$113 $90 at Sur La TableGot it. Now how do I use it?To use a whetstone, soak the stone if the directions call for it and place it on top of a nonslip surface, coarse-side up if it’s double-sided. Place your knife on the end of the stone (facing away from you) and drag it toward the other end of the stone at about a 15- to 20-degree angle gently across its surface. Repeat this process for both sides of the blade until enough metal is removed and you notice a burr, or slight raise of metal. At this point, your knife will be sharp and you can turn the whetstone fine-side up and run your blade over it for touch-ups to smooth and polish the edges—this will remove the burr. If you’re not confident that you can nail the angle yourself, some companies sell sharpening guide rails to ensure you get it right. Yes, the sharpening process with a whetstone takes time and practice, but there are many YouTube videos that walk you through it.Non-Slip Silicone Placemats$11 at AmazonGlobal MinoSharp Guide Rails$23 at AmazonAfter you’ve mastered the art of sharpening with your least precious knife, you’ll feel more confident taking a prized blade to the whetstone as needed—which is not that frequently. Most home cooks probably won’t have to sharpen their knives more than two to four times a year.There’s got to be an easier way. What are my other options?If “learn to use a whetstone” is nowhere on your to-do list, a manual pull-through sharpener is your best bet for attaining a razor-sharp knife. Just keep in mind that the angles on most pull-through sharpeners are already set—you can’t adjust it to the knife you’re using, and you can’t use the same machine to sharpen both Japanese knives and Western-style knives. It’s also easy to remove more material than you intended and, over time, the mechanics in the sharpener can bend and break, leaving your knife with a really gnarly edge. To get the best results with this tool, check with the manufacturer to see if they sell a manual pull-through specifically for your brand of knife (for example, we’ve had a great experience using the Miyabi 2-Stage Handheld Knife Sharpener with Miyabi knives) and, if not, ask them for a recommendation. Our friends at Epicurious love this universal KitchenIQ two-stage manual knife sharpener, which also works on serrated knives.Miyabi 2-stage Diamond/Ceramic Handheld Knife Sharpener$55 at Amazon$55 at ZwillingKitchenIQ 2-Stage Knife Sharpener$10 at AmazonThe fastest, most convenient route to getting a sharp blade is an electric sharpener, but it’s important to note that they also aren't adjustable and they provide even less control than manual pull-throughs. So if you’ve got a really nice, high-quality knife that you want to last forever, this sharpening system is not the best choice. “If you have decent knives, using an electric sharpener is like brushing your teeth with a chainsaw,” Morocco says. “Sure, it will work, but eventually you won’t have any teeth.”But if you’ve got a great-but-cheap knife, like the Victorinox Fibrox Pro Chef’s Knife (which Morocco believes is one of the best knives for your money), then an electric sharpener will get the job done. He says, “An electric kitchen knife sharpener is better than only ever having dull knives in your knife block, but it isn’t very kind to your blades and won’t be able to accommodate any unique nuances to that blade.”Chef'sChoice Professional Electric Knife Sharpener$135 at AmazonWork Sharp E2 Kitchen Knife Sharpener$50 at AmazonWhat’s the difference between knife sharpeners and honing rods?While sharpening your knives removes metal to create a new, sharper edge, honing helps to maintain that sharp edge. Use your honing rod (or honing steel) between sharpening sessions, whenever you find yourself meeting resistance as you dice things like tomatoes or plums. If honing doesn’t do the trick, it’s time to sharpen your knife again. Morocco recommends using a ceramic honing rod. Ceramic rods are harder than stainless steel—i.e., harder than your knife—and they have a finer grit, which works faster and is less rough on your knife edge. For more tips on honing, head over here.Photo by Laura MurrayMAC Ceramic Knife Sharpener$23 at AmazonExplore Bon AppétitKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-13", "author": ["Condé Nast", "Sarah Jampel", "Tiffany Hopkins"]}