{"id": "205b3098699af3a1ed7e17bdbe2d4dd0", "url": "https://www.bonappetit.com/story/brad-leone-cooking-rules", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Brad Leone's Top 10 Cooking Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Time to Stop Using Old Spices—and More Essential Cooking Rules From Brad LeoneThe star of It’s Alive thinks it’s probably time you freshened up your cabinet.By Brad LeoneSeptember 4, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis month, we're doing a mini series on our podcast. Each of the Bon Appétit Test Kitchen editors will be sharing their top 10 cooking rules: the techniques they swear by, the ingredients they can’t live without, and the mindsets that keep them going. First up: the man who spends all his time fermenting miso, tending to his knives, and cooking outdoors, Brad Leone.1. Buy a quality chef’s knifeIt’s an extension of your arm. Not only does a good knife make cooking easier, but it makes it safer too. An 8-inch is the sweet spot when it comes to the perfect everyday size.2. Learn to sharpen your knivesDo some research on YouTube, which has a lot of great videos. Or at least take them to a drop-off service—as long as you know it’s a good one. This way, your knives will last for generations.The better the salmon, the better your food.\nPhoto by Emma Fishman, Food Styling by Susie Theodorou3. Buy wild salmonPeople love salmon—but not all salmon is created equal. Farmed fish can be fed yucky things, with harmful side effects to both the fish themselves and to the waters they call home. I like salmon from Alaska. Check out Taku Salmon, Alaska Home Pack, or Drifters Fish, all of which allow you to buy online.4. Invest in olive oils and vinegarsNice olive oil is fairly easy to find at your standard grocery store, but there are fewer options of nice vinegars. But you can order some of them on the internet, right from the maker. One of my favorites is Katz. Once you do get some good vinegars, it’s hard to go back.5. Refresh your spicesSo many spices die in spice cabinets. They are subject to years of oxidation and drying out where you lose their color, aroma, and flavor.6. Prep for partiesHaving a game plan isn’t just for Thanksgiving. Even if you don’t have everything done, have most of the prep done. You want to be able to enjoy yourself.You better believe this Minty Limeade has a pinch of salt.\nPhoto by Chelsie Craig, Food Styling by Maggie Ruggiero7. Season your beveragesWe season everything, so why not our drinks? Just a little pinch of salt will make a world of difference.8. Try new recipesWhether you’re pulling inspiration from restaurants, or simply tweaking the dishes you already like, it’s important to change up your rotation, even if it’s only every once in a while.9. Take notes while you cookWhen you’re deep into cooking, especially if you’re riffing, you may not remember what you did. And if you nailed it when all is said and done, you’ll want to be able to go back and remember what you did. I keep a journal in my home kitchen for jotting down notes.10. Keep it simpleEspecially if you go all out buying a nice piece of meat, or some beautiful produce, less is more. If you have eight ingredients, stop and think about what you could do with six.Listen to the full discussion on the BA Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitBrad LeoneRead MorecultureThe Bon Appétit Shop Is LiveBy Bon AppétitcultureBrad Leone’s Very Specific Holiday Gift Guide 2018Gallery17 SlidesBy Brad LeonecookingA Totally New Way to Use Cauliflower RiceBy Emma Wartzmantest-kitchen4 Quick and Braise-y Recipes to Cook This WeekBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-04", "author": ["Condé Nast", "Brad Leone"]}