{"id": "20600535c5595190f3873e72a8be9951", "url": "https://www.bonappetit.com/recipe/red-braised-pork-belly-hong-shao-rou", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Red-Braised Pork Belly (Hong Shao Rou) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRed-Braised Pork Belly (Hong Shao Rou)By Simone Tong February 12, 20184.2(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintChef Simone Tong of Little Tong Noodle Shop in New York, who developed this recipe, says: “This traditional braised pork belly dish is a crowd-pleaser for any special occasion. At home it’s usually eaten with other Chinese New Year dishes over white rice. But it’s also a great topping for noodles, lettuce, tortillas, and buns.” Read more about Chinese New Year and find the full menu here.Ingredients8 servings2½lb. skin-on, boneless pork belly, cut into 1\" pieces¼cup sugar4scallions, white and pale green parts coarsely chopped, dark green parts thinly sliced12\" piece ginger, peeled, thinly sliced2garlic cloves, crushed1star anise pod¼cup light soy sauce¼cup Shaoxing wine (Chinese rice wine)Cooked short-grain rice (for serving)PreparationStep 1Bring a large pot of water to a boil. Add pork and cook, skimming off foam from surface, 5 minutes (this blanching step gets rid of any impurities on the pork, making it more tender; don't skip this step!). Transfer pork to paper towels to drain.Step 2Wipe out pot. Heat 3 Tbsp. water in pot over medium-high. Add sugar, stir to dissolve, and cook, stirring constantly, until syrup thickens and turns a pale amber color, about 4 minutes. Reduce heat to medium and return pork to pot, swirling so all sides are covered in caramel. Add white and pale green parts of scallions, ginger, garlic, and star anise. Cook, tossing, until fragrant, about 1 minute. Add soy sauce and wine and cook, stirring, until slightly reduced, about 1 minute.Step 3Pour in 3 cups water (it should just barely cover pork; add more if needed). Bring to a boil, then reduce heat to low and cook, partially covered and stirring occasionally, until pork is tender, 50–60 minutes.Step 4Using a slotted spoon, transfer pork to a plate; remove pot from heat. Let sauce cooking liquid cool slightly so rendered fat can rise to the surface. Using a ladle, skim off as much fat as possible (save it for another use).Step 5Return pot to medium heat and cook, stirring occasionally, until sauce is slightly thickened and glossy, 12–15 minutes. Return pork to pot and toss to gently reheat and coat with sauce.Step 6Transfer pork to a platter. Pour sauce over. Top with dark green scallion parts and serve with rice alongside.How would you rate Red-Braised Pork Belly (Hong Shao Rou)?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleAbsolutely delicious, and taste like proper Chinese food! 10/10 would recommend to friends and family and would definitely make again.\nSource: am ChineseAnonymous8/26/2020I was looking for an easy way to make Chinese-style braised pork and stumbled upon this recipe. I managed to cut the cooking time by using a pressure cooker, but the results were delicious: meltingly tender pork chunks evenly coated with a sweet and savory sauce. Gorgeous on rice, and I'm planning to use the leftovers to make steamed pork buns.margamanlapigManila, Philippines4/20/2020This recipe was spot on. Simmering the pork beforehand and then letting everything meld together really seals in the flavor. The pork is melt in your mouth tender and just sweet enough without being overpowering. Reccomend serving with marble tea eggs and bok choyBellyboySeattle, WA5/5/2018I followed this recipe almost exactly. I used Chinese rock sugar. That was NOT a better alternative. It took too long to melt. I forgot the star anise, but it didn't matter. The pork was still tough after 50 minutes of simmering and I suspect the 3 cups of water washed out all the flavor. This was pork I had purchased from the butcher and cooked the same day- so the texture wasn't due to inferior meat. I also let the remaining liquid boil down far longer than the recipe called for, until there was almost a third of the liquid left, but it never really reached glazing consistency. J. OngAstoria, NY5/3/2018Explore Bon AppétitChineseEast AsianAsianPork BellyPorkMeatOne-Pot MealsMainDairy-FreeNut-FreeBraiseLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Simone Tong"]}