{"id": "20736e1f9fe15ca5bf8fa864bdba1d19", "url": "https://www.bonappetit.com/recipe/yogurt-marinated-mushrooms-with-flatbread", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Yogurt-Marinated Mushrooms With Flatbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueYogurt-Marinated Mushrooms With FlatbreadBy Rachel GurjarJuly 6, 20214.8(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSpiced yogurt imparts tenderness and creamy tang to maitake or crimini mushrooms and creates delicious charred outer layers. Serve with a simple naan-like grilled flatbread, which can be made gluten-free with millet flour if you prefer—but cook them in a skillet instead as they will be more delicate to handle. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonBlender$32 At AmazonCharcoal Grill$98 $82 At AmazonMandolin Slicer With Protective Gloves$34 $27 At AmazonFrench Rolling Pin$17 At AmazonIngredients4 - 6 ServingsYogurt sauce1cup plain whole-milk Greek yogurt2Tbsp. fresh lime juice3tsp. honey1tsp. cumin seeds½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt2garlic clovesPickled onions1small red onion, very thinly sliced, preferably on a mandoline2Tbsp. fresh lime juice2tsp. Diamond Crystal or 1 tsp. Morton kosher saltFlatbread and assembly4garlic cloves, finely grated12\" piece ginger, peeled, finely grated2Tbsp. fresh lime juice1Tbsp. ground coriander1Tbsp. ground cumin1tsp. ground turmeric1tsp. sugar½tsp. cayenne pepper1½cups plain whole-milk Greek yogurt, divided1Tbsp. vegetable oil, plus more for brushing1Tbsp. plus ½ tsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, divided1lb. maitake mushrooms, ends trimmed, separated into large pieces; or whole crimini mushrooms½cup (63 g) whole wheat flour1¾cups (220 g) all-purpose flour, plus more for dustingCilantro leaves with tender stems and lime wedges (for serving)PreparationYogurt sauceStep 1Blend yogurt, lime juice, honey, cumin seeds, salt, and garlic in a blender until smooth. Transfer sauce to a small bowl and set aside.Pickled onionsStep 2Toss onion, lime juice, and salt in another small bowl to combine. Let sit at least 15 minutes.Do ahead: Onion can be pickled 6 hours ahead. Cover and chill.Flatbread and assemblyStep 3Whisk garlic, ginger, lime juice, coriander, cumin, turmeric, sugar, cayenne, 1 cup yogurt, 1 Tbsp. oil, 1 Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt, and 2 Tbsp. water in a medium bowl to make a paste.Step 4Place mushrooms in a large bowl and carefully spoon paste over. Using your hands, make sure paste coats all the crevices of each mushroom. Cover and chill 30 minutes.Step 5Meanwhile, beat whole wheat flour, 1½ cups (188 g) all-purpose flour, remaining ½ cup yogurt, remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and ½ cup water in the bowl of a stand mixer fitted with a dough hook, starting on low speed then moving to high speed and adding another 1 Tbsp. water if dough is dry, until dough comes together into a ball around the hook, about 3 minutes.Step 6Turn out dough onto a lightly floured surface and knead until smooth, about 3 minutes. Divide dough into 6 balls (about 3 oz. each). Roll out each ball to a 7\"-diameter disk, about ¼\" thick. Lightly dust a baking sheet with flour and place flatbread on pan.Step 7Prepare a grill for medium heat. Working in batches if needed, grill flatbread until puffed up and charred in spots, about 3 minutes per side. Transfer to a plate.Step 8Oil grate. Grill mushrooms until golden brown, charred around edges, and cooked through, about 4 minutes per side.Step 9To serve, spoon some mushrooms over each flatbread and top with yogurt sauce, drained pickled onion, and cilantro. Serve with lime wedges for squeezing over.How would you rate Yogurt-Marinated Mushrooms With Flatbread?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleDidn’t want to deal with our grill tonight so ended up making this recipe in a Le Creuset Cast Iron Grill Pan and it worked great. We complained about the recipe being overly fussy for a weeknight the whole time (second yogurt sauce was debatably necessary) … all that being said … SO very delicious. AnonymousNew Orleans, LA 9/23/2021Has anyone tried making the marinated mushrooms ahead of time and letting them chill overnight before cooking? Would that work well, or is it necessary to assemble and cook on the same day?Overnight Shrooms?7/28/2021Would this recipe still work using vegan unsweetened yogurt both for the mushrooms and flatbread?  Thanks!Alyssa MBay Area7/27/2021Absolutely delicious. The recipe is a little confusing. The yogurt sauce is prepared and kept for serving. Then you make a different yogurt marinade for the mushrooms. That said, this is great recipe and worth the timeAnonymousAtlanta, GA7/25/2021Explore Bon AppétitFlatbreadBreadMaitake MushroomMushroomVegetableWhole Wheat FlourFlourCrimini MushroomMainNut-FreeVegetarianGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}