{"id": "207e4f3f19f6f6f9288161c2e2c7af01", "url": "https://www.bonappetit.com/recipe/leeks-with-hazelnuts-and-tarragon", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Leeks With Hazelnuts and Tarragon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueLeeks With Hazelnuts and TarragonBy Danielle Bell and Pablo OsorioJanuary 4, 20224.0(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Caroline Hwang, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintWe’re huge fans of juxtaposing decadence with simplicity. Here the humble leek gets simmered until tender, then dressed up with a bright tarragon vinaigrette, a boiled egg, and toasted hazelnuts to create a memorable side dish. —Danielle Bell and Pablo Osorio, recipe developers and founders of de Porres Dinner SeriesAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Rimmed Baking Sheet$28 At AmazonMedium Pot with Lid$155 At AmazonSlotted Spoon$13 $10 At AmazonWhisk$10 At AmazonIngredients¼cup blanched hazelnuts1tsp. Diamond Crystal or ½ tsp.Morton kosher salt, plus more2medium leeks, white and palegreen parts only, roots trimmed, tough outer layers removed1large egg1large garlic clove, finely grated1Tbsp. Dijon mustard1Tbsp. white wine vinegarPinch of cayenne pepper1tsp. freshly ground black pepper, plus more¼cup extra-virgin olive oil, plus more1½tsp. finely chopped tarragon, plus  leaves for servingPreparationStep 1Place a rack in middle of oven; preheat to 325°. Toast hazelnuts on a small rimmed baking sheet, tossing halfway through, until deep golden brown, 12–15 minutes. Let cool, then coarsely chop; set aside.Step 2Bring a medium pot of heavily salted water to a boil. Add leeks, reduce heat, and simmer, uncovered, until tender but still bright green, 12–14 minutes. Transfer to a large bowl of ice water and let cool; keep water in pot boiling. Transfer leeks to a cutting board and pat dry; slice in half lengthwise.Step 3Using a slotted spoon, gently lower egg into pot of boiling water; cook 10 minutes. Transfer to bowl of ice water and let sit until slightly warm, about 2 minutes. Gently crack egg all over and peel; tear into bite-size pieces.Step 4Whisk together garlic, mustard, vinegar, cayenne, 1 tsp. black pepper, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a small bowl. Gradually stream in ¼ cup oil, whisking constantly until vinaigrette is emulsified. Stir in 1½ tsp. tarragon.Step 5Arrange leeks, cut side up, in a single layer on a plate. Drizzle liberally with oil and spoon vinaigrette over. Top with egg, tarragon leaves, and reserved hazelnuts. Season with more black pepper.How would you rate Leeks With Hazelnuts and Tarragon?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerSideEasyVegetarianGluten-FreeDairy-FreeLeekVegetableHazelnutNutTarragonHerbs & SpicesSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Danielle Bell", "Pablo Osorio"]}