{"id": "2089e9c792ea48e887ad1a9199ca70d5", "url": "https://www.bonappetit.com/story/all-the-healthyish-news-you-need-to-know", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Healthyish Newsletter: All the Healthyish News You Need to Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAll the Healthyish News You Need to KnowEverywhere to find Healthyish IRL and other news from Healthyish editor Amanda Shapiro.By Amanda ShapiroOctober 4, 2018FacebookTwitterEmailPhoto courtesy of Mercado SagradoFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Between eating frozen yogurt pie and talking to the men in my life, I've barely had time tell you about all the fire-emoji Healthyish events we have coming up this month—it's gonna be a big one!New Yorkers: First up, we're hosting our sixth and FINAL (for now) Superpowered dinner at Dimes on Tuesday night. The dinner is sold out, but stay tuned for details on the ~ after party ~ and join us and Outdoor Voices for a free yoga class the night before (two lucky yogis will win free tix to the dinner!).LA-ers: I'm so excited to be coming in for Mercado Sagrado, the Malibu wellness and craft festival, on October 13th and 14th. We curated a lineup of delicious food vendors like Canyon Coffee, Amara Kitchen, and Laka Living, and, on Saturday, I'll be moderating a panel about what it means to eat \"righteously\" with folks from Sun Potion, Pono Burger, and Lunch on Me. Come hang out and eat great food, and if you come to my panel you'll get a brand-new, beautifully designed Healthyish tote bag for free. Hell yes!Also for the LA crew, find us at Heyday on October 12th for a night of skin-happy food and conversation. It's free, so RSVP now! We'll have snacks from Honey Hi and more, and the Heyday facialists will be on hand to answer your most pressing skincare Qs.And if you can't hang out with us IRL, there's plenty happening on the dot com. Hear how CBD fueled this chef's battle against breast cancer. Read about the supplements that really do help me sleep. Meet our latest person of interest, Ora Wise. Buy an $80 crystal water bottle...or don't. And tell us what you think: healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterRead MoreLifestyleThe Newsletter Is Back and So Is Virgo SeasonBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Amanda Shapiro"]}