{"id": "208b8a8698a49505f9a57991714fe9ae", "url": "https://www.bonappetit.com/story/red-pepper-blender-sauce", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "This Creamy Red Pepper Pasta Sauce Basically Makes Itself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Creamy Red Pepper Pasta Sauce Basically Makes ItselfOpen a few jars, crank the blender, and dinner is served.By Ali FrancisSeptember 21, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Scabby knees from falling over while playing tipsy mini golf. Sunburnt skin flaking like desiccated coconut. Ninety percent humidity and three-digit temperatures. These are all things that I bid good riddance to come leafy-perfect-snuggly fall—my favorite season in the Northeast. But there is one summer thing, every late September, that I grip on to like a rogue boogie board in the whitewash: ripe and creamy red pepper pasta.The sauce is the most versatile, delicious, and kinda impressive condiment I make (at least weekly) during the months when those sweet, crunchy bulbs are ripe for the cookin’. Slow roasted red peppers and onions are blitzed in a blender with fresh herbs before being tossed with curly cavatappi. The pasta dish is my favorite way to eat this sauce—glossy noods in rich, velvety goodness—but any leftovers make for a fun and fancy bottom-of-the-plate swoosh upon which to serve buttery white fish, grilled lamb chops, or roasted broccoli.But, as I transition from T-shirts to turtlenecks and the farmers market is all pumpkins and cider, it feels wrong to buy those season-defying tricolor pepper packets from the supermarket. So I’ll head over to the canned-everything aisle instead, where jewel-toned pickles and preserves twinkle away under fluorescent light. With just a few heavy-hitting pantry staples—anchovies, sun-dried tomatoes, nut butter, and charred-at-their-peak peppers—I can re-create my favorite summer pasta sauce in a matter of literal minutes. No oven (and no special summer-only produce) necessary!Here’s how to make it:Boil 1 lb. pasta—like cavatappi, fusilli, or reginetti; anything short and funky that the sauce will stick to—in salted water for a minute less than the instructions recommend. Drain and reserve about two cups pasta cooking water.Strain the liquid from a 16-oz. jar of roasted red peppers. (Note: With this being the main ingredient, quality is key here. Opt for whole red peppers with visible signs of char, like Divina’s.) Add the peppers to a blender with 4 Tbsp. cashew butter (or almond if you can’t get it/don’t want to hand over your life savings); 7 oil-packed sun-dried tomato pieces (plus 2 Tbsp. oil); 4 anchovies; ½ oz. fresh basil leaves (about a handful); 1 tsp. crushed red pepper flakes; 2 garlic cloves; and 1 cup pasta water. (If you want to make sauce without pasta, you can use tap water here instead.) Blend on high until the sauce is smooth. Add kosher salt and black pepper to taste.Return your cooked pasta to the pot you boiled it in and pour in about half of the blender sauce. Keep adding glugs until each noodle is fully slicked. Turn the burner on to low heat, add ½ cup pasta water, and stir gently until it’s mostly evaporated. Add ½ cup grated Parmesan and another ½ cup pasta water, then keep stirring to combine. The cheese should be fully incorporated and the sauce clinging to the pasta. Store any leftover sauce in an airtight container in the fridge for up to a week.For me, a pile of red pepper pasta and a glass of Tempranillo needs nothing or no one, but if you’re hankering for a salad, simple, vinegary greens are the perfect sidekick. Thanks to jarred peppers, this summery favorite never goes out of style. Neither do my turtlenecks.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-21", "author": ["Condé Nast", "Ali Francis"]}