{"id": "208c7f1f576185f7abd8e4ff27f23184", "url": "https://www.bonappetit.com/story/emilia-ortiz", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Emilia Ortiz's Nighttime Routine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEmilia Ortiz Cleanses Her Aura and Chats with Her Ancestors Before BedThe Brooklyn spiritual advisor winds down by lighting up.By Martine ThompsonMay 29, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn 'Going to Bed with...' we talk to the people we're crushing on about how they wind down before going to sleep. This story is also part of the Healthyish Guide to Finally Getting a Good Night's Sleep. Click here to read the whole guide—then get those zzzs.Wellness spaces that reach neglected communities of color are essential, says spiritual advisor, mental health advocate, and writer Emilia Ortiz. As the 26-year-old Brooklyn native will tell you in her signature metaphysical-no-chaser way, when your mental health is in a bad place every aspect of your life is affected. She’s part of a growing effort to foster more inclusive healing spaces that take into account how racism, poverty, ableism, misogyny, and gender discrimination inform our self-care needs. Through harnessing the brujería that’s been passed down her Puerto Rican lineage over generations, offering private spiritual advisory sessions, and sharing holistic #30SecondTherapy videos for PAPER magazine, Ortiz hopes to help bridge that gap while affirming that wellness is for everyone.In her work, it is vital to Ortiz that wellness is accessible and resonates with people in her own community, like women of color living in the hood with a mental illness, and beyond it. Her goal is to swap stigma and the many remnants of trauma—generational, cultural, environmental, institutional—with healthy coping mechanisms, while normalizing wellness work among groups who arguably need it the most. Here, Ortiz shares how her work ethos carries over into her nighttime routine, the aromatic flower she’ll add to her weed when decompressing after a difficult day, and her favorite skincare rituals before bed.Ortiz soaking in the tub\nPhoto by Emma FishmanA cleansing hot shower or bathI like to start with taking a shower or a bath when getting ready for bed. I’ll always incorporate either Himalayan pink salt or Epsom salt into my routine. Then, I’ll do an in-shower meditation, just releasing my day and allowing it to wash down the drain. I like to start from the neck down to symbolize washing and removing anything, and then I go from the feet up after to symbolize recharging my energy.Setting the mood with incenseA lot of the times before bed I’ll pick a lavender or moon scent. I really like the scents from the brand HEM. Other times, if I’m needing to cleanse my space before bed, I like to use Frankincense & Myrrh incense because it’s really good at helping you feel sleepy time vibes. I have horrible insomnia so I’m somebody who really has to set my mood before going to bed.A joint before bedPart of my ritual is rolling up a joint before I go to bed. I’ll sit in bed and really just think about my day, what I got accomplished, and what I want to do better the next day. I’ll sprinkle dried lavender in my joint if I’ve had an exceptionally bad day and it’s very relaxing. A lot of people make smoke blends where that’s included for anti-anxiety and things. I’ll unwind that way and let my day come off, and when I finish I brush my teeth and wrap my hair up.Ortiz rolling a joint before bed\nPhoto by Emma FishmanSkincareI’ll wash my face with a gentle cleanser, my current favorite is Filthy Cosmetics’ Gentle Jelly Facial Cleanser in “Nude.” I then follow up with a toner of sorts, currently I’m obsessed with Cosrx Two in One Poreless Power Liquid, or usually Thayers Alcohol-Free Witch Hazel Rose Petal Witch Hazel Toner. I follow up with a face oil or serum. During the day, I’m loving Rosé Bitch from Filthy Cosmetics, at night I use The Ordinary’s Organic Cold-Pressed Rose Hip Seed Oil to help with acne scarring I have. I use a Rose Quartz Crystal Facial Roller from Chakrubs to help my face absorb them. At night, I’ll finish with Glow Recipe’s Watermelon Glow Sleeping Mask and spritz with a hydrosol when that sets. Once a week I’ll exfoliate my face, either with a peel/chemical exfoliator or with a natural one such as the ones carried by Brujita Skincare and Filthy Cosmetics. I do masks at least two times a week, one for clarifying and brightening, and one for moisturizing. My go-to’s are the Amazonian clay that you mix yourself and the Dr. Jart+ Rubber Hydro masks, currently the shake & shot ones especially.MeditationI do a meditation while I’m lying down with my eyes closed. That helps with astral projection because I’m somebody who does that anyway. I tend to go a lot of places so I set the intent for me to be protected and to work with my higher self while doing all of that astral projection. That helps ensure my night’s sleep will be good and that I don’t have nightmares the way I used to. I’m also one of those weird people who sleeps with a piece of amethyst inside my pillowcase.Chatting with the ancestorsI always say my thanks to my ancestors and talk with them, with my guides. I talk to them about my day, what I want, what they need of me. I give my thanks to them for the day, even if I had a bad day. I let them know, ‘Thank you for making sure I ain’t die today, I survived through the fuck shit.’ It’s a big comfort to me to have that open line of communication because so many of my spirit guides are people who I knew in this lifetime who passed on, one being my father, one being my abuelita. It’s comforting to know even though they’re not here physically to do that anymore, they do it from the other side, for the ones I knew in this lifetime and the ones I didn’t. I’m able to say to myself, “Yo, I feel fucked up right now, but y’all always got me.” I know I’m fortunate to have that.Explore Bon AppétitHealthyishSleep WeekGoing to Bed withCannabisprofileRead MorecultureFariha Róisín on the Rituals (and Silk Pillowcases) That Help Her Get to SleepBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Martine Thompson"]}