{"id": "20961486380433ea864e3b04060e852b", "url": "https://www.bonappetit.com/story/vegan-pesto-nut-free", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Vegan Pesto Is Also Nut-Free and Still Totally Pesto-y | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Vegan Pesto Is Also Nut-Free and Still Totally Pesto-yIt looks like pesto... it tastes like pesto... but there's a secret ingredient lurking in the green sauce.By Carey PolisFebruary 9, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailI get that pesto purists are going to argue that vegan pesto is not real pesto, that nut-free pesto is not real pesto, that pesto must contain basil, pine nuts, garlic, and a grated hard cheese like Parmesan, no exceptions. But the thing about that (very delicious) pesto is that it's not very friendly to people who can't eat dairy or nuts. And if said people are already suffering from a nut allergy or the inability to eat cheese, it is basically criminal to deny them pesto as well.Enter this golden raisin pesto. Yes... I said \"raisin pesto.\" Senior food editor Andy Baraghani, the man responsible for this blasphemous-yet-delicious vegan pesto, didn't set out to create an allergy-friendly dish. He just wanted a sauce that would cut through the rich, gamey taste of lamb meatballs. But, it turns out, just as nuts can turn chopped herbs and cheese into a luxurious, silky sauce, raisins can do the same.Don't be fooled—this pesto doesn't taste like dessert at all. The recipe uses a lot of herbs—mint and parsley, to be exact—to keep the sweetness of the raisins in check. The pesto goes great on the lamb, of course, but I also stirred it into plain yogurt and ate it on toast, and it would be amazing as a sauce for fish. Plus, leftovers are ideal for spooning directly from the jar when you can't sleep at 3:26 a.m. (maybe you also ate a handful of chocolate chips you found in the cupboard, I'm not telling).And, if you really don't love raisins, Baraghani suggests swapping them with another dried fruit like figs, apricots, or dried cherries.And, as someone who would never avoid cheese when there is an occasion to eat cheese, I have to say: I don't miss the dairy.There's a new green sauce in your future:Lamb Meatballs with Raisin PestoRaisins in your pesto?!? We promise that they deliver the right amount of sweetness to complement the lamb.View RecipeExplore Bon AppétitHealthyishPestoLambMeatballRaisinRead MorecookingI Love This Lamb Meatball Recipe So MuchBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Carey Polis"]}