{"id": "20972504a0fff3b469119cfc8ad9de06", "url": "https://www.bonappetit.com/recipe/marinated-manchego", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Marinated Manchego Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueMarinated ManchegoBy Andy BaraghaniNovember 20, 20184.1(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe only thing more crowd-pleasing than cheese is marinated cheese. If Manchego isn’t your thing, go for any semi-firm cheese like white cheddar, Gouda, or Monterey Jack. They go just as well with the notes of bright citrus and sweet cooked garlic.Ingredients8 servings1head of garlic, cloves separated and peeled (about 12 cloves)1small orange, quartered through stem end, thinly sliced crosswise, seeds removed½cup extra-virgin olive oil3sprigs rosemaryKosher salt1lb. young Manchego cheese, cut or broken into ¾\" piecesPreparationStep 1Cook garlic, orange, and oil in a small saucepan over medium heat, stirring occasionally, until garlic starts to turn golden, 10–12 minutes. Remove from heat and add rosemary sprigs. Season with salt and let cool.Step 2Pour garlic mixture into a medium bowl, add cheese, and gently toss to coat cheese. Cover and chill at least 12 hours before serving.Step 3Do Ahead: Cheese can be marinated 3 days ahead. Keep chilled.How would you rate Marinated Manchego?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleNothing special at all about this dish,  I felt it was a waste of a nice piece of cheese,  Would not make it again.ncohen11Toronto 12/27/2019Loved this! Keeping in a large Mason jar in the fridge, but serving at room temp. A great accompaniment to wine before dinner, just a couple of cubes per person. Keeper. AnonymousMexico10/18/2019Not a super fan of this.  I could see people possibly enjoying it, but I felt like it was a little more effort than it was worth, flavor wise.  I love rosemary, love oranges, love cheese.  Just didn't love this combination and process.AnonymousWilmington, DE7/3/2019It's just so bitter! I'm glad I tasted the oil before, so that I didn't mix it with the cheese, or else I would have wasted everything. I did use the cooked garlic and put some more olive oil, but skipped the orange. Am I doing anything wrong?AnonymousBrazil2/16/2019This was a great way to use up the rest of a block of Manchego and clean out the fridge. I used lemons instead of oranges (and added just a pinch of sugar to make up for the sweetness) and used thyme instead of rosemary. It was a hit at Christmas and I'll definitely make it again as a make-it-ahead-impress-your-guests-with-minimal-effort-party-app AnonymousSaint Paul12/31/2018Very good recipe.  Tested it at two different Christmas dinners.  Everyone liked it, asked questions, and commented on it.  One suggestion:  I used small orange--almost clementines in size.  The garlic takes longer to cook than the oranges. So when I cooked them together, long enough for the garlic to brown, the orange slices turned to moosh and had lost their orangey tang.\n\nIn the second batch, I waited until the garlic had started to get soft, but not yet browned.  Then tossed the orange slices in.  They cook in about half the time the garlic takes.  They held their shape, flavor and color better, and best of all you can still eat everything--rind and all.  I also recommend changing the ingredient quantities.  If you cut up just about equal numbers of orange slices as you have garlic cloves, and then add the same number of manchego pieces, everything seems to work out better for guests.  They consistently want to skewer one of each ingredient on a single toothpick.  Also cutting your manchego pieces about the same size as orange slices and garlic cloves seems to make the combo flavors all work out better.AnonymousWashington, DC12/27/2018Explore Bon AppétitManchegoCheeseGarlicVegetableOrangeCitrusFruitRosemaryHerbs & SpicesEasyStarterSnackGluten-FreeNut-FreeVegetarianFryNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}