{"id": "209cb0ef56e3312e542a9247a5dcde2a", "url": "https://www.bonappetit.com/story/best-granola-bars-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "These Are the Best Homemade Granola Bars I’ve Ever Had | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Are the Best Homemade Granola Bars I’ve Ever HadFood director Carla Lalli Music shares why she really loves these granola bars in her weekly newsletter.By Carla Lalli MusicSeptember 20, 2018FacebookTwitterEmailPhoto by Ditte IsagerFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Grain trustThis week’s underdog recipe combines a few of my favorite things: whole grains, bulk bin shopping trips, and presents.We published Nutty Grain and Oat Bars in the January 2014 inaugural Healthyish issue, except we called it “The New Healthy” then—that’s how long ago it was! The recipe was conceived from the start as a celebration of whole grains, and has strong supporting roles from raw nuts, various manner of seeds, Medjool dates, and the notorious bitty grain, amaranth. You pack everything into a loaf pan, then bake it into a dense, chewy, grain-and seed-packed brick, which can then be sliced into the best homemade granola bars you’ve ever had.Want this letter before it hits the website? Sign up for our newsletter!The grain and oat mixture is bound together by a delicious glue made from mashed Medjool dates (high in fiber and potassium) that are simmered in maple syrup (uh—plant based!) until they practically dissolve. When I first tasted the recipe, the dates and maple made the final results a tad too sugary. The bars were also crumbly, which senior food editor at the time Dawn Perry surmised she could fix by applying many pounds of pressure to compress the mixture into the loaf pan before baking.The next time I tried these, Dawn had adjusted the amount of date-maple glue and was ready to show off the effects of her patented packing and pressing technique. The bars were a wall-to-wall bounty of grains, nuts, and seeds. The slices were lightly bound by the sweet mash, toasty-tasting from a 45-minute bake time, and sturdy enough to slice ½-inch thick without breakage. We had a winner. They were the greatest granola bars I had ever had. I took a print-out of the recipe home so I could make them over the weekend.I didn’t have a potato masher at home, which is what Dawn had called for to turn the cooked date mixture into a puree, so I did what any confident home cook should do—I improvised. I scraped the mixture into a quart container and then used my immersion blender to smooth it out. That worked, so we added guidance to that effect to the final version of the recipe. I knew how important it was to pack and press and press and pack, but my valiant efforts at home yielded a loaf that still had little air pockets inside, which made it hard to slice. Nevertheless, it tasted just as good as the one I had had at work.I’ve made The Bars at least a dozen times since. I’ve made them for nursing women (they’re nutrient dense, and nursing women need calories!) and I’ve given them as hostess gifts. I’ve made them for new neighbors and for friends in mourning. I even sent a loaf to my mother-in-law when she was going through chemo and didn’t have much appetite (she needed calories, too). The finished loaf will hold for days on days, so it’s great to pack and ship, or wrap and gift. Maybe this is making me sound like a thoughtful and generous person. I’m not, really. Every time I made one to give, I doubled the recipe so we’d have one at home, too. It’s very affirming for me when others benefit from my selfishness.Here are a few key pieces of wisdom and guidance I’ve picked up along the way:• Double the recipe and make someone happy in addition to yourself (or, freeze the second loaf and make yourself happy some other time).• Shop for the oats, nuts, and seeds in the bulk bin aisle of your neighborhood health food store or your preferred grocery store. Generally speaking, you’ll pay less per pound than if you buy them in pre-packaged quantities.• If you don’t have amaranth, use millet, or just increase either of the seeds by 2 Tbsp. and leave the amaranth out.• Make sure your date-and-maple mixture is very, very smooth before combining it with the oats, nuts, and seeds. The recipe says “as smooth as possible,” but some people will use that as a cop-out when their arm gets tired. If there are pieces of dates still visible, you need to do better (try the immersion blender trick!).• Finally, devote several minutes to compressing the mixture into the loaf pan. Because it’s hot and a little sticky at that stage (from the molten date glue), I put a sheet of lightly greased parchment paper onto the surface before I start. Then, with the loaf pan on my counter, I get on my step ladder (for leverage; I’m short), and exert myself in a tricep-heavy, push-up-esque series of see-saw movements to smash everything down, down, down. I use my hands, I use a spatula, I use my balled-up fists, and I don’t give up until it feels like the mixture has fused into one solid mass.Oh, also: a couple of slices, toasted, with cream cheese on top, is a killer breakfast. I’ve made them enough times to know.Get the recipe:Nutty Grain and Oat BarsExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Carla Lalli Music"]}