{"id": "20a25d3b59ffd262751d283af846b0af", "url": "https://www.bonappetit.com/story/glazed-leeks-thanksgiving-wild-card", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Silky Leeks With Not One But TWO Sauces Are My Thanksgiving Wild Card | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSilky Leeks With Not One But TWO Sauces Are My Thanksgiving Wild CardThis year, I’m thankful for all the bright, zippy vinegar cutting through the usual spread of starches.By Emily SchultzNovember 7, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailA few things I’ve learned since working at Bon Appétit: NEVER touch anything on Brad’s fermentation station, Adam Rapoport prefers bottled (not fountain) bubbles for his vodka sodas, and sauces take any dish from really good to “Yeah, we’d put that on the cover.” Just look at the plethora of salad dressings we put out, or the lamb meatballs with yogurt AND pesto that starred in our April 2018 issue, or these brand-new Thanksgiving leeks with a chile-honey-vinegar glaze AND an herby salsa verde!Think about it… a leek! So humble. So everyday. Who’s going to make room for that when faced with creamy mashed potatoes, tender turkey, and a boatful of gravy? Well, when you dose them in not just one, but TWO, killer sauces, they’re bound to be a surprise holiday favorite. Here’s why.The GlazeThe glaze that gets poured over the meltingly tender leeks is made up of just three simple ingredients: a fresno chile (or red pepper flakes if you left the store chileless), some honey, and a good amount of sherry or red wine vinegar. All of these come to a boil and then reduce halfway for about five minutes. The end result is a slightly spicy-sweet and ultra vinegary glaze that will cut through the fatty, starchy, umami-ness of everything else on your overstuffed Thanksgiving plate.The Salsa VerdeAfter the glaze bath, they get a drizzle of pine nut salsa verde of finely chopped parsley for brightness, pine nuts for toasty crunch, capers for a briny punch, and of course, olive oil and a pinch of salt. The nutty, salty, herby bite of this mixture breathes life back into those silky leeks, while complementing the sweet, spicy, acidity of the glaze.So there you have it: Sauces are the key to flavor-packed dishes. So this Thanksgiving I’m thankful for the BA Test Kitchen for teaching me balance, and the power of a good sauce—or two.Get the recipe:Glazed Leeks With Pine Nut Salsa VerdeWhen cooked until tender, doused in a chile-honey-vinegar sauce, and finished with a nutty, herby salsa verde, humble leeks transform into the in-demand side that no one saw coming.View RecipeExplore Bon AppétitThanksgivingFallSalsa VerdeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Emily Schultz"]}