{"id": "20a8a738e56e9b70256cbc5709bbe6fc", "url": "https://www.bonappetit.com/story/instant-pot-love-story", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Is the Instant Pot Worth It? One Professional Chef Makes the Argument For Why He Loves It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI'm a Professional Chef and I'm Proud to Say That I Love My Instant PotWell, there ARE a couple of caveats. By Tyler KordApril 3, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate Buckens FacebookTwitterEmailShopping for, cooking, and eating food can be confusing. So in Unprofessional Advice From a Professional Chef, we ask Tyler Kord (he's the professional chef) the hard-hitting questions.Q: What is your honest opinion on Instant Pots?A: I’m not sure if you have noticed, but the world is in kind of a crazy place right now, and I’m not sure that Instant Pots are really what we need to be thinking about. But my restaurant is closed and I’m not entirely sure what to tell you to think about, and you asked, and I need a break from my three-year-old, so I will just take a quick second to write a much longer article than is necessary to say that yes, I do like my Instant Pot.I am, in general, not super into kitchen gadgetry. I have a tiny kitchen in a tiny apartment and I don’t have a lot of room for stuff. When I first got into cooking I lived in a big apartment in Bay Ridge, Brooklyn, and I bought all kinds of things that I didn’t need, including a grill pan so that I could make food that had lines in it. What is a grill pan for? I mean, I know what it’s for, but why do I need one? Maybe I was doing it wrong, but fundamentally, it’s a pan that you get super hot and then cook food in. It doesn’t produce food that tastes like it was cooked over charcoal or even gas—it just makes food with lines in it.One time I marinated a tuna steak with pomegranate molasses because I saw somebody do it on TV and I left the tuna in the grill pan too long and the pomegranate molasses burned and it was a horrible mess that took forever to clean up and my girlfriend of the time and I still ate it and I can even taste it as I type this. Anyway, Naomi and I broke up (thanks again tuna steak!) and we put all of that kitchen junk out on the street for other people to fill their homes with and it was frankly embarrassing how much useless stuff we owned. And I vowed then and there to be a kitchen purist.For years I kept only the bare essentials in my kitchen: a stock pot, a sauté pan, a half-sheet pan, a rubber spatula, some spoons, and a pair of tongs. I’m a restaurant chef so I use kitchen towels instead of oven mitts, and dishes that involve extra equipment to prepare are things I can, or I suppose could, do at the restaurant if I really needed to scratch an itch.And then at some point in there my mom gave me a stovetop pressure cooker and it improved my life. My two favorite cooking projects have always been, and probably always will be, making stock and cooking beans (and I usually cook the beans in stock!).The act of making stock involves taking a bunch of scraps and garbage and making something that is kind of like lightly flavored water, but that turns into magic with the addition of salt and noodles. (We should talk about water as an ingredient at some point in this column. Does that sound fun? Sorry, I am rambling!) In a pressure cooker, you can cook stock in half the time or you can cook it for the same amount of time you would have otherwise, but under pressure so that it gets super gelatinous and magnificent.You can also make a mean vegetable stock in the Instant Pot.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensAnd beans. Oh my god, beans! I’ve said it so many times before, but cooking beans means buying a bag of rocks for a dollar or two and boiling them into a pot of creamy, beautiful fantasy food that can feed so many people! Beans cooked in a pressure cooker come out like canned beans (in a good way—do not be snobby about canned beans, let this time of hoarding and reflection allow you to see how perfect they are) in that they cook uniformly and break apart less because the pressure keeps them from moving around and falling apart.But while the stovetop pressure cooker was wonderful, there was still something a little terrifying about it. I already have enough issues with having to check that the door is locked six times before I can go to sleep and washing my hands so much that they hurt. The added stress of trying to watch a movie while wondering if I’d left the pressure cooker on too high a flame was a little much for me.And then my wife bought me an electric pressure cooker. I could put a bunch of bones and water in it and turn it on and go to the movies and come home and strain stock. And I could cook beans in the summer without turning on the stove in our hot, tiny Brooklyn apartment. I was sold!And THEN, just a few months ago, I saw a three-quart Instant Pot that was much smaller than my big electric pressure cooker, with all kinds of bells and whistles, and I bought it. I still pretty much just make stock and beans in it, but it’s much easier to get on and off its high shelf. Oh, and it turns out that pressure cookers are awesome for cooking rice. I am in need of constant stimulation, so I buy a different kind of rice every time, and the package directions are always a little bit wrong because there are too many variables to account for. But a pressure cooker eliminates all of that uncertainty, meaning that any amount of rice can be cooked with a ratio of 1:1 rice to water—on high pressure for five minutes for white rice and 15 for brown—with a natural release, and that is neat. The natural release part means you don’t really save much time, but it just comes out so perfect.Gigante beans are no match for the mighty IP.\nChristopher TestaniWhat I do not use my InstantPot for is cooking any kind of magical, super fast meals. I’ve never followed an InstantPot recipe because the idea of putting a bunch of disparate ingredients in, waiting for it to achieve pressure, blasting those ingredients in a high-pressure environment, and then letting it naturally release sounds neither like a time saver nor like an awesome hack for chicken breasts with asparagus. In other words, it’s not a food replicator from Star Trek: The Next Generation. I use it to make components of meals, but it seems unfit to make a main dish, unless that dish is maybe a stew or soup that would normally take a long time.It also has a slow cooker setting but I’m just not a slow cooker person. I do not get slow cookers and I would like to apologize to my mother-in-law, Kathy, who thinks they’re cool. I think Kathy is cool, but I’m not into it. You put food in it, turn it on, go to work (which is terrible, but I am almost starting to miss it, though I still don’t actually miss it), and then come home to that same food that has been cooking all day? But you can’t stir it because you’re at your horrible job? Does it work? I can see soup working because everything is submerged in liquid, but, like, stew? Does that work? I can’t see why you’d want a separate device for unevenly cooking your food while you’re at work.So if you so asked for my honest opinion about electric pressure cookers because you’re considering purchasing a device to give you something to look forward to while you’re at your terrible job, I say skip the fancy gizmos and make pizza dough in the morning and then come home and cook pizza because that’s much cheaper, easier, faster, more appropriate for food that sits out on the counter all day, and I mean, it’s pizza! But if you like DIY-ing yogurt, obliterating leftover chicken bones into stock, making rad beans and perfect rice, or getting in on trends a little bit after they’re trendy, then I say go for it!If you already have an Instant Pot and you love it and you just wanted validation, then I would talk to somebody about that. Seriously, I just started taking anti-anxiety/depression drugs and while the dose is so low and needs time to build up in my system, just knowing that I started the process of trying to feel better is already making me feel way better! And seriously, I could not have started taking that medication at a better time!!Either way, do not try to grill tuna marinated in pomegranate molasses in a grill pan because tuna is not a sustainable food to eat and Naomi and I will be able to taste it wherever you or she or I is at that moment. I'm here for you if you have any more questions—my daughter doesn’t understand what’s going on right now, but I think it makes her feel better when I say, “Daddy has to go to work!” and then go into my bedroom in my pajamas and shut the door.Have a question for Tyler? Email it to eatbasically@gmail.com.Explore Bon AppétitUnprofessional Advice From A Professional ChefInstant PotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-03", "author": ["Condé Nast", "Tyler Kord"]}