{"id": "20aa5fc443992483c841338c47785c80", "url": "https://www.bonappetit.com/recipe/peppery-antipasto-skewers", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Peppery Antipasto Skewers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssuePeppery Antipasto SkewersBy Zaynab IssaNovember 23, 20215.0(10)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman. Food Styling by Alison Attenborough. Prop Styling by Summer Moore. EmailPinterestPrintEmailPinterestPrintInfinitely adaptable, these cocktail-party-friendly antipasto skewers stretch a rib-eye steak into something to serve for a crowd. There’s lots of room to play around with different mixes of proteins, cheeses, and briny bits—just don’t skimp on the black pepper.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Picks$5 At AmazonCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksTongs$13 At AmazonCutting Board$10 At IKEAIngredients4 - 6 Servings11½-lb. boneless rib-eye steak, room temperatureKosher salt1½tsp. coarsely ground black pepper, plus more3Tbsp. vegetable oil8oz. semifirm cheese (such as cheddar or Comté), cut into ¾\" cubes4oz. pickled sweet cherry peppers or peperoncini, cut into ¾\" piecesExtra-virgin olive oil (for drizzling)Flaky sea saltspecial equipmentSix 4\" skewersPreparationStep 1Pat steak dry with paper towels and generously season all over with kosher salt and 1½ tsp. black pepper (or more if you like). Let sit 15 minutes.Step 2Heat oil in a medium skillet, preferably cast iron, over medium-high. Cook steak, undisturbed, until a deep golden brown crust forms underneath, about 3 minutes. Turn over and repeat on second side until browned, about 3 minutes. If steak has a fat cap, stand it on its side with tongs and cook until browned, about 3 minutes (an instant-read thermometer inserted into the thickest part should register 120° for medium-rare). Transfer to a cutting board; let rest 15 minutes. Slice steak against the grain ⅛\"–¼\" thick.Step 3Working with 1 skewer at a time, thread skewer through a strip of steak near a short end. Slide a cube of cheese, then a piece of cherry pepper onto skewer. Thread opposite side of steak onto skewer to close. Push steak, cheese, and cherry pepper snugly against one another to form a compact bundle situated toward the tip of the skewer.Step 4Arrange skewers on a large plate. Drizzle with oil and sprinkle with sea salt and black pepper.How would you rate Peppery Antipasto Skewers?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleExcellent recipe -- fast, easy, tasty, classy. I served it alongside a big salad of greens dressed in a simple vinaigrette. \n\nAddressing another review on here: the recipe states 'lay the steak flat and slice horizonatly (sp)' exactly nowhere. Trolling the comment section for a recipe on an excellent site? Sad indeed.ElenaUSA2/14/2022The people that say slice against the grain should learn what  that means and what the grain is in this recipie they are saying lay the steak flat and slice horizonatly a very dangerous thing .   The grain  on this and most steaks is vertical  , why would anyone that has ever cooked a steak need to be told this . This destroyed any credibility in my mind of your web site  sad ... Get actual knowledge .DrewKingston Ontario 2/12/2022Explore Bon AppétitDinnerStarterSnackSkewerRib EyeCheddarCheeseSteakBeefMeatGluten-FreeNut-FreeKetoChristmasNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}