{"id": "20b5066c4f495523932235ebd02ed43d", "url": "https://www.bonappetit.com/recipe/fresh-fruit-with-cheese-and-peppery-nuts", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Fresh Fruit with Cheese and Nuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueFresh Fruit with Cheese and Peppery NutsBy Carla Lalli MusicFebruary 12, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food Styling by Susie Theodorou, prop Styling by Nina LalliEmailPinterestPrintEmailPinterestPrintThis salad template is all about using whatever’s in season to play three key roles: sweet-juicy fruit, crunchy-salty nuts, and chewy-fatty cheese. We love a mix of clementines, ricotta salata, and pistachios for winter; Bosc or D’Anjou pears, parmesan, and hazelnuts for fall; persimmon, mild blue cheese, and pecans for spring; and figs, honey toasted walnuts, and Manchego for summer. Ideally, let everything sit for 15 minutes before serving, so the fruit juices can mingle with the dressing on the plate. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients4 servings ½cup coarsely chopped nuts3Tbsp. (or more) extra-virgin olive oil1Tbsp. (or more) honeyKosher salt, freshly ground pepper2tsp. (or more) unseasoned rice vinegar, divided6oz. semi-firm, salty cheese1½lb. ripe fruitPreparationStep 1Combine nuts and oil in a small skillet and set over medium heat. Cook, stirring often, until golden brown, about 5 minutes. Remove from heat and mix in honey; season with salt and lots of pepper. Add 1 tsp. vinegar. Dressing should be sweet and fatty and lip-smacky and spiced. Adjust with more oil, honey, salt, pepper, and/or vinegar until you’re pleased.Step 2Break up cheese into pieces or thinly slice, as you wish. Cut fruit into ¼\"-thick wedges or rounds and place on a platter or large plate. Sprinkle with salt and drizzle with remaining 1 tsp. vinegar. Tuck in pieces of cheese; spoon dressing over (heat over low if needed to loosen).How would you rate Fresh Fruit with Cheese and Peppery Nuts?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleUpdate to my previous comment...  We continue to make this for friends and family, and it has affectionately been renamed \"Fruit Nachos\".  Mike T. Brooklyn, NY3/29/2021I've made this multiple times for simple (yet seemingly extravagant) appetizers at dinner parties, and it's been a hit every time.  I've used pears, persimmons, and kiwis (possibly my favorite).  You can pretty much mix and match nuts and cheeses, and you can't really go wrong.  Plus it looks great. Thanks BA!Mike T. Brooklyn, NY1/18/2021Honestly can't believe how delicious this was. Because we don't have figs readily available, I made a version with ripe peaches, a mild blue cheese and pecans. It looks beautiful, tastes amazing and is relatively effortless. Such a great alternative to a cheese board for a dinner party. AnonymousTexas6/29/2019This is SO good!! My combo was pistachios, feta and oranges - I also threw in some baby spinach to bulk it up. The dressing is so delicious and quick to throw together. Definitely going to be making this again, can't wait to try other fruit/cheese combos.AnonymousCanada3/15/2019Explore Bon AppétitSaladCheeseClementineCitrusFruitRicotta SalataRicottaPistachioNutPearParmesanHazelnutPersimmonBlue CheesePecanFigWalnutManchegoSpringSummerFallWinterEasyStarterSideGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}