{"id": "20b782c47c22bb117adfc12f85cce754", "url": "https://www.bonappetit.com/story/draw-outside-lines", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Beef and Bacon Stew, With Substitutions Encouraged | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBeef and Bacon Stew, With Substitutions EncouragedRight now is a good time to draw outside the lines.By Adam RapoportApril 28, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If the past six weeks have taught us anything as home cooks, it’s that recipes are malleable. Substitutions should not only be allowed, they should be encouraged. They help you become a better, more confident cook.We’ve all had to do with fewer trips to the market, and we can’t always access those hard-to-find ingredients that brands like this one sometimes call for. So what did we all do? We adapted and we kept cooking.The other day, I defrosted a pack of Denver steaks I had bought at Dickson’s Farmstand Market in New York City. Imagine a boneless ribeye, and that’s essentially a Denver steak—a six-inch long cylinder, striated with ribbons of marbled fat. Rich, beefy, and delicious.My wife and I seared off two in a cast-iron skillet for dinner, but we had two remaining. A couple days later I got in my head that I would make Basically’s Beef and Bacon Stew, a simplified version of Beef Bourguignon. Nevermind that it called for a couple of pounds of boneless chuck—I figured a hearty cut like Denver steak would bring the same collagen-rich quality to the braise. And because I had only about 10 ounces of steak, I’d just reduce the rest of the recipe accordingly. The fact that I had a leftover, barely half-full bottle of red wine on the counter made the decision that much easier.Want this letter before it hits the website? Sign up for our newsletter!Glug, glug, glug.\nSo in went the bacon until crispy, the chunks of steak seared in the bacon fat, followed by a quartered onion, some smashed garlic and a few carrots. I didn’t have fresh oregano, but I did have some just-picked marjoram that a gardener friend dropped off—close enough. A tablespoon of flour served as a thickening agent, while the wine and a cup of water provided the braising liquid. Into the oven it all went for about 90 minutes.Now, if this were a baking project, I wouldn’t advocate the same this-for-that approach. Baking, as everyone likes to say, is a science. Recipes include all sorts of precise measurements for a reason. But braising, stir-frying, roasting—they’re techniques. Stick with what you know and sub in ingredients as necessary.Ninety minutes later, when my iPhone timer chirped, I was feeling pretty good about my steak-and-bacon stew. And then my wife walked into the house after going for a hike, “Oh my god—what smells so good?!”Recipe (kinda, sorta) followed; mission accomplished.Get the recipe:Beef and Bacon StewYou can call it beef bourguignon if you want to sound fancy—nobody has to know how much easier it is than the French classic.View RecipeExplore Bon AppétitAdam NewsletterRead MoreCoronavirus7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstBy Caroline LangecookingHow to Turn Basically's Focaccia into Focaccia PIZZA!By Sarah JampelcookingMy Favorite (Only?) Way to Escape Right Now Is Making This Seafood ChowderBy Molly BazCoronavirusHow I Threw a Dinner Party in IsolationBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-28", "author": ["Condé Nast", "Adam Rapoport"]}