{"id": "20bc10e90d2f88566a28b569f45f854a", "url": "https://www.bonappetit.com/story/the-future-of-basically", "year": 2020.0, "month": 7.0, "day": 1.0, "content": "Building a Better Basically | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBuilding a Better BasicallyThe changes you can expect to see.By Sarah JampelJuly 6, 2020FacebookTwitterEmailFacebookTwitterEmailOn the first page of her book Vibration Cooking: or, The Travel Notes of a Geechee Girl, anthropologist, griot, and food writer Vertamae Smart-Grosvenor writes, “In reading lots and lots of cookbooks written by white folks [...] there is no reference to black people’s contributions to the culinary arts. White folks act like they invented food and like there is some weird mystique surrounding it.” (Thanks to Samin Nosrat for sharing this.)This was 1970 but the words still hold true today. In the fifty years since, the predominantly white world of food media has not adequately acknowledged the Black community, without whom this country’s food system would not exist. We, Bon Appéit and Basically included, have much work to do.Since its inception, Basically has focused on recipes and cooking advice. But those recipes and that advice have not included nearly enough of the food, cooking wisdom, and voices of Black people, indigenous communities, and people of color. As Smart-Grosvenor goes on to write, “There is no mystique. Food is food! Everybody eats!”So why hasn’t Basically reflected that? The site began as a staff-generated vertical, and given the racial makeup of our staff, that meant the content was often written from a white perspective and for a white audience.We as a staff have made a list of long- and short-term changes that we’re committed to making. One of the most obvious—and impactful—actions on that list is to hire more staffers of color, particularly Black staffers, at BA and in the Test Kitchen. And as we hold ourselves accountable to that goal and more, I hope that establishing long-lasting relationships with more recipe developers and writers will help Basically become a more equitable place—and a site that’s more fun and informative to read and to cook from.Moving forward, there will be many more recipes from outside contributors as part of our effort to amplify and honor a wider range of flavors, ingredients, and dishes on the site. In that spirit, we’re also changing how we source articles. We published a post last week about how to pitch articles for Basically, and my hope is that writers (or enthusiasts!) will send ideas for dishes, ingredients, and cooking techniques that they want to see, especially those that we haven’t done a sufficient job of presenting in the past.The commitment we're making is forever, not just for now, and I’m available (sarah_jampel@condenast.com) to field your concerns, questions, and ideas.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-05", "author": ["Condé Nast", "Sarah Jampel"]}