{"id": "20bf0a7cb9337aa14c24af13db66415c", "url": "https://www.bonappetit.com/story/french-moisturizer", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Embryolisse Lait Creme Concentre Keeps My Skin Soft All Winter Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis French Moisturizer Keeps My Skin Soft All Winter Long It's the ideal cold weather moisturizer, shielding against the blistering wind and overheated office buildings.By Elaheh NozariNovember 15, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I bought Embryolisse Lait Crème Concentre for the first time in 2011, when I lived in Paris for a year and spent all my babysitting money on French creams that I read about on blogs but had no use for. When I got home to New York, I put it in my medicine cabinet and didn't use it until 2014, the year my skin became the worst version of itself and I went on Accutane. For six months, I popped three pills a day that obliterated my acne but made my skin drier than a desert.The only moisturizer that worked for me during that time of peeling skin and chapped everything was Embryolisse, whose thick, globby-in-a-good-way texture made my face as soft as a baby's. My skin is less sensitive now, but I still buy a new tube every winter and apply a pea-sized amount right after I shower in the morning. It's the ideal cold weather moisturizer, shielding against the blistering wind and overheated office buildings that wreck havoc on my skin. —Elaheh Nozari, associate director of affiliateBuy it: Embryolisse Lait Crème Concentre, $28All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThe Bar Soap That's Saving My Skin This FallBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-15", "author": ["Condé Nast", "Elaheh Nozari"]}