{"id": "20ca28743c1c90d863c1721b2aac503f", "url": "https://www.bonappetit.com/story/umami-cafe-grain-bowl", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "At Cafe Umami, the Grain Bowls Are Built By a Microbiologist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Build the Healthiest Grain Bowl, According to a MicrobiologistAt Cafe Umami in Oakland, Sungsoon Park brings science to his bowl-centric menu.By Flora TsapovskyJuly 18, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailGrain bowls have become as ubiquitous as avocado toast. Hearty and colorful, they woo the belly and the eye with seemingly endless options for toppings, sauces, sprinkles, and drizzles. Sungsoon Park, the co-owner of Cafe Umami in Oakland, isn’t much for eye candy, however. A trained microbiologist, he creates bowls that, as chaotically beautiful as they are, serve a higher—and more healthful—purpose.The grain bowl, eight versions of it in fact, is the backbone of Cafe Umami, a small spot that opened nine months ago in a part of Oakland without a lot of healthy food options. Park moved to the U.S. from South Korea in 2001 and made his way from a post-doctorate and a research position at UC Berkeley to a career in biotech. In 2015, freshly laid off and going through a divorce, he started working in the kitchen of Manpuku, the Berkeley restaurant known for its fair-priced sushi. Inspired by the hard work and the fast pace, Park went on to study nutrition at Bauman College and eventually, after stumbling on an affordable storefront in Oakland’s Dimond District, opened Umami with business partner Sang Lee.At Umami, Park riffs on all-day cafe breakfast and lunch staples, adorning toasts and bowls with Japanese and Korean toppings and favoring fermented and umami-packed ingredients. The grain bowl, according to Park, is the ultimate symbol of whole eating. “No need to swallow vitamin pills,” he says. “I’ve worked for those companies. Trust me: Just eat better.” Here’s how Park builds the platonic ideal of a healthy grain bowl.The Non-NegotiablesSomething fermented. Park uses sauerkraut, with the occasional addition of kimchi or tofu. “Fermented products have tons of probiotics in them, great for digestion” he says.Root vegetables. Park opts for pickled burdock root but suggests that home cooks to try sunchokes, sweet potatoes, lotus root, or even carrots, always roasted, never fried. “The root has soluble fiber, which is ideal for feeding the sauerkrauts’ microbiome, helping it work better in our body,” Park says.Whole grains. “Always opt for whole, since they’re easier to digest and have lots of fiber,” says Park. “I like brown rice because it’s affordable.”The AdditionsVegetables: Park likes to add kale, which is mineral and vitamins-rich, and cremini mushrooms for that umami kick and a helping of beta glucan, a natural cancer-fighter.Protein: To his customer-favorite Umami Bowl, Park adds omega-3-rich sardines and feta or cotija cheese, which both have enzymes that aid digestion. Other bowls include protein options like roasted chicken or tempeh. “These are awesome if you want a protein-fortified bowl,” he says.The sauce: To tie it all together, Park tested numerous sauces before arriving at the velvety tahini-ginger number that appears in all his offerings. “Sesame is a great source of good oil, and it’s mild enough to let the other ingredients shine.”While the grain bowl is quite forgiving in terms of combinations and additions, temperature is key. “Never microwave your bowl,” he says, “as it would kill the nutrients.” For the ultimate warm-yet-healthy effect, he suggests pre-cooking your rice and keeping it in a rice cooker on the “warm” setting. Alternatively, you can put the rice, covered in foil, in a preheated oven, and keep it on low temperature until serving. When the bowl is about to be served, layer the rice at the very bottom, top with room-temperature toppings, and drizzle with fridge-cold sauce. Park would tell you to eat slowly and chew carefully for proper digestions, but he’ll understand if you can’t hold back.Here's some more grain bowl inspiration:Spicy Tofu with Pickled Shiitake MushroomsHow to prevent tofu from being bland? Toss it in a robust, spicy, salty, and deeply seasoned marinade.View RecipeExplore Bon AppétitHealthyishWhole GrainGrainsLunchRead MorecookingA Spicy Pork Tenderloin Bowl That's So Easy You Hardly Need This RecipeBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-18", "author": ["Condé Nast", "Flora Tsapovsky"]}