{"id": "20d4b871e957a4ff0242ef71b81bb356", "url": "https://www.bonappetit.com/story/chong-qing-xiao-mian-cold-spicy-noodles", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "The Spicy Noodles That Make My Nose Run, My Eyes Water, and My Heart Yearn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Spicy Noodles That Make My Nose Run, My Eyes Water, and My Heart YearnWhy Chong Qing Xiao Mian’s house cold noodle is always my first meal in San Francisco.By Elyse InamineApril 25, 2019FacebookTwitterEmailImage Courtesy of Chong Qing Xiao MianFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m a creature of habit, especially when it comes to my first meal after a long flight from New York City to San Francisco. Sure, I could try something new (it’s my job!), but why would I when I know I’ll be grumpy, hungry, jet-lagged, and have already decided that I’m going to the same place for the same thing that always cures my grumpy, hungry, jet-lagged state: the house cold noodle at Chong Qing Xiao Mian.Instagram contentThis content can also be viewed on the site it originates from.The three-year-old Sichuan standby from Z&Y veterans Jenny Wu and Truman Du does not have A/C, quick water refills, or any defining ambiance besides dark-wood veneer. But that’s not what I’m here for. I’m here to recover from the chaos of flying coach with a noodle dish that wakes me up from my plane-induced stupor with sinus-clearing Sichuan peppercorns and fruity, fiery chile oil. The heat runs through the porky, ragu-like sauce that crowns a tangle of chewy, thin, extra-soft mixian noodles. Cool, crisp cucumber sticks tame the spice, and a snow cap of bright cilantro and toasted peanuts add some textural crunch and herby depth. After a vigorous stir, you get the perfect bite: nutty, meaty, grassy, and nose-running-ly spicy. It’s the best—and only—San Francisco welcome I could ask for.Go there: Chong Qing Xiao MianExplore Bon AppétitHighly RecommendRestaurantsSan FranciscoRead MorerestaurantsI Tried Everything to Fill the Beef Noodle Soup–Shaped Hole in My Heart, and Then I Found This PlaceBy Elyse InamineWhere to eatHow to Spend a Big Fat Weekend Eating All the Pastries in San FranciscoGallery12 SlidesBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Elyse Inamine"]}