{"id": "20e0cdb9e6c41fea63e93aafcc525ed0", "url": "https://www.bonappetit.com/story/favorite-bottles-we-drank-2019", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "These Are the Best Bottles We Drank in 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Are the Best Bottles We Drank in 2019 Sake? Beer? Wine? Vermouth? Yup, we drank it all. By Alex DelanyDecember 20, 2019FacebookTwitterEmailPhoto by Laura Murray, styling by Allie WistFacebookTwitterEmailWe drank a lot of phenomenal things in 2019. New drinks. Classic drinks. Widely available drinks. Small-batch drinks we had to travel thousands of miles for. Bottles of sake and wine and beer. Bottles of obscure botanical liquor and local coffee amaro. Stuff we really liked. And stuff we loved. And in the year-end spirit (ha, see what I did there?), we decided to declare some of them our favorites. No offense to all the other bottles we bought and drained this year, but these hit the top of our list.Photo by Laura MurrayKamoizumi Nigori Ginjo 'Summer Snow' Unfiltered Sake“For an embarrassingly long time, I thought I didn't like sake. Not even my little brother—who speaks Japanese, is really into anime, and spent months living in Osaka—could convince me otherwise. I’d been scarred by the Ru Sans sake bombs of yore. But then I visited Decibel Sake Bar in Manhattan and learned about the magic that is cloudy sake, more commonly called Nigori. Kamoizumi Nigori Ginjo 'Summer Snow' Unfiltered Sake from Hiroshima was the sake that made me realize what an idiot I'd been: a rich and creamy number with hints of sweetness and funk that was easy on the tum and delicious on the palate. This one is still my favorite, but it opened the door to a whole world of sakes, cloudy and clear, that I’ll never even dream of plunking into a glass of beer.” —Hilary Cadigan, associate editorPhoto by Laura MurrayPartida Creus Muz Vermut“This year I spent my birthday in Barcelona, so this was definitely the year I got deep into Vermouth. Served with an ice cube, an orange wedge, and a bright green olive, Partida Creus' red vermouth is perfection in a bottle. It's sweet without being syrupy, cavity-inducing, or cloying. And if it weren’t good enough already, it comes in a pretty bottle, perfect to display at parties, from the time you pop the cork to the time you drain the last drop.” —Emily Schultz, social media managerPhoto by Laura MurrayDrie Fonteinen Oude Gueze“The first time I had this was around the campfire with my buddy (and very talented brewer) Dan Suarez. He grabbed this bottle from his collection, and its perfect balance of tartness, funk (from the spontaneous fermentation), maintainable ABV, and easy finish absolutely blew me. Drie Fonteinen Oude Gueze a perfect beer. Someone’s got to get me to their brewery in Belgium to film an episode of It’s Alive. Who do I talk to about that?” —Brad Leone, host of It’s AlivePhoto by Laura MurrayLurisia Chinotto“I don't drink much, but when I first tasted this caramel-colored bitter Italian soda, I thought I was sipping an amaro-forward cocktail. That’s because the source of its flavor—the chinotto fruit—is also a key ingredient in many amari. Refreshingly bitter, but not too intense to sip like soda, it has a warm fragrance of cinnamon and clove and the sourness of rhubarb, quince, and grapefruit (i.e. all of my favorite fruits). Imagine a cream soda that’s been stripped of all of its unnecessary sweetness and bolstered with a hit of citrus and spice. You could mix chinotto with spirits for a cocktail, but I just store it in the fridge and pull it out when friends are pouring something boozy. I get to pretend I’m Italian and satisfy my craving for a sophisticated drink.” —Sarah Jampel, Basically editorPhoto by Laura MurrayForthave Spirits Brown“Let the record show: Forthave Spirits has officially made me a coffee liqueur convert. The Brooklyn-based botanical spirits brand makes a fleet of aggressively herbal offerings, from aromatic amaro to surprisingly juicy gin, but I can't stop thinking about “Brown,” a brand-new collab with local roaster Café Integral. It's eons away from the ultra-sweet, oddly-thick coffee liqueurs you may have had before, using cold brew made from anaerobically fermented Pacamará beans, grown by Don Sergio Ortez in Northern Nicaragua. We're staring down the barrel of a long winter, but with a bottle of this on my bar cart, I have plenty of bait to lure over friends when the forecast is grim.” —Aliza Abarbanel, assistant editorPhoto by Laura MurrayPeychaud’s Bitters“I did a lot of no-to-low-abv drinking this year, and my go-to drink has become seltzer, bitters, and lime. So many bars make their own bitters, or buy small-batch bitters from interesting producers, so it’s a good way to feel like you are taking in some of the character of the place without actually drinking. But more often than not, I’ve found myself reaching for Peychaud’s, a classic brand from New Orleans with a smooth, warm, herbal flavor. A Peychaud’s and seltzer combo is really refreshing, drinkable, and aromatic—so much so that you can sip it slowly like an old fashioned. I added lime in the warmer months, and go without now that it’s colder. Choose your own adventure.” —Priya Krishna, contributing editorPhoto by Laura MurrayNegra Modelo“The best thing I drank in 2019 was a giant goblet of Negra Modelo at Bar La Faena in Mexico City. I was sitting on a plastic lawn chair around a plastic table with the people I love the most, surrounded by faded bullfighting memorabilia. In the center of the room teenagers were dancing by the jukebox, a waiter would drop off crispy, cheesy quesadillas without warning, and that beer was so cold and so sweet.” —Alex Beggs, staff writerPhoto by Laura MurrayFermentery Form Fooz“It's weird that no one ever asks what your last drink on earth would be. It's always about the meal. But if that were a thing, one of my last drinks (there’d be a lineup, duh) would be a bottle of Fooz from the Philadelphia brewery Fermentery Form. It's a mixed fermentation wheat beer aged on LOTS of peaches, and it tastes like slices of juicy peach and crunchy cantaloupe rolled around in Sour Patch Kids dust. Not that I’ve ever done that...but you get it. Plus, it’s only 5 percent ABV, which makes it totally drinkable. An important characteristic, even if it's your last drink on earth.” —Rachel Karten, associate director of social mediaPhoto by Laura MurraySubject to Change Moon Juice“You know when something just feels fated? Meant to be? Kismet? Yeah, well that's how I felt about my first taste of Moon Juice, a carbonic red from Subject to Change winery in California. It was the end of summer, and I was scouring the menu at my favorite local (June!) for something chilled and chuggable that still gave me something to think about. The bottle I’d settled on was sold out, the server said. But there was something they just got in—so new it wasn't even on the menu yet: a Zinfandel-Syrah blend from Mendocino County. It was the right call. Zippy and bright, with some good structure to ease us into fall, it was exactly right for the moment, and really, for the whole dang year.” —Sasha Levine, senior editorPhoto by Laura MurrayDestileria Andina Matacuy“I know how pretentious this is going to sound, but an Andean digestif...made from botanicals...extracted in distilled sugar cane...in a small Peruvian village called Ollantaytambo...called Matacuy was the best thing I drank this year. Yeah, I know. Served in a glass with a single ice cube, Destileria Andina’s Matacuy tastes the way that walking through a tropical jungle feels: lush, vegetal, earthy, humid. It’s a spirit that takes the best parts of mezcal (green grassy flavor), rum (complex sweetness), and amaro (distinct bitterness) and combines them harmoniously. And as for the name, Matacuy means to kill the guinea pig, a reference to the Andean tradition of drinking the stuff to revive yourself after eating too much spit-roasted guinea pig. And that is something I can certainly appreciate.” —Alex Delany, associate editorWhat about our favorite places to eat in 2019? Right this way:The 24 Restaurants We Couldn’t Stop Talking About in 2019(And that we’ll definitely be still thinking about in 2020.)View StoryExplore Bon AppétitWineBeerLiquorVermouthCoffeeBittersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-20", "author": ["Condé Nast", "Alex Delany"]}