{"id": "20e4b8af07848136a89c5cae969c51c8", "url": "https://www.bonappetit.com/story/is-it-snowing-where-you-are", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Is It Snowing Where You Are? If So, Make This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Snowing Where You Are? If So, Make ThisA new stew recipe and more highlights—and lowlights, honestly—from the week at BA.By Alex BeggsFebruary 9, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailMake thisAre you in a snow day state? Or just experiencing the season of “winter”? Whether you’re happy to miss work or going stir crazy with potty-training toddlers that demand your every ounce of potty patience (Hi Sarah!), I have the perfect snow day recipe for ya. This Andy Baraghani Signature™ lamb tagine can be made in a Dutch oven, and it will make your entire home smell incredible—lamb, cumin, garlic, but also raisins and cinnamon. It’s savory and a little sweet, and the only work you need to do is brown the lamb properly before adding everything else in. It’s even better with a side of Andy’s crispy baked rice, tachin.Get the recipe: Spiced Lamb TagineMa’am, what’s in the bagI was in Peru recently (!) and brought back a duffel bag full of treats: freshly roasted coffee from Three Monkeys and Neira Café Lab, crunchy cacao nibs, three bags of popped kiwicha (a grain smaller than quinoa), bags of different colored quinoa, purple corn meal I have no idea what to do with yet, choclo (the big corn), and chulpe (long corn kernels to pop and make the best beer-drinking snack with). At customs at 3 a.m., the agent asked me what I’d brought home with me. “Food!” I said. “What kind?” “Quinoa.” “What’s that?” “A kind of cereal?” And he waved me on my way.Amiel’s head in Jell-OThis week we learned that Basically editor Amiel Stanek has seen Blue Man Group three times, which, if you know Amiel, makes complete sense. Once he was even chosen to be the guy pulled on stage, where the Blue Men dug out his head from inside a block of orange-colored Jell-O. Wow.Sometimes dinner isn’t that goodWhile avoiding writing magazine text that’s on a strict deadline, editor in chief Adam Rapoport likes to roam the office and sit in staffer’s vacant chairs, tapping on his laptop as if every key is stuck with honey. I ’ M  R E A L L Y  W O R K I N G is what the tap tap tap sounds like to me. Sometimes he’ll sit behind me and I imagine it must be hard to share a chair with Harvey, the giant pooka who normally sits there. This week we discussed when dinner isn’t that good. You’d think people who work at a food magazine are always making these gourmet dinners with the proper serving side of vegetables, but really they don’t. Adam had a disappointing, watery pot pie from a grocery store freezer aisle. Alex Delany chimed in that he’d sautéed up some mushrooms, garlic, cherry tomatoes, and kale—“it was aggressively mediocre,” he admitted. “I ate leftover super bowl onion dip with stale chips and baby carrots for dinner on Tuesday,” sighed Hilary Cadigan. Sounds pretty good actually. “I bought a frozen salmon in a single-serving package with a little spice pack and it didn't fully defrost,” said Amanda Shapiro. “But I ate it anyway.”Unnecessary food meme of the weekWow, that’s a lot of likesElyse Inamine was in L.A. recently and had to stop by Konbi, the trendy Japanese restaurant whose egg salad sando is the 2019 version of a Roberta’s pizza: Instagram GOLD. Sure enough, her pic of the symmetrical yolk-centric sandwich racked up nearly 800 comments from readers ooing and aahing. “What’s the deal with this sandwich?” I asked Elyse. She leaned back in her chair and sighed, “It’s sooo gewwwwd.” But really, explain this to me. “It’s squishy, yolky, and a little mustardy, all the things you want in an egg salad sando. I drove in the torrential downpour TWICE to get it.” Wow. “But one of the comments was about how my thumb looks gross. That hurt.”Unnecessary food feud of the weekIn a meeting about kitchen tools, a startling revelation about who believes in salad spinners, and who doesn’t, caused staffers to yell and pound the conference room table. I’d never before seen a look of horror like the one that passed over Sarah Jampel’s face when she heard that so many people don’t use them. At least five people raised their hands proudly to announce their anti-spin stance. “DO YOU LIKE WET SALAD?” asked an exasperated Amiel. Julia Kramer insisted she “hates water on lettuce” but washes her greens ahead of time, leaves them on towels to dry, and has perfectly dry lettuce. “I don’t even clean it and I’m here to tell the tale,” said Emily Schultz with the blind confidence of someone with undiagnosed E. coli. “The spinner gets dirt off in such a satisfying way,” pleaded Amanda Shapiro. “It’s never dry,” whispered Julia from across the room. “I don’t own one, but I believe in them,” said diplomatic Aliza Abarbanel, who admitted she “never knows what to do with the dirt” on the bottom of the bowl she uses to wash. “You know what you do, you USE A SALAD SPINNER!” said Amiel, rising out of his chair in anguish. “You have a colander?” said anti-spinner Carey Polis, her voice getting higher and higher pitched, “wash the lettuce in there!” The discussion derailed to herbs and what really needs to be washed, and everyone found common ground on one thing: ALWAYS WASH LEEKS.Etiquette questions?Do you have any food-related travel questions for me? Email staff.bonappetit@gmail.com and let me know!Explore Bon AppétitBeggs NewsletterRead MorecultureThe Miso Eggs from ‘Salt, Fat, Acid, Heat’ Are a Pretty Cool Party TrickBy Alex BeggscultureHow Do You Tell Mark Zuckerberg the Goat Is Cold?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-09", "author": ["Condé Nast", "Alex Beggs"]}