{"id": "20f906952892e112502eb2fdc5c485e9", "url": "https://www.bonappetit.com/recipe/no-brainer-corn-salad", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Grilled Corn Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueNo-Brainer Corn SaladBy Andy BaraghaniJune 21, 20194.6(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSweet summer corn begs to be mixed with a splash of acid, a touch of heat, salty cheese, and toasty nuts for texture. This recipe is definitely a choose-your-own-adventure. Use whatever you like or have on hand!Ingredients6–8 servings½cup nuts (such as peanuts, hazelnuts, or pistachios)6ears of corn, in husk1serrano chile, thinly sliced, or 1 tsp. fresh ground black pepper or mild red pepper flakes1cup herb leaves (such as cilantro, basil, or mint), torn if large⅓cup fresh citrus juice or vinegar3oz. cheese (such as Cotija, Parmesan, or feta)⅓cup grapeseed or other neutral oilKosher saltPreparationStep 1Preheat oven to 350°. Toast nuts on a rimmed baking sheet, tossing halfway through, until golden brown, 6–10 minutes, depending on the nut you choose. Let cool; coarsely chop.Step 2Prepare a grill for medium-high heat. Grill corn, turning occasionally, until husks are charred in most spots, 16–20 minutes. Transfer to a platter and let sit until cool enough to handle. Shuck corn and remove kernels (you should have about 6 cups).Step 3Toss nuts, corn, chile or pepper, herb, citrus juice or vinegar, and cheese in a large bowl to combine. Drizzle oil over and season with salt; toss again.How would you rate No-Brainer Corn Salad?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleHow does the corn get charred like in the picture if you grill it in the husk? Attjack8/12/2021I’ve made this so many times, it’s definitely a go-to when I’m having guests or bringing a dish to a party. I typically go for hazelnuts, cotija, a combo of lime juice and champagne vinegar, Italian parsley and mint, and a jalapeño or Fresno chile instead of a serrano. It’s the perfect bite of summer flavor all in one spoonful! AnonymousCA7/25/2021Love this! Then again, I love roasted summer corn in most any form. Made this pretty much faithful to the recipe as written, with pistachios and feta. We had basil & mint in the garden and cilantro in the fridge. Juiced a lime for the citrus. One change in the prep seemed like a no-brainer to me (pun intended): it's summer here, and hot! - great for fresh corn but not so good for heating up the oven (and the kitchen) just to roast some nuts. Once the corn was finished grilling, I simply turned off the gas flame and put the pistachios in there on some aluminum foil for ~ 5 minutes. Perfect, and didn't let that leftover heat go to waste.kenppdxPortland, OR6/27/2021Used pistachios and feta. Also roasted some of the corn in the oven. Delicious.AnonymousBirmingham, MI5/31/2021Delicious. Used frozen corn kernels by baking them in the oven at 400 degrees for 30 minutes (& seasoning them with salt, pepper, paprika, & 1 tbsp of salt). Added a little lemon for some extra brightness. AnonymousNew York3/15/2021Fantastic! I had this with some pan-fried shrimp and it was so fresh and delish. emmatoHong Kong8/2/2019So simple, so flavorful! I used pistachios, feta, cilantro, and lime. Tastes like summer!AnonymousNew York 7/15/2019Holy cow was this good! I can see trying different herbs etc but it was lovely as is. I let the peppers & about half of the cilantro hang out in the lime juice while I did the other prep & it amped it up a little! ladydei775177Capital DistrictRegion7/8/2019Yes yes yes. I used cotija and peanuts, and my guests were freaking out about how good this was. It's a new staple! AnonymousSaint Louis, MO7/8/2019So good!!!!!   Used pine nuts and feta. We finished it before dinner....couldn’t wait. Lol AnonymousPortland,Oregon7/7/2019THIS WAS KILLER! My whole family of 9 loved this so so much. It was a perfect side dish with the Party Steak with Salsa Verde from you guys. Thanks Andy!ilacosseMinnesota6/27/2019Explore Bon AppétitSaladCornVegetableSerrano ChileChileHazelnutNutPistachioCotijaCheeseFetaSummerQuickEasySideGluten-FreeVegetarianGrillingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Andy Baraghani"]}