{"id": "210a66e8af1b5e7a15da3a830116a17d", "url": "https://www.bonappetit.com/recipe/cheesy-apple-pepper-scones", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Cheesy Apple-Pepper Scones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCheesy Apple-Pepper SconesBy Yewande KomolafeNovember 15, 20183.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintThese salty-sweet scones are spiked with a bright spicy note of black pepper and are as delicious alongside a baked ham or roast beef as they are with a platter of scrambled eggs. They are always welcome on a table! This recipe is presented to you by Samsung.IngredientsMakes 321cup (2 sticks) unsalted butter, cut into pieces½cup sugar1medium Granny Smith apple, peeled, cored, cut into ½\" pieces1cup cake flour2tsp. kosher salt1½tsp. baking powder1½tsp. freshly ground black pepper¼tsp. baking soda2¼cups all-purpose flour, plus more for dusting4oz. crumbled fresh goat cheese or finely grated sharp cheddar1¼cups cold heavy cream, plus more for brushingPreparationStep 1Chill butter in freezer until very cold and hard, 15–20 minutes.Step 2Meanwhile, spread sugar in a medium skillet and cook over medium heat, stirring occasionally from the outside edge toward the center, until sugar melts, about 3 minutes. Continue to cook, swirling pan occasionally, until syrup turns deep amber in color, about 3 minutes more. Carefully add apples to pan and spread in a single layer. Remove pan from heat and let sit until apples release some juices, absorb the caramel, and cool, about 30 minutes. Some sugar will crystallize, don’t worry, it’s supposed to!Step 3Preheat oven to 400˚. Scrape apples into a fine-mesh sieve to drain excess caramel.Step 4Pulse cake flour, salt, baking powder, pepper, baking soda, and 2¼ cups all-purpose flour in a food processor to combine. Add frozen butter and pulse until butter is in large pea-size pieces. Do not overprocess—visible pieces of butter will result in light, flaky layers.Step 5Transfer dough to a large bowl. Add drained apples and cheese. Mix with a rubber spatula to combine. Form a well in the center and pour in 1¼ cups cream. Mix with spatula until cream is incorporated and flour is hydrated but dough is still shaggy.Step 6Turn out dough onto a clean work surface and press together with your hands just until it forms one rough piece. Do not knead. Lightly dust work surface and dough with flour. Roll dough to an 8x8\" square. Using a sharp knife, cut dough into quarters (four 4x4\" squares), then cut each quarter into four 2x2\" squares. You should have 16 squares. Cut each square in half on a diagonal to make 32 triangles. Transfer to a parchment-lined rimmed baking sheet, spacing 1\" apart. Brush tops with cream.Step 7Bake scones, rotating pan halfway through, until tops are light golden brown, 18–20 minutes. Serve warm or at room temperature.Step 8Do Ahead: Unbaked scones can be formed 1 week ahead. Tightly wrap with plastic and freeze. To reheat, brush with cream as instructed and increase bake time to 20–25 minutes.How would you rate Cheesy Apple-Pepper Scones?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGood ideas in the recipe, but several problems as written:\n1) cooking that amount of sugar in a skillet on medium heat brings it to the “hard ball” stage so it cannot coat the apples. A better method is to initially toss the apples with the sugar, then cook and stir on low for 3-4 minutes until apples are coated with caramel.\n2) rolling that amount of dough to an 8x8 inch square will result in dough 2 1/4 inches high (before cooking!) which would not cook properly. The recipe as written should be rolled into TWO 8 inch squares.\n3) scones without eggs are called BISCUITS \nSamsung should stick to making electronics.Los Angeles 9/8/2019Explore Bon AppétitSconePastriesAppleFruitGoat CheeseCheeseCheddarSnackSideNut-FreeBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Yewande Komolafe"]}