{"id": "210b14158a5a48d977ad46c73375d6f7", "url": "https://www.bonappetit.com/recipe/green-goddess-chicken-thighs", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Green Goddess Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGreen Goddess Chicken ThighsBy Andy BaraghaniJuly 6, 20214.6(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintOn the list of truly versatile sauces, green goddess ranks high in my book. Here it acts as a marinade for grilled chicken thighs, which are punctured with a sharp knife to make sure the marinade penetrates all the way through and to increase surface area for more even charring on the grill. I like to go with skinless, boneless thighs, since they’re forgiving on the grill (no skin to get stuck on the grate!). Once they’re done grilling, finish the dish with extra green goddess. Feel free to go wild with whatever tender herb or dairy product you have on hand, just don’t skip the anchovies: They will make the chicken more savory, delicious, and, well, more chicken-y. —Andy BaraghaniAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCharcoal Grill$98 $82 At Amazon16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonMicroplane Grater$16 At AmazonIngredients4 Servings4oil-packed anchovy fillets2garlic cloves, smashed3(heaping) cups mixed tender herbs (such as dill, parsley, cilantro, basil, mint, tarragon, and/or chives), plus more for serving¾cup plain whole-milk yogurt, sour cream, or buttermilk3Tbsp. extra-virgin olive oil, plus more2lemons, dividedKosher salt, freshly ground pepper1½lb. skinless, boneless chicken thighs, patted dry3medium radishes, trimmed, thinly sliced into roundsPreparationStep 1Combine anchovies, garlic, herbs, yogurt, and 3 Tbsp. oil in a blender. Finely grate zest from 1 lemon into blender. Cut lemon in half and squeeze juice into blender; purée until smooth. Season dressing with salt and pepper.Step 2Pour half of dressing into a large bowl. Using a knife, make 3 short shallow slits across smoother side of chicken thighs (this will help the marinade penetrate quickly); season with salt. Transfer chicken to bowl with dressing and toss to coat with tongs. Let sit at room temperature at least 30 minutes, or cover and chill up to 12 hours. If chilling, let chicken sit at room temperature 1 hour before grilling.Step 3Prepare a grill for medium heat; lightly oil grate. Remove chicken from marinade, letting excess drip back into bowl, and grill, turning every minute or so, until cooked through and beginning to char in spots, 8–10 minutes. Transfer chicken to a platter and let rest 5–10 minutes before serving.Step 4Cut remaining lemon into wedges. Arrange radishes and more herbs over chicken; drizzle with a little oil and season with salt and pepper. Serve with lemon wedges and remaining dressing.How would you rate Green Goddess Chicken Thighs?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMeh. Nothing special. Basically garlic chicken. I used basil and parsley, maybe tarragon would have given it more taste. AnonymousChicago 8/24/2021This packs a flavor punch! It was a great way to use the herbs I have in my garden, and was SO good. I used bone-in, skin-on thighs, and it worked just fine. Don't skip the anchovies! You don't really taste them, but it adds an essential flavor to the sauce. This is really easy and really good.BA fan!Chicago, IL8/9/2021Fantastic recipe! Made it exactly as is and used mint, basil, chives and cilantro and the dressing was incredible - do not omit the chovies. I'm not a big anchovy fan on their own, but they blend right into the sauce and gives it a little extra oomph!Olivia WColumbus, OH8/3/2021Great recipe with a lot of flavor and a super easy prep. I used tarragon, basil, parsley, and dill. I doubled the recipe since firing up charcoal is more work. We ate it as a salad over romaine with the chopped chicken, some persian cucumbers, radishes, herbs, and the dressing with a little added lemon juice. Since I doubled it I had extra chicken and dressing and made the same salad for lunch the next couple of days as well. My grill timing is always off from BA recipes for some reason so I recommend just using a meat thermometer instead. SarahBerkeley, CA7/19/2021Damn good. I used big wads of mint, basil, and cilantro, and the sour cream. Cooked them in the microwave. Just kidding. Grilled over hardwood charcoal—briquettes don’t get hot enough for my purposes! Sauce is absolutely outstanding, very zesty, and yep the anchovies are a must. I wouldn’t slit the meat next time. Boneless skinless thighs are already pretty cut up and need careful handling on the grill as it is. Plus they have plenty of surface area. Also I’d double the recipe because these are going to make great leftovers!PaulTexas7/15/2021Fantastic recipe. I used basil, mint and tarragon from the garden, and the herb flavors really come through.  Too hot to fire up the charcoal grill so I cooked them in a convection over for about 20 minutes, flipping them over half way through. I will definitely make this again.Charlotte757/14/2021Explore Bon AppétitAmericanChicken ThighChickenPoultryButtermilkOther IngredientsDillHerbs & SpicesParsleyCilantroBasilTarragonChiveMintSpringSummerEasyWeeknight MealsMainGluten-FreeNut-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Andy Baraghani"]}