{"id": "210fcdc11d6bc8b5c9206c51e6f86388", "url": "https://www.bonappetit.com/story/we-love-fritos", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Fritos are a Store-Bought Snack You Shouldn't Attempt to Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen It Comes to This Snack, Store-Bought Is Better Than HomemadeYou can't beat them so you might as well embrace them.By Sarah JampelJanuary 14, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat BoytsovaFacebookTwitterEmailI'm no Claire Saffitz, but I did recently try to make snack food at home. I cut stale tortillas into thin strips, heated an inch of oil in a high-sided skillet, cooked them until deep golden-brown, then fished them out and gave them a generous salt shower. As I submerged one handful into a bowl of bean soup then crumbled an even larger portion on top, I anticipated the chips’ salty snap. But instead, they were bland and quick-to-sog, which left me wondering, “Why hadn’t I just bought a bag of Fritos in the first place?” Fritos, I realized, had been the goal all along.Consistent in taste, texture, and availability, Fritos contain only three ingredients (corn, salt, oil), which puts them high on my personal list of almost-not-processed processed snack foods (hey, I tell myself what I want to hear).I know Fritos are well-seasoned because they make the edges of my lips dry out and they demand a glass of water between handfuls. I know Fritos are crunchy because they're sturdier and thicker than most tortilla chips, holding up even when mounded with a pile of chili, Frito pie-style. I know they're reliable (and, um, mass-manufactured) because they taste exactly how I remember they taste every time I taste them. And I know they're irresistible because when I brought a couple bags into the Test Kitchen to officially develop a vegetarian chili recipe, people couldn't—and wouldn't—stay away, even when I insisted that I needed them. (When these people caught me snacking, this became a little awkward.)So yes, you could substitute your favorite tortilla chips in this soup or fry up your old tortillas on the stovetop. Or, you could accept that Fritos are better than anything you’ll concoct at home. They give body and flavor to the soup and produce something between bean chili, frito pie, and tortilla soup—a very fine combo, if you ask me. Sometimes store-bought is best.Get the recipe:Vegetarian Chili With Lots of FritosQuick, spicy, filling, and made mostly of pantry ingredients, this chili/tortilla soup/frito pie mash-up is calling your name. (Shhh. Listen closely.) View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-14", "author": ["Condé Nast", "Sarah Jampel"]}