{"id": "2120021a7ef367656b36359660dbecec", "url": "https://www.bonappetit.com/recipe/jalapeno-honeydew-hot-sauce", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Jalapeño-Honeydew Hot Sauce Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishJalapeño-Honeydew Hot SauceSponsored by VitamixFacebookPinterestTwitterEmailJerrelle GuyTry making your own fermented jalapeño-honeydew hot sauce and add a delicious kick to a variety of dishes.PrintIngredients.35 lbs. honeydew meat (about 1 cup).35 lbs. of organic green seeded jalapeños (about 5 jalapeños)1 seeded habanero pepper¼ cup distilled white vinegar2 small or 1 large garlic clove(s)1 tsp. brown sugar¼ tsp. saltRecipe PreparationChop the honeydew, jalapeño, and habanero peppers finely. Add to the Vitamix Personal Cup Adaptor along with white vinegar, garlic, brown sugar, and salt.  Attach the Personal Cup Adaptor to the Vitamix Adaptor Base. Blend all ingredients in the Vitamix E310  Blender for one minute starting on level 1 and slowly progressing to level 4 until pureed. Allow the bubbles in the mixture to settle completely (this may take about an hour) before transferring into an airtight mason jar. Keep in a warm, dark place for 4–7 days, stirring daily until the sauce starts bubbling and begins to ferment.Once the hot sauce has fermented, pour it back into the Vitamix Personal Cup Adaptor and blend on level 1, increasing to level 2 for about 30 seconds until frothy. Strain through a sieve into a medium saucepan, and discard any remaining pulp. Bring to a boil and cook for 15–20 minutes or until the sauce reduces by half. Cool completely before serving.Drizzle over fruit salsa or your favorite taco, and enjoy!Sponsored by VitamixGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitVitamixSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}