{"id": "2125f41a705d4b53c8d524a26f09b9be", "url": "https://www.bonappetit.com/story/alexi-pappas", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Alexi Pappas, Olympic Runner and Filmmaker, Treats Her Body Like a Sandcastle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOlympic Runner and Filmmaker Alexi Pappas Treats Her Body Like a SandcastleThe athlete and artist on battling food guilt on social media and looking up to David Chang.By Elaheh NozariMarch 22, 2018FacebookTwitterEmailPhoto by Getty Images / Alberto E. RodriguezFacebookTwitterEmailAlexi Pappas is very into her “veggie box.” Right now, she’s excited about kohlrabi and pea shoots, but the real life-changer is herbs like parsley, which she’ll chop up and toss with sweet potato fries, olive oil, and salt. “I love to not have so much of a choice and just be provided with what’s in season,\" she said. The veggie box provides her with ingredients she wouldn’t have otherwise bought, but more importantly, allows her to be creative within boundaries.Finding freedom within limits is a constant quest for Pappas, the Greek-American runner, writer, poet, and filmmaker who set a national record for Greece at the Rio Olympics in 2016, two months after her film Tracktown premiered at the Los Angeles Film Festival. The 27-year-old recently returned from the Winter Olympics in Pyeongchang, where she was filming a series of short films as part of the International Olympic Committee’s (IOC) new Artist in Residency program. Now, she’s back to her regular routine of training and writing in Mammoth Lakes, a California mountain town in the Eastern Sierras that sits at 7,880 feet.She wakes up around 7 most days and eats breakfast—usually something warm and comforting like toast with peanut butter or “a really thoughtful oatmeal”—then piles into a van with her Mammoth Track Club teammates for morning practice. She shares a house with two other women on the team and lives in the same condo complex as the rest of the runners. “Our coach decides where we’re going to run. You have more willpower to put into your workout if you have fewer decisions to make during the day,” she said. She brings a substantial snack to eat on the ride home, like a jar of soup, a smoothie, or pumpkin bread.The most anticipated meal of the day is the one she has after getting home and showering. “Everyone on our team is ravenous and making skillets of different savory, hearty foods, the kind that fill your crevices after a hard workout,” she explained. After that, she takes a nap, then does creative work—either a few hours of writing alone (she’s currently working on a book of essays) or collaborating with her partner Jeremy Teicher on a film project, the latest of which is the fictional shorts they shot at the Olympics (the series will be live on the Olympics website next week). Then she does it all again—afternoon practice, home-cooked dinner, creative work, and sleep.Pappas has seen food act as both a strength and weakness for other runners, an observation that's helped her develop her own philosophy around eating. “The goal is to build a sandcastle of ourselves,\" she explained. For a sandcastle to last all day and not be washed away by the first waves, it needs a strong base that takes time to build. “I’ve watched people build their walls too thin and or high too quickly, which might mean under-eating or not having a variety of foods, and their sandcastles collapse. I’ve really tried to focus on having thick walls and eating a lot of different foods. If I see a scrap of seaweed, a piece of sea glass, or a cool stick, I’ll add it to my sandcastle. Building with variety creates a strong, healthy foundation.”Instagram contentThis content can also be viewed on the site it originates from.You might say Pappas' sandcastle gets a touch-up at her monthly team dinner, the most recent of which included ingredients from the veggie box, which the team shares. The dinners usually have a theme, but \"this one was just a lot of wonderful meat and hearty side dishes\" like steak, homemade pretzels and bread, grass-fed hot dogs, and smoked deer heart—all made by different teammates. \"My favorite was the deer heart, which I felt was just what I needed after my longest run of the year so far,\" said Pappas, who is training for the marathon at the 2020 Olympics.Pappas loves watching food as much as eating it. She's a big fan of David Chang, who she watched on Mind of a Chef  and Ugly Delicious. She finds it relaxing to see someone at the top of his game in a world so different from her own. She got to meet Chang at the Olympics in Pyeongchang and thank him for his work. “He understands what it is to always want to keep climbing and improving. We get each other maybe on this fundamental level of pursuing something obsessively for our whole lives. I think that’s what it takes to go to the Olympics and make a great film.”As Pappas seeks out people like Chang who are unapologetically dedicated to their craft, she continues to build a fanbase of her own. She has a large social media following—mostly young female athletes whom she lovingly calls \"bravies\"—and is very much aware of the internal conflict they have with food. \"When I was that age, I didn't have social media, and food was just food,\" she said. Now, she sees many female athletes comparing their bodies to other women on Instagram, and she wants to be a better role model for them. She receives about 30 to 50 Instagram messages a day with questions about food and body image, like if it’s okay to eat pasta or how to turn the voice off in their head that makes them feel guilty about what they ate. She personally responds to many of them and wants them to know that the decision to eat or not eat a cookie all comes back to self-love, and sometimes the bravest thing to do is to seek help.“Whatever it is I can be to them, I'm honored. It’s really important for me to put things out there that I would be happy and proud for people to imitate,” she said. So, instead of detailing the specifics of her workouts or her diet on social media, she posts quippy poems routed in self-confidence: “my heart loves chocolate and my brain loves olive oil and my legs love sweet potatoes & steak.”Though her roles as an athlete and artist balance each other out, Pappas' main focus right now is on increasing her mileage and training to compete in the marathon at the 2020 Olympics (she ran the 10K in Rio). She's not ready to put filmmaking before running, or even skip a post-practice nap to write more, but one day she'll want to put all her energy into the arts. Her creative work, too, is a sandcastle that needs to be built up before it can weather a day at the beach.Explore Bon AppétitHealthyishOlympicsprofileRead MorecultureHow to Eat Like an Ultramarathon Runner Even If You're a Casual JoggerBy Juno DeMeloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-22", "author": ["Condé Nast", "Elaheh Nozari"]}