{"id": "2126b458e5f06bd406204a0ffb5dd86d", "url": "https://www.bonappetit.com/recipe/sambal-goreng-tempe", "year": 2021.0, "month": 5.0, "day": 5.0, "content": "Sambal Goreng Tempe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSambal Goreng TempeToasty, nutty fried tempeh coated in a caramelized spice paste—plus lots of vegetables for good measure.By Lara LeeMay 30, 20214.0(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintSambal is a chile condiment eaten all over Indonesia and of which there are hundreds of variations; sambal goreng (which translates to “fried sambal” in Indonesian), is the whole class of dishes that start with frying that sambal in hot oil to make a spice paste called bumbu. This version of sambal goreng is my go-to, with tempe (spelled “tempeh” in English) that’s fried until crunchy, nutty, and irresistibly toasty. You can think of this as your new favorite “whatever’s in the pantry” recipe and swap the vegetables or tag out the tempeh for another protein (diced chicken, thin slices of pork or beef, or firm tofu all work). The heart of a good sambal goreng is the sambal itself, and this version is fragrant with ginger, garlic, and shallots, the tang of tamarind, and the defining warmth of chiles. If you can’t find kecap manis, you can substitute it with a mix of 3 Tbsp. dark soy sauce mixed with 3 Tbsp. light brown sugar. For the tamarind concentrate or paste, you can mix 2½ tsp. fresh lime juice with 2½ tsp. light brown sugar. For those less keen on deep-frying, you can also pan-fry tempeh: Heat ¼ cup vegetable oil in a large skillet over medium-high heat. Cook tempeh about 3 minutes per side, adding additional oil between batches if needed. —Lara LeeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDeep-Fry Thermometer$29 $16 At AmazonTramontina Nonstick Fry Pan, 10-Inch$36 At Amazon8-Inch Chef's Knife$47 At AmazonFood Processor$49 At AmazonSilicone Spatula$13 At BA MarketCutting Board$10 At IKEALarge Skillet$84 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Saucepan$39 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketHeatproof Measuring Cup$18 At AmazonSlotted Spoon$13 $10 At AmazonIngredients4 servings28-oz. packages tempeh¼cup vegetable oil, plus more for frying (3–4 cups)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more3large or 4 medium shallots12\" piece ginger1large or 2 small plum tomatoes6garlic cloves4–6red serrano or Fresno chiles3½oz. green beans½large bunch Tuscan or curly kale (about 6 oz.)2lemongrass stalks4makrut (Thai) lime leaves (optional)3Tbsp. kecap manis1Tbsp. grated palm sugar or light brown sugar1tsp. tamarind concentrate or 2½ tsp. tamarind paste2tsp. ground coriander1cup salted dry-roasted peanutsSteamed white rice (for serving)PreparationStep 1Start by frying the tempeh. Cut two 8-oz. packages tempeh into 1x½ x¼\" sticks with a chef’s knife. Pour vegetable oil into a medium heavy saucepan to come 2\" up sides (but make sure pan is no more than two thirds full); clip a deep-fry thermometer to sides. Heat oil over medium until thermometer registers 350°. (If you don’t have a deep-fry thermometer, check oil temperature by adding a cube of bread—it should turn golden in 15–20 seconds.) Line a rimmed baking sheet with paper towels.Step 2Working in 2 batches and bringing oil back to temperature between batches, carefully lower tempeh into hot oil with a slotted spoon or spider. Fry, turning occasionally until golden and crunchy all over, 7–9 minutes. Transfer to prepared baking sheet to drain; season with kosher salt.Step 3Now make the spice paste. Cut 3 large or 4 medium shallots in half lengthwise and coarsely chop. Scrape skin from one 2\" piece ginger with a spoon; discard. Thinly slice ginger. Cut 1 large or 2 small plum tomatoes into wedges.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Pulse shallots, ginger, tomatoes, 6 garlic cloves, and 1 tsp. Diamond Crystal or 1/2 tsp. Morton kosher salt in a food processor to make a coarse paste; set spice paste aside.Step 5Prep the vegetables. Thinly slice 4–6 red serrano or Fresno chiles. (If you’re heat averse, go with the smaller number and scrape away seeds and membranes before slicing.) Trim 3½ oz. green beans and slice into 1\" pieces. Remove ribs and stems from ½ large bunch Tuscan or curly kale (about 6 oz.); discard. Chop leaves into large pieces.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Bruise 2 lemongrass stalks with flat side of knife. Halve stalks crosswise so they will fit in skillet later. If using 4 makrut lime leaves, partially tear in a few places to help release flavor.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Make the sauce: Stir 3 Tbsp. kecap manis, 1 Tbsp. palm sugar or brown sugar, 1 tsp. tamarind concentrate or 2½ tsp. tamarind paste, and ¾ cup water in a measuring glass to combine.Step 8Heat ¼ cup vegetable oil in a large skillet or wok over medium. Scrape in reserved spice paste, then add lemongrass and lime leaves. Cook, stirring occasionally with a heatproof rubber spatula, until paste is fragrant and beginning to take on some color and stick to pan, about 8 minutes. Add chiles and 2 tsp. ground coriander. Cook, stirring occasionally, until chiles are softened, about 5 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Add tempeh, green beans, kale, sauce, and 1 cup salted dry-roasted peanuts. Cook, stirring occasionally, until liquid evaporates and spice paste and sauce cling to ingredients, about 5 minutes. Taste and season with more salt if needed.Step 10Serve sambal goreng tempe with steamed white rice.How would you rate Sambal Goreng Tempe?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleBeen looking to make this for a long time but had to be intentional about ingredients. Is Brooklyn too Italian for fresno chiles? What the hell. And why can I find sambal in ever market but not kecap manis. Got it all together except Palm sugar and really enjoyed it! Thanks for sharing this recipe and making it vegetarian! ChrisBrooklyn ny1/17/2022Needs more palm sugar, maybe some lime, maybe fish sauceAnonymous12/20/2021Maybe it's my tempeh, but the recipe calls for salt, but I think it's a bit too saltly? Could be my tempeh doe? IDK! Be careful with the salt! It's a very delicious recipe though! A+!\nClaudia CMelbourne, Australia11/23/2021I love sambal goreng — i always get the sauce as an appetizer (w naan) at papparich, but this dish is absolutely not it. Really funky taste — SO bitter and so strange. It's missing something – it tastes nothing like sambal goreng.Anonymous7/17/2021Made as described, as part of my meal prep for the week. Tasted off, flavours just weren't great. I have two portions left in the fridge that I'm really not looking forward to! Do not recommend.CSLondon, UK7/12/2021This delicious but complicated to try for the first time on a weeknight! I was able to use significantly less oil by cutting the tempeh length wise to make for thinner pieces before frying in about a quarter inch of oil. Could not find kecap manis so used a little extra brown sugar. And just about doubled the vegetables. Would definitely make again - even my kids liked it! Katherine Brooklyn, NY 6/24/2021Sure… the ingredients aren’t as readily available as most… but that is part of the fun! I was able to find everything I needed at my local (TORRANCE) H Mart! Super easy to make and very delicious. It feels like it should be harder to make. Husband loved it! Will make again!ManzieLos Angeles, Ca6/22/2021This looks delicious! I love tempeh but haven’t cooked it in a long time - can’t wait to try it out! I think that the recipe author has given a lot of possible substitutions for key ingredients that may be hard to find - kecap mania, tamarind, lime leaves - which makes it easier to throw this dish together with whatever vegetables or protein you have on hand. cohekoCanada 6/11/2021Could you air fry Tempeh/cbicksterAustin TX6/7/2021I was attracted by the concept of  a \"use it up\" recipe only to find that I had to LOOK UP the definition of several of the ingredients. Not a pantry friendly recipe any way you look at it.AnonymousCalifornia6/6/2021What a RIDICULOUS recipe to term as one you can make with whatever you have in the pantry!  I live in Asia and so have some of the ingredients but many of these ingredients are not everyday items that the majority of people keep in their homes.  You're really off-base here if you are really trying to offer your readers something they can make with what they have on hand.  AnonymousNEW YORK/Hong Kong6/6/2021Explore Bon AppétitIndonesianSoutheast AsianAsianTempehOther IngredientsTamarindCondiments, Sauces & PastesKaleLeafy GreensVegetableGreen BeanPalm SugarMainDairy-FreeVeganVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-30", "author": ["Condé Nast", "Lara Lee"]}