{"id": "21288e923a813120b5e7f0b07024b036", "url": "https://www.bonappetit.com/story/finnish-pancakes", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Finnish Pancakes Are Somewhere Between Crepes, Pancakes, and Heaven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFinnish Pancakes Are Somewhere Between Crepes, Pancakes, and HeavenThe bigger the pancake, the more room for maple syrup.By Amy RosenMay 6, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I was growing up, we had a lovely elderly babysitter named Maria. Maria was Finnish, and as a special treat each Friday, we’d leave school at lunch and trek home for her signature Finnish pancakes. Maria’s pancakes were not fluffy short-stacks but instead flat, plate-size pancakes. And they were the only pancakes we knew. Finnish pancakes have a lot going for them, including their tenderness, a lovely caramelized finish, and an exceptional amount of surface area for loading on the maple syrup and berries. They live at the intersection of crepe and, well, pannukakku (that’s Finnish for pancakes).But, as it turns out, these so-called “Finnish” pancakes aren’t from Finland at all. Instead, they’re a uniquely Canadian innovation.Starting in the early 1900s, waves of Finnish immigrants came to Thunder Bay in northern Ontario to work in the area’s bush camps and paper mills. Canada was their new home, and there was much to be explored, work to be done, and breakfast to be served. Finnish pancakes were an easy meal using accessible ingredients that could be made and served in the bush. The Hoito restaurant, located in the basement of the historic Finnish Labour Temple in Thunder Bay, popularized the pancakes way back when, and up until recently, continued to serve thousands each week to locals and tourists alike.Maria passed away years ago, but I tracked down a recipe and worked on it until my Finnish pancakes tasted just like hers, evoking the Friday lunches of my girlhood. The batter is a one-bowl affair, leaving in some lumps isn’t only okay but preferable, and there’s little downtime, as the mixture needs only 30 minutes to rest.Here’s how to make these Finnish pancakes: In a large bowl, whisk together 5 large eggs, 6 cups milk, and 1 tsp. pure vanilla extract. Mix in 5 Tbsp. sugar and ½ tsp. salt, then gradually whisk in 3 cups flour. Let rest at room temperature for 30 minutes. Then get out a large nonstick skillet, some unsalted butter, a ladle, and a spatula. Over medium heat, add a knob of butter to the skillet and let it foam. Then add a half-ladle of the thin batter in an even circular motion, swirling it into a large flat circle. Let it brown on one side for a minute or two, then flip with a spatula, and let it brown for 30 seconds or so on the other side. Remove from pan and set aside on a large plate. Keep going, adding more butter as needed, and more batter, flipping away, until your batter is gone and you have enough delicious Finnish pancakes to serve 4–6 people. Serve with maple syrup and fresh berries and even a dusting of confectioners’ sugar if you’re feeling fancy.Easy to make and easier to eat, hopefully these pancakes will transport you back to grade three, trudging home for lunch for a big plate of Maria’s delicious Canadian-Finnish pancakes.Explore Bon AppétitIt's That SimplePancakeMother's DayBreakfastBrunchScandinavianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-06", "author": ["Condé Nast", "Amy Rosen"]}