{"id": "21330b3a4aca40c836fc1b35e5d32846", "url": "https://www.bonappetit.com/story/vegemite-pizza", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "A Skeptic Tries: Vegemite Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: Vegemite PizzaAs an Australian, I am hence qualified to be the judge of this salty Brooklyn slice.By Kate McAuleyDecember 29, 2021FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmailA Skeptic Tries is a series examining our food resistances and what happens when we try them anyway. Next up, contributing writer Kate McAuley reluctantly gives Vegemite Pizza a go.Here I am, casually thumbing through Instagram on an unseasonably warm October morning, when a video featuring Giovanni Fabiano, an Italian-born, Brooklyn-based pizza chef, pops up in my feed. Normally, my under-caffeinated brain would have kept on scrolling, but something odd catches my eye: this sweet-faced Don of the Dough is sporting a corduroy cap emblazoned with none other than the distinctive red and yellow logo of Australia’s beloved Vegemite. My beloved Vegemite.Instagram contentThis content can also be viewed on the site it originates from.With mild horror, I, an Aussie living in New York City, watch on as Giovanni adds a generous squirt of my favorite sandwich spread onto a classic pie at the restaurant he owns, Rosa’s Pizza, in Williamsburg. He then showers it with shredded mozzarella and slides it into a Marsal oven. According to the chef, an official Vegemite ambassador, we Aussies have been eating Vegemite all wrong. “You put it on toast, I make pizza with it,” he proclaims in the promo video. “It tastes like Australia.” All right, mate, I’ll be the judge of that.For the uninitiated, Vegemite is a thick, dark brown, supremely salty spread that is made from a heady mix of leftover brewer’s yeast and a few other additions, including malt, folate, and riboflavin. Developed in Australia in 1922, it was our direct answer to the United Kingdom’s popular and older, but far inferior Marmite. As a kid, it was a staple in my family’s pantry because of its high levels of B vitamins (that’s 1980s wellness for you) and all-around deliciousness. The latter, however, is a fact that I’m yet to convince my U.S. friends of, no matter what Giovanni says.Whenever I’ve tried to indoctrinate my mates, all I’ve received in response are creased noses, furrowed brows, and gagging noises punctuated by statements akin to, “WTF is this Hell Paste?” and “Don’t you dare come near me with that.” And then they’ll try and guess what it is: “Ew. What’s that smell? Fish? Beef? An augury of an imminent zombie apocalypse?’” Actually, people, Vegemite is as vegan as most of Brooklyn these days—not that it matters if you won’t even give it a go.Oh, sorry, do I sound salty? The truth is, I’ve been in a funk since I arrived back in the U.S. from Australia in August. Tragically, a death in the family plucked me out of New York lockdown in fall 2020 and plonked me down in a then relatively COVID-19-free Sydney. I thought I’d be there for a month. I stayed a year. It had been decades since I’d spent that much time in my homeland and those months felt like a gift. I traveled as much as border restrictions would allow, swam in the ocean, and marveled at the big open skies. I reacquainted myself with old friends and spent some quality time with my family. I even got to work on a couple of cookbook projects. Naturally, reentry to New York has not gone smoothly. Doomscrolling and wallowing in homesickness, I’m in no mood to be challenged by an Italian maestro and his gimmicky pizza.But it does pain me to admit: Giovanni might be onto something. Every Aussie knows that Vegemite is best when scraped sparingly onto a thick slice of toast with lashings of butter, but it also holds its own when paired with chunks of bite-y cheddar cheese and fat slices of fresh tomato. I’ve even added it to sauces and soups when I didn’t have salty stock on hand. If used appropriately, Vegemite lends a subtle umami flavor to many a savory dish (kinda like miso). So can it work on pizza? There’s only one way to find out.With its wall of stainless-steel deck ovens, glass cabinets, sparse seating, and array of shakers full of dried mixed herbs and chili flakes, Rosa’s Pizza, is one of those classic New York pie joints—a humble type of place where a slice fresh from the oven reliably transcends the atmosphere. Giovanni’s smile is infectious as he spins the dough from one skilled hand to the other until it’s the size of an old-timey wagon wheel. (I obviously called ahead to make sure I could watch the whole spectacle go down.) Next comes the marinara sauce—a glossy dousing replete with fresh tomatoes, basil, and oregano. It’s the Vegemite, however, that gives him pause. “Is this too much?” he enquires as he spirals the thick black spread across the pie. I reply with a shrug. That’s what I’m here to find out. “I guess we’ll see,” he says before topping it off with grated cheese and sliding it into the inferno.While the pizza is cooking, I head outside to find my dining pal—an open-minded, born and bred Brooklynite I cajoled into joining me on this gastronomic experiment. “Let it rest,” the server suggests, as he drops the steaming pizza onto our plywood picnic table. “Last night people were too eager and the topping slid off.” As ordered, we watch and wait, noses twitching at the pleasing (for me, at least) Vegemite-tinged aroma, until the cheese begins to congeal.I slide a slice onto a paper plate, fold it in half, and guide the pointy end into my mouth. My teeth sink through the familiar viscosity of melty cheese. The sauce is silky, the dough chewy. But it’s not until I pull away, with strings of mozzarella cobwebbing my chin, that I get a hit of Vegemite. There it is. Loud and rambunctious. Salty as all hell. Unapologetic and punching above its weight. The first bite drops me back, like a rogue seashell, onto the soft sand at Bondi Beach.The spread-to-sauce ratio is surprisingly well balanced (most newbies go to town; rookie mistake). But as a combination, I’m not sure it does the sum of its parts justice. Rosa’s Pizza is perfect on its own. As is Vegemite. Vegemite pizza, on the other hand, is a bit, well, unnecessary. I would probably eat it again, if only for a taste of home when the jumbo jars my family ship over inevitably run out. But I’m gonna be honest: toast, butter, and a smear of V is still number one.As my friend and I walk back toward the G train, we pass Rocka Rolla, a dive bar we’ve never been to before. It seems like the perfect place for a postprandial debrief (a.k.a. it exists and it’s not too busy). Inside we order goblets of ice-cold beer to hydrate our palates and cop a squat in one of the booths. After a few sips and a bit of banter, I notice an AC/DC neon sign on the far wall. And then, as if on cue, the Aussie band’s worldwide hit, “T.N.T.,” starts pumping out of the speakers. New York dive bars and a lick of quintessential Oz rock? Now this is a pairing I can get behind.Explore Bon AppétitA Skeptic TriesCultureRead MorecultureA Skeptic Tries: Swedish FishBy Justine LeecultureA Skeptic Tries: Dairy Queen's Dipped ConeBy Ali FranciscultureA Skeptic Tries: Quitting CoffeeBy Luna AdlerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-29", "author": ["Condé Nast", "Kate Mcauley"]}