{"id": "2136c75213ed9a5bd64d126c2c779274", "url": "https://www.bonappetit.com/story/kosas-tinted-face-oil", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Kosas Tinted Face Oil Is Made For People Who Don't Like Foundation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Clean-Beauty Foundation Is Made For People Who Don't Like FoundationKosas tinted face oil delivers nutrients to your skin and stays sheer enough for your natural tone to come through.By Deanna PaiMay 7, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailFor a good year or so, I missed the memo on Kosas, a relatively new clean beauty brand based in LA. It wasn’t until their lipstick won a beauty award from the magazine where I was moonlighting that I first tried it for myself. I saw why it won: The color was subtle yet flattering, the texture buttery, the finish satin-like.So when Kosas, the brainchild of artist and chemist Sheena Yaitanes, debuted a tinted skin oil—the brand’s interpretation of foundation—I was torn. I wanted to try it, but I tend to shy from oils because my forehead looks like a fracking accident no matter how much mattifying primer or blotting sheets I use. I was also finally recovering from a months-long breakout so inflamed that it warranted antibiotics, so I did not exactly want to poke the metaphorical bear by dumping more oil on my skin.But this oil isn’t the kind that’ll sit the surface of your skin and send you to the office bathroom to snuff out your human headlamp with squares of one-ply toilet paper. Instead, it sinks in. “The oil delivers nutrients to your skin, absorbing deeply and leaving a thin pigment layer behind,” explains Yaitanes. She hand-picked each one based on their benefits: Avocado oil hydrates and cushions skin, she says, while green tea seed oil fights free radicals, jojoba oil balances skin, and rosehip seed oil brightens and clarifies.Convinced, I decided to go for it, choosing Shade 5 from the line. There are only 10 shades total, which seems risky in a world with Fenty Beauty, but there’s a reason for it: Yaitanes says she formulated the shades to be sheer enough for your own skin tone to come through, so a single shade can work across three different skin tones and a variety of undertones.At this, my BS detector began to heat up. Being Chinese and Italian, my skin tone is tan and olive-ish, and maybe a little peachy depending on the light. Trying to match my foundation is a process as drawn-out and torturous as last season of The Bachelor. Truly: I once stood at a beauty event and swatched a third of their 30-plus shades only to learn that they didn’t offer a single option for a medium-toned biracial girl.But Shade 5, which I’d picked via that scientific method of holding my hand up against a swatch on my dirty laptop screen, somehow disappeared into my complexion as I smoothed it on. (Using your fingers in a sweeping and pressing motion is the best way to apply it, says Yaitanes.) It was like witchcraft. I started with a few drops, since the formula, which feels like a dry oil with pigment, is so concentrated. While the first application wasn’t enough to cover some lingering dark spots, I added another layer. That did the trick. The color was perfect.The second day I tried it, it began to pill, though I can’t blame the oil for that one. “Serums or skincare containing silicones may cause pilling,” says Yaitanes, as the tinted face oil is silicone-free. And indeed, I’d just slathered on my sunscreen without giving it a chance to sink in. Worth noting, too, is that because the oil lacks silicone’s signature slip, “our formula may cling to dry patches,” Yaitanes explains. “So make sure that you exfoliate on a regular basis, especially during the drier months.” At least that’s not a problem for me.Once I began waiting a minute or two after applying my sunscreen, the oil was virtually undetectable. And it stayed that way throughout the day. There wasn’t an oil slick to be found.That’s by design. “It works for your skin while it’s on, wears better and better throughout the day, and when you remove it, your skin underneath looks nourished and strong,” she says. And by the time I got home and washed my face, I saw that she was right.Buy it: Kosas Tinted Face Oil, $42.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleWhat Is Gua Sha Facial Massage and Does It Live Up to the Hype?By Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-07", "author": ["Condé Nast", "Deanna Pai"]}