{"id": "213dc13742971b17b29d4b2b6e85cb29", "url": "https://www.bonappetit.com/recipe/quick-pickled-cauliflower", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Quick-Pickled Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueQuick-Pickled CauliflowerBy Bryant Terry August 10, 20213.7(3)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintBright with lime, vinegar, and heat from Scotch bonnet chiles, this quick pickle by chef-author-activist Bryant Terry is an ideal counterpoint to his Dirty South Hot Tamales With Jackfruit and Cilantro Sauce or similarly rich dishes. Plan to make the pickles at least a day in advance to allow the flavors to develop fully.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron1 Quart Glass Jar$13 At 32-Ounce Mason JarSmall Saucepan$155 At AmazonCitrus Juicer$7 At AmazonIngredientsMakes 2 quarts1large head of cauliflower (any color), cut into 1\"–1½\" florets (about 4 cups)2Scotch bonnet or habanero chiles2large garlic cloves, lightly crushed2tsp. black peppercorns2tsp. coriander seeds4cups unseasoned rice vinegar¼cup fresh lime juice1cup raw sugar2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2Tbsp. bourbonSpecial EquipmentTwo 1-quart heatproof glass jarsPreparationStep 1Divide cauliflower, chiles, and garlic evenly between jars.Step 2Toast peppercorns and coriander in a dry small saucepan over medium-low heat, shaking pan occasionally, until fragrant, about 3 minutes.Step 3Add vinegar, lime juice, sugar, salt, and 2 cups water to pan, increase heat to high, and bring mixture to a boil. Reduce heat to medium and simmer, stirring often, until sugar and salt are dissolved, about 3 minutes. Remove from heat and stir bourbon into brine.Step 4Carefully pour hot brine over vegetables (vegetables should be submerged). Seal jars and let cool. Transfer jars to refrigerator; let chill at least 1 day before serving.Do Ahead: Cauliflower can be pickled 3 days ahead. Keep chilled.Adapted with permission from Black Food: Stories, Art, and Recipes From Across the African Diaspora by Bryant Terry (4 Color Books). Copyright © 2021.\n\nBuy from Amazon or Bookshop.orgHow would you rate Quick-Pickled Cauliflower?Leave a ReviewTell us what you thinkExplore Bon AppétitPickleCondimentSouthernAmericanCauliflowerVegetableScotch BonnetChileHabanero ChileLimeCitrusFruitEasySnackDairy-FreeGluten-FreeNut-FreeVeganVegetarianPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Bryant Terry"]}