{"id": "213fb533eff3597fbc45996bde9d164f", "url": "https://www.bonappetit.com/recipe/soba-soup-with-shrimp-and-greens", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Soba Soup With Shrimp and Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSoba Soup With Shrimp and GreensBy Sarah JampelOctober 27, 20194.6(51)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintDashi is the sort of super-powered broth that every cook should know how to make. One of the building blocks of Japanese cuisine, the most popular dashi is made from just two ingredients (kombu and katsuobushi a.k.a. bonito flakes) and comes together in fewer than 15 minutes. That makes it the fastest route to a slurp-able, umami-rich broth (with no loooong simmers or bags of chicken bones necessary). Here, it's the base of a super savory soup packed with poached shrimp, nutty soba, and tons o' greens—the perfect antidote to that cold you kinda sorta feel coming on. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonDutch Oven$80 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Pot$55 At AmazonTongs$13 At AmazonSieve$18 At AmazonMicroplane$16 At AmazonWooden Spoon$6 At AmazonSmall Bowl$13 At AmazonIngredients4–6 servings1lb. large peeled, deveined shrimp, fresh or frozen1sheet kombu (about 1 oz.)½large bunch or 1 small bunch mustard greens, kale, mature spinach, or Swiss chard (about 8 oz.)10scallions11\" piece fresh gingerKosher salt11-oz. package bonito flakes¼cup mirin5Tbsp. soy sauce, plus more for drizzling1Tbsp. toasted sesame oil, plus more for drizzling4large eggs8oz. soba noodles1Tbsp. toasted sesame seedsPreparationStep 1If your 1 lb. large peeled, deveined shrimp is frozen, defrost it—here’s how. Meanwhile, soak 1 sheet kombu in 8 cups water in a large Dutch oven until soft and flexible, 15–20 minutes. (You'll probably notice a white layer of film on your kombu—don't rinse that off. It's a source of sweetness.)Step 2While kombu soaks, remove leaves from ½ large bunch or 1 small bunch mustard greens, kale, mature spinach, or Swiss chard (discard or save the stems), wash, and coarsely chop. Thinly slice 10 scallions; set aside about one-third for serving. Peel 1 1\" piece ginger. Bring a large pot of salted water to a boil.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Make the dashi: After kombu has soaked, turn heat to medium. Once you see small bubbles around the edges, use tongs to remove kombu. Avoid bringing the water to a boil—it might make your dashi bitter. (As for the kombu, you can save it in the fridge to make another batch of dashi later in the week.)Step 4Add 1 1-oz. package bonito flakes, bring to a boil, and turn off heat. Gently push bonito flakes to submerge, then let stand 2 minutes without stirring. Carefully pour through a fine-mesh sieve into a medium bowl or large measuring cup, being sure to strain out any lingering fish flakes. (You can also save the bonito for your next round of dashi.) That’s it: You’ve made dashi.Step 5Wipe out Dutch oven and return to medium heat. Add chopped greens, remaining two-thirds of scallions, and ½ tsp. salt. Using a Microplane, grate in ginger. Pour in ¼ cup water and stir to combine. Cover and cook until greens are wilted, 4–5 minutes.Step 6Add dashi, ¼ cup mirin, 5 Tbsp. soy sauce, and 1 Tbsp. toasted sesame oil and bring to a gentle simmer.Step 7Carefully lower 4 large eggs into boiling salted water and set a timer for 6½ minutes. Fill up a small bowl with ice water. Immediately plunge eggs into ice bath when your timer goes off. This halts their cooking, keeping them in that gooey yolk state you're looking for. Let cool, then peel.Step 8Return salted water to a boil and add 8 oz. soba. Cook 4 minutes, then drain and rinse with cold water. Divide noodles among shallow bowls.Step 9Finish up: Pinch tails off shrimp; season with salt. Add to pot and remove from heat. The shrimp will turn bright pink in the residual heat of the broth, a sign that they’re cooked through. Taste and add more salt, if needed.Step 10Divide broth among bowls with noodles. Slice eggs in half as you add to bowls. (If you're planning on having leftovers, store the broth, noodles, and uncut eggs separately.) Drizzle yolks with sesame oil and soy sauce. Sprinkle with reserved scallions and 1 Tbsp. toasted sesame seeds.How would you rate Soba Soup With Shrimp and Greens?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleI love this soup! I make the dashi and eggs on the weekend for a very quick weeknight dinner. I usually used frozen ramen noodles and whatever greens I have for the week, baby spinach, chard, licnato kale. Sometimes I will use leftover chicken instead of shrimp.AnonymousSoutheast Michigan2/5/2022It was ok - not worth the complexity, but with some time-savers, perhaps ok. For example, I’d use dashi powder instead of the drawn-out kombu and bonito flake soaking (which also feels like a waste of good materials).  Additionally, don’t bother removing the dashi broth, and cooking the kale, scallions, and ginger separately - just cook them in the dashi straightaway. you’ll easily shave 30 min off this with those two changes.\n\nAdditionally, I didn’t salt the shrimp, and added half the soy sauce - I’ve found some recipes on here too salty, and was glad I listened to my gut.VCBoulder1/31/2022Quick to assemble, and I used frozen chopped kale. Super easy and so worth it!ZPDoylestown PA12/28/2021Too complicated for the result. AnonymousNowhere12/11/2021How much dashi do you end up with? I have some of the broth. GayPhiladelphia 7/25/2021I made it last night and have to say I was skeptical; I don't like very fishy tasting foods but I really liked this soup.  I will probably make it again.  The only thing I would have done differently would be to have chopped up the shrimp so that they were bite-sized before cooking them; it would have been easier to eat (I used shrimp 20-25 per pound size).\nI had leftovers for lunch and it still tastes greate.DenitomiConncecticut3/26/2021I made this soup 2nite.  The house smells wonderful.  Really very easy.  I used kale & it worked.   I learned a new trick for broth & that makes me happy.  Thanks!ConniegPhiladelphia2/4/2021Absolutely delicious.AnonymousToronto, ON1/28/2021This is delicious! It's definitely in my rotation now. I throw in the shrimp shells when I put in the bonito flakes as well. I've also made this and served it over brown rice which works great too. I use furikake at the end instead of plain sesame seeds for a little more ocean-y flavor. SarahBerkeley, CA1/22/2021We loved it. I've never cooked with bonito or nori and really liked it. The noodles make it. Austin, TxUSA1/10/2021Loved this and the ease of making it. Made sure I had all the correct ingredients. I added a little chili garlic at the end to my bowl and it perfected it!! Monique pyleNew Orleans 12/11/2020Delicious! \nI couldn’t find kombu or bonito flakes so I used nori sheets and dried shiitake mushrooms for the dashi. Came together quick and turned out great. CassLos Angeles11/9/2020We are just making it again\n.AnonymousCalgary8/2/2020Such a gresat recipe, so simple yet delicious!!!! Thanks Sarah <3cloze9Australia5/19/2020AMAZE!!!!Chicago4/3/2020Explore Bon AppétitSoupSoups and StewsJapaneseEast AsianAsianShrimpShellfishSeafoodSoba NoodleNoodlePasta & NoodlesMustard GreensLeafy GreensVegetableWeeknight MealsDairy-FreeSimmerLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-27", "author": ["Condé Nast", "Sarah Jampel"]}