{"id": "215590e8ece2a083768f1baf9eaac735", "url": "https://www.bonappetit.com/story/andy-baraghani-cooking-and-identity", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "I Hid Who I Was for So Long. Until I Became a Cook. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Hid Who I Was for So Long. Until I Became a Cook.I didn’t want to reveal my sexuality, or ethnicity, to anyone. I just wanted to cook.By Andy BaraghaniMarch 16, 2018FacebookTwitterEmailPhoto by Fatemeh BaraghaniFacebookTwitterEmailI was a curly-haired, wide-eyed toddler with a big smile, and I was mute. My parents, worried that their three-year-old had yet to say a word, took me to a speech therapist, only to find out there was nothing wrong. I simply was not ready to speak. I couldn’t yet open myself up to the world.Soon I learned to say made-up words, like gheneh for ice cream and hom hom for food. By the time I was four I could speak well enough to ask for the birthday gift of my dreams: a Fisher-Price kitchen. Standing at my bright white plastic countertop with its yellow sink and pink cookware, I thought I was a petite Jacques Pépin. You have to understand: I didn’t watch Power Rangers; I sat in front of the TV mesmerized by Pépin and Julia Child and Martin Yan on Yan Can Cook.When I was still light enough to be picked up and set on the kitchen counter, I’d gaze at my mother as she combined spices from unlabeled jars to create dishes she had learned from her mother in Iran—ones that I would eventually learn from her. I’d watch as she went through the meticulous steps of making polo, fluffy Persian rice, before tossing it with saffron that had been bloomed in rose water. In the summer my eyes would tingle and begin to water from the harsh smell of vinegar all over the house, as my father and my grandparents would make torshi, Iranian pickles. Food, and cooking in particular, is what my parents brought with them when they emigrated from Iran to Berkeley, California, in 1977, 12 years before I was born. I remember the charred, lacy texture of piaz dagh—literally “hot onions.” I was in awe of the rich colors of the thick, glossy fruit jams my dad would make. I didn’t know it at the time, but it was the beginning of my education as a cook.When I started to experiment in the kitchen in my preteens, I wasn’t making anything complicated. My idea of fancy was topping a frozen pizza with sun-dried tomatoes and fresh basil. By the time I was 15, my cooking got more elaborate. I began studying cookbooks and making labor-intensive dinners: artichoke soup with tomato confit one night, roasted quail stuffed with pine nuts and currants another.After the love I had for my mother, food became my second love. It turned into an obsession. But not until recently did I realize that it is what allowed me to figure out who I am.Little Andy celebrates Nowruz, Persian New Year, in style.\nPhoto by Fatemeh BaraghaniWhen I started kindergarten I was a painfully quiet boy with a deep love for a particular purple turtleneck sweater, little interest in sports, and zero desire to kiss girls. While I didn’t know the exact term, I knew I was gay—and I was picked on at school because of that for years.I was six years old when I got chased for the first time by a group of boys with sticks.I was eight years old when I realized I was the only boy at an all-girls birthday party.I was nine years old when a group of laughing boys locked me in a bathroom stall, and I just hoped no adult would find me, to avoid any further embarrassment.I was 12 when I ran faster than any other boy in a race. I’d had plenty of practice.I could barely say aloud the words that I was being called. If I repeated them, I would be calling myself that, revealing my sexuality for the first time.Finally, when I was 12, I transferred to a new school district where I didn’t know anyone. It was my Madonna Ray of Light/Kabbalah moment: a time to rebrand. I changed the way I dressed; I tamed my thick black hair. I became a master at hiding my sexuality.By the time I finished high school, I had already worked in three restaurants, including Chez Panisse. At the time there was a sous-chef at the café upstairs who was gay: He was calm and quiet and strong, and he was an exceptional cook. There was no tolerance for dismissive or negative behavior toward anyone for their gender, sexuality, or race. I remember a male line cook being fired after saying to a woman who was interning, “Just sit over there and look pretty.” Chez Panisse showed me that a kitchen was a place where I could belong.Get Andy's recipe for tachin, Crunchy Baked Saffron Rice with Barberries.\nPhoto by Alex LauThat is, to this day, the only restaurant kitchen I’ve worked in alongside another out gay man on the line. While the restaurants I cooked at were male-led, they weren’t exactly environments that encouraged me to come out. But I liked being part of a team, working toward a common goal: We were all there to make food that was as delicious as possible. I liked wearing a uniform. But more than anything, I liked feeling, for the first time, that I was being judged on my skills and nothing else. And as I became more confident as a cook— gliding swiftly and efficiently at my station, tasting a dish to decipher whether it might need more salt or acid—I began to accept my sexuality both within and outside of that space.When I moved to New York for college, I met someone who would become my first boyfriend, and there was no turning back. We were each other’s first boyfriends, and, like many other young people in love, I thought that my first relationship would be an everlasting one. With his help I came out to my mother. But I wasn’t ready to come out to my dad, and I asked my mother not to tell him. She kept that secret for what must have been a year and a half.When I finally told my dad, I didn’t say, “I’m gay.” I said, “I’m seeing a man.” He said, “No matter what, I’ve always wanted you and your sister to be happy and healthy.” I thought I would feel a huge weight lifted after coming out to my dad, but it doesn’t really happen like that.A year later I was in front of the historic Stonewall Inn in New York the day gay marriage became legal. I don’t know how we all ended up there—hundreds of people celebrating in the late afternoon. I just remember everyone texting each other: When are you getting there, how are you getting there, are you leaving work early? I was 21 years old; it wasn’t like I was planning to get married any time soon. I just knew I needed to be there.In the middle of this, I got a call from my father. I’m not even sure why I answered at that moment (rather than calling him back later) because typically he just likes to check in and make sure I’m dressed warmly enough. But that day was different. He said he didn’t want to hold me up; he just wanted to hear my voice and say that he knew it was a big day for us in New York. I spoke to him for barely a minute. He said so little, but it was everything I needed to hear.Four-year-old Andy and his prize possession: a Fisher-Price kitchen.\nPhoto by Fatemeh BaraghaniBy the time I turned 21, I had found my sexuality and my career. But there was another part of my identity that took longer to figure out. To explain it, I have to rewind back to grade school, to the morning of September 11, 2001. Watching the news, I had no idea what the consequences of that day were going to be. In the years that followed, I became, for the first time in my life, highly aware of my ethnicity. As an adolescent, I no longer stood out because of my sexuality but instead for my coarse hair, my olive skin, my thick eyebrows, my full beard. I had Iranian painted all over me. The name-calling started again, but this time it wasn’t “he/she,” “gay,” or “girl,” but instead “terrorist,” “sideburns,” “durka.”I learned early on that since my last name began with a B, I’d be one of the first people on the list during roll call. Well, I guess I should tell you now: My real name is Andisheh, not Andy. Every year, on the first day of school, I could see my teacher hesitate when pronouncing my name: “Ahhnnn...” I’d quickly cut the teacher off and say, “Andy is fine.” From middle school into college: “Andy’s fine.” I’m surprised no one ever called me “Andysfine.”I began to throw away my lunches; I didn’t want anyone to ask what was in them. No more kuku, my mother’s Persian herb frittata; no more kalbas sandwiches: all-beef mortadella wrapped in lavash bread. I would ask my parents not to drop me off close to school in fear that my peers would see their brown skin or hear their accents. When it came to the beard that appeared on my 12-year-old face, I shaved every day and stole a bit of my mother’s foundation to cover it up. I started telling people I had some Italian in me. My last name Bar-a-gha-nee became Ber-e-ghee-nee. I invested in a T-shirt that read ITALIAN STALLION; it would later become infamous among my best friends. Even when it came to my first love in New York, I initially told him I was only half Iranian, which was a partial truth that freed me from being entirely associated with my heritage.Around this time I interned in the test kitchen at Saveur. The editor in chief at the time, James Oseland, and the executive food editor, Todd Coleman, told me they were going to do a story on Iran. My first thought was: That is just an awful idea. This was 2010. Tensions were high between the U.S. and Iran, where Mahmoud Ahmadinejad was president at the time. After all that time spent working my way up in restaurants, I wasn’t sure I wanted to be associated with Iranian food. Ever since I was a gutsy 16-year-old working up the courage to ask the staff at Chez Panisse if I could help out on Friday nights, I’d been dedicated to mastering a particular style of cooking. My most recent stints had been at the fine-dining restaurant Corton and a Scandi pop-up called Frej. Iranian food was what I’d grown up on, but I had worked so hard to get away from it.James and Todd asked me to help develop the recipes for the Iran story. While I had eaten Iranian food nearly every day growing up, I didn’t actually know the processes and traditions. I was familiar with saffron and barberries, but I couldn’t prepare any of the fragrant stews or elaborate rice dishes that serve as the backbone of the cuisine. So for the next three weeks, I called my mom almost every day and talked to her for hours, translating her “handfuls” and “pinches” to cups and teaspoons, re-creating her recipes in the test kitchen. Eventually, about ten of the final recipes that appeared in the issue were adapted from my mother’s. Saveur published a piece titled “Behind the Iran Story”; it was a letter dedicated to my mother and me, in which Todd thanked us for our contributions and said that the story couldn’t have happened without us. When the issue came out, people both in and out of the food industry embraced it and reached out to me, thanking me for shedding some light on the cuisine. My shame began to recede.Not quite the same as his father's torshi, but Andy makes Hot-Pink Pearl Onion Pickles.\nPhoto by Alex LauWhile I still had a ways to go, for the first time in almost a decade, I felt drawn to the food and culture I had put aside. My Iranian-ness was no longer something to be embarrassed by. I started a pop-up inside my Brooklyn apartment, where I cooked Iranian dishes that I grew up on and ones I had never heard of. These dinners, definitely not approved by the health department, began to sell out rapidly.When I started working at Bon Appétit a little more than two years ago, I had the same feeling as when I got that Fisher-Price kitchen: in slight disbelief yet overcome with joy. But that first year, while my excitement was still high, I wasn’t happy with the work I was putting out. I was the new kid—the baby—and I could barely get a full thought across without my nerves creeping up and taking over. I struggled to find my voice, my point of view. My lack of confidence was inhibiting me from creating the food I wanted to cook; it got to the point where something as seemingly simple as developing peach dessert recipes became paralyzing.So as nice as it would be for this story to end with that Iran feature or getting my dream job at Bon Appétit, the truth is that I’m still trying to figure things out. It’s not always steady progress. For as many moments of clarity as there have been, there have been periods of shame and confusion and out-of-season peaches. All I can do to move through them is to try to set my doubts aside, get back to the kitchen, and cook.Listen to Andy read his essay on the Bon Appétit Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitPersianRead MorecultureHow I Honor My Family’s History with a Persian New Year FeastBy Andy BaraghanicookingMy Guide to Modern Middle Eastern CookingGallery10 SlidesBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-16", "author": ["Condé Nast", "Andy Baraghani"]}