{"id": "216b11686d331062d8be8b7f50295315", "url": "https://www.bonappetit.com/story/refreshing-twists-on-the-classic-gin-and-tonic", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "3 Refreshing Twists on the Classic Gin & Tonic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Refreshing Twists on the Classic Gin & TonicBy The Botanist GinApril 21, 2020FacebookTwitterEmailFacebookTwitterEmailCustom Gin & Tonic Recipes Made with The Botanist GinThe Gin & Tonic is a classic that can reinvent itself time and time again. It’s time to get creative and go beyond the standard serve by experimenting with fresh, seasonal ingredients.Your drinks will stand out if you start with a smooth, balanced, and versatile base. Begin with The Botanist Gin, which is crafted from 22 locally hand-foraged botanicals from the Isle of Islay off the west coast of Scotland. The combination of botanicals coupled with a long, slow distillation makes this an incredibly smooth, balanced, and versatile gin, and the perfect foundation for any local and seasonal ingredients you want to add. Once you’ve got your foundation, try one of these three unique variations to virtually \"cheers\" with family, friends, or colleagues! To discover more, visit www.thebotanist.com.The Botanist Gin & TonicRecipe by Bon AppétitMakes 1 Gin & Tonic2 ounces The Botanist Gin3½ ounces tonic water1 lime1½” or 2” square ice cubesBasil, mint, celery leaves, or cucumber (for serving)Slice lime in half lengthwise, then slice one half lime into four wedges (eighths).Wrap ice cubes in a clean kitchen towel and smack with the back of a metal spoon or mallet to form large, irregularly shaped shards. Fill a 12 ounce Collins glass 1/2 of the way with cracked ice.Pour The Botanist Gin over ice, and squeeze the juice of two lime slices into the glass. Add squeezed lime peels to glass. Add more cracked ice to the glass, so it is ¾ of the way full. Squeeze the remaining two lime slices into the glass and add the squeezed slices. Pour in tonic water and stir.Garnish with fresh basil, mint, celery leaves, or cucumber.The Botanist Gin & Tonic\nCitrusy G&TRecipe by Andy BaraghaniMakes 1 Gin & Tonic2½ ounces The Botanist Gin8 fresh mint leaves, slapped½ a clementine, tangerines or any other small sweet citrus1 lemon wedge3½ ounces tonic waterMore mint leaves and thinly sliced lemon strips, for garnish (optional)Combine the mint leaves, clementine, and lemon wedge, in a cocktail shaker and muddle just until they release the oils and juices from the citrus. Add The Botanist Gin and fill the cocktail shaker with ice and shake vigorously for 30 seconds until the shaker is very cold and frosty. Strain the mixture into a highball glass filled with ice and top with tonic water. Garnish the cocktail with mint leaves and lemon strips, if using.Citrusy G&T\nSal Cel G&TRecipe by Molly BazMakes 1 Gin & Tonic2 ounces The Botanist Gin1 celery stalk, coarsely chopped1 tbsp sugarBig pinch kosher salt1 lemon3½ ounces tonic waterCelery leaves, for garnish (optional)Combine the celery, sugar, and kosher salt in a cocktail shaker and muddle until the celery breaks down and is quite juicy. Add the juice of one lemon and The Botanist Gin. Fill the cocktail shaker with ice and shake vigorously for 30 seconds until the shaker is very cold and frosty. Strain the mixture into a rocks glass filled with ice and top with tonic water. Garnish the cocktail with celery leaves, if using.Sal Cel G&T\nExplore Bon AppétitGinTonicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-21", "author": ["Condé Nast", "The Botanist Gin"]}