{"id": "217e8588889d7e1157dd16f15ea006e8", "url": "https://www.bonappetit.com/story/francis-mallmann-grilled-pineapple", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "How Francis Mallmann Caramelizes an Entire Pineapple on the Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Francis Mallmann Caramelizes an Entire Pineapple on the GrillIt’s the greatest pineapple we’ve never had.By Christina ChaeyJune 27, 2018FacebookTwitterEmailPhoto courtesy of David X Prutting/BFAnyc.com/REX/ShutterstockFacebookTwitterEmail“The first ingredient in grilling is patience,” says Francis Mallmann, the Argentinian chef whose live-fire cooking style is revered by flame-obsessed chefs the world over. Whether he’s cooking a whole side of beef over burning logs on his private island in Patagonia (yes, really) or simply sizzling a side of mushrooms, the Seven Fires author has learned that the best results come when you take your time. One of his specialties: a 12-hour grilled whole pineapple, which he offers as a seasonal dessert at Los Fuegos in Miami Beach. The end result is fruit so meltingly tender you can eat it down to the core, Mallmann’s favorite part. Read on to find out exactly how the chef prepares the pineapple, and how he spends his time as he’s waiting for it to be done.What’s your favorite thing to grill?As you can imagine, I love grilling meat: lamb, pork, and so on. I love grilling calamari, or cooking halved cut lobsters right on the coals. I’ll make cakes on the grill—like a delicious cake of strawberries and other red fruits, with a bit of crème anglaise on the side.Where did you get the inspiration to grill pineapple?Pineapple is very sweet and harsh, but when you cook it very slowly and toast it on every side and on the bottoms, it becomes like a confit. What I do with a pineapple is every hour I’ll just dip it into a pineapple syrup as it cooks, so it comes out soaked, and then it keeps on grilling for another hour. [At Los Fuegos by Francis Mallmann in Miami] we’ll do that like, 12 times. At the restaurant we probably cook 20 pineapples all at the same time.Just look at the caramelized, golden skin.\nPhoto by Alex LauDoes the pineapple hold its shape after 12 hours of cooking?Oh, yeah. It shrinks quite a bit, but even a pineapple, which is very, very hard, becomes tender. We take care to get beautiful, really nice caramelized brown sides all around it, so when you cut a slice of it you’ll see all these crunchy parts on the outside. We serve it with a plop of mascarpone or ice cream, and I love to serve it with a big spoonful of quince jelly that we make.What do you do to keep busy as you cook?If I have family or friends for dinner, I’ll start cooking around 8am for them. I’ll take a chair, beautiful books, flowers; I make it very comfortable and plan to have lunch there and spend my whole day there. You have to enjoy your own company.What’s the most common mistake you see grillers make?The most common error is flipping and flopping things constantly, which is extremely bad. You only flip food once. You turn it once. And you always respect the first contact that whatever you’re cooking has with the hot surface. If it’s a skillet, if it’s a grill, wherever you drop it, it has to stay there until you decide you’re going to flip it only one time.Explore Bon AppétitGrillPineappleRead MorecookingSorry, Mom—These 39 Fruit Salad Recipes Are Actually GoodGallery39 SlidesBy Elyssa GoldbergcookingHere's How to Not Set Grilled Food on FireBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-27", "author": ["Condé Nast", "Christina Chaey"]}