{"id": "2185fb4d30522d7c7e6bfdd156c2b73e", "url": "https://www.bonappetit.com/recipe/chocolate-hazelnut-cookies", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Chocolate-Hazelnut Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueChocolate-Hazelnut CookiesBy Ochre Bakery, Detroit, MISeptember 17, 20194.6(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintIrresistible, chocolate-laced, nutty cookies from Ochre Bakery in Detroit, No. 4 on our Hot Ten list for 2019. Coarse raw sugar gives them a subtle crunch in every bite, but you can replace it with an equal amount of white sugar if needed. And trust us on the big pieces of chocolate: The matchsticks are what give these cookies their melty stripes.IngredientsMakes about 2½ dozen¾cup (115 g) blanched hazelnuts3½cups (440 g) all-purpose flour1tsp. kosher salt¾tsp. baking powder½tsp. baking soda½tsp. ground ginger1cup (2 sticks) unsalted butter, room temperature½cup (100 g) granulated sugar½cup (100 g) raw sugar or granulated sugar½cup (100 g) (packed) light brown sugar2large eggs, room temperature¼cup honey½tsp. vanilla extract42-oz. bittersweet chocolate bars, cut lengthwise into ¼\"-thick sticksFlaky sea saltPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 300°. Toast hazelnuts on a rimmed baking sheet on upper rack, tossing halfway through, until golden brown, 8–10 minutes. Let cool slightly, then chop very coarsely; set aside. Increase oven temperature to 350°.Step 2Whisk flour, kosher salt, baking powder, baking soda, and ginger in a large bowl to combine. Beat butter, granulated sugar, raw sugar, and brown sugar in the bowl of a stand mixer fitted with the paddle attachment on high speed, scraping down sides of bowl occasionally, until pale and fluffy, 5–7 minutes. Reduce speed to medium-high and add eggs, one at a time, increasing speed to high after each addition to fully incorporate and stopping periodically to scrape down sides of bowl. Add honey and vanilla and beat just to combine. Reduce speed to low and add dry ingredients; beat until combined. Add chocolate and reserved nuts and beat just until incorporated.Step 3Scoop dough into 1½-oz. portions (about 3 Tbsp.); roll into balls (if the batter feels loose or sticky, chill 30 minutes). Place on a parchment-lined baking sheet. Chill until firm, at least 2 hours.Step 4Arrange chilled cookies on 2 fresh parchment-lined baking sheets, spacing 2\" apart; you should be able to fit about 12 cookies on each. Sprinkle cookies with sea salt. Bake, rotating top to bottom and front to back halfway through, until bottoms and edges are golden brown, 12–15 minutes. Let cool on baking sheets. Place a fresh sheet of parchment on 1 baking sheet and repeat process with remaining balls of dough.Step 5Do Ahead: Dough can be made 1 month ahead. Transfer chilled balls to resealable freezer bags and freeze. Bake from frozen.How would you rate Chocolate-Hazelnut Cookies?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleWould love to know which kind of kosher salt the measurement is for!Anonymous6/24/2021Best chocolate chip cookies I have ever had.  I will make them without hazelnuts for my wife who doesn't like the nuts.RJICPAParsippany, NJ2/1/2021These came out a bit too sweet for my taste. The ginger and honey flavors didn't come out that strong for me, either. Overall it was just okay. It reminds me of a white chocolate macadamia cookie, even though its dark chocolate and hazelnuts.DPLA12/6/2020I've tried this recipe four or five times now. The first few times, I used measuring cups and despite spooning the flour into the cups/leveling everything off, these cookies turned out inedible every time. I finally found my food scale again and tried this recipe and lo and behold, these cookies turned out great. I highly recommend using the \"pan banging\" method on these cookies. They puff up quite a lot in the oven and the tray that I banged on the counter 2-3 times turned out better looking than the others. \nI still feel like mine were missing something that the actual cookies from Ochre have, but I can't put my finger on it. If someone at Ochre reads this, please bring these cookies back!Samantha SwiftDetroit, MI11/19/2020My family loves these! I've made about three batches since quarantine started and even my siblings who don't really like nuts love these!\nAnonymousWashington DC4/4/2020These cookies were delicious!!! Loved them so much.New York11/25/2019The honey really comes through in the cookie in my opinion, definitely a different flavor with the combo of ginger. I would even add a little extra ginger next time - it'd be nice to have it even punchier. Nate GLos Angeles, CA10/7/2019Was intrigued by the fun additions in this recipe and its coming from a new bakery near me! Allergies so made these with vegan butter (Earth Balance) and 1/2 almond flour / 1/2 gluten-free flour (King Arthur's Measure-to-Measure). Awesome! AnonymousFerndale, MI10/6/2019My kind of fall cookie! The unexpected addition of ginger is a yummy, warm touch.AnonymousLansing, Mich.10/5/2019Reading the recipe and I need clarification when it says to: \"Bake, rotating top to bottom and front to back halfway through.\" Its mostly the front to back that is throwing me off. Thanks.ZmakYou.InkToronto, Canada10/2/2019These were amazing cookies! Don't overbake and you will get a chewy cookie that melts in your mouth. I used 12 oz. of chocolate chips, half milk and half dark. I like that the ginger was subtle - just enough to give the cookies an interesting flavor. AnonymousCincinnati 9/27/2019What is the honey for in this recipe? Just to bind or as an additional sweetener? Attempting to make this vegan. AnonymousNC9/22/2019Made this last night! I found them VERY hazelnutty - and instead of having a snap to the nuts, they get a little soft when baked. Still loved them but would probably add fewer nuts and more chocolate next time. Recipe felt like you could add in any kind of nut or chocolate and it would still be good - maybe next time I'll do peanuts with dark chocolate, etc. Could use even more ginger than recipe calls for, would add a good kick. Overall I liked the consistency and they were quite easy to make. Would make again.Anonymous941339/19/2019Explore Bon AppétitCookieDessertHazelnutNutChocolateOther IngredientsBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}