{"id": "218c41e38a7810cbec36634ce903a3cb", "url": "https://www.bonappetit.com/story/madhur-jaffrey-instantly-indian", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Madhur Jaffrey Gets Real About the Instant Pot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMadhur Jaffrey Gets Real About the Instant PotThe O.G. of Indian cookbook authors just wrote one of the best Instant Pot cookbooks out there.By Priya KrishnaMay 15, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen I found out Madhur Jaffrey wrote an Instant Pot cookbook, my first reaction was: why? Jaffrey is the O.G. of Indian cookbook authors. The one who blazed a trail for people like me to write a book that includes unconventional-but-loveable riffs like roti pizza and saag feta. She is arguably the greatest living authority on Indian food out there. Why would she care about a trendy gadget?But Jaffrey ain’t no fool. The Instant Pot is a full-on cultural movement—especially when it comes to Indian cooking. It makes sense, considering the ubiquity of pressure cookers in South Asian households. Consider this Instant Pot dal guide by yours truly. Or the viral butter chicken recipe from cookbook author Urvashi Pitre. So, Jaffrey told me, it makes sense that she would want to try out the gadget, and toss her wisdom into the ring.This is probably one of the best cookbooks to come out of the Instant Pot craze. It’s full of those timeless Indian recipes Jaffrey is known for, like Mulligatawny, mixed with a few new creations she developed just for the Instant Pot, like a spiced, quinoa and tomato stew. The flavor to ease factor ratio in these recipes is undoubtedly high, and, as always, Jaffrey’s calm, nurturing voice guides you through each step. What’s most refreshing about the book is that it’s not a full-throated endorsement of the Instant Pot; she understands the gadget’s flaws, and offers recipes built for its strengths.Jaffrey and I chatted over the phone about Instant Pot mania, and where she sees herself (and Indian food) within it.This book was not your idea, right? It took some convincing?Yes, my editor approached me. I was surprised at first, because I thought at first this is not quite something I would do. But I had come across so many Indians who cook with the Instant Pot. And pressure cooking goes back so many years in Indian cooking. So the publishing company sent me a pot and I began to learn.And you’d never used an Instant Pot, right?No, never. And I wasn’t sure I even wanted my editor to send me the pot. But she left me the choice.What was your initial reaction when you started cooking with it?I cooked many things unsuccessfully at first when I was following the ideas in the booklet. Like the rice. That rice button didn’t exactly work. It was too al dente. There is no al dente in India. And then when I said, “I am going to forget their directions and do it my way now,” that’s when things started to work.Are you someone who is generally pro-gadget, or do you like doing things in a more old-school fashion?I have a blender! I have a coffee grinder! I do like things that make my life easier. I haven’t yet gotten to the air fryer, but I am willing to try anything that can do multiple tasks, like an electric food chopper that I use to finely chop ginger, garlic, and onions. I do like working with my hands, but I am not a gadget-free woman.Madhur Jaffrey\nPHOTO BY CHRISTOPHER HIRSHEIMERWere you worried that, as someone who is known as this authority on traditional Indian cooking, that it would feel off-brand for you to do an Instant Pot cookbook?No, I never thought it would be weird. I only learned to cook after I was 20. I have never brought to cooking these great ideas of, Oh, we have to be purist. I am always willing to find shortcuts and I look for them. I am a working woman, and I’m getting older.There are so many Instant Pot cookbooks out there. And specifically so many Indian Instant Pot cookbooks. What are some ways you think your book will stand out? Aside from the fact, of course, that it’s written by you.I noticed people stayed away from fish. They didn’t want to touch it because it overcooks quickly in the Instant Pot. But I thought about a lot of Goan dishes, when you poach fish in liquid, so you can make the masala in the Instant Pot and then slip in the fish in, and it barely cooks. That works great.You mentioned earlier that you went rogue from the Instant Pot instructions when it came to rice. Where else did you go off-book?Dal is really easy to make in the Instant Pot, but I did not follow the booklet’s clever idea that you don’t have to soak beans. They were uneven when I cooked them and it took a long time to cook properly. I prefer soaking them.I don’t soak my dal. It’s an extra step! I get lazy.What are you complaining about? You’re not doing any work! You are putting them in a bowl and leaving them. Don’t get so lazy you can’t even soak beans.How long did it take you to write the book?I had just done this rap video [Author note: please watch this video], and it was just before I had to do some filming for a series, so I literally had two and a half months to write it.Wait…seriously? It took me a year to write my book, and that felt like no time at all!I just killed myself. Working day and night.When you were adapting your classic recipes to the Instant Pot, were there real home runs the first time you tried them?The Mulligatawany soup, the thickening of the chickpea flour and the taste of the ginger and garlic. It all came together so nicely, and so quickly, in the Instant Pot. That worked particularly well.After writing an Instant Pot cookbook, do you feel sold on the gadget? Would you call yourself a Pothead?I see the benefits of it, and I understand the people who want to cook literally everything in the Instant Pot. But that’s not me. I have dishes in the back of the book, for example, side dishes [like raita and tamarind chutney] that you don’t cook in an Instant Pot. You can’t have an Indian meal without these things. I don’t want to let those go.What do you think of the mania surrounding the Instant Pot?The Instant Pot is very convenient, but I also think people are mistaken in thinking the Pot will cook things for you. It won’t. You have to master the Pot.What is the Instant Pot good at? What is it bad at?It does beans and grains very well, as long as you follow my soaking instructions. It cooks beetroot really well too! I have a beetroot and tomato dish in the book that came out wonderfully. I don’t love the sauté function. I hate how when you put in the oil it will go to the side of the pot. And it takes a little while to get hot.Do you think the Instant Pot is uniquely good at cooking Indian food?Yes, I do think that’s true. The flavor of the spices is really well extracted in an Instant Pot. But again, I don’t think the Pot will just magically make Indian food for you.Looking at your cookbooks through the years, it’s been fascinating to see how your cooking is constantly adapting and evolving while managing to stay timeless.I am current! I live my life according to whatever year it is. My cooking evolves just like everything else evolves. I use microplanes, and I cook with quinoa, and there are a lot of quinoa dishes in this cookbook. I’m always looking at new ingredients and equipment and trying to see if they work for Indian food.Do you think the popularity of the Instant Pot will help Indian cuisine enter the mainstream? I feel like I am seeing more people cook Indian food at home than ever, and very often they are using an Instant Pot.I don’t know how to answer that. I hope so. I have been unable to predict this ever since my first cookbook [An Invitation to Indian Cooking] came out in 1973. Everyone said the time for Indian food is now, but it never really happens. The Instant Pot will certainly make the food more approachable, but there are still a lot of spices in Indian food.That’s the number one hesitation I get when I am trying to convince people that Indian food isn’t that hard. They are so intimidated by the spices.I don’t know why people are obsessed with the number of spices in a dish. People will say a dish can’t have any more than three spices but I don’t get that. If you can put in one spice you can put in 10 spices. You just pick up your hand and put the other spices in! But let’s see what the reaction to the book is.Buy it: Madhur Jaffrey’s Instantly Indian Cookbook is $15 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitIndianCookbooksInstant PotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Priya Krishna"]}