{"id": "21980cb0ddec5bc4e4dfccbd41290869", "url": "https://www.bonappetit.com/story/what-is-broccolini", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "What Is Broccolini, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Broccolini, Anyway?Is broccolini just baby broccoli, or what?By Alex DelanyMarch 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailBroccolini is definitely cute. That’s not up for debate. It has little florets and leaves and comes packaged in adorable little bunches. It just seems to be more graceful than big, green, clunky heads of broccoli in every possible way. But even though broccolini is cute, and even though the name might suggest otherwise, broccolini isn't baby broccoli. It just isn't. So...what is broccolini, anyway?Well, I'll tell you one thing: It sure isn't broccoli rabe either, even though it looks the part. Broccolini is more closely related to broccoli than it is bitter broccoli rabe, which is actually in the turnip family. Broccolini, like the broccoli we all know and love, is in the brassica family, along with cabbage and Brussels sprouts. But it isn't immature broccoli. It just isn't.Broccolini is actually a cross-breed of broccoli and Chinese broccoli, a leafy vegetable commonly referred to as gai lan in Cantonese or jie lan in Mandarin. You get the florets found in broccoli and the longer stems and leaves found in Chinese broccoli. It’s a pretty logical mix of the two.And when it comes to flavor, broccolini also lands somewhere in the middle. It's mellower and less bitter than standard-issue broccoli, with a mild sweetness much more akin to Chinese broccoli. But our favorite part of broccolini is its texture. The long stems have a pleasant crunch, and the ratio of stem to leaf to bud is pretty perfect, if you ask us.Quickly sautéed, broccolini is killer with some grains and tofu.\nPhoto by Chelsie Craig, Food Styling by Rhoda BooneCooking with broccolini is a dream. It requires a lot less prep than regular broccoli does—no stem-peeling necessary, all you have to do is cut off the last inch or so from the bunch and you're good to go. After that, you've got options. A quick toss in olive oil and a few pinches of salt is the simplest way to season them pre-roast or pre-sauté. Roasting broccolini around 425° will give you very crispy florets and perfectly-cooked stalks, while sautéeing over medium heat will make the broccolini tender throughout with just the right amount of snap in the stem. You can also grill broccolini in a grill basket to pick up a nice char or blanch the broccolini in boiling water for a few minutes for a fresh, snappy final product. The amazing thing about broccolini is that the stems are thin and tender, so you don't have to worry about overcooking the delicate florets waiting for the bottom parts to cook.Long story short: Getting broccolini into the rotation is easy. No special equipment or culinary degree required. Just treat it like prepped broccoli or string beans and you’re in the clear. But remember, even though it’s small, cute, and mild: It’s not baby broccoli.Now that you know what broccolini is, let's get to that recipe:Crispy Tofu with Coconut Quinoa and BroccoliniCrispy, craggy, and thoroughly coated in an addictive, peanut-y sauce, this tofu is so good that even the most stubborn carnivores won’t complain.View RecipeExplore Bon AppétitBasicallyIngredientsBroccoliBroccoliniRead Morerecipes37 Broccoli Recipes That'll Have You Craving Those Little Green Trees Every NightGallery37 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-05", "author": ["Condé Nast", "Alex Delany"]}