{"id": "21a928a50e9ddc9615ed16721441b82e", "url": "https://www.bonappetit.com/story/burned-out-and-burnt", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Burned Out and Burnt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureBurned Out and BurntHealthyish editor Amanda Shapiro on overcooking oxtails and battling news fatigueBy Amanda ShapiroMay 28, 2020FacebookTwitterEmailPhoto by John RawlingsFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I took my semi-annual break from this newsletter last week, for no other reason than that I was totally burned out. Instead of writing, I took a longer-than-usual walk with my dog and went on a YouTube quest to learn how to make Sichuan Boiled Fish. It was very nice, but if you think this letter is gonna be about how restored and revived I feel now, well, maybe go read about the best ways to use lentils instead.I don’t feel ~great~ still, because who does? At the very least, I feel grateful that I’m healthy and it’s summer and, by some measures, things seem to be graaadually moving in the right direction. For now. Maybe.I think that’s what’s so hard for me still: The not knowing from week to week or even day to day what the world—mine and ours and everyone else’s—is going to look like. It’s not like I go around thinking, “Damn, I’m so upset about all this uncertainty.” Instead I find myself organizing my fridge even more obsessively than usual. And throwing a fit when my oven’s temperature indicator somehow changes to Celsius and my braised oxtails burns to bits. (In case you’re wondering, 250° C is almost 500° F, and nothing in this world can survive seven hours in that kind of heat.) And lying on a couch last weekend and realizing, oh, I’m crying. Haven’t done that in a while.Another change: I still read too much Twitter and listen to too many news podcasts, but I’ve noticed some apathy setting in. Which is no surprise, I guess. When we bombard our brains with information, most of it negative, at a certain point it just shuts off. There’s a limit to how much bad we can absorb.I don’t want to feel apathetic right now. There’s too much work to be done, too much need. So I’m trying, counterintuitively, to let go a little so that I can care more. Instead of devouring news, I’ve been listening to music again, like this new album by my friend Todd that is good for walking. I’ve been walking a lot! I’ve been listening to podcasts that are not about the pandemic, like the latest season of Bodies, which is perhaps my favorite podcast of them all. I finally finished Three Women (so did Basically editor Sarah Jampel, and we HAVE to talk). I’ve been finding love.I’ve still been organizing, but less obsessively. I’m not quite ready for a Chaey-level pantry spreadsheet, but she did inspire me to tack a page to my fridge where I write down fresh items to use ASAP (mozzarella, so many herbs) and what’s overstaying its welcome in my freezer (wonton wrappers, frozen edamame) and pantry (dried chickpeas, canned tuna). Sometimes I scrawl out dinner ideas: “panang curry with chicken?” is there now. But that’s as far as I go with it. There’s a lot of blank space on that page, and I’m trying to be comfortable with that.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleIf You Care About WellnessBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "Amanda Shapiro"]}