{"id": "21ad5b5f5efe90bee6f5c4ef3d43c8b5", "url": "https://www.bonappetit.com/recipe/pollo-asado", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Pollo Asado Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPollo AsadoBy  Giovanna FavilliJuly 12, 20214.8(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich EmailPinterestPrintEmailPinterestPrintThe mouthwatering smell of pollo asado brings to mind so many memories of walking from my grandparents’ house to the neighborhood fritanga stand around the corner. Fritangas are an integral part of Nicaragua’s food identity. At these food stalls, chicken, pork, or beef are marinated in naranja agria (sour orange) and barbecued to charred perfection. The protein is usually accompanied with a hefty side of gallo pinto (rice and beans), fried plantains, and a cold “glass” of soda served in a plastic bag with a straw. Naranja agria is what gives this chicken recipe its signature flavor, but equal parts fresh orange and lime juice can also do the trick. —Giovanna Favilli, chef/owner Casita Verde, Lakeland, FLAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCharcoal Grill$98 $82 At AmazonInstant-Read Thermometer$35 At ThermoworksFlexible Plastic Cutting Mats$7 At AmazonScissors$17.95 At AmazonIngredients4–6 servings3½–4lb. whole chicken1bunch culantro or cilantro, tough stems trimmed1small onion, coarsely chopped2garlic cloves2chile congos or 1 habanero chile, stems removed1cup naranja agria (sour orange juice), or ½ cup fresh orange juice plus ½ cup fresh lime juice2Tbsp. plus 1½ tsp. achiote (annatto) paste1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus moreVegetable oil (for grill)Lime wedges (for serving)PreparationStep 1Spatchcock chicken by cutting along both sides of the backbone with kitchen shears or a sharp knife. Remove backbone (save for stock!) and turn chicken over on cutting board so it is resting breast side up. Press down on center of breast until you hear a crack (this will help the chicken lie flatter on the grill). Pat dry.Step 2Purée culantro, onion, garlic, chiles, sour orange juice, achiote paste, and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt in a blender until smooth. Place chicken in a resealable bag or large bowl and pour marinade over; turn to coat. Seal bag (or cover bowl) and chill at least 4 hours and up to 1 day.Step 3Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill); oil grate. Remove chicken from marinade, letting any excess marinade drip back into bag or container. Season chicken lightly with salt. Grill chicken, skin side up, over direct heat until lightly charred, about 5 minutes. Turn over and grill until skin is lightly charred, about 5 minutes. Turn skin side up and move to cooler part of grill. Cover and grill until an instant-read thermometer inserted into the thickest part of thighs registers 165°, about 1 hour. (If the chicken has reached temperature but needs a bit more color, return to hotter part of grill and grill over direct heat until darker, checking every minute or so.) Transfer chicken to a cutting board and let rest 10 minutes before carving. Serve with lime wedges for squeezing over.How would you rate Pollo Asado?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI've been wanting to try this marinade on chicken but as Thanksgiving approached, I thought 'Why not?'  So I doubled the recipe and into a huge brining bag it went for around 24 hours.  Turned it four times in the frig before putting it on my Egg with a hot brick on each breast, didn't bother searing it as suggested.  Just placed it skin side up on top of the platesetter for an indirect cook.  As it approached temperature, I removed the bricks to brown it up then removed it at 170, it was delicious.RichardPerry, GA11/26/2021We made the marinade and then marinated chicken cubes. After 4 hours, grilled on our charcoal grill and it was fantastic. I did use a jalapeno for the chile because it's what I had. AUByrdSavannah, Ga10/3/2021So cool to see a Nicaraguan recipe on BA! I've made this chicken twice now and it's SO JUICY. The marinade is so good I could drink it. Really awesome and easy upgrade for grilled chicken, AND it makes the best filling for tacos. I'm obsessed. AnonymousTAMPA7/30/2021Explore Bon AppétitCentral AmericanLatin AmericanNicaraguanChickenPoultryOrangeCitrusFruitHabanero ChileChileVegetableCilantroHerbs & SpicesMainDairy-FreeGluten-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-31", "author": ["Condé Nast", "Giovanna Favilli"]}