{"id": "21b3f81275f8e19151217d30648be8b9", "url": "https://www.bonappetit.com/recipe/sweet-coconut-rice-with-pigeon-peas", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Sweet Coconut Rice With Pigeon Peas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueSweet Coconut Rice With Pigeon PeasBy Ayesha CurryNovember 23, 20214.5(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Eva Kolenko. Food styling by Susie Theodorou. Set design by Kira Corbin. On set producer: Jennifer Thomas.EmailPinterestPrintEmailPinterestPrintGrowing up, special occasions meant rice and pigeon peas for actor and cookbook author Ayesha Curry. Enriched with coconut milk and ginger, her take on rice and peas is made for soaking up all the juices from meaty main courses and saucy side dishes, but it also works great on its own as a one-plate vegan lunch or supper. Curry’s advice? Make a double batch. You’ll want leftovers.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMesh Sieve$13 At AmazonOXO Good Grips® Smooth Edge Can Opener$22 At AmazonGlass Measuring Cup$19.99 At AmazonMedium Saucepan$39 At AmazonIngredients8 Servings2cups jasmine rice1shallot, finely chopped1garlic clove, finely chopped12\"-piece ginger peeled, finely chopped25-oz. cans pigeon peas, rinsed113.5-oz. can unsweetened coconut milk2Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt1Tbsp. dark brown sugar¼tsp. dried thyme¼tsp. ground allspice¼tsp. freshly ground black pepperChopped parsley (for serving)PreparationStep 1Rinse rice in a fine-mesh sieve under cold water until water runs mostly clear. Transfer to a medium saucepan. Add shallot, garlic, ginger, peas, coconut milk, salt, brown sugar, thyme, allspice, pepper, and 1½ cups water. Stir to combine and bring to a boil. Reduce heat to low, cover pot, and cook until all of the liquid is absorbed and rice is tender, 18–20 minutes.Step 2Fluff rice using a fork. Transfer to a large shallow bowl and top with parsley.How would you rate Sweet Coconut Rice With Pigeon Peas?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSO yummy. and easy to make. AnonymousBaltimore2/7/2022Explore Bon AppétitCoconutFruitRiceRice & GrainsDinnerVegetarianVeganLunchWeeknightEasyQuick And EasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ayesha Curry"]}