{"id": "21b478bddc856bd28e5d36d095a7e9db", "url": "https://www.bonappetit.com/recipe/black-eyed-pea-masala-with-kale", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "Black-Eyed Pea Masala With Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlack-Eyed Pea Masala With KaleThis satisfying vegetarian stew is recipe developer Rachel Gurjar’s riff on North Indian-style lobia masala. Black-eyed peas soak up the flavors of an onion- and tomato-based gravy along with kale or any greens you’d like.By Rachel GurjarDecember 27, 20204.4(88)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrint“Black-eyed peas are commonly used across India and go by the names lobia, longi, alasande kalu, and chawli, among others. In Maharashtra, they’re made into usal using fresh coconut and fennel seeds. In the Southern part of India, they’re made into a dry or saucy curry using spiced coconut paste, or soaked and blended into a batter for vadas.“As a kid in boarding school, I remember not fully appreciating them. They were something I would reach for only when all else failed—the snooze-you-lose-situation in the dining hall. Life came full circle when everyone was hoarding beans at the beginning of the pandemic and I found myself standing in the canned foods aisle, staring at what was left. Here they were rescuing me yet again.“In this recipe, it’s important to cook the base of the masala until you see it has a jammy texture, at which point it will stick to the bottom of the pan. This ensures your gravy won’t be bitter or watery. You could use other greens, like Swiss chard, collard, or spinach, though you may need to increase or decrease the cook time accordingly.” —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8-Inch Chef's Knife$47 At AmazonIPOW Stainless Steel Fine Mesh Strainers, Set of 3$12 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Pot with Lid$155 At AmazonWooden Spoon$6 At AmazonIngredients4 servings1large white onion4garlic cloves11\" piece ginger1bunch Tuscan or curly kale315.5-oz. cans black-eyed peas¼cup extra-virgin olive oil or vegetable oil2Tbsp. plus 1½ tsp. ground coriander1tsp. ground turmeric1tsp. garam masala½tsp. cayenne powder114.5-oz. can crushed tomatoes1Tbsp. plus 1½ tsp. Diamond Crystal or 2¾ tsp. Morton kosher saltCooked rice, roti, or sourdough bread and lime wedges (for serving)PreparationStep 1Prep your ingredients: Finely chop 1 large white onion. To do this, start by cutting it in half through root end. Trim top, then peel away skin and first tough layer; discard. Leave root end on. Starting close to the board and moving upward, thinly slice through onion parallel to cutting board, leaving root end intact. Make thin lengthwise slices across onion, leaving root end intact. Slice onion crosswise, working from top to bottom to create small cubes. Run your knife through once more if any pieces are too big. You should have 2–3 cups chopped onion.Step 2Smash, peel, and finely chop 4 garlic cloves. Peel one 1\" piece ginger with a spoon, then slice into planks. Stack 2 planks at a time and cut into thin matchsticks. Set aside. Remove ribs and stems from 1 bunch Tuscan or curly kale and discard. Tear leaves into 2\" pieces. Rinse three 15.5-oz. cans black-eyed peas in a fine-mesh sieve.Step 3Heat ¼ cup extra-virgin olive oil or vegetable oil in a medium pot over medium-high. Cook onion and garlic, stirring often, until golden, 10–12 minutes.Step 4Add 2 Tbsp. plus 1½ tsp. ground coriander, 1 tsp. ground turmeric, 1 tsp. garam masala, and ½ tsp. cayenne powder to pot and cook, stirring constantly, until incorporated and fragrant, about 3 minutes. Add one 14.5-oz. can crushed tomatoes, bring to a simmer, and cook, stirring often, until sauce darkens and thickens, 10–14 minutes. The sauce should look jammy and will start to stick to the bottom of the pot.Step 5Add black-eyed peas, 1 Tbsp. plus 1½ tsp. Diamond Crystal or 2¾ tsp. Morton kosher salt, and 4 cups water and stir to combine. Add kale in 2 batches, stirring and letting wilt slightly between additions. Bring to a simmer, reduce heat to medium-low, and cook until beans are tender and kale is tender, about 10 minutes.Step 6Remove pot from heat and stir in reserved ginger.Step 7Serve masala with rice, roti, or sourdough bread and lime wedges for squeezing over.How would you rate Black-Eyed Pea Masala With Kale?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI quite enjoyed it.Thomas DycusWashington, DC1/20/2022Rather than 4 cups of water, I used 1 cup veg broth and a can of lite coconut milk - that worked great. I also added some coconut aminos at the end. Will make again!NatalieRI1/13/2022Good spices, but otherwise a little  boring.AnonymousBoston, MA1/13/2022Really good recipe overall.  Maybe my Cayenne is extra aggressive because this came out super spicy.  I fixed the spiciness by adding 1 can of coconut milk.  I also followed the guidance of others here and used much less water.  I think the ideal mix would be 12 oz water and 12 oz coconut milk.  With those changes, this was delicious.Ian GLos Angeles, CA1/12/2022This is a flawed recipe but well worth tinkering with.   As so many people have stated, 4 cups of water is far too much compared to the recommended cooking time.   I only used 1 1/2 cups without even reading the comments because I could tell it was going to be way too much, and even then it only worked because I used ingredients which needed longer cooking.   I didn't have black eyed peas or kale so kept the base and used a mix of white beans, green peas, spinach and potato.  I finished the dish by stirring in a big dollop of a lovely, complex, green Indian chutney.   I didn't use the ginger because I forgot at the beginning and no way was I adding raw ginger further into the cooking process.   I served with sourdough because I didn't feel like rice, and a dollop of thick yoghurt and it was excellent.  I'll make (my version) again.  ChrisBrisbane, Aus1/7/2022This recipe is great. I followed it as written except rather than cutting the ginger into planks, I minced it and added it with the onion and garlic. If you drain and rinse your canned black-eyed peas (as the recipe indicates) and follow the other timings, the 4 c. of water is accurate.JeffRoaring Spring, PA1/3/2022I made this for New Years Day with Sea Island Peas and red chard.  I finely sliced the chard stems and sautéed them with the onions and garlic.  I added the ginger then.  The recipe does not seem to say when to add ginger.  I used vegetable stock instead of water and heated it to boiling, blanched the chard leaves and then added it to the pea mixture as my tiny peas did not need to cook any longer. LaDona1/2/2022Good dish and I’m glad I read the comments. 1 1/2 cups water was plenty. It is annoying that BA publishes recipes with defects like this one and when readers point out the issues, no correction is made, unlike most other recipe blogs I use like Smitten Kitchen or Cookie and Kate. I know BA has a huge staff, but I guess the editors and authors don’t care about correcting errors. They couldn’t  have tested the recipe using 4 cups water and concluded that was a good idea. Also, putting in raw ginger is strange because it is tough so I sautéed it with the onions. Tina DDenver , CO11/9/2021The end result is good but this recipe is written strangely! I have made this twice and never added any water. I can't imagine why the writer says to do that. Maybe she or he wants you to cook the kale separately. I just added the kale in after the tomatoes. There was enough moisture to steam the kale. I suppose if yours is dry you could had half a cup of water. Also why does the recipe go into great detail about how to chop an onion? Weird. Finally, I don't understand what you're supposed to do with the ginger -- eat it raw alongside the dish? What?!?! If you use common sense and make this in a sensible way, it's good.AnonymousRichmond, Virginia 10/18/2021Regarding printing recipes:  open a Word doc then copy and paste the recipe into the doc. Having done that, you can edit, make notes, change fonts and anything you want - the world is yours!AnonymousBig Bend of Texas7/20/2021This was delicious and so easy! Like other reviewers, I reduced the water to 3 cups. We like a thicker sauce so that suited us well. You could probably even do 2 or 2.5 depending on your preference. I agree with another reviewer that the servings are closer to 6. We had it for dinner last night (2 servings) and I expect we'll get at least 2 lunches each from it for a total of 6. Just a note so you can plan accordingly. All in all though, amazing recipe that's easy, vegetarian, filling, and delicious!Anonymouschicago, il2/9/2021When you have a recipe using canned beans (in this case, black eyed peas) please include the equivalent for dried beans. Paul AxinnTucson AZ2/9/2021Sooo good. It’s sweet and spicy and aromatic and soooo good. I had dried black eyed peas, so I rinsed and cooked those first and it was perfect! CailaNapa, CA2/4/2021Print recipe by pressing Ctrl p on your keyboard.Anonymouschicago, Il1/29/2021This dish showcases black eyed peas beautifully and is a good template for alterations. I made it twice - once for new years and again with the left over beans. I used dried black eyed peas and pressure cooked them with some garlic and a quarter onion. The second time, I used coconut oil instead of EVOO, finely chopped 2 Tbsp ginger and sautéed with the onions and garlic (also did matchsticks at the end), added finely chopped spicy peppers with the spice dump and used 3 cups homemade chicken stock instead of water. Ski DaddyDenton, TX1/12/2021Explore Bon AppétitRice and Grain BowlIndianSouth AsianAsianBlack-Eyed PeaBeanVegetableKaleLeafy GreensEasyMainVegetarianSimmerNew Year'sDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-27", "author": ["Condé Nast", "Rachel Gurjar"]}