{"id": "21be7c50c4c117660cd4afc0426aec3e", "url": "https://www.bonappetit.com/story/party-tricks-alison-roman-tropical-fruit", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Alison Roman Wants You to Know That Tropical Fruit Is Seasonal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAlison Roman Wants You to Know That Tropical Fruit Is SeasonalLike fresh farmstand berries in the summer, a platter of tropical fruit is winter's most perfect, effortless dessert.By Alison RomanFebruary 14, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Think back to early December, your heart full of optimism, picturing all the festive treats you’d bake this winter. Morning buns every morning, apple galettes every night, won’t we be warm and cozy! Well guess what. Winter isn’t coming: It’s here, and the enthusiasm that once inspired you to lug your stand mixer down from the top of the fridge is gone, replaced by laundry bags overflowing with long underwear and an intolerance for the word \"cozy.\"It’s easy to get lost in this despair. But despair not, because a trip to The Tropics is just around the corner, baby. That’s right: hyper not-local but very much in-season Tropical Fruit is here to delight your dinner party guests and save you all from seasonal affective disorder. (It's best not to dwell on the fact that, somewhere far, far away, the weather is warm enough to ripen things on trees right now. Just buy the fruit and don't ask too many questions.)Photo by Alex LauSpears of vibrant, overly-ripe mango, rings of juicy papaya, neon pink hunks of “what-is-that?” (it’s dragon fruit and it’s pretty awesome), served with a lightly sweetened 50/50 whipped cream-Greek yogurt mixture for dipping and spooning and fun-having will have you transported to a sunnier place, forgetting all about the gray nightmare that is February. This dumb-simple setup is winter's answer to summer's best and simplest dessert—ripe farmers' market berries and a plop of whipped cream—and if anybody looks at you funny when you bring that platter of sweet, sweet fruit to the table, their expression will change as soon as they slurp down their first slice of ripe, tangy pineapple.The whole things takes about as much effort as you have to give this month—which is to say, almost none at all—and it’s a great time of year to embrace the part of you that’s always wondered what a horned melon tastes like. So live that life!More of Alison Roman's party tricks, right this way...Bad Wine Is Just a Great Cocktail Waiting to HappenIn Alison Roman’s new column, Party Tricks, the ‘Dining In’ author defends the wine spritzer.View StoryExplore Bon AppétitBasicallyParty TricksMangoTropical FruitDessertPineappleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-14", "author": ["Condé Nast", "Alison Roman"]}