{"id": "21c0917acdbaa9e9f909ca8017d5cbd3", "url": "https://www.bonappetit.com/story/would-you-go-running-in-jeans", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Would You Go Running in Jeans? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWould You Go Running in Jeans?Reading recommendations and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroOctober 17, 2019FacebookTwitterEmailPhoto by William ConnorsFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’ve never been on a wellness retreat, or any other kind of retreat for that matter. I’m just not much of a group travel person; the thought of going somewhere for multiple days with strangers to find my inner warrior princess or get over a breakup just doesn’t sound like my idea of a vacation. I can’t say that Sarah Treleavan’s story on self-empowerment retreats changed my mind, but it did make me curious. I’d take self-empowerment over weight loss or yoga (which is often weight-loss by another name) any day, but I think the question she poses at the end of her two-day “I Am Worth It” retreat experience is the same one I’d be asking: “What exactly were we accomplishing?”Speaking of weight loss, the idea that how much we weigh is solely based on our own choices—what we eat, how much we exercise, how well we “take care of ourselves”—is a dangerous and intractable belief, and one that’s fueled all kinds of body-shaming and disordered behavior. But there’s more and more research, as this article points out, showing that the global increase in obesity could be way outside our individual control. Consider that all kinds of animals, from monkeys to marmosets, also weigh more than they used to, and that viruses, chemicals, and even temperature and light might be affecting the numbers on the scale.#DoingThingsInJeansAnd while we’re on the subject of debunking myths, turns out Himalayan pink salt isn’t better-tasting, healthier, or more sustainable. It’s just salt. That is pink.One thing that’s not a myth: The deliciousness of these Granola Cluster Cookies, which are gluten-free and dairy-free and now at the top of my To Bake list after I rediscovered this vintage video (okay, it’s from 2017) of Carla making them.I have no good segue for this last link, other than to say I’m here for all the new aesthetically minded sex toys and related products mentioned in this GQ piece. Because sometimes you forget to put your gold bangle handcuffs away in your vice drawer (don’t act like you don’t have a vice drawer) before the fridge repair person shows up. But at least you can prove that you have good taste.My other kink: making vegetarian arepas.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleBreakfast Pastries, Work Lunches, and the Perfect LasagnaBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Amanda Shapiro"]}