{"id": "21c5d359cd21cd8ce83c000d17d4d658", "url": "https://www.bonappetit.com/story/tostones-are-the-ultimate-party-snack", "year": 2019.0, "month": 12.0, "day": 5.0, "content": "Why Tostones are the Ultimate Party Appetizer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTostones Are the Ultimate NYE Flex Hot chips, cool dip.By Carla Lalli MusicDecember 29, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina Boytsova FacebookTwitterEmailI’ve got nothing against warm vats of queso or artichoke dip, but when I think party, I think “hot chip, cool dip.” Which is why tostones, a.k.a. patacones—twice-fried plantain chips that I’m partial to dunking in a chilled, creamy, spicy cilantro sauce—are one of my all-star entertaining appetizers. As far as party foods go, they’re a winner: Tostones check off the salty-crunchy category, they’re finger-food-friendly, they’re budget-friendly (four green plantains will yield about 6–8 chips per person, plenty if you’re serving another snack or two), and they’re extremely easy to make. Most importantly, they’ll make you look like an incredible host.Now frying might not seem like a great party trick, but there’s a difference with these. There’s no dredge, batter, or coating to deal with—just the plantain coins, the oil, and some salt. Therefore, minimal splatter, zero batter, and very few ingredients. The plantains need only a couple of minutes in the oil total, which will seem like a momentary blip if you’ve ever patiently tended to bone-in pieces of buttermilk-fried chicken. And while the mere ½ inch of oil (it's more of a shallow-fry than a deep-fry) should be at 375°, and I recommend using a digital thermometer to check, you can test without one: If a plantain slice sinks soundlessly to the bottom, the oil isn’t hot enough. If the oil is smoking, it’s too hot. If the plantain joyously bubbles and floats to the top within 10 seconds, you’re good to go.Frying the plantains happens in two stages: During the first fry, the plantain pieces soften so that they’re smashable; during the second fry, they finish cooking through, take on a golden brown color, and get crispy. After the initial fry, squish the plantains. This step has to be done when the plantains are still very warm and pliable, otherwise the flesh will harden right back up. But once you’ve smashed, you can turn off your fry oil, set the chips aside, put away your cutting board, and wait until your first guests arrive. This timeline fits perfectly into my overarching party philosophy: If you actually want to have fun, the key is to do fewer things, and to do as much as you can ahead of time.Smash 'em while they're hot.\nAnd my cilantro dip also helps: After blending chopped cilantro, half a chile, sour cream, fresh lime juice, a splash of water, and some salt, the tangy sauce can be poured into the bowl you want to use for serving and refrigerated for several hours (or covered, for days). Dip: done.Not everyone has a party apron, but if you do, now’s the time to put it on. The second fry is your time to shine. The only thing better than eating freshly-fried tostones is getting to watch someone make them just for you. Everyone at a party wants to feel taken care of, and it’s so easy to do that and make your friends think you are some kind of snack sorceress when you gracefully lift just-fried tostones out of the fryer, shower them with kosher salt, and demonstrate how to dunk. Once they’re re-submerged in the same pot of hot oil, the smashed plantains, need 3 minutes to brown and crisp, and during that time, you are the star.Not pictured: Your party apron.\nWhile saying humble, reassuring things like, “Seriously, anyone can do this!” take a look at the happy people you’ve convened. They’re excited. They’re in awe. They’re optimistic. They’re here for you. Once the tostones hit the platter, it will be their turn on center stage. That’s okay—you proved your point. Hang up your apron and grab yourself a drink. After all, it’s your party.Get the recipe:Tostones With Creamy Green SauceThe double-fried, extra-crispy plantains will never be as good as they are immediately after coming out of the hot oil, but you can hold them in a warm oven if absolutely necessary.View RecipeExplore Bon AppétitNew Years EveNew Year's DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-29", "author": ["Condé Nast", "Carla Lalli Music"]}