{"id": "21d09f07e2098daa61654115e616fbe0", "url": "https://www.bonappetit.com/recipe/dinner-salad-with-radicchio-and-roasted-sweet-potatoes", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Dinner Salad with Radicchio and Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueDinner Salad with Radicchio and Roasted Sweet PotatoesBy Molly BazMarch 19, 20195.0(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSalad for dinner? No, we're not kidding. Eggs and roasted sweet potatoes make this salad recipe a full meal, not a sidekick. Feel free to swap in whatever protein (like chickpeas, rotisserie chicken, or roasted salmon) and roasted vegetables (brussels sprouts, carrots, broccoli) you may have on hand.Ingredients4 servingsSpicy Cashew Dressing½cup salted, roasted cashews¼cup vegetable oil3Tbsp. unseasoned rice vinegar¾tsp. crushed red pepper flakes¾tsp. fish sauce¾tsp. honey1garlic cloveKosher saltSalad4small sweet potatoes (about 1½ lb. total), scrubbed, halved lengthwise2Tbsp. extra-virgin olive oilKosher salt4large eggs2heads of radicchio (about 1 lb. total), quartered, cores removed, leaves separated1small fennel bulb, quartered lengthwise, thinly sliced lengthwise2Tbsp. unseasoned rice vinegarFlaky sea salt½cup crushed salted, roasted cashews½cup cilantro leaves with tender stemsPreparationSpicy Cashew DressingStep 1Blend cashews, oil, vinegar, red pepper flakes, fish sauce, honey, garlic, and ⅓ cup warm water in a blender until very creamy, smooth, and pourable. Taste dressing and season with salt.Step 2Do Ahead: Dressing can be made 3 days ahead. Cover and chill.SaladStep 3Place a rack in middle of oven; preheat to 425°. Place sweet potatoes on a rimmed baking sheet, drizzle with oil, and season with kosher salt; turn to coat. Arrange cut side down; roast until tender and cut sides are browned, 20–25 minutes. Let cool.Step 4Bring a medium pot of water to a boil. Carefully lower eggs into water and cook 8 minutes. Transfer eggs to a bowl of ice water and let cool. Remove eggs from ice water, pat dry, and peel.Step 5Toss radicchio, fennel, and vinegar in a large bowl; season with sea salt. Drizzle ½ cup dressing down sides of bowl. Using your hands, fold salad, working from the bottom out toward the sides of the bowl, until evenly coated in dressing.Step 6Transfer salad to a platter. Tear sweet potatoes and eggs into 1½\" pieces and nestle into salad. Season egg yolks with sea salt. Drizzle more dressing over and top with cashews and cilantro. Serve with remaining dressing alongside.How would you rate Dinner Salad with Radicchio and Roasted Sweet Potatoes?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleAbsolutely amazing!! Love the colours in this salad just makes me think of Spring & Summer wrapped into 1😍\nI never had radicchio before - first time and it’s a great mix. \nThis will be my new dressing for 2021 👍🏽👍🏽AnonymousOnt. CA2/28/2021FANTASTIC. I usually modify almost every recipe I make - this was was fabulous as is.  I'm generally not a fan of radicchio or raw fennel, but the combination of all these elements (particularly with the roasted sweet potato) was a winner.  My family loved this. This salad is best eaten day of, however - I wouldn't recommend leftovers (not that you're likely to have any).  MAKE THIS, you won't regret it, such an interesting combination of flavours. Neha AggarwalNiagara, Ontario11/29/2020hooo boy does this recipe have everything I hate: confusingly sweet potatoes (but they're a savoury food???), bland cashews, soapy cilantro, and so-bitter-it-might-be-poison radicchio. HOWEVER, I had a stray fennel in the vegetable drawer, two aging sweet potatoes on the counter, and was craving a creamy nut-based dressing on a filling salad. BA, gotta hand it to ya, this recipe absolutely delivered and blew it out of the park. The bitter radicchio leaves and fennel were dashing dressed in the spicy cashew dressing and the sweet potato added a perfect amount of heft. I omitted the fish sauce in the dressing since I didn't have any and it was still perfect. I tried it with boneless short ribs the first night and with two boiled eggs the second night. I can easily see myself subbing in dry poached chicken breast but the steak was the best version. If you plan to make this ahead, make sure to roast the sweet potatoes as you need them, they don't keep very well overnight.CookSorceryBoston4/16/2020hooo boy does this recipe have everything I hate: confusingly sweet potatoes (but they're a savoury food???), bland cashews, soapy cilantro, and so-bitter-it-might-be-poison radicchio. HOWEVER, I had a stray fennel in the vegetable drawer, two aging sweet potatoes on the counter, and was craving a creamy nut-based dressing on a filling salad. BA, gotta hand it to ya, this recipe absolutely delivered and blew it out of the park. The bitter radicchio leaves and fennel were dashing dressed in the spicy cashew dressing and the sweet potato added a perfect amount of heft. I omitted the fish sauce in the dressing since I didn't have any and it was still perfect. I tried it with boneless short ribs the first night and with two boiled eggs the second night. I can easily see myself subbing in dry poached chicken breast but the steak was the best version. If you plan to make this ahead, make sure to roast the sweet potatoes as you need them, they don't keep very well overnight.CookSorceryBoston4/16/2020So good, I wished I was hungry for another salad. Loosely followed this in quarantine - dandelion greens, fennel, romaine, roasted squash, peanuts, basil.. oh and poached eggs. Dressing / seasoning I followed to a T and JIMINY CRICKETS this is delicious. It's refreshing! It's crazy crunchy! And the flavors just *sing.* this will be a staple from now on. Thank you Chef Molly 🙏🏽AnonymousMadison, WI4/16/2020This salad was a total hit, even in mid winter in Gloucestershire. Since I do not have access to all the recommended ingredients in the west of England, I improvised. No radicchio so I used red and white chicory. Regrettably there was no cilantro so I had to skip it. I added an avocado for a little extra oomph. I made some oven pita chips to serve alongside. Terrific dinner!! AnonymousGloucestershire, England1/17/2020Impatiently waiting for sweet potatoes to finish roasting.    Been eating salad and fish.    You guys call it a salad so that still counts right?    Cashew dressing amazing BTW.    CANT WAIT TO EATAnonymousBolton Ontario 1/16/2020I have never been a salad kinda gal-- but this one changed. Me. This bad boy is hearty and I didn't feel hungry after eating it, which has never happened to anyone who has ever eaten a salad ever. Could not rec moreNatWatAustin, TX9/10/2019Ok... I took major liberties with this recipe but once I saw it I had to make it for tonight's dinner. On hand I had eggs, sweet potatoes, arugula, brussel sprouts, and some left-over Toum from Andy Baraghani's recipe (stores very well in the fridge, BTW).  I literally boiled eggs, cooked sweet potatoes, threw them on top of arugula with warm brussel sprouts and served it with Toum on the side to my family, including 'discerning' 3- and 5-year-olds.  It was un-fussy (and not exactly the recipe), but everyone loved it. And the kids ate the brussel sprouts.  Winning.AnonymousDenver, CO5/21/2019I haven't yet tried this but plan to ASAP. Is \"tearing\" eggs correct? They don't look torn in the photo.etakwisc5/20/2019This salad was great! It’s kind of a production getting all of the components ready, but every ingredient really shines in the finished dish so I wouldn't skip anything. The only disappointing thing was that the leftover radicchio got soggy in the dressing, so if you’re planning on leftovers (which you probably should since this makes a ton), maybe only massage the dressing into as much as you’re going to eat right away.soapnanaChicago4/18/2019I modified this salad as a first course appetizer and would like to make some suggestions. It turned out not just delicious but $%^@!! DELICIOUS!! I left out the eggs and the cashews from the actual salad to make it lighter. I also used cashew butter instead of cashews for the dressing which made for a creamier texture. I also substituted sesame oil for the oil in the recipe which turned out to be a stroke of genius. Am making it again asap.AnonymousLos Angeles4/17/2019This recipe is great! I made the dressing vegan by swapping the honey for maple syrup and the fish sauce for soy and it still tasted amazing. I also used 1 can of chickpeas instead of eggs.  Easy and satisfying.  I'll definitely make it again. cassidy.haightRichmond, VA4/8/2019My friend made this for dinner and it was AMAZING! I polished off at least half the salad on my own. Definitely planning to make it again myself!\n\nI'd also love the nutrition facts for this salad if they're available!AnonymousOrange County, CA4/7/2019This salad was really good! Can you supply the nutritional info?Madison, WI4/3/2019Explore Bon AppétitSaladSweet PotatoPotatoVegetableEggRadicchioChicoryLeafy GreensFennelCashewNutWinterFallMainGluten-FreeDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}