{"id": "21d3bd0867fa447eaac9df66b8f46437", "url": "https://www.bonappetit.com/story/ayurvedic-chef-nira-kehar", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Ayurvedic Chef Nira Kehar on Wellness Fatigue and Mindfully Made Poutine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAyurvedic Chef Nira Kehar on Wellness Fatigue and Mindfully Made PoutineHer dog and her cookbook have the same name.By Aliza AbarbanelMay 7, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt’s breakfast time on a rudely cold spring morning in Manhattan, and Nira Kehar knows exactly where to go. Striding across the street in fashionably chunky, borderline orthopedic Chanel sneakers, she enthusiastically recommends grabbing breakfast at The Smile. (It’s right around the corner! Her husband, Danish musician Mikkel C. Hess, sometimes records down the street!) Plus, they’re fine with dogs. Hidden amidst her very Manhattanite tangle of bags sits Ojas, a calm yet alert chihuahua-terrier mix who, not coincidentally, shares a name with Kehar’s new cookbook: OJAS: Modern Recipes and Ancient Wisdom for Everyday Ayurveda.Kehar has worn many hats, most notably as the chef-owner of Chez Nini in New Delhi. In 2014, she self-published Eating Stories, an art book made to accompany her dinner at the James Beard Foundation. The new cookbook combines recipes for mindfully made food with the Ayurvedic practices that have guided her life.Kehar grew up in Montreal, where she spent her childhood in her local library reading Paramahansa Yogananda’s Autobiography of a Yogi—a 500+ page tomb she describes as “my version of Harry Potter.”  She attended culinary school in Quebec, completed a three-month culinary internship in New Delhi, and stayed for over a decade. There she opened the French brasserie Chez Nini, which drew crowds and press with chic decor and spiced coq a vin.After six years, Kehar left Chez Nini to return to the subject of her childhood daydreams: Ayurveda. “When you tell someone you’re a chef, they immediately share stories with you and trust you,” Kehar says. “I felt that trust warrants really mindful cooking, and the stuff we love to eat every day has to be able to be Ayurvedic.”Ojas the dog\nPhoto by Emma FishmanAyurveda is rooted in connection to the inner self, the people around us, and the world we all share. Accordingly, OJAS divides the calendar year into twelve distinct seasons, each named for a house of the zodiac. It’s a kind of hyper-seasonal eating that puts most farm-to-table restaurants to shame. Also, the celestial imagery and vibrantly hued recipe photos are stunning—beautiful enough to imagine using it as an especially useful 250+ page coffee table book.Kehar’s recipes combine mainstays of traditional Ayurvedic cooking with the high-impact, imaginative cooking found at restaurants today. Chicken liver confit with urad dal curry is precluded by an herby spring khichdi, a riffable and restorative stew that’s a cornerstone of Ayurvedic eating. Early fall brings a recipe for onion ring poutine—a mainstay of Chez Nini meant to be consumed in Libra season, which Kehar notes is the appropriate time to indulge in “more mindfully made poutine.”As many people in search of wellness eliminate ingredients with the frequency and speed of deleting emails, the inclusion of poutine (albeit poutine made from coconut flour and ghee), is refreshing. Kehar says she’s frequently approached by people searching for health, but completely overwhelmed by the multitude of diets and online dialogue. “Don’t make any hard and fast rules or be too rigid with yourself about anything,” she says. “Listen to that little voice and take things that work for you—and also be willing to be a little bit strict about certain things.” This acknowledged flexibility carries over into the book (some recipes pair fruit and dairy, which is commonly thought to be incompatible), and into Kehar’s own life as well. Between bites of her bagel plate, she brings up her love of wine, and her calm eyes crinkle in an easy smile.Over the course of her own Ayurvedic education, Kehar was particularly inspired by the teachings of David Frawley and chef Richard LaMarita, who introduced her to the concept of ojas: the vital life force that guides body and mind. “A lot of people want to disassociate yoga or Ayurveda from a spiritual aspect. It’s not dogmatic or religious, but it is spiritual,” says Kehar. “Spirituality doesn’t [necessarily] have to do with religion. It has to do with a love and connection to yourself. When your higher purpose becomes achieving and climbing a ladder that is fictional, it takes you out of your body. So then it’s like, ‘Okay, what am I doing? Am I in my body? What do I like to eat?’”Kehar believes wellness means finding a path back to our natural selves, and she sees OJAS as a way to build the necessary knowledge and intuition. Despite its heavy binding and gold-lined pages, her book is not a bible. Rather, it is a foundation for pursuing happiness by rebuilding a connection to our inner selves—and who doesn’t want that?When we climb up from the restaurant’s sunken entrance to the street above, it feels like my mind has been freshly laundered and hung out to dry in the sun. The small, anxious corner of my mind, often rabid for self-improvement but overwhelmed by action, is quiet. I go home and page through OJAS, looking for what sticks. I call it intuition.Explore Bon AppétitHealthyishChefsCookbooksprofileRead MorecultureWhat to Eat for How You Feel and Other Lessons From an Ayurvedic ChefBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-07", "author": ["Condé Nast", "Aliza Abarbanel"]}