{"id": "21d6405e07cb8b757f499567e8ed5e63", "url": "https://www.bonappetit.com/recipe/quite-possibly-the-best-chickpeas", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Best Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesQuite Possibly the Best ChickpeasBy Chris MoroccoDecember 26, 20184.7(98)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis hands-off method was inspired by Mina Stone, author of Cooking for Artists, who swears by adding lemon zest and olive oil for brightness and full-on flavor. We wholeheartedly agree! This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients8 servings1lb. dried chickpeas, soaked overnight, drained1medium onion, thinly sliced6garlic cloves, crushed23x1\" strips lemon zest¼cup extra-virgin olive oilKosher salt, freshly ground pepperPreparationStep 1Combine chickpeas, onion, garlic, lemon zest, oil, and a couple big pinches of salt in a large pot. Add 2 quarts water and stir to combine. Bring to a boil, then reduce heat to medium-low and simmer, stirring occasionally and replacing any water that evaporates, until chickpeas are tender, about 2 hours. Taste and season generously with salt and pepper. Let cool.Step 2Do Ahead: Chickpeas can be made 6 days ahead. Transfer to an airtight container and chill.How would you rate Quite Possibly the Best Chickpeas?Leave a ReviewTell us what you thinkReviews (58)Back to TopTriangleI've made these many times and am always surprised at how good they are!  So simple to do.  Definitely more than the sum of their parts!\nIrene BNorwich, England1/9/2022I had a bag that I didn’t know what to do with. Used the crockpot idea that was posted. Added bacon and some tomato purée because that’s how I cook beans, along with the recipe ingredients. Near the end I added some leftover collard greens.  I usually add lemon juice to beans so the zest was a change. It’s a pretty good recipe. JaciYucca Valley California 1/7/2022To avoid any bitterness, make sure there is no white pith on the lemon rind!CapeMayCookCape May12/7/2021This is excellent! Just one thing: Did anyone find that the lemon rind made the broth a little bit bitter? Is there a solution to this?JoanneOttawa, Ontario9/16/2021Quick and see simple however I used smoked turkey pieces  to add flavor (awesome taste when it comes together). I also added diced chicken breast and fresh spinach! It was a hit with the family. Robin FKnoxville TN7/5/2021I used a can of garbanzos that had been lurking in the back of a cabinet for a long time. Pre-Covid? Maybe.  Anyway I used way less liquid(stock) and mashed some of the beans for thickness. I think the lemon peel added an unexpected dimension. The result was delicious.  A simple dish that’s easy to prepare. I must admit that I haven’t used chickpeas very much other than adding to salads. I will definitely prepare again. Bite by EveChicago, IL4/15/2021I love these chickpeas! I soaked them for 48 hours (changing out the water a few times) and then cooked them in the lo-fi stovetop pressure cooker. I used the suggested amount of garlic & onions but through in a halved preserved lemon to take the tangy up a notch. I brought the pressure cooker up to high pressure, cooked for 33 minutes and then let the pressure release naturally. They came out creamy, neither mealy nor mushy, and so delicious.\n\nThis week, I've strained the chickpeas out to top a salad and enjoyed them in a bowl with the broth, spinach and red pepper flakes. I've used them as the basis for hummus in the past, as well. Just a great staple recipe.AlisonAtlanta, GA4/15/2021I made this recipe in the slow cooker / crock pot !!!!!  I added a few tablespoons of tomato paste as well.  To make it in the crock pot, I first cooked the onion and garlic in a pan.  I added all the ingredients into the pot and did not soak the chickpeas at all.  I added 8 cups of water.  I put it on High, and cooking time varies, but first start checking your chickpeas at about 4 hours.  It could take up to 8-10 hours in the crock pot depending on the chickpeas.NatalieChicago, IL2/17/2021This recipe was fantastic and super easy! I added some tomato paste at some point while the chickpeas were simmering and this created a lovely texture as well as adding some acidity and tomato-y flavor. The recipe is perfect as is, but throwing in an additional spice or herb can be a fun experiment. I may add a little harissa paste next time. Alfredo Bloomfield, NJ1/30/2021To: ELIZABETH, CENTRAL ILLINOIS...I think you may have missed a step. Check out the other reviews. How your batch ended up bland is a mystery. This recipe absolutely warrants its name and its five-star rating all around! Who knew it could be so easy to cook something so rich and savory. The fact that it does double duty by producing an equally delicious broth that can be used to effortlessly create a whole nother dish makes it a six-star recipe for me.\nCheers to the chef and his inspiration!KiyBrooklyn, NY1/26/2021Loved it as presented. The only thing I did was to use a plunge blender to puree maybe half the ingredients which gave the soup more body.Robert11/19/2020Believe these are Quite Possibly the Best Chickpeas. Made a double batch for freezing but ended up only freezing one 2 cup package. So flavorful, you have to force yourself to quit nibbling.    The broth was so amazing; finely minced the cooked lemon rind, added the juice of a lemon, big bag of baby spinach and six boneless skinless chicken thighs cut into bite sized pieces. The soup was so good.  So today am making another double batch for the freezer.  Ann Loon Lake, WA11/10/2020Bland chickpeas, with the slightest hint of lemon and olive oil, in a sad, watery broth. If this is your idea of comfort food, come to my house - I’ll make you food that actually tastes good. ElizabethCentral Illinois 11/6/2020To Anonymous in Jackson WY, I live at 7000 ft and have found the secret to making creamy beans. When you soak the beans overnight add a handful of kosher salt and let the beans brine . In the morning discard the brining liquid and rinse a time or two. Add fresh water and cook as directed. I have not yet made this recipe, however; I com plan on making them soon. I have not found that added salt while cooking prevents the beans from becoming creamy.Flagstaff, AZ11/2/2020I liked this recipe very much.  The only thing I would do differently is to put the onion and garlic in some cheese cloth, because it breaks down considerably and it is hard to take the pieces out if you only want the chickpeas for other recipes.\n\nI had soaked my dried beans covered in water and in the refrigerator for about 40 hours, which reduced the amount of cooking time considerably.  I only had to cook my beans for 45 minutes.  I did not have any lemon zest but I did have some frozen lemon juice and used that instead.  The beans were very tasty.\n\nAfter the beans were cooked the aroma and taste of the remaining liquid, i.e. the bean broth, was so very good.  I thought it would be a shame to throw it away.  I used it to make a soup.  I added a large can of crushed tomatoes,bay leaves, black pepper, paprika and 4 cubes of chicken bouillon, water to mellow the flavor profile.  The bouillon cubes are salty so I waited until those dissolved to determine if more salt was needed.   To the broth I added some quinoa, frozen mixed vegetables*, and added back a good amount of chickpeas.  My improvised soup  using the left over bean liquid came out pretty darn good. I froze half and will have soup for lunch or dinner the rest of the week.  The remaining chickpeas that I did not put in the soup will be used to make a cucumber, tomato, artichoke and chickpea salad and whatever amount of chickpeas I don't need for this week, will be frozen for future use.\n * If I had more prep time I would have used fresh peas, carrots, corn and green beans.  I could tell that the ones I used had been frozen.  But glad I got to use a good portion of the Costco size bagful of frozen veggies.  Better than it going to waste. \n\nAnonymous10/28/2020Explore Bon AppétitChickpeaBeanVegetableEasyMainSideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}