{"id": "21d7a13d7729a0c7ca2435918b2cbd6d", "url": "https://www.bonappetit.com/story/joyce-chen-scissors", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "These Little Joyce Chen Scissors Can Replace Every Other Pair You Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Little Scissors Can Replace Every Other Pair You OwnSmall, strong, and precise, all hail Joyce Chen!By Sarah JampelApril 12, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I never thought it was possible for scissors to have a cult following until I encountered the Joyce Chen Unlimited Scissors. With their bright candy-colored handles, they’re an unmistakable addition to food stylists’ kits, restaurant kitchens, and the work stations of every BA food editor. Once I noticed the scissors—which, at about 6 inches long, are small enough to fit comfortably into a back pocket—I started seeing them everywhere I looked (they even make a cameo in the first episode of Gourmet Makes!).So when I left my full-time editing job to work in pastry kitchens and as a food stylist, I wanted to join the club. I may have kept my mini offset and my eye-droppers in a beat-up shoebox instead of in a professional-looking knife roll, but at least I’d have the scissors to prove I was kinda-sorta legit (or trying to be).Twenty bucks felt like a splurge for seemingly diminutive scissors but as soon as I started using them, I understood the hype: A pair of Joyce Chen scissors eliminates the need, at least in most cases, for big honking shears.Much of the reason these little scissors are so handy (and worth the price) is actually because the blades are short (only three-inches-long!) and strong (made of rust-resistant stainless steel!), making them handy for tasks that require precision, strength, or a combination of both. They cut through girthy poultry bones but also trim delicate puff pastry; they break down woody stems but can also remove one minuscule flower petal. Because the blades are small, they work almost as super-sharp extensions of your fingers—you can get up close and personal with your food, whether you’re breaking down a chicken or cutting gnocchi off a rope. The big-looped handles can accommodate nearly any grip (left or right handed!), making the scissors comfortable to hold and easy to maneuver.Because the stainless steel blades are super sharp (and can be sharpened on a stone if they dull), the scissors excel where a knife might fail or waver: cutting raw bacon or guanciale into neat strips for carbonara, shaping phyllo dough without roughing up the edges, and, as senior associate food editor Molly Baz recommends, zipping through herbs without dirtying a cutting board. They’re so exact that they make senior food editor Andy Baraghani, who uses them to get “the perfect snip of a basil leaf off the stem” (okay, Andy) and remove the smallest fish bones, feel like a surgeon.So cute! So strong!\nPhoto by Chelsie CraigBut Joyce Chen scissors aren’t only for heavy-duty cooking and baking tasks: At my most recent restaurant job, we kept a pair in the kitchen exclusively for cutting tiny and perfectly straight labels for quart containers. Senior food editor Anna Stockwell’s mom swears by Joyce Chen scissors for cutting through branches and making teeny trims for floral arrangements. Amazon customers say that they’re even handy for metalsmithing (and that, folks, is why they’re named “unlimited”).I use my own pair to trim radishes and carrots, cut parchment paper, devein shrimp, remove some fat from pork chops, break up sticky dried fruits like raisins and figs, and make slits in double-crust pies. But I often have to fish them out of my knitting bag, where I’ve stowed them after trimming yarn. They’re so delightful to use, I walk around my apartment just looking for excuses to snip and trim. I haven’t torn open a bag of potato chips in years!Consider me a full-fledged member of the Joyce Chen cult—and yes, I’m trying to recruit you too.Photo by Chelsie Craig Joyce Chen Unlimited Scissors$30 $19 at AmazonExplore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Sarah Jampel"]}