{"id": "21dd6ac4d4f7649d58ac6ac48034a277", "url": "https://www.bonappetit.com/story/big-bean-mood", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Big Bean Mood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBig Bean MoodI like big beans and I cannot lie.By Amanda ShapiroFebruary 27, 2020FacebookTwitterEmailPhoto by Gentl and HyersFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,It’s been a major week for beans. First, the humble ingredient got a starring role in our brand-new Healthyish recipe, Pantry Pasta With Vegan Cream Sauce, which social media director Rachel Karten tells me is already our most-liked Instagram post of all time. On top of that, Basically editor, Healthyish columnist, and loveable overachiever Sarah Jampel not only developed that bean-forward pasta recipe but also gave us nine more very smart ways to turn a can of beans into dinner. SJ, you had me at “#3, bean confit.”Today, Sarah and I also talk about beans and more (well, actually just beans) on the Bon Appétit Foodcast, and it might be the most effusive conversation that two introverted people have ever had while being recorded.I’ve felt excited about beans ever since I started cooking from Amy Chaplin’s Whole Food Cooking Every Day. She uses beans in unexpectedly delicious ways—patés, sauces—and I’ve come to the conclusion that beans just might be the perfect food: They’re 1) economical, 2) good for you, 3) fast (if you’re buying canned, which I definitely am), 4) shelf-stable, 5) climate friendly...I could go on, but I can see your eyes glazing over.Okay, but there’s actually one more thing to say about beans. Last week I had the kasujiru at Rule of Thirds in Brooklyn. It’s a clay pot filled with silky, sake-infused soup that’s often made with salmon, but this version uses—that’s right—beans! Butter beans, to be exact. It’s impossibly creamy and, just as impossibly, vegan. And that’s the power of beans.What I’m consuming besides beans:This podcast episode of Unladylike with Esmé Weijun Wang, author of The Collected Schizophrenias, about being both “high functioning” according to society and also mentally ill. “I know that because I dress well and I can speak eloquently, that I am treated more well than people with the same diagnosis who...can't say they went to a fancy school,” she says. “So much of the idea of being high functioning is linked to money and whether one can make money or be part of that world.”The marinated greens at Leo in Brooklyn. Lizzie Noonan wrote about this dish recently on Healthyish, and, after ordering three (yes, three) bowls of them at dinner the other night, I’m convinced that they’re what all cooked greens aspire to be.Meredith Talusan’s debut memoir, Fairest, which is not out for another two months but which I am too excited about not to mention. I tore through an advance copy last weekend and have been thinking about it since.Priya Krishna’s new Kadhi recipe, which I haven’t consumed yet but plan to make ASAP because...well, just look at that photo and tell me you don’t want a creamy, tangy, turmeric-y soup with rice right now.Tangerine Jones’s essay on the whole Rage Baking dust-up, which has been covered at length in various publications. To support Jones and the physical and emotional labor she contributed to the Rage Baking movement, she asks that you donate to the following organizations: Ali Forney Center,  Brooklyn Community Bail Fund, and The Campaign against Hunger.The fattest, softest, sweetest dates I’ve ever encountered from Rancho Meladuco. You could make a very luxurious date caramel with them...but they’re so good I prefer to eat them straight.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterWhite BeanessayRead MoreLifestyleNo More Free (Kale) MassagesBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-27", "author": ["Condé Nast", "Amanda Shapiro"]}