{"id": "21e8972ffdadf51f80cee389be7e9247", "url": "https://www.bonappetit.com/story/how-to-make-vietnamese-canh", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "This Vietnamese Soup Recipe Is Brothy, Gingery, and Ready in 30 Minutes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Favorite Soup Is Brothy, Gingery, and Ready in 30 MinutesThe simple, fish-fragrant Vietnamese soup I've been making (and eating) longer than I can remember. By Andrea NguyenDecember 17, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina Boytsova FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.This time of year, many people cozy up to creamy, rich soups. Not me. I stick with my year-round Vietnamese standby: canh (pronounced “cahhn”). Loaded with vegetables and a little protein, the light, brothy soups signal homey comfort. I learned to make them from my mom, who prepared them five nights a week. When one of us kids jokingly complained, she’d say, “Hot soup warms you in the cold and cools you in the heat.” That always got us to quiet down and slurp up.Traditional Viet meals include canh plus a meat dish, a simple vegetable, and rice. In my family, we always started by filling our rice bowls with canh, then returned for seconds or thirds later in the meal to cleanse our palates.That said, enjoying Viet flavors doesn’t require that you flex your culinary muscles to make a multi-dish meal. As I encourage people in Vietnamese Food Any Day, my latest cookbook, canh may be served with non-Viet dishes, or simply with bread and butter. Let it casually fit into your lifestyle.There are countless renditions of canh but my go-to is full of greens, seafood, and gingery zip. The method boils down to strategically building layers of flavor. Here’s how it goes:Warm a splash of neutral oil in a medium pot over medium heat. Meanwhile, thinly slice half a medium onion (yellow is great but red works too) and drop it into the pot. To coax sweetness from the onion, gently cook it, stirring occasionally, till it’s soft and no longer smells raw, about 3 to 4 minutes. At that point, pour in 5 to 6 cups water (this isn’t fancy cooking so no broth is needed). Then season the liquid with salt and fish sauce—I usually use about ½ tsp. salt and 1 Tbsp. fish sauce (my go-to brands are Red Boat, Son, 3 Crabs, or Dynasty).Crank up the heat to bring things to a boil and vigorously cook for 3 to 5 minutes to develop a little flavor. Then add a lot (8 ounces) of chopped greens. Mustard greens, turnip greens, radish tops, kale, or mature spinach will all work (and it’s fine to combine different types). Things will look very full but after about 5 minutes the greens will wilt, soften, and relax. At that point, in goes about 1 1/2 teaspoons finely chopped ginger and 1 dozen peeled and deveined raw shrimp that have been cut into chunks (or, if you’re feeling artsy, split down their lengths so they curl up into cutie corkscrews). As soon as the seafood looks opaque and cooked through, slide the pot to a cool burner and let it rest, uncovered, for 5 to 10 minutes. You don’t have to tend to the pot: This final step exists just to allow the flavors to meld.Regardless of your canh, right before serving, taste it and add extra salt or fish sauce, if needed. Splash in water if the soup is too strong. Serve in individual soup bowls, or a large bowl to share.Bonus tweaks:Instead of shrimp, substitute a 6-ounce fillet of mild fish, such as rockfish, sea bass, or tilapia, cut into bite-size pieces.Or, if you’re not into seafood, add 5 to 6 ounces of ground pork or chicken to the pot after sautéing the onion. Season the meat with the salt and fish sauce and stir and mash it to break it into bits. Then add the water, bring things to a boil, simmer and continue as usual.To turn leftovers into a noodle soup, add glass noodles (a.k.a. bean thread or saifun; soak a bundle in hot water until softened then snip with scissors) to the pot when reheating. When they’re clear, you’re ready to eat.Andrea Nguyen is a writer, recipe developer, and teacher based in Northern California. Her latest cookbook is Vietnamese Food Any Day.Explore Bon AppétitIt's That SimpleVietnameseSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-17", "author": ["Condé Nast", "Andrea Nguyen"]}