{"id": "21f1218c26f0517b2f791838ca883960", "url": "https://www.bonappetit.com/story/does-kombucha-have-caffeine", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "So Does Kombucha Have Caffeine or Alcohol in It? How Much?! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSo Does Kombucha Have Caffeine or Alcohol in It? How Much?!Can you really get a buzz from that bottle?By Aliza AbarbanelJuly 2, 2018FacebookTwitterEmailBy Hisashi OhkawaFacebookTwitterEmailA few years ago, I got carded at a bodega. This isn’t unusual—I have round cheeks and penchant for wearing pastel hair clips that would put a third grader to shame—but I wasn’t buying beer. I was just trying to get my fix of bubbly, funky kombucha.By now, you may have read panicked headlines about the debated alcohol percentage of kombucha. \"Can you get drunk off kombucha tea?\" \"Could kombucha really have caused Michael Floyd’s failed alcohol test?\" Yeah, probably not. Sorry, Michael Floyd.So, why all the confusion? \"Most packaged foods on the market are processed and pasteurized, and are thus pretty straightforward and consistent,\" says Health-Ade Kombucha CEO Daina Trout. \"But kombucha is alive! And living foods are a lot more complex.\"For starters, it’s true that kombucha’s fermentation process does create some alcohol. As yeast consumes and ferments sugar to produce CO2 and ethanol (along with that distinct probiotic tang), some alcohol remains in the final product. \"It’s a constant cycle and thus the alcohol in kombucha is self-limiting, unlike beer or wine, which are intentionally brewed to have higher alcohol content,\" says Trout. \"Because real kombucha is naturally fermented and not pasteurized to kill the beneficial yeast and bacteria, the trace amount of alcohol in kombucha varies from brew to brew.\"Health-Ade Kombucha is low in caffeine and alcohol, but high in probiotics.\nPhoto by Alex LauStill, you would have to drink a lot of kombucha to feel a buzz. Most brands on shelves today contain just a fraction of alcohol—less than .5% ABV—allowing them to be sold as non-alcoholic beverages under the guidelines of the Alcohol and Tobacco Tax and Trade Bureau. (For context, a can of Miller High Life clocks in at 4.6% ABV.) Any higher than that, and you too will be carded before purchasing a high-octane version. And if you're looking to really up that buzz, several \"harder\" kombucha brands like Kombrewcha and KYLA are ready to take your money—and get you about as tipsy as a sour beer, with about 3% ABV.So what about the caffeine part? Kombucha is commonly brewed from black or green tea,  so it's true that most kombucha contains some amount of caffeine. But replacing that morning cold brew with a bubbly cup of kombucha won’t provide that same caffeine jolt that gets you to work on time. While the fermentation process does cut down on the tea’s natural caffeine content, about ⅓ of the caffeine remains. It’s not an exact percentage—for reference, GT’s Kombucha contains anywhere from 8 mg to 14 mg of caffeine per 8 oz serving, and Health-Ade has between 6 and 10 mg of caffeine in that same amount. Even if you’re someone like me, who often drinks the whole bottle in one go, you’re still getting less than a quarter of the amount of caffeine in an 8 oz cup of coffee. But if you're someone like GT Kombucha founder GT Dave, who told us he drinks two gallons of booch a day, you'll definitely feel the caffeine. And if you've quit caffeine cold turkey and now get the jitters just from drinking decaf coffee (which tends to have around 5 mg of caffeine per 8 oz serving), you might feel the kombucha too.If you’re being strict about alcohol and caffeine but still thirsting for a refreshing, vinegary-in-a-good-way beverage, try a sparkling switchel, herbal oxymel tonic, or even an easily DIY’d vinegar shrub. For the rest of us, know that you won't likely feel a buzz after downing a bottle of lemon ginger kombucha. And if you do, well, that might just be the probiotics talking.Looking to get a buzz with your probiotics? Make a kombucha cocktail.Rosy Gin-Kombucha CocktailNew to kombucha? This cocktail is perfect for a test drive, because you’ll get a taste of “original” (unflavored) kombucha.View RecipeExplore Bon AppétitHealthyishKombuchaTrendsRead MoreLifestyleHow Kombucha Bubbled Over: A Condensed HistoryGallery11 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-02", "author": ["Condé Nast", "Aliza Abarbanel"]}