{"id": "220ae3bfd4f0910648156479cc6fe503", "url": "https://www.bonappetit.com/recipe/chef-chad-gauss-amish-soft-pretzels-with-tillamook-fondue", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Chef Chad Gauss’ Amish Soft Pretzels with Tillamook Fondue Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDChef Chad Gauss’ Amish Soft Pretzels with Tillamook FondueSponsored by TillamookFacebookPinterestTwitterEmailMakes 32 pretzels and about 2 ⅓ cups fondueThe Food Market chef Chad Gauss turns a seventies party essential into a modern must-have with soft pretzels and fondue made with Tillamook Pepper Jack and Monterey Jack.PrintIngredientsAmish Soft Pretzels1 ⅓ cups warm water¼ cup brown sugar1 Tbsp. active dry yeast2 cups bread flour2 cups all-purpose flourAbout ½ cup clarified butter or ghee (*see below), melted1 cup cold water1 Tbsp. baking powderKosher salt for sprinklingTillamook Fondue4 oz. Tillamook Pepper Jack, shredded4 oz. Tillamook Monterey Jack, shredded1 ½ cups heavy creamRecipe PreparationAmish Soft PretzelsIn the bowl of a stand mixer, whisk together warm water, yeast, and a pinch of the sugar. Allow to stand a few minutes for yeast to bubble.  Whisk in the remaining sugar then add both of the flours. Using the dough hook, knead until the dough forms a soft ball, about 4 minutes. Cover bowl with plastic wrap and let the dough rest until doubled in volume, about 1 hour.Preheat oven to 500°F with an oven rack in the middle position. Brush a rimmed baking sheet with some clarified butter.Cut dough into four equal portions. Working with 1 portion at a time and keeping others loosely covered with plastic wrap, divide one portion into eight equal portions and shape each piece into a 4-inch long finger. Repeat with remaining portions, yielding 32 fingers of pretzel dough.In a shallow bowl, whisk together water and baking powder. Dip each pretzel into baking powder water, then place onto the baking sheet. Fingers should be nestled just touching each other in two rows of 16. Let rest 5 minutes. Brush each with clarified butter(*) or ghee then sprinkle with kosher salt.Bake until pretzels are browned on the outside and soft on the inside, 5-8 minutes.Tillamook FondueWhile pretzels bake, make the fondue. In a medium saucepan, bring the heavy cream to a gentle simmer. (Be sure to keep an eye on the cream because it can over boil.) Whisk in both cheeses until smooth.Pull apart the warm pretzels and serve with fondue.(*) To clarify butter, cook 1 ½ cups unsalted butter (3 sticks) over medium heat until melted and solids separate from fat.  Skim and discard any foam. Pour clear golden butter into a heat proof container leaving behind any milk solids left in the pan.Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}