{"id": "220c2b93b01937ac525a41608b0bbe0d", "url": "https://www.bonappetit.com/recipe/corn-cacio-e-pepe", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Corn Cacio e Pepe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueCorn Cacio e PepeBy Deb PerelmanMay 21, 20193.4(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintLooking to switch things up from the mac and cheese that your child (or, um, partner) insists on? Same with Deb Perelman, who turned the iconic cacio e pepe into a foundation for a slight-more-sophisticated cheesy pasta. If your kids are heat-averse, start with 1 tsp. black pepper and add more to taste.Ingredients4 servings16oz. gemelli, orecchiette, or other medium pastaKosher salt3cups corn kernels (from 3 large ears)8oz. aged Pecorino Romano or Parmesan, finely grated (about 2 cups), plus more for serving2tsp. freshly ground black pepper, plus more for servingPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; add corn about 30 seconds before pasta is done cooking. Drain, reserving 1 cup pasta cooking liquid. Return pasta and corn to the pot.Step 2While pasta is cooking, toss 8 oz. cheese and 2 tsp. pepper in a medium bowl to combine. Add ⅓ cup cold water and use a fork to mash mixture into a thick paste (try to get it as smooth as possible). Still mashing, add more water a tablespoonful at a time until paste is about the consistency of cream cheese.Step 3Add cheese mixture to pot with pasta and corn. Using a rubber spatula, toss pasta until coated (the cheese mixture will be too thick to form a sauce at this point). Tossing constantly, add reserved pasta cooking liquid a splash at a time until a glossy sauce forms (it should still be fairly thick).Step 4Transfer pasta to a large bowl and top with more cheese and a few additional grinds of pepper.How would you rate Corn Cacio e Pepe?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleTo add some kick to the recipe, I added a finely chopped jalapeño pepper (red or green or both) or a pinch of cayenne.  I also like a little chopped, fresh cilantro is an excellent addition. I'm a big believer in introducing kids to these things gradually, no matter how young they might be. Did that with my daughter from when she was very little, and she never balked at spicy food.StuCT3/19/2021I also wound up with clumpy cheese and came here for advice. Didn't find any so I returned the whole mixture (pasta, corn, cheese) back to medium-low heat and added more water to remelt the cheese mixture. Worked pretty well but I had to stir intensely for a minute or two. Flavors are still really really good!jamesrnelson6/6/2020I melted some butter in the pan over low heat, then added the cheese mixture.  Stirred & added some pasta water, then stirred for a minute or so until it started to melt BEFORE putting pasta back into the pan.  It worked perfectly - no clumps.  I have made this twice.  I would add extra cheese.Anonymous4/8/2020Unfortunately, this was a no-go for me. Like many reviewers, the cheese just ended up in a giant, unappetizing clump in the middle of the pot. I think I'm just going to leave cacio e pepe to the restaurants from now on.AnonymousHouston, TX10/15/2019My husband and I loved it! We added chicken on top and it turned out great. AnonymousHouston TX9/28/2019I saute the corn in butter with onions and garlic. I like a little hot sauce too. This way it was very goodAnonymousSan Antonio8/31/2019Didn’t have the clumpy cheese problem but found it to be really bland. I get it’s for kids but I think buttered noodles might be more flavourful! Love BA and cook a lot of the recipes but this is not a winner AnonymousLondon8/13/2019Easy to prepare and wildly tasty for how simple it was to make!AnonymousBoston8/12/2019Really tasty take on cacio e pepe.\nSeveral people rating this recipe have ended up with their sauce seizing. Cheese will not incorporate and melt into a lovely sauce if the mixture its mixed with ingredients that are too hot. To counter this, the recipe uses COLD water. You cant skip this part.\n\nCacio e pepe has very few ingredients, but very important technique.danielbearAtlanta7/6/2019I finally tried this recipe and got happy reviews from my kids. It was yummy; a great alternative for buttered noodles. I decided not to use the pot and combined my ingredients in a large serving dish. I wanted to experiment with protein, so I added some Tofurky Italian sausage to a small portion and that was good too. The best part is that it is easy and quick. It will definitely be a go-to during the school year!AnonymousAnn Arbor, MI6/27/2019I added some Italian sausage to it and it was still super boringAnonymousNorfolk, VA6/15/2019I was very excited about this recipe because I loved the idea of the sweetness from the corn in the savory pasta, but the method the recipe asks for to melt the cheese did NOT work for me. I was patient and stuck with it for a while but it kept clumping into stringy gross cheese blobs. No glossy sauce. Had to throw out the whole pot and proceeded to make Molly Baz's Adult Mac and Cheese which is tried and true! Abigail Knight6/12/2019This was very very good.  I've been looking for a cheesy pasta dish to offset my mac n' cheese recipe that is super delicious, but very heavy....this did the trick.\n\nThe corn was a master touch...I am totally in love with fresh, barely cooked corn and it paired excellently in this.\n\nYes, the the parm is a challenge to turn into a sauce...but that takes a bit of practice.  Once you 'get it', it's not that difficult...it takes a light touch.\n\nAnother banger of a recipe from BA - thanks!daubie77Boston, MA6/7/2019Make a cheese sauce with saute onions and add a bay leaf. Changes everything.AnonymousSaranac Lake NY6/5/2019This recipe sounds like it should be good, but it's a waste of time.  The cheese does not develop \" into a glossy sauce.\" It clumps up in the middle of the pot, clings to the rubber spoon and just creates a mess.  Very little flavor.  And the clean-up is very messy.  Lots of cheese and pasta stuck to the pot.  AnonymousNew York5/30/2019Explore Bon AppétitPastaItalianEuropeanCornVegetableOrecchiettePasta & NoodlesPecorinoCheeseSummerQuickEasyOne-Pot MealsWeeknight Meals5 Ingredients or FewerMainNut-FreeVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Deb Perelman"]}