{"id": "2221d8bb2e2de46ce7d72dc34ebeff85", "url": "https://www.bonappetit.com/story/dinner-is-best-served-scrambled", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Dinner Is Best Served Scrambled, Just Like My Brain Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDinner Is Best Served Scrambled, Just Like My Brain Right NowRecipe recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroDecember 20, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else—and get this year's Feel Good Food Plan too.Healthyish friends,Last night, I was taking out the trash and recycling, and I somehow managed to throw out my phone along with, you know, the garbage, so I spent a good half hour curbside on my hands and knees, digging through identical garbage bags while pressing the button on my Apple watch to make the damn phone ping. (I eventually found it). So that's where my head's at. I'm also putting a final coat of paint on the Healthyish Feel Good Food Plan, finishing—or, let's be honest, starting—my holiday shopping, leaning in to the Dinner Scramble, and trying to stop every day from moving at 100 miles per hour.So let's keep this short. I'd love it if you told your healthyish friends to sign up for this newsletter so they can be eligible to win a freaking amazing Feel Good Food Plan bundle of stuff: a Great Jones stockpot, a bunch of cash to spend at Thrive and Outdoor Voices, and, wow, a Vitamix. If they win, you can demand a finders' fee. And if they don't, you'll still have a buddy to cook through the Feel Good Food Plan starting January 2nd, so really everyone wins either way.Me waiting for the longest day of the year so I can experience daylight again.If you can steal a few seconds to read, I recommend T. Wise's essay on coming out to his mom as a meat eater and Yelena Akhtiorskaya on the singularity of Brooklyn's Brighton Beach (\"Regardless how much better and cheaper the produce is in Brighton Beach than other parts of the city, it remains but a pale shadow of the flavors of the Old Country, where everything was simultaneously exponentially worse and so much better that life is now devoted to memorializing it.\") And Bodies, produced and hosted by Allison Behringer, has quickly become my favorite podcast of the year.After last week's newsletter commentary on, ahem, peganism, a nice lady named LaBreah wrote to me with a comment I couldn't not share: \"Pegan is a dumb name, it’s pescanodairian, duh.\" Now that's a made-up word I can get behind.Until next week,Amanda ShapiroHealthyish EditorP.S. Please make me laugh: healthyish@condenast.comExplore Bon AppétitHealthyish NewsletterHealthyishessayRead MoreLifestyleThe Feel Good Food Plan Is Back!By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Amanda Shapiro"]}