{"id": "22286dabb61a47856c9bce237d6b4db6", "url": "https://www.bonappetit.com/story/crispy-skin-isnt-the-end-game-of-roast-chicken", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Why Slow Roasted Chicken is Better Than Crispy Skin Roasted Chicken  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCrispy Skin Isn't the End Game of Roast ChickenI'd choose fall-apart tender meat over crispy skin any day.By Molly BazSeptember 11, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailFor as long as I can remember, I’ve always had the same answer to the age-old question “What do you want as your last meal on earth?”: It starts with ice-cold briny oysters and sweet shrimp cocktail, moves on to the world’s greatest cae sal, and finishes with a roast chicken, as classic as they come, with some crusty bread and butter alongside it. And until several weeks ago, when I dreamt up that roast chicken, it looked exactly like the roast chicken I’ve been making my whole life: A beautifully burnished, platonic ideal of a roast chicken, simply seasoned and cooked at 425° for 45 minutes or so, ensuring that incredibly addictive crispy skin.But then this Slow-Roast Gochujang Chicken entered my life and changed everything— I’m not exaggerating when I say that it has me rethinking my plans for my final meal. A different kind of roast chicken, it’s cooked low and slow instead of hot and fast. But it’s worth investing the time because what emerges from the oven is lightyears greater than the sum of its parts.And about those parts. First, there’s the absurdly simple glaze. All you have to do is whisk together a few tablespoons of gochujang and olive oil with some grated garlic and ginger. Full stop. Basta. C’est tout! The spicy, crimson-red mixture then gets brushed generously over the chicken and nestled into a cast-iron skillet on top of the second part: a few pounds of baby Yukon Gold potatoes.The whole set-up is cooked at 300° to make magic happen—and, I’m telling you, magic happens. Two and a half hours later, a lacquered, rust-colored bird appears, with meat so tender that you barely need a knife to carve it. Beneath it, the perfectly tender potatoes, which have confited in its spicy, schmaltzy drippings.This is a bird that eats more like a rotisserie chicken than a roast chicken. The low temperature gently cooks the meat so that neither the leg nor the breast suffers in service of the other. And what it lacks in crispy skin, it makes up for in fall-apart tender meat. Take it from a crispy skin fanatic: You won’t miss it. The sticky, spicy deeply flavorful glaze more than makes up for it.If I haven’t already convinced you of the epic proportion of this chicken, rest assured that it requires no more effort than any other roast chicken recipe you may have made in the past. The only additional ingredient you’ll need to reach roast chicken nirvana is time. And surely you can find some of that in the name of trying a dish that’s worthy of being your last.Get the recipe:Slow-Roast Gochujang ChickenThis isn’t the crisp-skinned, high-heat-roast chicken you’re probably familiar with. Instead, it’s a melt-in-your-mouth tender, schmaltzy, slow-roast version.View RecipeExplore Bon Appétitroast chickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Molly Baz"]}