{"id": "222b05b2f6e2247039b8e7c6f081863b", "url": "https://www.bonappetit.com/story/zaatar-chicken-cutlet", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "These Za'atar Chicken Cutlets Are Light—and We Mean Light | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chicken Cutlet Is Light—and We Mean LightFor chicken parm lovers looking for something crispy, bright, and new.By Andy Baraghani, as told to Nico AvalleApril 2, 2021FacebookTwitterEmailPhotograph by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioFacebookTwitterEmailI’ve had a lot of really good chicken cutlets, whether in sandwiches, at restaurants, or during recipe tastings—but I’ve also had plenty of disappointing ones. In my eyes, it’s shocking that after starting with something incredibly lean like chicken breasts, you can end up with something that’s so rich and heavy. Good chicken cutlets should make me want to come back for a second, third, or even fourth helping without leaving me delirious or ready to pass out.To me, the way to make a great chicken cutlet is to keep it lean and light—and that was my goal here. To achieve that lightness, I paired a simple panko crust with za’atar. Za’atar already tastes bright and tangy on its own, but frying those herbs and spices in oil brings that effect to an entirely different level. The za’atar I made for this recipe is very heavy on the sesame seeds, which creates this nice crust on the cutlet, with herbaceous floral notes from thyme and a good amount of astringency from sumac.For the salad and the sauce, I was thinking about different types of disruption that occur in food. Disruption can be a bad thing, like with burning or spoiling or a flavor that just tastes plain wrong. But disruption can also be a very good thing. In this meal, the crunch and acidity of the pickles and cabbage—plus the contrast with the sweet and creamy tahini dressing—leaves room for every bite to be just a little different. When you put all of these components together in one bite, it adds up to something very delicious.I’m not 100% sure I’d label this as a weeknight recipe, but it’s also not a project. It’s kind of in-between. What I do know is that I keep making it again and again, and every time it’s been tasty, disruptive, and light enough to keep me coming back for more.Za’atar Chicken Cutlets With Cabbage SaladMaking your own spice mix is the key to chicken cutlets with tons of nutty, floral, and tangy flavor and crunchy, seedy texture.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-02", "author": ["Condé Nast", "Andy Baraghani", "As Told To Nico Avalle"]}