{"id": "223ba418f9bbbef0ac1d8b4cc93e0821", "url": "https://www.bonappetit.com/story/waffles-mochi-netflix-cooking", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Netflix's Waffles + Mochi Creators on Working With Michelle Obama and Breaking the Rules of Kids’ Shows | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWaffles + Mochi Creators on Working With Michelle Obama and Breaking the Rules of Kids’ ShowsTo make their new show, Erika Thormahlen and Jeremy Konner worked with celebrity chefs, adorable puppets, and the former first lady. Their goal? Making food fun for families.By Sonia ChopraMarch 18, 2021FacebookTwitterEmailPhoto courtesy Adam Rose / Netflix FacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.As someone with a deep appreciation for food culture, children’s media, and Michelle Obama, I responded to news of Waffles + Mochi, the new kids show produced by and featuring the former first lady, with a lot of exclamation points and heart-eye emojis. The show’s title refers to the two puppet stars, who escape the Land of Frozen Food (where everything they cook turns to ice!) and embark on a series of food adventures that take them around the world. And they meet some really smart and fun chefs along the way, including some of my own cooking idols: Samin Nosrat, Preeti Mistry, Mashama Bailey, and Michael Twitty.I am excited that a show like this exists for kids—and adults!—to learn about the food on their plates and what it takes to get it there. Which is why I jumped at the opportunity to speak to the show’s creators Erika Thormahlen and Jeremy Konner about what went into making the series, what it’s like to work with executive producer and Mrs. Obama (who endearingly plays Mrs. O, the friendly grocery store owner, on the show), and some of the unconventional decisions they made.See excerpts from our conversation below, and check out reviews from Vanity Fair and the New Yorker. I’d love to hear what you think of the show, if you watch, and what other children’s shows (and books!) about food you love. I’m sonia@bonappetit.comWhy is making this show so important to you?Erika Thormahlen: It was an obsession to get puppets eating, it's simple as that. The end goal has always been to get kids excited about food. I think in some ways we're not a cooking show—we’re an eating show, because we want kids to get in the kitchen and play with their food, and investigate, and take ownership over what ends up on their plate. I was a picky eater and I know a lot of us probably had our likes and dislikes growing up, and I think if we had had a show like this when we were little, dinnertime would not have been so stressful.Jeremy Konner: [When we first came up with the idea] it was in the model of Food Network cooking shows. But a lot has changed in the last decade in the landscape of food television. And this is a world that now has Chef's Table and Ugly Delicious, and Salt Fat Acid Heat, and this is really what we got excited about: How do we put puppets and kids into this world and make it more about culture, and excitement about food rather than cooking it? One of the core tenets is that we never talk about food being good for you. We never talk about food being bad for you; we never talk about health food. When Samin Nosrat is eating some incredible bite of something in the streets of Japan, she's not talking about vitamin content, right? We want kids to eat a piece of broccoli, not because it's good for you, but because it's good.It’s not a kids show about healthy eating.ET: Waffles and Mochi is a show about a love of food. It's not a love of healthy food. It's a love letter to food in general, foods from all around the globe. There's this healthy side effect when you start cooking at home, and the goal isn't necessarily to eat more vitamins or work your way up the food pyramid. It's simply to be excited to get in the kitchen and cook with your friends and family.JK: No food pyramid. Food is good for you; we believe that. When we first researched this show, we met with Eleanor Oaks, an anthropologist at UCLA, who won the MacArthur Genius grant for studying family and dinnertime dynamics. And she compared American families to those of different cultures around the world. In one study, they followed these families around, giving them cortisol tests throughout the day, and it turned out that dinner time was the most stressful time for families across the board. We really fell in love with this idea of trying to make dinnertime more fun, making it easier.There've also been a lot of studies that show when people are cooking more, when they're more engaged with their food, they're eating better. So it's healthy by default.So many people with different backgrounds and perspectives worked on this show. How is that something you were intentionally focusing on when you were producing the show?ET: That was our focus at every step because if you're going to make a show about food, especially for kids, I think you want to have all voices and palates at the table, literally and figuratively. Because there's no one story about food, everyone has their own individual experiences that may ladder up to culture for them. We really wanted it to represent real kids and their real experiences. What's strange for one kid is really familiar and exciting to another.You told me that you finished filming before the pandemic stopped travel, which was lucky logistically, but also—Waffles and Mochi go to Mars! I love that you made outer space feel just like any other destination on the show.ET: I feel like that's Jeremy's filmmaking DNA from Drunk History, where they do a lot of locations that are built on the fly and there's something really fun and realistic about it. I had a more cheesy version in my head and I was really excited when I got to set that day. I was like, whoa, this looks like Mars.JK: Coming from Drunk History—we were forced into such a wild schedule on that show because we had battles with 10,000 people fighting and we had to shoot in two hours. So we ended up developing a lot of techniques that are very playful and that really just look back at old filmmaking styles, like miniature rear projection, backdrops, and all that stuff. [For Waffles + Mochi,] it turns out it was very easy for me in terms of knowing what techniques to use. I was like, oh great, we're going to do rear projection for Mars.It feels like magic to me.JK: You know, I love seeing the strings, I love seeing somebody's hand or seeing the puppet rods. I think that was a huge thing in designing the puppets, that we wanted to see the puppet rods because I think that makes it a little more accessible for kids. It's not quite as magical; it feels like, oh, I could maybe do this.Were Waffles and Mochi always the characters?ET: Way back when, we had a Waffles, but it was not our [current] Waffles, and we had a mouse. But everyone was like, \"Get that mouse out of the kitchen.\"JK: This was pre-Ratatouille.ET: And when we reconnected, there was this new travel focus. We thought, well the characters can't be from our world, right? They can't be from any country on our planet because we really wanted them to be immigrants to the whole world. We wanted them to start from a place of a little knowledge about food, but a ton of curiosity. So Jeremy and I were thinking about making them space aliens, or creatures from another dimension. And then we landed on this Kimmy Schmidt-esque idea where they maybe had been locked in the frozen food aisle their whole lives, in the land of frozen food.That’s an interesting way to think about something I think about a lot: Who gets to tell which stories and who are we telling stories for.JK: When you make a show with the Obamas, when you make a show with a global company like Netflix who has a presence in 190 countries, there are a lot of people who want to see the show more diverse and more representative. That could not be more exciting, right? It feels like if we had made this just a few years ago, or with different people, they would be saying, \"But how's this going to connect with American kids?\"It’s truly wild how much has changed.JK: Erika and I are the Waffles and Mochi of our production. We are not food people; we just love food. We watch food, we're obsessed with it, but we are not part of this world. So we're going in with unbridled enthusiasm and saying, \"Teach us.\" We want to go to the best people, we want to go to people who are telling different, unique stories that we don't know. And we want them to tell their stories and show us how they cook.I’m curious: How did Mrs. Obama react to your vision? How did she change it?ET: We all have taste buds—we all experience the five flavors but in different ways. So when you mentioned salt and miso, everyone's tasting “salty,” it's just that maybe we describe it in different ways or with different ingredients. And that device, Mochi's taste buds, was something that came out of our first meeting with Mrs. Obama.JT: She started talking about her taste buds, about how she's from the Midwest, right? So she grew up eating mac and cheese. Whereas Mr. Obama is from Hawaii, Indonesia. He grew up with zero taste for cheese. That is not something that he ever cared about or particularly likes. So Mrs. Obama was the one on our team who was really pushing for this idea of: What if we could talk to our taste buds, what if we could see them? What are they thinking and what are they doing? And when we started researching how to represent taste buds, we realized that you have thousands and thousands of taste buds all over your mouth, and each one of them has these receptors in it. It is not like there's a tongue map—that's false science that we grew up with. We wanted to represent taste buds as accurately as possible, so we created a city of taste buds, and we fly into just one taste bud where we meet the five buds.Tell us about one of the biggest challenges you had in terms of storytelling.JK: One of our big struggles was how to figure out how we were going to get our audience to understand kids in other countries. It was very important for us that we heard the kid speaking in their own language. If we could have used subtitles, that is what we wanted. We were not allowed to do that—ET: Our audience doesn’t read.Oh, of course.JK: So what we had to do was break precedent across all of children's programming and go with what is called UN-style dubbing, where you hear the person speaking in their language first, and then you start the dub. So it's clear this is not the language of this kid. They're speaking a different language and we will be translating it to you. We were very nervous that kids would not understand what was happening. Why are they speaking two languages? Why do we hear some sounds and then translate later? But we showed it to a bunch of kids and there were zero problems. And so we're really excited about that.The chefs that you picked were so great—Mashama Bailey, Preeti Mistry, Samin Nosrat, and more. How’d you think about it?JK: Alex Braverman was our producer, he had directed an entire season of Inside The Mind of a Chef, and was well versed in food television. And Gillian Ferguson had written for Lucky Peach, and she does the market report on KCRW’s Good Food, working with Evan Kleiman. We just felt like we needed to surround ourselves with people who know this world, and are excited about this and we just kept pushing for unique voices,ET: It's easy to identify some big names, like Samin Nosrat, who is an icon. But finding our family who made miso in Japan, or the family in Seoul, Korea, who was in our mini doc about kimchi and how that related to the pickle episode—those people don't have huge profiles. But we really, really wanted to make sure that we were bringing not only amazing chefs but real families to our show as well.JK: When we went to Venice, Italy, Gillian said to us, \"Let's not meet with the most famous Italian chef in Venice; let's meet with this guy, Hamed. He owns a restaurant that is all run by refugees. And he's an Afghani refugee. Let's try to subvert our expectations of what Italian food can mean.\" And that's something that we wanted to do across the board: subvert expectations for kids and subvert expectations for adults.Explore Bon AppétitNetflixLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-18", "author": ["Condé Nast", "Sonia Chopra"]}