{"id": "225cd59f9cdb807260b06083f913acc3", "url": "https://www.bonappetit.com/story/chai-shortcut", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "This Fast Chai Recipe is Ready in 10 Minutes and Only Requires Tea, Cardamom, Milk, and Sugar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mom's 10-Minute Chai Requires a Kettle, a Tea Bag, and Just One SpiceIt's the best part of quarantining with my parents.By Priya KrishnaApril 4, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I consider chai to be a perfect beverage—an inviting, not-too-caffeinated start to my day that I can sip cozily on the couch while reading the morning news. Traditionally, it’s made by letting tea, milk, water, and spices boil away in a pot until the liquid thickens up and the spices have so intensely imprinted themselves onto the tea that the whole room smells like cardamom and cinnamon. After it’s strained, what remains is a slightly creamy, intensely aromatic concoction is all that remains.But it’s a leisurely process. They say now is the time to take on those painstaking project recipes. I’m all for making bread, or finally learning to laminate dough, but chai just isn’t one of those activities I want to spend a long time on. Now is the time when I’d love to get straight to the comfort. And that’s where my simpler, shortcut cardamom chai comes in.It’s a method that my mom developed on the days when she came home from work and really, really needed her chai fast. It strips away the mildly annoying parts of the process (dirtying a pot, cleaning out a strainer, measuring out a bunch of different kinds of spices) and streamlines it to involve one mug and just one spice. When things were more normal, and I actually lived in my apartment in New York, I incorporated this tradition into my daily routine.Now that I’m quarantining at my parents’ place in Dallas, I get to enjoy the ritual alongside my mom. It usually happens around 3 p.m., when I am starting to feel zonked from the hours spent staring at my computer, and the low-level dread over the fact that I literally live with my parents starts to set in. My mom yells, “Chhotu, chai?” from downstairs and I yell back in the affirmative. I bound to the kitchen, and we lean over the kitchen island, sipping from our favorite mugs (hers: the skinny, floral one, mine: the wide, fat one printed with a photo from a family hiking trip). It’s a quick break, but one of the most important parts of my day—it feels like coming up for air after holding your breath underwater.To make my mom’s shortcut chai, you start by heating water in a kettle. The trick is to not let it come to a full boil. This is important: I firmly believe chai tastes more flavorful when the water is not scalding.In a mug, add 1 heaping teaspoon of sugar, 1 black tea bag (my brand loyalty is to Tetley), and 2-3 crushed cardamom pods, shells and all. You can crush the pods in a mortar and pestle, with the bottom of your mug, with a meat mallet—do what you gotta do. Why only cardamom? It’s the flavor that best represents what I love about chai—floral, earthy, heady, sweet. It’s important to point out that while I’m all about shortcuts, cardamom powder (a.k.a. ground cardamom) is not an option here. Only the freshly crushed pods provide the aroma I’m looking for.Add the almost-boiled water to the mug with your tea, spices, and sugar, leaving room for milk. Let the tea sit for about 2-3 minutes, until it turns almost black in color. At some point, the shells from the cardamom pods will float to the top of the mug—grab them and discard. Top off your chai with a few splashes of milk, until it’s the color of a detective’s trench coat. Dispose of the tea bag, mix well, and that’s it.Back when I could travel, I always brought along a “chai kit”—a bag filled with black tea, cardamom pods, and sugar—everywhere I went. The silver lining of being at home is that I no longer have to worry about toting around the chai kit. No matter how bare my parents’ pantry may get, we will always have what we need to make chai.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-04", "author": ["Condé Nast", "Priya Krishna"]}