{"id": "22766b55029caa82f74ec303cb38a0d1", "url": "https://www.bonappetit.com/story/best-winter-wines", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "The 5 Best Wines to Drink This Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 “Really Dope” Winter Wines, According to This SommelierAt his Chicago wine shop, Juice@1340, Derrick C. Westbrook is focusing on the bottles that make him happy.By Derrick C. Westbrook, as told to Amy Tara KochJanuary 8, 2022FacebookTwitterEmailPhotograph by: Isa ZapataFacebookTwitterEmailWelcome to The Pour, a monthly column about what we’re drinking right now.Just before the pandemic I took over a bar and wine shop in Chicago’s West Loop with two partners. Juice@1340 is what Chicagoans call a slashie: part bar, part shop. Buy something and take it home or drink it here. We’re a neighborhood joint and definitely a stylish one. What we sell is a reflection of what we like.I rotate by-the-glass pours that reflect what I’m currently excited about: an unexpectedly sweet Malbec, say, or a skin-contact Pinot Grigio. Typically, when you build a wine list, you’re beholden to making the highest margin or finding wines with the broadest appeal. By-the-glass options give me freedom to be whimsical, unbound by the barriers of business.If distributors lead with the fact that a wine is Black-owned or woman-owned, I get annoyed. I don’t want that to be the barometer. I didn’t decide to sell Black-owned wines; I decided to sell really dope wines. The highest show of respect you can pay a wine is to judge it on the merits of yummy or nah. These five bottles fall into the yummy category—and just so happen to come from Black winemakers.Brown Estate: “Chaos Theory”This earthy, dry blend from Napa Valley was the first Black-owned wine that reflected my palate and love for bold Napa reds.Maison Noir Wines: “New Noir”Beverage director turned winemaker André Mack is the gold standard for sommeliers. His much-anticipated “New Noir” takes skin-contact wine to another level.Bodkin Wine: “Cuvée Agincourt”This wine was the first sparkling Sauvignon Blanc produced in the U.S. It’s everything you’d want from a dry sparkler.Michael Lavelle: “Iris” RoséThis screams Black boy joy! Many think rosé is just for the summer, but this one works year-round—its acidity and brightness cut through hearty meals.Aslina Sauvignon BlancThis easy to drink gem from South Africa underscores simplicity as a pillar of quality.Disclosure: André Mack hosts a video series for Bon Appétit on YouTube. Maison Noir was chosen independently for this story.Explore Bon AppétitThe PourLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-08", "author": ["Condé Nast", "Derrick C. Westbrook", "As Told To Amy Tara Koch"]}