{"id": "227d39676ebbbcfaab0dc42046347482", "url": "https://www.bonappetit.com/story/simple-summer-cooking-tips", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Summer Recipes Made Simple: How Jodi Moreno Makes Minimalist Cooking Taste Amazing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Jodi Moreno Makes Simple Summer Cooking Taste AmazingThe \"More With Less\" author shares her tips for irresistibly simple summer food.By Aliza AbarbanelMay 16, 2018FacebookTwitterEmailPhoto courtesy of More With LessFacebookTwitterEmailSummer is our favorite time to cook, but that doesn't mean we spend hours in the kitchen. (Catch us on the beach instead.) We just believe that, if you use peak-season produce, you don't have to do much actual cooking at all. With a little creativity, even the simplest recipes can feel totally fresh.Natural foods chef Jodi Moreno gets us. Her new cookbook More With Less: Whole Food Cooking Made  Irresistibly Simple is full of pared-down recipes that are ultra-seasonal and look gorgeous too—so, naturally, we had to know her summer game plan. “Once you get cooking this way, you realize that making things simple and delicious is not that intimidating,\" Moreno says. These are her best tips for simplifying dinner without sacrificing creativity or flavor.Moreno in her kitchen\nPhoto courtesy of Jodi Moreno1. Let your blender work for youIs there anything more low maintenance than just throwing a bunch of vegetables in a blender? In the heat of summer, Moreno loves to make frosty green gazpacho, packed with cucumbers, avocado, and plenty of herbs. To keep her green gazpacho from veering into green juice territory, she adds plenty of savory aromatics like garlic and shallots. “I like to put toasted almonds on top for a contrast of texture, and also I like to add a cooked element,” she says. “It makes you think of it more like a soup.”2. Lighten up your grilling with citrusOranges may be a classic winter fruit, but Moreno likes to use a hit of orange juice to add zing to dressings and marinades. \"Orange juice doesn't get used as often in cooking, but it rounds things out and tastes very balanced and bright,\" she says. \"I love how unexpected it is.\" Try mixing orange juice with chiles to make a fiery mojo sauce that can be spooned over grilled fish, chicken, and vegetables.3. Big batch toppings make the differenceEspecially in high summer, when turning on your oven is a chore, a heavy dusting of dukkah can turn simple raw vegetables like tomato and corn into a nuanced, flavorful salad. “When it's really hot, I’ll keep things really simple but then throw a homemade (or storebought) condiment on top,” Moreno says. “I’m a big fan of gomasio because I feel like it adds a little pop of texture and briny saltiness.\" She also relies on agrodolce, gremolata, and quick-pickled vegetables to bring meals together. These hearty toppings are easy to make in big batches and often don't require an oven—a blessing in the middle of August.4. Miso and stone fruit are the ultimate summer dessert shortcut“We do a lot of dinner parties and I never think about dessert—I just dump fruit into a pan and make a crumble or crisp,” says Moreno. To amp up a crumble’s rich, buttery flavors without adding dairy, she likes to add ¼ cup sweet white miso to her topping mix. The result? Light but rich-tasting desserts that feel fresh, not overly buttery. “For something even easier, I roast halved fruit with a sprinkle of sugar and serve it alongside ice cream for a sweet afternoon snack,” Moreno says. Trust us: nobody’s ever complained about cold ice cream and hot caramelized stone fruit.5. Don’t be afraid to use your oven every once in a whileRoasted vegetables are a staple of winter cooking, but there’s a compelling argument for using this cooking technique year round—especially in the beginning of summer when the weather is milder. “I know people are afraid of turning on their oven in the summer, but I’m a big fan of big tray of roasted summer veggies and mixing those with raw vegetables, lettuce, or even a grain like quinoa,” says Moreno. “You have a beautiful, delicious filling meal, and it’s pretty low maintenance, too.” There's no need to turn your oven on for everything, but mixing fresh produce with some roasted (or grilled!) vegetables creates a nice contrast.Buy More With Less: Whole Food Cooking Made  Irresistibly Simple, $25Explore Bon AppétitHealthyishSimpleWeeknightSummerRead Morecooking82 Healthy Summer Recipes to Make Over and Over AgainGallery82 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Aliza Abarbanel"]}