{"id": "228efbb2d654a2eaa24011a2cf809a24", "url": "https://www.bonappetit.com/recipe/spatter-paint-sugar-cookies", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Spatter Paint Sugar Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueSpatter Paint Sugar CookiesBy Kendra VaculinNovember 23, 2021EmailPinterestPrintPhotographs by Josephine Schiele. Food styling by Rebecca Jurkevich.EmailPinterestPrintEmailPinterestPrintThere’s no waiting around for butter to soften here—like pie crust, this cookie dough starts with cold butter. It also comes together entirely in a food processor, containing the mess (and making these kid-friendly—we bet yours will be interested in pressing PULSE). Use gel food dye here if you can find it—it achieves the most vibrant color with just a drop or two.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonRolling Pin$13 At AmazonFlexible Metal Spatula$9.99 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketWire Rack$23 At BA MarketIngredientsMakes about 4 dozen¾cup (150 g) sugar1tsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2⅓cups (292 g) all-purpose flour, plus more for surface1cup (2 sticks) chilled unsalted butter, cut into small pieces1large egg2tsp. vanilla extract2cups powdered sugar6Tbsp. milk2colors gel or other food coloring of choicespecial equipmentTwo different 2”–3” cookie cutter shapes of choicePreparationStep 1Pulse sugar, baking powder, salt, and 2⅓ cups (292 g) all-purpose flour in a food processor to combine. Add butter and pulse until mixture looks sandy and holds together when you squeeze some between your fingers. Add egg and vanilla and pulse just until dough comes together in a large clump (do not overmix). Turn out dough onto a surface and divide into 2 pieces. Form each into a 1”-thick disk and wrap in plastic. Chill at least 2 hours.Step 2Place racks in upper and lower thirds of oven; preheat to 350°. Roll out 1 dough disk on a well-floured surface to ¼” thick (keep remaining dough in fridge until ready to use). Punch out shapes with cutters dipped in flour and divide cookies between 2 parchment-lined baking sheets, spacing about 1” apart (use a thin spatula to transfer if needed). Gather together any dough scraps, wrap in plastic, and chill 15 minutes.Step 3Meanwhile, bake cookies, rotating baking sheets top to bottom and front to back halfway through, until lightly golden around the edges (cookies should be soft; they will firm up once cool), 10–12 minutes. Let cool on baking sheets, then transfer to a wire rack. Repeat process with scraps and remaining disk of dough.Step 4Whisk powdered sugar and milk in a shallow bowl until smooth (icing should be about the consistency of heavy cream). Working one at a time, hold edges of cookies and dip top sides into icing to fully coat. Place on a wire rack set inside a baking sheet.Step 5Pour half of remaining icing into a small bowl. Color each half of icing with a different color, stirring to combine. Using the end of a spoon or a fork, spatter cookies with colored icing. Let sit until icing is set, at least 2 hours. Do ahead: Dough can be made 2 days ahead. Keep chilled or freeze up to 1 month ahead. Cookies can be decorated 5 days ahead. Store airtight at room temperature.How would you rate Spatter Paint Sugar Cookies?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleIt would have been helpful if you had shown the \"spatter\" technique. the cookies look as if a pastry bag was used to paint criss-crossing lines.  I don't see how \"spattering\" with a fork or spoon would create such straight lines.AnonymousPA1/13/2022Explore Bon AppétitDessertEasyNut-FreeBakingCookieChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kendra Vaculin"]}