{"id": "229bda5fac48dfee3d413242a7360e03", "url": "https://www.bonappetit.com/story/blue-drinks", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Blue Drinks Are Perfect, Thank You Very Much | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Weird, Winding History of Blue Drinks, a.k.a. the Drinks I Love MostMy ideal summer beverage looks like Windex, tastes like juice, and used to be made out of coal tar.By Sophia StewartAugust 20, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailWhile planning a recent string of first dates, I’ve faced the same loaded question again and again. As we deliberate over which bar to meet at, my suitor will ask me, “What sort of drinks do you like?” My answer is always the same: “Blue ones.”I used to wish I could be a Cool Girl who drinks IPAs or whiskey sours or hard liquor on the rocks. But I like my alcohol to taste like juice and look like Windex. My drink of choice can be found at any Margaritaville or palapa-roofed swim-up bar. And in truth I really don’t care what’s in it—I often don’t even know what’s in it—so long as it’s blue.I’ve spent the last year surveying every blue drink within a mile radius of my Brooklyn apartment. I’ve tried the blue drinks of classy establishments (Silver Factory’s dainty and flower-infused Lavender Sky; SEA’s bubbly Ploy Lai Lin, garnished with a single cherry) and considerably divier ones (Abba’s thick and slushy Frozen Blue Hawaiian; Rocka Rolla’s Fish Bowl, served in a chalice and topped with Swedish Fish). Most of them get their whimsical color from various quantities of blue Curaçao, an orange-flavored liqueur dyed with food coloring. But blue drinks are still reviled by some bartenders, many of whom are products of the Craft Cocktail Revolution, a shift in bar culture that began during the mid-1990s and went on to shape American mixology through the 2010s. In those years, cocktail-making became an elevated art form, and therefore Very Serious. At least, too serious for blue drinks.In a 2015 feature for Eater, Wine Enthusiast’s spirits editor Kara Newman traced the history of blue drinks all the way back to their beginnings in mid-19th century England, where the invention of food dye—then derived from coal tar (yum!)—spurred a craze for colorful cocktails. By the early 20th century, coal-tar dyes were supplanted by better tasting and far less toxic ones (hooray for federal oversight!), and the Dutch colony and Caribbean island of Curaçao began importing to the West a new, eponymous liqueur, which came in shades like green, red, orange, and that now-iconic blue. Though blue is now the most popular shade of Curaçao, it didn’t catch on widely until the years following World War II, when the deployment of servicemen to the Pacific Islands incited a wave of exoticism in the States: what Newman calls “Polynesian drink and tiki culture,” which painted forcefully colonized “paradises'' as tropical playgrounds for the wealthy.Silver Factory’s Lavender Sky.\nPhoto by Isa ZapataThen, at a 1957 liquor convention in Hawai’i, the Dutch distiller Bols challenged bartenders to create new cocktails with blue Curaçao. Harry Yee, head bartender at Waikiki’s Hilton Hawaiian Village, came up with the blue drink to rule them all: the ‘Blue Hawaii,’ with vodka, rum, and pineapple juice. The hit film Blue Hawaii (in which a very tan Elvis strums a ukulele and dons a lei and floral shirt) followed, and from then on, mainland bartenders tied blue drinks to gauche tourist traps and their inauthentic faux-island aesthetic. Once the Craft Cocktail Revolution took hold several decades later, Newman writes, blue drinks were “banished from most cocktail menus.”Now the Revolution has been fought and won. Today, craft cocktail bars can be found in most major American cities. Elaborate cocktail recipes fill the pages of countless books and magazines, not to mention an endless scroll of Google search results. Never has the artistry that goes into an extraordinary mixed drink been more apparent to cultural critics and consumers alike. But, since claiming victory, many Revolutionaries have grown more tolerant. In the past decade, blue drinks have slowly transcended the tiki bar and made their way onto craft cocktail menus, even at hip, quirkily-named New York City locales like Please Don’t Tell, Angel’s Share, and Subject.No longer is the consensus unanimous among mixologists that cocktails should be relegated to some sacred, serious realm. Bartenders like John deBary, author of the aptly-named Drink What You Want, recognize that quality drinks can also be vividly colored, elaborately adorned, and utterly biteless. When deBary first created his creamy, umbrella-garnished cocktail, ‘The Shark,’ he realized blueness could be used not just as a gimmick, but as an active aesthetic choice: “It’s not subversively blue; it’s intuitively blue,” he wrote in Punch. “It’s better because it’s blue.”The early origins of blue drinks are undeniably wrapped up in colonialism and inherently othering notions of exoticism—some of humanity’s worst inclinations. But the blue drinks I’ve encountered at bars across Brooklyn have also felt emblematic of our better impulses: to make beautiful and delicious things and then share those things with others. Blue drinks remind me why I drink in the first place—not to impress anyone or convey something about who I am, but to have fun. To feel good. That synthetic, Barbicide-adjacent color? It’s pretty! That fruity Capri Sun flavor? It’s delicious! Those little Swedish Fish swimming atop my Fish Bowl? They bring me joy!In a world of such unyielding seriousness, blue drinks can be a small salve. At least this is what I tell my date when I sense in him a hint of skepticism (or worse, condescension) at my choice of beverage. Forgoing pleasure in the name of vanity is a romantic red flag. Just order the blue drink. It will be better—you will be better—because it’s blue.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-17", "author": ["Condé Nast", "Sophia Stewart"]}