{"id": "22a1020723ff3f47c12a3055ec622fd0", "url": "https://www.bonappetit.com/story/why-we-cant-get-enough-of-this-new-addition-to-the-yogurt-aisle", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Why We Can't Get Enough of this New Addition to the Yogurt Aisle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredWhy We Can't Get Enough of this New Addition to the Yogurt AisleBy Harmless HarvestFebruary 24, 2020FacebookTwitterEmailFacebookTwitterEmailIt’s 2020 and in case you haven’t heard, we are living in a plant-loving age. From plant-based restaurant menus to new products on supermarket shelves to a commitment from the Bon Appétit Test Kitchen to make sure 30 percent of the new recipes developed in house will be meatless, this is the era of plants. As diners, cooks, and lovers of the planet, we’re grateful that they are finally getting their due.To start the morning with some plant love, we’ve been diving into the new Harmless Harvest organic dairy-free coconut yogurt alternative that recently launched at Whole Foods. Made by the brand behind the suspiciously good pink coconut water, these vegan cups come in vanilla speckled with real vanilla beans, lightly tangy plain, and fruity strawberry and blueberry flavors. And they are all ultra smooth and creamy but still light, making a morning meal or afternoon snack feel a touch like dessert, but without all the calories — something we are always here for.From Coconut to Breakfast TableWhen Harmless Harvest launched their organic coconut water in 2011, the team searched far and wide for coconuts with the best coconut water, finding and falling for the nam hom (which means “fragrant ones” in Thai) variety. Those coconuts not only produce exceptional coconut water, but also coconut meat — that’s where Harmless Harvest’s new coconut yogurt alternative comes in as part of the company’s goal to move towards zero-waste; and considering its impact from seed to shelf.After the coconut water is drained from the fruit to be sipped post workout or anytime we need hydration, the creamy meat of the coconut is harvested by hand-scooping, allowing us to upcycle as much of the coconut as possible. The hand-scooped meat is pureed until it’s smooth and luxuriously creamy. Next up: live and active cultures are added and a handful of ingredients like organic strawberries and blueberries, and organic vanilla beans are mixed in before it’s sealed. Nam Hom coconuts result in ultimate creaminess; sans icky gums typically used to thicken plant-based products.Fair for LifeSustainability isn’t just about ingredients. Harmless Harvest knows it’s also about communities, too. It’s a philosophy that is at the core of the company. Their work has been honored with the Fair for Life certification, a third-party that designates companies committed to fair trade and social accountability. And, as the Harmless Harvest team explains on their website: “This means being diligent in our practices and considering everyone — and everything — we affect.”That includes the communities where they farm and bottle their coconut water and harvest their young Thai coconut meat for these morning pick me ups or afternoon snacks (really, we like them at any hour). The team has invested in water filtration systems, regenerative farming, school uniforms, and mobile medical trucks that offer preventative healthcare like checkups to support and give back to the community they live and work in.Let's Get Cooking: More Than Just a Plain CupWhile we’ve never been mad at a good yogurt or vegan alternative like these newcomers from Harmless Harvest, we also haven’t met one that didn’t get along well with granola. And, in Bon Appetit Test Kitchen star Claire Saffitz’s words, “Granola (Yes, Granola) Is the Greatest Recipe of All Time.” We’re not ones to argue with Claire — or her mom’s recipe. The recipe brings together rolled oats, raw sunflower seeds, walnuts, wheatgerm and dried fruit like tart cherries into a chewy, crunchy harmony.If granola isn’t your thing, try drizzling date syrup or honey over one of the plain or vanilla cups of Harmless Harvest organic dairy-free coconut yogurt alternative and topping it with whatever nuts or seeds you have on hand for a vegan and gluten free start to the day. Or, layer a cup or two with fresh fruit for a healthy parfait. And, finally, if savory flavors are more your jam, swap the plain flavor in for a traditional yogurt for a creamy crudite dip or dressing. You won’t be sorry.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-21", "author": ["Condé Nast", "Harmless Harvest"]}