{"id": "22a2209891ae513bf4070b92b092aa28", "url": "https://www.bonappetit.com/story/only-type-of-mussels-you-should-buy", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "These Are the Only Mussels You Should Buy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Are the Only Mussels You Should BuyIf you're standing in the frozen foods aisle: RUN!By Alex DelanyApril 4, 2018FacebookTwitterEmailFacebookTwitterEmailThere won’t be any flexing puns in this mussels article. Or jokes about going to the gym or squatting or doing sit-ups or lifting any kind of weights. The only thing we’re here to do here is tell you what kind of mussels to buy. We’re not here for corny bivalve jokes. If you want those, go ask your Uncle Stephen if he wants to hang out on a dock.When you’re walking through the grocery store, whistling, with a I’m-going-to-buy-some-mussels grin on your face, you should walk right past the frozen seafood section. We don’t like frozen mussels at all. They usually come pre-shelled, have added coloring to make them a coral-ish pink, and have the texture of an inner tube. The delicate flavor and pleasantly chewy texture we love in freshly-steamed mussels are nowhere to be found.The same goes for the shrink-wrapped mussels on the half-shell. We’re not really sure why these things exist, but someone, somewhere thought it was fancy or something. These can fresh or frozen, but they will almost always be bad. Walk right on by those too.Oh, look. You’re at the fish counter. That’s where you want to be. If you’re at a grocery store fish counter...that’s fine. But in our ideal world, you’re standing in front of the counter at a local fishmonger, someone who sells reliably fresh seafood from trusted fishermen. Either way, you need to know what to ask for.You should buy rope-grown, farm-raised mussels. These mussels are grown from ropes that are attached to poles drilled into the floor of the bay or ocean. The ropes hang down into the ocean, allowing mussels to grow along them, and are then harvested by hand or by mussel-collecting machines. Along with being the best for the environment, these mussels will give you the freshest flavor, texture, and aroma, whether they come in a mesh bag or are stored loose on ice.Beards, be gone!\nIn addition to the whole more-sustainable thing, mussels cultivated in this way are, well, a hell of a lot more convenient to work with than wild mussels. Wild mussels, which spend their lives attached to the sandy seafloor or rocky ledges, can be full of nasty grit that needs to be purged with several changes of water; farmed mussels, on the other hand, never touch the ocean floor, and as a result tend to be relatively free of any sandy stuff. Both can grow beards (the scraggly-looking things that sometimes show up toward the bottom of the shell), which need to be removed before cooking, but farmed ones tend to be a little more...clean-shaven.Once you've zeroed-in on the rope-grown, farm-raised mussels at the store, you want to make sure they're fresh. Good mussels should look wet and smell like the ocean, salty and clean. (If they smell a little funky, or many of them appear to be open already, then you're going to want to take a hard pass.) When you get them home, you can leave them in the fridge for up to 48 hours before cooking them. Speaking of cooking them, how's about you try steaming them in a spicy, tomato-y broth? Maybe with some mayo toast? Yeah. Sign us up.GET STEAMED:Mussels in Spicy Tomato BrothPlus mayo bread, because we can.View RecipeExplore Bon AppétitBasicallyMusselSeafoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Alex Delany"]}