{"id": "22c011480d83b757b4a51d9a1cc2e470", "url": "https://www.bonappetit.com/story/pizzeria-beddia-philly-reopens", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "The New Pizzeria Beddia Is Over-Hyped, According to Joe Beddia | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJoe Beddia’s New Pizza Place Is Over-Hyped, According to Joe BeddiaWe dubbed it America’s best pizza when it was a two-man show. Can his new full-service restaurant deliver the same magic?By Dayna EvansMarch 26, 2019FacebookTwitterEmailPhoto by Jason VarneyFacebookTwitterEmailIt’s the opening day of the new Pizzeria Beddia, and it’s been raining so hard there’s a small drip coming in through the front window onto the restaurant’s brand-new wood countertop. “That’s fine, right?” Joe Beddia says, laughing nervously. “I mean, it’s not fine, but—it’s fine.” What else is he going to do?I’m seated at the horseshoe-shaped marble bar next to Beddia’s longtime regulars and fans. It’s 8:30 p.m., and every one of the 90 seats in the house is taken. “We sold out reservations in ten minutes,” Beddia tells me. “Through April.” (Luckily, 60 percent of all spots are left for walk-ins.)From the minute Beddia unexpectedly closed his first pizzeria on Shackamaxon and East Girard almost a full year ago, anticipation began mounting for the second. That’s due mostly to the fact that Beddia’s pizza was outrageously good—this publication named it the best pizza in America in 2015—but also in part to the personality of its proprietor. Beddia dedicated himself to the singular vision of making only 40 pizzas a day in a tiny standing-room-only, 300-square-foot space with one employee. There was no phone, no seats, no reservations, no credit cards, no slices. Consistency, simplicity, and a certain personality-driven special sauce were the pizzeria’s defining charms. Locals, he told me, would pick up pies at least once a week, sometimes more. Tonight they all showed up to usher in a new era with Joe, known in some Philly circles as the Pizza Jesus.With this new venture, Beddia is now one of a few dozen people (including general manager Heather Cahill of Marlow & Sons and Diner in Brooklyn) keeping the business running, but he stands out anyway. Dressed in a royal blue chore jacket and a light purple ball cap, he adds color to the clean white space. (“It straddles the line between Scandinavian and Japanese,” he says of the design.) He’s also the only person in the restaurant sporting an expression of combined terror and joy. He shuffles between expediting pizzas at the kitchen pass and chatting with patrons, new and old, and any time I’m able to catch him, he shakes his head at me. “This is so crazy,” he says, a little stunned.It’s a fun challenge to determine which part of “this” is the craziest: Is it the enormous sanguine-faced cloud light fixture hanging above the bar that is destined to become the pizzeria’s unofficial mascot? Is it the expanded menu, which now includes things like meaty Judion white beans with lemon zest, an excellent bibb lettuce salad dressed with a fish sauce vinaigrette, slices of crispy tomato pie (a focaccia-adjacent tomato sauce pizza served cold), a natural-leaning wine list, and espresso soft-serve? Or maybe it’s the “hoagie room,” a tiny room in the back where small private dinners will soon be available by reservation only.The restaurant’s interior is kept clean and simple.\nPhoto by Jason Varney“There are so many things to be on top of—there’s the service, the wine. I felt like on Monday that I was going to have a breakdown,” Beddia tells me. “I’m thinking about too many things, and focusing on all the negative stuff.”Less than a year ago Beddia was toiling at his craft in relatively monastic solitude. Now, he is running a full-service restaurant with the noise of partners (Suraya co-owners Greg Root, Nick Kennedy, and Al Lucas), patrons, and pizza critics in his ear. Was it crazy to double down on his pizza-making operation to build something new, something much bigger, something that opens him up to the possibility of failure? Or would it have been crazier to have just given it all up and moved on?For five years straight beginning in 2013, Beddia would arrive at his pizzeria at 9:30 a.m. He’d turn on Howard Stern, make 40 pizza doughs, leave for lunch, and then come back a few hours later to sell the fresh pies with his buddy John Walker until they sold out. They were open Wednesday to Saturday, 5:30 p.m. to 10:30 p.m. Some days they had bread to sell, and occasionally had time to make hoagies for friends. The same two dudes worked together every day, and if either of them got sick, they would close. On days when Beddia couldn’t make it in, he would post signs on the front door or on Instagram in his signature funny block letters:“PIZZERIA BEDDIA WILL BE CLOSED TONIGHT BECAUSE I’M WATCHING THE SUNSET FROM A BOAT IN NEW YORK CITY I SINCERELY APOLOGIZE FOR THE INCONVENIENCE PLEASE VISIT US AGAIN THIS WEDNESDAY AND ALWAYS CHECK @PIZZACAMP FOR UP TO DATE INFO IT’S ACTUALLY A YACHT BUT I DIDN’T WANT TO RUB IT IN.”Everything was up to Beddia and his whims on any given day, something that felt both refreshing in a city where certain parts had stagnated under a crush of cavernous corporate restaurants, and old school in a way that paid tribute to Philly’s disappearing family-owned-and-operated dining legacy. People were drawn to the commitment of its quirky founder to the craft of making pizza, and doing it the way he wanted to do it.But it thrived most of all because the pizza, which Beddia had spent years perfecting, was really, really, really good.It had a New York–style crunch with salty, intensely savory cheeses and bright tomato flavor; unlike other styles, Beddia does not cook his tomato sauce. There was no wild yeast thrown in or elaborately curated toppings. It was pizza that induced nostalgia for the era of Teenage Mutant Ninja Turtles, but if that pizza were elevated with high-quality fresh ingredients like Old Gold aged cheese and New Jersey tomatoes.A 15-inch pie with tomato, fresh mozzarella, and Old Gold cheese.\nPhoto by Jason Varney“From the locally sourced ingredients to his meticulously fermented dough, he practically sends each one into the oven with a goodbye kiss,” Philly Inquirer restaurant critic Craig LaBan wrote when the first spot opened, assuring that the hour-long waits were really worth it.It quickly became a local favorite, but manageably so. “We weren’t always at capacity. There were nights when we sold 18 pizzas,” Beddia tells me. Despite the high demand for his pies, Beddia still had time to occasionally crack a beer on the job—his pizzeria was small, and so was his city’s food scene.Over time the press built up. The reputation grew. People from all over the country started coming in search of his pies, lining up at 9 a.m. to be the first to get a taste. “‘This is insane. There's no reason for this,’” he remembers thinking. “People are always like, ‘That’s a good problem!’ Why are problems good? It never feels good to me. To John’s and my credit, we didn't change anything. We just put our heads down and kept doing the work.”Then, in February of 2018, at the height of his success and seemingly out of nowhere, Beddia announced that he’d be closing the tiny operation to open a bigger pizzeria sometime later that year. He posted about the new pizzeria on Instagram with characteristic self-effacement: “We all know it’s not going to be as good. I mean it’s not really that good now it’s just all hype. Anyway, I’m going to take a little break and regroup. It’s definitely going to be a different experience. Can’t wait to share it with you. Xoxo”Beddia’s mind—by his own admission—is always somewhere else. When he talks, he shifts around a lot and punctuates his sentences with intermittent “I dunno”s, sometimes quick, like an alternative to “um,” and other times drawn out like he may actually be deciding in that moment whether he believes what he’s saying. As in, “I'm obsessed with quality. Quality is not subjective, I dunno” and “I have these ideas and luckily I just do them, I dooon’t knooow.” He’s self-deprecating, but as you might expect for a guy who did the same thing basically every day for five years, he is very confident in and excited by the things that he does know: pizza, wine, beer, Philly.His interest in food began with his Italian-American family: His dad, aunts, and grandmothers are all first-generation immigrants from Sicily. “They’d put a bunch of meat in a pot, cook it slowly, and then you’d eat spaghetti with it,” he tells me of his early food memories. “Every time you went to their house, you ate well.”The bibb lettuce salad with watermelon radish, apples, Marcona almonds, and fish sauce vinaigrette.\nPhoto by Jason VarneyHe was 16 when he took his first job at a hotel restaurant in Lancaster, Pennsylvania, where he was born and raised: He’d help set up a buffet on Saturdays and Sundays that served 500 people, an experience he likened to running a pirate ship. In college he studied in a hospitality program for a year before dropping out and then sold discount polos at a Ralph Lauren outlet store in Reading. After work he’d go with his friends to a “legendary beer bar,” the Northeast Taproom. It was there that Beddia met one of his earliest influences, a beer obsessive named Pete Cammarano, who was also the owner, the bartender, and the sole employee at the time. It was a one-man operation that felt intimate, deliberate, and personal.He got into brewing beer and spent four months in Japan working at Kiuchi Brewery. While there, he ate a life-changing marinara pizza at Savoy and observed Japanese chefs who were the lone employee of their own cafés. It was in Tokyo that he realized exactly what he wanted to do with his life: open a pizza restaurant influenced by deeply skilled sushi chefs, owner-bartenders who mopped the floors themselves, and old-school pizza guys like Dom DeMarco of Di Fara Pizza in Brooklyn.“Joey has always been a do-it-yourself kind of person,” Beddia’s younger sister Maria, an illustrator in Philly, explains. “He talked about opening a pizza place for years. We kind of all made a joke of it. ‘Sure, sure, when’s that going to happen?’”So when it did happen, and it blew up, everyone was even more shocked that, after five years of runaway success, Beddia shut it down. “When you’re selling out every day, and you’re able to walk to work, and you have one really amazing employee, it just kind of seemed like the perfect job,” Maria recalls. “But his mental approach was, This is a project. At some point, I’m going to move on.”The bar with its friendly cloud light fixture (designed by art collective Friends With You) and will-be mascot.\nPhoto by Jason Varney“I just didn’t want to do it anymore,” Beddia told me in January, when he first showed me around the new space, which at the time was still a construction zone in an old machine shop behind the El train. “I wanted to continue to make pizza,” he clarified, “but I wanted to not hate it.”He initially toyed with the idea of making wine, but ultimately he realized that the litany of challenges, questions, and decisions that come with opening a full-service restaurant appealed to him in the same way that cracking the code for the perfect pizza did.“I get to design the space, serve you the wine, the salads, the pizza,” he says of his new role, which notably does not include making all the pizzas himself. Instead, he’s teaching a staff of pizzaiolos to make it his way. “How do you teach them if it can be so variable? You just show them and talk about it,” he says. He’ll continue to oversee the process until he’s satisfied they can make it right without him.“I always get somewhere and then I want to move past it. It’s like you learn the thing, you do it, and then it’s over,” he says. “It’s weird to be defined by pizza in some way. It’s not that I don’t care about it. I did it. What’s next?”Explore Bon AppétitRestaurantsPhiladelphiaOpeningsRead MorecultureThis Is the Best Pizza in America (Yep, We Said It)By Andrew KnowltonPhotography by Andrew Thomas LeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-26", "author": ["Condé Nast", "Dayna Evans"]}