{"id": "22ce92f6ffb70d5bfc2b36a9969fd507", "url": "https://www.bonappetit.com/story/nina-and-rafi-detroit-pizza", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "When This Jersey Guy Makes Detroit-Style Pizza in Atlanta, You Eat It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen This Jersey Guy Makes Detroit-Style Pizza in Atlanta, You Eat ItAnthony Spina was famous for his grandma pies. Then he pulled the rug out from under us all.By Hilary CadiganOctober 29, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The first time I snatched one of Anthony Spina’s grandma pies from the takeout window of his tiny O4W Pizza shop, I knew Atlanta’s pizza game had changed for good. The creamy pats of housemade mozzarella; the slightly sweet marinara sauce cut with garlic; the freshly torn basil; and that oh-so-chewy-crisp square crust. All in all, a perfect pizza. Just $2 a slice, and unlike anything else my mostly-Neapolitan-focused city had to offer.Then, just a few months later, O4W Pizza was gone. And a few months after that, another crushing blow: It would return but not to the walking-distance-from-my-house Old Fourth Ward neighborhood from which it took its name. Instead, it would be way out in Duluth, a suburb 30 miles away (which, in Atlanta, could mean sitting in traffic for literal hours).Born and raised in New Jersey, Spina’s been making pizza since the early ’80s and swears his only secrets are fresh ingredients and a passion for pie. When he came to Georgia, he already had a following—his pizzeria in Long Branch was named one of the ten best in the whole state of New Jersey the same year it opened—so even after he moved to Duluth, die-hard fans still regularly braved the traffic for their now-suburban-dwelling grandma.Then, suddenly, fresh news: Spina would be returning to Old Fourth Ward to open Nina & Rafi, a new restaurant with business partner Billy Streck, but...he wouldn’t be serving the grandma pie. Instead, he’d go in a new direction entirely: Detroit-style pizzas. It was the collective “What?!” heard ’round the city.At first, I was annoyed. We all were. Then, we had a taste.The first thing to know about Spina’s Detroit pie is that, like the grandma pie: It is square, and it also has cheese and dough and tomato sauce. But that’s about where the similarities end. The Detroit is approximately three inches thick. It looks more like a lasagna than a pizza. The dough is light and airy inside and on top, the layers are swapped: first, a puffy, golden carpet of mozzarella; then, great globs of thick, chunky tomato sauce so savory and flavor-packed that I’d eat a bowl plain and call it soup. And then there are the edges. Oh, the edges! Here, in this lacy, crispy dreamworld, one cannot even know where cheese and crust diverge. The two come together in such crispety, buttery, flawless harmony you may just black out. And during that blackout, you might also snarf down a few of Spina’s hulking meatballs, swaddled in that same perfect sauce. Or perhaps some oozy arancini with risotto, pecorino, and more of that housemade mozzarella. Maybe you’ll wash it all down with a bubbly Corsica spritz or a hazy bottle of unfiltered Arneis. Maybe you’ll roll across the street and sign a lease for one of the flimsy-looking new apartments that popped up seemingly overnight just so you can come back and do this again every day.Grandma, who?Go there: Nina & RafiExplore Bon AppétitHighly RecommendAtlantaPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-29", "author": ["Condé Nast", "Hilary Cadigan"]}