{"id": "22d90e20f92beb052d227777756425fd", "url": "https://www.bonappetit.com/story/dressing-salad-twice", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "You Should Probably Be Dressing Your Salad Twice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Probably Be Dressing Your Salad TwiceA lot of times, once just doesn't cut it.By Alex DelanyOctober 31, 2018FacebookTwitterEmailFacebookTwitterEmailHave you ever noticed that the salad you eat at home tastes a little different than the salad you eat at your favorite restaurant? That restaurant salad seems to pack so much flavor in every bite, regardless of how simple or complicated it may be. Nothing is (or should be) boring or bland. How do they do that? Well, that restaurant salad is better because it’s dressed properly. And if we had to guess, we’d also say that it’s dressed twice.Yes, two times. Once with a baseline dressing and once with a dressing that lives in the spotlight. This is especially important when you're working with a thicker, richer dressing—think a creamy homemade ranch, or a nutty tahini sauce—that might be hard to distribute as evenly as, say, a vinaigrette.  These two dressings work together to make sure every bite of your salad is seasoned, and that no piece of lettuce, herb, or shaved vegetable stays dry and bland. Here’s how it works.Think of salad dressing like a sauce because, well, that’s exactly what it is. Sauce is a seasoning agent for your food, meant to coat everything it touches, and that means that salad dressing is a seasoning agent for your lettuce. Plain lettuce, without any dressing, isn’t much to fantasize about. But when you add a little salt, fat, and acid to the situation, those leafy greens turn into something else entirely.And that’s exactly what your baseline dressing should be: olive oil, acid (either citrus or vinegar), and salt. Using your hands, toss the greens of your salad with the simple dressing in a large bowl making sure every piece gets coated. Then transfer the seasoned greens to the platter or bowl you’re going to serve it in. What you’re looking at here is the fully seasoned foundation of a killer salad.After the base dressing comes the main dressing. And some crunchy stuff to boot.\nNow it’s time for that marquee dressing. This might be a creamy homemade ranch. Or a miso and tahini situation. Or a classic Caesar. It doesn’t really matter what it is. All that matters is that this dressing, which will almost always be thicker than the baseline dressing, gets drizzled over the salad.And here’s where you can see what would happen if you didn’t apply that baseline dressing. You’re not going to paint every single leaf with this thicker dressing. There are going to be spots where the salad is left bare, missed by your artful drizzle. If the baseline dressing wasn’t there, those bites wouldn’t be seasoned. But since you’ve tossed the lettuce in the simplest of sauces, they are. Every bite is guaranteed to taste like the best version of itself, whether it has a heap of that homemade ranch on it or not.Now you know. And now whenever you go into a restaurant, you can walk right into the kitchen, find the chef on the line assembling the salads, make eye contact, and give the “I know exactly what’s going on here,” nod and wink in their direction. You’re part of the club now.And here's a killer salad recipe, just in case:Every Night Salad with Yogurt RanchThis crunchy romaine number, drizzled with a creamy, craveable yogurt-based homemade ranch dressing, is the kind of salad that goes with just about anything, from delivery pizza to pan-seared pork chops.View RecipeExplore Bon AppétitBasicallySaladSalad DressingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Alex Delany"]}