{"id": "22e3ad04ee1f4cb56298244aeecef523", "url": "https://www.bonappetit.com/recipe/instant-pot-beef-pho", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "Instant Pot Beef Pho Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInstant Pot Beef PhoBy Diana YenFebruary 3, 20214.4(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintMaking traditional beef pho can be an all-day affair, with the broth bubbling away for 3–6 hours. This instant pot version takes an hour and a half (including pressure-release time), but it doesn’t sacrifice flavor thanks to toasted spices and browned onions and ginger that get simmered along with beef bones and brisket. Using a variety of bones as well as brisket is the secret to umami-rich broth. While you’re waiting for the broth to finish cooking, prep all your garnishes and noodles so everything will come together quickly at the end. Pour the hot broth over your assembled bowls and watch your beef slices cook on the spot.Cook’s Notes: Yellow rock sugar can be found in specialty markets and online. It’s a honey-hued sugar that is mildly sweet and rounds out the flavors in pho broth. Break down into large pieces with a mallet to use. It is used in Asian drinks, desserts, and soups.Ingredients4 servings3star anise pods13\" cinnamon stick4whole cloves2Tbsp. vegetable oil, plus more for noodles2medium onions, peeled, halved12\" piece ginger, scrubbed, sliced lengthwise ¼\" thick3lb. 2\"–3\" sections mixed soup beef bones (oxtail, marrow, knuckles, and/or neck bone), rinsed under cold running water to remove blood and excess bits1lb. beef brisket or chuck, cut into 2\" pieces2Tbsp. (or more) fish sauce½oz. yellow rock sugar or 3 tsp. granulated sugar2½tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt; plus more (optional)10oz. dried thin Banh Pho rice noodles8oz. beef eye of round, sirloin steak, London broil, or tri-tip steakRinsed thinly sliced onion, thinly sliced scallions, chopped cilantro, Thai basil leaves, mint leaves, mung bean sprouts, sliced Thai or serrano chiles, lime wedges, Sriracha, and/or hoisin sauce (for serving; optional)Freshly ground black pepperPreparationStep 1Set a 6-qt. Instant Pot to high sauté. Toast star anise, cinnamon stick, and cloves, stirring, until fragrant and crackling slightly, about 2 minutes. Add 2 Tbsp. oil and work around to coat bottom of pot. Reduce heat to medium, add onions, cut sides down, and ginger, and cook, undisturbed, until deep brown in spots, 5–7 minutes.Step 2Pour in 1 cup water, scraping up any browned bits with a wooden spoon, then add beef bones, brisket, fish sauce, sugar, 2½ tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and another 6 cups water (or just up to your max fill line). Lock lid and turn venting knob to sealing position. Cook on high pressure 1 hour (it will take about 20 minutes to come to pressure before the cook time begins). Naturally release pressure 30 minutes.Step 3While the broth is cooking, place noodles in a large bowl and pour in cold water to cover. Let soak 30 minutes. Drain noodles and rinse to remove excess starch.Step 4Freeze beef eye of round until firm, 20–30 minutes. Thinly slice against the grain, then chill in refrigerator until ready to serve.Step 5Once pressure on pot has released 30 minutes, place a kitchen towel loosely over vent to prevent splattering. Using a wooden spoon, gradually open venting knob. As soon as floating pin drops, carefully open lid. Using tongs, transfer bones to a large bowl.Step 6Place brisket in another large bowl and pour cool water over to cool down and keep from drying out. Using a fine-mesh sieve, scoop out solids from broth; discard aromatics and reserve any meat and bones for serving if desired. (Leftover meat and bones can also be reserved for another use; add to fried rice or bibimbap or scoop out marrow and slather it over slices of grilled toast.) Skim fat from surface with a ladle and discard. Taste broth and season with more fish sauce or salt if needed. Set to low sauté and simmer gently while you cook the noodles.Step 7Fill a large pot one third of the way with water and bring to a rolling boil. Add noodles and cook, using chopsticks or a wooden spoon to stir, until just al dente, about 15 seconds. Drain noodles in a colander and rinse well under cold water to stop cooking. Drizzle a little oil over and toss to coat (this will keep them from sticking together).Step 8Remove brisket from water and thinly against the grain. Divide noodles among deep bowls. (Pro tip: Before adding noodles, swirl hot water inside bowls to warm up, then discard.) Top each bowl with a few slices of brisket, sliced beef eye of round, and any reserved meat and bones (if using) and top with sliced onion, scallions, and cilantro (if using); season with pepper. Ladle hot broth over raw beef to cook.Step 9Arrange Thai basil leaves, mint leaves, mung bean sprouts, chiles, and lime wedges on a platter for topping pho as desired and serve with Sriracha and hoisin sauce in small bowls for dipping.Do ahead: Broth can be made 1 day ahead. Transfer to an airtight container; cover and chill. The fat will solidify on the surface, making it easier to skim and flavors will deepen. Strained and skimmed broth can be made 3 days ahead. Transfer to an airtight container; cover and chill, or freeze up to 3 months.Cook’s Notes: Yellow rock sugar can be found in Asian supermarkets. It’s a honey-hued sugar that is mildly sweet and rounds out the flavors in pho broth. Break down into large pieces with a mallet to use. It is used in Asian drinks, desserts, and soups.How would you rate Instant Pot Beef Pho?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleI love pho. In Toronto, where I live, I’ve tried every pho restaurant from every Best Pho list out there. This recipe gets 4 stars because I only used it as a guideline while attempting to make the perfect home pho and used these rather important extra steps:\n\n1. Instead of rinsing raw beef in cold water, I parboiled and then cold-rinsed my meat (oxtail, marrow bones and a small bit of sirloin roast\n2. I charred the onion and ginger in a cast iron pan for deeper colour and delicious burnt-ness\n3. After pressure cooking, I brought it to a rapid boil before ladling on the noodles. \n\nBon Appétit never leads me astray. This recipe just needed a tiny bit of tweaking to make it my perfect at-home pho. And cooking the noodles like this worked great! Tea Toronto, ON, Canada 2/1/2022it’s passive aggressive war in the comments of this beef pho recipe. bless your mean little heartsAnonymous1/13/2022Why, in 2021 or 22, are you printing recipes? If you are able to read this and comment on it you clearly have access to the digital world. Save the recipe.Leo31/4/2022I made this without beef products, I just used a pack of chicken thighs, and it was incredible. It would have probably been even better with the beef bones, but imo it was so flavorful with the spices, fish sauce, and onions alone.  AnonymousChampaign, IL2/23/2021I made this without an instant pot - just brought it to a boil without a cover and then covered and reduced heat to a simmer, then simmered for three hours. It came out fantastic.Grace ABoston, MA2/22/2021Fyi, this recipe will not print past page 2 or step 3!Anonymous2/7/2021Thank you for a BEEF recipe. I don't do Chicken, so it was nice to see a beef recipe.\nThank you very much.LizzieB2/6/2021@Mare The white rock sugar should work as well! Enjoy making the pho! Diana YenOjai, CA2/5/2021I'm sure it'll be ok, but I'll ask anyways: I don't have Yellow Rock Sugar, but I do have South Word Brand Lung Po Lump Candy / Crystal Rock Sugar 南字牌 單晶冰糖 - 14.1 OZ (White \"白冰糖\") . It'll be ok as  a substitute? Thanks. Mare2/5/2021Came out excellent! What a taste sensation to make at home!Rod FisherBellevue, WA2/5/2021I can't wait to try this!  I actually just made chicken pho earlier this week in my Instant Pot using a stovetop recipe from Smitten Kitchen.  The aromatics and technique were similar, for anyone wanting to try a chicken version.AnonymousLockhart, TX2/5/2021Looks interesting but Please provide a chicken or shrimp alternative as we don’t eat beef. Thanks!Debbie JSacramento CA2/5/2021@Anonymous (2/4/21) - This recipe is called Instant Pot BEEF Pho.  I respect your meat eating choices but everyone knows chicken must be, and has to be, cooked with different methods than beef.  This literally uses raw beef in sections.  My suggestion is instead to search independently for a Chicken Pho recipe.EricJMAstoria, NY2/5/2021Can this be made with chicken instead of beef?  We do not red meat at all and our local restaurants always make pho with chicken.Anonymous2/5/2021Explore Bon AppétitSoupSoups and StewsVietnameseSoutheast AsianAsianRice NoodleNoodlePasta & NoodlesBeefMeatMainGluten-FreeNut-FreeDairy-FreeInstant PotDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-03", "author": ["Condé Nast", "Diana Yen"]}