{"id": "22e434a106cf3df317a761ac6b95e884", "url": "https://www.bonappetit.com/recipe/roasted-carrots-with-ayib-and-awaze-vinaigrette", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Roasted Carrots With Ayib and Awaze Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueRoasted Carrots With Ayib and Awaze VinaigretteBy Marcus SamuelssonDecember 1, 20205.0(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintChef and Bon Appétit global advisor Marcus Samuelsson compares awaze to Ethiopian Sriracha, in that it brings just the right amount of heat and you’ll want to use it on everything. For this recipe, he creates an awaze-inspired vinaigrette, using a berbere-spiced brown butter that adds some heat to sweet roasted carrots. Our advice? Make a little extra for melting over seared fish or other proteins or tossing into roasted vegetables, greens, or potatoes.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’Ingredients8 ServingsSpiced Brown Butter½cup (1 stick) unsalted butter¼small red onion, finely chopped1sprig thyme11½\" piece ginger, peeled, coarsely chopped1small garlic clove, finely chopped¼tsp. ground cumin¼tsp. dried oregano⅛tsp. ground turmeric1tsp. berbereCarrots and Assembly2lb. carrots, cut on a diagonal into 3\" pieces6Tbsp. vegetable oil, dividedKosher salt, freshly ground pepper1orange, thinly sliced into rounds, seeds removed3Tbsp. fresh lemon juice1Tbsp. honey2tsp. Dijon mustard½cup parsley leaves with tender stems¼cup ayib (Ethiopian fresh cheese) or crumbled goat cheesePreparationSpiced Brown ButterStep 1Melt butter in a medium saucepan over medium-low heat, then simmer gently, reducing heat if needed and skimming foam from surface, until butter is no longer foaming and is beginning to brown, 10–15 minutes.Step 2Mix onion, thyme, ginger, garlic, cumin, oregano, and turmeric into brown butter and cook, stirring occasionally, until onion is golden brown and mixture smells very fragrant, about 15 minutes. Stir in berbere and cook, stirring constantly, just until the spice mixture is very fragrant, about 1 minute. Strain brown butter through a fine-mesh sieve into a small bowl and let cool completely; discard solids.Do ahead: Spiced brown butter can be made 1 week ahead. Cover and chill.Carrots and AssemblyStep 3Preheat oven to 400°. Place carrots on a large rimmed baking sheet. Drizzle 4 Tbsp. oil over, season with salt and pepper, and toss to coat. Add orange slices and gently toss again just to combine. Roast, tossing halfway through, until carrots are browned in spots and tender (they should be easy to pierce with a fork), 30–40 minutes. Let cool slightly.Step 4Meanwhile, whisk lemon juice, honey, mustard, remaining 2 Tbsp. oil, and 3 Tbsp. spiced brown butter (reheat if it has solidified) in a small bowl. This is your vinaigrette.Step 5To serve, transfer carrots to a platter. Drizzle vinaigrette over and top with parsley and ayib.How would you rate Roasted Carrots With Ayib and Awaze Vinaigrette?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleReally really good.  Very sophisticated flavors. Great as one of several vegetarian dishes. In first looking at this recipe I thought no way I was going to make it.  So many ingredients and steps.  But then I wanted roasted carrots tonight - and had nothing else to roast - so I went for it. Was not as hard as I thought. Had to throw together my own Berber spice blend as I did not have any. But came out great and was reasonably do-able.  Maybe will make again for friends. It’s that kind of show off dish!  EssieDee Stamford ct4/13/2021Amazing. Great flavor.  Based on other reviews I turned up the heat on the butter and watched it closely.  Did not have berbere and my cardamom was pretty stale (time to order up!) so I left that out, added a chili pepper and then some cayenne before making the dressing.  also didn’t have fresh Ethiopian cheese - so the tub ‘o feta from Costco served well.  This is a wonderful way to serve carrots and probably other vegetables, too.Charlotte travelerCharlotte2/15/2021Delicious but man, did that brown butter take FOREVER. Lots of prep for a vinegarette, but worth it. Used chilis instead of berbere and goat cheese. \nAnonymousNYC1/12/2021Really tasty.  Am making it again as a side with standing rib roast for Christmas.  Substituted smoked paprika for the berbere and goat cheese for the ayib.Benjamin H.Brooklyn, NY12/26/2020This was fantastic. Will definitely make again. I opted to pair it with a Savoy chicken, ( I used the strained onion and garlic from the spiced brown butter... )  Will definitely make again. Henry W0875512/4/2020Explore Bon AppétitEthiopianEast AfricanAfricanCarrotVegetableSideVegetarianGluten-FreeHealthyishRoastRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}