{"id": "22f9db065907af1518a858c1a7c37b9e", "url": "https://www.bonappetit.com/story/healthy-hyna", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Healthy Hyna Founder Lorena Ramirez On Going Vegan and Visualizing the Future | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHealthy Hyna Founder Lorena Ramirez on Going Vegan and Visualizing the FutureHer plant-based wellness platform shares recipes and lifestyle tips rooted in Chicano cultureBy Martine ThompsonSeptember 1, 2020FacebookTwitterEmailPhoto by Maria del RioFacebookTwitterEmailIn Here We Are, artist Martine Thompson explores what it means to care for oneself in a world that doesn’t make it so easy. Up next, a conversation with Lorena Ramirez, founder of the plant-based wellness platform Healthy Hyna.When I ask Lorena Ramirez how she would describe this season of her career, three words come to mind: “transformative, blossoming, and abundant—not just now, but always.” The vegan food enthusiast has been filling me in on her self-care practices and the various hats she’s worn during the ongoing journey of her 20s—mother, dancer, quinceañera choreographer, shoe business owner, private chef. In 2018, in between the shuffle, she became the founder of Healthy Hyna, a wellness platform sharing recipes and lifestyle tips rooted in Ramirez’s experiences as a first-generation Mexican American vegan.The first thing to grab my attention about Healthy Hyna were the endearing visuals: A hand adorned with gold rings and a fresh manicure adding salsa to a quartet of tacos or holding a breakfast burrito with soy chorizo, sautéed potatoes, diced serrano chile peppers, and avocado. The level of care, culture, and personality woven into how the platform engaged with the community, from IRL events to the creative direction of an Instagram post, was refreshing. Video posts showed glimpses of Lorena leading a free plant-based cooking demo for women and children at a WIC center, and throwing up the West Coast sign with a big grin on her face before teaching “holistic healing in the form of cooking” to a group of 20- and 30-somethings navigating food deserts. She’s putting her own spin on the long tradition of building community spaces around food and healing, focusing on how we tend to our mental, physical, emotional, financial, and spiritual health. It resonates with me infinitely more than the content that floods mainstream food and wellness spaces, and I’m glad it exists.I caught up with Lorena during quarantine and she opened up about the motivation behind her wellness work, her grocery store staples, and the daily visualization exercise bringing her closer to her goals.Embracing the unknownI became vegan when I was a stay-at-home mom. People would ask me how I made certain dishes after posting them on Instagram, and food blogging was really poppin’ at the time, so I thought I’d try it and see how I liked it. Then I thought, maybe I can dabble in being a private cook or host cooking lessons, so I did that as well. I didn't like private cooking, and hosting cooking classes was a lot of event production and I didn't necessarily like that either. I prefer being in the background and Healthy Hyna was kind of making it seem like I was an influencer. I’m still figuring out this journey, but one of the biggest lessons I’ve taken away is to never stop learning.Instagram contentThis content can also be viewed on the site it originates from.Ending negative cycles and creating new onesI was raised by immigrant parents who did not have the time to learn about improving their health, becoming financially abundant, or improving their parenting skills simply because they were just trying to survive and provide for my siblings and myself in America with blue collar jobs. They were always under so much stress. I empathize with my parents. I understand the hardships they went through, and I want to make up for that. I can flip the script and create my own narrative by creating positive cycles in health, wealth, and parenting. I want my kids, and their kids, to pass down this knowledge so we can create generations of enlightened families rich in health and money. I want my kids to live in a society where Black and brown people are executives in every business industry.When you master your health (physical, mental, emotional, spiritual), you will naturally have a positive aura. You’ll attract positive, like-minded individuals and the quality of your relationships are enhanced. You'll be in the right mindset to serve as an emotion coach to your children.Grocery store game plan If someone is trying to hold themselves accountable and eat healthier, it’s always helpful to plan ahead. Decide what you’re going to eat throughout the week and then make a list. It definitely helps with avoiding a second trip to the store. I spend $400 on grocery trips monthly, sometimes less, like $300–$350, for my two kids and myself. Coconut milk is always on my list for sure; it’s very versatile. Almond milk for smoothies, like the ones in my e-book; kale, rice, beans, and a variety of veggies are all staples. Go to the produce section first, and go to the frozen section last—if at all. That’s where things start to get unhealthy.When people are interested in trying a plant-based diet, I always recommend starting with simple dishes. I call it humble food, some people call it a \"burrito bowl\": rice, beans, sautéed veggies (I like to use cactus or shitake mushrooms), and avocado, drizzled with some good homemade salsa or mole. I usually use the mole that my parents give me from Mexico, but a really good brand that I like is Doña Maria.No shame in the checkout gameAbout five years ago, I was at Sprouts paying with my EBT card, and my partner at the time said, “That white lady was looking you up and down.” And I thought, what the hell? You can’t pay attention to that stuff, first off. I don’t want to throw my energy into that. I think it all comes down to not caring what people think. If you receive government assistance and food stamps, take advantage of the fact that stores like Whole Foods accept it—and be unapologetic about it. Some of us have times when we need it. There should be no shame in that.People associate being vegan with having to shop at these specialty health food stores, but it’s not necessary. You can go to Northgate, Superior, or whatever mom-and-pop grocery store you’ve got in the area.Get that REM sleep, honeyI go to bed at 10 p.m. to get my “juicy sleep” as Elizabeth Lambaer, a 61-years-young raw vegan YouTuber, likes to call it. It helps me feel vibrant and awake at 5 a.m., which is so important for me as a mom of two toddlers! When you're a mom, you need your quiet time. Also, my days are pretty busy during the week, so I like to work out early in the morning.Visualizing the futureIt’s important to me to read and listen to my life vision in the morning and at night. A life vision is how you envision your life to be in x amount of years — how you want to look, what you want to be doing, how much money you'll be making—then you write it out in first-person as if you're talking to a friend you haven't seen in a long time. I've written my life vision down with drawings and recorded myself reading it out loud. I learned this method from bestselling author and dear mentor of mine, Hazel Ortega. It helps me stay positive and clear-headed, and ensures everything I put my energy toward brings me closer to my goals.Deeper than an “aesthetic”In Chicano culture, hyna is a term for a young woman, but it also stands for being proud of your culture and where you come from. Healthy Hyna is a way of living. (If I could pick a song to describe it, it would be “L.A.” by Murs.) Healthy Hyna represents generational health, improving and maintaining mental, financial, physical and inner health. It’s influenced and inspired by Chicano culture, Lowrider culture, Black American culture, West Coast culture, and by my Mexican culture. The colors, the food, the traditions. It is what I am.Explore Bon AppétitHere We AreHealthyishLos AngelesInterviewsRead MoreLifestyleKelvin Harrison Jr. Is Ready to Go InwardBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-01", "author": ["Condé Nast", "Martine Thompson"]}