{"id": "22fc1c93ecff5f8550296da72d3dcca2", "url": "https://www.bonappetit.com/story/taste-of-persia-ash-reshteh", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Taste of Persia Is My Favorite Place for Soup in New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Place for Soup Is Hidden in a Pizza RestaurantI’ll eat Taste of Persia’s ash reshteh even on sweltering New York summer days.By Carey PolisDecember 18, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Editor's note 2/4/20: Taste of Persia is currently closed but remains in dispute.The best place for soup in New York City is inside a pizza place you would easily walk by without noticing. Tucked in the front corner of Pizza Paradise is Taste of Persia, a not-quite-restaurant that serves a rotating set of Persian dishes. Both the beef kebab and the fesenjan, a chicken stew with walnuts and pomegranate, are excellent. But I’m there for the ash reshteh, a hearty vegetarian soup I will eat not only in the winter but also during a humid summer day if I find myself within five blocks of the storefront.What makes this beans-and-greens soup so excellent? It’s the fact that there are so much of both. That means five kinds of beans: split peas, lentils, chickpeas, red kidney beans, and black beans. As for the greens, there are scallions and spinach, plus tons of herbs (parsley, cilantro, and mint). It almost sounds like too much going on, but the result is a fragrant amalgam of a whole lot of goodness. It’s like when you have a party and invite exactly the right number of people so that it feels full but not too crowded. Except…it’s soup.Chef-owner Saeed Pourkay\nPhoto by Laura MurrayMy favorite part is the toppings: fried mint, kashk (Persian whey), and crunchy onions and garlic. They counteract the rather goopy soup to give it some lovely texture. And I haven’t even mentioned the noodles! There are also thin linguine noodles!So get some soup, get some chicken, and, if you want, get some pizza too. They aren’t meant to go together, but sometimes at a party you end up having a conversation with someone you didn’t expect to, and it works out pretty damn great.Go there: Taste of PersiaExplore Bon AppétitHighly RecommendNew York CityRestaurantsPersianRead MorecultureThe Best Part of This Tate Modern Exhibition Was...LunchBy Allie WistRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Carey Polis"]}