{"id": "23020335ce2b1acb01a3797b5079bd88", "url": "https://www.bonappetit.com/story/sustainable-seafood", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "The Best Way to Buy Sustainable Seafood? Support a Local Fishery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryCSFs are the best way to get domestic, wild-caught seafood delivered to your door.By Aliza AbarbanelJune 21, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailTrying to buy sustainable seafood generally means falling down a wormhole of charts, ranking systems, and misinformation.  Recently, an AP investigation alleged that popular online seafood purveyor Sea to Table misled customers regarding its sourcing and supply chain transparency, among other claims (Sea to Table has refuted several of these allegations.) To better understand how consumers should seek out sustainable seafood options, we turned to Sheila Bowman, Manager of Culinary & Strategic Initiatives for the Monterey Bay Aquarium's Seafood Watch.\"Take the lessons that you know from the farmers' market and apply them to fish,\" says Bowman. \"Eat what’s seasonal and available and you’ll get a better product than demanding tuna in the middle of winter.\" Seafood Watch has an app that provides up-to-date seafood recommendations, season by season, to keep you informed at the fish counter.Likely the best way to get domestic, wild-caught seafood delivered to your door is through a community-supported fishery (CSF), which is basically a traditional CSA farm share but for fish. The format varies, but most involve purchasing shares of the CSF at the beginning of the season, which helps pay the upfront costs of harvesting and processing seafood. This allows family fisherman to stay small and minimize their environmental impact while making a living wage.\"We love the CSF model,\" says Bowman. \"If you’re buying locally from a sustainable fishery that has their hands on the product, I don’t know how much better you can do than that.\" For fish lovers in landlocked parts of the country, she recommends look for CSFs with detailed information and a short supply chain that will ship to your area. To find one near you, check the Local Catch online network, or check out this list of regional favorites.West CoastReal Good Fish partners with California fishermen to deliver a local species each week throughout the state. The CSF prioritizes transparency, pairing each delivery with information for where the fish was caught and who caught it. This level of care has translated into lots of fans—they're even the CSF of choice for some Monterey Bay Aquarium staffers like Bowman. In the Pacific Northwest, Drifters Fish delivers fresh, smoked, and frozen wild Copper River salmon across the greater Seattle area, and Port Orford Sustainable Seafood sends wild, line-caught seafood like albacore and Pacific halibut from local fisherman throughout western Oregon.MidwestIt’s admittedly trickier to get sustainable seafood in the landlocked Midwest, but Sitka Salmon will deliver wild Alaskan seafood directly to cities in Iowa, Illinois, Indiana, Wisconsin, and Minnesota. The CSF delivers seafood like wild Alaskan king salmon, dusky rockfish, Dungeness crab, and halibut. Additionally, Kwee-Jack Fish Co ships sushi-grade sockeye salmon to Montana and Wisconsin from Graveyard Point, Alaska.East CoastIn addition to keeping the Midwest stocked with sustainable salmon,  Kwee-Jack Fish Co ships to spots in Pennsylvania and New Jersey too. Mermaid’s Garden in Brooklyn offers a weekly fish share with fully traceable seafood from Long Island and New England. Their supply varies throughout the year and may include tuna, mahi mahi, and swordfish. And, while some boats migrate south in the winter and ship their catch northward,  all fish is caught by small-boat fisherman using sustainable methods. Up in Vermont, Honeywilya Fish runs a CSF fish share delivering hook-and-line caught wild Alaskan salmon like Coho and Ivory King to six counties.The SouthIn North Carolina, the Walking Fish CSF provides locally caught seafood like sea mullet and trigger fish to the Raleigh Durham area. CSFs in this region are fairly scarce, but it's still possible to receive sustainable seafood wherever you are through the national options below.NationwideDock to Dish built a name as a “restaurant-supported fishery” supplying notable New York restaurants like Le Bernadin and Eataly in NYC.  In 2017, the United Nations Foundation lauded their program as an innovative business that can “help save our ocean.” Today, the collective connects regional fisherman with local customers in Washington D.C., New York, San Francisco, and L.A. Think of it like a large-scale CSF, where members pay in advance for a share of the catch throughout the season, delivered right to their doorstep. There's currently a waitlist, so add your name fast.Up in Maine, Port Clyde Fresh Catch ships locally caught seafood around the country.  If you're outside their delivery areas, family-owned Schoolhouse Fish Co in Petersburg, Alaska allows people to set up “fish clubs” to receive bulk order shipments in cities nationwide. Join an existing club in cities like Houston and Salt Lake City, or find a group of fish-loving friends to create your own.Overall, it's important to look for transparency. \"You want short supply chains with careful, robust people,\" says Bowman. \"Look for specific information, not necessarily canned information, about what you’re getting each week. What is this fish, where is it from, how was it caught, who processed it? Almost without fail, the people who are knowledgeable about their products can talk your leg off.\"Explore Bon AppétitHealthyishSustainableSeafoodTrendsRead MorecookingThis Is the Only Way I’ll Make Swordfish, the Steakiest Fish in the SeaBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Aliza Abarbanel"]}