{"id": "230893bac70c00c54c328a707c5658c9", "url": "https://www.bonappetit.com/recipe/saucy-grilled-summer-squash-with-chickpeas", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Saucy Grilled Summer Squash With Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueSaucy Grilled Summer Squash With ChickpeasBy Rachel GurjarJuly 6, 20215.0(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintOne of the most annoying things about cooking outside is that...your kitchen is inside. Gamechanger? Bring your skillet out to the grill, place it on top of a hot zone, and you can grill and saute your veggies side by side. Well-seasoned or enameled cast iron will hold up to the fire and retain heat at high temperatures, making it the perfect place for blistering spiced tomatoes without losing any of their flavorful juices. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonCast Iron Skillet$30 At AmazonHeat Resistant Leather Gloves$22 At AmazonStainless Steel Skewers$6 At Amazon16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonIngredients1lb. summer squash, cut into 2\" pieces1Tbsp. plus ¼ cup extra-virgin olive oil; plus more for drizzlingFreshly ground black pepper1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided, plus more8oz. mixed mini sweet peppers, stems trimmed, halved4garlic cloves, thinly sliced1tsp. cumin seeds1½lb. cherry or Sun Gold tomatoes (about 4½ cups)1Tbsp. paprika2tsp. ground coriander½tsp. ground turmeric115-oz. can chickpeas, rinsedCilantro leaves with tender stems and steamed white rice (for serving)special equipmentFive 12\" metal skewers or bamboo skewers, soaked 30 minutesPreparationStep 1Place squash in a large bowl. Drizzle 1 Tbsp. oil over and season with black pepper and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt. Toss to coat; set aside. Thread sweet peppers onto skewers.Step 2Prepare a grill for 2-zone heat (for a charcoal grill, bank most of the coals on one side; for a gas grill, set one burner to medium-high and one or two burners to low). Place a medium cast-iron skillet on grate over medium-high heat. Pour in ¼ cup oil and heat. Arrange squash and skewers with peppers on grate over medium-low and grill, turning occasionally, until slightly charred around the edges, about 6 minutes.Step 3Meanwhile, cook garlic in skillet, stirring, until fragrant, about 10 seconds. Add cumin and cook, stirring, until fragrant, about 30 seconds. Mix in tomatoes, paprika, coriander, turmeric, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Then cover grill and cook until tomatoes blister and spices are fragrant, about 6 minutes.Step 4Uncover grill and transfer peppers and squash to a platter. Smash tomatoes in skillet with tongs to release juices; the consistency should be saucy. Cover grill again and cook tomatoes until reduced by one fourth, about 6 minutes.Step 5Uncover grill and stir tomatoes. Add squash, peppers, and chickpeas to skillet skillet and mix well. Add ¼ cup water, stir to combine, and cook until sauce starts to bubble and squash is tender, about 4 minutes.Step 6Remove skillet from grill and top squash mixture with cilantro. Serve with rice.How would you rate Saucy Grilled Summer Squash With Chickpeas?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSO GOOD. I've made this twice now and love it both times. I added cauliflower as one of the veggies to get some crunch and it made it even better. Also cooked up a little more tomatoes so it's more saucey. Overall, a super easy and tasty dish.JeffLos Angeles12/12/2021Made this easy flavorful recipe on the stove and oven and it was delicious!!! Super quick and super saucy. Love the coriander in it.Brin23Cambridge, MA8/11/2021Explore Bon AppétitSummer SquashSquashVegetableChickpeaBeanCherry TomatoTomatoSummerMainSideDairy-FreeGluten-FreeNut-FreeVeganVegetarianGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}