{"id": "231afec97e641ff3959cb701d78f4030", "url": "https://www.bonappetit.com/story/drinking-in-dhaka", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "A Story of a Young Romance, a Bowl of Bar Peanuts, and a Plastic Bottle of Whiskey | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Story of a Young Romance, a Bowl of Bar Peanuts, and a Plastic Bottle of WhiskeyAuthor Rumaan Alam remembers a trip to Dhaka, where it isn’t easy to find a drink, unless you come prepared.By Rumaan AlamMay 2, 2018FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailEarly in a relationship, a weekend away can be fatal. So it seems like lunacy that a month after I met David, we planned a trip together to Argentina. From there, travel became a big part of our romance; there’s no better way to get to know someone than to see them far from the comforts of home.I got to know that David was curious, as he pored over guidebooks to find some alluring oddity to visit. (He dragged us to an out-of-the-way village in India known for its exuberantly frescoed homes, one of the most beautiful places I’ve ever been.) I got to know that he was tireless, eager to walk all over Prague, rain be damned. I got to know that he was outgoing, interested in talking to anyone, and also that he speaks French better than he lets on (a cliché, but it just sounds romantic). And I got to know that he is always, always prepared.For an overnight flight, David had sleeping pills. To counteract prolonged exposure to unfamiliar cuisine, he had peanut butter. For destinations where the only coffee available was instant, he had a plastic French press and a pound of the good stuff. Who wouldn’t fall in love?Some years after that first vacation in Argentina, we planned a trip to Bangladesh, the country of my parents’ birth but a place about which I, assimilated American kid that I was, knew almost nothing. David, ever prepared, stopped at the duty-free during our layover for a bottle of whiskey. The stuff is hard to come by in that devoutly Muslim country, and there’s something so right about a drink after a long day in a new place. Upon arriving, David decanted the booze into an empty plastic water bottle, and that vessel accompanied us everywhere we went.Outside Dhaka we visited a tea plantation, an astonishingly quiet place, verdant even in the dry winter season. We walked through the fields and the adjacent village where the agricultural laborers lived, then retreated to the main house for a secret nip from the plastic bottle and a very late dinner.David’s a photographer; I’m a writer. Thus, everywhere we went, he took pictures and I took notes, so it was a pleasure trip that also involved some work. We spent some time in the city of Chittagong on the Bay of Bengal, where the local trade is shipbreaking instead of sunbathing. We called in favors to be shown the corpses of decommissioned ocean vessels, a surreal blight on the environment usually kept hidden from tourists like us, but a remarkable thing we were very eager to see. That night we went back to our grim business hotel quite in need of a drink.We spent three nights on a little boat puttering through the Bay of Bengal’s mangrove forest, a habitat for the planet’s few remaining wild tigers. It was there that we rang in the New Year, standing in our little cabin that was so tiny there was nowhere to sit beside the two narrow bunks. We drained the bottle that night.Thereafter, our itinerary carried us back to the capital city of Dhaka, where we would see my favorite relatives, my aunt and uncle. They were a hilarious and cosmopolitan couple, easygoing people who were also superb hosts. When they understood that David and I were hoping to have a drink, they decided to take us to their club.That club is a colonial-era work-around to circumvent the society’s conservatism and is even now one of a handful of places in that huge city where one can order alcohol. It looked a bit like an unremarkable hotel or a building at a small out-of-the-way college, but it had an air of British-inflected pomp to it. My uncle told me I had to tuck in my shirt before going in, and the waitstaff spoke that hand-me-down formal English you hear in the former colonies. Our drinks were served with a little silver bowl containing a mound of peanuts tossed with minced onion, lime juice, and cilantro. Like every great bar snack, it made us want to snack more, drink more, talk more, laugh more, all of which we did.David and I have been married for almost a decade now, and the way we travel these days is quite different. I’ve not left the country in eight years, which is, not coincidentally, precisely how old our first son is. These days, when I get on a plane, I rely on David, ever prepared, to remember to pick up a Road & Track to occupy the big kid and some bubble gum so the little one can pop his ears.Our family trips are wonderful. But I don’t mind remembering when we traveled a bit lighter. Though I’m not nearly skilled enough a cook to recreate the delicious, complex food we ate on our trip to Bangladesh, I can manage that simple bar snack and find myself transported, both across the world and back in time.Get the recipe for Peanut Drinking Snack:Peanut Drinking SnackThis spicy, sour, salty, crunchy mix isn’t your typical roasted bar nuts recipe.View RecipeAnd listen to Alam read his essay on the Bon Appétit Foodcast:ContentThis content can also be viewed on the site it originates from.Rumaan Alam is the author of the novels That Kind of Mother, out this month, and Rich and Pretty.Explore Bon AppétitTravelPeanutRead MorecultureOur Highly Subjective But Very Smart Guide to TravelingGallery21 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Rumaan Alam"]}