{"id": "231c68baa46e4dbb30f0b94486053165", "url": "https://www.bonappetit.com/story/bottom-of-the-pot-naz-deravian", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "A New Persian Cookbook from Naz Deravian Recovers Memories from Iran | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe New Persian Cookbook That Recovers Memories from IranNaz Deravian’s beautiful and wistful cookbook, Bottom of the Pot, is out now.By Mayukh SenSeptember 18, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailNo matter how many times she’s tried, Naz Deravian can’t remember the last meal she ate in Tehran. It was 1980 when her family fled the city in the thick of the Iranian Revolution and the hostage crisis. She was eight years old.Deravian only recalls what she ate when the family landed in Vancouver: a McDonald’s quarter-pounder with cheese and a side of french fries. The meal was heavenly, but it was a far cry from a bowl of restorative aash, a Persian soup bursting with legumes and green herbs.“You don’t commit to memory the lasts when you don’t know it’s going to be your last,” Deravian told me. “The last meals and the last hugs go undocumented. And you spend the next 35 years of your life trying to conjure them up in a simple pot of stew.”Deravian, now 46 and living in Inglewood, California, has kept an award-winning Persian food blog, Bottom of the Pot, since 2013; she makes a living writing about food and occasional screen acting. This month, her first cookbook, Bottom of the Pot: Persian Recipes and Stories, is out from Flatiron Books. Deravian writes with a sure hand, treating chapter and recipe introductions as forms of memoir; like her writing, the book’s photographs are lush, almost wistful. The nearly 100 recipes within are a nod to her heritage: khoresh fesenjan, a sour pomegranate walnut stew; morgh ba zafaran, chicken cooked in saffron water; pistachio sanbuseh, airy turnovers padded with ground pistachios and perfumed with cardamom and rosewater.Photo by Chelsie CraigDeravian wrote the book with two audiences in mind: those unfamiliar with but curious about Persian food and a younger generation of Iranians who, like her, may live abroad but crave the food they grew up eating. Every recipe is a self-contained story, headnotes sometimes lasting paragraphs as Deravian zigzags through time periods and memories, demonstrating how displacement fosters its own kind of culinary education.Though she dabbled in the kitchen as a child, she began cooking for herself when she moved to Los Angeles to pursue acting in 1996. She called her mother up in a fit of desperation, gripping a notebook and pencil and asking her to dictate her recipe for crispy Persian rice, or tahdig. Cooking came naturally to her from there. “The kitchen became a place where I could escape, relax, and reconnect with myself,” she writes.Photo by Chelsie CraigShe began blogging nearly two decades later after she’d host non-Iranian friends for dinner who confessed they were too timid to try cooking Persian food themselves. “This notion of the inaccessibility of Persian food for the average American home cook always saddens me,” Deravian said. “At its heart, Persian food is meant to be shared with family and friends.”She noticed that the blog posts that generated the greatest number of kind comments and letters from readers were ones with deeply personal anecdotes attached to them. These were recipes like aash-e reshteh—a soup of beans, herbs, and noodles to be eaten before the Persian New Year—which she used as a vehicle to tell to the story of teaching her young daughter, Luna, the meaning of the word azadi, Farsi for “freedom.” Another recipe for aash-e anar, a tart pomegranate soup, told Luna the story of Shab-e Yalda, the winter solstice celebration in which families gather to eat and read poetry late into the night on the longest night of the year. She was using recipes as a medium to explain her own heritage. In Bottom of the Pot, she synthesizes them to tell her whole story.Photo by Chelsie CraigAs she wrote and cooked her way through the book, Deravian’s parents fell ill.“It became even more imperative for me to get these stories down,” she said. “To listen, to ask questions, to be present.” Time took on a new meaning for her in this period, and she extracted recipes and stories from them both. Her father, who died in May, told her the stories of dishes like aash-e dogha, a soup of full-fat sour yogurt with beef meatballs. He explained that their family’s recipe had originated with her paternal grandfather, who picked it up when he was a rice merchant in Baku, Azerbaijan, and brought it back to Iran’s Gilan Province. The recipe traveled through generations—and, eventually, continents.Deravian wrote the book during a time of political chaos too. “This was, and still is, an anxiety-ridden time,” she told me. “Here I was writing about my childhood memories of a revolution and immigration, while very similar scenarios were playing out in real time around me.”There was a lot of noise, she told me, people shouting opinions and making declarations about the value of Iranian immigrant lives like her own. The best she could do was drown out the noise, hunker down, test her recipes, and keep writing.Buy it: Bottom of the Pot: Persian Recipes and Stories is $24 on AmazonMayukh Sen is a James Beard Award-winning food and culture writer based in New York.Explore Bon AppétitPersianCookbooksRead MorecookingThis Saffron Rice Recipe Is My Fullest Expression of Iranian FoodBy Andy BaraghanicultureHow I Honor My Family’s History with a Persian New Year FeastBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Mayukh Sen"]}