{"id": "231e0777522dd7d1dcca5c67aaefd4c6", "url": "https://www.bonappetit.com/story/chocolate-chip-pancakes-feud", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Here’s Something to Do With All That Rhubarb | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHere’s Something to Do With All That RhubarbMake a daiquiri or three!By Alex BeggsJune 1, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Pink thingsWhat’s pink and sweet and definitely not poisonous? A rhubarb daiquiri! I got excited and bought two bunches of rhubarb recently, using one bunch to make rhubarb compote that turned out a little...stringier than I wanted. So for the second bunch, last night I made hot pink rhubarb simple syrup (doubling this recipe), and plan to make rhubarb daiquiris with it this weekend. Is it still a daiquiri if I use tequila instead of rum? Don’t know, don’t care. Semantics! It’s a refreshing, sweet-sour drink and you’re gonna love it.Get the recipe: Rhubarb daiquiriWant this letter before it hits the website? Sign up for our newsletter!It might be okayThis month’s “is it ever okay” is about summer entertaining. Can you take over the grill if someone is overcooking the burgers? Can you shoo away men trying to take over the grill because the burgers are in fact, perfect? All this and more, right this way. And now I’m looking for your questions about fine dining etiquette. Can I demand a little stool for my purse because I think it’s funny? Is tipping the coat check mandatory if dinner cost the same as a monthly car payment? Send your questions to me at staff.bonappetit@gmail.comRead it: Is It Ever Okay...To Take Over the Grilling Yourself?Photo by Haarala HamiltonBreakfast soupOver a cold brew* spiked with cinnamon and brain dust**, I asked Breakfast author Emily Elyse Miller what more people should be eating for breakfast. “Soup!” She said. Specifically, Hawaiian noodle soup with a dried shrimp and shiitake broth, spam, eggs, fish cakes, and saimin noodles (pictured above). It’s rich and umami-ful, and nostalgic for the writer, who grew up in Hawaii. Miller, who was wearing a pearl-and-metal-spike necklace (very Sansa Stark goth mode), told me she feels amazing after having soup for breakfast, yes, especially in the summer. Regulate that body temp to acclimate to the heat outside! Her cookbook has 380 breakfast recipes from 80 countries and if you need to expand your breakfast horizons (I see you, boiled egg Bryan), I can’t think of a better way.*At an event sponsored by CHAMELEON COLD BREW, HEL-LOOOO**Not sure if the brain dust works, but I’ll take all the help I can getBrad went to CannesLol! Brad Leone went to Cannes Film Festival to judge a short film competition on the theme “we are what we eat,” sponsored by NESPRESSO. He told me his favorite movies were the one about rice terraces in Bali (it’s called Subak, and you can watch it, albeit on a narrow frame, here), and Mother Seed, about Rahibai Soma Popere, an advocate for farming with indigenous seeds in India (it’s actually titled Seed Mother). Then he recreated the moment when he was trying to Instagram a seagull eating a pigeon, tripped, and dropped his phone down some rocks, filming all the while. Will be submitting that one to the jury next year.Potato salad! I’ve made the potato-and-egg-and-bacon potato salad from B’s Cracklin' twice already and it’s not even June yet. It’s perfect. There are BLACK OLIVES in it, what else do you need to know?MAKE IT: Potato Salad with Bacon and EggsMysteryWhy were two issues of Bon Appétit banned in Kansas prisons, as reported by the nonprofit Books to Prisoners? I’d like to know! We don’t even do nudity!Bucket newsMy Maldon bucket kicked the bucket this week. That thing lasted TWO YEARS and I used it pretty much daily. That’s a good deal! 3.3 pounds of tiny salt windows into my soul! Read about how obsessed with it we are here. Then get one yourself ($30) and report back on how long yours lasted. I’m vaguely curious.Unnecessary food meme of the weekUnnecessary food feud of the weekLaura MurrayCarla Lalli Music was developing a blueberry pancake recipe this week and that’s when we found out she LOATHES chocolate chip pancakes, which happen to be a perfect food. “Chocolate chip pancakes are disgusting,” she said while tearing apart a concha on our snack table. “I like to pretend pancakes are a breakfast food, not dessert. The chocolate chips make it dessert.” The room erupted. Christina Chaey, nursing a 16-ounce Diet Dr Pepper, analyzed what makes a CCP great: “If you’re going to put something in a pancake, what better than chocolate chips? Bananas? Stupid. Blueberries? Little pimples. Chocolate chips sink into batter just enough so they’re on top when you flip them, then cook long enough so that the bottom of chip gets a tiny crust. You get molten chip, crispy edge—it’s the f*cking best.” Jesse Sparks looked into my eyes and whispered behind his hand, “People use too many chocolate chips—they ruin the consistency.” “No syrup,” dared Emma Wartzman, “just lots of butter.” “No, you need the syrup to play off the bitter chocolate,” Chaey continued. In the Test Kitchen, Gaby Melian scrunched up her face and said, “I don’t like to find things in my pancakes.” “I’m not 12 anymore!” Cristina Martinez told me as elevator doors shut in my face. “I prefer buckwheat,” said Chelsie Craig, before slinking off to the photo studio in a quilted capelet/shawl combo I’ve never seen before. Hilary Cadigan offered her two-cents: “I like blueberry and chocolate together!” We let out a collective ughhhhhhh! Chaey shook her head in horror: “And don’t let anyone tell you to cook them with chocolate chunks. It doesn’t work.”Explore Bon AppétitBeggs NewsletterRhubarbRead MorecookingYour Most Pressing Rhubarb Questions, AnsweredBy Sarah JampelcookingChris Morocco Just Made the Best Chocolate Chip Cookie EverBy Alex BeggscultureJoy, Pain, and Puke at the 2019 Hot Sauce ExpoBy Alex BeggsPhotography by Amy LombardcultureMake These Chicken Thighs This WeekendBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-01", "author": ["Condé Nast", "Alex Beggs"]}