{"id": "23300e34f985c62d723affecafd2a5b7", "url": "https://www.bonappetit.com/story/hilton-dresden", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Hilton Dresden Eats Tuna Melts in Bed and Sketches to Fall Asleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHilton Dresden Eats Tuna Melts in Bed and Sketches to Fall AsleepHow the New York artist and performer calls it a night.By Martine ThompsonNovember 13, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Hilton Dresden knows a thing or two about building their own path. The artist expresses a fluid gender identity that they feel no urgency to categorize, one that thrives in ambiguity. And their signature nimbus of curls, deadpan humor, and wonky illustrations of “people and animals with weird faces and weird outfits” have moved front and center in the last few years. Two summers ago, Dresden created and starred in the comedy web series “5 Things with Hilton Dresden,” produced by Out Magazine. More recently, they designed the illustrations for Nicopanda’s spring ’19 capsule tee collection and hosted a number of enjoyably offbeat red carpet interviews for Out (their Call Me By Your Name red carpet coverage is chef’s kiss a delight).When it comes time to reboot and recharge, Dresden looks to their friends and being present in the moment. “I’m a pretty extroverted person so hanging out with friends, having a drink, commiserating, and talking it out with people is probably the most healing thing for me. I’m always in my head thinking about why I shouldn’t be happy or don’t deserve to feel good, and I know so many people struggle with that as well. I’m here today to say, ‘Fuck that. I’m going to have fun.’”Dresden soaking up the sun.\nPhoto by Emma FishmanShortly after we talked, the Trump administration had just announced a proposal to define “transgender” out of existence. Dresden called the move an “attack on the trans and gender non-conforming communities” that must be fought against. In times like these, a solid night of rest can be both more imperative and harder to come by. We caught up with Dresden to see how they’re handling the stressful days and restless nights.All good nights start with Sex and the CityI don’t have a plan for each night or a certain skin mask I’ll do, but when I get home, I like to watch some Sex and the City in bed while eating chips and salsa. I’m a Carrie. I know a lot of people think they’re a Carrie, but I’m actually a Carrie. If you just look at the facts, you’ll see. I have the hair and the insanity and the sort of lack of self-awareness. And I’m a writer, and I dress crazy. There are definite Miranda undertones too.An essential bed trayI have this tray I bought at Ikea that lets me eat my meals in bed without as many crumbs and spills. I was certainly eating most meals in bed before, but now, with the tray, my hygiene has marginally improved.Curly hair maintenance planMy hair is a very wild creature, so I probably get it wet like twice a week, or once a week even, because it’s so curly and I don’t want to over do it on the curls. I recently got this new conditioner from DevaCurl after visiting their salon in New York. It’s a silicone and sulfate-free conditioner, and it was way too expensive, and I won’t be buying it again after I use up the bottle, but it’s been working great. I’ll sometimes do a mask and wrap my hair in a grocery bag. After I shower I scrounge in a lot of leave-in conditioner and sometimes coconut oil and different oils to help it stay hydrated. Aside from that, I just let it do its thing for the rest of the week. I really don’t know what I’m doing in any aspect of my life, especially haircare.Beer, wine, or a tuna melt?I love alcohol. I love to indulge in some beer or wine before bed if I have it. As I mentioned, I love chips and dip, so if I have that around I’ll definitely pull it out. But I don’t usually have that many groceries in my house because I don’t make it to the grocery store as much as I should. Sometimes I have to go out to the deli and get a tuna melt.A small bit of election joyI’m grateful that Democrats have taken back the House, and that Wisconsin (my home state) voted out the scum that is Scott Walker. We still have a lot of work to do, but I’m hopeful that things can get better, because they’re so bad right now. I’m also grateful to be working on a new web show, “Hilton Dresden Wants A Show,” with my best friend and collaborator Talia Heller. Look out for it on cakeboymag.com!Will doodle for sleepThroughout my life I’ve dealt with insomnia and had a hard time falling asleep. I’ve always found that drawing and doodling in bed while watching TV is the best way for me to calm down. Reading is also really helpful. TV does not really help a person fall asleep. I’m sure the screen is bad for that or something. I’d like to stop rewatching The Office until 2:30 a.m. every night. I think that might help me get off to a better start in the mornings. I just read If Beale Street Could Talk by James Baldwin and that was really good. And I read Big Little Lies kind of recently, after I saw the show. The show was my favorite thing ever. The book is very, very good too.Explore Bon AppétitHealthyishGoing to Bed withSelf CareInterviewsRead MoreLifestyleLeslie Diuguid Ends the Night With Surprise Ice Cream and a Good StretchBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Martine Thompson"]}