{"id": "233cd66134ac4629cdc7bf2f86593de7", "url": "https://www.bonappetit.com/story/creamy-frozen-desserts-booze", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "The Secret to Creamy Frozen Desserts? Booze! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to Creamy Frozen Desserts? Booze!No ice cream maker? No problem. A splash of the hard stuff goes a long way.By Christina ChaeyJuly 26, 2018FacebookTwitterEmailFacebookTwitterEmailBetween this ridiculous Frozen Margarita Pie and this Peach Lassi Sorbet with Crushed Blackberries, it appears I have granted senior food editor Andy Baraghani total control over all my frozen dessert-related plans for the rest of the summer.These two genius, simpler-than-simple recipes share three things in common. They each have fewer than 10 ingredients. They don't require an ice cream maker. And they both call for a healthy splash of BOOZE, which makes all the difference in the world when you want to make something creamy and cold but don't want to put in...basically any effort (me, always). More on the booze in a second, but first: a bit of frozen-treats science.There are lots of factors that can affect the texture of a frozen dessert, whether that's ice cream, gelato, sorbet, or granita. How much sugar, fat, and/or booze you use, what kind of ice cream maker you have (or don't have!), and the temperature of your freezer are just a few of them. Of these, adding a bit of booze to your recipe of choice is the simplest path to a softer scoop of sorbet or slice of frozen pie.If you've ever stashed a bottle of gin in the freezer at the ready for martini-making, you know that liquor never actually freezes. That's because home freezers don't get cold enough to freeze anything more alcoholic than beer or wine, which are mostly water. Adding a bit of hard alcohol like vodka, tequila, or whiskey—all of which run around forty percent alcohol—to a frozen dessert helps prevent big ice crystals from forming in the mixture, resulting in a softer texture.You can freeze the water around it, but you can't freeze vodka. (At least not at home anyways.)\nPhoto by Alex LauSome ice cream and sorbet recipes will call for specific alcohols because they add their own unique flavor, such as minty crème de menthe or rich and nutty hazelnut liqueur—our frozen margarita pie just wouldn't be the same without a good shot of tequila. But even if you're not into \"booze-flavored desserts,\" this little trick still comes in handy. In that peach lassi sorbet, for example, you can't even taste the vodka, which is your best bet if you want a neutral-flavored liquor that won't affect the flavor. Just don't add more than two or three tablespoons of hard booze—too much alcohol will prevent your mixture from freezing at all and you'll be left with a sad, cold, runny cream or fruit soup instead of the luscious frozen desserts you and your best summer self deserve.See for yourself:Frozen Margarita PieYour favorite cocktail in pie form—what's not to love?View RecipePeach Sorbet with Crushed BlackberriesTurn juicy-sweet peaches into creamy sorbet, no ice cream maker required. View RecipeExplore Bon AppétitFrozen DessertIce CreamAlcohol & Other DrinksRead MorecookingThis Frozen Margarita Pie Is Full of Tequila and Just As Incredible As It SoundsBy Jesse SparksPeach Sorbet with Crushed BlackberriesCinnamon Swirl Vanilla Ice Cream BarsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-26", "author": ["Condé Nast", "Christina Chaey"]}