{"id": "234efa815056492bd0522fb804ed7db6", "url": "https://www.bonappetit.com/story/travel-eating-etiquette", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Is It Ever Okay...To Eat Tuna Salad on a Plane? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Eat Tuna Salad on a Plane?Our truly refined etiquette columnist is jet-lagged and ready to answer all of your travel questions.By Alex BeggsMay 15, 2019FacebookTwitterEmailPhoto Courtesy of Hulton ArchiveFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.Is it ever okay to eat tuna salad, Buffalo Wild Wings, or otherwise smelly food on a plane? —Malodorous MalloryYES. It might (it will) enrage people nearby for the three minutes you smash on room temp Chicken of the Sea, but the way air circulates on airplanes means it’ll dissipate eventually. (This is good news for other...situations...too. ) Air on planes is in constant circulation and it gets filtered. Otherwise we’d literally die!!! There are too many definitions of objectionable smells, which is why I’m encouraging this selfish behavior. Obviously you could just not, but that’s freedom for ya.So what are the best foods to pack on a flight? —M.M.In the random order they popped into my head, not complete:-Cheez-Its-Grain bowls-Beefeater minis from DutyFree-Steamed sweet potato with stuff on it-Kind bars-PB&J-Do people still eat trail mix?-Muffuletta from Central Grocery in New Orleans-An entire cookie cake; share with the whole planeIf you get traveler’s stomach and are out in public, far from your hotel, what's the pro move? What if you're at a restaurant with just a single WC? —Poopy PamNice diarrhea euphemism!! I consulted with Dr. Jerry and he doesn’t care how many social anxieties you have, USE THE NEAREST BATHROOM. Don’t worry about society, they’ll be fine. Power move: Make intense eye contact with anyone waiting for the loo on your way out, pat the sweat on your brow, and exclaim, “Woof!”Can you imagine if an Airbnb fridge was this stocked. The possibilities!!!\nAlex LauCan I use the soy sauce in my Airbnb fridge? —Salty SusanFor what, your coffee? Massage oil? Get freaky, you’re on vacation, Susan!Should you ever drink the water from a pitcher on a plane? —Jittery JeanWhat pitcher? All I see are FREE CANS OF DIET GINGER ALE.How do I navigate my aversion to seafood across different regions and cultures? —Come on, KatieThe same annoying way you do at home! By making it “a whole thing” before always ordering chicken.Should you tip in countries where it’s not expected? —Stingy SharonAmericans need all the help we can get with our international reputation. Tip! Maybe the dollar will be strong again and it’ll actually mean something.SNACK BREAKAre you marinating enough cheese? I know I’m not!Marinated ManchegoThe only thing more crowd-pleasing than cheese is marinated cheese.View RecipeIs it rude to ask for an English menu at a restaurant right away? —Eager ElyseWhat’s rude is that you didn’t bother to learn an entire language before you came on vacation. Try harder! And don’t waste everyone’s time while you pretend you can even point out the mains from dessert. You can’t.How early is it appropriate to start drinking on vacation? 10 a.m.? —Alchy AlphonzoDepends on whether it’s a fun vacation or just-got-divorced vacation. Oh wait, it turns out both are 10 a.m.Wearing a neck pillow around the airport: Cool or not cool? —Cool CourtneySo cool that all of these people should have their own airport and all of the planes take them TO HELL.Don’t haggle in Oklahoma City farmers’ markets either!\nAlex LauIs it ever okay to haggle at a foreign farmer’s market? —Cheap ChesterDo you haggle at your local market with the heirloom grapes? Have you ever actually farmed before? Pay double! The world is a fragile place. Haggle over something that really matters, like your rent.How do you deal with someone you’re traveling with who doesn’t eat as often as you? —Hungry HippocratesThis is why I don’t travel with friends. Too much compromise. Too many petty slights that I’ll talk about for months to years after. First you need to test the friendship with a weekend away somewhere close to home. Do they refuse to stop the car for roadside peaches? Do they understand the beauty of a lunch beer? Do they sleep in too late and miss “the sights”? Make future plans accordingly by traveling with your sibling, soulmate, or support animals ONLY.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexExplore Bon AppétitIs It Ever OkayTravelEtiquetteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Alex Beggs"]}