{"id": "2353af95c83cd12e4c687d9e3c788cee", "url": "https://www.bonappetit.com/story/rutabaga-feud", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Make Chicken Meatballs for the Soul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake Chicken Meatballs for the SoulI’m feelin’ good thanks to the Feel Good Food Plan. Or at least from these chicken meatballs.By Alex BeggsJanuary 11, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cook the way you want to FEELThat was the magazine headline for the new Healthyish Feel Good Food Plan. So if you want to feel like a roly-poly meatball—who doesn’t?—I have just the recipe for you. Chris Morocco’s chicken-and-rice meatballs with hummus (store-bought). I made them this week and they’re as delicious as they are easy. And flexible! Season with whatever random spice mix you got for Christmas, which in my case was this Penzey’s gingery curry powder. Yum!Get the recipe: Chicken and Rice Meatballs With HummusWant this letter before it hits the website? Sign up for our newsletter!Photo by FPG/Hulton Archive/Getty ImagesSpit spreads death“Daaaad, I want to see SPIT DEATH!” a little girl whined in a room full of old bones. I was at my favorite museum in the world, the Mütter Museum in Philadelphia. There’s a wall of human skulls with little captions about how each person croaked; wax sculptures of what happens if your syphilis goes untreated; plaster molds of conjoined twins. Lots of babies with tails in jars and other very real things. I thought it would be a great idea to eat a huge breakfast at the wonderful K’Far before I went—get a Jerusalem bagel, one of each boreka, and a Yemenite latte, made with milk infused with ginger, cinnamon, and cardamom. I was able to hold it together. Plus, the flu exhibit was indeed all it was cracked up to be, complete with sneezing coughing sound effects. I’ve been washing my hands like a surgeon ever since.Go there: The Mütter MuseumMore Philly recs I got from Alex Delany that I loved: John’s Roast Pork (duh!), Johnny Brenda’s bar (beer!), Pizzeria Beddia (the white pie!), Khyber Pass Pub (beer!), Hungry Pigeon (the cocktails! The chicken!), and Primal Supply Meats (pork chops!).!!!!!Digital director Carey Polis was actually watching Jeopardy! when this clue popped onscreen. A thrill of a lifetime!How could you not?Cook, marry, killllllllllllllPhoto by Laura MurrayOn the BA podcast this week I gushed over my Highly Recommend for the Joan (pictured above). It’s a glass of wine at The Riddler, a delightful champagne bar, filled to the rim. What else do you need to know? Related, I ranted about the stupid, confusing proposed wine tariff that could result in a 100 PERCENT tax on imported European wines (and other stuff—tinned fish! Cheese! Olive oil!). If you ever buy wine, you should care. You don’t want a $20 bottle suddenly $40, do ya? The New York Times said there could be “disastrous ripple effects” as a result. The only ripple effects I want to see are the ones in my wine glass, filled to the top.Read more:Go to The Riddler. Get Your Wine Glass Filled to the Brim.The Insanity of Trump’s Wine TariffsIn other newsThere’s a new Girl Scout cookie this year. Lemon-Ups are lemon tea cookies with positive affirmations stamped on them, like I AM A LEADER. As someone who prefers more of a supporting role in life, I’d be fine with tepid affirmations like, THAT SEEMS FINE. Or IT WASN’T YOUR FAULT. But maybe that’s why they didn’t hire me to write them. There’s always next year—hey, that’d be a good one!Do you thinkThe Kardashian-West house staff prepared their pantry and walk-in fridge for Kim’s seemingly impromptu kitchen tour on Instagram this week? She wanted to prove wrong any “refrigerator shamers” that worried there wasn’t any food in their house. Ah yes, what we needed: proof two celebrities are absurdly rich, multiple fridges and pantries overfloweth with fresh produce and snacks. Glad we cleared that up. I love transparency. “Plant-based tacos are my favorite!” she captioned one pic. Honestly, same.Unnecessary food meme of the weekUnnecessary food feud of the weekWhat was the rutabaga question all about, Chaey? “I was going to make a recipe with rutabaga in it. They’re impossible to tell apart from a turnip on the outside, but apparently they taste different,” she said. “...I’m not gonna make that recipe.” Carla Lalli Music elaborated on her reply: “Rutabaga is the least desirable root in the cold storage bin, IMHO.” “omg love a rutabag!” slacked Mol’ Baz, adding: “BIG ASS TURNIPS” “I like them!!!!” Sarah Jampel, who “roots for the underdog” said, with four exclamation points and no pun intended. They’re mild and sweet, not unlike a parsnip, she explained. In a segment about unloved root vegetables on the BA podcast this week, Brad Leone optimistically claims you can walk right by them in any grocery store, which I’d say is factually inaccurate. “Rutabaga thoughts?” I asked Andy Baraghani. “Don’t know her,” he replied.Look how good these look tho!Photo by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenGet the recipe for this PLANT-BASED TACO! Rutabaga Tacos with Greens and Queso FrescoExplore Bon AppétitBeggs NewsletterRead MoreLifestyleWhat You Need to Know About the 2020 Feel Good Food PlanBy Amanda ShapiroWhere to eatHow to Spend a Big Fat Weekend in Fishtown, PhiladelphiaGallery15 SlidesBy Alex DelanyrestaurantsGo to The Riddler. Get Your Wine Glass Filled to the Brim.By Alex BeggsRutabaga Tacos with Greens and Queso FrescoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-11", "author": ["Condé Nast", "Alex Beggs"]}