{"id": "236581bef514899915d27920216e5a1b", "url": "https://www.bonappetit.com/recipe/fideos-with-chicken-thighs-and-kale", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Fideos With Chicken Thighs and Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFideos With Chicken Thighs and KaleBy Sohla El-WayllyNovember 17, 20194.4(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWith a crispy top hiding a layer of jammy, tomato-y noodles, this one-skillet meal is anything but one-note. There's flavor at every stage. After you've rendered the fat from the chicken thighs, you'll use that schmaltz to sauté the fideos (that's Spanish for “noodles”). This technique not only gives the pieces of thin, broken pasta a nutty taste, but it also crisps them up so that they're able to withstand the heat of the oven and absorb the slow-cooked onion, garlic, and tomato paste mixture (a.k.a. your soffritto). The not-so-secret secret ingredient is the anchovies: You won't be able to pick them out of the crowd, but if you skip them, you'll miss the salt and umami. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonSpoon$24.69 At AmazonSmall Bowl$13 At AmazonPlate$55 At Bon Appétit MarketCast Iron Skillet$30 At AmazonBox Grater$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASpatula$12.99 At AmazonIngredients4–6 servings2½tsp. kosher salt, divided, plus more¼tsp. plus 1 Tbsp. hot smoked paprika, divided2lb. skin-on, bone-in chicken thighs (4–6)6Tbsp. extra-virgin olive oil, divided8oz. spaghetti (preferably thin spaghetti)2medium onions6garlic cloves4oil-packed anchovy fillets¼cup tomato paste1bunch Tuscan kale1lemon⅓cup Castelvetrano olivesPreparationStep 1Place a rack in top third of oven; preheat to 375°. Pat chicken dry. Combine 2 tsp. salt and ¼ tsp. hot smoked paprika in a small bowl. Sprinkle all over chicken thighs.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Pour ¼ cup extra-virgin olive oil into a large (12\") skillet. (Either stainless steel or cast iron will work here!) Arrange chicken skin side down in oil. Turn heat to medium and cook, undisturbed, until chicken has rendered some fat and skin is golden brown, 10–12 minutes. Remove from heat and return to plate skin side up, leaving all that schmaltzy fat in skillet.Step 3While chicken sears, break 8 oz. thin spaghetti into a bowl into ½\"–1\" pieces. Using your hands, scrunch broken pasta in bowl to further break it up. Peel and grate 2 onions on the large holes of a box grater. Peel and grate 6 garlic cloves on the small holes of grater. Run your knife through grated onion and garlic a couple of times to make sure no big pieces remain.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Add broken pasta to skillet and toss to coat in fat; season with ½ tsp. salt. Cook over medium heat, tossing constantly, until golden brown, 2–3 minutes. Cut the heat, tilt skillet away from you so the fat pools at one end, then use a slotted spoon to scoop out toasted pasta and transfer back to bowl, leaving as much fat in pan as possible.Step 5Return skillet to medium-low heat, add onion, garlic, 4 oil-packed anchovy fillets, ¼ cup tomato paste, and 1 Tbsp. extra-virgin olive oil to skillet and cook, breaking up anchovies and stirring often, until completely softened, jammy, dark red, and fat has broken out of the mixture, 13–15 minutes. Reduce heat if the veg are browning too quickly and be sure to take your time—the soffrito is what provides the fideos with depth and richness.Step 6Meanwhile, strip leaves off stems from 1 bunch Tuscan kale; discard stems. Rinse kale (no need to dry). Coarsely tear leaves. Crush ⅓ cup Castelvetrano olives, pry out their pits, and tear in half. Cut 1 lemon in half and set aside.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Add remaining 1 Tbsp. hot smoked paprika and cook, stirring frequently, until aromatic, about 30 seconds. Squeeze in juice of ½ lemon, scraping up any darkened bits on bottom of pan. Add 2 cups water, increase heat to medium-high, and bring to a simmer. Add kale and cook, tossing occasionally, until wilted, about 2 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Stir in olives and toasted pasta, along with any fat still clinging to bowl. Stir to combine, season with salt, and spread in an even layer. Arrange chicken on top (skin side up), pressing gently to tuck into pasta while leaving skin exposed. (Night, night chickadee!) If needed, add just enough water to barely reach top of pasta, leaving the tops sticking out. Drizzle remaining 1 Tbsp. extra-virgin olive oil over pasta and chicken.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Transfer skillet to oven and bake until chicken is cooked through, pasta has absorbed the cooking liquid, and top and edges have developed some crunchy bits, about 25 minutes. (You’ll see some fat sizzling on top of the skillet, that’s perfect.)Step 10Let rest 15 minutes. Divide chicken and fideos among plates. Cut remaining lemon into wedges and serve alongside.How would you rate Fideos With Chicken Thighs and Kale?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis is such an exceptional dish. It's a fun dinner to make if you want to relax into cooking- lot of chopping and grating and breaking but in a thouroughly enjoyable was, although I will say that grating to onions to pulp is nobody's idea of a good time. I use 12 oz of pasta instead of 8 and adjust the water accordingly, and with 4 thighs it makes healthy portions for two for two nights. I think the extra pasta and water help balance the oil-factor. I will probs be making this periodically for the rest of my life.JessaminRaleigh, NC1/30/2021Srsly? What is ‘basic’ about this recipe? Half way through, you start to wonder if you’ll ever get to eat. This long slog leaves a massive oil slick and tsumami of onion juice in its wake. And the pointless, intrusive text+video interface is useful to nobody except maybe first-time cooks whose experience stops at the microwave and who require video instruction to know how to stir. Cancel. Anonymous11/9/2020Loved this recipe. was definitely working with what i got, so skinless chicken and no anchovies, but a great weeknight dinner!leatubesLOS ANGELES5/27/2020I followed the recipe exactly without the anchovies or olives and it was still outstanding - will make again.  The only modification I had was that I caramelized the tomatoes and onions for much longer, maybe 30-40 minutes.  I loved the crispy fideo tops and soft stew-y bottom.  Very rich and bold in flavor!Anonymous070214/4/2020So yummy and verrrry flavorful so if you dont like a lot of flavor (smokey, galicky, salty, oily) dont make this. My bf did not like it. The chicken is cooked amazingly though and I will use this cooking style for future recipes. I substituted the pasta with gluten free noodles made from corn and worked great. They were more sticky but I enjoyed that texture even though some may not. AnonymousNew York, NY4/2/2020I really liked this recipe BUT I wish I would have used regular paprika. I do not like smokey flavors typically and the smokiness of the paprika totally ruined the dish for me. Otherwise, it was excellent. I will definitely make again, but use normal paprika. If you are sensitive to smokiness, use regular paprika. AnonymousWashington, D.C.1/26/2020Love, love, love this recipe... Have twice made this unique, smoky, comforting dish that elevates chicken thighs to a new planet.  Killer!  Followed the recipe without addition or subtraction.  Had a long haul flight overseas in between the first and second attempt and couldn’t get it out of my mind.  Garlic + anchovies + tomato + paprika + schmaltz creates an awesome flavorful, layered punch, enhanced with the kale and the texture of the crunchy crust of the pasta edge and the crispy chicken skin.  Mind blown.  Thank you... Matt in PortlandPortland, Oregon12/17/2019The flavors in this were SO good! I've never made anything like this before and I had no clue what to expect but it blew my mind. Next time though I will 100% use a food processor instead of grating the onions and garlic, and I'd probably cut down on the salt a bit. Also I'd probably add more kale as well. I'm really looking forward to making this again!AnonymousDallas, TX12/17/2019Made the recipe EXACTLY as written and it was great! On its own, the chicken thighs were perfectly crispy and well-seasoned, and the fideos were flavorful, BUT what really took this recipe to the next level was adding a bunch of FRESH HERBS (chopped parsley and dill all over the dish or on each serving) post-oven after it had time to rest. Tried both with/without the herbs and the herbs just added such a nice dimension and freshness. Don’t miss out on it!! (Thanks Alison Roman for the tip.) Also, I agree with some of the reviews below that grating the onions took way longer than anticipated. AnonymousWashington, D.C.12/15/2019Was very excited about this dish but it turned out so oily. Disappointing. Anonymous12/8/2019I can't imagine why anyone would rate this any less than 5 stars. The flavors were incredible, it was fun to cook, and those crispy fideos were texturally mind-blowing. I used regular spaghetti but will definitely opt for thinner noodles next time. Also, I'd like to try a little less oil. However, I was enamored with the dish and it looked beautiful— I will certainly be making it again!AnonymousNew Orleans, LA12/3/2019A great meal. This will surely be made again. I did substitute a few ingredients due to lack of having the exact items required. While in the store for kale I surprisingly found Goya Fideos. No Castelvetrano olives so I used Muffuletta, olive salad, from Costco and substituted Harissa for the tomato paste. Oh! And the thighs were boneless but it was still a great and easy meal.AnonymousStaten Island, NY12/2/2019This was my least favorite BA recipe we’ve ever made. Texturally, the murky sauce and stringy fideos disappointed. Visually unappealing as well. We will not make this again.AnonymousCharlottesville VA12/1/2019Delicious.  Made it per the recipe, though I'll turn the heat up a bit on the soffrito to get it darker next time to add more nuanced flavors.  It was still robustly flavorful.AnonymousWashington DC11/26/2019This was DELICIOUS exactly as written. Make it when you have a little time to spare — grating onions takes longer than you think, especially with cry breaks. Long live Sohla!carrottopfan69New York11/25/2019Explore Bon AppétitPastaSpanishEuropeanSpaghettiPasta & NoodlesChickenPoultryChicken ThighKaleLeafy GreensVegetableNoodleOne-Pot MealsMainDairy-FreeNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-17", "author": ["Condé Nast", "Sohla El-Waylly"]}