{"id": "2365a864c7c995b05b84c1233a11bc94", "url": "https://www.bonappetit.com/story/kyla-peal-restaurant-diary-4", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "The Way Wine Is Served at Restaurants Is Changing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Way Wine Is Served at Restaurants Is ChangingIn her fourth Restaurant Diary entry, wine educator Kyla Peal talks about how restaurants need to adapt their beverage programs as they reopen.By Kyla Peal, as told to Angela BurkeMay 5, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: bartender turned brand ambassador Jenny Feldt, line cook Peter Steckler, farmer Kristyn Leach, and wine educator Kyla Peal. Here, Peal shares about new territory her wine education company, Slik Wines, is expanding into: consulting with restaurants on wine and service in response to COVID-19 regulations in Chicago. Read Peal’s previous diary entries here.I’ve spent the last year redefining my role in the hospitality industry, transitioning from working in a restaurant to starting Slik Wines, a wine education platform, with my cofounders (Marie Cheslik and Danielle Norris). Even though I haven’t physically worked inside of a restaurant for many months, its rhythm stays with me.I’ll admit there are moments when I find myself longing for the beat of service once again. In fact, the other day, I was thinking of clearing a table—the order in which I would clear it and why that mattered to me. I recalled how I’d train staff to clear tables in a particular way because it looked more polished. That process was as natural to me as brushing my teeth. But do I want to serve again? A little bit of me does, but maybe more of me doesn’t. I’m fully vaccinated, but what about the rest of the staff and the guests? Part of me wants to go back, but then I have to be brutally honest with myself, like, You’re being pretty selfish. You know you want to go back for you because you miss it.Like many of my colleagues since the pandemic, I’ve had to reimagine how I fit in the current landscape of an industry to which I’ve dedicated many years. Launching Slik with Marie and Danielle was part of that reimagining, both personally, and more broadly, professionally, in terms of rebuilding a more equitable industry. As a women-owned business with collectively deep roots in hospitality, we designed Slik to be a supportive platform for our hospitality community of service workers and small businesses, such as restaurants and wine shops, during an extremely critical time.Throughout the shutdown, we were able to translate our versions of hospitality from face-to-face to digital by hosting virtual events like collaborative wine dinners with local restaurants and pay-what-you-can tastings. Now, as restaurants and other businesses have started reopening, we’re assessing how best to adapt to the shifting needs of our community. For example, we’re expanding into consulting, supporting operators who are slowly gaining their bearings after being in hibernation for months. We’re still in the planning stages of this program, but essentially, we’ll come in and help them in the short-term to get back on track with a curated wine menu and we’ll also train their staff. The training program we want to offer will cover the basics of wine service. We’ll host staff wine tastings, following the restaurant’s COVID-19 safety measures, so that front-of-house team members feel comfortable selling wine.Photo by Alex J. RiveraWith some restaurants implementing time limits on tables, the way that guests drink at restaurants will have to evolve as will service. Since folks can’t sit at their table for three or four hours, I think more restaurants will gravitate toward the quick and enjoyable glass. Perhaps we’ll see places with smaller and smarter wine lists that also include more budget-friendly bottles to safeguard against being saddled with lots of high-end inventory should another shutdown occur. But this doesn’t mean that wine drinkers today are unadventurous. If anything, what I’ve seen over these past few months is that people have become even more curious about wine. While they may have been a solely Cabernet drinker pre-COVID-19, now they’re more knowledgeable about what they like, and they’re looking for something new and unexpected.We’re planning our first in-person tasting of the year for next month, when the weather will be nice enough to gather comfortably outdoors on a restaurant or bar patio. As more people continue to get vaccinated, we’re exploring how we can safely operate Slik tastings in person. I’m hoping we’ll be able to host a few in-person wine dinners this summer too. It would be an intimate setting ideal for those who are not yet ready to dine at a restaurant but would feel comfortable at a small gathering. We’ve been extra cautious about moving forward with any in-person events and we’re excited to meet the people who’ve been supporting Slik.Even as we begin adding in-person events to our calendar, we’re still embracing the digital component of our business. We’ve recently launched “Slik Picks,” a three-minute YouTube series where we travel around Chicago and spotlight neighborhood wine shops. We want to use any influence that we may have as an organization to support other small businesses in our industry.No one knows what the next few months will look like for our industry. Even still, we’re moving forward and planning ahead with a certain level of cautious optimism. My cofounders and I are super excited about hosting in-person events soon and safely connecting with folks face-to-face. But at the same time, we’re just hoping that our city remembers what has happened and what’s going on still.Explore Bon AppétitRestaurant DiariesCoronavirusFirst PersonWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-05", "author": ["Condé Nast", "Kyla Peal", "As Told To Angela Burke"]}