{"id": "238b0888a7a775922238c42875fff54b", "url": "https://www.bonappetit.com/story/dessert-glasses", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "This Chic Water Glass Pulls Double Duty for Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Chic Water Glasses Pull Double Duty for DessertThe glass has a nice amount of heft, so you can aggressively scrape every last bit of whipped cream from the bottom.By MacKenzie Chung FeganSeptember 3, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you come to dinner at my house, you will find a table laid with matching plates and silverware and wine glasses and even a 10-piece set of vintage cream soup bowls, which I admit feels like I’m showboating. But water glasses? Blame the mason jar trend of 2010, but somehow I have never assembled a matching set. My collection is a hodgepodge of thrift store scores, Ikea tumblers from college whose mates have long since shattered, and the one utilitarian pint glass that my fiancée keeps trying to throw away. I can never justify spending money on something as mundane as glasses meant just for water, a beverage whose most noteworthy quality is that it tastes like nothing.Dessert glasses, on the other hand, are irresistibly frivolous and festive, and Lani Halliday’s recipe for Candied Cucumbers With Vanilla Whip is an excellent excuse to buy some. It sounds like something out of an Edwardian children’s book and demands a presentation that my holdout Ikea tumblers cannot provide. Instead, I like Our Place’s Drinking Glasses—pleasingly curved, a little bit retro, and perfect for layering the glistening cubes of cukes, toasted flakes of almonds, and cascading billows of whipped cream. Their beveled bottoms make for easy stacking, and they have a nice amount of heft, so you can aggressively scrape every last bit of whip from the bottom of the glass without fear of shattering. I’d opt for the jade green Dawn color for a monochrome moment with the cucumbers or the amber-colored Sunset for maximum ’70s appeal.It’s also a major bonus for me that these glasses are produced by a mission-driven company founded by Shiza Shahid, who was raised in Pakistan and cofounded the Malala Fund with Nobel laureate Malala Yousafzai before turning her attention to kitchenware. Our Place works with factories around the world—the drinking glasses are hand-blown in Thailand—that are audited by independent partners to ensure that workers are paid fairly and treated humanely.In addition to the Candied Cucumbers With Vanilla Whip, I could see using these glasses to serve an endless parade of desserts: sorbet with berries, pudding parfaits, or even individually portioned icebox cakes. And when they’re not in use for the dessert course, what do you know, I’ve tricked myself into buying a matching set of water glasses.Jason WoolwayOur Place Drinking Glasses, Set of 4$50 at Our PlaceExplore Bon AppétitHealthyish Loves ItHealthyishDessertShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}