{"id": "23948dafeb108e564dbaca610a6c2d6e", "url": "https://www.bonappetit.com/story/toasted-glutinous-rice-powder", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Toasted Rice Powder Is Nothing Short of Magical | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingToasted Glutinous Rice Powder Is Nothing Short of MagicalNutty, toasty, and crunchy, this Southeast Asian staple has no substitute.By Lara LeeNovember 12, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI have eaten larb (ลาบ or lahb, laap, larp or laab, a dish of many spellings) countless times growing up in Sydney; there are over 3,000 Thai restaurants in Australia, and eating Thai food is a national pastime. Larb, a fresh, spiced minced meat salad perfumed with fragrant herbs, has origins in Laos, the region of Isaan (also spelled Isan) in northeast Thailand, and with the Hmong people. It was once a luxurious food reserved for ceremonious occasions and festivals, but today, you’ll find it served in abundance as street food, seasoned with fish sauce, lime juice, and chile flakes or powder.It wasn’t until I learned to make larb in a cooking class in northern Thailand, however, that I realized quite how complex it is in name, in flavor, and in the inclusion, or controversial absence, of the quintessential ingredient that brings the dish together: toasted glutinous rice powder.The nutty, toasty crunch you’ll enjoy when eating larb can be attributed to this unassuming sandy and pebble-textured powder, which is its defining ingredient. Toasted glutinous rice powder, known as khao khua (ข้าว คั่ว) in Thai, has a nearly magic ability to absorb liquid and performs multiple functions: to flavor, to add texture, to thicken, to bind, and to emulsify. It’s also associated with good luck, for larb (ลาบ) shares the same pronunciation as “good fortune” (ลาภ) in the Thai language; it’s an auspicious dish to eat during Songkran, the festival that marks the beginning of the traditional Thai New Year. In Laos, there is folklore that if a woman craves jeow mak muang, a smoky, spiced dipping sauce containing toasted glutinous rice powder, she might be with child.There should be no confusion with glutinous rice’s name, for it contains no gluten; it’s named after the Latin word glutinosus, meaning “viscous, sticky, or glue-like.” What distinguishes glutinous rice (also known as sticky rice, sweet rice, or waxy rice) from other rice is starch; it contains high amounts of the starch amylopectin, which gives it a sticky quality and breaks down the rice when it absorbs liquid, and it contains no or very little of the starch amylose, which is responsible for keeping long-grain rice varieties such as jasmine or basmati fluffy and separated once cooked.The starch amylopectin is what causes glutinous rice to glom together when cooked.\nPhoto by Alex Lau, styling by Judy ManciniThere are some larb recipes that suggest toasted glutinous rice powder can be omitted, or advise that you make it from long-grain varieties like jasmine rice, but you must not take heed. Other rice varieties are too dense; when ground, they cannot thicken, bind, or absorb, and they produce a gritty and unpleasant texture. But powder made from dry-roasted glutinous rice blends into the dish seamlessly.There are varying opinions on the method of making it, but a common aim is to toast the rice slowly enough that the heat penetrates the grain. If it is heated too quickly, the exterior may burn before the inside is cooked through.To do it, place a dry wok or frying pan over a medium-low heat and add ½ cup glutinous rice to the pan. Shake the pan every few seconds so the grains of rice cook evenly and don’t step away—once it’s burnt, it cannot be saved. You can add flavors such as bruised lemongrass, slices of galangal, dried whole chiles, or makrut lime leaves while toasting to add fragrant, earthy, and herbal tones to your rice, but it isn’t necessary. Some chefs toast their rice for as little as four minutes, while others take up to an hour, but I find that the grains are done after around 10 minutes of toasting. Take it as far as it needs to go—the grains should glimmer in rich and appetizing shades of gold.Remove from the heat, transfer to a bowl, and allow to cool; if you leave them in the pan, they will continue to cook and may burn. Use a mortar and pestle to grind the grains to a sandy, coarsely cracked black pepper consistency, or pulse them in a coffee or spice grinder, working with just a few tablespoons at a time. The powder will now be the color of pale, golden sand, like Phi Phi Island’s Maya Bay in Thailand.While the homemade variety will always be best, you can also buy toasted glutinous rice powder in speciality Asian stores. Look for “ground roasted rice” or labels with the words “bột thính gạo” (Vietnamese) or “khao khua,” and do not confuse it with “ground rice,” which is too finely milled.I always make extra toasted glutinous rice, as it keeps for four weeks at room temperature in an airtight container before it starts to lose its flavor. You can use it to bind and flavor nem nướng, the grilled skewered meatball dish in Vietnam, or add it for texture in nam tok, a Thai beef waterfall salad. Make nam jim jeaw, a dipping sauce to be served with seua rong hai (“crying tiger beef”), or the Laotian dipping sauce jeow, to serve with sour fruits. Use glutinous rice powder to thicken soups such as gaeng om, in larb burger patties, or as a tasty crumb to coat breaded chicken. This simple ingredient adds a deep, smoky, and irresistible nutty flavor and crunch in many dishes, making it a wonderful pantry staple that is vital to Southeast Asian cuisine and beyond.Get Lara’s recipe:Smoked Tofu Larb With LemongrassLara Lee’s meat-free version of the Laotian and Thai dish combines smoked tofu with pops of crunchy sesame seeds and a kick of lime dressing.View RecipeLara Lee is an Indonesian and Australian chef, writer, and caterer. Her first cookbook is Coconut & Sambal.Explore Bon AppétitSoutheast AsianRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-12", "author": ["Condé Nast", "Lara Lee"]}