{"id": "23973a6eb972182c6db137f9e50a2420", "url": "https://www.bonappetit.com/recipe/nut-butter-granola-bars", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Nut Butter Granola Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNut Butter Granola BarsBy Sarah JampelSeptember 10, 20194.2(60)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintInspired by the nut butter bars we love from Big Spoon Roasters, this just-sweet-enough, chewy-but-firm bar is bound together by peanut butter and honey. Use any combination of nuts and dried fruit you have in your kitchen—we tried lots of variations and they all worked. A few notes on the recipe: First, if you’re looking to eliminate the egg white (which gives the bars structure), we’ve had success using 2 Tbsp. chia seeds in its place: Add them to the food processor when you blitz the oats. Second, since you're wondering, you can use almond butter. Most of us preferred the natural sweetness of peanut butter to the deep, roasty flavor of almond butter, but both work! And, lastly, these bars are salty-sweet and we think 2 tsp. is just right as long as your other ingredients are unsalted. But if you're using salted nuts or salted peanut butter, you'll need to reduce this amount.IngredientsMakes 162cups raw nuts (such as almonds, walnuts, pistachios, pecans, and/or blanched hazelnuts)½cup raw pumpkin seeds3Tbsp. extra-virgin olive oil, plus more for pan2cups old-fashioned oats, divided1¼cups dried fruit (such as tart cherries, raisins, currants, dates, apricots, and/or blueberries)¾cup natural peanut butter (unsalted or low-salt)½cup plus 2 Tbsp. honey2tsp. kosher salt2tsp. vanilla extract1large egg whitePreparationStep 1Preheat oven to 350°. Spread nuts and pumpkin seeds in a 13x9\" baking pan and roast until darkened in color and toasty smelling, 10–12 minutes. Transfer nuts and seeds to a food processor and let sit until cool enough to handle.Step 2Reduce oven temperature to 300°. Lightly oil 13x9\" pan and line with parchment paper, leaving overhang on both long sides. Lightly oil parchment.Step 3Add 1 cup oats to nut mixture in food processor and pulse until nuts are broken down to a sandy mixture and no whole oats remain. Transfer to a large bowl.Step 4Pulse any dried fruit larger than a raisin in food processor (no need to wipe out) until finely chopped, about the size of chocolate chips. Transfer to bowl with nut mixture. Add remaining 1 cup oats and stir to combine, breaking up any fruit that is stuck together. Add 3 Tbsp. oil and stir to coat. Add peanut butter, but don’t stir it in.Step 5Bring honey, salt, and vanilla to a boil in a medium saucepan (honey will bubble up) over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until honey is foaming vigorously and smells like caramel, about 3 minutes.Step 6Immediately pour honey syrup over peanut butter in reserved bowl (it will melt the peanut butter). Stir to combine, making sure to aggressively break up any clumps of nut butter.Step 7Stir egg white with a fork or whisk in a small bowl to liquefy. Add to oat mixture and stir until egg white is no longer visible.Step 8Transfer oat mixture to prepared pan and press firmly into an even layer. (Be sure to really compact the mixture into the pan—it helps to use the bottom of a heavy glass or metal measuring cup.)Step 9Bake granola bars until deep golden brown and no longer sticky or wet, 30-35 minutes. Let cool 5 minutes, then lightly score into 16 long rectangles (1 cut lengthwise and 8 cuts crosswise will make bars that are about 6½x1\"). Let cool completely in pan, then use parchment to hoist bars out onto a cutting board. Using a sharp chef’s knife, cut along marks to separate bars.Step 10Do Ahead: Bars can be made 1 week ahead. Store airtight at room temperature.How would you rate Nut Butter Granola Bars?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleNot too sweet and tasty. I used 1/2 tsp salt even though I used raw nuts. I used dried figs, golden raisins and dried cherries. My bars came out great, however, after 35 minutes I turned off the oven and let them sit in it until golden brown (no idea how long that was - I forgot about them). Cooled on the counter and cut this morning. Would like to try different fruit but filling and tasty. Thanks.JoErie, CO3/2/2022Yummy! These are great! I’m appreciative of the reviews but still found my first batch a bit crumbly as many have mentioned. I did reserve about 1/4 of the toasted nuts to add whole/chopped to the rest of the “sandy” ground nuts and oatmeal. This gave some texture and a nicer look (more like the photo). My second batch, cooled and just tasted now, held together much better. I reduced the dried fruit by 1/2 c and replaced it with white chocolate chips which melted in the warm honey/peanut butter mixture even after I mixed and let it cool a bit.  Maybe this melted element acted as a binding agent? I also baked the mixture for a total of 45 minutes until nice and browned on the edge and mostly dry throughout. I will be using these modifications again for future batches!Marci TLong Beach, CA1/23/2021I really quite enjoy these bars. I didn’t find the recipe overly confusing and the bars are quite filling. My only complaint is not having any nutritional facts specifically the calories.Denise COntario, Canada 1/21/2021These are the best bars! I cut them into ~ 3 x 3 inch squares. we eat them for fueling while cycling, or for a quick breakfast. The most recent batch was made with almond butter- also tasty. \nMy alterations to recipe: spray pan with oil, o/w no oil.\n1/3 cup honey (I am still experimenting on how low I can go and still have them hold together, but 1/3 c works)\nOnce in the jellyroll pan, I cover with another sheet of parchment paper or wax paper and then use a toaster oven tray to REALLY press them down to compact them.\nBaked 35 min until crunchy.\nThese last at least a month at room temp.CynthiaDurham, NC1/7/2021I love this recipe and use it all the time. I use low salted peanut butter and I had no issues. A whole batch of these last my family a week of eating one every morning. Sometimes I add chocolate chips and it tastes like a candy bar :).AnonymousToronto, ON12/1/2020I love these bars and make them monthly to crumble up for my morning yogurt and fruit. I omit the dried fruit, use half the salt, half the honey and half of the oats. They are to die for. That said, if you don't like crumbly, these aren't for you. Otherwise I enjoy mixing in other ingredients, like hemp, sesame, sunflower seeds, cashews, chia seed, poppy seed, etc etc. Delicious and the possibilities are endless. AnonymousSeattle, WA11/30/2020Delicious and easy. Freeze well and travel well wrapped individually in saran or whatever your preferred wrapper is. I’ve made them a few times using whatever nuts, dried fruit, seeds and nut butters I have on hand - I think that’s part of the point...use what you’ve got! Pistachios almonds slivered almonds walnuts pecans, raisins currants and cherries, peanut almond and sunflower seed butters. I’m not so concerned with what they look like, though agree if you want them more like the picture you’ll need to reserve some nuts/seeds to put on top. Always good to cut down the amount of salt. All in all, a good way to clean out the pantry! AnonymousWashington DC10/9/2020These instructions were difficult to follow and I’m what you would call a “seasoned” baker. They’re in the oven at present but the picture in the August 2020 edition was deceiving. I wish I had only put half the nuts into the food processor...may try again with alterations.AnonymousPuslinch Ontario Canada 9/25/2020This is one of the worst Bon Appetit recipes I have ever made.  The flavor is off.  They really just don't taste good at all.  The instructions don't match the recipe photos since the instructions say to pulverize all the nuts until \"sandy\".  I don't think the instruction's cooking time is right either.  These were impossible to cut without them crumbling into pieces.  I don't know what I'm going to do with them now because my family won't eat them.  The worst part is that the ingredients were expensive and the recipe was time consuming.  All the reviews mentioning the saltiness are correct.  This was a terrible recipe. Indiana9/16/2020Absolutely delicious. I’m getting ready to make my second batch of them. Everyone in my family enjoyed them.AnonymousRichmond,Virginia 9/15/2020I should have read the reviews before making. I did not find the salt to be a problem but I do need to bake them longer.  I agree on not pulverizing all the nuts . I also like the idea to stir the PB into the honeyAnonymousNJ8/29/2020I thought these were great. Used all unsalted ingredients and didn't have the salt issue many had. They were soft but stayed together well when sliced. Next time, I will put a few nuts to the side instead of adding all into the food processor to be pulverized. I think that will give texture and look like the photo. They actually keep me full which I can't say for most granola bars.AnonymousSan Francisco, CA8/6/2020These are delicious. Slightly more complicated than they need to be, but they turned out great. If you want them a bit firmer, I also would suggest leaving them in the oven for 35 or maybe 40, and just keep an eye on them. At 30 minutes they're still very soft.MgnmarieSaint Joseph, Michigan8/5/2020I'm very annoyed and agree with the reader who threw out the completed bars! This is a complicated recipe and I very carefully followed the recipe.  The flavor is not good, in my opinion, and the texture is EVEN WORSE.  They are crumbling and falling apart. I did read the reviews, as they were baking, and so seeing the problem, baked an extra ten minutes. But I don't think anything can save this recipe! AnonymousLos Angeles7/24/2020Amazing! I used all unsalted ingredients and added only 1/2 tsp salt  (I might go up in salt next time). I substituted almond butter for peanut butter and maple syrup for the honey. I baked the bars for 30 minutes and they're slightly sticky still but I'm okay with that. Maybe next time I'll try baking it longer to get it dryer. \n\nAfter checking out other granola bar recipes, I adjusted the procedure slightly by mixing the nut butter into the heated syrup and then mixed the syrup/nutbutter mixture into the nuts/oats/oil. aokikaren582Fairfield, Iowa7/19/2020Explore Bon AppétitSnack BarOatRice & GrainsPeanut ButterCondiments, Sauces & PastesSnackGluten-FreeVegetarianHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "Sarah Jampel"]}