{"id": "23991429a090fb948418e64b2a567db1", "url": "https://www.bonappetit.com/story/nobody-makes-weekday-breakfast-sandwiches", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "What Kind of Person Makes a Breakfast Sandwich On a Weekday? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Kind of Person Makes a Breakfast Sandwich on a Weekday?A person named...Alex.By Alex BeggsApril 6, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Where is Alex Lau?Our staff photographer and winner of a 2019 ASME Next award Alex Lau, keeps a low profile. Sometimes so low, no one can find him. He uses decoy location tags on Instagram like an international spy. We celebrated his ASME award recently and staffers recited a poem called “Where’s Lau?” that Shel Silverstein would have applauded. Then we ate piles of dumplings from Nom Wah Tea Parlor and at some point I looked around, and Lau was gone again. I caught up with the talented and elusive one, who was drinking a diet green tea Snapple in the Test Kitchen, so we could find the answer:Where was Lau this week? Quebec.What’s Lau reading? Shoe Dog, the memoir of Nike founder Phil Knight. Lau highly recommends this fast and fun read, even if you don’t care about sports.What’s Lau listening to? He loves podcasts, and he can’t stop thinking about the episode of The Daily about New York’s elite public high schools.Where’s Lau going next? Seattle, to visit his girlfriend.Want this letter before it hits the website? Sign up for our newsletter!Why is Jesse sweating?Jesse Sparks and Aliza Abarbanel were seated across a shared table in the office this week, laptop-to-laptop, and I sensed some tension. Jesse had lifted his locs from his neck and was fanning himself. He looked distraught. “Jesse, are you...okay?” I asked. “I’m really not,” replied Jesse. It turns out he and Aliza had applied caffeine patches that arrived with very little instruction or information, definitely not FDA-approved. “Overall good experience,” was Jesse’s review once he got over the initial rush and just became “fast.” Then he sent me the meme, seen above. I’m still concerned.What’s on Chris Morocco’s station?I know Adam wrote about Chris Morocco’s famous analytical mind this week, but he left out a crucial, character-defining detail. And that’s Chris Morocco’s Rolodex. It’s so worn that the edges are soft to the touch. Usually it remains on his desk, but on an especially hectic recipe-testing day it appeared on his work station, amidst piles of ingredients. “It was open to his LinkedIn password!” Exclaimed Molly Baz, “I was like, dad! But I love it.” Carla Lalli Music said, “It is LEGENDARY. It is for people who remember pencils and pens. It is for people who used to ‘work the phone.’” Chris’s rebuttal: “Its luster may have faded over the years but I can cram several lifetimes full of log-ins, account numbers, and VIP contacts in there.” I heard there’s one page that just says, “Kayak.com.”Pour out a packetOf Swiss Miss, because the inventor of the dehydrated cocoa mix, Charles Sanna, died this week at 101. In a recent interview with the The Wisconsin State Journal he said: “It’s nice to know that you’ve done something that will carry on.” If my math’s correct, the secret to a long life is drinking hot powdered milk.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiUpdateRemember last week when I told you I was going to make these brussels sprout tacos and the cinnamon tamal? Well both turned out fantastic. The tacos were some of the best I’ve ever made, and INGENIOUS. There’s a layer of spicy peanut butter sauce, fried brussels tossed in a tangy fish sauce-scallion-vinegar, all topped off with white onion and avocado, lime, etc. I shoveled three into my face before I remembered what all those brussels were going to do to me. 💨 The tamal was super moist, barely sweet, with this deep corn-on-corn flavor, and you serve it with  crème fraîche mixed with queso fresco for a creamy-sour-salty effect. What! A! Good! Idea!Get the recipes: Brussels Sprout Tacos with Spicy Peanut Butter and Sweet Cinnamon TamalThis week in wineThe working title for this fun story by Emily Schultz was “I Wasn’t Expecting To Have Anything in Common with Kourtney Kardashian But Here We Are.”Unnecessary food meme of the weekUnnecessary food feud of the weekWhile we were developing an upcoming Healthyish breakfast sandwich recipe (stay tuned—coming next week!), the staff divided into two camps. Do people make breakfast sandwiches on weekdays, or is this strictly a weekend food? And by divided I mean, only Alex Delany makes them on weekdays. Amiel Stanek will scramble an egg “when I’m hungover. But when do you ever happen to have rolls in your house?” “But what if you DID,” pleaded Delany. He soon found an ally: “If a ‘breakfast sandwich’ is a 30-second scramble on toast with mayo, a dash of hot sauce, and a slice of cheese, this happens 1-2 times a week at Chez Music,” said Carla, “and a minor child is the recipient. If he’s lucky there might be a couple pieces of little gem on top.” Put that in your cookbook! “Make yourselves cereal, losers,” said Emily Schultz, doing an impression of her own mother. “I won’t spend 30 minutes prepping the night before, for breakfast the next day,” said Meryl Rothstein. “IT DOESN’T HAVE TO BE LIKE THAT” —Delany was getting worked up. He used to make them all the time, he told us, “before I cared about my heart health.” The thing is, Amanda Shapiro told us, this wasn’t the most controversial detail about the Healthyish breakfast sandwich. “Wait until you guys hear about the onion bacon.”Here’s a breakfast sandwich recipe to tide you over until next week. (Not just any! Wylie Dufresne’s!)Explore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay... To Take Home the Wine You Brought to a Party?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-06", "author": ["Condé Nast", "Alex Beggs"]}