{"id": "239d90cb32a74d64daf8952cafca791d", "url": "https://www.bonappetit.com/recipe/bas-best-chicken-parm", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "BA’s Best Chicken Parm Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best Chicken ParmBy Molly Baz and Adam RapoportMay 1, 20204.7(110)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintLet’s get one thing straight: We love chicken parm, but we’ve had our fair share of mediocre versions. So we took it upon ourselves to do a deep dive into this iconic dish, and come up with what we deemed our ideal recipe. In the end, that means we kept the cutlets a little bit thicker so they wouldn’t get overcooked. We gave them a shallow fry to achieve a crispy, evenly golden-brown breading. We blanketed them in a simple yet rich tomato sauce, which gets extra depth from tomato paste. And as for the cheese, we landed on a combo of Parmesan, for its salty edge, and mozzarella, for its creamy ooey-gooey texture. A word to the wise: Although you’re only using four chicken breasts, this recipe will feed up to eight people (and even more if you’re serving other dishes along with it!). But don’t fret about leftovers: They make for a great sandwich the next day.Ingredients6-8 servingsTomato Sauce½cup extra-virgin olive oil1medium onion, finely chopped8garlic cloves, crushed2Tbsp. double-concentrated tomato paste¾tsp. crushed red pepper flakes228-oz. cans tomato purée2tsp. Diamond Crystal or 1¼ tsp. kosher salt1½tsp. sugarChicken and Assembly4skinless, boneless chicken breasts (about 3 lb. total)5garlic cloves, finely grated⅓cup fresh lemon juice¼cup extra-virgin olive oil1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more4large eggs1Tbsp. garlic powder1Tbsp. onion powder4cups panko (Japanese breadcrumbs)2cups all-purpose flour12oz. low-moisture mozzarella8oz. pre-grated ParmesanVegetable oil (for frying; 3–4 cups)2Tbsp. finely chopped parsleyPreparationTomato SauceStep 1Heat oil in a large Dutch oven or other heavy pot over medium. Add onion and garlic and cook, stirring often, until softened but not browned, about 5 minutes. Add tomato paste and red pepper flakes and cook, stirring, until paste is slightly darkened in color (it should start to fry in the oil), about 1 minute. Add tomato purée, salt, and sugar, and bring to a simmer. Partially cover pot with a lid (to avoid splattering), reduce heat so sauce is at a very bare simmer, and cook, stirring occasionally, until slightly thickened, 40–50 minutes.Do ahead: Sauce can be made 2 days ahead. Let cool. Transfer to an airtight container; cover and chill.Chicken and AssemblyStep 2Working one at a time, place a chicken breast on a cutting board so a short side is towards you and holding a chef’s knife parallel to breast, slice along the middle of a long side to make a slit. Continue to slice until you are about ½” from the other side. Open breast up like a book and place between 2 sheets of wax paper or plastic wrap. Using a meat mallet or a rolling pin, pound until  ⅓” thick (not making it super thin will keep it from overcooking).Step 3Combine garlic, lemon juice, and olive oil in a large baking dish. Season chicken cutlets all over with salt (about ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt per cutlet). Add to marinade and turn to coat. Let sit at least 20 minutes and up to 1 hour. (The lemon juice will turn the flesh opaque, but that’s nothing to worry about.)Step 4Make a dredging station: Whisk eggs, garlic powder, onion powder, ½ tsp. Diamond Crystal or Morton kosher salt, and 2 Tbsp. water in a large shallow bowl (cake pans or pie plates work great). Place panko in another large shallow bowl and flour in a third. Whisk remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt into flour.Step 5Working with 1 cutlet at a time and letting any excess marinade drip back into baking dish, dredge cutlets in flour, knocking off excess, then dip into egg wash, letting excess drip back into bowl. Dredge in panko, pressing firmly to adhere, ensuring no bare spots remain. Gently shake off excess and place cutlets on a rimmed baking sheet. Chill at least 20 minutes and up to 8 hours.Step 6Set a wire rack inside a second large rimmed baking sheet. Grate mozzarella on the large holes of a box grater into a medium bowl; add Parmesan and toss to combine.Step 7Pour vegetable oil into a large high-sided heavy skillet to come 1” up sides. Heat over medium until an instant-read thermometer registers 400°. Working in batches to avoid crowding the pan and returning oil to 400° after each batch, very carefully lower cutlets into skillet with tongs and cook until deep golden brown, about 2 minutes per side. Transfer cutlets to prepared rack; season with salt.Step 8Heat broiler. Arrange cutlets side by side in 2 large baking dishes or separately in 4 smaller baking dishes. Generously spoon some sauce over each cutlet (you want to mostly cover them but allow some corners and edges to remain uncovered). Spoon remaining sauce into baking dishes around the cutlets. Cover cutlets with cheese mixture (again, leaving some of those crispy edges uncovered). Broil until cheese is melted, bubbling, and browned in spots, about 4 minutes. Remove chicken from broiler. Let cool slightly and sprinkle with parsley.Photo by Emma FishmanHow would you rate BA’s Best Chicken Parm?Leave a ReviewTell us what you thinkReviews (76)Back to TopTriangleit would be nice to see the recipe for more than one second, signed in 3 times, still no recipe just reviews  :(bobboston2/12/2022This was delicious just as everyone states. I took a lot of different routes to this after a point. I made my own sauce (yumms), cut my chicken too thin so the breading did not stick well when flipping, and  because the chicken was too thin, there was a hefty amount of breading in the sauce once it was cooked. Still delicious, tender, and juicy, just make sure you don't cut or pound out the chicken too thin! :) alexis Arkansas10/22/2021OMG!  I rate every Italian restaurant based on how good their chicken parm is.  Honestly never had better than this recipe, even in NYC.  Thank you very much for sharing this!  Larry GrosmanGreensboro, NC10/17/2021So so so so so good. Worth the time and effort, for sure!PGScranton, PA7/31/2021Amazing recipe!  Thank you Molly!  Marinating the chicken makes the meat so tender and flavorful.   I make extra chicken to fry and serve as buffalo chicken salad with romaine lettuce, homemade blue cheese dressing and buffalo sauce.\n\nBeviVermont2/24/2021Made this on Saturday night for my family.  Everyone from grown kids to grandchildren loved it. The marinating in addition  to seasoning the egg , the flour and salting the chicken made all of the difference.  The Panko crumbs and the chilling kept the chicken so crispy and delicious.  I prepared everything in the morning for an evening meal so my breaded chicken was in the fridge for about 7 hrs.  I wished I could have fried the chicken early on in the day and then just brought it out for a reheat in the oven before assembly but whenever I make a recipe for the first time , I make it exactly as is . I was afraid that a reheat would dry out the chicken .  I will give that a try next time.  I agree with many of the other reviews about the sauce.  It was ok but was a little bland and thicker than what I’m used to.  I will substitute crushed tomatoes for the purée the next time I make this ,which will be soon.  Delicious !  Wonderful leftovers too ! Mary Beth Buist.  Toms River , NJ 2/15/2021Unreal!! I halved the recipe and used my own recipe for sauce. Marinating the chicken after pounding is a genius move, and I think letting the cutlets rest after breading makes a huge difference too. I broke the breading with my tongs when flipping one xl cutlet (basically filled the area of my 7 liter dutch oven) and I will divide the pounded cutlets into slightly smaller pieces next time to make them more manageable. Truly one of the best meals I've made in ages. I don't fry often but this was totally worth it. anon89Berlin, Germany2/5/2021In short, this was  i n c r e d i b l e .  Marinating the chicken in the lemon and garlic really brought it over the top, well worth the time and extra dish to clean. I ended up marinating for about 40 minutes while the sauce was cooking down, mistakenly missing that I was meant to also chill the breaded breasts for 20 mins - oops. I went straight from the breading into the oil and that resulted in some slight separation between the chicken and the crust, but nothing significant. Will definitely chill next time. I agree with a couple other reviews that the sauce wasn't my favourite, it felt quite one-dimensional. I ended up using about half of the cheese I'd grated which turned out to be the right amount for us. Served alongside some fresh steamed broccoli which contrasted the fried chicken nicely. JordanToronto, ON2/5/2021This was a winner with the whole family. Since we try not to eat too much fried food I followed everything exactly as written except I air fried the chicken. I did 12 minutes on one side, flipped it over and did about 10 minutes on the other side at temp of 475. It was delicious and got nice and crispy. The recipe did take some time but because you do it in stages its easy to clean up as you go. This recipe is a keeper. AnonymousScottsdale, AZ10/12/2020Oh this is SO good. The sauce wasn't my personal favorite but that's just a matter of preference - it turned out well, but I felt like it tasted super concentrated, even after a 50 minute simmer. That may have just been the result of using the cheapest canned tomato puree/paste, though! Only change I'll make for next time is to just make my own sauce the way I like it. Pro tip if you haven't made sauce like this before - when stirring, use the lid as a shield or you'll get a face (and white sweatshirt) splattered with super hot tomato sauce. Whoops. \n\nThe chicken turned out BEAUTIFULLY. Marinating it in the garlic/lemon juice situation absolutely took it to the next level. Highly recommend following the advice in the recipe to leave some pieces unsauced before broiling, since those crispy bits were some of my favorite bites. I initially felt like it called for too much cheese, but I'm glad I stuck to the recommended amount. Served over zoodles, which was also a good call, since it's a pretty heavy chicken dish and pasta would have been a bit too much. Can't wait to make it again! leffertsemily3704Aurora, CO10/8/2020Wow! This recipe is very involved and takes quite a bit of time but is so worth it! My husband and I decided to tackle this beast for our anniversary dinner and although it takes time- it was a fun process. Letting the chicken breast marinade in the lemon juice and garlic was a game changer. Allowing the breast to rest in the fridge after coating it in Panko was also a game changer. Super crispy, super moist, super flavorful and delicious! A must try! AnonymousCalifornia 9/9/2020Delicious! It took me about 3.5 hours. Yes, there are a lot of steps but it’s worth it and you do some of it ahead. The only thing I did different was add basil at the end instead of parsley. I served it with an arugula salad and it was a huge hit. Marinating the chicken with lemon really made a huge difference.AnonymousMiami, FL8/30/2020Really great recipe and the video was super helpful! If you have the time to devote, it's well worth it. I've never read a recipe for chicken parm that marinades the chicken and that did make a difference. Next time I make this I would add parm cheese to the bread crumbs because I felt it lacked flavor which might be because I didn't add onion powder or garlic powder to the egg wash. AnonymousFlorida8/27/2020Best chicken parm I have ever made! I used bottled organic marinara for my sauce, but followed steps precisely for chicken, and it was fabulous! Thanks BA! Ann LaGrecaNew Jersey8/16/2020So tasty. Lots of steps. I'd make the sauce the day before, at least. \n\nUnfortunately, I don't think there's any shortcuts to the flour/egg/breading process...you do it or you don't, the end. \n\nTASTY yum yumAnonymousMaine8/16/2020Explore Bon AppétitItalian AmericanAmericanChickenPoultryChicken BreastCanned TomatoTomatoVegetableMozzarellaCheeseParmesanMainNut-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast", "Molly Baz", "Adam Rapoport"]}