{"id": "239e64c3fca05909e3dd2f0a610778c9", "url": "https://www.bonappetit.com/recipe/green-beans-and-mushrooms-with-crispy-shallots", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Green Beans and Mushrooms With Crispy Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueGreen Beans and Mushrooms With Crispy ShallotsBy Kendra VaculinOctober 19, 20214.7(47)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintThe conundrum is as old as Thanksgiving itself: You want to make a green bean casserole, but there’s absolutely no space in the oven to bake one off on the big day. This buttery stir-fry features all the earthy mushrooms and crispy shallots you’d expect from the classic dish but is done entirely on the stovetop. For less to do on Thanksgiving day, blanch the green beans the day before and store them in the fridge until you’re ready to go.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonColander$11 At AmazonSlotted Spoon$13 $10 At AmazonLarge Skillet$84 At AmazonLarge Basting Spoon$16.37 At AmazonMicroplane Grater$16 At AmazonIngredients8 Servings1½lb. green beans, trimmed1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more⅓cup vegetable oil3large shallots, thinly sliced1lb. mushrooms (such as oyster, shiitake, or maitake), tough stems removed, torn into large pieces4Tbsp. unsalted butter2Tbsp. sherry vinegar or red wine vinegarFreshly ground black pepper2oz. Parmesan, finely gratedPreparationStep 1Cook green beans in a medium pot of boiling salted water until bright green, about 2 minutes. Drain and rinse green beans under cold water to stop them from cooking more. Set aside.Step 2Heat oil in a large skillet over medium-high. Cook shallots, stirring occasionally, until browned, frizzled, and crisp, 6–8 minutes. Using a slotted spoon, transfer to paper towels to drain, and immediately season with salt. Set aside for serving.Step 3Add mushrooms to same skillet and toss to coat with oil. Cook, stirring occasionally, until softened, about 4 minutes. Season with salt and cook, stirring occasionally, until starting to brown, about 4 minutes. Reduce heat to medium and add butter, reserved green beans, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Cook, tossing often and spooning foaming butter over vegetables, until butter darkens slightly and smells nutty, about 5 minutes. Add vinegar and season generously with pepper. Cook, stirring often, 1 minute.Step 4Transfer green beans and mushrooms to a platter and spoon any sauce in pan over. Top with Parmesan and reserved crispy shallots.Do ahead: Green beans can be blanched 1 day ahead. Pat dry; transfer to an airtight container or resealable bag and chill.How would you rate Green Beans and Mushrooms With Crispy Shallots?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI have made this several times to rave reviews. My husband \"doesn't like green beans \" and he has requested it multiple times. I use a nice sherry vinegar and olive oil, which is tasty with the rich buttery flavor of the mixed exotic mushrooms I use. AnonymousAustin Texas 12/24/2021made it for my family on thanksgiving     they loved it!toni bstaten island ny12/18/2021EXCELLENTERILEECALIFORNIA12/9/2021I made these for Thanksgiving and thought they were delicious. I used Chinese cooking wine instead of the vinegar and it was a great substitution. I love the flavors in this dish! I wanted to make regular Green Bean Casserole but I am GF so this recipe was perfect. Thank you!Emily R.North Carolina12/5/2021The vinegar overpowers the dish a bit - I recommend either making the green beans & mushrooms a day ahead to let the flavor mellow out a bit and top with the shallots & cheese on the day you plan to serve. OR possibly swapping out one tbsp of the vinegar with soy sauce. The vinegar was way too much when we first served the dish, but was perfect as leftovers. AnonymousLos Angeles, CA11/29/2021The crispy shallots are heaven, and everything was scrumptious until adding the vinegar, which totally killed the dish - inedible after that. Will be making this dish from now on out without vinegar.Anonymous11/28/2021Awesome recipe. So much better than traditional green bean casserole but satisfies that taste!AnonymousColumbus, OH11/26/2021Delicious and easy to prepare.tomthespudCoeur d'Alene, ID11/24/2021a-m-a-z-iiiiiiiiiiiingAnonymousDenver, CO11/23/2021This came out nicely. I followed the recipe but next time I think I'd take the suggestion to char the green beans a bit before adding them. I didn't really get the foamy butter that the recipe talks about but the mushrooms still soaked it up and got really fragrant and tasty.\n\nFor the time and effort it took to make this (not much) and the outcome of the dish (pretty good, 4/5) I'd put this in rotation for pot lucks in the future but wouldn't want to try to make it the star of any show.AnonymousWashington, DC11/14/2021Delicious! I halved the recipe for two of us and used some mushrooms from the green market and came together very nicely. I added more butter, salt and vinegar to season it to our taste.RachelColumbia, SC11/10/2021This was a lighter, fresher take on the traditional soupy casserole that Grace is most Thanksgiving tables. I used chanterelles and recommend you do too. \n\nThis is a five-star dish but a four-star recipe because medium high is much too high for crispy shallots. I had to cycle through two burned batches before finding a happy place on medium heat, stirring the shallots constantly, and watching them like a hawk.CambroWestport WA11/8/2021Such a great way to treat both the green beans and the mushrooms.  The added acid balances the nutty rich butter taste and the crispy shallots and salty parmesan are perfect toppers.  I have also blistered the green beans in avocado oil, instead of parboiling them, and the result was equally wonderful with a bit more char.  RoyCornelius, NC11/5/2021Excellent combo that tingles your taste buds,?had to make it before Thanksgiving to make sure it was going to be a hit 👍👍👍+TomChgo IL 11/3/2021One of the best green bean dishes. We'll be serving this at Thanksgiving.Graham11/2/2021Explore Bon AppétitGreen BeanVegetableThanksgivingSideMushroomShallotDinnerVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}