{"id": "23a149fabbdb7687a68d07638912a8f7", "url": "https://www.bonappetit.com/story/reusable-paper-towels", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Do Reusable Paper Towels Really Work? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Gave In and Got the Reusable Paper TowelsThey're cute and eco-friendly but are they up to the task?By Alex BeggsMay 19, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to I Gave In, in which senior staff writer Alex Beggs surrenders to the latest targeted ad, trendy recipe, or life-changing cooking tool—and reviews it.I’m so loyal to Bounty select-a-size that when guests used to ask “can I bring anything?” that was my only request. I even tear them in half, select-a-sizing my select-a-size. I stretch those towels thin. I’m trying not to use so much paper, but I still feel completely dependent on them. My cat...barfs a lot.And that’s something I’ll never clean with the square reusable paper towel flopped over the side of my sink.My new Swedish dishcloth—beloved and highly rated by many—is made of cotton and cellulose, which is an “insoluble substance,” a definition that hasn’t really cleared anything up for me. It absorbs, I guess??? This is the kind of product I’d see eco-influencers using on Instagram and think, hmmmm. They’re getting paid to promote this. It’s too cute to trust. Have you seen the patterned ones?! So I gave in! It didn’t hurt!When splatters of coffee on the counter need a swipe, I grab it. When showers of oil coat the stovetop, I attack them with it. It’s a wet cloth! It works!Like any new habit, it took some getting used to. When it was soaked from constant use (it gets rinsed and wrung but remains perpetually wet), I didn’t want to use it, all cold and soggy. Kinda gross. But that’s a fact of reusable towel life. I also had to accept that the bright white and lemon-patterned square from the online photo became gray and stained immediately. Like all descendants of Adam and Eve, it will never go back to pristine. But I can throw it in the wash (dishwasher or laundry) to keep it from getting grosser. When it gets too repulsive to touch or deteriorates, I’ll compost it with my carrot stubs. Life goes on.So that’s not much to complain about. I’m definitely using paper towels less than I was before, and I feel good about that dent. But when my cat pukes from eating too fast (ugh, ROGER) or when an oily onion fleck flings to the floor, I’ll still go for paper towels. A tiny square-of-a-square of paper towel is gonna happen. I can’t beat myself up about that kind of stuff.And maybe you’re thinking—or you’re my sister and you’re saying this over the phone—couldn’t you use a washcloth instead? Maybe the sponge that’s already there? Oh. Yeahhhh. YES. 100 PERCENT. Why wasn’t I doing that all along? And we’re back to square one.DII Swedish Dishcloth Set Cleaning Collection$17 at Amazon (set of 3)Explore Bon AppétitI Gave InCleaningShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-19", "author": ["Condé Nast", "Alex Beggs"]}