{"id": "23ab8d3df1b543659fd2ee3f3100a7cf", "url": "https://www.bonappetit.com/story/harolds-griddle", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "A Pancake Griddle Is for More Than Just Pancakes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingA Pancake Griddle Is for More Than Just PancakesIn his YouTube videos, chef Harold Villarosa shows how a plug-in griddle can stand in for a traditional stovetop.By Jenna Adrian-DiazFebruary 4, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you’ve seen chef Harold Villarosa’s tantalizing videos of steak okonomiyaki and adobo grilled cheese over on the Bon Appétit YouTube channel, you might have noticed that one of his go-to pieces of equipment is a Presto electric nonstick pancake griddle. Villarosa’s twin griddles allow him to cook with comfort just about anywhere. Though we’ve all made a stack of ’jacks on the handy, portable appliance, in these videos Villarosa completely reimagines their use, employing one more traditionally as a flattop for direct cooking and the other in place of a burner for pots and pans.What’s better than one griddle? Two griddles.\nVillarosa’s griddle love runs deep. “Five years ago I started working with students in New York City to teach them how to cook. The Department of Education wouldn’t let us use the cafeteria kitchens, so I had to create mobile kitchens in school libraries and auditoriums,” he explains. So he gathered equipment for his teaching kitchens: a cutting board, an immersion blender, and two electric pancake griddles that could stand in for the flattop grills that are an essential part of professional kitchens.“These griddles sear perfectly,” he says. “If you cook salmon skin on it, it becomes super crispy. I’ve done a lot on this thing—charred onions and steak, a whole fish.” Anything you’d cook on a flattop, Baking Steel, or cast-iron griddle you can cook on Harold’s Presto. Smash burgers, breakfast fare, grilled cheese—all fair game.Presto Slimline Griddle$56 at Amazon$76 at TargetBut there’s more to the griddle than searing and crisping. Villarosa uses them as he would a stovetop, in place of a portable gas or induction burner. “If you have a pancake griddle and turn the heat up to the highest setting, you can put pots on that hot flattop.” In his steak okonomiyaki video, the chef uses the griddle as a heating surface for his nonstick frying pan, in which he cooks the okonomiyaki pancake. In the grilled cheese video, he braises his chicken adobo in a heavy-bottomed saucepan set atop the Presto. He has even put it to work making an entire pasta dinner with the students. Together they boiled handmade agnolotti stuffed with butternut squash in one pot and finished them with a sage and brown butter sauce in another, all on the griddle.Villarosa recommends electric griddles to anyone who might be cooking in a nontraditional kitchen but still has access to a power source—students who don’t want to fight for space in the communal dorm kitchen, homeowners waiting out a kitchen renovation, or even apartment dwellers waiting for their gas to be turned on. He also thinks griddle cooking could benefit anyone who does have access to a traditional kitchen but finds it lacking. “Some apartments without gas have electric stove tops that take forever to heat up and usually don’t distribute the heat evenly.” A quality plug-in griddle is a step up.If you do decide to get to know your griddle better as a multitasking machine, Villarosa suggests getting familiar with how it heats, especially if you’re used to setting a precise temperature for your oven but not your range. “You can really play around with the dials and figure out which heat settings work best for you. It’s like DJ’ing, almost.”Catch Harold on the 1's and 2's.\nExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-03", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}