{"id": "23afa7b540dbfc597aaae3bfe4603e40", "url": "https://www.bonappetit.com/story/what-edna-lewis-taught-me", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Edna Lewis Taught Me to Stop Asking for Permission | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEdna Lewis Taught Me to Stop Asking for PermissionBefore he was a chef, Alexander Smalls went to Lewis for guidance. She showed him what he knew all along.By Alexander Smalls, as told to Hilary CadiganMarch 23, 2021FacebookTwitterEmailEdna Lewis, 1980Photo by Martha Cooper/New York Post Archives /(c) NYP Holdings, Inc. via Getty ImagesFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.My Uncle Joe was a chef and Aunt Laura was a classical pianist, and they lived in Harlem in the 1940s and early ’50s. They were fancy Negroes, if you will; they kept a proper home and dressed for dinner. My uncle always wore a jacket and there was some properness to the way they viewed themselves and the world.But when I was born, they moved back to Spartanburg, South Carolina, to be a part of my education. They had no children, though they had tried for many years, and my father, the youngest of five surviving siblings, was the first to have a son. So they moved a couple of doors down from my grandfather, which was a few doors down from us.Uncle Joe would have these wonderful dinner parties. He would cook a lot of fancy food and Aunt Laura would play the piano. They had a photo of themselves with Edna Lewis back in New York City and referred to her often. I don’t know that she was necessarily famous then, but she was a seamstress and a designer and a friend of theirs and kind of a socialite. I was a child when I first became aware of her.My grandfather’s half-acre backyard garden was my lifeline in many ways. It fed me. It symbolized how food went from seed to harvest to kitchen to table. In that garden my grandfather became somebody else, this extraordinary bigger-than-life personality, hauling and raking and planting and tending to the soil and his crops. He would tell me stories about how his parents had been slaves. He painted a landscape, a whole different world that was much like the world of Edna Lewis, who grew up in Freetown, Virginia.Edna’s philosophies mirrored the practices I’d grown up with. There was real ritual and tradition, and reverence around not just preparation but the growing and cultivating of food. She was of the field, and of the garden, and that was the whole premise of her cooking. In the South we say, “We come from the same tree.” She kind of became a member of my family.I graduated from high school in 1970 and started a practice of book sleuthing: looking for culinary books and cookbooks that were about me. When Edna’s first book came out in 1972, it cemented the practices I already had with my grandfather, but it also validated a road map for me, how I wanted to approach cooking as an art form. And though I hadn’t yet met her, I was consumed with understanding this woman. She became a spiritual mentor, because she was out there somewhere in the world doing what I felt in my heart, doing what I wanted to do with food.Years later, I came to New York, pulled by partying and dance and opera and Broadway. I was an opera singer with the Houston Grand Opera, and we came to perform Porgy and Bess. At the time, I had two tools in my life, two languages that provided a lens to the world: music and cooking. I was looking for people who looked like me, who had a footprint, a point of reference in the conversation of food.By the late ’80s, I was in full transition, considering whether to leave opera and finally commit myself to my dream of becoming a chef, owning my own restaurant, taking my living room public.I was starving to meet Edna Lewis because I needed confirmation, or should I say affirmation. I needed someone to say, “It’s okay.” And who better than this woman that I had adored and admired and appreciated from afar, whose book I consumed like it was a Bible?So, I made a beeline to Gage & Tollner, where she was head chef at the time. For the first few visits, I think I just kind of sat in a corner, hoping to catch sight of her. Then one day I caught her eye and waved—my mother’s wave, Southern, with a head bow. One of those. She acknowledged me and we exchanged a few words before she went back to the kitchen.The next time I returned, I brought her a beautiful scarf that I’d bought in Paris. “Well, now tell me about yourself,” she said. And so I did. I told her I was a young opera singer, but that I’d hit a glass ceiling, a certain level that was difficult for African American men to go beyond (it’s worse than golf, frankly!). I told her how exhausted I was, how manipulated and blocked I was feeling, how badly I wanted to own my own destiny. I told her that food was my great love.“Well, you have to do what your heart is telling you,” she said.“My heart is telling me to set the table for the world,” I replied. “To do what you do. To show people that the African American kitchen is as important—if not more so—as any.”She smiled. “Well, it sounds like you’ve made up your mind.”That was all the affirmation I needed.Five restaurants and three cookbooks later, I know that what Edna gave me were clear principles. Because of her philosophy—one of excellence and respect, of honoring the traditions you come from and the ancestors you represent—I was able to articulate my own. She brought cooking into a learned, elevated space. She talked about it like the Europeans did, but in an American vernacular that came out of the African American farming experience. It wasn’t presented as “ethnic.” It wasn’t dumbed down.She helped me understand that nobody needed to give me permission but myself. She laid a real foundation, a consciousness for the American chef. I mean, if you can’t build on that platform, maybe you need to go into computer science.What Edna really teaches a cook is what you can’t find in a recipe. It’s respect. Respect for every ingredient. Respect for the recipe itself. She used to talk about how, in the South, before they would slaughter livestock or plant the harvest, they would pray. They would ask the universe and God to take care of their crops. This is a state of mind. It is not about religion, it’s about reverence—an application of spiritual sincerity, faith, vulnerability, and humanity. And that’s the greatest gift she gives: a new way to think about the art of cooking.Alexander Smalls is a James Beard Award–winning chef, author, television personality and co-owner of iconic NYC restaurants The Cecil and Minton’s. He is also a world-renowned opera singer and the winner of both a Grammy Award and a Tony Award for the cast recording of George Gershwin’s ‘Porgy and Bess’ with the Houston Grand Opera. His newest cookbook, ‘Meals, Music, and Muses’ marries his two great passions―food and music—and is available now.Explore Bon AppétitPeopleFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Alexander Smalls", "As Told To Hilary Cadigan"]}