{"id": "23cf1d28501124d1e25a960711129f17", "url": "https://www.bonappetit.com/story/cbd-coffee", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "CBD Coffee Is the Wellness World's New Favorite Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCBD Coffee Is the Wellness World's New Favorite DrinkBut not all CBD is created equal... or legal.By Melissa MalamutMay 28, 2018FacebookTwitterEmailCBD coffee and toast at Caffeine Underground.Photo by Emma FishmanFacebookTwitterEmailOn a sunny but unseasonably freezing April afternoon in New York, I walked the 10 or so minutes from the L train to Caffeine Underground, a coffee shop in Bushwick that triples as an art gallery and community center. The open-concept space serves lattes and espressos and a variety of milks (oat, almond, macadamia) and plenty of “wellness” options (Kava tea, Bulletproof-style coffee, activated charcoal add-ins). But there’s one totally unique item: Cannabidiol-infused (CBD) coffee.Although CBD—the non-psychoactive cannabinoid compound found in marijuana and hemp plants—won’t get you “high,” it does promote relaxation. A 2016 pediatric study from researchers at the University of Colorado School of Medicine found that “CBD oil can be an effective compound to reduce anxiety and insomnia.”The coffee creation is the brainchild of chef Leighton Knowles, co-founder of the New York- and Ohio-based company, Flower Power Coffee Company. The beans are purchased from 70-year-old coffee purveyor D’Amico Coffee Roasters, a family-owned shop Brooklyn. Rather than dropping CBD oil into a drink, Flower Power’s formula is infused into ground beans before they’re brewed. Flower Power co-founder and Brooklyn pharmacist, Craig Leivent, says that the few other CBD-infused coffees on the market coat the whole bean with oil, which, he says, doesn’t provide a consistent measurement of CBD per cup. “When you drink our coffee,” says Leivent, who has a doctorate in pharmacology and an undergraduate degree in botany, “you get the alertness from the caffeine but without the jitters.”Flower Power's CBD coffee beans.\nMarijuana is recreationally legal in nine states (and D.C.), but technically, CBD is legal in 43 states—as long as it has been derived from hemp, which contains very few traces of THC. But this also means a potentially less potent product. A 2015 study out of The Hebrew University of Jerusalem in Israel, found that whole-plant CBD is superior to hemp-derived CBD for the treatment of inflammatory and anxiety conditions. Flower Power’s CBD coffee is derived from hemp and double-tested in a lab in Massachusetts to makes sure it’s THC-free. Leivent says that if he lived and worked in a state where marijuana were recreationally legal, he’d get whole-plant CBD rather than the hemp-derived stuff. “CBD from whole-plant marijuana has other chemicals in it, minute cannabinoids that work synergistically with the body to create an entourage effect,” says Leivent. “You get more of a medical effect with all of these chemicals working together rather than just one particular [hemp-based] isolate.\"CBD oil derived from whole-plant marijuana has seen promising results for numerous medical treatments, including treating children with epilepsy. (In 2013, CNN’s Dr. Sanjay Gupta introduced the world to a child who after using CBD oil went from having 300 seizures a month to only two.) On April 19, the AP reported that an FDA panel is reviewing a a pharmaceutical-grade CBD oil made from whole-plant marijuana called Epidiolex, a possible treatment for rare forms of pediatric epilepsy. If approved, it would be the first marijuana-made medication sold on the U.S. market. A day later, on the marijuana community’s “high holiday,” April 20, New York Senator Chuck Schumer introduced legislation to decriminalize marijuana on the federal level. Forecasters are predicting that legal cannabis in the U.S. will be outselling soda by 2030.Due to its anti-inflammatory properties, CBD oil has recently become a wellness-world darling, popping up in everything from mascara to bath bombs. But the science hasn’t caught up to the supply. A 2017 University of Pennsylvania study found “a lack of regulation and oversight” on cannabidiol extracts, and that 70 percent of CBD products sold online were mislabeled. So like many other products we consume or put on our skin daily (makeup, lotions, supplements, vitamins) none of it is regulated. If you live in a state where marijuana is not recreationally legal, your CBD will most likely be derived from hemp. And that’s okay, says Leivent. “Hemp-based CBD still works on the  same issues like anxiety and anti-inflammatory conditions, there are just fewer amounts of the other chemicals that could enhance the effect of the CBD.\"Hemp-derived CBD definitely had an effect on me. At Caffeine Underground, I ordered a CBD oat milk latte—smooth and delicious with no trace of CBD flavor—and toast made with CBD-infused jam. After two hours plugging away on my laptop with full concentration, I was still so completely blissed out, the walk back to the train in 30-degree weather felt like it took no time at all.Explore Bon AppétitHealthyishCoffeeMarijuanaCannabisTrendsRead MoreshoppingThis CBD Tincture Makes Me Super Productive… In a Chill WayBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-28", "author": ["Condé Nast", "Melissa Malamut"]}