{"id": "23e400f54a42c7de50881e0d02d154d7", "url": "https://www.bonappetit.com/story/rinse-your-rice", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Rinsing Rice is the Difference Between Fluffy and Mushy Grains | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRinsing Rice Is the Difference Between Fluffy and Mushy GrainsIt's nearly as important as paying your taxes and flossing your teeth.By Emma WartzmanDecember 3, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailHere at Basically, we're all about making delicious recipes in the simplest way possible—but there are some steps that can’t (or shouldn't) be skipped, and rinsing rice is at the top of the list. It’s not merely a recommendation, people: You should pretty much always be rinsing.But first—to get it out of the way—let's discuss the exceptions: congee, rice pudding, and risotto. In these dishes, the whole point is for the grains to become mushy in a good way.Compared to rinse two (shown above), the water is still super cloudy in rinse one (shown here). \nPhoto by Laura Murray, Food Styling by Pearl JonesOther than in those particular circumstances, rinsing rice is worth the time, energy, and additional dirty dish. First off, rinsing gets rid of any bits of debris that ended up in the bag. More importantly, though, it washes off some of the surface starch. Starch is what causes all those aforementioned dishes to thicken. When the goal is fluffy, separated grains as opposed to a porridge-like consistency, that starch has got to go.To be clear, even when you rinse short-grain rice, like sushi rice, the cooked grains will still stick together (they’re supposed to). Still, they’ll lose any unpleasant gumminess. And when you rinse long-grain rice, like basmati or jasmine, you’ll actually come away with individual, discrete grains.As you rinse rice, you'll be able to see the starch releasing into the water. If you’re using a strainer (which works fine, though it can be annoying to clean), the stream passing through the rice will go from cloudy to relatively clear. We prefer to swoosh the rice around in a bowl full of cold water a couple of times, pouring out the water in one fluid, fast motion between rinses. (All of the rice, with the exception of a grain or two, will remain safely at the bottom of the bowl.) The difference from the first rinse to the third is glaringly apparent: The water will go from distinctly cloudy to clear enough that you should be able to see your submerged hand. It will never be crystal clear, but even a few rinses makes all the difference.Now that you've rinsed, you’re well on your way to making Lemony Lentils and Rice with Caramelized Onions, or Fluffy Rice Pilaf with Curry, or the perfect landing pad for pork meatballs. It only took that one very easy, very quick (and, ahem, pretty much non-negotiable!) step.Get the recipe:Lemony Lentils and Rice With Caramelized OnionsThis recipe is inspired by mujadara, a simple combination of lentils, rice, and onions that exists in various forms across the Middle East. It's comforting but not too rich, and it's fresh and vegetarian without relying on many perishable ingredients. In other words, it's the perfect meal for the nights in between holiday parties.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-03", "author": ["Condé Nast", "Emma Wartzman"]}