{"id": "23f52ea4bfa9228f2103859e7058308a", "url": "https://www.bonappetit.com/story/simple-amaro-spritz", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "This Amaro Spritz Is Your Ultimate Pre-Dinner Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 4-Ingredient Amaro Spritz Is Your Ultimate Pre-Dinner DrinkMeet (and memorize) the Lil' Ripper. By Alex DelanyFebruary 28, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Rebecca Jurkevich FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I believe that the best kind of cocktail is one you can immediately follow with another. Light, flavorful, refreshing, inviting, and not oppressively boozy. The Italians mastered this kind of cocktail. In fact, an entire section of their culture is committed to its consumption: Aperitivo, if you’re not familiar, is a brief session of light cocktails and snacks that happens after work and before dinner. I am all about that pre-dinner food and drink hang, which is why I have my own signature aperitivo spritz that I’ve affectionately called the Lil’ Ripper.Yeah, it’s a cute name, I know. And as advertised, it’s both little and rip-able, the kind of cocktail you can drink at just about any time of day. But above all else, the appeal of the Lil’ Ripper is that it’s easy as hell to make. You don’t need a shaker or a strainer to make the damn thing. Here’s how to get it done:Smack a few thick 2\" or 1 1/2\"  ice cubes with the back of a big metal spoon until they crack into large shards. You can hold them in your hand or wrap them in a kitchen towel to do this. Cracked cubes are beautiful because of their irregular shapes, and I like my cocktails to look as good as they taste. If you don’t have a 2\" or 1.5\" silicone ice cube mold, get one! Making ice in these is the easiest way to up your at-home cocktail game.Fill a glass—something small and taller than it is wide, like a juice or Collins glass—to the top with your cracked ice. Pour 3 oz. soda water into the glass, followed by 2 oz. dark, sweet amaro like Cynar, Averna, or Meletti. Top it with a squeeze of fresh lemon juice, a strip of lemon peel, and a fat green olive to snack on after you drain the glass. If you’d like to give it a shake or a stir to redistribute the amaro, be my guest.And that’s the Lil’ Ripper. It’ll take you about 43 seconds to make your first and maybe 39 seconds to make your second once you’re familiar with the procedure. When you drink it is totally up to you. They’re just as good in an aperitivo setting as they are after dinner. Just as appropriate after lunch as they are at two in the morning. The Lil’ Ripper’s drinkability is unwavering, just like my dedication to the aperitivo lifestyle.Explore Bon AppétitIt's That SimpleCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-28", "author": ["Condé Nast", "Alex Delany"]}