{"id": "2401a4acf3ef84ca3ca2962832b59a39", "url": "https://www.bonappetit.com/story/family-dinner-the-fly", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Eat Your Feelings—They’re Delicious! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEat Your Feelings—They’re Delicious!The way to Carla Lalli Music’s heart? Through family dinner, of course.By Carla Lalli MusicDecember 12, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEvery other Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I had dinner with my family on Sunday night at The Fly, one of our favorite places to eat as a foursome. What’s special about The Fly is the universal excellence of everything on their very succinct menu, which means you can tell your server that you want “one of everything.” Shortly after ordering, our smallish square table was 100 percent occupied with a whole chicken, a chicken sandwich, roasted potatoes, fries, long-cooked greens, a big salad, white sauce and hot sauce, a couple glasses of wine, water glasses, and a napkin dispenser.Like I said, everything is worth getting, and it’s never not good. The Fly is one of those places where both my teen and my 10-year-old are into all the dishes equally, and we clean our plates. I don’t even mind sharing a single sandwich, and I hate sharing. The wines are great and the music is groovy and the vibes are chill. And there I was, passing a potato to my younger son so he could dip it in the chicken juices on the platter, our elbows knocking and knees touching because that’s how close together we were, and I was suddenly filled with immense gratitude and joy. Our table was literally overflowing, we were hungry and we were being fed, and we had each other.Want this letter before it hits the website? Sign up for our newsletter!Don’t forget the juices under that whole chicken!\nPhoto by Emily SchultzIt’s very possible I’m feeling sentimental. I’ve been having a lot of this lately. My firstborn is turning 16 in a couple of weeks, and if you’re wired like I am, that translates to “he’s basically about to leave for college.” My other son is on the precipice of some very hardcore tween-dom, which means any book I read out loud to him could be the last, and soon he will no longer let me soothe him with back rubs at bedtime.What we have, still, is family dinner. Not every night, but definitely every Sunday, and as it was for me growing up, we do most of our communing over a meal. People talk about eating their feelings. For me, eating is the feeling—we are safe, we’re together, we have what we need, and our life is filled with pleasure.The flip side of this, of course, is that what I’ve got isn’t true for everyone. This time of year can be brutal. The pressure to hemorrhage money during the “shopping season” debases what the holidays should or could be about, and cruelly penalizes those with less to spend. It took a perfect meal to remind me of what’s really on my list. This year I’ll donate again to No Kid Hungry and Southern Poverty Law Center. I’ll cook all night with my mom and my sister on Christmas Eve for our annual Feast of Seven Fishes celebration. I’ll get a new toy for our cat, Peggy, who we adopted on Christmas eight years ago. I’ll try not to order so much stuff online, but I’ll also tip our UPS guy. And I’ll convene my micro family again for dinner every Sunday, because we have important feelings to do.Explore Bon AppétitCarla NewsletterRead MorecookingMy Fridge Is Full of Fat, What About Yours?By Carla Lalli MusiccultureFat Is Good, Headphones Are Bad—And More Essential Cooking Rules From Carla Lalli MusicBy Carla Lalli MusiccookingCook Beans Once, Solve a Week’s Worth of Dinner ProblemsBy Carla Lalli MusiccookingThe Magical Trick That Makes Every Roast Chicken Twice as NiceBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-12", "author": ["Condé Nast", "Carla Lalli Music"]}