{"id": "2405878040df5190f1436f6caf2da184", "url": "https://www.bonappetit.com/recipe/stuffed-mussels-with-pepperoni-rice", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Stuffed Mussels With Pepperoni Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStuffed Mussels With Pepperoni RiceBy Angie Rito and  Scott TacinelliOctober 27, 20213.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintAngie Rito and Scott Tacinelli of Don Angie in NYC found their inspiration for this dish in paella and the stuffed shellfish dishes common in Italian American restaurants around New York. “There’s a great mussel flavor in every bite because you make a quick stock from the mussels while they cook and use that same liquid to cook the rice,” they write in their book Italian American: Red Sauce Classics and New Essentials: A Cookbook (out now!). Pepperoni—that familiar star of late-night dollar-slice pizza everywhere—stains the rice a deep red and gives it a nostalgic flavor. Letting the rice sit for a full 20 minutes after coming off the heat is key to finishing the cooking process. This is a great group project—gather around the table to clean, shell, and fill a mountain of mussels and you will be rewarded with a perfectly poppable party-ready bite—or 10.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonCitrus Juicer$7 At AmazonSlotted Spoon$13 $10 At AmazonMicroplane Grater$16 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients8 servingsMussels1cup extra-virgin olive oil6garlic cloves, crushed6sprigs parsley5lb. mussels, scrubbed, debearded1cup dry white wine⅛tsp. crushed red pepper flakesRice and Assembly⅓cup extra-virgin olive oil6oz. pepperoni, finely chopped1oil-packed anchovy fillet, finely chopped3Tbsp. tomato paste1Tbsp. plus 1 tsp. dried oregano1medium onion, finely chopped1garlic clove, finely grated2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt1cup dry white wine1½cups short-grain rice (such as arborio or Calasparra)¼cup fresh lemon juice⅛tsp. sugarStore-bought aioli and lemon wedges (for serving)PreparationMusselsStep 1Heat oil in large heavy pot over medium. Cook garlic, stirring often, until golden, about 2 minutes. Add parsley, mussels, wine, and red pepper flakes; stir to coat. Cover and cook, stirring halfway through, until mussels open, about 4 minutes. Uncover and transfer opened mussels to a large bowl with a slotted spoon. If any mussels are still closed, cover pot again and cook until opened, about 1 minute more. Transfer open mussels to bowl; discard any that remain closed. Chill mussels until ready to assemble. Strain cooking liquid; discard solids. Measure out 3 cups mussel stock; add water if short. Reserve pot.Rice and AssemblyStep 2Heat oil in reserved pot over medium-low. Cook pepperoni, stirring often, until some fat has cooked out and oil is bright red, about 4 minutes. Add anchovy, tomato paste, and oregano. Cook, stirring often, until tomato paste darkens slightly, about 3 minutes. Add onion and garlic and cook, still stirring often, until onion is soft, about 4 minutes.Step 3Increase heat to medium-high and add wine. Cook, stirring, until wine is evaporated, about 3 minutes. Stir in rice and reserved mussel stock. Reduce heat to medium-low and cook, uncovered, stirring often, until stock is absorbed and rice is al dente, 20–25 minutes.Step 4Remove pot from heat and cover with lid; let stand 20 minutes. Uncover and stir in lemon juice and sugar. Chill pepperoni rice at least 30 minutes.Do Ahead: Rice can be made 3 days ahead. Let cool, then cover and chill.Step 5Place racks in upper and lower thirds of oven; preheat to 400°. Line 2 large rimmed baking sheets with lightly crumpled foil (to help keep mussel shells upright). Remove top shells from mussels (pry apart and twist at the hinge). Using a paring knife, loosen meat from bottom shells. Spoon 1 Tbsp. pepperoni rice over each mussel and shape into a mound. Divide mussels, stuffed side up, between baking sheets. Bake until warmed through, 5–8 minutes. Remove from oven; heat broiler.Step 6One baking sheet at a time, broil mussels on upper rack until tops are golden brown, 5–7 minutes (watch closely; broilers vary dramatically in power).Step 7Transfer mussels to a platter and drizzle with aioli. Serve with lemon wedges for squeezing over.\"Reprinted with permission from ‘Italian American’ by Angie Rito and Scott Tacinelli. Copyright 2021. Photographs by Christopher Testani. Published by Clarkson Potter, an imprint of Penguin Random House.\"\n\nBuy now on Amazon or Bookshop.orgHow would you rate Stuffed Mussels With Pepperoni Rice?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleIt's ridiculous. A basic and reader-friendly feature such as reading reviews should not be an IT challenge. It's how BA will lose readers. I can open this review but not the one for stuffing biscuits from the October issue. I won't make without reading others' experiences making them.zoomite11/1/2021Regarding the readers inability to read reviews, Bon Appetit's website has been awful for months. I am a 30 year subscriber and user of Bon Appetit. I have over 700 saved recipes and I am no longer able to view my \"folders.\" Recipes are only listed in no specific order now. I've reached out to the IT department several times with no resolution. So.....no wonder you cannot read reviews. Hopefully the website will get it together. The New York Times recipe website is looking better and better.Joni10/31/2021Why aren't the reviews showing?  Makes me nervous to try the recipe. AnonymousBoston10/31/2021Explore Bon AppétitMusselShellfishSeafoodRiceRice & GrainsItalian AmericanAmericanappetizerPartyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-27", "author": ["Condé Nast", "Angie Rito", "Scott Tacinelli"]}