{"id": "240934339f8a56dfa09c00b316d2da33", "url": "https://www.bonappetit.com/story/vitaminwater-best-gossip-girl-character", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Why Was There So Much Vitaminwater in ‘Gossip Girl’? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOkay, But Actually Vitaminwater Was the Best Character on ‘Gossip Girl’There were times when Vitaminwater’s product placement outshone every human on the show. These are a few of them.By Emily SchultzNovember 9, 2018FacebookTwitterEmailFacebookTwitterEmailI have a confession to make. Although, I don’t really think it’s a confession—that word has a negative connotation. And I’m not ashamed of this fact about me at all.I still watch Gossip Girl. A lot.I watch it so much I could tell you the dress Serena wore in season 4 when she goes to the ballet (it’s Giovanni Rufino). Or how Blair’s mom was a different actress in the pilot episode (In the pilot, Florencia Lozano played Eleanor, but Margaret Colin took the role for the next 6 seasons). But the thing I’d love to focus on, the thing I think about incessantly, is how much Vitaminwater® product placement happens in this show. It’s practically a tertiary character.I admit that looking back on Vitaminwater now through our current, kombucha-colored glasses is a bit confusing. But at Gossip Girl’s peak, Vitaminwater was living its best life. In 2007, Glacéau sold the “water” to Coca-Cola for $4.1 BILLION dollars, which is approximately how much money Blair and Chuck spent on flights to get Carter Bazen and Georgina Sparks “out of New York.”Pan to me, a 15-year-old in suburban New Jersey rocking a denim miniskirt and an  Abercrombie t-shirt begging my mom to buy cases of the “XXX” flavor, aka acai, blueberry, and pomegranate. Vitaminwater had a deal in place with The CW, which aired the best teen dramas of the late 2000s: Gossip Girl, One Tree Hill, and the 90210 reboot. And this teen girl was the target audience. I needed the Blackberry they were BBMing on, the Dooney & Bourke wristlet they were carrying lip gloss in because that’s all that would fit in there, and the Vitaminwater they were sipping (or not sipping, did anyone even ever drink it on camera?) The product placement was blatant—and very, very effective.I’m not going to take credit for dreaming up this Gossip Girl-Vitaminwater conspiracy (Gawker can). But it’s been in my subconscious ever since I saw a party full of people clad in all-white sip pomegranate Vitaminwater in the season 2 premiere. And I know I’m not the only one. These are some of my favorite times Vitaminwater outshone every human character in Gossip Girl.Season 2 Episode 1, “Summer, Kind of Wonderful”The setting: an end-of-summer shindig in the Hamptons. Guests are supposed to wear all white, aka “The Vitaminwater White Party”—this was actually what it was called. They essentially replaced Diddy with a bottle of bright pink VitaminWater. Cool move.A lot to think about here: First, these are affluent Manhattanites escaping the Upper East Side for the Hamptons. They...don’t need their parties sponsored. It’s not Veuve Clicquot or Voss water–two beverage brands often associated with luxury. It’s a fluorescent liquid that comes in a plastic bottle. Alright.Another thing. This show had no problem showing 15-year-olds getting drunk in the back of limos on school nights, so why does it seem like this party is completely dry? The Vitaminwater bars are stocked with Vitaminwater only. No vodka to spike it. No quirky glasses to hold against their completely white ensembles. Nope. Just those clunky plastic bottles.Season 2 Episode 3, “The Dark Night”Vanessa, the most hated character other than Jack Bass, is a 17-year-old who lives in a studio apartment in Brooklyn and homeschools herself. Makes total sense. When she’s not filming documentaries and talking about how much she hates the Upper East Side, she’s working at various coffee shops. In this episode, she and Nate are sitting at a coffee shop that just so happens to have an entire Vitaminwater-stocked mini fridge. This isn’t that crazy to me; it’s just great that even the most hated character gets her own screen time with the VW. Her favorite flavor was probably Rise, which is like a watery, knock-off Sunny D. (No one liked Rise.)Season 2 Episode 10, “Bonfire of the Vanity”If you don’t think this is simply ICONIC, please delete my number. Not only is a 15-year-old violently hungover to the point of needing glasses and a floppy hat inside of a café, but she’s conveniently sitting next to a TOWER OF VITAMIN WATER!!! THERE IS NO CAFE IN AMERICA THAT WOULD CASUALLY HAVE A PYRAMID OF DRINKS AT A TABLE! Then to take it a step further, she even orders REVIVE. Genius marketing. Everyone had a go-to flavor. Like I mentioned before, mine was always “XXX”.Season 4 Episode 21, “Shattered Bass”VITAMIN WATER. YOU DID NOT NEED TO FLEX THAT HARD!!! Here we have Eleanor and Cyrus (Blair’s mom and stepdad for those who aren’t on a first name basis with the cast), coming back from Paris to throw Blair and Louis an engagement party. They’re drinking tea and figuring out the plans for this party when BAM! There’s an incredibly normal and casual display of five Vitaminwater bottles set up on their coffee table as part of the Vitaminwater Design Competition. This competition did happen outside of Gossip Girl, in our very real life here, but it goes completely unexplained in the show. Cryptic!I don’t remember when I stopped craving XXX Vitaminwater, but now it serves as a marker of time; a time when jeans sat extremely low on your hips, Penn Badgley was at the height of his career, and wellness wasn’t a buzzword. It may not be my drink of choice anymore, but like that wristlet at the bottom of my childhood closet, it holds a special place in my heart.Explore Bon AppétitPop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Emily Schultz"]}