{"id": "241f78a00a84d0e1be68d29a7ff202c3", "url": "https://www.bonappetit.com/story/strawberry-raspberry-fools-newsletter", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Cook the Cover! It’s Foolproof | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCook the Cover! It’s FoolproofNew recipes from our simple issue, food news, and one corny food feud from the week.By Alex BeggsJuly 13, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cook the coverOur August issue came out this week (subscribers should start getting it next week. Please subscribe, for the love of god)! It’s our annual “simple” issue, where the recipes keep it under 10-ish ingredients. On the cover: strawberry-raspberry fools. You can guess where the name comes from. It’s foolproof! Macerated berries, softly whipped cream, layered in cute-ass cups. Make it!Get the recipe: Strawberry-Raspberry FoolsThe Price of FishIn a luxurious turn of events, Christina Chaey and I attended a special legacy dinner at Per Se this week, which brought back four alumni chefs from the Thomas Keller restaurant, ten years after they cooked there. JuneBaby’s Edouardo Jordan made tiny pimiento cheese tartlets topped with perfectly circular cutouts of truffle and I’m going to have to live with that the rest of my life. Daisy Ryan, now the chef of Bell’s in Los Alamos, served a ridiculous va-va-voom steak tartare under a bonfire of julienned truffle sticks, “because why not,” she said. The power of positive thinking! And we met Don Pedro, the nickname for one of the staff member's uncles—actual name Peter—who was in town from England, where he is a courier of...human organs. He told us a riveting tale of transporting a woman’s brain in a bucket recently. Yesterday, he’d had dinner at the Olive Garden in Times Square, bought a few shirts at Tommy Bahama, saw Chicago on Broadway, and then had a Budweiser and “contemplated the price of fish.” (British humor.) But tonight, he was dining at Per Se.Want this letter before it hits the website? Sign up for our newsletter!NYC100Did you see our big NYC100 list this week? I contributed my undying love for Old Town Bar, one of the only places in this city to get your Buffalo wings delivered by dumbwaiter. On a recent hot afternoon, I stopped in for a lemonade. LEMONADE. It was great. Is your favorite place missing? Well, chill out, and have some lemonade: We’ll be updating it every month.Photo by Alex BeggsDon’t lick the ice creamMaybe you saw the news this week that a Texas teen licked the smooth top of a gallon of Blue Bell’s Tin Roof ice cream before returning it to the grocery-store freezer shelf, horrifying the nation and spurring saliva-slinging copycats. In reality, the probability of getting the licked ice cream and catching any germs from it was quite low. (Unless she had mono—teens!) And it’s all kind of ironic considering BB had a big listeria scandal a few years back. A classic case of out-of-proportion outrage. I shudder to think what my library books have been through, which is why I read with rubber gloves on. But as a Texan, I believe we need to respect our natural resources, the proudest being Blue Bell, so yeah, don’t lick it ’til you get home. A motto to live by.Ashley BatzJoin the Bean ClubOur workplace likes to order things as a family—usually cases of wine. But this week, Chaey made an order from Rancho Gordo beans (read about their AMAZING BEANS in this New Yorker article) and everybody jumped in the bean pot. Climbed the beanstalk? Sarah Jampel got vaquero beans, which have a black-and-white Dalmation look. A unique bean for a unique bean! Emily Schultz ordered green French lentils and Marcella beans (my favorite), “because I’m a basic bean,” she said. Easygoing Aliza Abarbanel went with unfussy yellow eye beans. Chaey got the yellow Indian beans “because Amiel told me to,” but it makes sense to me—an eye-catching, stylish bean!Spiced bird“All he needed was a bath.”Unnecessary food meme of the weekUnnecessary food feud of the weekEva KolenkoI made an awesome recipe for corn pudding from Nicole Rucker’s new cookbook, Dappled, and it inspired a variety of reactions. Aren’t corn desserts universally great? Not to Chris Morocco, who frowned while angrily whisking a meringue. “I’m cool with corn flavor, like a corn muffin,” he said, “but the presence of whole, sweet corn kernels I find upsetting.” At another station in the Test Kitchen was Nicole Rucker herself! Making a cobbler for our Instagram stories. “PRO!” she exclaimed, “It’s naturally sweet!” With her recipe, she added, corn’s natural starch can thicken the pudding without cornstarch. Impressive! I ran into Julia Kramer in the hallway—thoughts on corn desserts? “People are always trying to make that a thing,” she laughed. Molly Baz will accept corn ice cream, and “corn byproducts,” like cornmeal, but she’s also anti-kernel. Carla Lalli Music, same story: “Kernels belong on the cob ONLY.” Adam Rapoport said: “Skeptical.” But others were on my side. Andy Baraghani went on and on about Jeni’s corn ice cream with blackberries, as if he was selling it on QVC. Those in favor: Christina Chaey. Emily Schultz. Aliza Abarbanel. THANKS, TEAM. And Amanda Shapiro “loves” corn dessert, but “prefers a rice dessert.” Wait, what?Another great Nicole Rucker recipe: Blueberry and Corn CrispExplore Bon AppétitBeggs NewsletterRead MorerestaurantsThe NYC100 - March 2020 EditionBy The Bon Appétit StaffcultureA Summer Mood BoardBy Alex BeggscultureThere’s a Snow Cone in the Weekend ForecastBy Alex BeggsrestaurantsThe Hype Ice Cream I’m Willing to Wait in Long, Near-Rioting Lines ForBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-13", "author": ["Condé Nast", "Alex Beggs"]}