{"id": "2423da0e4370688e9b6b3adcf0e24cf8", "url": "https://www.bonappetit.com/story/the-sussmans-restaurant-memes", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "@thesussmans' Restaurant Memes Say What No One Else Is Saying About the Hospitality Industry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants@thesussmans Says What No One Else Is Saying About the Restaurant Industry—In MemesThe hilarious and bleak genius hidden in a bunch of memes about farting in the walk-in freezer and cleaning grease traps.By Alex BeggsJuly 9, 2021FacebookTwitterEmailIllustration by Alvaro DominguezFacebookTwitterEmailI’ve been watching the new Hemingway doc, and at one point, an eloquent old academic says something like: In his fiction, Hemingway told more truth about the world than in his journalism.…And I’m feeling the same way about @thesussmans, an Instagram meme account about the restaurant industry. It belongs to brothers and chefs Max and Eli Sussman, and pre-pandemic, they used it to promote Samesa, their shawarma restaurant in New York City, and other projects. But when restaurants shut down last March and Eli had some time on his hands, he started creating and posting memes in his Instagram stories that found a way to laugh at the haphazard, ruinous end of the restaurant industry as we knew it. A little cloud broke in the always thundering internet sky and eked out some light upon us all.Instagram contentThis content can also be viewed on the site it originates from.A raging semitruck is about to crush a guy on a dinky red motorcycle.The truck [landlords/second wave/total economic collapse]The guy on the motorcycle [biz owners]The motorcycle [PPP]Eli was that guy on the motorcycle. Samesa’s landlord was unwilling to give them a break, and the restaurant had to close permanently last year on September 27, 12 days after that post.“I think [the memes] were articulating my confusion and anger and frustration over, at first, maybe my own personal situation with the restaurant,” Eli told me, “but it mirrored so many other people’s situations too.” At least 110,000 people. That’s how many restaurants closed in 2020, according to the National Restaurant Association. Meanwhile, Max was launching a pizza pop-up—it’s incredible, by the way—in Ann Arbor, Michigan. The memes are (mostly) all Eli, with input from Max. Eli told me he spends around 30 to 40 minutes a morning making them.Memes that cover: the government absolutely abandoning restaurants during the pandemic, Tom Colicchio saving the day, stoner line cooks having existential conversations about Japanese knives, shitty customers tipping badly and spouting mask-less orders (pre-vaccine), porters keeping the restaurant from complete and utter destruction every night, the mythmaking and megalomania of Michelin-chasing fancy-boy chefs, LOTS of Die Hard references, Eleven Madison Park going vegan, getting reservations at Carbone, the futility of the restaurant industry, and how messy cocoa powder is.It’s brilliant. Absurd. Deranged. Goofy. Wonderful. Do yourself a favor and spend a few minutes that will inevitably turn into an hour watching his saved Instagram stories. Let the memes wash over you like an industrial sanitizing Hobart dishwasher.Instagram contentThis content can also be viewed on the site it originates from.As the memes took off and 5,000 more people began following the account, Eli started getting DMs from chefs, servers, dishwashers along the lines of “I feel seen.”“I was trying to just provide a bit of levity in an incredibly stressful situation,” Eli said. “Everyone in the world was probably the most stressed-out they’ve been this past year or so. And so, at the most simplistic level, I was just trying to have a little bit of fun and hoping that people would read them and think, Oh, this is a nice distraction from my incredibly shitty day.”Instagram contentThis content can also be viewed on the site it originates from.Thank you, Eli, it is a nice distraction from several shitty days. But I don’t think he’s giving himself enough credit. Humor is a hell of a medicine, and it was hard to find last year. Someone reminding you that life is absurd and silly—even when it’s incomprehensibly terrible—can pull you out of a quicksand grief trap.“It has been very therapeutic for me to make them,” Eli admitted.He gets meme ideas, check-ins from friends (“are you…okay?”), and fan mail in his DMs now. “There have been people that’ve been in toxic workplaces, or they’ve had a year where they maybe lost their job, or they had to work all through the pandemic, and they had DM’d me and said, ‘I like waking up every morning and scrolling through your memes. It makes me realize why I like being a part of this crazy industry—or why I decided to leave this crazy industry.’”I also sense, at the core of the memes, a narrator whispering: This is a brutal, often terrible industry with razor-thin profit margins, sexual harassment, classist hierarchy, unreliability, low wages, awful hours, and physically taxing conditions. Run away.Instagram contentThis content can also be viewed on the site it originates from.“I would say enter at your own risk, but try to gather as much information as you can first and see if this is really, actually how you want to be spending several years to the rest of your life,” said counselor Eli. “The point [of the memes] isn’t to demonize everyone and everything in the entire industry, but it is really hard when you think about how much easier your life would be if you didn’t go into this industry.”And yet.“I love restaurants more than anything. I also take myself too seriously and treat this hospitality, restaurant world as my religion. A lot of [the memes] are just making fun of myself. I have Japanese knives, and I probably spent too much time thinking about them and talking about them. I definitely really care about what font restaurants use on their menus. I’ve had discussions about how menus are not cohesive and don’t make sense from start to finish, and how certain places tell a story with their menu and others don’t. I subscribe to all of this stuff that I’m mocking.”Sometimes followers DM the account to guess which xanthan gum–loving chef a meme is referring to. Eli replies: “No, that’s me.”@thesussmans gets to make fun of some restaurant world news in a way we can’t here in the ramp-and-rhubarb-obsessed food media (also made fun of in good measure on the account, thank God). When Eleven Madison Park announced it was going completely vegan, the news folk covered it pretty straightforward, Wow, wouldya look at that. @thesussmans posts: “EMP goes meatless. Sous chefs be like: N-U-T-R-I-T-I-O-N-A-L Y….” (Image: The chef is googling “nutritional yeast.”) I loved that one.Instagram contentThis content can also be viewed on the site it originates from.After another story broke about a chef accused of sexual harassment, @thesussmans had the perfect meme: a huge house fire with a guy tossing a beach bucket of water on it. “Social, economic, gender, and racial disparities and issues within the hospitality industry” [the fire] “We’re going to commit ourselves to try a lot harder” all-staff emails from management [the puny bucket of water]. Bleak, but true. Eli followed up that meme with a guy facing an exploding five-pound bag of cocoa powder for balance.Memes don’t pay the bills, though, and unless @thesussmans got a sweet Fashion Nova sponsorship, Eli was still a restaurateur. After months of wondering what he’d do next, Eli was able to resurrect Samesa in a prime lunch spot in Rockefeller Center, which opened this spring. On Instagram, he’ll post the occasional food porny chicken schwarma wrap or one of Max’s pizzas.“I’m trying to get people to remember that, yeah, I make memes, but I own a restaurant and it would be so cool if you came and ate food there,” he said. I wondered if he saw any customers who came in because of the memes. “I would not say that Samesa is experiencing an uptick in business due to the memes. That would be great. People definitely haven’t been swinging by to see the memes in person.” I think there’s still time.Explore Bon AppétitRestaurantsInstagramCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-09", "author": ["Condé Nast", "Alex Beggs"]}