{"id": "24310255a0b9b9d15958d89aaaacb90f", "url": "https://www.bonappetit.com/story/borani-kadoo", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Borani Kadoo is an Afghan and Perisan Dish of Roasted Squash/Pumpkin With Yogurt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBorani Kadoo Is the Perfect Combo of Sweet Squash and Garlicky YogurtBorani is your template for making any cooked vegetable much more delicious.By Shayma Owaise SaadatMarch 5, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My youngest sister recently reminded me that our paternal grandmother, who we called Mader (mother in Dari), kept a specific journal filled with some of her special yogurt-based recipes, ranging from mint-scented cucumber raita to pumpkin borani. Borani is a cold dish composed of a roasted or sautéed vegetable paired with thick, creamy yogurt, often adorned with spices, nuts, fried onions, fresh herbs, and olive oil. Cooked and beloved in Afghanistan and Iran, borani can be served as an appetizer with bread or crackers, as a side dish, or on its own for a light meal. According to legend (and what I heard in my family growing up), the dish gets its name from the Sasanian empress Būrāndoḵt, who loved cold yogurt-based dishes so much, they were named after her as Būrānī. To this day, Afghans and Persians are passionate about yogurt-based dishes, and my Mader was evidence. Sadly, I don’t have her handwritten recipes, neither for raita nor borani, but I do remember how much she adored them.This recipe is Andy Baraghani’s version of borani esfanaj.\nAlex LauSome of my favorite borani are borani bademjaan, made with fried slices of eggplant and served with a slick of spiced tomato sauce atop the yogurt, and borani esfanaj, made with garlicky sautéed spinach stirred into yogurt. In the colder months, however, I love to prepare borani kadoo (kadoo means “pumpkin” or “squash” in Dari) with butternut squash. While the pumpkin or squash is traditionally cooked in a tangy tomato sauce for this type of borani, I find that butternut squash speaks for itself and needs no sauce. The soft sweetness of it against the cooling garlicky yogurt and the crunch of the pomegranate arils makes for a wonderful meal on its own or served alongside grilled meat. I also like to add hazelnuts in place of the classic addition of walnuts. And while borani is traditionally made by mixing the vegetables and the yogurt together, I follow my mother’s tradition of leaving the two separate when I plate it—it’s merely a matter of styling and serving and you can do whichever you prefer.To make this borani kadoo, which serves 4, start by cutting a 3–4 lb. butternut squash to separate the bulb from the neck. For this dish, you will use only the neck (save the bulb for another delicious recipe). Peel it (make sure to completely remove the white fibrous layer), halve lengthwise, and slice into ½\"-thick half-moons. Heat your oven to 450° F. Lay the prepared butternut squash on a rimmed baking sheet and toss with ¼ cup neutral oil (I like to use sunflower) and season with salt. Roast in the lower third of the oven for 15–20 minutes, turning the pieces of butternut squash halfway through, until they’re cooked through and starting to char. Remove butternut squash from the oven and allow to cool slightly, about 15 minutes.While the butternut squash is roasting, place a small frying pan with 2 Tbsp. olive oil on medium-high heat. Add 2 garlic cloves, finely chopped, and stir till fragrant and slightly golden, about 90 seconds. Transfer sautéed garlic and oil to a medium-size bowl, and whisk with 1 tsp. kosher salt and 1½ cups full-fat Greek-style yogurt. You can also skip cooking the garlic—grate the cloves directly into the yogurt. Chill in the refrigerator (this can be prepared a day ahead).Using a spatula or spoon, spread yogurt evenly in a serving dish with a wide base. Arrange butternut squash on top. Sprinkle with ½ cup pomegranate arils, 2 Tbsp. toasted and roughly chopped hazelnuts, and 1 Tbsp. pul biber. These coarse chile flakes, also known as Aleppo pepper, are found in Turkey and Syria and have a moderate kick of heat and a slight tang. (You can use sweet or smoked paprika if you don’t have pul biber in your pantry.) Drizzle with olive oil and scatter over fresh dill or whichever fresh herb you love. Scoop it up with warm bread or enjoy as is.Borani is a very versatile dish—try creating your own versions with whichever vegetable you love throughout the seasons. After all, Mader had an entire book dedicated to these yogurt-based dishes—she must have been onto something!Shayma Owaise Saadat is a Toronto-based writer whose work focuses on food, culture, and identity. She is also a food stylist, photographer, and recipe developer.Explore Bon AppétitIt's That SimpleSquashButternut SquashYogurtPersianMiddle EasternRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-05", "author": ["Condé Nast", "Shayma Owaise Saadat"]}