{"id": "244b2165b31abdeee4de75b0b109015e", "url": "https://www.bonappetit.com/recipe/pork-and-shiitake-congee", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Pork and Shiitake Congee Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork and Shiitake CongeeBy Betty LiuSeptember 11, 20214.9(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintCongee, a quintessential comfort food with many regional variations across China, is an ideal dish if you’re feeling under the weather or want to prepare a one-pot meal with leftovers that will never disappoint. Cooked on a stovetop in water or broth until the rice breaks down and turns the liquid into a thick, creamy porridge, congee can take hours to prepare. So Betty Liu came up with a clever trick for this congee recipe: Rinse the rice and freeze it overnight. The frozen rice breaks down quickly, cutting your cooking time in half. Since the heart of the dish is the rice, take care in choosing your grains. If you don't have jasmine, reach for a short- or medium-grain white rice (like sushi rice), knowing you may have to adjust the cooking time and the amount of water.You can replace that water with stock for another layer of flavor and experiment with the toppings; congee is infinitely adaptable. But keep in mind, it’s not meant to be overwhelmingly flavorful but rather delicate, nourishing, and easy to digest, so be gentle but creative with your variations. In the spring, dress a bowl up with green garlic oil and in the fall, Turkey Congee With Crispy Shiitake Mushrooms is a great way to use up the leftover turkey from your Thanksgiving meal.Editor’s note: This recipe was originally published on January 19, 2020.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSieve$18 At AmazonPlastic Bag$11.70 At AmazonSpoon$24.69 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Saucepan$60 At AmazonWooden Spoon$6 At AmazonPlate$55 At Bon Appétit MarketIngredients4 servings1cup jasmine rice or short- or medium-grain white rice4oz. ground pork1Tbsp. finely grated peeled ginger1Tbsp. soy sauce3Tbsp. vegetable oil, divided4oz. fresh shiitake mushrooms4scallionsKosher saltWhite or freshly ground black pepperChili oil (for serving; optional)PreparationStep 1Place 1 cup jasmine rice in a fine-mesh strainer and rinse in several changes of water until water runs clear. Drain. Transfer rice to a freezer-safe container and freeze overnight. If you use a plastic bag, don't toss it when you're done: Just rinse it out, let it dry, and save it for the future. (This step helps the rice break down faster when you’re cooking it, which dramatically reduces its cooking time. If you don’t have time to freeze your rice, that’s okay; you’ll just cook it longer in step 8.)Step 2Prepare your ingredients: Mix 4 oz. ground pork, 1 Tbsp. finely grated peeled ginger, and 1 Tbsp. soy sauce in a medium bowl and let sit 10 minutes. Trim woody ends of 4 oz. shiitake mushrooms, then cut into thin slices. Trim root ends off 4 scallions and thinly slice crosswise.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat 2 Tbsp. vegetable oil in a large saucepan over medium-high. Add sliced mushrooms and cook, stirring occasionally, until golden and crisp, 6–8 minutes.Step 4Reduce heat to medium-low, add half of sliced scallions (reserve remaining scallions for serving), and cook, stirring, until scallions are aromatic and fragrant but not browned, 1-2 minutes. Transfer mushrooms and scallions to a plate.Step 5Heat remaining 1 Tbsp. vegetable oil in same saucepan over medium. Add marinated pork and cook, stirring once, just until it turns from pink and translucent to lightly browned and opaque, about 1 minute. Transfer pork to plate with mushrooms and scallions. It won’t be fully cooked through but that's okay—you'll return it to the congee later on.Step 6Add 7 cups water to saucepan and bring to a boil over medium-high heat. Add frozen rice (or unfrozen rice, if using) and return to a boil, stirring to prevent sticking. Scrape up any brown bits that have stuck to the bottom of the pan—there's great porky flavor there! Reduce heat to low and simmer, stirring occasionally, until thick, porridge-like, and rice has broken apart, about 20 minutes for frozen rice, and 1½ hours for unfrozen rice. If you are using a short- or medium-grain white rice (as opposed to jasmine), this time might vary.Step 7Stir in pork, mushrooms, and scallions and let simmer, stirring occasionally, until flavors have melded, another 5 minutes. Check the texture: If you want a thinner congee, add more water. If you want a thicker, more oatmeal-like texture, continue to cook, stirring frequently, until it reaches the desired consistency. Season soup with kosher salt and white or black pepper.Step 8Divide congee among bowls. Top with reserved scallions and chili oil, if using.How would you rate Pork and Shiitake Congee?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleDo not underestimate the simplicity of this recipe. It is SENSATIONAL. It is so comforting, nourishing, and flavorful. I have made it every week (sometimes multiple times) since I discovered it. If I don't have it every week, there is a congee-shaped hole in my heart. The key is to cook the various ingredients separately, as the recipe instructs. When I'm pressed for time I just cook everything in one go and it is not the same. It is also equally delicious with beef or extra-firm, crumbled, crispy tofu. You need this in your recipe rotation!SashaJersey City, NJ3/3/2022To Anonymous who changed the recipe and then said it was a miss. Go back and try it the way it was supposed to be made.Chuck F.Palo Alto, CA1/28/2022I don't usually alter recipes the first time making them, but in this case, it made sense. Ground pork didn't sound too great to me, so I got a cheap pork tenderloin and sliced it thin. I also added garlic to the marinade and used 8oz of pork and about 10 oz shitake and oyster mushrooms, and cooked them in half sesame oil, and half toasted sesame oil.\n\nI cooked it the long way, with about 3/4 chicken stock and chicken bone broth, and 1/4 water. It absolutely needed the chili oil. I don't think it's optional at all. I also topped it with sesame seeds. Even so, this recipe was kind of a miss. It just wasn't satisfying enough.AnonymousSan Diego, CA1/24/2022This is a fantastic recipe, and super easy. Congee is very much a blank palate, and these ingredients go incredibly well together. The freezing of the rice makes it quite simple, and I agree with the other reviewers... add a bit more pork ;) RayLondon, UK11/14/2021This was fabulous. We made it the long way without freezing the rice. It turned out great. There are only two of us who are going to eat it so we are looking forward to having it around for a couple of more days.  I would consider adding more pork next time. RudreshMontclair, NJ10/4/2021I don’t know why this is so good, but it is. I also doubled the pork (and the marinade), but otherwise followed the recipe. Easy and tasty. I rarely cook the same thing twice, but I keep thinking about this one so I probably will. Sunny10/1/2021I also make mine with extra pork and mushrooms and I like to use dashi instead of water for some wonderful extra umami flavor. Torn nori also makes a tasty additional topping for your bowl.JenPhiladelphia 9/19/2021Great dish, especially as comfort food. Have made it twice now & after reading previous comments, I can agree that adding more pork (I usually do 1lb) & mushrooms (8-12oz) is a must. Instead of adding all 7 cups of water, do half water & half stock/broth. I top it all off with kimchi, sesame seeds, & sambal oelek. I love it even more because there are always leftovers after initially serving my boyfriend & I. Making it again tonight & will try adding a bit of miso.Connor DChicago, IL4/20/2021I love this dish!  I bet it was used for kids with sick tummies because it is so soothing...I like spicing it up with some jalapeño and chili oil at the end.  I tried doubling the pork and mushrooms but found it was too much pork.  I do like the extra mushrooms, though.  Yummy.Ruthie1/2/2021This is a great recipe. After making it a few times, I decided I like it best by doubling the amount of the pork mixture and using half chicken stock/half water instead of the full 7 cups of water. (I've tried all stock and thought it was too rich.) Also, I once forgot to freeze the rice ahead of time and froze it for only 1 hour--and it still cooked up super fast. Will keep coming back to this recipe!s92359Arlington, VA12/8/2020Tip for anyone that has a japanese rice cooker like I do. I do 1 cup rice (soaked in water for an hour) to 4 cups liquid and usually split between water and chicken broth with slices of ginger and lemon peel thrown in to amp up the flavor. Some of the nicer rice cookers have a porridge setting which makes congee EASY PEASY to make. It yields a thicker congee than this recipe, but is oh so delicious. Love this topping suggestion of shiitakes and ground pork. h.wongChicago, IL9/15/2020I highly recommend adding miso to boost the flavor a bit. I love this recipe and find myself craving it often!AnonymousMinneapolis4/16/2020I make this recipe at least once a week (my body now craves it.) I even do it without pork and it's still flavorful and delicious. Would definitely recommend!!!AnonymousNew York, NY3/26/2020I've made this recipe twice and it was delicious every single time. It's flavorful, comforting and easy to make. It was annoying to freeze the rice the first time, but I decided to freeze a ton of rice to have for when I really want congee. \nThe second time I made this, I made two batches, one with pork and one without for my vegetarian husband. I made the maple/soy tofu recipe (also from BA) and added that at the very end to flavor his. It was delicious. TRY this recipe. It's incredible. Anonymous3/7/2020I made the rice part of this recipe in my instant pot. I put a cup of short grain rice with 7 cups of water and 2 tsp chicken bouillon in the instant pot on the porridge setting for 20 minutes. Everything else I did as the recipe directed. This turned out to be a great after work dinner, quick and easy!MulderBmore3/1/2020Explore Bon AppétitPorridgeChineseEast AsianAsianRiceRice & GrainsGround PorkPorkMeatShiitake MushroomMushroomVegetableMainDairy-FreeNut-FreeSimmerLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-19", "author": ["Condé Nast", "Betty Liu"]}