{"id": "2451d3ecca9a6fd19d4ab646f3cf7e22", "url": "https://www.bonappetit.com/recipe/pork-shoulder-steaks-with-horseradish-mustard-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Pork Shoulder Steaks With Horseradish-Mustard Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssuePork Shoulder Steaks With Horseradish-Mustard SauceBy Chris MoroccoJune 2, 20205.0(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintIf you’re not on the pork shoulder-steak train already, now’s the time to hop aboard. Inspired by chefs like Patch Troffer, formerly of Brooklyn’s Marlow & Sons, we’ve been treating slabs of gorgeously marbled (and affordable!) pork shoulder the way we would a New York strip—by searing it to a juicy medium-rare. Don’t see pork shoulder steaks at the store? They’re there, we swear, they just might not be cut yet. Politely ask the butcher to take an even, compact hunk of Boston butt and slice it against the grain into ¾\"- to 1\"-thick slabs. Ta-da—pork steaks! Or if you like: Take one home and do it yourself.Ingredients4 servings Sauce2Tbsp. finely grated peeled horseradish or 1 Tbsp. (packed) drained prepared horseradish2Tbsp. Dijon mustard1Tbsp. whole grain mustard1tsp. honeyKosher saltSteak and Assembly1toasted nori sheet (optional)1Tbsp. ground coriander1Tbsp. mustard powder2tsp. light brown sugar1tsp. freshly ground black pepper1tsp. garlic powderVegetable oil (for grill)4¾\"-thick pork shoulder steaks (1½–2 lb.)Kosher saltTbsp. finely grated peeled horseradish or 1 Tbsp. (packed) drained prepared horseradishSpecial EquipmentA spice mill or mortar and pestlePreparationSauceStep 1Mix horseradish, both mustards, and honey in a small bowl to combine; season with salt.Steak and assemblyStep 2If using nori, finely grind in a spice mill or mortar and pestle. Mix coriander, mustard powder, brown sugar, pepper, garlic powder, and half of nori powder (if using) in a small bowl. This is your dry rub. Set remaining nori powder aside for serving.Step 3Prepare a grill for medium-high heat; oil grate. Season steaks generously with salt. Sprinkle generously all over with dry rub. Grill, turning every 1–2 minutes, until lightly charred and an instant-read thermometer inserted into the thickest part of pork registers 140°, 7–9 minutes. Transfer to a cutting board and let rest 5–10 minutes before thinly slicing.Step 4Spread mustard sauce onto plates and arrange pork over. Top with horseradish and sprinkle with reserved nori powder.How would you rate Pork Shoulder Steaks With Horseradish-Mustard Sauce?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI very seldom cook red meat so was thrilled with how this came out. I did marinate the pork stakes overnight in an impromptu mix of soy sauce, red wine vinegar, ginger and garlic. Prepped everything today with all the listed ingredients except the ground mustard. I also roasted them in the over at 325 for about 25 mins and they came out perfect. Flavorful, and tender enough to cut with a butter knife. Paired with some roasted green beans and shallots and voila!BilliePittsburgh, PA4/1/2021Delicious and easy. Didn’t have any nori. Subbed finely chopped garlic for garlic powder and some wasabi for horseradish cause I couldn’t find any at the grocery store. Seared in my cast iron on the stove with the vent on high. So fire. AnonymousSan Francisco6/19/2020Excellent! I subbed ginger for the horseradish (one of the very few ingredients I just don’t like) and it was very tasty. Smbarber85Indiana 6/13/2020This was so good!  I used both bone-in pork shoulder steaks and bone-in pork loin chops for a comparison and, while both were fantastic, the pork steaks were my group's favorite.  Cannot wait to make this again.AnonymousJacksonville, FL6/8/2020Explore Bon AppétitHorseradishHerbs & SpicesPork ShoulderPorkMeatSummerMainGluten-FreeDairy-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}