{"id": "2455e553f4b95bcd5f172bd13c5ef47a", "url": "https://www.bonappetit.com/story/peter-steckler-restaurant-diary-2", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "It Finally Feels Like There’s a Bit of Normalcy—and Hope—at the Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIt Finally Feels Like There’s a Bit of Normalcy—and Hope—at the RestaurantIn his second Restaurant Diary entry, line cook Peter Steckler shares how things are not only picking up but looking up.By Peter Steckler, as told to Allyson ReedyMarch 10, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: wine educator Kyla Peal, bartender turned brand ambassador Jenny Feldt, farmer Kristyn Leach, and line cook Peter Steckler. Here Steckler explains what life as a line cook at Denver’s American Elm has been like and why he’s hopeful for the future. Read his first diary entry here.In February, Denver restaurants got moved up to 50 percent capacity for indoor dining, and it feels like we might be getting back to real life. For so long it’s been all about the pivots in the kitchen—shifting to takeout, prepping and fulfilling meal kits—but lately we’ve been focusing more on the traditional restaurant experience. The pace in the kitchen has picked up and we’re putting out more food. It really feels like we might be getting back to normal.We did our first real prix fixe dinner since the shutdown over Valentine’s Day weekend, and even though it was freezing cold we were booked. With 50 percent inside plus the greenhouses outside, it was nuts. We got to work with some really high-end products too, like Wagyu strips, lobster tails, black truffles. It was a lot of fun to play around with those ingredients. It had been a while. We knocked it out of the park, and we got great feedback from guests.It’s definitely felt like winter here lately, but people are still coming out. It’ll be zero degrees outside, like it was all of Valentine’s Day weekend, and all 24 seats in the greenhouses will be filled. They have heaters to make them comfortable, but it’s still not as warm as eating indoors. You’ll see people bundled up in there in their winter gear. That just goes to show how much people are missing that restaurant experience. They’re braving the cold and showing up, and that is so encouraging for all of us in the kitchen.I think getting that bump up to 50 percent capacity for indoor dining had an immediate impact on morale. Even Mondays, Tuesdays, and Wednesdays, typically our slowest days, are getting busier every week, and that’s exciting. In January, when dine-in was still more restricted, the state had announced the 5 Star State Certification Program to bring restaurants up to 50 percent. We had been planning to apply for it, but now that everyone is allowed to operate at 50 percent anyway, we’re evaluating whether that certification is the right thing to do or not. For now we’re just in the trenches, concentrating on feeding the diners we have in the restaurant.As restaurant workers, we may be eligible to get the vaccine as early as March 21. I can’t wait to get vaccinated, and the coworkers who I’ve spoken to about it also seem ready to get it as soon as possible. I've felt pretty safe working in the kitchen here, but obviously having the vaccine will be huge.We have a couple of new hires now that we’re open for dine-in again, and they’re getting settled in. They’re line cooks, which is the position I started in last April. I got moved to salary fairly quick last summer, so I hope they understand that there’s room for upward mobility at this restaurant.We’re going to do another prix fixe dinner to mark the one-year anniversary of the COVID shutdowns on March 16. We’re calling it our “Duck COVID” dinner, and it’ll be, clearly, duck-themed. Four courses of duck, like deviled duck eggs and seared foie. It’s a celebration of sorts—that we made it through this really difficult year and we’re still here. Even though I know this is a tough time for so many people in the industry, I’m actually very excited about the trajectory of our restaurant and the industry in general. I feel like we’re building momentum heading into spring and summer. Honestly, I feel great.Explore Bon AppétitRestaurantsRestaurant DiariesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-10", "author": ["Condé Nast", "Peter Steckler", "As Told To Allyson Reedy"]}