{"id": "245a0b3a22bedc07b4a06f47d0615243", "url": "https://www.bonappetit.com/story/discover-lindt-excellence", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Discover Lindt EXCELLENCE | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredDiscover Lindt EXCELLENCEAwaken your senses with Lindt EXCELLENCE, and enjoy the finest tastes and textures chocolate can offer.By LINDT EXCELLENCESeptember 26, 2019FacebookTwitterEmailFacebookTwitterEmailEXCELLENCE 70% Cocoa is a masterfully balanced dark chocolate, neither bitter nor overpowering. Discover the expertise and craftsmanship of the Lindt Master Chocolatiers in every EXCELLENCE bar, blending the highest-quality cocoa beans with the world’s finest ingredients to create a rich and refined chocolate. Pairing suggestion: The underlying notes of lush berries and hints of cocoa found in Cabernet Sauvignon make it the ideal partner for EXCELLENCE 70% Cocoa.Discover More at www.lindtusa.comRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-26", "author": ["Condé Nast", "Lindt Excellence"]}