{"id": "2460534aecd008b67c9b49e0cea6b9bb", "url": "https://www.bonappetit.com/story/setting-boundaries", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "When Everything Happens at Home, I Set Boundaries to Stay Sane | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen Everything Happens at Home, I Set Boundaries to Stay SaneDo they teach personal space in virtual kindergarten?By Angela GarbesJanuary 25, 2021FacebookTwitterEmailIllustration by Marisol MuroFacebookTwitterEmailThis article is part of Healthyish at Home, our expert-sourced guide to making our living spaces feel great. We are a family who never closes the bathroom door. The habit started back when my spouse and I began dating; I resented anything getting in the way of our running conversation. Thirteen years and two children later, our bathroom door stays open for practical reasons: Someone might fall into the toilet or squeeze a tube of toothpaste onto the floor.In pandemic, my family’s world has shrunk to exist mostly within the walls of our home. My husband works at a desk in our garage, in between the chest freezer and the bicycles. While my daughter attends kindergarten on an iPad next to her bed, I work in the guest room. Being in another room is largely a symbolic gesture. The door is always open, my neck permanently craned as I half-listen for inevitable panicky cries. “My screen is frozen!”In an attempt to give each other uninterrupted hours, rather than minutes, to work (or relax, or just be), my spouse and I split the weekdays. On a recent Thursday (my day “off”), I craved a long, hot shower. I closed the bathroom door. I swayed in the steam, felt my muscles and mind start to soften. Then I opened my eyes to find the shower curtain peeled back, my daughter standing there.“Mama, can you help me with my art class video?”It would be unfair to say that my daughter is an endless black hole of need, hell-bent on destroying every boundary I set. She’s simply a child, and all children are opportunistic when it comes to their grown-ups’ attention, even during years not steeped in loss and uncertainty.A few weeks ago, as I made us frozen dumplings for lunch, she asked me, “And after we eat, maybe you want to read some Baby-Sitters Club with me before math?” I gently explained that while she is always welcome to ask me to do things with her, I am already giving her a lot of my time and energy, and I need to save some of that for myself. She listened, furrowed her brow, and nodded. I sensed her disappointment, but also her resiliency and desire to understand. Right now, clarifying our boundaries can seem awkward and selfish, but how else can we preserve our sanity and cultivate independence in our children?Lately, my daughter opts to read alone in a little nook under the stairs decorated with her drawings, trinkets, and a tiny LED lamp. The rest of our family is blocked from entry by a kind-looking but firm sentinel: an oversized stuffed unicorn. The other day, I passed the bathroom and found her on the toilet. I asked if she needed anything—a magazine, the light turned on. “No,” she replied, before asking me to close the door. “Maybe just a little privacy.”Explore Bon AppétitHealthyishessayHealthyish HomeSelf CareRead MoreculturePlant Kween Is Here to Help Our Houseplants ThriveBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Angela Garbes"]}