{"id": "246ae1c29aafd4ab7f09920639c2e5fb", "url": "https://www.bonappetit.com/recipe/warm-sorghum-salad-with-pickled-beets", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Warm Sorghum Salad With Pickled Beets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueWarm Sorghum Salad With Pickled BeetsBy Maricela VegaJanuary 12, 20214.8(5)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrint“Sorghum is an ancient African grain that came here through the transatlantic slave trade; Gullah farmers in South Carolina have continued its legacy,” notes chef Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous diaspora. “It’s nutty and chewy and good for agroecology—providing positive benefits to soil and ultimately helping to reverse the effects of climate change. In colder months I pair it with hardy greens for their high mineral content. Spicy guajillo oil, zesty pickled beets, and lush sesame crème round out a perfect winter grain bowl. No sorghum? Sub wheat berries or even brown rice in a pinch.”Ingredients4 ServingsSorghum2cups sorghum, soaked overnight, drained2sprigs thyme, marjoram, or oregano2bay leaves8cups vegetable stock or water2Tbsp. plus 1 tsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher saltGuajillo Oil4dried guajillo chiles, halved, seeds removed1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more4whole black peppercorns1cup oil from Allium Confit¼cup apple cider vinegarAssembly2Tbsp. (or more) grapeseed oil1large bunch mustard greens (about 1 lb.), coarsely chopped2Tbsp. cilantro leaves with tender stems1½cups mixed tender herb leaves (such as parsley, mint, and/or dill), plus more for serving1cup Sesame Crème1cup drained Pickled BeetsPreparationSorghumStep 1Bring sorghum, thyme, bay leaves, stock, and salt to a boil in a large pot over medium heat. Reduce heat and simmer until sorghum is tender, 80–90 minutes. Drain and transfer sorghum to a large bowl. Pick out and discard thyme and bay leaves.Guajillo OilStep 2Place chiles and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl. Pour 2 cups hot water over chiles and cover; let sit 15 minutes to soften.Step 3Drain chiles and transfer to a blender; add peppercorns, allium oil, and vinegar. Blend on high speed until smooth and bright red; season with salt. Pour over sorghum, tossing to coat. Taste and season with more salt if needed.AssemblyStep 4Heat oil in a large cast-iron skillet over medium-high. Add mustard greens a handful at a time, letting wilt slightly before adding more. Cook, stirring occasionally and adding more oil if needed, until wilted and charred in spots, about 4 minutes. Add greens to sorghum and toss to combine, then toss in cilantro and 1½ cups tender herbs.Step 5Smear Sesame Crème in shallow bowls, dividing evenly; mound sorghum salad over and top with Pickled Beets and more tender herbs.How would you rate Warm Sorghum Salad With Pickled Beets?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleExcellent - a wonderfully complex mix of flavors and textures. Definitely takes some planning to get all the parts ready at the right time, but it was worth it as a “project” recipe. We really enjoyed it.AnonymousSeattle, WA2/2/2021Explore Bon AppétitSaladSorghumRice & GrainsGuajillo ChileChileVegetableWheat BerryBeetMustard GreensLeafy GreensWeeknight MealsEasyMainGluten-FreeDairy-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}