{"id": "24710b5c24d3ca29321c0a1149cbb935", "url": "https://www.bonappetit.com/recipe/crispy-turmeric-and-pepper-spiced-chicken-wings", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Crispy Turmeric-and-Pepper-Spiced Chicken Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueCrispy Turmeric-and-Pepper-Spiced Chicken WingsBy Andy BaraghaniApril 14, 20204.6(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintStarting the wings in a cold oven allows the fat to render slowly so they get even crispier. Pour off the infused fat and save for stir-fries or cooking crispy eggs.Ingredients8 servings 2tsp. black peppercorns1tsp. ground turmeric1tsp. sugar3½tsp. kosher salt4lb. chicken wings, patted dry13\" piece ginger, peeled, finely grated4garlic cloves, finely grated2Tbsp. vegetable oilSpecial Equipment:A spice millPreparationStep 1Finely grind peppercorns, turmeric, sugar, and salt in spice mill, then transfer spice mix to a small bowl. Arrange chicken wings on a foil-lined rimmed baking sheet. Sprinkle wings all over with spice mix. Reserve bowl.Step 2Mix ginger, garlic, and oil in reserved bowl, then drizzle over wings. Using tongs or your hands, turn wings to coat and let sit at room temperature at least 30 minutes, or cover and chill up to 1 day.Step 3Place baking sheet with chicken wings in a cold oven; preheat oven to 425°. Bake wings until golden brown and foil is stained with turmeric, 30–35 minutes. Using tongs, turn wings over and continue to cook until skin is crisp and wings are starting to char around the edges, another 30–40 minutes.Step 4Transfer wings to a platter and serve with lemon wedges alongside for squeezing over.How would you rate Crispy Turmeric-and-Pepper-Spiced Chicken Wings?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI made this today. I doubled the ginger s as no garlic. The mixture was difficult to apply to the wings. A reviewer suggested marinating them in a plastic bag to cover the wings completely. They are EXCELLENT even cold. I forgot to garnish with lemon.  I’d definitely make this again. A reviewer also suggested using Cornish hens. YUM!! AnonymousRaleigh 11/2/2021These came out great! Fantastic texture, kind of 'dry' but in a good way, as in NOT WET. I had this with the charred tahini smothered cabbage and it was a nice combo. I might up the spice a little, though.HangryGurlSanta Fe, NM6/18/2021Anybody have a good dipping sauce to go with?Bill CanadaVictoria, B.C., Canada3/17/2021LMAO!!  Copy Send to print.  By the picture, to  the right.  On my PC the print  icon is to the left of \"Ingredients\".  Haven't even tried these yet but it seems everyone wants to make sure everyone else gets the recipe.  Must be good.AnonymousNE Ohio3/13/2021Fantastic! Substituted one of the tablespoons of black peppercorns with Szechuan peppercorns to up the heat level. Flavor town for sure!nicbozOrange County, CA2/16/2021My family wanted to make sure I gave this 5 stars.  As promised, here I am.  Followed the recipe exactly, with Pam on the foil.  Would double it next time.  AnonymousDenver, CO1/26/2021Picture a guy in his early 20's discovering how awesome chicken wings are.  Then picture 4 decades flying by...what does this tell you?  O.K., for one, I am 64 for a few more weeks :)  But secondly, I've had a lot of time to learn and create many outrageous wing iterations. I know my way around wings. This Andy Baraghani recipe was a major wow.  The unique method of roasting by starting in a cold oven made this one of the easiest wings recipes to prepare,  and \"oh my\"  regarding the flavor/crispy texture....ummmazing wings.  Big thanks to you for sharing.   I lined my rimmed sheet pan with non-stick foil.  It really helped when it was time to carefully flip the wings.  A thin spatula easily coaxed the wings from the foil, and then the flip....so easy!chefjeff1Sherman Oaks10/26/2020This is the most requested chicken recipe in my house.  It has now been expanded to split Cornish Game hens.  After the first couple times I have been grinding up the spices and then adding that to the garlic, ginger and oil and then marinating the chicken in the mix; tossing a couple times.  Works well for me!   Love Andy Baraghani recipes!AnonymousWestern Washington10/2/2020This is the second time we have made this recipe and it will not be the last, delicious!  We have a question for anyone about the ginger, garlic mixture.  Following the recipe our ginger, garlic, oil mixture is more like a paste and would not drizzle, we added 2 extra tablespoons of oil to make it spreadable.  The extra oil helped with the wings not sticking, but we wondered if others had this issue?\nThanks for any feedback.mullillKenosha, WI8/18/2020Delicious, easy, and so flavorful! Love it.sakamaIndiana7/22/2020This was easy and delicious!  I put the marinade into a plastic bag, then put the wings in.  I made sure all the wings were coated in the bag. When I was ready to cook them, I poured them into a sheet pan. \nI made them a few times and they were always a big hit.silkycooksBrooklyn NY 7/7/2020My partner dubbed them \"flavor town\" which is the highest honor in our household. We ended up doing them on the grill instead of in the oven (way too warm inside our house) and using limes instead of lemons. These are now a staple in our summer recipe go-tos. AnonymousCLEVELAND, OH6/6/2020Amazing wings!  Came out delicious.AnonymousBoston, MA6/3/2020This was a great recipe, however, my wings stuck to the foil. The next time, I will either use parchment on the pans or use PAM on the pan to avoid the sticking.sbbenzilPanama, Central America5/25/2020What a fantastic recipe! I loved that it was simple and easily made with what I had available. Few modifications made on my end: I subbed honey instead of sugar and added a 1/2 teaspoon of baking soda to help crisp up the wings. The key here is a bit of time for the marinade. I let it rest for about 4 hours in the fridge and was so pleased with the full flavor and juiciness! I served with a spicy kale salad and loved it! Can't wait to make it again :-) Thanks Andy! AnonymousMinneapolis, MN 5/19/2020Explore Bon AppétitChicken WingChickenPoultryTurmericHerbs & SpicesEasyStarterMainGluten-FreeDairy-FreeNut-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}