{"id": "2482ad54478298f83a9d02b881b219c6", "url": "https://www.bonappetit.com/recipe/chicken-cobb-salad", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Chicken Cobb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueChicken Cobb SaladBy Claire SaffitzJuly 10, 20184.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintStep one: Crisp bacon. Step two: Turn bacon fat into an addictive warm vinaigrette. Boom. Cooks' Notes:  We love how the warm dressing clings to tangles of frisée in this Cobb salad recipe, but any crunchy lettuce like romaine or endive would be great. Choose tomatoes that feel heavy for their size. As long as they’re ripe, any type will work. And streaming oil into the already-fatty bacon mixture might cause the vinaigrette to break, but don’t fret! It’ll still be totally delicious.Ingredients4 servings 6large eggs, room temperature4oz. bacon (about 4 slices)2Tbsp. sherry vinegar or red wine vinegar1Tbsp. Dijon mustard1tsp. sugar¼cup extra-virgin olive oilKosher salt, freshly ground pepper8cups coarsely torn frisée½rotisserie chicken, meat pulled from bones and shredded (about 2 cups)2large beefsteak and/or heirloom tomatoes, cut into wedges1ripe avocado, quarteredPreparationStep 1Bring 8 cups water to a boil in a large saucepan. Gently lower eggs into water and boil 7 minutes for medium-set yolks. Immediately transfer eggs to a medium bowl of ice water and chill until cold, about 5 minutes. Peel eggs under running water; set aside.Step 2Place bacon in a dry medium skillet and set over medium-low heat. Cook, turning occasionally, until brown and crisp, 8–10 minutes. Transfer to paper towels and let drain.Step 3Add vinegar, mustard, sugar, and 1 Tbsp. water to rendered fat in skillet and whisk until smooth and emulsified. Gradually stream in oil, whisking constantly until a thick dressing forms; season with salt and pepper.Step 4Arrange frisée on a large platter and season with salt and pepper. Drizzle about half of warm dressing over. Cut eggs in half and arrange over frisée along with shredded chicken, tomato wedges, avocado, and bacon (break up bacon if desired). Season salad with salt and pepper and drizzle remaining dressing over.How would you rate Chicken Cobb Salad?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleAmazing! It was a wonderful dinner salad; felt like a nice snack platter with a generous bit of greens. Since fresh tomatoes are subpar this time of the year in Boston, I used Divina roasted tomato quarters in oil. I may try adding a little bit of minced shallot in the vinaigrette next time. I’m looking forward to serving a big platter of this for lunch on the deck to friends on a warm, sunny summer afternoon after covid!JuliaBoston, MA3/9/2021This recipe is so simple but still happens to be one of my top five favorite Bon appetit recipes of all time. Thanks Claire!!katskitchenTexas5/1/2020Absolutely delicious!AnonymousSouth Korea 10/23/2018I saw this in the August issue, it contained all of my favorite ingredients and looked so pretty. I have already made it several times =favorite salad. Its all about the dressing of warm deliciousness! I did add more bacon (peppered and once applewood) and some thin slices of purple onion (because I love onions). It is half done with a pre-made rotisserie chicken. So easy! qotu92Carlsbad CA9/5/2018Delicious! Made this for dinner this evening, and my husband and I loved it! The dressing is clever to be made from the bacon drippings. Will totally make again and again. Thanks Claire!JasonCMunn73Vancouver BC9/3/2018I needed a seasonal meal to have on the deck with a few friends, and this was a huge hit. The only change was = More.Bacon. 4 slices is not enough for this impressive platter of deliciousness. I doubled the bacon and dressing, serving the remaining dressing on the side. Garlic bread and some nice burgundy made it the perfect casual get together. Thanks BA!!terrylundmarkSeattle, WA.8/21/2018Explore Bon AppétitSaladCalifornia CuisineAmericanChickenPoultryBaconCured MeatMeatFriséeChicoryLeafy GreensVegetableEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Claire Saffitz"]}