{"id": "248aac5bd119fa005c5c7b07f53720f1", "url": "https://www.bonappetit.com/story/square-containers", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "The Best Square Plastic Containers For Pantry and Fridge Organization | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSquare Containers Are Superior to Round Ones, and These Square Ones Are the BestYour fridge isn't round, so why should your storage containers be?By Sarah JampelApril 19, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The harsh truth about deli containers—yes, the same ones to which we’ve taken a lifelong vow—is that while they stack vertically, they actually waste a lot of space. It doesn’t take a geometer (a real word, look it up!) to understand why square plastic containers can nestle together more snugly than containers with round sides.So when I recently moved into a new apartment, with the opportunity to reconfigure my pantry and fridge with space optimization in mind, I bought a set of square plastic containers. These have all the benefits of cylindrical deli containers—lightweight; dishwasher-, microwave-, and freezer-safe; affordable but not disposable; clear, so you can see their contents; all lids match all bottoms—they also nestle into my shelves almost like puzzle pieces. There's still some space left unused, but much less of it.They’re in service in the fridge, where they hold small amounts of specialty flours, nuts, seeds, egg whites, lemon halves, leftover sauces, and leftover-leftovers. In the pantry they’re filled with dried fruit, nutritional yeast, breadcrumbs, pulses, spice mixes, that little bit of lingering orzo I’ve been meaning to boil. I also have a few on my desk, with Post-Its, paperclips, and other manners of whosits and whatsits. There’s room for everything!Regarding their air-tightness, I wouldn’t fill several of these to the brim with soup, throw them in a backpack, and go on a roller coaster ride—they’re slightly thinner than round delis and the tops, while they do latch on securely, aren’t as super-sealing as the sort that buckle onto heavy glass bottoms. But they’re perfect for staying put in small spaces—which is all I’m doing these days anyway. And maybe they won’t look as cute as Mason or Weck jars in your pantry, but they’re infinitely more practical. It may not be hip to be square, but it sure is smart.We're squaring off:Photo by Isa Zapata, Food Styling by Pearl Jones16-oz. Square Clear Deli Containers with Lids (Set of 20)$25 at AmazonExplore Bon AppétitStoringShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-19", "author": ["Condé Nast", "Sarah Jampel"]}