{"id": "2494b6340a1b7aac119b96e02aa157b8", "url": "https://www.bonappetit.com/city-guides/montreal/venue/le-mousso", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Le Mousso Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealLe MoussoSplurge a little on this innovative tasting-menu-powered restaurant in the Gay VillageFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for what’s considered one of the best meals in the city—and that’s saying a lot. Chef Antonin Mousseau-Rivard turns seasonal ingredients into a mindblowing 12-course tasting menu at Le Mousso.ORDER THE: tasting menu, which changes with the seasons and also accommodates dietary restrictions (just call ahead). We highly recommended the wine pairing, in which sommelier Alexis Demers presents with enthusiasm, skill, and total lack of pretension (he’ll also graciously pour a half pairing if the whole shebang feels like too much). But if you’re not down for the multi-hour time commitment (and $190 CAD per person price tag), you can snag a spot next door at Le Petit Mousso, the more casual sister restaurant.THE VIBE IS: industrial minimalism meets midcentury modern, with some earthy ceramics and a couple of Scandi-inspired touches. You don’t really need to dress up in Montreal, but why not go all the way at Le Mousso?PRACTICAL STUFF: Open Wednesday to Saturday, with seating at 6 p.m. There is only one seating every night, so reservations are required (available via its website).—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEAgrikolIn the Gay Village, a rum-fueled oasis run by Arcade Fire DamasAll the meze (and fresh pita!) at this standout Syrian spot in OutremontLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}