{"id": "2499c7c1498ca596c7eaa8cd898bff2b", "url": "https://www.bonappetit.com/story/no-stir-polenta-recipe", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Gift of This Creamy Polenta Recipe Is That You Don't Have to Stir It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Gift of This Polenta Recipe Is That You Don't Have to Stir ItWith this new technique, you can have creamy, perfectly cooked polenta without ruining your cooking arm.By Alyse WhitneyOctober 1, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailPolenta, I love you, but you’re bringing me down. My relationship with cooking the creamy cornmeal porridge has been nearly non-existent, mostly because I hate standing over the stove and stirring. It requires constant attention like a new puppy, and if I step away for one moment, it  clumps,  scorches—or both. But after trying our new method for hands-off, no-stir oven-cooked polenta, I’m ready to add it to my weekly fall cooking lineup.The beauty is in the technique’s ideal ratio of minimal effort to maximum payoff, resulting in a bowl of cheesy, creamy, comforting goodness you barely have to work for. The polenta starts in a saucepan or Dutch oven on the stove, just to bring everything to a boil, then gets covered and slid into the oven alongside a pan full of mushrooms already roasting away. And here’s where the magic comes in: The oven does the work of evenly distributing the heat for you, meaning you don't need to put in a full-on arm day of stirring and sweating to temper the intense, single-direction flame of a burner. All it takes is a brisk whisk and a hefty handful of grated Parmesan cheese at the end to bring it to its optimal smooth, thick consistency. (Add a little extra butter or heavy cream if you want to gild the lily. Or up the Parm and fresh black pepper, to make it a Cacio e Pepe polenta!)Crispy mushrooms are a great topper, but you could go with any roasted vegetable or protein you’re into.\nPhoto by Alex Lau, food styling by Sue LiWith sweet summer corn season now over, it's the perfect time to adopt a new style of corn to eat on repeat—especially when you consider how damn good and versatile it is as leftovers. It’s perfect for breakfast when I get sick of oatmeal or grits—I just whisk in a little milk or water during the reheat and top with a fried egg. And, I can repurpose it for the next night’s dinner: spread it out on a plate, chill it, cut it into squares, and pan-fry it into crispy goodness, topped with chicken pot pie filling or a hearty tomato sauce. The best part is that there are no more polenta-stirring marathons in sight. I guess this means I should find a new arm workout.Get the recipe:Oven Polenta with Roasted Mushrooms and ThymeCall it cheating—we call it 30 minutes you don’t need to spend standing at the stove.View RecipeExplore Bon AppétitMushroomPolentaRoasted VegetablesRead MorecookingTriple Corn Polenta: An Elaborate Dish That Didn’t Need to Exist, Until It DidBy Amiel StanekcookingMake This Miso Polenta with Your First Spring Farmers' Market HaulBy Chris MoroccocookingWhat Is the Difference Between Grits and Polenta?By Alex DelanyInstant Pot Polenta Cacio e PepeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Alyse Whitney"]}