{"id": "24a137820bf9ce1d5ebe5fbfb584817d", "url": "https://www.bonappetit.com/story/pumpkin-chiffon-pie", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "The Lightest, Creamiest Pumpkin Chiffon Pie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Lightest, Creamiest Pumpkin Chiffon PieMom (kind of) knows best.By Adam RapoportNovember 12, 2019FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl Jones, prop styling by Allie WistFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.You know how you think your mom’s recipe for fill-in-the-blank is the absolute best recipe for fill-in-the-blank ever?Well, yeah, so did I. At least until I presented Maxine Rapoport’s famous pumpkin chiffon pie for a tasting in the BA Test Kitchen.Typically when you serve people pie, the responses range from “Thank you so much!” to “Oh my God, this is SO good.” They’re, you know, happy that someone actually made a pie and is serving them a slice.Want this letter before it hits the website? Sign up for our newsletter!Not so on the 35th floor of the World Trade Center.Carla: “How much sugar is in this recipe?”Claire: “Hmm...did you consider blind baking the crust first?”Molly: “What about adding some sour cream or yogurt to the whipped cream? Tastes kinda flat as is.”And so it went. What I thought was an infallible dessert—a favorite of every Rapoport-hosted Thanksgiving—turned out to be as vulnerable to tweaks and revisions as every recipe that makes its way through BA’s strict development process.In its platonic form, Maxine’s pumpkin chiffon pie consists of a creamy, fluffy mousse, speckled with tiny air bubbles, redolent of just enough nutmeg and cinnamon.If a conventional pumpkin pie is dense and heavy, this one practically levitates, it’s so light. And instead of a traditional—read: soggy—pie crust, this one has a super simple buttery graham cracker crust.At least, that’s how I remembered the pie. Until I had to appraise it with a critical eye. Carla was right—it was too sweet. So we reduced the sugar in the pumpkin custard from ⅔ cup to a scant ½ cup. And the whipped egg whites, which provide the mousse with its airy nature, needed less than the ¼ cup of sugar originally called for.Because the mousse is a no-cook concoction, my mom always just blended the graham cracker crumbs with melted butter and a smidge of sugar and salt. Turns out that parbaking the crust for about 20 minutes evokes a toasty, nutty flavor while extracting unwanted moisture.And have you ever blended a bit of sour cream or Greek yogurt into freshly whipped cream? I will from now on. What used to be just creamy is now tangy and complex.Oh, and there was a whole bit on my mom’s hand-written recipe index card where my she prescribes freezing the pie over night. I think because this would allow you to make it days ahead of Thanksgiving. But we struggled to nail the defrosting time, and Carla described the not-quite-unfrozen pie as “weeping,” as its ice crystals melted.I’m not going to insist that this pie is better than your mom’s, but after the tweaks and adjustments we made, I am going to go ahead and say that it is better than my mom’s. (Shhhh...don’t tell Maxine!)Get the recipe:Pumpkin Chiffon PieThis light-as-can-be pie has a toasty graham cracker crust to complement its cloudlike texture.View RecipeExplore Bon AppétitAdam NewsletterRead MorecookingDon’t Be Intimidated By This Sky-High Banana Cream PieBy Rachel KartencookingLemon Meringue Pie Is the Only Thing on the Thanksgiving Table I Care AboutBy Sarah JampelcookingThis Classic Chocolate Pudding Pie Doesn’t Need a Twist Thank You Very MuchBy Sasha LevineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-12", "author": ["Condé Nast", "Adam Rapoport"]}