{"id": "24a2146582f18172531a1a3068be250d", "url": "https://www.bonappetit.com/story/how-to-decorate-a-cake-with-just-a-spoon", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "How to Decorate a Cake with Just a Spoon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Decorate a Cake with Just a SpoonYou don't need a whole bunch of fancy tools to make that frosting look cute. Here's how to decorate a cake for maximum impact with minimal fuss.By Kat BoytsovaMay 15, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailYou could spend countless hours on YouTube trying to learn how to decorate a cake. And in a lot of instances, the pros in these videos use a variety of special tools like bench scrapers, offset spatulas, piping bags, a whole lot of fancy piping tips, and cake stands to create the effects they're after. Could you do the same? Sure: With a lot of time, tools, and patience, I have no doubt that you could. But if you're like most people, you don't have all of those tools, or make cakes often enough to nail those fancy techniques, and you just want to make a cake that looks cute with minimal fuss. The good news? All you really need to make a beautiful, Instagram-worthy cake is a little bit of practice and a spoon.Yep, you heard that right: a regular ol' spoon. Here, I'll explain how to us a spoon to shape the frosting on the top of a simple, single-layer cake—our Easiest Chocolate Birthday Cake is the one you're looking at here—into three designs that really make it look like you know what you're doing. No fuss, no muss, just a great looking cake that will impress the hell out of whoever you're making it for. Let's get started!First thing you want to do is get a nice thick layer of frosting on the top of your cake, no less thank ¾” thick. (For our purposes here, we're going to leave the sides of the cake \"naked\" and focus just on the top.) Then, smooth it out as best you can with the back of a spoon so you have a nice blank canvas to work with—it doesn't have to be perfect, so don't stress. Now, let's take a look at our options, shall we?Photo by Chelsie Craig, Food Styling by Pearl JonesThe StripeYou’ll need a spoon with a flat handle for this. Holding the cupped part of the spoon and using the handle side, gently press down onto the surface of the frosting and drag it in a straight line from one side to connect to the other. Repeat this process, shingling each line on top of the previous one to create a nice layered effect. Not bad, huh? A handsome set of stripes never goes out of style.Photo by Chelsie Craig, Food Styling by Pearl JonesThe Zig-ZagThis one's got a little more pizzaz. Drag the backside of your spoon across the surface of the cake, moving the spoon back and forth as you go to create a zig-zag pattern in a uniform line. You can mix this one up by making narrower or wider zig-zags, or by using a larger or smaller spoon to make differently-sized lanes.Photo by Chelsie Craig, Food Styling by Pearl JonesThe Swoop & WhorlUsing the back of your spoon, press down lightly into the frosting and swoop it up and out of the little divot that you first created. Continue to do this in circular motions until you’re happy with the result. This is definitely the most rustic and natural of the three designs—and the one you can use to cover up any mistakes you make if the first two methods don't turn out the way you want them to.Remember, this should be fun and relatively easy! If you don’t like what you’re seeing, just use your spoon to smooth out the surface and start over again—frosting is a very forgiving medium. Mess around with it until you get the result you were hoping for—or at least something that you like—and once you've got those down, you can start experimenting with your own designs. Who knows, pretty soon you might have your own one-spoon cake decorating YouTube channel!Now that you know how to decorate a cake, why not make one?Easiest Chocolate Birthday CakePure homemade birthday love. If you've got a bowl, a cheap hand mixer, and a couple of measuring cups, you can make this rich, chocolatey cake.View RecipeExplore Bon AppétitBasicallyCakeFrostingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Kat Boytsova"]}