{"id": "24b3906df50bd43c35e772614d8981fc", "url": "https://www.bonappetit.com/story/tache-pistachio-milk", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Pistachio Is the Best Nut, and Pistachio Milk Is the Best Nut Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingPistachio Is the Best Nut, and Pistachio Milk Is the Best Nut MilkTáche is a little bit savory, a little bit sweet, and froths like a dream.By MacKenzie Chung FeganMarch 5, 2021FacebookTwitterEmailPhoto Courtesy of TácheFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Executive editor Sonia Chopra, presumably on a caffeine high, plunged the BA “office” into heated debate with this controversial Slack: “After 11 months of being extremely picky about coffee and spending most of my disposable income on beans, I am here to admit that I’m obsessed with the new pistachio brown butter Starbucks latte.”“I want it,” agreed Basically editor Sarah Jampel. Test Kitchen director and resident coffee nerd Chris Morocco registered a note of betrayal—“Et tu, Sonia?”—to which Sonia countered, “I will order literally anything if you tell me it has pistachio in it, I’m sorry!!!!”I’m not a Starbucks drinker, but I am Team Sonia on this one. The best gelato? Pistachio gelato. The best way to eat winter citrus? Drizzled with good olive oil and sprinkled with pistachios. The best reason to have kids? Tiny fingers to do the shelling for you. So it will surprise no one when I say that my new favorite nondairy milk is, yep, pistachio milk.Although there are other nut milks on the market that contain pistachios—in addition to almonds, which are, let’s be honest, a filler nut—Táche is made with pistachios and pistachios alone. Their original blend is lightly sweetened with cane sugar (there’s also an unsweetened version, but the original blend is the clear winner for me) and, unlike oat milk, contains no added oil. It froths like a champ with the help of one of those $3 wands, or even when shaken. It’s both sweet and savoryish thanks to a little added salt. And, most important, it tastes like pistachios.If you’re someone who favors an alt-milk that adds body but mostly fades into the background, this is maybe not the milk for you. But the fact that Táche tastes like something—specifically pistachio, king of the nuts!—is the whole point for me. My oatmeal becomes pistachio oatmeal, hot chocolate is now pistachio hot chocolate, and the French toast I made with the last of my Christmas panettone? Pistachio panettone French toast, a string of words that fills me with almost unbearable delight. And while I’m not normally a Bulletproof coffee kinda guy, a spoonful of brown butter stirred into a Táche latte (made with the good beans) sounds like a great idea. I know Sonia would agree.Táche Original Blend$48 at Táche (for six)$7 at Thrive Market (for one)Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-05", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}