{"id": "24b58a9379930f0c591fec0161a7373f", "url": "https://www.bonappetit.com/story/grilled-lamb-shoulder", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Stop Giving Lamb Shoulder the Side-Eye | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStop Giving This Meat the Side-EyeFood director Carla Lalli Music vouches for grilling an underappreciated protein in the latest edition of Notes from the Test Kitchen.By Carla Lalli MusicJune 28, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cooking lamb is never a baaad idea.The name of this article has temporarily been changed to “shameless self promotion,” and I am using my bully pulpit to preach about my own recipe for a cut of meat you’ve been giving side-eye to for far too long.Yes, that’s right, I’m talking about lamb—marinated, grilled, shoulder of lamb. Even though this dish is an imperfect replication of the grilled leg of lamb that my mom makes for Easter every year, I am prepared to take full credit for the recipe, and I’m going to eat it any time of year that I damn well please. I am especially excited about the idea of having it in the summer because lamb goes so well with all the Mediterranean flavors I love: olive oil, fresh herbs, garlic, tangy yogurt, lemon, vinegar, fat summer tomatoes.But first, I have to dispatch the objectors: “Lamb!” I hear those silly skeptics scream. “Lamb is so gamy. It’s so grassy. It’s so expensive!”Facts: Lamb graze on grass. They’re ruminants; they forage, and if you have had lamb that tasted grassy, the source of the trouble goes back to their diet. To American palates—us carnivores raised on lavishly marbled, corn-fed beef—the flavor of a naturally grass-fed animal can raise eyebrows. You might say it’s gamy. A native Australian would describe it simply as lamby. Cuts of meat from smaller (er, younger) lamb are more mild, and it’s common these days to find lamb that are partially raised on corn, which makes them even sweeter.Want this letter before it hits the website? Sign up for our newsletter!In other words, forget what you thought about the gamy/grassy thing. It’s basically all in your head. If it makes you feel better—and I am all about making you feel better—the vinegar-forward marinade with puréed onions and tons of rosemary helps tenderize the lamb, infuses it with bright flavor, and makes it deliciously crunchy when the lamb hits the grill.The expensive part is true—that is, if the only price tag you’re looking at is for a rack of rib chops. That cut can easily set you back upwards of $20 a pound, and if you were to accidentally overcook one of those itty-bitty ribs, you’d be very upset.That’s why I chose a shoulder roast for this recipe. It’s not only affordable, it’s a cut that begs to be grilled slowly over a medium fire. Cooking over moderate heat affords you plenty of runway, so you can take your time to develop a deep, flavorful crust without worrying for a minute about the possibility of overcooking. Picture it: There you are, standing by your grill in the great backyard-outdoors, with a pair of tongs in your hands and smoky meat vapors flowing through your hair, confidently grilling your lamb until it hits 140°, the secret temperature for a just-pink interior.Lamb, like any good meat, needs to rest before slicing. I thought it was a good idea to do this atop a bed of sliced tomatoes and fresh rosemary sprigs. As the lamb cools, it releases juices onto the tomatoes, which warm up, absorb these drippings, and create some of their own. By the time the lamb is ready to slice, the tomatoes will be sitting in a meat-fat marinade, and you should definitely tilt the platter and spoon some of these juices onto each serving. Then serve with a side of lemon-garlic yogurt and prove everyone wrong about this whole lamb thing.Get the recipe:Grilled Rosemary Lamb with Juicy TomatoesLamb shoulder: Not just for braising! We’ve got a brilliant, delicious marinade that makes it heaven on the grill.View RecipeExplore Bon AppétitLambCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Carla Lalli Music"]}