{"id": "24cbde7cacf63fbbfa48fa9545e934de", "url": "https://www.bonappetit.com/story/long-live-dinner-parties", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "The Dinner Party Is Dead. Long Live the Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Dinner Party Is Dead. Long Live the Dinner PartyWe’ve tried the cheap impressions of Martha Stewart excellence. Are we finally ready to relax?By Alicia KennedyOctober 14, 2021FacebookTwitterEmailIllustration by Arsh RaziuddinFacebookTwitterEmailThis story is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.Nora Ephron, the writer and filmmaker, said that a round table works best for a dinner party. At a long rectangular table, she wrote, some guests could be left unable to take part in the conversation. M.F.K. Fisher, the grande dame of food writing, would say no more than six people should sit at that round table, and no two of them should be so in love as to bore everyone else. Martha Stewart suggests the host pick a theme rather than cobble together disparate dishes. A round table, a maximum of six guests, a theme: These are mere morsels from the wide array of advice that’s been written down about how to throw good dinner parties. No wonder people fret about them.I grew up in the ’90s assuming that when I was an adult, I’d pursue the perfection of Martha. The tablecloth would match the napkins and each place setting would be just so in order to display extravagant meals. For a time I tried doing a cheap impression of that kind of excellence and I wouldn’t have any fun because it wasn’t real—and it certainly wasn’t really me. I’d worry that everyone was judging my cooking or noticing a mismatched plate, and I’d make too many dishes in the hopes that anything subpar could be compensated for. I’ve even made whole ice cream cakes, desperate to impress.The ideal is part of a long lineage of using dinner parties to display wealth rather than to share abundance—two concepts that, though easy to confuse, I’ve found vastly different.Now, given time, experience, and a move from New York City to San Juan, where I’ve, thankfully, had to adjust to a much more relaxed pace of life, I’m more confident. My last year in the city, I worked at a wine bar with a tiny kitchen, and while I was certainly not the best short-order cook, my cooking muscles gained new dexterity from fulfilling the orders by myself that I now put to use for friends. These days, with the striving of my 20s behind me, I am content to be more Ina—Garten, that is, who has said that sometimes a take-out pizza with a big homemade Caesar salad makes the most sense. I’m that kind of host, giving something special on the side of something comforting. Think orange–olive oil cake I whipped up myself, served with a scoop of ice cream from a pint.When I moved into my apartment in San Juan, a dark wooden rectangular table stood in the dining room. I had intended to move it out for something more my taste (lighter, rounder), but then the pandemic lockdown hit Puerto Rico. Now I’ve gotten used to the table. It’s hosted brunches, birthdays, and random Sunday nights around a massive pot of fettuccine in marinara, served with garlic bread and peppery arugula salad in a Balsamic dressing that reminds me of my hometown pizzeria on Long Island. The table, rectangular though it is, has done its job, and I’ve dared to invite as few as one person and as many as eight over, borrowing mismatched chairs for the latter. My vintage collection of glassware also doesn’t boast any full sets for white or red yet somehow I make do.All that advice about the perfect dinner party? I no longer listen to it. I had long thought of dinner parties as a space where performance and care are in opposition, but now I believe performance and care overlap. Ephron, Fisher, and Stewart, while I’m sure they meant well, had set up a standard of domesticity that is easy to fail by, or at least become overwhelmed by. Their rules represent an ideal of white womanhood that obligates people to become the consummate host before pursuing any personal or professional satisfaction. The ideal is part of a long lineage of using dinner parties to display wealth rather than to share abundance—two concepts that, though easy to confuse, I’ve found vastly different.“When we're thinking about dinner parties, I think a lot of it, historically, has to do with designing spaces of power and excellence,” says arts journalist and dramaturg Yasmin Zacaria Mikhaiel, whom I spoke to about the dramatic power of the dinner party and why it’s long been used as a narrative device. They note that dinner parties going back to ancient Greece have featured these themes and repeat a line from Aristophanes’ comedy The Acharnians about a dinner party displaying riches: “And wherever we dined, the hosts would always force us to drink out of golden goblets and crystal cups! All that sweet, unmixed wine!”When we invite people we love into our homes, it’s only natural that we want to display our best—our best cooking, our best wine, our best selves—but we are doing so because we want our guests to feel taken care of, to feel safe, to feel nourished. This is a fresh spin on that ancient practice of throwing a feast. “When we’re thinking about dinner parties now, it's almost like we're designing a sort of togetherness, not necessarily trying to put power and prestige on display,” says Zacaria. “But we're still sort of showcasing the abundance we have for each other.”The pandemic, climate change, and the endless litany of existential and ecological crises have made me want to share what I have, whether that’s baking an elaborate cake or firing off a quick flatbread to dip into hummus. We don’t know what the future will bring in terms of catastrophe. The isolation of the early pandemic made me want to spend what time I have better, to share my skill at turning a red onion into a quick pickle, getting meat-eaters to enjoy jackfruit, and managing every step of an eggplant parmigiana without losing my cool (even if I do sweat). Now I have created fortifying friendships in a new city where I not long ago only had professional acquaintances. In Puerto Rico, the Spanish influence of “sobremesa” persists; after a meal is over, we linger at the table, pour more wine, bring out interesting spirits and liqueurs to taste. We luxuriate in pure presence. Whether the flatware matches? No one notices.Abundance is what motivates hosts like Queens-based culinary educator Sammi Gay, whose elaborate and homey meals I’ve been following on Instagram. She has been cooking since childhood for her friends. “I remember making boxed [fudge] brownies with Oreos and chocolate syrup for sleepovers or to bring to the lunch room for friends in middle school,” she says. “Or making a big box of spaghetti with garlic Texas toast after school for my besties.” In college in Western Massachusetts, Gay ran a permaculture garden and grew an excess of vegetables. Living off campus with a kitchen of her own, she made elaborate meals for others. “Huge batches of soup, meatball subs, lots of roasted root veggies, potlucks galore—it was an honor to feed my friends.”That’s all I and my friends want to show off now—community, pleasure, joy. “I realize more and more that yes, I want my people and guests to eat good, but more important to me was their company, their pleasure, and how that fills up my home,” says Gay about perfecting a meal versus simply enjoying it. “That’s what I truly crave and cherish.” Many of us are not interested in prescriptions or advice, but in how to make the most of what you’ve got to express care, to cultivate abundance. Although I will still give the bathroom an extra scrub and light some candles too. Some etiquette stands the test of time.Explore Bon AppétitDinner PartiesPartiesLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Alicia Kennedy"]}