{"id": "24cbdbbec26d0e3b577749db449c3479", "url": "https://www.bonappetit.com/recipe/mushroom-matzo-kugel", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Mushroom Matzo Kugel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueMushroom Matzo KugelBy Bonnie Frumkin Morales March 16, 20214.3(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrint“Most of my mom’s recipes are rooted in the time before she emigrated from Soviet-era Belarus, where making dishes related to Jewish heritage was discouraged,” writes Bonnie Morales, chef and co-owner of Kachka in Portland. “She only learned to make this comforting casserole after she moved to Chicago, where a cousin made it for Passover. Now my mom makes it every year. Her version uses cream of mushroom soup and frozen spinach, but I updated mine with homemade mushroom stock, Swiss chard, and crème fraîche.” Morales makes a flavorful meatless broth with dried mushrooms, but a store-bought version (we recommend Pacific brand) will be just fine.Ingredients8 Servingsstock½small onion2sprigs parsley1dried porcini mushroom¼cup mixed dried mushrooms1tsp. black peppercorns½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltKugel8Tbsp. (1 stick) unsalted butter, divided, plus more for pan111-oz. box matzo (about 13 boards)5large eggs1cup crème fraîche1cup heavy creamKosher salt1large bunch Swiss chard10oz. shiitake mushrooms, stems removed, sliced ¼\" thick8oz. maitake mushrooms, cut into bite-size pieces1medium onion, finely choppedPreparationstockStep 1Heat broiler. Place onion on a small baking sheet and broil, turning halfway through, until charred, about 5 minutes per side. Transfer to a small saucepan and add parsley, all mushrooms, peppercorns, and 5 cups water. Bring to a boil, then reduce heat and cook at a bare simmer until broth is reduced to 3½ cups and is very cloudy, about 1½ hours. Strain stock through a fine-mesh sieve into a large heatproof measuring glass or an airtight container (you should have about 3 cups); discard solids. Stir in salt.Do ahead: Broth can be made 3 days ahead. Let cool; cover and chill.KugelStep 2Preheat oven to 300°. Butter a 13x9\" baking dish. Break matzo into 3\" pieces; place in a large bowl. Pour 2 cups stock over and gently toss to coat; set remaining 1 cup stock aside. Let sit until matzo is soaked and breakable but still holds its shape, about 30 minutes.Step 3Meanwhile, whisk eggs, crème fraîche, and cream in a medium bowl to combine; season with salt.Step 4Remove ribs and stems from Swiss chard leaves. Finely chop ribs and stems, then coarsely chop leaves. Heat 4 Tbsp. butter in a large skillet over medium-high. As soon as butter is foaming, add shiitake and maitake mushrooms and cook, stirring, until liquid is released and mushrooms are reduced by half in size, about 5 minutes. Season with salt and transfer to a medium bowl.Step 5Reduce heat to medium. Heat remaining 4 Tbsp. butter in same skillet. Add onion and a pinch of salt and cook, stirring occasionally, until translucent, about 5 minutes. Add Swiss chard ribs and stems, increase heat to medium-high, and cook, stirring, until onion is golden brown and ribs and stems are softened, about 5 minutes. Add Swiss chard leaves in 2 batches, letting wilt slightly between additions, and cook, stirring, until completely wilted and no longer wet-looking, about 4 minutes. Season with salt. Scrape into bowl with mushrooms and let cool 10 minutes.Step 6Add mushroom mixture to bowl with matzo. Season with salt, then stir in egg mixture. If kugel looks dry, add more reserved stock ¼ cup at a time until moist but not watery. Carefully pour into prepared dish; bake until top is golden brown and kugel is set, 55–65 minutes. Let cool slightly before serving.How would you rate Mushroom Matzo Kugel?Leave a ReviewTell us what you thinkExplore Bon AppétitCasseroleJewishMushroomVegetableMatzoOther IngredientsEasyWeeknight MealsMainNut-FreeVegetarianPassoverHanukkahRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Bonnie Frumkin Morales"]}