{"id": "24cebec38292784f23dbbd1798c95663", "url": "https://www.bonappetit.com/recipe/weeknight-steak-and-rice-noodle-salad", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Weeknight Steak and Rice Noodle Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWeeknight Steak and Rice Noodle SaladBy Chris MoroccoMarch 21, 20184.3(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis salad recipe hits all the flavors we crave in a weeknight dinner: a hit of spice from the chiles, heartiness from the beef, crispy crunch from fresh veg, and even a bit of sweetness from the honey. We highly endorse cooking off extra rice noodles to keep on hand for low-maintenance stir-fries and soups for later in the week.Ingredients4 servings3small serrano chiles1small garlic cloveKosher salt¼cup plus 2 Tbsp. fresh lime juice3Tbsp. fish sauce3Tbsp. honey2Tbsp. vegetable oil, divided½lb. skirt steak6oz. wide rice noodles½small head Napa cabbage, coarsely chopped16\" piece daikon, peeled, thinly sliced2mini seedless cucumbers, thinly sliced½cup finely chopped mint, plus more leaves for serving½cup finely chopped roasted, salted peanuts, plus more for servingPreparationStep 1Remove seeds from 2 chiles, then finely chop with remaining chile on a cutting board. Thinly slice garlic. Sprinkle a pinch of salt over. Mash chiles and garlic with the flat side of a chef’s knife on cutting board, alternating chopping and mashing, until broken down into a coarse paste. Transfer to a large bowl. Add lime juice, fish sauce, honey, and 1 Tbsp. oil, stirring vigorously to dissolve honey.Step 2Place steak in a medium bowl and pour 3 Tbsp. dressing over, holding back any pieces of chile with a spoon; reserve remaining dressing in bowl. Let steak marinate, turning every minute or so, at least 10 minutes or up to 1 hour.Step 3Meanwhile, bring a medium pot of salted water to a boil. Remove from heat, add noodles, and cover. Let sit, stirring every minute to keep from sticking, until noodles are al dente, 5–8 minutes. Drain and rinse under cold running water. Drain well again and set aside.Step 4Combine cabbage, daikon, and cucumbers in a large bowl; season lightly with salt. Massage with your hands to release excess water. Drain off any water that pools in bottom of bowl.Step 5Pat steak dry; season lightly with salt. Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Add steak and cook, turning once, until browned all over, about 4 minutes per side for medium-rare. Let rest 5 minutes before cutting into pieces.Step 6Add cabbage mixture, noodles, steak, ½ cup mint, and ½ cup peanuts to bowl with reserved dressing. Toss to combine; taste and season with salt if needed. Top with more mint and peanuts before serving.How would you rate Weeknight Steak and Rice Noodle Salad?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleFlavorful and healthy salad that we have made again and again. It is time consuming but worth the effort. I only use 1 serrano as this is enough spice for us. I serve it buffet style so everyone can assemble their own bowl to their liking. I store the leftovers separately so it doesn't get soggy, but it keeps well for another day.Carla CobbMontana8/16/2020I ended up subbing several ingredients based on what I could find or had on hand. I swapped daikon for regular radishes, 1 long English cucumber for mini seedless, a mini bok choy for the 1/2 cabbage, and red chili paste for the serranos. Also I added more steak. What I ended up with was really great though. Great mix of textures and the sauce (while thin like some others said) tasted really nice. I agree that this isn't really a quick evening meal; it used so many bowls!KathleenC95DC8/1/2020My family loved this recipe. Since I didn’t have Serranos (and 3 would have burned our lips off), I added about 2 tsp of sambal oelek. I also used sugar in place of honey and added the zest of one lime. I used leftover carne asada style flank steak. I sliced the steak as thinly as I could, then remarinated for about 20 minutes (while making other components, and at the very end broiled it for about 3 minutes. I used a mandolin to help with prep time and added celery to the vegetables. I’d definitely make this again but probably with more steak next time.Christian SealIndy7/13/2020Agree with other commenters in that this is not an \"easy weeknight recipe\" and also WAY TOO SPICY. I like spicy and it made my eyes water and my lips burn! Three raw serranos in a dressing is insane. I attempted the \"mashing with the side of the knife\" technique for about 2 seconds before resorting to the mortar and pestle. Mashing with the knife just flattens the chile pieces. Next time I'm just going to use the immersion blender. The dressing was for sure spicy but without much body, so I added hoisin sauce, ponzu and oyster sauce. The hoisin and oyster sauce gave it a rich shimmery coating and added body to the dressing.life_in_CQZCalifornia7/8/2020As another reviewer stated, this was way too involved a process to be considered a weeknight recipe. Overall it was an okay recipe, felt like something was missing though, kind of bland.Anonymoustoronto4/27/2020This recipe is a great base for an endlessly riffable salad. For example, this weekend I made a veggie version with tofu (broken into bite size pieces then marinated in the dressing for a while-- used miso coco aminos & soysauce in place of fish sauce) romaine lettuce, green onion, carrot, basil & a little mint along with the rice noodles because that was what needed using in my quarantine kitchen. Pretty easy & super delicious. Will make again and again. Anonymous4/26/2020Very fresh and perfect for summer. I've made this at least ten times now. Sometimes I use wild rice/brown rice in place of noodles, and it holds up nicely for leftovers. The marinade/dressing is also good with jalepenos in place of the serranos. I've made this with skirt steak as in the recipe and also with chicken thighs and salmon. All have been really great. I often add a some lemongrass to the marinade. AnonymousWest Virginia8/23/2019This was delicious and summery, but I’d double the steak : noodle ratio next time. I used Thai rice linguine (not the super wide noodles shown here), so maybe that would be better AnonymousSan Francisco8/14/2019Writing this as I eat: this is amazing. Adding this to my list of go-to recipes! I did half shrimp, half steak and it turned out great. The marinade/dressing is DELICIOUS!Anonymousdenver7/2/2019Not only would I make this recipe again - I have - several times.  It is delicious and just spicy enough to make it interesting.  Make it with or without the beef.  Either way, it's a great salad and I would definitely recommend it.  AnonymousUtah6/24/2019Especially good for roast beef leftovers on a Monday :)Anonymousuk6/11/2019Really great recipe. Comes together easily. We made two slight changes. We used Cilantro instead of Mint and English cucumber because of Persian, both because we had them. It was fantastic. Will definitely make again.\nAnonymousSeattle5/14/2019Loved this! Great for a weekend meal, too many steps to make during the week though. AnonymousBeaverton, OR4/15/2019This was an absolutely delicious meal and we would 100% make again. Flavours are on point, and the textures are super satisfying. To combat the wetness (noted by other reviewers), we didn’t toss the whole salad with the dressing but portioned it out and poured the dressing on individually. This allowed us to save some for leftover the next day without everything getting soggy. We also used hot banana peppers instead of Serrano the sauce turned out great, and we cooked the steak on the bbq. Overall a really wonderful and bright dinner and easy to make.  kateelizabethbToronto, Canada4/11/2019I’m glad I tried this and I liked the flavors, but no matter how hard I tried to dry it out, it was super wet. It also didn’t work as leftovers. If I was feeding a big group of people and knew it would all get eaten I may make it again. I loved the different textures and the mint was a perfectly bright pop of flavor. AslockeNashville, TN4/8/2019Explore Bon AppétitSaladSteakBeefMeatRice NoodleNoodlePasta & NoodlesQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-21", "author": ["Condé Nast", "Chris Morocco"]}