{"id": "24dd81d85e6387bb2b14464248fbbb64", "url": "https://www.bonappetit.com/story/jeremiah-stone-george-floyd-protests", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "The Pandemic May Close Our Restaurants. We’re Donating to Anti-Racist Groups Anyway. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureThe Pandemic May Close Our Restaurants. We’re Donating to Anti-Racist Groups Anyway.Jeremiah Stone isn’t sure if his NYC restaurants will survive COVID-19. But he’s going to support the people protesting for George Floyd for as long as he can.By Jeremiah Stone, as told to Elyse InamineJune 1, 2020FacebookTwitterEmailJeremiah Stone donated his restaurants's weekend sales to organizations supporting protesters in Minneapolis.Photo by Haruka SakaguchiFacebookTwitterEmailIn the last week, protests have erupted across the country in response to the murder of George Floyd, and food businesses everywhere have spoken out in solidarity. Jeremiah Stone and Fabián von Hauske, the chefs and owners of Wildair, Contra, and wine shop Peoples Wine in New York City, were two of those who took a stand. Last Friday, they posted one image with no comment: an announcement that weekend sales would go toward the Minnesota Freedom Fund, which helps those who’ve been arrested post bail, and Reclaim the Block, a Minneapolis-based organization focused on decreasing funding towards police and increasing community-based safety measures. They were one of the first restaurant owners I saw do this; since then, many more have pledged donations. These efforts feel especially poignant given how much the industry has been devastated by COVID-19. I imagined that this small act was a big thing for Stone and von Hauske’s little restaurant group. So, yesterday, I hopped on the phone with Stone to talk about what led him to take action and how the pandemic made him realize that now was the time. –Elyse InamineThe future of restaurants, the future of our restaurants, the economy: It all feels so messed up. Right now, we’re not making a profit, and I won’t pretend that we are. Between our two restaurants, we’re doing one-twentieth of our usual business. But once I heard about the murder of George Floyd, I was just like, things are getting even worse.I saw it on social media, this image of someone with their knee on someone’s neck. Within a few seconds of seeing it, you could feel the oppression, even if you didn’t read the story. I was pretty shocked, but unfortunately I knew this kind of police behavior was so common—so common that an incident like this was recorded and being shown on every news outlet. Racial injustice and police brutality are as old as time, but in my lifetime, they still feel like issues that are so overwhelming and you don’t know where to start to be involved. As I watched at home, I felt restless. With social media, it’s all talk and no action. And I just felt defeated.I’m a cook. It’s what I’ve been doing for the last 16 years, and it’s all I know. I didn’t even go to college. I don’t feel like I’m the person to affect policy change or something like that. But I know I can make food. I know we can control the money we make from that food and have it go to people who need it. So I started to think about what we can do as a small business that’s obviously struggling. We don’t have a lot that we can offer. We’re working everyday; we’re trying to be responsible for our staff and those they’re supporting. So I thought, maybe we could give a little bit of what we’re making in sales to causes that are supporting the protesters in Minneapolis. We were already making so little, and the margins were so tight, that it seemed like not the smartest thing to do. On the other hand, everything feels so uncertain anyway, so why not just do it?So last week, I called Fabián and Daryl [Nuhn], our partner at Peoples, and asked them, “What do you think about donating the money that we make from the weekend to the Minnesota Freedom Fund and Reclaim the Block?” Both of them had George Floyd on their mind. They were like, yes, yes, yes.Chef Jeremiah Stone\nAlbert Cheung Photography LLCWe basically gave away everything we made over the weekend at the restaurants except for what we owe in terms of delivery fees and food costs. At Peoples, we gave away the margin we made from the wines we sold, and some of our favorite wine importers matched our giving. After we did the calculations, we raised $20,000 in total.  We apparently had double the amount of wine sales we usually have because people bought to support. But this isn’t just about money; it’s about bringing awareness and attention to this issue of racial injustice. Money is just the vehicle.Fabián and I talk about race a lot, with him being Mexican and me being Chinese. But this is the first time that we’ve responded as a restaurant in this way. I don’t think we did anything heroic. I just wanted to make a point. I grew up in a very diverse area in Maryland, just outside of D.C. So I’ve always felt like it’s important to stand behind a cause like this because I’m a person of color. As an Asian American, you grow up confused. There is a privilege and unspoken passability at times, but also a sense of not being fully accepted as well.Around this time last year, we were at Dooky Chase’s in New Orleans. It was amazing to hear the granddaughter of Leah Chase [the legendary chef and co-owner who passed away last year] tell us stories and show us the dining room where tons of civil rights activists have eaten. There was a picture of MLK at Dooky Chase. Obviously, our restaurants are not the Dooky Chase of New York. But I’ve always felt like we were given our spots for a reason. At its core, a restaurant should be a place that serves people. Anything that gets in the way of being hospitable to everyone is against what a restaurant stands for, or at least that’s what I think.I don’t know if our restaurants are going to make it through the next year or the next couple years. So if we’re going to go out, if this is the last thing we ever do, it might as well mean something. We’re not going to talk about how broken the industry is or how little support we’re getting from the government. That seems silly right now. Now, more than ever, we’re going to do what represents us. We’re going to support the people on the front lines of change.Explore Bon AppétitNew YorkFirst PersonRestaurantsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-01", "author": ["Condé Nast", "Jeremiah Stone", "As Told To Elyse Inamine"]}