{"id": "24e45dbf34a21e3df34765e1723ef357", "url": "https://www.bonappetit.com/recipe/apple-honey-pecan-muffins", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Apple-Honey-Pecan Muffins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueApple-Honey-Pecan MuffinsBy Ochre Bakery, Detroit, MISeptember 17, 20193.8(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintEverything about this tender muffin from Ochre Bakery in Detroit (No. 4 on our Hot Ten list for 2019!) maximizes the flavor of tart apples and nutty pecans. The apple slices get glazed in honey before baking, while the pecan meal is deeply toasted. In the background, tangy buttermilk keeps everything from getting too sweet.IngredientsMakes about 1 dozenNonstick vegetable oil spray2medium Pink Lady or Jonagold apples⅔cup (75 g) pecans2Tbsp. unsalted butter2Tbsp. honeyFlaky sea salt¾cup (100 g) all-purpose flour½cup (60 g) spelt flour or all-purpose flour1½tsp. baking powder¼tsp. baking soda½tsp. kosher salt2large eggs, room temperature¾cup (150 g) granulated sugar¾cup plus 2 Tbsp. extra-virgin olive oil½cup buttermilkRaw sugar or granulated sugar (for sprinkling)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Lightly coat flat top of a standard 12-cup muffin pan with nonstick spray (this will prevent muffins from gluing themselves to the pan). Line cups with double layers of muffin liners. Cut apples into quarters; remove cores. Cut each quarter into 4 wedges; set aside.Step 2Pulse pecans in a food processor until you have a fine meal with a bit of texture, like coarse sand. Heat a large skillet over medium-high, then add pecans and toast, stirring, until darkened and very fragrant (it’s okay if they’re even a tiny bit burnt in spots), about 3 minutes. Transfer to a large bowl and let cool slightly.Step 3Wipe out skillet and return to medium-high heat. Melt butter, swirling pan so that it’s evenly coated, until foaming, then add reserved apples. Drizzle with honey and generously sprinkle with sea salt. Cook, tossing often, until apples are tender and deep golden brown and glazed with honey, about 5 minutes. Scrape into a medium bowl and let cool.Step 4Add all-purpose flour, spelt flour, baking powder, baking soda, and kosher salt to nuts; whisk to combine. Beat eggs and granulated sugar in the bowl of a stand mixer fitted with the whisk attachment on high speed until mixture is thick, pale, and tripled in volume, 8–10 minutes.Step 5Combine oil and buttermilk in a measuring glass. With motor running, gradually pour into egg mixture, stopping as soon as incorporated to prevent eggs from deflating. Scrape into bowl with dry ingredients and fold until just combined (be careful not to overmix). Scoop about 2 Tbsp. batter into each muffin cup and place an apple slice on top. Divide remaining batter among muffin cups, filling until just below the top (you may have a spoonful or two of batter left over). Place 1 apple slice on top of each, then spoon any glaze left in the bowl on top. (You’ll have a few leftover apple slices; eat them.) Sprinkle each muffin with some raw sugar and a pinch of sea salt.Step 6Bake muffins until golden brown all over, rotating pan halfway through, 22–28 minutes. Let cool in pan 10 minutes, then transfer to a wire rack and let cool completely.Step 7Do Ahead: Batter can be made 2 days ahead. Cover and chill.How would you rate Apple-Honey-Pecan Muffins?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI followed the directions exactly along with adjusting to our high altitude.  Seems that mixing eggs and sugar so long isn’t necessary.  Muffin cups should only be filled about half full.  Larger muffin tins are best.  I used regular 12 muffin size and had enough left over batter for 4 large muffins.  The muffins in the larger size were better.  Recipe is way too oily.  A complicated recipe that sounded good but isn’t, sorry to say. Had to throw out the 12 in the regular sized tins.  They ran over the sides and into the over.  Even though I used muffin liners, they were impossible to remove.  The muffin liners were soaked in olive oil.  Not my kind of muffin.New Mexico5/24/2020Yum - I had to eat one right out of the oven! They taste delicious - would like to know if the outsides are meant to be crunchy/if there is meant to be a hard top. Mine aren't - still delicious but not sure if something went wrong. Also - maybe my cups were smaller than the recipe called for but the batter stretched to about 18-20! AnonymousLondon, UK4/26/2020These were delicious. The texture and the taste was amazing thanks to the ground toasted pecans. The only problem I had was that they didn't hold together very well. I'll try whipping the eggs a little bit less next time. I made them with maple syrup instead of honey and it was delightful. I also cut the apples into smaller pieces Will definitely make them again. Might try adding more apple slices into each muffin. AnonymousQuebec4/4/2020Super tasty and moist (even after skipping all of the egg whipping)! My muffin tops got lightly crispy in a very good way. butterslavePortland, OR1/13/2020I have literally just pulled these muffins out of the oven and had to try them immediately and WOW! They're some of, if not the best muffins I've ever made. The recipe is perfect - I thought there was the right amount of apple in there and I dusted the tops with a little bit of brown sugar. I also didn't have the spelt flour, so I just used all-purpose and they're fine. Some are unsure about the olive oil, but it gives them a nice flavour! Best devoured warm.Gold Coast, Australia12/2/2019Made this yesterday, it certainly is a lot of pans and bowls to clean but that was fine as I was looking for a project. Not sure why it says 2 apples if you are cutting each apple into 16 pieces and putting one in each of the dozen muffins the recipe says it makes. That being said I had quite a bit of batter left over after putting 2 tbls batter in each muffin cup. I only used one large apple and had four pieces left over which I added along with the leftover batter to a 6\" springform pan which made a lovely little cake for the freezer. I stuck to the recipe, spelt flour included and only subbed a yogurt/milk mix for the buttermilk as well as adding some vanilla. I loved the trick of toasting the pecan meal and will definitely be doing that in other recipes that call for nut meal. The soft crumb is nice and mine had a pretty lacey top. I think you could easily sub the apples for pears or french plums and the pecans for walnuts which I might do next time. All in all a fun recipe if you're looking for a project and find washing dishes meditative. shallotsandbutterLos Angeles10/15/2019Olive oil: I used a light oil. I’m glad I did. I can see where one poster said it tasted too much like olive if they used a virgin oil. It was a *little too oily .. I will cut out the extra 2 Tb\nI used whole wheat instead of spelt flour I didn’t have.\nFamily thought the ingredients would be weird and were not optimistic they would like these but they did. They were improved with the addition of leftover salted Carmel frosting I had from cinnamon rolls 😁. AnonymousLancaster, PA10/9/2019This recipe is horrible...... Super mushy and All I can taste is olive oil. Which is usually fine, but not in an apple muffin. Unfortunately all of them went into the bin. Completely inedible.AnonymousSalt Lake City10/6/2019Made these tonight and added apple to the batter. I liked that they were not super sweet but I wish I had added cinnamon and vanilla to the batter for more flavor. abeauSouth Carolina9/30/2019A truly amazing muffin recipe. I noticed that some users said that they wished there were more apples on the muffins, so I added an extra apple and I don't regret it. I also had no honey on hand and substituted it with maple syrup. 10/10 would make again.AnonymousOttawa9/26/2019Pros:\nSoft crumb\nTasty flavour of muffin base \nInstagrammable\n\nCons:\nGreasy\nNot enough apple\nToo many dishes for a tiny kitchen\n\nAnonymousToronto9/23/2019These are phenomenal. Beautifully soft crumb, delicious flavor, tiny bits of pecan in every bite, sweet tender apples. Wow. I couldn't find spelt, so I used all all-purpose flour. Going in, the olive oil weirded me out a bit, I wasn't sure going in, but I think it really adds to the flavor, I wouldn't substitute it. My only critique of these is that I loved the apples and wished there were more. Next time I make these I'll probably throw in an extra apple. Wishing I lived in Detroit so I could go to this bakery and try all of their baked goods! abbyrnkn4422AL9/22/2019Haven’t tried this one yet. Just curious about the olive oil. Do you think it necessary or can you sub in a more neutral flavored oil?jobrewstBoston9/19/2019Explore Bon AppétitMuffinPastriesAmericanPecanNutAppleFruitButtermilkOther IngredientsFallSnackVegetarianBakingRosh HashanahBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}