{"id": "24e7aeb405adf834ab471dd9681760dc", "url": "https://www.bonappetit.com/recipe/crispy-taiwanese-pork-cutlets", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Taiwanese Pork Cutlets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueCrispy Taiwanese Pork CutletsBy Lisa Cheng SmithNovember 19, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintSweet potato flour makes the crispiest crust for these pork cutlets, while a soy marinade gives them extra depth. Flatten the pork chops with the dull edge of a cleaver or heavy knife to give the surface an almost fluffy texture and help the potato starch coating adhere. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 small servingsFive-Spice Powder2½4\"-long cassia or cinnamon sticks20whole star anise1Tbsp. plus 1 tsp. whole cloves20slices dried sand ginger (optional)2Tbsp. plus 1½ tsp. Sichuan peppercorns2½tsp. sliced dried licorice root or fennel seeds1tsp. black peppercorns1tsp. white peppercorns (optional)Pork and Assembly4½\"-thick boneless pork loin chops (about 1 lb.)⅓cup soy sauce⅓cup unseasoned rice vinegar2Tbsp. soy paste (such as Yu Ding Xing)2tsp. granulated sugar½tsp. freshly ground black pepper¼tsp. freshly ground white pepper (optional)¼tsp. ground cinnamon1½cups Chinese sweet potato starchVegetable oil (about 3 cups; for frying)Gochugaru (fine Korean red pepper powder; for serving; optional)Special EquipmentA spice mill or coffee grinder; a deep-fry thermometerPreparationFive-Spice PowderStep 1Toast cassia, star anise, cloves, sand ginger (if using), Sichuan peppercorns, licorice root, black peppercorns, and white peppercorns (if using) in a small skillet over medium, tossing once, until fragrant, about 3 minutes. Let cool; grind to a powder in spice mill or coffee grinder.Step 2Do Ahead: Five-Spice Powder can be made 1 month ahead. Store airtight at room temperature.Pork and AssemblyStep 3Working one at a time, place pork chops on a cutting board and use the back of a cleaver or heavy chef’s knife to pound meat, moving knife back and forth across the surface, to ⅛\"–¼\" thick. The surface will be jagged and textured.Step 4Whisk together soy sauce, vinegar, soy paste, sugar, black pepper, white pepper (if using), cinnamon, ¼ tsp. Five-Spice Powder, and ⅓ cup water in a large bowl. Add pork chops and turn to coat well. Cover and chill at least 2 hours and up to 6 hours.Step 5Remove pork from marinade and pat dry. Place sweet potato starch in a large shallow dish. Working one at a time, dredge pork in starch to coat well on both sides; shake off excess and transfer to a plate.Step 6Clip thermometer to the side of a large skillet or pot and pour in oil to come ½\" up sides. Heat over medium-high until thermometer registers 350°. Working in batches, fry pork until just golden, about 30 seconds per side. Transfer to a wire rack set inside a rimmed baking sheet and let drain.Step 7Repeat process, frying pork a second time until deep golden brown, about 30 seconds per side. Return to rack and let cool slightly.Step 8Transfer pork to a cutting board; slice into strips. Arrange in a single layer on a platter; sprinkle with gochugaru if using.How would you rate Crispy Taiwanese Pork Cutlets?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe intro says sweet potato flour yet the ingredient list calls for sweet potato starch.  Which should be used? Thanks!wendydennisMassachusetts1/8/2020How Did 6 To 8 Ingredients , Even If You Left Out The 2 Optional Equal 5 Spice Mix ???lillythedogKansas City Mo.11/24/2019Explore Bon AppétitCutletTaiwaneseEast AsianAsianPork LoinPorkMeatMainNut-FreeDairy-FreeDeep-fryLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}