{"id": "24ffa244041105da9fc04ac2ba8070f5", "url": "https://www.bonappetit.com/recipe/chocolate-date-caramel-cups", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Chocolate Date-Caramel Cups Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChocolate Date-Caramel CupsBy Sarah JampelDecember 26, 20194.9(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintAssembling these dessert cups in muffin tin liners (just the liners!) helps speed up the process and ensure the sticky date caramel doesn’t get out of hand. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. IngredientsMakes 12¾cup chopped raw nuts (such as pecans and/or walnuts)¼cup unsweetened coconut flakes2Tbsp. raw sesame seeds1cup pitted Medjool dates (about 6½ oz.)¾tsp. kosher salt6oz. bittersweet chocolate (about 1 cup), chopped1tsp. virgin coconut oilFlaky sea saltPreparationStep 1Preheat oven to 300°. Arrange 12 standard muffin liners on a rimmed baking sheet or large plate.Step 2Spread nuts, coconut, and sesame seeds in an even layer on a small rimmed baking sheet and toast, stirring once or twice, until nuts are darkened and fragrant and coconut is starting to brown, about 10 minutes.Step 3Meanwhile, place dates in a medium heatproof bowl. Pour boiling water over to cover dates and let soak 10 minutes. Drain dates, reserving soaking liquid.Step 4Transfer dates and 2 Tbsp. soaking liquid to a food processor. Add kosher salt and pulse, scraping down bowl occasionally, until smooth and creamy, with no large pieces of dates remaining. Be patient: It will take about 3–5 minutes. If you’re having trouble getting the dates to break down, add more soaking liquid 1 tsp. at a time. You should have about ½ cup date caramel.Step 5Melt chocolate and oil in a heatproof bowl in the microwave in 20-second increments, stirring in between, until smooth and glossy, about 1 minute total. Pour about 1½ tsp. melted chocolate into each liner (no need to be exact, you just want a thin layer). Top with a small scoop of nut mixture, pressing to spread out the chocolate a bit (you want every nut to be in contact with chocolate so it won’t fall off). Using 2 spoons, dollop about 1 Tbsp. date caramel into each, pressing to gently spread down and around. Top each cup with 1 tsp. melted chocolate, using the back of a spoon to spread it around and cover as much caramel and bare nuts as possible. Sprinkle with remaining nut mixture and sea salt.Step 6Chill until chocolate is firm, about 1 hour.Step 7Do Ahead: Caramels can be made 3 weeks ahead. Store in an airtight container and keep chilled.How would you rate Chocolate Date-Caramel Cups?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThese cups are very tasty! I especially liked the touch of salt, yum yum! I found them to be VERY sweet though, so I’ll try a mini cup next time. Definitely an indulgence recipe!Miyuki HamakawaVancouver, Canada6/26/2021Can I use a greased muffin pan instead of the liners?MariNJ5/25/2021These taste great, but the recipe doesn’t make enough date caramel. It makes 1/2 cup which is 8 tablespoons. You need another 1/4 for 12. AnonymousToronto9/6/2020There are INSANE. So, so good. I used extra chocolate, dates, and coconut oil, and these taste like something I would spend $9 on at Whole Foods. SO GOOD! Anonymous5/6/2020I’ve made these three times now... each time increasing the amount I make. The flavor is unreal - the combination of salty, sweet, and nutty is perfectly balanced and so indulgent. Making them in silicon liners helps keep mess down and they freeze beautifully. Make them! Whatever you think these are going to taste like - forget it. Forget everything you’ve ever thought. They are so indulgent and guilt free (I am a total dessert advocate so no sweet-shaming here, but I guess it’s a perk). You’d never know that these are ‘healthy-ish’. MAKE THEM. AnonymousWashington DC 4/26/2020I dont know why it took 22 years of my life to figure out i dont like dates. But my roommate really liked the recipe so I'll give it a 5 starAnonymouscanada3/31/2020Hi! Something good comes out of self quarantine! I have been wanting to try this recipe for months! So delicious! I HIGHLY recommend using the smaller candy size paper cups as this is a very rich flavor combination. The layering is a little slow, but you will get into a rhythm after a few trys. I started by making just one tester and refrigerating for an hour to make sure it was worth the effort. INDEED it is!AnonymousCarmel, CALi3/17/2020This recipe is fire. You think, oh, this will be good and easy. But it's SO MUCH BETTER than you can even imagine. AnonymousNew York3/2/2020Chocolatey-nutty-slightly-salty-and-a-bit-exotic treats rocking my world right now. I followed the recipe exactly, worked out fine--just don't use a heavy hand with the chocolate. Used a blender (don't have a food processor) for the date caramel, but don't recommend it; had to add quite a bit of water to puree it adequately. Still delicious.ihatemuffinsWaco, TX1/12/2020These are so good!! I used hazelnuts, and made them in mini cupcake liners. Perfect size. Recipe made 24 mini cuties, and I had juuuuust enough chocolate for that.AnonymousWashington, DC1/7/2020These are amazingly good! They have this light crunchy texture that is so much better than plain chocolate bark could ever be, and the date caramel is great- doesn’t taste “healthy” at all frankly. I made them in mini muffin cups and used 7oz of chocolate (that’s what my 2 bars weighed) and I got a yield of 30. A little fussy but absolutely worth the effort.AnonymousWashington DC1/6/2020This recipe is great. All the flavors worked so well together, loved the addition of sesame seeds. I did switch out the walnuts for almonds because I'm not a fan of walnuts, but other than that, I followed the recipe and it turned out amazing. Everyone that has tried it so far has loved it. AnonymousSouthern California1/5/2020These are amazing. I had plenty of chocolate (did not need to double it). I just used a little on the bottom of the muffin liner and swirled it around.AnonymousAtlanta1/5/2020These are incredible. Date caramel might better than the real thing if we're being honest (and we are). I would like to second the comment about doubling the chocolate and coconut oil. My initial batch of melted chocolate only covered the bottoms of 12 parchment muffin tin liners and I needed to make another batch to cover the tops. Also, when I inevitably make these again I might do a double batch in order to make the date caramel easier to process in a food processor. I have a standard full-sized processor and the amount that goes into the bowl for just a single batch is a little small and makes the date caramel take while to get fully processed by the blades. Doing a double batch would solve that issue I think. Those couple of small things aside, this recipe is a homerun for sure. BMWhitehurstTexas1/2/2020These are so good.  However, I needed to double the bittersweet chocolate and coconut oil.  I used silicon backing cups (average size) and the initial chocolate batch covered a think layer for all 12 cups.  I needed to make a second chocolate mix in order to cover the date caramel.  Not sure if this recipe was meant for mini cupcake tins?michellerobinetDenver, CO12/31/2019Explore Bon AppétitCandyDessertChocolateOther IngredientsDateDried FruitFruitPecanNutWalnutSnackDairy-FreeGluten-FreeVeganVegetarianHealthyishSuper BowlPassoverRosh HashanahRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Sarah Jampel"]}