{"id": "2501f2931b91bb11754fd635f0afd391", "url": "https://www.bonappetit.com/story/unscented-candles", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "The 17 Best Unscented Candles for Your Holiday Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe 17 Best Unscented Candles for Your Holiday TableBurn, baby, burn.By Hilary CadiganNovember 10, 2021FacebookTwitterEmailPhoto by Emma Fishman, Prop Styling by Dayna SemanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’ve always been very fond of candles, so much so that I have previously identified myself as a candle expert without a hint of irony or shame. But while scented candles are my usual go-tos, eating turkey redolent of tuberose and patchouli isn’t exactly the most appetizing. That’s why I focus my holiday tablescape energies on unscented candles in an eclectic mix of shapes and colors. See: an amber tower of river rocks, a pyramid with golden inlay, a bust that could have been sculpted by Michaelangelo, a pair o’ legs. These sculptural beauties bring the vibes but let the stuffing biscuits speak (er, smell) for themselves. Plus, putting a few different kinds together on the same table makes the fact that none of my plates match look intentional. Rock Cairn Candles$57.50 at Amazon$55 at EtsyAreaware Totem Candle$20 at Amazon (Large candle)$60 at Food 52 (Set of 3)David Bust Candle$79 at Wolf and BadgerTwist Duo Standing Taper Candle$40 at Urban OutfittersBrushed Brass U Candle$120 at Food52Baby Won’t You Light My Legs Candle$75 at Nordstrom$75 at Dada DailyHay Pillar Candle$59 at End.Tan Soy Wax Candle Set$95 at SSENSENanao Japanese Candles$68 at JinenWavy Candle$16 at EtsyMilk Candle$35 at GessatoPink Knubby Candle$45 at SSENSEBalloon Dog Candle$27 at EtsyMarbled Candles$13 at EtsyHay Twist Candle$35 at End.Rose Gold Rimmed Ivory Geometry Candles$150 at CaiCai HandmadeStack Tower Mother & Child Candles$88 at Mohawk General StoreExplore Bon AppétitShoppingCultureEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-10", "author": ["Condé Nast", "Hilary Cadigan"]}