{"id": "25263a68ff847e7e965da7bfd0370bf5", "url": "https://www.bonappetit.com/story/never-fail-spicy-lightly-pickled-cucumbers", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "These Quick-Pickled Cucumbers Finally Sold Me on Pickles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Quick-Pickled Cucumbers Finally Sold Me on PicklesI was just never a pickle person. But these spicy, slightly sweet quick-pickled cucumbers changed all that.By Jesse SparksFebruary 15, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.When I was little, I believed with all of my heart that cucumbers and pickles were two separate things entirely. Some kids believed in the Tooth Fairy. Some kids believed in Slenderman. I believed that pickles and cukes were completely biologically distinct. (Kids say the darndest things, am I right?) After all, how could one of my favorite vegetables ever be reduced to the hyper-salted, bloated blobs I watched float in plastic tubs at my brother’s sweltering track meets? Did I eat the occasional pickle chip on a sandwich or a burger? Sure, I guess. But I was never going to seek out one of those rubbery, vinegar-y, seemingly-radioactive monstrosities. I wasn’t a pickle person. Or so I thought.To my seven-year-old mind, cucumbers were nature’s crisp and refreshing response to literally anything bad in the universe. Looking for something that will make you feel more hydrated than the woman constantly getting splashed in a Neutrogena commercial? Overwhelmed by the state of the world? Snack on some cucumber slices and think calming thoughts. The same could not be said for pickles.Fast forward to last December, when Andy Baraghani’s recipe for spicy lightly pickled cucumbers came into my life. These juicy spears of cukes merged my love for the fresh snap of raw cucumbers with the bright pungence of pickling (without the rubbery texture I’d encountered at those concession stands), and I’m a better person for it. The keys to this recipe are its nuance and simplicity. You could probably find almost all of these ingredients chilling in your fridge on any given night. But if you don’t already have them, you’ll be sure to stock up after giving this recipe a go.Smashed or sliced, pickled or raw, cucumbers are nature's perfect food. But these quick-pickled cucumbers are a definite improvement on nature's finest.\nPhoto by Alex LauJust cut your cucumbers—ideally the cute little Persian guys—into spears and toss them into a large bowl with vinegar, sugar, red pepper flakes, and salt. Then leave them alone for anywhere between one and six hours. Right before serving, toss them with a bit of chopped dill and lemon juice and you’re good to go. That’s it. That’s all it takes to create these quick-pickled cucumbers, an appetizer that’s going to elicit compliments all night long. They've been my go-to bring-along snack for any kind of gathering I'm attending, whether it’s movie night, a housewarmings, or even the potluck I hosted for my birthday.The sugar, salt, and red pepper flakes combine to form a holy trinity of sweet, salty, and spicy, all three in perfect balance. Red pepper flakes add a light warming touch while a subtle sweetness and salinity keep you reaching for another spear almost as soon as you’ve finished the one you’re chomping on. In my book, that counts as a win.Get the recipe:Spicy Lightly Pickled CucumbersThese zippy, zingy, crunchy pickled cucumbers are sure to be the sleeper hit of your party spread.View RecipeExplore Bon AppétitBasicallyNever FailCucumberPickleappetizerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-15", "author": ["Condé Nast", "Jesse Sparks"]}