{"id": "2526f97e6fdbf5838e01301f0f5969dc", "url": "https://www.bonappetit.com/recipe/spicy-larb-with-cabbage-cups", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Larb with Cabbage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSpicy Larb with Cabbage CupsBy Andy BaraghaniMarch 20, 20185.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintLarb will not only fill your belly, it will teach you how to balance sweet, sour, salty, spicy, funky, and umami flavors. Larb hails from Laos and gets its addictiveness from the way it stitches together ground meat and crunchy, juicy textures. When you get the balance right, this dish sings, each bite creating a craving for more.Ingredients4 servings½cup raw skin-on peanuts2Tbsp. vegetable oil4garlic cloves, crushed1lb. ground pork, beef, or lambKosher salt1large shallot, thinly sliced into rings5scallions, thinly sliced4red or green Thai chiles, thinly sliced1lemongrass stalk, bottom third only, tough outer layers removed, thinly sliced2Tbsp. fresh lime juice1Tbsp. plus 1 tsp. fish sauce1cup torn mint leaves¼head of green cabbage, halved crosswise, leaves separatedCooked short-grain rice and lime wedges (for serving)PreparationStep 1Preheat oven to 350°. Toast peanuts on a rimmed baking sheet, tossing halfway through, until skins are slightly darkened and nuts are golden brown, 6–8 minutes. Let cool, then coarsely chop or crush into small pieces.Step 2Heat oil in a large saucepan over medium-high until shimmering. Add garlic and cook, smashing down on cloves to break into smaller pieces with a wooden spoon, until some parts are golden brown, about 3 minutes. Push garlic to one side of pan, then add pork and a pinch of salt to the other side. Cook, smashing and stirring pork and garlic together, until no clumps remain and meat is no longer pink, about 4 minutes. Be careful not to overcook; as soon as you can’t see any pink, remove from heat. Mix in shallot, scallions, chiles, lemongrass, lime juice, fish sauce, and half of peanuts. Let larb cool slightly, then stir in mint. Taste and season with more salt if needed.Step 3Transfer larb to a large bowl. Serve with cabbage, rice, lime wedges, and remaining peanuts.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Spicy Larb with Cabbage Cups?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis is a favorite \"go to\" for a quick, healthy, and super tasty dinner! I usually use ground turkey, and just chop up the cabbage into thin slices and toss it in at the end of cooking. It's a crowd pleaser!\nMagnolia MerSeattle, WA10/6/2021Really good with ground chicken. I have made it many times and use Serrano chiles as they are easier to find in the Southwest. I love this as a FAST healthier alternative to takeout. New mexico7/19/2020Excellent. Doubled the recipe, added toasted rice powder and a bunch of red pepper flakes + more fish sauce. Tasted exactly how it should and came together in under 30 minutes. SrAsparagusOakland, CA4/7/2020This is so yummy! I make a boiled style of larb as well, this one is a bit cozier and richer, but they both have their place. For me, I like to add some cilantro and a little toasted rice powder; but the recipe is great as is. Good in cabbage or lettuce. AnonymousNYC1/23/2020We raise lamb and I'm always looking for great ways to prepare it. This larb recipe was indeed easy and very  very tasty. We'll use our precious ground lamb on this again! I think it needs more saltiness and I didn't have hot enough peppers on hand. I had softball-sized tiny cabbages from the cabbage plants in the garden that just kept producing, these provided super cute bright purple cups. Jill PridgeonNewport OR10/29/2019Delicious and easy. Used Chicken for health reasons, but would rather have used lamb. Still yummy.AnonymousSeattle10/7/2019Wowee!  This is an amazing dish!  I combined the mushroom recipe with this one using ground pork and was pleasantly surprised.  I can't believe how easy it is. Definitely adding this into our dinner rotation.  Thanks BA!        👍😍thekikuSan Diego, CA 5/20/2019Delicious, and quick enough for a weeknight. If you're a fish sauce fan like I am, give it a taste before serving -- you may even want to add extra :) A keeper!AnonymousCalifornia5/16/2019So so good, and so easy!  For those of you that are uneasy with fish sauce, it tastes great with soy sauce too.Anonymoussan diego1/16/2019Holy shizzzzz. This recipe is 100% a keeper. I sprung for some really good quality ground lamb, and it was so incredibly tasty.  I left out the lemongrass since I spent all my pennies on the lamb and didn't even miss it, but I will add it next time because I'm definitely making it again. kenzieforrestohio 8/24/2018Explore Bon AppétitLarbSaladLaotianSoutheast AsianAsianGround PorkPorkMeatGround BeefBeefGround LambLambGreen CabbageCabbageLeafy GreensVegetableThai ChileChileEasyWeeknight MealsQuickMainDairy-FreeHealthyishEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Andy Baraghani"]}