{"id": "2545b0fdb8d115f107a2cc2cd0739758", "url": "https://www.bonappetit.com/story/damascus-bakery-tahini-bread", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "I’d Give Up All Other Breakfasts for This Amazing Tahini Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Give Up All Other Breakfasts for This Amazing Tahini BreadIt’s a little bit savory, a little bit sweet, and a lot delicious.By Meryl RothsteinNovember 19, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.This is not a story about Sahadi’s, the beloved Middle Eastern shop on Atlantic Avenue in Brooklyn. But I’m going to start by talking about Sahadi’s, where I used to shop weekly, back when I lived a few blocks from the store. Most Saturdays, I’d stop in for bulk bin nuts and dried fruits, spices, and tubs of hummus and labneh. This habit continued for years before I realized that one of the best breakfasts in Brooklyn was sold literally next door. Week after week, I unwittingly walked right past Damascus Bread & Pastry Shop, my hummus blinders on and completely unaware of the tahini bread sold at this beloved Middle Eastern shop on Atlantic Avenue in Brooklyn.Eventually my then-coworker Belle tipped me off to the 89-year-old Syrian bakery’s tahini bread, a dense, dimpled round with just three ingredients: flour, sugar, and tahini. It has become one of my favorite breakfasts, ideal with a cup of black tea or coffee. It’s lightly sweetened but not super sweet—the nutty sesame flavor still stands out—and rich from the tahini but not a butter bomb. It’s a lot more fun than having oatmeal for breakfast, but it doesn’t feel like eating a full-on dessert at 8 a.m. It has a beautiful dark brown bottom, a product of the pizza oven it gets baked in, and every so often you’ll get a bite where it seems like the tahini wasn’t fully incorporated, like a ribbon of halvah running through it.This still isn’t a story about Sahadi’s, but I do want to encourage you to go there—not (just) for the nuts and fruits and hummus, but also because right next door is Damascus, a wonderful bakery selling the most wonderful tahini bread.Go there: Damascus Bread & Pastry ShopExplore Bon AppétitHighly RecommendBreadNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Meryl Rothstein"]}