{"id": "254de05acc3df051b81663c662e1ed85", "url": "https://www.bonappetit.com/story/never-fail-shrimp-scampi", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Make Me This Shrimp Scampi Recipe and I'll Help You Move Into Your Six-Floor Walk-Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Me This Shrimp Scampi Recipe and I'll Help You Move Into Your Six-Floor Walk-UpDrive you to the airport? Mow your lawn? Make me this shrimp scampi recipe and I'm there.By Alex DelanyAugust 17, 2018FacebookTwitterEmailLaura MurrayFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.If you want me to show up to a location or perform an arduous task, casually slip in the fact there will be garlicky seafood there. I will show up.Hey dude, want to help me move next Saturday? My new spot is a six floor walk-up without A.C. There will be linguine alle vongole. Yes. Sounds great! I’ll be there.Hey dude, I need to give my dog it’s new medication, and it’s really a two person job. Will you come assist me in the procedure? I’m making some steamed mussels in a garlicky tomato sauce. Of course! It would be my pleasure to hold down your hundred pound Doberman while you attempt to get it to swallow pills.Hey dude, I have to drive my Great Aunt Bertha to my Mom’s house in Ohio. The speakers in my car don’t work, but it’s a quick six hour drive. And she doesn’t really yell that much. I made some shrimp scampi for the road. Packed it all up in Tupperware. And Great Aunt Bertha is bringing some crispy bread for dipping. Will you come to keep me company? Wow. Really? When do we leave? I am DOWN.Because shrimp scampi is the real ticket, the greatest excuse to bask in the comforts of shrimp, garlic, wine, and butter. It is the simplest of meals, with the most indulgent payoff, and we have a pretty damn good recipe for it. There’s nothing in this scampi recipe that will be unfamiliar to you. All of these ingredients are very run-of-the-mill stuff that you probably have in your fridge or pantry already.It starts with taking your shrimp and marinating them briefly in a mix of kosher salt, grated garlic, and oil. Microplaning the garlic is the secret for getting a deep flavor into those crescent-shaped crustaceans and turning up the sauce from one to eleven.The scampi comes together quickly after that. You cook the shrimp halfway and then remove them from the pan. At that point, you cook a bunch of sliced garlic in the remaining oil, lemon juice, and a bit of wine, before adding the shrimp back into the pan and bringing the whole thing home.If you really want to do it up, serve this with garlic bread. But that's only for the true garlic daredevils.\nHirsheimer & HamiltonThis scampi starts and ends with really working garlic and fat into your shrimp, and it’s a worthwhile effort. By the end, each bite of tender shrimp is completely suffused with layer after layer of flavor. Acid from the lemon. Heat from chile flakes. Creaminess from the butter. A little bit of fruitiness from the wine. And equal parts bite and sweetness from the garlic. It’s a roster of simple flavors that turn into a beautiful symphony.But this is really just proof that scampi doesn’t have to be dumped on top of pasta. Sure, many of the Italian-American restaurants of our time have done just that, but in my eyes, shrimp scampi does its best work when served on a big platter surrounded by warm crusty bread. Dip your bread into that sauce, and pile a few tender, flavorful shrimp on top. Eat. Again. And again. And again. Is this a single serving? Or an experience for the whole family? That’s up to you. Either way, doubling this recipe won’t hurt.But I can’t stick around while you decide. I have to run. Great Aunt Bertha is outside in the car. And...yes, it looks like she brought the bread.Oh! And here's the shrimp scampi recipe in question. It will not fail you:Shrimp ScampiThis shrimp scampi recipe gets an extra punch of garlicky flavor from a short marinade before cooking. Serve it with bread to sop up the rich pan sauce.View RecipeExplore Bon AppétitBasicallyShrimpNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-17", "author": ["Condé Nast", "Alex Delany"]}