{"id": "2562c80f3d70d146a9599b7603dac7ef", "url": "https://www.bonappetit.com/recipe/aloo-and-chana", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Aloo and Chana Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueAloo and ChanaSeptember 22, 20204.3(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Rey LopezEmailPinterestPrintEmailPinterestPrintThis comforting, spiced mash of fork-tender potatoes and creamy chickpeas is just one of many dishes that show up in Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast. As you cook the potatoes, add just enough water so they can steam and turn tender without sticking to the pot. You want the final texture to have chickpeas and broken chunks of potato suspended in a delicious mash. Serve it alongside Fruit Chow, Tomato Choka, Curry Goat, and the main event: the flaky Buss Up Shut Paratha Roti.Ingredients4 - 6 Servings2Tbsp. vegetable oil2Tbsp. Chief Brand or Madras curry powder2tsp. ground cumin1medium onion, chopped2Scotch bonnet or habanero chiles, 1 finely chopped, 1 whole⅔cup Green Seasoning, divided1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1lb. Yukon Gold potatoes (about 3 medium), peeled, cut into ¾\" pieces115.5-oz. can chickpeas, rinsed, or 1½ cups cooked chickpeas2Tbsp. store-bought or homemade mango kuchela (optional)Lime juice (for serving)PreparationStep 1Heat oil in a medium Dutch oven or other heavy pot over medium-high. Add curry powder and cumin; cook, stirring constantly, until fragrant and slightly darkened in color, about 30 seconds.Step 2Add onion, chopped chile, ⅓ cup Green Seasoning, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt to pot and cook, stirring occasionally, until onion is softened and translucent, about 3 minutes. Add potatoes and remaining whole chile and reduce heat to medium-low. Cover pot; cook, stirring occasionally and adding a splash or so of water if mixture looks dry or is sticking to bottom of pot, until potatoes are fork-tender, 30–35 minutes.Step 3Add chickpeas, mango kuchela (if using), and remaining ⅓ cup Green Seasoning to pot. Cover again and cook, stirring occasionally and adding a splash or so of water if mixture looks dry or is sticking to bottom of pot, until some of the potatoes fall apart and become creamy, 25–30 minutes. Mix in lime juice; taste and season with more salt.How it all comes togetherStep 4Use the silky shreds of roti to scoop up all the various curries, chows, and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Aloo and Chana?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThere is way too much salt in this dish! I would cut it back to 1 teaspoon next time. Anonymouscold spring, ny2/9/2022whew, this one is <b>SPICY</b>. It was fun to make the Green Seasoning, and overall the dish was not super labor intensive. I was pretty generous with the seasoning since that recipe makes a ton, so that could explain the spicy level. I agree with the other reviewer that I'll be a little hesitant eating the left overs since its so intense. Enjoy! KonstantinDurham, NC2/7/2022Such a comforting, limey dish with nice heat. It is a bit involved to make the green seasoning (mostly because it requires a lot of ingredients), but you really can't skip it. Don't sub Trinidad seasoning peppers with more 3 more scotch bonnets like I did. Once you have the green seasoning, it is simple to make. I found that the potatoes took 15-20 minutes longer than the recipe calls for...and it dried out a few times, so you'll want to keep an eye on it. Overall it was pretty good, but I didn't end up reaching for the leftovers.AnonymousBrooklyn, NY10/27/2020Explore Bon AppétitTrinidadianCaribbeanPotatoVegetableChickpeaBeanYukon Gold PotatoSideGluten-FreeDairy-FreeVegetarianVeganSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}