{"id": "256428b5b9fa738cbb62c0972b168ba4", "url": "https://www.bonappetit.com/recipe/genoise", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Genoise (Sponge Cake) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueGenoiseBy Natasha PickowiczSeptember 18, 20183.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintClassic genoise can be flavorless and dry. Not this one: It’s moist, eggy, slightly sweet, and tempting to eat plain. Use this genoise recipe to make Black Forest Layer Cake with Cherry Preserves, Tiramisù Layer Cake with Mascarpone Mousse, or Vanilla Layer Cake with Mango Curd.Ingredients16(240 g) large egg yolksNonstick vegetable oil spray1½cups (300 g) sugar, divided12(360 g) large egg whites1½tsp. kosher salt2Tbsp. vanilla extract1⅔cups (200 g) all-purpose flour; if making chocolate version, decrease by 6 Tbsp. (50 g)½cup (50 g) Dutch-process cocoa powder (for chocolate genoise; optional)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 400°. Lightly coat two 18x13\" rimmed baking sheets with nonstick spray and line with parchment paper, leaving a slight overhang on longer sides. Smooth to eliminate air pockets. Lightly coat parchment with nonstick spray. Beat egg yolks in the bowl of a stand mixer fitted with the whisk attachment on medium-high speed until light and frothy. With the motor running, gradually stream in ¾ cup sugar and beat until super voluminous and light and mixture leaves a very slowly dissolving ribbon when it falls off the end of the whisk and back into the bowl, about 4 minutes. Rub a small dab between your fingers—it should be grit-free (this means all the sugar is dissolved). Scrape yolk mixture into a large wide bowl.Step 2Thoroughly wash and dry mixer bowl and whisk, then beat egg whites and salt on medium-high until frothy. Increase speed to high and gradually add remaining ¾ cup sugar in a steady stream. Beat until meringue is glossy and forms medium peaks, about 3 minutes; beat in vanilla. (Do not overbeat—it will look dry and curdled—this makes it difficult to fold in and yields a dense genoise).Step 3If making chocolate genoise, sift flour and cocoa powder over egg yolk mixture (or just flour if making vanilla). Vigorously fold in with a large rubber spatula, running it down along bottom of bowl and lifting up through center and over the top as you rotate bowl. The mixture will seize up and thicken quite a bit. Add one-third of meringue and mix thoroughly to incorporate (this will lighten the batter). Gently fold in remaining meringue in 2 batches (err on the side of mixing less rather than more; it’s okay if a few streaks of batter remain).Step 4Divide batter between prepared baking sheets and spread evenly with a large offset spatula, working into corners. Bake, rotating pans from top to bottom and front to back halfway through, until top is golden and center springs back when gently pressed, 10–14 minutes. Let cool.Step 5To cut out rounds, fit a 9\"-diameter cake or springform pan into a corner of the baking sheet and work a small paring knife around pan to cut out a full circle.Joe WilsonStep 6Move cake pan directly next to the first cutout and cut around it again to make a partial circle. It should be about two-thirds of a full round.Joe WilsonStep 7Move pan again and cut a third partial circle using as much of the remaining cake as possible. This will be the smallest.Joe WilsonStep 8Align the two partial circles so they form a 9\" round. Trim overlap so cake pieces fit together.Joe WilsonStep 9Save scraps for another use (trifle!). Repeat cutting process with second cake to make 2 more rounds. When you're done, you should have four 9\" rounds (2 whole rounds and 2 formed from multiple pieces).Step 10Do Ahead: Genoise can be baked 1 day ahead. Store tightly wrapped at room temperature, or freeze up to 1 week. Thaw at room temperature before using.How would you rate Genoise?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI hate to be ~that~ person, but I'm pretty sure this is a fatless sponge and not a genoise. The technique laid out in this recipe is almost identical to the sponge recipe in Julia Child's \"The Way to Cook,\" and, as others have commented, there's generally butter in a genoise. mc5ulliWashington, DC11/1/2019I will add that if you want to try this recipe, please have everything warm--eggs at room temp, mixing bowl and mixer warmed up (genoise is traditionally made over a bowl of warm water). And make sure you turn out the cakes immediately upon removing from the oven (including the parchment) to cool on a rack--do NOT cool in the pan, as the recipe instructs.\nUSA10/15/2018This genoise recipe is a dud (although the mango curd and the Swiss meringue buttercream recipes to which it's attached are both delicious). I wouldn't even really call this a genoise, since there is no butter in it.  I've made a fair number of genoise cakes, always with success. These cakes turned flat, rubbery, and sticky upon cooling. I returned to my tried and true recipe for genoise from Pellaprat's \"Modern French Culinary Art,\" and as always it worked beautifully. Delicious with the mango curd and buttercream.USA10/15/2018Explore Bon AppétitCakeDessertItalianEuropeanBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Natasha Pickowicz"]}