{"id": "256abae01e59d58f9c45ee24428b4b5d", "url": "https://www.bonappetit.com/story/candy-universe", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "I Ventured into the Candy-verse and Now I Can't Turn Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Ventured into the Candy-verse and Now I Can't Turn BackWelcome to sugar week.By Sonia ChopraFebruary 11, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.When I think of candy, I think of fun-size packets of M&M's, Andes mints palmed as I walk out of an Italian chain restaurant (you know which one), Kit-Kats in all of their perfect forms. I think about my favorite Lowcountry treat, pecan pralines so sugary you can smell them blocks away. I remember fudgy, smooth Brazilian brigadeiros and milky-sweet kaju katli. I know I have much to unlock about Swedish licorices and various taffies (from the saltwater Jersey Shore kind to this Californian marshmallow-centered version), but I’ve done my best to stay up to date on chocolate-peanut butter candies, whether its making copycat peanut butter cups at home or buying next-level grown-up versions. I’m intrigued by these pretty purple ube candies and love honeycomb-textured sponge candy (extra incredible when dipped in chocolate) so much that I probably should learn how to make it myself.Recently, though, I keep coming across candies and sweets I’ve never heard of before. Maybe it’s because people talk to me about food more now that I work here at Bon Appétit, or because everyone is feeling nostalgic and bringing up their favorite sweets more often. First, it was Mallomars, which somehow just escaped my orbit for a cool thirty-something years. Then, I married into a New Jersey family and got introduced to classics like struffoli—tiny honey-soaked, sugar-covered balls stacked up kind of like a smaller croquembouche and (they tell me) popular across the Northeast for Christmas. Want this letter before it hits the website? Sign up for our newsletter!Gotta have this halva.Photo by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiA few weeks ago I wrote about avocados and a handful of you wrote back to tell me about avocado ice candy, which is popular in the Philippines (and sounds delightful). And now, this month, I learned about nonpareils from two friends who love them and sent me a giant box for my birthday. In case you, like me, are new to nonpareils, they are crunchy-sweet, delicious little chocolate coins covered in sprinkles. In Australia they’re called chocolate freckles (love this); in terms of candy anatomy, they’re not too far-flung from French mendiants.As I go through the box, I keep asking myself: How did I not know about these, and what other candies am I missing out on? It seems like there are other whole candy universes out there, and I would love to know what’s in yours. Is there a candy you love from a grocery store or a cool aunt’s house, from the neighborhood you grew up in or a trip you took once? Please fill me in. I’m sonia@bonappetit.com.Here's what's in my candy queue:Peppermint PattiesChocolate, Pistachio, and Tahini TrufflesSour Candied Citrus PeelsAniseed-Almond MeringuesApple CaramelsSalted Chocolate HalvaExplore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-11", "author": ["Condé Nast", "Sonia Chopra"]}