{"id": "257983a98af2122fb58d96a9b0ef08ca", "url": "https://www.bonappetit.com/story/how-to-make-crispy-plantains-without-frying", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "How to Make Tostones or Platanos Fritos In the Oven Without Frying | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Twice-Fried Plantains Without Actually, Um, FryingJust as delicious and nearly as crispy.By Carlos MatiasNovember 4, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of preparing the dishes and drinks we can make with our eyes closed.Growing up I could survive days without water before days without plantains. Also known as tostones or platanos fritos depending on where you’re from, crispy twice-fried flattened plantains are a staple throughout the Caribbean and Latin America. My mom fed us the savory, salty disks as fuel before Little League games and as picaderas during cousin sleepovers and Saturday morning cartoon binges. Seldom did I find myself at a dinner or family function where they weren’t served as a side or appetizer alongside many other fried foods.But since I was never allowed near the stove when my parents were frying food, I learned to associate the crackling of hot oil with danger and never learned to make platanos fritos myself. It wasn’t until I figured out that I could bake them in the oven, from which they’d emerge just as delicious and almost as crispy, that I started eating meals’ worth of plantains again, just like when I was a kid.Here’s how to make them:First you’ll want to make sure to buy green plantains, which are firmer and less sweet than ripe brown plantains. Heat the oven to 425° while you peel and cut 2 plantains into ½\"-thick slices. Toss the plantain slices with 2 tsp. extra-virgin olive oil, season with salt, and evenly distribute them across the pan. Bake for 15 minutes until slightly golden and tender. Next remove the plantains from the oven, transfer to a cutting board, and use the flat bottom of a small pot, large mug, meat mallet, or any other heavy object to gently smash the plantain rounds into ¼\"-thick slices. I use a tortilla press to flatten multiple rounds at a time. Then brush both sides with oil, sprinkle with a little more salt, and put back in the oven for 10–15 minutes, depending on the thickness, or until golden brown. While the baked plantains will never get as crispy as they would from the deep fryer, what you lose in texture you gain in plantain flavor.Now that I can enjoy the favorite food of my childhood without worrying about the deep-fry setup, I make platanos fritos as late-night meals, Netflix-bingeing snacks, and weekend hangover cures. Since the oven version requires so little attention, I can even throw them together between Zoom calls. (Yes, I make sure to turn off my video when I’m snacking on them.)The days of having a plate of platanos fritos while watching cartoons with my cousins are long gone, but the adult version—having them on wine and cheese nights—will never be the same.Explore Bon AppétitIt's That SimplecookingPlantainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-04", "author": ["Condé Nast", "Carlos Matias"]}