{"id": "25816851b582b6ed00470c2234505253", "url": "https://www.bonappetit.com/story/larsens-seafood-marthas-vineyard", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "These Recipes From Larsen’s Seafood Are My Favorite (Only?) Way to Escape Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Favorite (Only?) Way to Escape Right Now Is Making This Seafood ChowderI may not be traveling to Martha’s Vineyard any time soon, but at least I’ve got this recipe from Larsen’s, my favorite fish shack, to transport me there.By Molly BazApril 27, 2020FacebookTwitterEmailPhotographs by Elizabeth Cecil, food styling by Danielle PattavinaFacebookTwitterEmailThese days, when it’s 1:30 p.m. and my sink is already piled high with dishes from breakfast and lunch, nothing feels farther away than the luxury of a meal at a restaurant. I yearn to be able to forget for a moment about my own kitchen and my own recipes, and to be transported elsewhere for a few hours.As I sit here and dream about all the places I’ll go once life resumes some sort of normalcy, it’s a tiny little seafood shack called Larsen’s in a tiny little fishing village in Menemsha, Martha’s Vineyard, that I dream about the most. Sometimes all you want, no—all you need—is a paper tray of steamers and drawn butter, a stupid-simple lobster roll, and some straightforward and straight-up delicious fish cakes with tartar sauce.The Larsen sisters\nPhoto by Elizabeth Cecil There are no servers at Larsen’s. There is no silverware. There are no tables—just a bunch of old rusty, lobster traps masquerading as them. Physically speaking, Larsen’s is little more than a fish counter and take out window, overlooking an idyllic little boat-filled harbor. It is run by two fierce, hard-working, big-hearted women, who hail from a long line of Vineyard locals. Christine and Betsy Larsen are refreshingly unconcerned with what’s new and hot in the food world, and much more concerned with making sure that the catch is fresh and that their long line of customers is well fed. It is the anti-scene. And it’s exactly the kind of place I want to be right now, when what I crave is to turn off my brain, get outside of my own head, and sit back under the sun with a paper plate full of just-caught oysters, pop open a cold bottle of white (it’s BYO!), and while away the afternoon.Since physically transporting myself to Larsen’s is not currently possible, my only option is to replicate some of those beloved seafood classics in my home kitchen and hope for some semblance of escape. So I’m starting with their famous seafood chowder. It’s not one of those thick murky, gloppy chowders that develop a nasty film as they sit. No. This is a delicate, brothy, and appropriately creamy (!) version with a strong backbone of flavor thanks to both dry sherry and Old Bay seasoning—a flavor that has become for me, synonymous with summertime seafood. It is, in short, precisely the kind of chowder that I can get down with right about now. I don’t have dry sherry but I do have some white wine. And I’d never be caught dead without Old Bay in my pantry. (Remember these grilled shrimp!?)Ain’t she cute?\nPhoto by Elizabeth Cecil Inside the shop\nPhoto by Elizabeth Cecil The glory of the Larsen’s fish chowder is that it was designed to be infinitely riffable, which makes it just the kind of recipe I’m looking for right now. The booming fish counter means that on any given day they’ve got all sorts of fish scraps hanging around, and those scraps make their way into a daily batch of chowder. Some days it’ll include swordfish, scallops and clams, and on other luckier days you might find lobster meat swimming around. That makes it all the easier to make this when all it takes is a couple pounds of whatever looks fresh.Though Larsen’s feels further away than ever right now, at least I now have their recipes. If you need me, I’ll be making myself a big bowl of chowder, piling it high with oyster crackers, and pretending that I’m back on the Vineyard, propped up on an old Lobster trap on the dock, hanging out with the Larsens, far, far away.Get the recipe:Seafood ChowderThis creamy New England–style chowder is deeply flavored yet light and definitely not gloppy.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-27", "author": ["Condé Nast", "Molly Baz"]}