{"id": "2587833d123bc6a5e746a023f4c74812", "url": "https://www.bonappetit.com/recipe/breakfast-sandwiches-onion-bacon", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Egg Sandwiches with Onion Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHealthyish Breakfast SandwichesBy Chris MoroccoApril 9, 20194.8(79)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food styling by Sue LiEmailPinterestPrintEmailPinterestPrintYou may not mistake these jammy-crisp, slow-cooked onions for bacon, but they are truly exceptional as a stand-in, giving a huge blast of umami to create a truly satisfying breakfast sandwich.IngredientsMakes 21medium red onion, trimmed, cut in half through equator, peeled, separated into rings1tsp. soy sauce½tsp. garlic powder2Tbsp. extra-virgin olive oil, dividedKosher salt¼cup finely chopped soft herbs, such as basil, cilantro, and/or dill2Tbsp. green or red hot sauce1Tbsp. unsalted butter4large eggs, lightly beaten2whole-grain English muffins, toasted2oz. sliced sharp cheddar cheesePreparationStep 1Preheat oven to 350°. Toss onion, soy sauce, garlic powder, and 1 Tbsp. oil on a large rimmed baking sheet to coat. Season with salt. Bake, tossing once halfway through, until onion is browned around the edges and very tender, 25–35 minutes. Let cool 5 minutes.Step 2Meanwhile, toss herbs, hot sauce, and remaining 1 Tbsp. oil in a small bowl. Season with salt, if needed.Step 3Melt butter in a small nonstick skillet over medium heat. Add eggs; season with salt. Cook, stirring with a rubber spatula, until eggs have set into creamy folds, 1–2 minutes.Step 4Spread herb sauce on cut sides of muffins. Transfer bottom halves to a rimmed baking sheet. Top with eggs, then lay cheese over. Bake bottom halves just until cheese is melted, about 5 minutes. Top with onion and close with muffin tops.Step 5Do Ahead: Onion can be cooked 5 days ahead. Transfer to an airtight container and chill. To make a sandwich quickly without turning your oven on, fold the cheese into the eggs when they have just begun to set, top with onion (no need to rewarm), and assemble with toasted English muffins.How would you rate Healthyish Breakfast Sandwiches?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleI'm on my third quart jar of the onions and third pint jar of the herby oil!  I have used them both for paninis, grilled cheese and so much more.  Thanks so much for sharing!!!AnonymousSacramento, CA3/25/2022This sandwich is out of this world. I am beyond excited about this meatless one packed with umami flavors. I will make it again and again and again. Thanks so much, Chris! Healthyish Eater Mountain View, CA1/11/2022Preparing the onion like this is DELISH. Have made several times and will continue to do so!AnonymousChicago, IL1/24/2021That onion killed me and brought me back to life. No more bacon on my sandwiches ever again, bring the umami onion instead woohootoasted_nutsRomania10/20/2020OMG.  This is awesome. I read all the reviews because I wasn't skeptical, I just wasn't completely sold on everything.  I figured the 42 positive reviews couldn't be wrong.  And they weren't! The caramelized onions give just the right amount of sweetness, with the spicy herbs---the creamy eggs---incredible!  I made it on ezekiel Sesame bread and omitted the cheese (by accident!) and it was still great.  I am going to make one tomorrow with more herbs and more spice and add the cheese back in!! So many options and variations---definitely make this. STAT.  You will NOT be sorry!AnonymousAtlanta, GA10/7/2020The sexiest sandwich ever to exist. Also really customizable!Anonymous7/13/2020The onion \"bacon\" is - yes, a revelation - I actually don't think it's a huge stretch to call it that (usually I roll my eyes at that stuff) (also I eat meat) - it's so meaty and the soy/garlic (I used smoked garlic powder which maybe added to it?) was so umami heavy! Really great BE&C style sandwich with the herbs and green hot sauce it's incredible! I mean, like - it's a hard thing to mess up, but this particular version is really great.kmarxmarxchicago, il6/10/2020This breakfast sandwich is to die for! The flavors are so bold and crave-worthy. It's also perfect for quarantining. To make it even healthier, I used multigrain toast and skipped the cheese. I also used yellow onions instead of red because that's what I had in the house. The jammy onions keep beautifully in the fridge. AnonymousNew Jersey5/18/2020One of the best breakfast sandwiches EVER. Ohhh my that umami goodness...\nFound one egg per sandwich to be enough! Used coriander/cilantro and parsley for the sauce.\nA true firecracker.AnonymousBrighton, UK5/14/2020What a gift of a recipe. Who doesn't love a breakfast sandwich? The onion bacon is, also, mostly a revelation. Check it a bit more frequently if you find, as I do, that it takes less time in your oven to cook, lest it quickly transform from tender and browned around the edges to crispy and blackened.monobrownVancouver, BC5/2/2020Another fantastic recipe and so easy to make! Loved the soy sauce & garlic powder to the onions. I didn’t roast the onions in the oven because I was starving and impatient so I used a skillet instead, onions turned out great. Only had on hand red tobacco sauce, whole wheat toast, and zero cheese-sandwich still turned out amazing will be making this again & again...thanks Chris!AnonymousManhattan, nyc 4/29/2020This recipe has changed my life and now jammy onions are ALWAYS IN MY FRIDGE ready to go. I make this sand which for my family at least once a week. bfarrar0803Seattle4/26/2020This was amazing, and my husband loved it! I was initially skeptical about the 25-minute roasting time (who wants to think that far ahead for breakfast?) but it was perfect for an unplanned, lazy-ish Sunday morning. I put the onions in the oven while I sipped my first cup of coffee, and by the time they were ready to come out I had everything else prepped, I'd changed out of my PJs, and was on my second cup of coffee. We substituted focaccia rolls and havarti, because that's what we had on hand. So adaptable, and we'll be making this again! Thank you!AmyFellows4/26/2020So far I've made these sandwiches twice during self-isolation. The first time, following the instructions exactly- AMAZING! Today, I made the onions in a pan on the stove instead which was also amazing. This recipe is beyond incredible, uses common ingredients and is so easy to personalize (I used vegan cheese). Love you Chris, you're my king. AnonymousToronto, ON, CAN4/25/2020These are delicious! I cut the red onion rings in half which helped keep the edges from getting stringy as another user noted. I also used freeze-dried herbs (quarantine cooking) but added scallions to the scrambled egg as a way of including something fresh and green. I have made this once without the herb/hot sauce blend at all and do not recommend, the herb-y sauce makes a world of difference.AnonymousUnited States4/25/2020Explore Bon AppétitSandwichEggCheddarCheeseNut-FreeVegetarianHealthyishRamadanBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Chris Morocco"]}