{"id": "258c83cfc5270ef5d0b8c66ae4b6ed0a", "url": "https://www.bonappetit.com/story/an-extremely-condensed-guide-to-filipino-vinegars", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Filipino Vinegars, An Extremely Condensed Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAn *Extremely Condensed* Guide to Filipino VinegarsWhen it comes to the food of the Philippines, sour's got the power.By Raphael IlaganAugust 24, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailFilipino cooking is reflected by how Filipinos like to eat—namely by balancing three predominant elements of taste: sour, salty, and sweet. We love snacking on tart green mangoes with salty, funky shrimp paste (admittedly, I loathed shrimp as a child and would often opt for crunchy bits of rock salt instead). We like putting bits of salty cheese in ice cream (corn and cheese, a.k.a. mais con queso, remains a favorite flavor in the Philippines). Filipino family gatherings, at least in my experience, are often daylong eating binges, interspersed with plenty of karaoke, family gossip, and to my discomfort, heated political discussion, where the desserts are interspersed with the entrées, which, in turn, are enhanced by vinegary condiments, a small bottle or two of soy and/or fish sauce, and wedges of cut citrus (calamansi, ideally, if we can get it stateside, but more often than not, lemons or limes).Between the big three—sour, salty, and sweet—sour is arguably the foremost element in Filipino food, in that there are varying degrees of sourness in so many of our dishes (with exceptions, of course): Dishes prepared in the style of paksiw (simmered in vinegar) or sinigang (cooked in a sour broth) can be bracingly tart; adobo (marinated in vinegar and soy, then simmered in the marinade along with black pepper and bay leaf) is often more of a balancing act between salty and sour; and in some versions of laswa, a vegetable soup with shrimp from the Hiligaynon-speaking region of the Philippines, firm and tart native tomatoes are added to impart a bit of brightness. (I hadn’t had a sweet raw tomato until I moved to the U.S.)There are two primary ways of adding sourness to food in Filipino cooking: The first is by utilizing sour and/or unripe fruits, like tamarind, or leaves, like alibangbang or libas. And the second, and more common way, is with vinegar. The addition of vinegar in the cooking process is especially popular because it acts as a preservative; in a tropical climate like the Philippines, where food can go bad very quickly, it’s easy to see how this became common practice. There are countless types of native vinegars available in the Philippines, differentiated by the ingredient from which they’re derived. Simply put, they’re made in one of two ways, either byadding yeast starter to raw juice or sap to jumpstart the fermentation process orby leaving that raw juice or sap out in open vessels (traditionally made of clay) and letting the wild yeast in the air do its workThe yeast converts the sugars in the juice or sap into alcohol, after which bacteria transform the alcohol into acetic acid. Fermentation magic. Out of the many, many vinegars, there are three categories that are most commonly available and widely used: cane vinegar, coconut vinegar, and palm vinegar.Cane VinegarCane vinegar is the most common vinegar in the Philippines because a small amount of sugarcane yields a relatively high amount of juice. It’s also the most widely available Filipino vinegar overseas—it’s what you’re most likely to see in the U.S. (Datu Puti is a widespread brand). Within this category, there are two types available: sukang maasim, or white cane vinegar, and sukang Iloco, which is made by fermenting an alcoholic drink made from molasses called basi. Sukang maasim is quite versatile in application: It works well whether you’re using it to pickle (like to make atchara, green papaya relish), marinate, or season. Sukang Iloco is named after the region where it’s traditionally made, Ilocos, and its taste reminds me a bit of sherry vinegar. I love using it for adobo myself, though you can certainly do what the Ilocanos do: Use it as a condiment for empanadas.This yellow chicken adobo from Bad Saint in D.C. calls for sugarcane vinegar (and no soy sauce).\nAlex LauCoconut VinegarCoconut vinegar comes in two main camps: Sukang tuba is made by fermenting the sap of the coconut tree and suka ng niyog is made by fermenting coconut water. Neither one tastes distinctly coconut-y. Instead, both are more assertive in acidity compared to cane vinegar, which makes them ideal for making a type of ceviche called kinilaw. My mom likes using sukang tuba for making a spiced vinegar condiment called sinamak by adding chilies, garlic, a bit of ginger, black pepper, and salt and letting it sit, covered, for at least a week in the pantry at room temp.This bottle is sukang tuba, made by fermenting coconut tree sap.\nAlex LauPalm VinegarPalm vinegar, specifically nipa palm vinegar, is traditionally made in the town of Paombong in the Bulacan province, hence its name, sukang Paombong. It’s the most labor intensive to make: Nipa palm sap is harvested manually, by cutting the stalk and kicking or shaking the plant until the sap flows.Taste wise, it’s sweeter than coconut vinegar (at least when fresh), and also a little saline, as nipa only grows in brackish water. It’s also a living vinegar—it keeps fermenting the longer it sits, becoming more acidic with time, and its high iron content causes it to darken. I have yet to see it sold grocery stores, though I have heard stories of friends and family managing to sneak it in their checked luggage. Paombong is well suited to making lechon paksiw, where a good amount of acid is necessary to cut through the fattiness of the pork.Raphael Ilagan is a (sous) chef in New York City, where he spends his off days sleeping, trying not to dine out, and completely avoiding doing laundry.Now put your vinegar to use:Adobo-Style EggplantAdobo—both a style of preparation as well as the name of a dish—is one of the most widely known foods of the Philippines, often referred to as its national dish. To make adobo, which can be wet (very saucy) or dry (crispier and less soupy), pork, chicken, tubers, vegetables, squid, lamb, shrimp, or even duck, is simmered in vinegar, often with soy sauce, black peppercorns, and bay leaves. This recipe channels the same flavors of bright vinegar and dark soy sauce, using eggplant as the base, with the addition of ground pork for extra richness.View RecipeExplore Bon AppétitVinegarBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-24", "author": ["Condé Nast", "Raphael Ilagan"]}