{"id": "259ef4500c512842f356fe8e6df58cc9", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/ferry-plaza-farmers-market", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Ferry Plaza Farmers Market Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoFerry Plaza Farmers MarketPay respect to one of the G.O.A.T. markets, in Financial DistrictFacebookPinterestTwitterEmailAmanda LynnGO HERE: to make yourself feel sad. Haha, but really. Because the Ferry Plaza Farmers Market, with its well-curated food stands and verdant, abundant produce, will make you wish you had a farmers market just as good this one in your city.BUY: whatever is in season, from juicy cherry tomatoes in the summer to pristine citrus in the winter. Word to the wise: Before you buy anything, take a walk inside and outside the Ferry Building and get a good look at everything on display. That way you’ll get a lay of the land before shelling out all your singles. However, you should always buy a container of Aedan country miso—nothing else comes close to its nutty, barley-laden miso.THE VIBE IS: leisurely. In the mornings, you’ll find chefs doing their shopping and tourists by the afternoon. But it never feels crazy busy, thanks to the sprawling layout.PRACTICAL STUFF: Open Tuesday and Thursday 10 a.m. to 2 p.m. and Saturday 8 a,.m. to 2 p.m.—Elyse InamineAmanda LynnAmanda LynnWE ALSO LOVETartine ManufactoryThe megabakery-slash-wine-bar-slash-ice-cream-shop-slash-restaurantLord StanleySeasonal, cheffy cooking has never looked fresherMister Jiu'sFarm-to-Chinatown-table in San FranciscoExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Elyse Inamine"]}