{"id": "25b0ad1015927fd9883fe30ac61eb02a", "url": "https://www.bonappetit.com/recipe/dal-palak", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Dal Palak Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueDal PalakBy Chitra AgrawalOctober 19, 20214.3(46)Read ReviewsTriangleEmailPinterestPrintPhotograph by Julian Cousins, Food styling by Adriana PaschenEmailPinterestPrintEmailPinterestPrintRed lentils, or masoor dal, are a weeknight dinner superstar: They’re inexpensive, quick-cooking, and endlessly versatile. “I often cook a lot of masoor dal over the weekend to quickly flavor during the week for last-minute meals,” says cookbook author and Brooklyn Delhi founder Chitra Agrawal. “This dal palak packed with spinach is one of my go-to ways to use it.” If you’re strapped for time, Agrawal suggests throwing in baby spinach straight from the package rather than washing and chopping mature spinach leaves. For an extra savory note, add a big pinch of asafetida to the melted ghee when you add the seeds.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonMesh Sieve$13 At AmazonMedium Saucepan with Lid$36.99 At AmazonCitrus Juicer$7 At AmazonMicroplane$16 At AmazonIngredients4 Servings1cup masoor dal (red lentils)¼tsp. ground turmeric1lime, halved, divided1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided, plus more2Tbsp. ghee or unsalted butter½tsp. black mustard seeds½tsp. cumin seeds½tsp. fennel seed1small dried red chile, broken in half1small onion, coarsely chopped2garlic cloves, finely chopped1tsp. finely grated peeled ginger3cups spinach, coarsely choppedSteamed rice, cilantro leaves, and lime wedges (for serving)PreparationStep 1Rinse dal in a fine-mesh sieve. Transfer to a medium saucepan and pour in 3 cups water. Bring to a boil over medium-high heat. (Watch carefully as the water can boil over quickly.) Cook, skimming foam from surface, until mixture stops foaming, about 3 minutes. Stir in turmeric. Reduce heat to medium-low, partially cover, and simmer until tender, 25–30 minutes. Remove from heat and squeeze in juice from a lime half, then stir in 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt.Step 2Meanwhile, melt ghee in a high-sided skillet over medium-high heat. Add mustard, cumin, and fennel seeds and cook (a matter of seconds) until mustard seeds start to pop and oil around other seeds is sizzling. Reduce heat to medium. Add chile and stir to coat. Add onion and cook, stirring occasionally to coat, until translucent and softened, about 5 minutes. Add garlic and ginger and cook, stirring, until fragrant, about 30 seconds. Add spinach and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and cook, stirring often, until wilted but still bright green, about 1 minute. Remove from heat and squeeze in juice from remaining lime half.Step 3Add spinach mixture to dal; season with salt. Divide rice and dal among bowls. Top with cilantro; serve with lime wedges.How would you rate Dal Palak?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleGreat comfort food.  Red lentils come in various sizes, if you're using the tiny ones, cut the cooking time in 1/2.AnonymousSt. Helena, CA1/14/2022I thought it was going to be soup but it wasn't after another five minutes of cooking.  Very nice texture and delicious over rice.  The use of whole seeds instead of ground really makes this a special dish.  Leave out the chile if you don't like it hot or someone in your party has an intolerance.Lisa E12/5/2021Check your lentils for doneness well before 25 minutes! I neglected to do that, and my lentils turned into complete mush. Otherwise, this was tasty. I did double the seasonings as suggested by another reviewer.AnonymousSeattle, WA12/2/2021Not bad.  More like a lunch rather than a weeknight dinner.  I will make this again because I'm always looking for different ways to use lentils!LA KittyLos Angeles, CA11/19/2021We enjoyed this.  Used some chopped kale and some baby spinach.  Our end result was much less vividly yellow, though.  Reminded me how good dal can be!  BuckysmomHouston, TX 11/15/2021This was an easy and healthy weeknight dish, but mine was not nearly flavorful enough. I used a whole bag of baby spinach -- could that have diluted the flavor? Going to make it again and double or triple the spice quantities. AnonymousNYC11/8/2021We loved this recipe. The return on flavour is double that of the preparation. So flavourful and warming. I made it for the first time last night and it disappeared so made another batch for lunches this morning. Highly recommended!AnonymousToronto, Canada11/4/2021I subbed lime for with tamarind paste because for some reason limes are a dollar apiece recently and it was delicious. \n\nPrevious commenter Helen asks if it can be a 1 pot meal - my opinion is yes, it will work - but the techniques used do change the  flavors. If I were to simplify, I'd cook onions/ginger/fennel in advance, then add lentils and water (skim as best you can until they stop foaming) and add turmeric/salt/lime after skimming - then put spinach on to steam at the end - but I'd still  fry mustard/cumin/hot pepper/garlic in ghee or oil separately and add last (look up Tadka). I always use the same small cast iron skillet for this step and just wipe it out afterwards so cleanup is super easy. SarahKalamazoo11/2/2021Can I cook the spice mixture first and throw the lentils and water with it to cook together?  Just want to see if I can make it a one pot meal.HelenCalifornia10/25/2021Fantastic recipe! Easy, delicious and flavorful. I added a green chili to the garlic/ginger, and had to use part toor dal due to what I had on hand. I added around 1/2 cup extra water at the end for our desired consistency. It was a hit! Will become part of our regular meal planning. PoojaSt. Paul, MN10/25/2021Great recipe! Very fast and easy. Added more salt and more chili’s for heat.AnonymousArcata, CA10/24/2021Explore Bon AppétitLentilVegetableSpinachLeafy GreensStewSoups and StewsDinnerVegetarianWeeknightQuickEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Chitra Agrawal"]}