{"id": "25c0828153a248f29296f980991b5d3b", "url": "https://www.bonappetit.com/story/tom-collins-season", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "The Different Types of Gin and How to Use Them to Make a Tom Collins Cocktail | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Now Pronounce It Tom Collins SeasonMeet the gin family. Then use your bottle to make the quintessential summer drink.By Al CullitonMay 23, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.I’m quite sure that every spring and summer, gin and tonic consumption increases in direct proportion to the rise in temperature. But before we get to the Tom Collins—a classic gin drink that’s also one of the greatest of all time and perfect for this balmy weather—let’s talk a little about where gin comes from, the members of its family, and how you might explore the world of juniper outside of the bottles you already know.While the English have made a strong claim to gin over the past 300 years, and there certainly is a deep relationship between the spirit and the little island that was once an empire, we actually have the Dutch to thank. The first juniper spirit was born in Holland and it’s not called gin— it’s called genever. If I made a genever mood board, it would include Frans Hals paintings, a map of the battles of the Thirty Years War, antique earthenware bottles, and windmills.Before we get to old great-great-great-grandaddy genever, let’s talk about juniper, the tie that binds this whole family together. Juniper is a conifer, just like a pine tree, spruce, redwood, or fir. It produces small “berries” that are very flavorful (i.e. piney) and have been used for millennia for medicinal purposes. And that’s just how genever got started.Meet the juniper spirit family: London dry, Old Tom, genever, and a new-age bottle.\nPhoto by Laura MurrayThe history of genever goes way back to the 1500s, when people in the Netherlands (and that included modern-day Belgium, too) started making a medicinal juniper spirit with grain as the base instead of grapes. There are two incredibly cool things about genever.First, it has a completely unique flavor. The old-school styles (these bottles are labeled “oude” or “korenwijn”) have significant amounts of malt spirit—it's basically an unaged whisk(e)y. This results in pleasant cereal notes that act as a backdrop for juniper and any other botanicals the distiller chooses to include, which can vary wildly (orange leaf, celery seed, cinnamon, coriander, angelica, hundreds more). I recommend Rutte’s Old Simon or Bols Genever, both excellent brands.The second thing that makes genever so fascinating is that it was one of the foundational spirits in the early days of the American cocktail, and far more popular than English gin right on through the nineteenth century.Hi there, Old Tom.\nPhoto by Laura MurrayWhich brings us to the next member of the family, the one most directly descended from genever. Old Tom gin is the original English gin. It’s more juniper-forward than many genevers, and, compared to its cousins, it’s relatively sweet. (Hayman’s and Ransom are two good brands that show different facets of the style.)But how did it land on English shores in the first place? Well, a trade war, of course! When the Dutchman William of Orange and his Stuart wife, Mary, ascended to the English throne in 1688 (known as the Glorious Revolution), they immediately began taking steps to promote domestic products over those imported from Catholic France.So, out went Cognac and in came a new style of genever, for the English, by the English, and with a shorter name: “gin.” Unfortunately, William’s pro-gin laws were so effective that gin became cheaper than beer. This made it accessible to the poor and working classes, who had not been used to drinking distilled spirits, and just went ahead and drank pints of it, as they would have beer—a social crisis ensued. And the name? Well, it’s “Old Tom” for the black tomcat painted on signs above clandestine gin mills of the time. (These sprung up after the government tried to reel in the gin crisis by heavily taxing it, which drove operations underground.) Eventually, the price of beer went down and things settled, but gin has been integral to English society ever since.But all of this tumult set the stage for the child that would be crowned king of the juniper spirits: London dry gin. This is the one that’s taken the world by storm over the past two centuries, the one with the big names: Beefeater! Tanqueray! Gordon’s! This is the stuff that propelled the dry martini to stardom.Now if only someone would explain why it's called Beefeater…\nPhoto by Laura MurrayBut what’s the difference between London Dry, king of gins, and the older styles we just learned about? Well, it really is incredibly dry. And it’s very “clean” like vodka, but with way more flavor. The reason: the column still.An invention of the early nineteenth century, the column still differs greatly from its predecessor, which is called a pot still. Pot stills are like great big copper kettles and they are known for producing spirits with more dimension and soul. Column stills, on the other hand, are very tall towers that create pure, unadulterated spirits, basically through a series of little stills along the way to the top. London Dry gin must be made with a column still, and are virtually unsweetened, if sweetened at all, per the category’s regulations. There isn’t a more fitting gin in a G&T, a Gimlet, a Martini, etc. Sometimes, though, when something is that good, people try to improve upon it, or riff on it. Enter the great-great-grand-baby of the family: the new gin.G&T FTW.\nPhoto by Danny KimHave you noticed that gin is in? And it’s not just classic London Dry gins, either. Some of the gins that have gained a lot of traction in recent years are quite different from the old standard bearers. A lot of these modern gins downplay the juniper bit and focus on citrus or other botanicals as the dominant flavor. (Brands like Hendrick’s and Aviation ushered in this new style; look for Neversink, Barr Hill, or AMASS for new and interesting examples of the genre.)  These products have been so popular that bartenders have designed cocktails around a specific gin’s flavor profile. But that’s quite the opposite of what I have in mind today.I propose we make a cocktail that works for any member of the gin family. It’s the most honest, straightforward cocktail you can make, and there’s something ancient and elemental about it. Chalk that up to it being a direct descendent of punch. This, my friends, is the Tom Collins.Lauded for, lo, these two centuries, this fizzy beaut is exactly what we need on a hot summer’s evening. Or afternoon.  A mix of genever, lemon, sugar, and soda, it was born in London at Limmer’s Hotel as the John Collins (named after the hotel’s head waiter!). It was such an instant hit that its brother Tom, made with Old Tom gin, soon followed. When those styles of gin went out of fashion, London Dry took its place and the recipe has been that way ever since.Here’s how to make one, with whatever gin you’ve got:Combine 1½ oz. gin or genever, ¾ oz. lemon juice, and ¾ oz. simple syrup in a cocktail shaker. Add ice and shake hard for 15 seconds. Strain into a Collins glass (yes, the glass is named for the drink) and add fresh ice. Top with soda. Garnish with an orange half-wheel, wrapped around a Luxardo cherry, with a cocktail pick through the whole thing. Enjoy the fruits of your labor and contemplate the centuries of juniper-driven history that brought you to this wonderful moment in time.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlGinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-23", "author": ["Condé Nast", "Al Culliton"]}