{"id": "25e5793fabcf4260754d3c55bc43c6a9", "url": "https://www.bonappetit.com/recipe/ghee-poached-shrimp", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Ghee-Poached Shrimp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueGhee-Poached ShrimpSeptember 22, 20204.2(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintFarhan Momin, who runs the pop-up Farmo Cooks and the butcher shop Atlanta Halal Meat & Food, likes to make his own flavored ghee by toasting whole spices like coriander seeds and smoky black cardamom in butter. He uses the resulting mixture to poach shrimp, though the flavored ghee would also be great spooned over any lean protein such as chicken or fish. Don’t stress too much if you don’t have every single spice on the list, use what you have and love.Ingredients4 Servingsspiced ghee1cup (2 sticks) unsalted butter11\" piece ginger, peeled, crushed2garlic cloves, crushed3chiles de árbol, broken into pieces, seeds removed1chipotle chile, broken into pieces1black cardamom pod, crushed1whole star anise11\" cinnamon stick4whole cloves2tsp. coriander seeds1tsp. cumin seeds1tsp. black peppercornsShrimpJuice of 1 lime1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. Kashmiri chile powder or paprika¼tsp. turmeric1lb. large shrimp, peeled, deveined, preferably tails left onWarm naan or country-style bread (for serving)special equipment:3layers of cheeseclothPreparationSpiced GheeStep 1Line a fine-mesh sieve set over a measuring glass with cheesecloth. Heat butter, ginger, garlic, chiles de árbol, chipotle chile, cardamom, star anise, cinnamon stick, cloves, coriander seeds, cumin seeds, and peppercorns in a medium heavy saucepan over low until foaming and milk solids turn brown and begin to stick to bottom of pan, about 45 minutes.Step 2Strain infused ghee through prepared sieve. Set toasted spices and ghee aside separately for cooking shrimp. Set sieve with cheesecloth aside.Step 3Do ahead: Spiced ghee can be made 1 week ahead. Cover and chill.ShrimpStep 4Place reserved toasted spices and 3 Tbsp. reserved ghee in a blender. Add lime juice, salt, chile powder, turmeric, and a splash of water. Blend, scraping down sides as needed and adding more water by the tablespoonful, until a smooth paste forms. Transfer to a medium bowl; add shrimp and toss to coat. Let sit 30 minutes.Step 5Heat remaining reserved ghee in a large skillet, preferably cast iron, over low. Cook shrimp, turning halfway through, until opaque throughout and pink, about 4 minutes total.Step 6Using a slotted spoon, divide shrimp among plates and drizzle 1–2 Tbsp. warm ghee in skillet over. Serve shrimp with naan.Step 7Don’t throw out the ghee remaining in the skillet—you can save it to poach more shrimp or other seafood and fish, such as scallops and salmon, or toss it with pasta. Simply cook remaining ghee over medium heat until foaming, about 2 minutes. Strain ghee again through reserved sieve into an airtight container; cover and chill.Step 8Do ahead: Shrimp ghee can be made 1 week ahead. Keep chilled.How would you rate Ghee-Poached Shrimp?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI tried this recipe from the magazine and it was a huge success! The spicy ghee is a must that really elevates the dish. You can use it for many other dishes so make a little extra. Shrimp, polenta or ghee fried rice; what could go wrong? \n\nI make this so much that I have the recipe memorized. FlemboySan Clemente, CA1/22/2021Explore Bon AppétitShrimpShellfishSeafoodMainStarterNut-FreeKetoNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}