{"id": "25fac05106a9211e2650300a9e46ab5c", "url": "https://www.bonappetit.com/story/fatima-ali", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Fatima Ali, 'Top Chef' Contestant, on How Cancer Changed the Way She Cooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture'Top Chef' Contestant Fatima Ali on How Cancer Changed the Way She CooksI’ll never be able to high-five my friends with my left hand again. Will I be able to cook?By  Fatima AliMay 1, 2018FacebookTwitterEmailIllustrations by  Chloé BertronFacebookTwitterEmailFatima Ali is a chef in NYC and a former ‘Top Chef’ contestant. In December of last year, she was diagnosed with Ewings Sarcoma, a rare form of cancer. She underwent chemotherapy as well as a surgery that permanently affected the range of motion in her left hand. Here, she reflects on how cancer has changed her relationship to food and her continuing dream of opening a restaurant one day.If I lie absolutely still, the room stops spinning, and my stomach doesn’t wretch. The mention of food makes me feel violently ill, but I’ve lost ten pounds in six days and I’m afraid if I don’t force myself to eat I’ll stop recognizing myself in the mirror.I make a half-hearted request for daal chawal to my mother. Yellow lentils and rice. A staple in Pakistan, and something I ate often growing up. I’ve surprised myself; wracked with post-chemo side effects, my brain is hardwired to derive comfort from the familiar. I start thinking about food tentatively, testing out the images of biryani and karhai in my mind. The nausea stays at bay.The doctors had warned me about changes to my taste buds when I was diagnosed with Ewings Sarcoma—iron and rot taking over sweet and savory on my tongue. I suppose it makes sense that I would want foods with flavor to combat the blanket of cobwebs in my mouth. Was it because I’m a chef, or because I am Pakistani? Maybe my identity is split exactly in half, and the only time I derive pleasure is when the two sides overlap. I spent years cooking all types of food in New York City after graduating from culinary school. Then, two years ago, I quit my job at one the largest restaurant groups in the country and went back to Pakistan for a few months to reabsorb the food of my childhood. I wanted to open my own restaurant back in New York. I wanted to cook the food I first knew.I make plans to cook for the holidays in my home kitchen, despite worried protests from my family who moved halfway across the world to take care of me. They want me to rest and avoid the dangers of cuts and burns, but they know I can’t stay away. The night before Thanksgiving, I’m crying frustratedly in my hospital bed. My own body had given itself an infection and the doctors are debating my release. I hold my nurse’s hand as tears stream down my face. It could almost be comical, my crying over missing the turkey. “I need to go home and cook,” I tell her.Christmas and New Year’s Eve are spent laying the table with dish after dish from the kitchen. Garam masala roasted duck, cornbread pistachio stuffing, rose water bundt cake. Somehow the dates line up with my chemotherapy recovery weeks, and I have the strength to spend the day slowly dicing, slicing, and icing. It feels like someone up there is looking out for me, after all.A surgery to remove the tumor has excavated 30 percent of bone and tissue from my scapula, permanently affecting my range of motion. I’ll never be able to high-five my friends with my left hand again. Will I be able to cook?How will I withstand a busy Saturday night service, jumping behind the line when my sous chef can’t keep up? Maybe I’ll become the one who can’t keep up. I picture myself trying to work the tandoor oven with one arm. It’s a bleak thought. Establishing the perfect rhythm of slapping naan dough against the furnace-hot walls while simultaneously rotating the skewers of various marinated meats so they don’t burn to a crisp is skilled and ambidextrous work.The edges of my thoughts are tinged with worry, but I know that my love for food and cooking is so strong inside me that even cancer can’t cut it down. I dream in vivid color—of Pad Thai and pastina, and, in my haze of medical-marijuana-induced munchies, I chow down, relishing every bite. (Weed has been my savior, allowing me to enjoy food again and keeping the nausea at bay during my chemo weeks.)I dream of my future restaurant, where the kebabs melt against your tongue and the cocktails are just sweet enough to calm the burn. I have never felt more fulfilled than when I let myself crawl into bed late night after a back-breaking day of cooking. I remember that feeling like phantom aches in my bones. Ticket after ticket, call after call. I dream of being better. I dream of being myself again, but I know I’ll never quite be the same, and that’s okay. I know I’ll be different, and, despite the worry that settles into me every time I wake up, I look forward to meeting that woman one day.Explore Bon AppétitHealthyishessayRead MorecultureHow a Single Pan Taught Me About Self LoveBy Shelby VittekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Fatima Ali"]}