{"id": "26083394cbd1e1c8d26e96ed3b454de7", "url": "https://www.bonappetit.com/recipe/tomato-galette", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Tomato Galette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueTomato GaletteBy Andy BaraghaniJuly 9, 20194.9(93)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSalting the tomatoes ahead of time and letting them release some of their liquid is essential. It will allow the tomatoes to caramelize and ensures that the bottom of the crust stays flaky.Ingredients4 servings2cups all-purpose flour, plus more for dusting2¼tsp. kosher salt, divided¾cup (1½ sticks) chilled unsalted butter, cut into pieces1Tbsp. apple cider vinegar1½lb. heirloom tomatoes, sliced ¼\" thick2garlic cloves, thinly sliced4oz. firm cheese (such as Asiago, cheddar, or Gouda), finely grated (about 1½ cups)1large egg, beaten to blendFlaky sea saltFreshly ground black pepper½lemon1Tbsp. finely chopped chivesPreparationStep 1Pulse 2 cups flour and 1¼ tsp. kosher salt in a food processor to combine. Add butter and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining.Step 2Transfer mixture to a large bowl; drizzle with vinegar and ¼ cup ice water. Mix with a fork, adding more ice water by the tablespoonful as needed, just until a shaggy dough comes together. Turn out onto a work surface and lightly knead until no dry spots remain (be careful not to overwork). Pat into a disk and wrap in plastic. Chill at least 2 hours.Step 3Preheat oven to 400°. Gently toss tomatoes, garlic, and remaining 1 tsp. kosher salt in a large bowl. Let sit 5 minutes (tomatoes will start releasing some liquid). Drain tomato mixture and transfer to paper towels.Step 4Unwrap dough and roll out on a lightly floured sheet of parchment paper to a 14\" round about ⅛\" thick. Transfer on parchment to a baking sheet. Scatter cheese over dough, leaving a 1½\" border. Arrange tomatoes and garlic over cheese. Bring edges of dough up and over filling, overlapping as needed to create about a 1½\" border; brush dough with egg. Sprinkle tomatoes with sea salt and pepper. Chill in freezer 10 minutes.Step 5Bake galette, rotating once, until crust is golden brown and cooked through, 55–65 minutes. Let cool slightly on baking sheet. Finely grate zest from lemon over galette; sprinkle with chives.Step 6Do Ahead: Dough can be made 2 days ahead. Keep chilled.How would you rate Tomato Galette?Leave a ReviewTell us what you thinkReviews (59)Back to TopTriangleThis was my first time making this recipe and the  instructions were easy to follow. The dough came out crispy and tasty. My local store didn’t have the heirloom tomatoes and I used tomatoes in the vine. I drained  them for 10 to 15 minutes before drying them with a paper towel.  This helped reducing the water when the galette was baking.\nThe most important thing is that my wife liked it.\nThe Home BakerChantilly, USA11/14/2021I have made this galette for the past three summers and I make them and freeze them to be able to bring to a party or enjoy in the winter months. They freeze very well but I leave parchment paper underneath it and then wrap in foil. I use my own home grown tomatoes, farmers market heirloom tomatoes for color, and I use Ewephoria cheese. It is phenomenal.  Lynne IrvingDetroit, MI 10/12/2021I'm not sure how this isn't pizza but I don't really care. I used store bought puff pastry because I was lazy, but otherwise followed the recipe as written. Just divine. I might drain the tomatoes for longer than 5 minutes next time. Marissa C.Alaska10/6/2021Excellent and very easy. Having home grown heirlooms helps, but the crust is light and tasty. The lemon zest sets it off.Mr. MikeThe Plains, Virginia10/3/2021Simply put, this recipe is perfect. I look forward to making this at least 4 times every summer. Definitely worth turning the oven on in the summer. Making my last one tonight! I can already smell the buttery crust! ElisseAtlanta, GA9/22/2021Have made it four times in the past two months, including the \"farewell to summer tomatoes\" one tonight!  Cannot be improved  and cannot be beaten, even by our favorite home made pizza.\n\nOld GoatCarbondale, IL9/21/2021This recipe simply works. I've made it 3 times, and it's never failed. Trying it again this morning, prepping for a neighborhood meet and greet.JamesNew London CT9/19/2021So tasty! The pastry is incredibly flaky. No leftovers in my house!VickyEdmonton9/13/2021This recipe is awesome. Don't skip the draining of the tomatoes step, and it'll be perfect on the bottom. It's the second recipe I made last year after I fractured both forearm bones and was healed enough to use the rolling pin again. Made it again this year and it's for sure a keeper. It also travels very well for a show in a park with some wine and good company :)AnonymousBaltimore, MD8/11/2021Wow- we loved this! The reviews were so good and I had heirloom tomatoes that I was going to use for a dinner party that was cancelled due to a possible covid thing. Thankfully we’re healthy and we just ate most of the galette! I’ll make it, just as written, again. Soon. Thanks BA!Daisy SwanSanta Barbara, CA8/8/2021Absolutely delicious. I made it with grated fresh parmesan and it was perfect. I got rid of the excess moisture from the tomatoes, and with this perfect crust it was completely all star. Reminded me of Provence. A keeper!SherriDallas8/3/2021All I have to say is that I will never eat another pizza in my lifetime!!\nThis is most exceptional, the crust is unbelievably flaky!\nI top it all with lemon zest and Flake sea salt and it's amazing!\nAnonymousOcala,  FL 7/14/2021This recipe is a keeper! I followed the instructions to a T, apart from upping the garlic to 4 cloves. This was my first time making a galette crust and it was pretty easy and straightforward, although mine certainly didn't look as pretty. :) I'll definitely try it out again over the summer.\nSarah A.Arlington, VA6/7/2021As other users suggested, I used the pastry crust from the Triple Threat Onion Galette, and the pastry turned out flaky and delicious.  Sweating and patting the tomatoes dry was key to ensuring that the pastry didn't get soggy during the bake.  I used gouda, and sprinkled fresh thyme prior on the top prior to the galette going into the oven, which was a great choice.  Grated some parmesan over when it came out.  I'll be making again; it was a hit at Easter.ElizabethHouston Texas4/5/2021This was wonderful! It resembles a fancy pizza. I love the crust on the onion Galette recipe from Bon Appetit but I also like this one! The differences are minimal, and using a food processor is always a plus in terms of efficiency. In the future I may cut my tomatoes thicker, use a few more cloves of garlic, and get some red pepper in it as well. It was a hit in my household, give it a try!racheljhSan Jose, CA9/16/2020Explore Bon AppétitSavory Pie & TartTomatoVegetableCheeseSummerMainNut-FreeVegetarianBakingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}