{"id": "260aa62012a003dc16f708a992b91457", "url": "https://www.bonappetit.com/story/j-j-johnson-between-harlem-and-heaven", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "J. J. Johnson on 'Between Harlem and Heaven' and Bringing People Together with Oxtails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJ. J. Johnson on Knocking Down Barriers and Bringing People Together with Oxtails\"I'm going to cook who I am. I know who I am now.\"By Aliza AbarbanelFebruary 8, 2018FacebookTwitterEmailPhotographed by Eliesa JohnsonPhoto by Eliesa JohnsonFacebookTwitterEmailJ. J. Johnson lives and cooks in full, glorious technicolor. In late 2017, his one-month stint as the buzzy Chefs Club's first long-term chef-in-residence was extended an extra two months, to meet demand of diners who wanted to vibe to '90s hip-hop over forkfuls of a whole, cornmeal-crusted sea bass. Now, he's branching out with InGrained Hospitality Concepts, a restaurant group focusing on diverse collaboration and global cuisine.For a chef with a self-professed desire to \"be the Jordan of the culinary world,\" it seems like Johnson is hitting his stride. During his time as the former executive chef at multi-talented restaurateur Alexander Smalls' iconic Harlem restaurants The Cecil and Minton's, the focus was on the flavors of the Afro-Asian-American table. For the first time, Smalls and Johnson are collecting their dynamic recipes in a cookbook: Between Harlem and Heaven: Afro-Asian-American Cooking for Big Nights, Weeknights, and Every Day, co-written by Veronica Chambers.We called up Johnson to talk about heritage food, oxtail dumplings, and the ever-changing landscape of American food.Why did you write this cookbook, and who were you writing it for?Is there a cookbook that really speaks to how the African diaspora impacted the whole world through food? The whole western continent has been affected by the diaspora, along with the Chinese and Japanese migrant workers who filled in the gaps of the forced migrated slaves and the food that they cooked. I'm a child of the African diaspora, and I was thinking about my childhood as a whole. How can we bring that into your house and also give you background, essays, and personal touches? This really was for everyone to cook at home—the industry chef can use it as a reference guide, but it was for my mom to be like, \"How do I make a great salad?\" Or, \"I want to make fried chicken differently, what can I do?' It's for everyone to say, I understand now that the African diaspora has a place at the table and I know the impact that they have on the culinary world.J. J. Johnson (left) and Alexander Smalls (right)\nPhoto courtesy of 'Between Harlem and Heaven'Are there any dishes in the cookbook that stand out to you as part of a particularly interesting culinary conversation?The oxtail dumplings. Most people think of oxtail as soul food, but the Chinese and Vietnamese have oxtail soup, and the Philippines has braised oxtails. My way of bringing that together is throwing it in a dumpling. If you have a family, that’s something you can do on a weekend. One person braises the oxtail, one person does the meat, and you all come together to make the dumplings.What makes a dish worthy of a big night versus any other night?For a big night, I'd do the tamarind braised oxtail, the cinnamon scented guinea hen or chicken, maybe I’d do the sticky rice in there too. I'd definitely do the salt-crusted salmon with collard green salsa verde because you can throw it in there and let it rock. You can get your favorite fish, the guests are over, you pull it out the oven and crack open the salt crust and throw it on the table. All the aromatics come out, and people are like, \"How did you even make that?!\"Hominy stew with curry-crusted cod\nPhoto courtesy of 'Between Harlem and Heaven'You write that heritage food in America is having a renaissance. What do you think is driving that?When you start looking at the culinary dining scene in NYC or around the country, people are cooking their diaspora. They’re pulling from their heritage, their grandma or auntie. Everybody wants to cook what they actually really stand for. This book is to really help you understand the American landscape—where it was and where it's going now. I think we're going to see more of a diaspora culinary landscape, where this country is at right now, and hopefully this book will knock down some of those barriers.How did your own experiences inform Between Harlem and Heaven?When I went to Ghana, I didn’t know what I wanted to cook. I was told to cook French food, Italian food, American food, these are the places I had cooked at so I was like, I’ll do risotto, roasted chicken, and a big arugula salad, and I’ll make it the best I can. Then I went to Ghana and was like, \"Oh my god, I know what I'm going to cook for the rest of my life.\" I'm going to cook who I am. I know who I am now.And now, everywhere I've traveled, I look at food through the West African lens. When I cooked in Ghana for the first time, I really saw that food is a language. It breaks down the barriers and the wall. I couldn’t think of a better time for this cookbook to come out in America because migration is front and center. I don't think we've ever thought about it more than this moment.What's it like to have that personal connection while developing this book?It’s a proud moment. You go to culinary school, and you come out wanting to be an executive chef, so you go do an internship. I never knew what it was going to be, but to actually say, \"I'm contributing to the culinary world through the food of who I am.\" I feel like the first chapter in my life was spent well. I’m doing something for the next generation. The people who look like me can feel like they can have a real culinary voice—and it also made my mom and my dad proud.Photo courtesy of Between Harlem and HeavenBuy Between Harlem and Heaven for $25 on Amazon*Explore Bon AppétitHealthyishCookbooksAfricanSouth AsianSoul FoodRead MorecultureWe Didn't Write the 'Healthyish' Cookbook, But We Kinda Wish We DidBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-08", "author": ["Condé Nast", "Aliza Abarbanel"]}