{"id": "260b3b4457d9f5eff930d2f8f7d455de", "url": "https://www.bonappetit.com/story/end-of-summer-produce-recipes", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Summer Isn’t Over Yet, So Make These Summer Produce Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Still Have 11 Days Left to Cook with Summer ProduceIn his weekly newsletter, editor in chief Adam Rapoport shares what to make in the last week and a half of summer.By Adam RapoportSeptember 11, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Summer isn’t over yet, so make these recipesI walked into work last Tuesday, rested and refreshed, content that I had gotten the most out of summer. We sent our kid to camp for a month (which, despite some homesick letters from him demanding that we come pick him up, I like to think that it was a successful… growing experience). And I took off the last week of August, swam in the ocean, ate a lot of BLTs, grilled and grilled and grilled, and managed a few rounds of golf. I was ready for fall.Want this letter before it hits the website? Sign up for our newsletter!Then I wandered into the Union Square Greenmarket this past Saturday.  And, oh hey—it’s still summer! Go ahead, check your calendar. Lest we forget, the first day of fall isn’t until September 22. And the market was still spilling over with ripe peaches, plump heirloom tomatoes, and piles of corn.That night, my wife and I had a bunch of family coming over for dinner. So we took advantage of the remaining bounty.Photo by Chelsie Craig, food styling by Anna BillingskogFirst up: a corn and peach salad, tossed with arugula, fresh mint and a shallot vinaigrette. When peaches are ripe and juicy, I like to think that they’re interchangeable with tomatoes (also a fruit!)—I use them in salads, Capreses, salsas, and even bruschetta. They’re not just for dessert.Speaking of bruschetta, while my wife Simone was busy on the salad, I grilled up some slices of country bread. I roughly chopped up a bunch of heirloom tomatoes, doused them with extra virgin olive oil and a liberal amount of kosher salt, and then added some smashed garlic and torn basil. Then I just let them hang out on the counter for an hour. The longer the flavors have time to marry and the juices release from the tomatoes, the better. Piled the mixture onto slices of the garlic-rubbed, charred toast and, man oh man—crazy good.Photo by Alex LauWith the leftover basil from the bruschetta, I’ll make some of BA’s Best Pesto tonight. And I certainly plan to whip up some no-cook tomato sauce with all those end-of-season heirlooms. I’ve got 12 days of summer left—I plan to enjoy every one them.Get the end-of-summer recipes:My Wife Simone’s Shallot VinaigretteCaprese-ish Peach and Tomato Salad with BurrataBA’s Best PestoPasta with No-Cook Tomato SauceGrilled Corn Salad (not the one I made, but a good corn salad)Explore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Adam Rapoport"]}