{"id": "2614885ece8bd568b4f4234eeea26a4b", "url": "https://www.bonappetit.com/story/bayhaven-food-and-wine-festival", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "BayHaven Food and Wine Festival: There Weren't Enough Black Food Festivals, So This Couple Started Their Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThere Weren’t Enough Black Food Festivals, So This Couple Started Their OwnGreg and Subrina Colliers’ BayHaven Food & Wine Festival is amplifying Black culinarians.By Andrea CooperOctober 21, 2021FacebookTwitterEmailCharlotte, NC- July 22d- Greg and Subrina Collier, owners of Leah and Louise in Charlotte, NC. Photographed in Charlotte, NC on July 22, 2020. Photo by Peter TaylorPhoto by Peter TaylorFacebookTwitterEmailLiving in the South, restaurateurs Gregory and Subrina Collier had never really seen food and drink festivals that celebrated Black culture. So, about a year ago, the husband-and-wife duo behind the self-described “modern juke joint” Leah & Louise, in Charlotte, North Carolina, decided to do it themselves. They’re welcoming over a thousand guests at their inaugural BayHaven Food & Wine Festival, a three-day celebration of Black food and beverages this month in Charlotte.The festival is named for the neighborhoods in Memphis, where the Colliers were born. She’s from Frayser, which locals nicknamed The Bay. He lived near Graceland in Whitehaven, but “we called it Blackhaven,” Greg says, for its thriving African American community. The Colliers first met in a wings restaurant in Memphis, when he was a cook and she was a student. Last year, in March, they opened Leah & Louise, named after Greg’s late sister and grandmother. It swiftly earned national acclaim for its contemporary interpretations of Southern classics honoring the Mississippi River valley. (I’ll vouch for the Tang custard pie, topped with meringue and spiked with the “space-age” orange drink that Greg enjoyed after school at his grandma’s house.)Hear more from Subrina about opening Leah & Louise in the middle of the pandemic:ContentThis content can also be viewed on the site it originates from.The Colliers’ dedication to highlighting the richness of Black culinary traditions and advancing Black cuisine in innovative ways has led Greg to become a two-time James Beard Award semi-finalist and Subrina a 2020 James Beard Foundation Women’s Entrepreneurial Leadership Fellow. We talked on a steamy afternoon outside a Charlotte coffee shop about the inspirations behind BayHaven and the importance of festivals in amplifying Black culture.This conversation has been lightly edited for clarity.Greg: We’re very focused on trying to find ways to build our culture. We feel like we create spaces where Black culinarians can thrive.Subrina: In Memphis, we had an Italian fest every year and a Greek fest. I thought it was dope that they were having festivals celebrating their culture. They’d be making great food, great beverages. Everybody came, Black folks, white folks. But I didn’t see a lot of Black food and wine festivals or events that celebrated Black culture, especially in the South. I’m creating something I didn’t see.Greg: I’ve always been finding spaces where I could be represented, and, as I got more representation, finding other people who were like me who weren’t represented. The festival is a culmination of that. We’re fortunate that we’ve built a lot of great relationships with a lot of Black chefs, artisans, and farmers. We’re trying to find more ways to represent our culture that isn’t soul food, that isn’t biscuits and gravy, or fried chicken. There’s so much we do.Subrina: A lot of times, that’s the only part that’s highlighted. But there are different layers of Black food. So don’t lump everybody in together.Greg: To cook French cuisine, there are these guidelines and specificities about how to make a béchamel or a hollandaise. The beauty of African American cuisine, or African cuisine in the diaspora, is sweet potatoes might be cooked in different ways in each place. Same thing with yams. Same thing with rice and tomatoes and okra.Subrina: We grew up in the South calling sweet potatoes yams even though they’re not the same. A lot of us don’t know that. This festival gives us a chance not only for fellowship but learning. You’re learning from other Black people in different regions.Greg: I don’t know how Florida is the South.Subrina: [laughs]Greg: It’s the way that people cook, how they put stuff together, how they use rice, what they call gravy versus what we call gravy. Being from Memphis, our Southern is a little bit different from Carolinian. Baltimore is Southern too, but it’s different too.Subrina: I love the Harlem Renaissance. The festival is an ode to us during that time. In spite of the heavy discrimination of the era, we still were dressed to the nines, going out, sneaking our drinks during Prohibition.The names of all the [festival] events are based off the Harlem Renaissance, from the Cotton Club [Tasting Tents] to the Chuckwagon [Carnival]. The chuckwagons were the first food trucks. They were super popular in the 1920s. The Savoy Jazz Brunch is after the Savoy [Ballroom]. Even the Giggle Water Wine Class is based on what they used to call wine or liquor during Prohibition.Greg: We wanted to make sure we highlighted Black female chefs. If we’re having discussions about Southern food, soul food, any cuisine of the South, you have to talk about Black women. I mean, all the way from slavery to the Great Migration when a lot of people moved to Detroit, Chicago, New York, and Philadelphia, [Black women] took these foodways with them.A lot of times when you think about female chefs, and Black female chefs specifically, it’s easy to say, “Oh, pies and cakes. Oh, of course, desserts. Sweets.”Subrina: They get pigeonholed into one area.Greg: Especially once you get to higher-end restaurants, there’s this notion that they can’t handle the line. For Black women, it’s often like, “She has an attitude,” although she’s doing the same thing a white male counterpart may be doing. We have some chefs coming who do amazing sweets, such as Tonya Thomas. But we also have female chefs doing savory, like Whitney Thomas, Sabrina Tinsley, and Jennifer Hill Booker. It makes sense to be purposeful to find those chefs and make sure they can highlight themselves in this space.Subrina: Let me tell you, that is not the easiest when you’re getting into Black wine and spirits. We’re about 13 percent of the population, right? Then we go into us having access to make wine. Then there’s distribution. Same thing with spirits.Greg: It’s difficult to get a lot of spirits in North Carolina because of the regulations. We figured we want to get representation from the hospitality side so we got a couple of bar people who are partnering with brands coming in. We have McBride Sisters pouring, we have La Fête du Rosé pouring, we’re going to have Mermosa. Lindsey [Williams] with Davidson Wine Co. is bringing some of her wines.Subrina: You’re wanting to do this and you’re like, “That’s why it hasn’t happened. It’s hard as hell!” It can be done. I’m pleased with the people we have participating and discovering Black-owned brands.Greg: We could see more representation on every single level. So, whiskey, for instance. We need more Black farmers who can grow different types of corn. We need more distilleries, where we can distill the different types of corn that we grow. We need more retail representation to get the distilled product on the shelves. Even with that, we need more representation at state levels to try to help us gain access into places that are good ol’ boys’ clubs still.Subrina: Hopefully our festival sparks a conversation.Explore Bon AppétitRestaurantsInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-21", "author": ["Condé Nast", "Andrea Cooper"]}