{"id": "261667148bc99642751ea795151ec2a7", "url": "https://www.bonappetit.com/recipe/whole-moong-dosa", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Spinach Dosa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWhole Moong DosaBy Chetna MakanAugust 3, 20203.6(15)Read ReviewsTriangleEmailPinterestPrintPhotography by Nassima RothackerEmailPinterestPrintEmailPinterestPrintGrowing up, my mum would make these moong dal dosas often. I love their vibrant green color, but they're also deeply flavorful and extremely nutritious, thanks to the mung beans and spinach. The most time-consuming (though completely hands-off) part of this recipe—which is included in my new cookbook Chetna's Healthy Indian Vegetarian—is soaking the mung beans and rice overnight, so that they soften and easily grind into a paste. Once that’s done, the batter comes together in minutes.Reprinted with permission from Chetna's Healthy Indian Vegetarian By Chetna Makan, Mitchell Beazley, copyright © 2020. Distributed by Hachette Book GroupIngredientsMakes 128ounces (1 cup) mung beans (whole moong daal)¼cup basmati rice1cup spinach leaves, stems removed1green chile, chopped1teaspoon kosher saltNeutral oil (such as safflower), for cookingPreparationStep 1Soak the mung beans and rice together in a bowl of cold water overnight.Step 2The next morning, drain them and tip them into a blender. Add the spinach, chile, salt, and 1½ cups water. Blend until you have a paste.Step 3Heat a frying pan and, once hot, tip in a ladle of the batter and spread it in a circle using the back of the ladle. Drizzle ½ tsp. oil on top and cook on medium heat for 2 minutes before turning the dosa. Cook another minute on the other side, then remove from the pan and keep warm while you cook the remaining batter.Step 4Do ahead: The batter will keep in an airtight container in the fridge for 3–4 days.How would you rate Whole Moong Dosa?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis recipe did not give the details needed to make a dosa. I had to go to other websites for details maybe a video would help.AnonymousFresno6/27/2021@TheSwordofTipuSultan - No offense but before pointing fingers at others, one should educate oneself. In this case, you're perhaps not aware that Mung Dal Dosas are actually pretty common in Andhra Pradesh (called Pesarattu in Telugu) and the recipe is pretty much the same except we don't add spinach. And yes, they are made fresh i.e. not fermented.\n\nThe Dosai you refer to is just *one type* of Dosa. In addition to the Mung Dosa, people also make Ragi Dosa (with finger/red millet flour), Rava Dosa (with semolina) etc., which are not fermented either. Essentially, any loose batter that is spread out like a Crepe is a Dosa. FYI, my mother even makes a Wheat Dosa (although this one is sweet 'cause she adds jaggery to it)Hyderabad11/3/2020@TheSwordofTipuSultan - No offense but before pointing fingers at others, one should educate oneself. In this case, you're perhaps not aware that Mung Dal Dosas are actually pretty common in Andhra Pradesh (called Pesarattu in Telugu) and the recipe is pretty much the same except we don't add spinach. And yes, they are made fresh i.e. not fermented.\n\nThe Dosai you refer to is just *one type* of Dosa. In addition to the Mung Dosa, people also make Ragi Dosa (with finger/red millet flour), Rava Dosa (with semolina) etc., which are not fermented either. Essentially, any loose batter that is spread out like a Crepe is a Dosa. FYI, my mother even makes a Wheat Dosa (although this one is sweet 'cause she adds jaggery to it)AnonymousHyderabad11/3/2020This recipe has inspired a weekly meal in our household. I've played with the proportions, adding much more basmati rice and spinach than the recipe calls for. The results are more like pancakes than dosas, but delicious and satisfying. My recipe is 2:1 moong dal to basmati rice, soaked overnight. Once ready to prepare, I add water, chile and salt while blending in my Vitamix to make a thin batter; and then I keep adding spinach until I get the consistency of a pancake batter. Griddled in ghee, they are fantastic. Love the idea of fermenting and/or adding whey from my homemade yogurt. I'll be giving that a try! Thanks to the hive.Belfast, Maine10/27/2020Making my 2nd batch tonight. Liked the vibrant green color and having a healthy alternative to tortillas. Used some whey from my homemade yogurt with water to add to the mung beans in the blender. Came out great! connieprz5264Los Angeles8/27/2020I'd love to know what I did wrong. I did not get dosas from this recipe, just soggy messes stuck to a nonstick pan. I even added less water than asked because I was worried it seemed too thin as a batter. AnonymousLos Angeles, CA8/26/2020Update: I'm the Anonymous from Pasadena, CA who made the dosas from the fresh batter then left it to ferment. After fermenting for a day or so, my dosa batter was a little thicker - I added a touch more water - and a little tangy. I liked the resulting dosas better after the mixture was fermented. But the first batch still tasted good. In future, I will probably do as I did this time, and make some dosas from the fresh batter and ferment the rest of the batter. AnonymousPasadena, CA8/6/2020Dosai is dosai because it is a fermented rice dish; fermentation happens by adding urad dal and fenugreek seeds to the rice batter.  Additionally, some rice types ferment better than others.  For example, idli rice is ideally used to make dosai because it ferments very well, although basmati rice will also work. Some people turn on their oven light and put the rice batter to ferment in the lit oven.  Others leave it out to ferment, especially when the weather is warm.  If this recipe was accurately produced then it would indicate that Chetna Makan did not grow up eating or making dosai since the glory of the dosai is in its slight tangy and sour tasteTheSwordofTipuSultanCalifornia8/4/2020I've never had dosa made of whole moong dal before (though I love whole moong dal and cook it a lot) and I really liked the added nutty flavor and color the green skins added. I used Malabar spinach because I had some growing outside, and it's purple, so mine didn't come out as vibrantly green, but it still tasted great. I did find I had to get my pan very hot to get the crispy, lacy edges I love. I'm cooking for one and made the whole recipe, so I will ferment the remaining batter as suggested by the other commenters and report back. \nI lived in London as a kid and recently I've been nostalgic about the Indian food, so thanks for the recipe - it's really helping me branch out my South Asian cooking!AnonymousPasadena, CA8/4/2020Sorry, that got posted before I had finished.\nYou can ferment the moong and rice paste for a couple of hours (covering with a cloth or light cover for the container) and thereafter add the blended spinach, chiili, Salt paste.  AnonymousMumbai, India 8/4/2020Yes, it's a great option for dosa.\nYou can ferment the moong, rice combo for a couple of hours and mix the blanched spinach India aste Dev BhattacharyaMumbai, India 8/4/2020Yes, raw beans and rice. I was under the impression that dosas usually had to be left out to ferment! I usually let mine sit out a couple days after the blender step and it doubles in size, becomes more airy, and has an interesting and complex sourdough flavor... dunno if the spinach could interfere with that, though.AnonymousPittsburgh8/3/2020Clarification: Dried beans and dry rice (not cooked) are to be soaked, correct?\nAnonymousCanada8/3/2020Explore Bon AppétitIndianSouth AsianAsianSpinachLeafy GreensVegetableRiceRice & GrainsEasyMainVeganVegetarianGluten-FreeDairy-FreeNut-FreeHealthyishBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-03", "author": ["Condé Nast", "Chetna Makan"]}