{"id": "2629d26f2e7c1b6798c47c247096ea19", "url": "https://www.bonappetit.com/story/wild-fruits-jam-tarts", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Wild Fruits Jam Tarts Are the American Childhood Breakfast I Never Had | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Jam Tarts Are the American Childhood Breakfast I Never HadOnce I popped, I couldn’t stop.By Ali FrancisNovember 19, 2020FacebookTwitterEmailPhoto by Meredith JenksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I didn’t know what the heck a Pop-Tart was until about five years ago, when I moved to the States. Growing up tucked into 16,000 acres of Australian bush, there were no salacious McDonald’s billboards anywhere, which meant my mum successfully tricked my brother and me into believing that whole wheat porridge was life’s greatest joy. Oooh, raisins today! we’d squawk, grinning our gobs off and heaping scoops of dry bran on top.Now that I’m an adult woman and at liberty to curate my own breakfast spreads, you best believe Pop-Tarts are front and center. But not just any Pop-Tart! I’m talking about Wild Fruits, a family-run operation in the North Country of New York selling handmade riffs that leave the original Pop-Tarts back in 1964, where they belong. Unlike those 50-some ingredient packaged treats (I lost count after “blue 1”), Wild Fruits jam tarts are made of just seven: milk, flour, butter, sugar, egg, pectin, and locally grown fruits.Let’s talk about the flavor lineup. The blueberry is so packed with berries it almost feels good for me. The seasonal apple pie deserves a notable mention. I’m eagerly anticipating the forthcoming sticky date(!), which I’m taking as a nod to my favorite Australian dessert. But my favorite Wild Fruits flavor is the strawberry rhubarb. The magic lies in its holy trinity—flaky butter dough; perfectly sweet-tart jam; and a slick of jam-laced, fruity frosting—which head baker (a.k.a. Mom) Roberta Yaeger says are all inspired by different family recipes. “Our family is known for strawberry rhubarb pie, and we use my mother’s pie recipe for the dough and then my grandmother’s orange drop cookie recipe for the frosting,” she says.All of the fruit is sourced in the Adirondacks, from places like ADK Growers, LLC., Fobares Fruits, and Martin’s Country Store, as well as locals-only spots: “The family rhubarb patches, secret dirt roads, and the Amish farm stands,” says Jake Yaeger, son and logistics lead. “We’re truly an East Coast company,” agrees Rachel Yaeger, daughter and marketing brains. It goes without saying that fruit picked locally and in-season makes for superior jam—the kind that tastes like the plump berries and blush-colored stalks it’s made from, and not just miscellaneous sweetness. (One thing to note is that each batch of Wild Fruits is made to order, which is why they taste so fresh but only have a two-week shelf life.)Since Wild Fruits launched in June 2019, most of its orders end up in its home state, as well as boutique stores like Pop Up Grocer in NYC and Flying Lotus in Canton, NY (where the jam tarts are made). But online orders across the board have peaked throughout the pandemic. “I think with people being locked in at home they’re an easy, thoughtful, and homemade item that can be sent to friends and family,” Rachael says. Buying a variety pack as a gift to oneself is advisable—a sweet touch in a thoroughly bitter year. To stretch out my bounty, I like to start each morning with a tart roulette. I cut whichever flavor comes out of the box into quarters, eat the little squares one at a time with my pinkie raised like they’re cucumber sandwiches and I’m the Queen of England. And while I’d like to say that I still opt for good old porridge some mornings, mum’s always said I’m a terrible liar.Wild Fruits Variety Box$20 at Wild FruitsExplore Bon AppétitHighly RecommendShoppingPastryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-19", "author": ["Condé Nast", "Ali Francis"]}