{"id": "262f1f56bb571028f2470d15b918e291", "url": "https://www.bonappetit.com/recipe/ricotta-gnocchi", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Springy Ricotta Gnocchi With Peas and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpringy Ricotta Gnocchi With Peas and HerbsBy Sarah JampelApril 26, 20204.8(54)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sarah JampelEmailPinterestPrintEmailPinterestPrintIf you’ve ever been intimidated by the thought of making fresh pasta at home, look no further. Ricotta gnocchi is simple to make, and it’s faster and more foolproof than its potato counterparts. The only tricky part is adding enough flour so that your dough is easy to work with, but not so much that it becomes stodgy or tough. For this recipe, you want to use a grocery store ricotta—not something homemade or small-batch. And if you don't want to make the buttery herb and pea sauce, use whatever you'd prefer, be it marinara, pesto, or sage and brown butter. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonSmall Bowl$13 At AmazonCutting Board$10 At IKEALarge Pot$55 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonBench Scraper$8 At AmazonLarge Basting Spoon$16.37 At AmazonMicroplane$16 At AmazonIngredients4-6 servings6Tbsp. unsalted butter1large bunch chives or ½ cup tender herbs like mint, basil, or dill1garlic clove2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more16oz. whole-milk fresh ricotta1large egg2large egg yolks1½tsp. freshly ground black pepper, plus more, or ¼ teaspoon crushed red pepper flakes½cup pre-grated Parmesan, plus more for serving1cup (125 g) all-purpose flour, plus more10oz. frozen peas1lemonPreparationStep 1Cut 6 Tbsp. unsalted butter into small pieces. Place in a small bowl and chill in the fridge until ready to use. (It's important that the butter is cold because that will help it to emulsify into the sauce later on.)Step 2Thinly slice 1 large bunch of chives crosswise into rings. You should have about ½ cup. (If you're using another herb—like mint, basil, or dill—roughly chop.) Peel 1 garlic clove. Set both aside separately.Step 3Bring a large pot of salted water to a boil. Cover with a lid and keep hot over low heat while you make the gnocchi.Step 4Line a rimmed baking sheet with parchment paper or a silicone mat and dust lightly with flour.Step 5To make the gnocchi dough, scrape 16 oz. whole-milk fresh ricotta onto a clean flatweave towel or a double layer of paper towels; wrap up to enclose cheese or place more paper towels on top and forcefully press down on ricotta to draw out excess moisture. If you don't draw out moisture now, you'll have to add more flour later, which can make for tough dumplings. (You should now have 14–15 oz. if you’re weighing.)Step 6Transfer ricotta to a medium bowl. Add 1 large egg, 2 large egg yolks, 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and several generous grinds of black pepper and mix well with a heatproof rubber spatula to combine. Then mix in ½ cup pre-grated Parmesan followed by 1 cup (125 g) all-purpose flour. If dough is sticky, add more flour by the tablespoonful until dough is workable—it should still feel very light and pillowy (the amount of flour you need will vary depending on the moisture level of your ricotta—it could be 1–4 Tbsp. more).Step 7Transfer dough to a floured work surface and knead a couple of times to bring together. Cut into 6 pieces. Roll out each piece to make a ¾\"-diameter strand, dusting with more flour as needed if dough is too sticky to work with.Photo and Food Styling by Sarah JampelStep 8Using a chef’s knife or a bench scraper, cut strands into ¾\" pieces (flour your knife or scraper to make the process easier). Transfer gnocchi to prepared baking sheet as you go.Photo and Food Styling by Sarah JampelPhoto and Food Styling by Sarah JampelStep 9Now it’s time to cook your gnocchi. Bring the reserved water back to a vigorous boil over medium-high heat, then use parchment paper underneath gnocchi to gently, delicately, and carefully (did we mention to be gentle?) add gnocchi to boiling water (it’s okay if some flour gets added too).Step 10Stir gnocchi gently with a slotted spoon to make sure they aren’t sticking to the pot or one another. Shake out parchment paper and save it for the next time you bake. Place clean baking sheet near your pot. Cook until gnocchi rise to the surface, about 45 seconds, then cook 1 minute more. Using a slotted spoon, scoop out gnocchi and place on baking sheet—it’s okay if you transfer some cooking water as well. (If you want gnocchi that are still quite soft in the center, you can fish them out as soon as they float. Try one to see what you prefer!)Photo and Food Styling by Sarah JampelStep 11To make your sauce, pour out pasta cooking liquid, reserving 2 cups, and wipe pot clean.Step 12Set pot over medium heat and pour in ½ cup reserved pasta cooking liquid; add 10 oz. frozen peas and a big pinch of kosher salt. Cover pan and cook until peas are bright green and warmed through, about 3 minutes.Step 13Remove lid and bring water to a simmer over medium-high heat. Using spatula, vigorously stir in reserved chilled butter a piece at a time, adding the next piece only after the previous piece is melted. You should have a smooth buttery sauce when you are done.Step 14Finely grate reserved garlic into sauce. Slice 1 lemon in half. Cut 1 half into wedges and set aside for serving. Finely grate zest from remaining half into sauce, then squeeze in its juice. Add 1½ tsp. freshly ground black pepper or ¼ teaspoon crushed red pepper flakes and mix well to incorporate. Add gnocchi and toss, adding up to ½ cup pasta cooking liquid as needed, until sauce clings to and coats gnocchi. Toss in most of the reserved chives or herbs and cook 20 seconds.Step 15Divide gnocchi and sauce among shallow bowls and top with remaining chives or herbs and more Parmesan and pepper or crushed red pepper flakes. Serve with reserved lemon wedges for squeezing over.Photo and Food Styling by Sarah Jampel Step 16Do ahead: Gnocchi can be formed 1 month ahead. Freeze on baking sheet until firm, then transfer to a freezer-safe airtight container. Cook from frozen.How would you rate Springy Ricotta Gnocchi With Peas and Herbs?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleI've made this a couple of times to rave reviews from family!!  I added a few toasted pecans, but that didn't change the underlying recipe.  I've now also stolen the gnocchi part of this recipe and have served them with a variety of other sauces on different occasions - it is that good and that versatile.  And it's easy!!!  I knock off a double batch, freeze them on a cookie sheet in the deep freeze and it's a fantastic source of a quickie meal.  AnonymousVictoria, B.C. Canada12/26/2020So nice and fluffy and took me less than 20 minutes from start to cooking.  I would make sure they are not cut too big as they expanded a little whilst cooking.AnonymousMiami, FL9/24/2020Absolutely fantastic! my partner and I aren't even big pea fans and it's already a top dinner of ours. The sauce is wonderful perfect amount of creamy cheese and citrus tang from the lemons.Adrienne GorneyMinneapolis7/7/2020Omg how delicious! The gnocchi came together perfectly. I think I must have overcooked the peas because they weren’t as vibrant and green as the photo, but they still tasted great! I threw some mushrooms in with the peas and they worked great. yagurlcarlyTucson, Arizona6/28/2020This was just fantastic! I made the ricotta from scratch (half a gallon of milk in the instant pot yogurt setting, then throw in some vinegar and drain), drained it through cheesecloth, wrung it out, then let it sit exposed in the fridge to dehydrate a little more. I was skeptical with that butter water sauce - but the finishings at the end (garlic, lemon zest, red pepper, etc) made it feel way more complex than it was. Clipped random herbs, used up some frozen peas, and it tasted like something you'd order at a nice restaurant. Really exceeded expectations. Will definitely make this again. Ellen EpleyLos Angeles6/7/2020This was so much easier than I expected! Once I squeezed out as much liquid as I could, I transferred the ricotta into fresh paper towels and put a cast iron pan on top to get out any water that I couldn't. I think this made a difference as I only needed one extra tbsp of flour. This also makes a lot of sauce so I sauteed mushrooms and broccolini on the side and added it for a much more filling meal. Highly recommend!AnonymousSan Francisco 6/4/2020This is easily one of my favorite recipes! Delicious, creamy, lemony and fesh!\nI followed Sarah suggestion when she was making the recipe on basically ig and I use scallions as I always have them in my fridge. I had to use more flour but I've made it already around 4 times and found a way around it. I cover the dough in flower so it doesn't stick to the surfaces and I don't have to work that much flour into the dough itself. \nI prepare gnocchi on Sundays freeze them and whenever I feel like having it, it takes 1 pan and around 12 min to get a delicious meal.Daria_The Netherlands6/2/2020This was so good! I had never made pasta before and this was a really easy version. We had asparagus on hand so we used that instead of peas and it was a great spring dish. I even accidentally used TWO cups of pasta water instead of ½ cup (two cups was to be reserved if needed) and the emulsified sauce still turned out great. AnonymousMinneapolis, MN6/2/2020This should have a permanent place on the homepage. Not only does this make something which can feel quite intimidating at first glance extremely approachable but it is also delicious. The gnocchi really were pillowy and the sauce was refreshingly light.  E^B^RLondon6/1/2020We LOVED this dish! Had to continually add in a bit of extra flour to make sure the dough was light and pillowy, but we got there. Was a bit nervous because the vigorous boil disappeared as we added our little pillows, so it took longer for them to rise to the top. Used asparagus instead of peas, added red pepper flakes to the dough (happy accident), and used mint and chives as garnish. Divine. AnonymousDallas, TX5/28/2020The gnocchi was tasty however, I found the dough very tough and sticky.  I found this recipe difficult and I have made pasta before. I too also ended up using a ton of flour. I think the type of ricotta you use is super important and if I were to make this recipe again I will try different variations of ricotta. Plus squeezing the liquid out of the ricotta to make it the right consistency was hard. Please modify the recipe to show the exact type of ricotta used and different methods to get the liquid out. Seattle5/26/2020Super delicious, super easy. I've never made any kind of pasta before, so I was a touch nervous, but I figured if it was showing up on Basically, there was a good chance I wasn't going to ruin it. I followed the recipe exactly and had fantastic results. Light and fluffy ricotta gnocchi, butter with herbs (I had a mix of mint and basil on hand) and lemon was a perfect springy flavor combo. I highly recommend it for something that feels special but is not actually difficult, time consuming, or labor intensive. Anonymous5/26/2020Delicious and not too difficult! Thank you so much for publishing this recipe! It's one of my new favorites. I ended up with four good portions and served it with a side of caponata on bruschetta. It took me about 1.5 hours (but I'm generally a slow cook).AnonymousNebraska5/23/2020The gnocchi were great but the sauce was just okay. It was easy to make and a fun way to use ricotta.AnonymousPennsylvania 5/22/2020This was amazing! I only needed a cup of flour and the gnocchis were perfect. They were way easier to make than normal gnocchi and the texture and flavour was better in my opinion. The sauce was really simple and really complemented the dish! the only thing i would say is that the recipe made for 4 smaller portions (not 4-6 servings)serena.aspinall89023montreal5/20/2020Explore Bon AppétitGnocchiItalianEuropeanRicottaCheesePeaVegetableSpringMainEasterDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-26", "author": ["Condé Nast", "Sarah Jampel"]}