{"id": "2633fe6dcd21d3bc4a1eab0ac18c133e", "url": "https://www.bonappetit.com/recipe/brothy-clams-with-soba", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Clams With Soba Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrothy Clams With SobaBy Sohla El-WayllyNovember 18, 20194.7(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Bowls by Meilen Ceramics EmailPinterestPrintEmailPinterestPrintEvery batch of clams will bring a different level of saltiness to this update on linguine with clams, so be sure to taste the broth and add water as needed in case it's too salty.Ingredients4 servings36littleneck clams, scrubbed (about 4 lb. total)8garlic cloves12\" piece ginger, peeled10scallions, divided2Tbsp. extra-virgin olive oil6oz. dried soba noodles1Tbsp. black sesame seeds1cup dry sake¼cup white miso¼cup (½ stick) unsalted butter, cut into piecesPreparationStep 1Fill a large bowl with cool water and add a handful of salt, swishing with your hands to dissolve salt. Place clams in a colander, lower into bowl of salted water, and let sit 15 minutes to get rid of any grit. Drain and rinse clams, then repeat with fresh cool water and salt.Step 2If a lot of grit remains after the second round, repeat once more. Set drained clams aside.Step 3Meanwhile, thinly slice garlic, ginger, and 8 scallions. Heat oil in a medium pot over medium-low. Add garlic, ginger, sliced scallions, and a small pinch of salt and cook, stirring occasionally, until tender but no color has developed, 6–8 minutes.Step 4Cook soba in a large pot of boiling water, stirring occasionally, according to package directions. Drain and rinse under cool water, gently tossing to get rid of any excess starch. Drain well and transfer to a medium bowl. Add sesame seeds and toss to combine. Divide soba among bowls.Step 5Add sake and clams to garlic mixture, increase heat to high, and cover with a tight-fitting lid. Steam clams, covered and occasionally shaking pan back and forth just like when you pop popcorn, 5 minutes. Uncover pot and transfer opened clams among serving bowls, dividing evenly. If there are any unopened clams, cover pot and continue to steam, checking for and removing any opened clams every two minutes; discard any unopened clams after 15 minutes.Step 6Meanwhile, thinly slice remaining 2 scallions on a diagonal and reserve for garnish.Step 7Whisk miso into clam broth until dissolved. Add 2½ cups water and bring to a boil. Taste and add more water to broth if it’s too salty. Whisk in butter until combined.Step 8Divide broth among bowls. Garnish with reserved scallions.Step 9Do Ahead: Clams can be soaked and cleaned 12 hours ahead. Chill on a damp towel-lined baking sheet.How would you rate Brothy Clams With Soba?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI cook this often using 1 dozen little necks per person (for 3 people). I discovered that I prefer much less water, like 1 cup, which makes it less of a broth, but a more intense sauce.  Last night, I topped with butter toasted panko mixed with some Japanese 7-spice, and it was nice addition.JodiNYC1/9/2022This was delicious! I served 4 people and got 50 little necks from the fish market, though 40 would have been sufficient. I used red miso instead of white (my store did not have any) and will probably add shallots to the next batch. Per the comments I served it with a shaved parmesan & fennel salad along with crusty bread. Highly recommended! AnonymousDuxbury, MA11/23/2020We made this for 5 people using 5lbs of fresh Oregon steamer clams.  Recipe was quite good - results were really good.  Not sure about needing to add 2.5 cups of water at the end....probably a cup would have been sufficient - nonetheless the crowd (including my mom and our teens) finished it all off.  We had a nice salad with a brisk vinaigrette to cut the fat and a toasted baguette.  stefan_loPortland, OR9/19/2020This was so good! Re: the broth, I struggled about adding butter as the broth tasted really good already before I added the butter, and I wasn’t sure what the butter would do, but I added it anyway, and it was phenomenal!  It smelled wonderful, and I think it added more depth to the broth.  Hubs loved loved loved it, and so do I.  Thank you! Anaheim, CA 9/14/2020this recipe was amazing and I wish I could hug Sohla for making it. I added a lil dashi with my water to the broth because I’m extra, but I’m sure it’s perfect either way. haleybrownLos Angeles, CA9/6/2020This was great and very easy to make, but I felt like the butter overwhelmed the broth. It would have been much lighter and cleaner-tasting without the butter. The soba noodles were so delicious and adds a great chewy texture to the dish. I’d definitely make again (minus the butter). AnonymousNew York8/17/2020Amazing, an instant favorite the broth is very buttery but not too much with the miso adding depth. I crave it almost weekly AnonymousKnoxville,Tn6/14/2020Awesome! I wanted something a little different from the usual butter/garlic/pasta/clams. This fit the bill! The broth was amazing and I could have had a whole bowl of just that. It took longer than 5 minutes of steaming for the first round of clams to pop--probably closer to 10 minutes. This was even great the next day for lunch. roseemojiPittsburgh, PA2/26/2020I made with canned clams because I'm cheap and because I had them already. I imagine it would be better with fresh, but that's not a complaint. It turned out great with the canned clams. The miso with the butter gave the broth a really nice savory richness. The only thing was that I felt it was missing a little acidity at the end. Maybe this is because fresh clams have a cleaner flavor. Either way, I found a little rice vinegar really lifted the dish. AnonymousPasadena, CA1/23/2020Explore Bon AppétitSoupSoups and StewsClamShellfishSeafoodSoba NoodleNoodlePasta & NoodlesSakeAlcohol & Other DrinksMainHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-18", "author": ["Condé Nast", "Sohla El-Waylly"]}