{"id": "2634444c053b1d97459475922bceb6f3", "url": "https://www.bonappetit.com/story/spring-is-a-lie", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "I’m Sorry to Be the One To Tell You This, But Spring Is a Lie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Sorry to Be the One To Tell You This, But Spring Is a LieHave you checked your farmers’ market lately?By Meryl RothsteinApril 5, 2019FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailIt is the 17th day of spring. But is it really? More than two weeks into the season and, here in New York, there are still 40-degree days in my 10-day forecast. Yes, we’ve had a couple gorgeous afternoons where the thermometer rises to 60 and you put on a denim jacket and decide you don’t need to wear tights. But I promise the moment you put your winter coat in storage is the moment when Mother Nature pulls out that one last snowstorm she’s been hiding up her sleeve.At Bon Appétit, we herald spring’s arrival, developing recipes around the verdant glory of seasonal produce. Our April print issue, which magically arrived on newsstands on the day of the spring equinox, includes wonderful recipes for chicken saltimbocca with crunchy sugar snaps and loads of mint, juicy chicken thighs with leeks and peas. We can’t wait to cook with rhubarb and artichokes and asparagus and watercress. You should make these recipes the moment these ingredients land at your farmers’ market! But you know what’s at my farmers’ market right now? Cold-storage apples, sweet potatoes, and rutabaga. Rutabaga!Yes, the peas will arrive eventually, and there’ll be that week when everyone loses their minds over ramps (do people still get excited about ramps?), but by that point it’s basically Memorial Day, the unofficial start of summer—which really isn’t summer at all, but that’s a rant for another day.Explore Bon AppétitSpringFarmers MarketRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Meryl Rothstein"]}