{"id": "263ba32cb7598785eece820dd7f36c98", "url": "https://www.bonappetit.com/story/judy-disaster-kit", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "This Disaster Kit Helps Me Feel Prepared for Anything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Disaster Kit Helps Me Feel Prepared for AnythingJudy helped me get my life together.By Joseph HernandezJune 3, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Just a week before a once-in-a-lifetime pandemic brought the world to a halt, I finished reading Ling Ma’s eerie Severance, a novel set in a world ravaged by a mysterious illness. The protagonist, a corporate cog in an alternate Manhattan, finds her world consumed by a global pandemic with an origin story in near-lockstep with actual current events. So my anxiety was already through the roof when the never-ending stream of news and social media about COVID-19 and our government’s slow, politicized response started up. Ma’s debut will indelibly survive in my head as “that apocalypse book I read right before the actual apocalypse.”For weeks following, I couldn’t escape my mind’s hellscape of cataclysm and societal collapse. How would my husband and I survive? Should we shelter in place? Escape to somewhere less crowded like other people (despite advice to the contrary)? Could we survive an extended quarantine as if it were a medieval siege? Being prepared for the unknowable felt herculean and impossible.I started to throw a somewhat random assortment of items into a duffle bag. Lots of the good snacks—jerky, dried nuts, packets of tuna and salmon—because the world may be ending, but I still have my taste buds. I also added water filtration straws, a solar-powered lamp, extra masks, matchbooks from beloved bars we could no longer frequent. It was paltry yet chaotic, but hey, at least I was doing something about my anxiety.But as I researched detailed preparedness lists created by the Centers for Disease Control and Prevention, the Federal Emergency Management Agency, and the American Red Cross, I realized my ad hoc disaster kit wasn’t quite up to their high standards. Then I met Judy.Photo by Emma FishmanThe Mover Max15% off when you buy two.$195 at JudyJudy isn’t a person, but a household kit for wannabe survivalists. As someone easily turned off by the ultramasculine bravado of prepper culture (seriously, Reddit forums are wild), to me, “Judy” evokes an image of a reliable, clearheaded friend you can trust in a pinch. Billed as a “ready for any scenario” supply cache, Judy offers four different options that accommodate families and groups of varying sizes. Each is stocked with emergency products that will help the user stay safe, warm, hydrated, and fed for up to 72 hours.I opted for the Mover Max, which includes supplies for a family of four packed in a water-resistant knapsack in a highly visible shade of orange. Very “emergency.” Unlike my duffle bag, which I needed to sling over my shoulder like a tote, the Judy Mover Max features adjustable straps and is worn like a backpack, leaving your hands free to fiddle with a phone or tool, to climb or whatever else you need two hands for. Inside, all the supplies are neatly labeled and packed in cardboard boxes—first aid kit, handwarmers, a collapsible multi-tool, flashlight, energy bars, and even flat, Capri Sun–like packs of water. (NB: I would eat the vanilla-flavored energy bars if my life depended on it and under no other circumstances. Would it have been too much to stock, say, astronaut ice cream, instead?)With my Judy Mover Max tucked into the hall closet, I felt my anxiety ease—but would this kit really sustain me along with my husband and our hedgehog son if disaster were to strike? “In an absolute emergency, when you’re grabbing something to run out the door, these kits have the basics for immediate first aid and survival,” says Jonathan Sury, a project director at the National Center for Disaster Preparedness at Columbia University’s Earth Institute, “but emergency preparedness is not one-size-fits-all.”“A preassembled kit doesn’t take into account every household. How could it? A family could be supporting a number of younger children or an elderly individual with special medications,” Sury explains. In addition to tangible supplies like first aid and food and water, he recommends considering other “soft” essentials like a phone tree or contact network with neighbors and loved ones and a digital emergency kit for important documents. Now that we’re entering a later phase of this pandemic, this is the perfect time to sit down with your family and friends to come up with a disaster plan, he suggests. The NCDP has a useful Preparedness Wizard for those looking to get started on implementing a plan.Knowing my Judy Mover Max would handle all the basics gave me a sense of calm, and after speaking with Sury, I’ve started customizing my kit to suit my family’s needs. I’ve added an extra pair of my prescription glasses, lists of emergency contact numbers, some petty cash, hedgehog food and—yes—my fancy tinned salmon. More important, my journey with Judy has given me the perfect jumping off point for conversations with my friends and family about their own disaster plans and how we can support each other if things go sideways (again).Explore Bon AppétitShoppingHighly RecommendCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-03", "author": ["Condé Nast", "Joseph Hernandez"]}