{"id": "2640e1fce2dac1199fcac9bd442fbed6", "url": "https://www.bonappetit.com/recipe/grilled-serrano-salsa-verde", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Grilled Serrano Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueGrilled Serrano Salsa VerdeBy Anna StockwellJuly 10, 20183.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintGrilling the chiles tames their heat a bit and adds a nice smoky flavor to this green sauce recipe. You can also fine-tune the heat by using fewer or more chiles, depending on the intensity of the ones you have and your personal taste. Try this sauce with our dinner-served-cold recipes: salmon, lamb, chicken, or beef.IngredientsMakes about 2 cups6–8serrano chiles1bunch basil1bunch cilantro1bunch parsley1¼cups extra-virgin olive oil½cup sherry vinegar or red wine vinegar2½tsp. kosher saltSpecial EquipmentOne 8\" metal or bamboo skewerPreparationStep 1Prepare a grill for medium-high heat. Thread chiles onto skewer and grill, turning often, until charred and softened, about 6 minutes. Let cool; remove stems.Step 2Meanwhile, pluck leaves from basil and leaves and tender stems from cilantro and parsley. (You should have about 2 cups of each herb.)Step 3Pulse chiles, basil, cilantro, and parsley in a food processor until finely chopped. Add oil, vinegar, and salt and pulse until a thick, slightly textured sauce forms.Step 4Do Ahead: Sauce can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.How would you rate Grilled Serrano Salsa Verde?Leave a ReviewTell us what you thinkExplore Bon AppétitSalsaCondimentMexicanLatin AmericanSerrano ChileChileVegetableBasilHerbs & SpicesCilantroParsleySummerQuickEasyDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoHealthyishGrillingFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}