{"id": "26428b76f9e62d0029f9954ad24c9165", "url": "https://www.bonappetit.com/story/moringa-plant-wellness-superfood", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Investigating The Moringa Plant, Or How a Common Indian Vegetable Became a Wellness Nightmare | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Grew Up Eating This Common Indian Vegetable. Now It's a Wellness 'Superfood.'I never thought I'd see this childhood staple be sold as an antidote to all things bad.By Nikhita VenugopalMay 14, 2018FacebookTwitterEmailFacebookTwitterEmailHalfway through a travel story about a miracle plant called moringa, I stopped reading. An American woman traveling through the Caribbean had been offered a couple of raw moringa seeds by her local guide, who swore they were the secret to a healthy life. A photo of the seeds showed that they came from greenish-brown, knobby long pods, kind of like drumsticks.I had never heard of moringa. But I knew those drumsticks. After a few minutes of Googling, I realized what I had been reading about. In Tamil, one of the many languages spoken in India, it’s called murungai, a vegetable commonly found in south Indian kitchens. The name wasn’t very different, but this mystical plant, the next big superfood and antidote to all things bad, was not what I had in mind.The moringa tree, native to India and other parts of south Asia, grows quite commonly in tropical and subtropical climates. In the Philippines, where it’s called malunggay, moringa leaves are cooked regularly. It’s also grown in the Caribbean, the Pacific Islands, Latin America, and across Africa, including Ethiopia and Sudan, where moringa seeds are used for their water purification properties. Because of its nutritive value and ability to withstand severe drought, moringa trees have been used to combat malnutrition.Growing up Tamilian in south India, I have been eating murungai drumsticks my entire life. Almost every part of Moringa oleifera, also called the drumstick or horseradish tree, is edible. Parts of the root and bark, though less popular in cooking, have medicinal properties. The leaves cook down into a slightly bitter spinach-like stir fry. Its delicate white flowers come apart when simmered in sambar, a south Indian lentil stew, or steamed with basmati rice to make a fragrant pilaf.The ribbed drumsticks, typically cut into finger-length pieces, are best eaten in sambars as well, or sautéed in a simple semi-dry curry, with onions, curry leaves, chopped tomatoes, and an assortment of whole and powdered spices. A signature dish of the southern state Kerala is avial, a traditionally thick coconut-based dish that prominently features drumsticks. Once cooked, the inedible exterior of the pod can be easily split to reveal a fleshy interior with pea-sized seeds. Scrape the pulp out and toss the rough skin. It’s slightly sweet, somewhat earthy, but subtle enough to melt into whatever it’s cooked with.That’s murungai. Let’s talk about moringa.Studies point to the plant’s litany of therapeutic and nutritive properties — a powerhouse packed with iron, Vitamins A, B and C, protein, and potassium. And with the moringa tree’s roots in Ayurveda, it was really only a matter of time before the humble plant went from muted appreciation to wild celebration as the next exotic health fad. Believers describe an energy boost that comes from a daily dose. Vogue extolled its virtues as the next superfood. It’s a must-have skincare ingredient, according to Harper’s Bazaar. Well + Good proclaimed 2018 as the year of moringa.In countries like the United States, where fresh moringa isn’t easily available, moringa-based supplements like capsules, teas, and dried-leaf powders scooped into smoothies and juices, have filled the void. Often imported from India, West Africa and the Caribbean, moringa powders are packed in six to 16-ounce bags for $15 to $24 each. One company that does carry fresh moringa grown in Florida sells half a pound for $10. At my local vegetable market in Bangalore, murungai leaves are sold in loosely-tied bunches, each holding about two dozen stalks that yield a cup of leaves (enough for a sambar or stir-fry), for 15 cents.Kuli Kuli, a U.S.-based moringa company, has said the leaves surpass superfood titans like turmeric and kale in anti-inflammatory benefits and nutritional content respectively, but the similarities don’t end there. Like moringa, kale was elevated from an ancient, humble European vegetable to the trend that wouldn’t stop trending. Turmeric too. As moringa green smoothies pop up across Instagram, turmeric’s “golden” latte moment is hard not to recall. From the cupboards of every brown kid’s kitchen to cafés around the world, a cup of turmeric-infused milk was seen as a cure-all for everything from mild pain to digestive issues, because it’s no longer enough for health fads to be healthy. They have to be healing, too.Shortly after my brush with moringa, I was at my grandmother’s home in Chennai. We sat down to a late lunch, and she lifted the lid of a glass bowl to reveal a thick brown goat curry, cooked with onions, tomatoes, and chopped murungai drumsticks plucked from the tree behind her house.“Fresh from the garden,” she said.The leaves, she said, were especially good for you, and she sometimes took a handful from her tree and blended them with honey and lemon for a refreshing drink. I asked if she knew that murungai was the latest health craze of the west and that expensive teas and moisturizers were being sold everywhere. She looked at me dismissively and we started talking about something else.When I got back home from Chennai, I unpacked my duffel bag and found two drumsticks, fresh from the garden. I could have attempted a smoothie recipe, or chewed on the raw seeds, but all I really wanted was to eat them with sambar.Explore Bon AppétitHealthyishIndianGreenTrendsRead MoreshoppingThe Best Greens Powders You'll Actually Want to DrinkGallery5 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-14", "author": ["Condé Nast", "Nikhita Venugopal"]}