{"id": "2653662bb288c16fbb63cf288f64e25f", "url": "https://www.bonappetit.com/story/orion-gosomi-tea-cookie", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Are Orion Gosami Cookies? Crackers? Who Cares—They’re Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAre These Korean Snacks Cookies? Crackers? Who Cares—They’re DeliciousI can easily eat a thousand of them at a time.By Christina ChaeyAugust 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.After 30 years of munching my way through Choco Pies, shrimp crackers, and fistfuls of honey butter chips, I understand that Koreans know WHAT is UP when it comes to perfectly engineered snacks. They’re always just the right balance of sweet, salty, and umami MSG, and lest you think they’re only age-appropriate for children 12 and under, look no further than Orion Gosomi, the best-ever tea cookie that’s way too classy to be called “junk food.”These thin sesame biscuits are delightfully crisp and nutty, studded with sesame seeds and with just the tiniest hint of coconut. They’re finished with a sprinkle of crunchy sugar and, critically, SALT, which is why when you bite into Gosomi, every little node in your brain’s pleasure center lights up like a pinball machine. The best way to eat it, if you’re a weirdo (me), is by placing a biscuit on your tongue and letting it slowly dissolve, like a soda cracker.No one can quite agree on what, exactly, Gosomi is. Amazon describes it as a “sweet cookie cracker,” while other retailers refer to it as a “cookie,” “cracker,” and “biscuit.” (A mini Korean lesson: The “goso” in “gosomi” refers to a word that doesn’t have an English equivalent, but it roughly means “sweet and savory in a nutty way.”) Me? I don’t care what you call it. But I do challenge you to not eat a sleeve of these at a time, especially alongside a hot cup of nutty herbal tea like roasted dandelion or burdock root at approximately 3:04 p.m. on a Tuesday.Buy it: Orion Gosomi Sweet Cookie Cracker, $10 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendSnackRead MorecultureI Eat an Unhealthy Amount of These Healthy CrackersBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-08", "author": ["Condé Nast", "Christina Chaey"]}