{"id": "265e68a52ae91d32e7fd391ad33882f7", "url": "https://www.bonappetit.com/recipe/cinnamon-tomato-jam", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Cinnamon-Tomato Jam Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueCinnamon-Tomato JamBy Maydan, Washington, D.C.August 14, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintCinnamon lends additional sweetness to this savory jam, making it an excellent match with heavily spiced lamb or pork. This recipe is from Maydan in Washington, DC, our No. 2 Best New Restaurant 2018.IngredientsMakes about 2 cups128-oz. can whole San Marzano tomatoes3Tbsp. extra-virgin olive oil½medium white onion, finely chopped4garlic cloves, finely chopped1Tbsp. tomato paste23\" cinnamon sticks3Tbsp. sugar3Tbsp. toasted sesame seeds2Tbsp. distilled white vinegarKosher saltPreparationStep 1Pour tomatoes and their liquid into a large bowl and finely crush tomatoes with your hands. Heat oil in a large saucepan over medium. Cook onion, stirring occasionally, until soft but without taking on any color, 8–10 minutes. Add garlic and cook, stirring, until softened, about 2 minutes. Add tomato paste and cook, stirring, until it begins to darken, about 2 minutes. Add crushed tomatoes, cinnamon sticks, sugar, and sesame seeds. Reduce heat to low and cook, stirring occasionally and smashing down tomatoes using a wooden spoon, until flavors have melded, 35–45 minutes. Reduce heat as needed to keep jam from simmering too hard; you don’t want it to reduce much. Remove from heat and stir in vinegar; let cool. Season with salt.Step 2Do Ahead: Tomato jam can be made 1 week ahead. Cover and chill.How would you rate Cinnamon-Tomato Jam?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThe most underrated dish at Maydan in Wash DC is this tomato jam right here. It's exactly what all households need ALWAYS! I prefer it thicker, so I double the tomato paste & nix the juice from the can (I save the juice for sauce!) but the flavor is on point.AnonymousNew Jersey4/15/2020Explore Bon AppétitCondimentJamSpreadsAmericanCanned TomatoTomatoVegetableCinnamonHerbs & SpicesEasySideDairy-FreeNut-FreeVeganVegetarianGluten-FreeSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Maydan", "Washington"]}