{"id": "266abcecbb17fd7af6bf7a5a8cca7f58", "url": "https://www.bonappetit.com/recipe/beet-and-hazelnut-dip", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Beet and Hazelnut Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueBeet and Hazelnut DipBy Ochre Bakery, Detroit, MISeptember 17, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintThis light and creamy (and definitely garlicky) beet dip is from Ochre Bakery in Detroit, No. 4 on our 2019 Hot Ten list. Every supporting ingredient in this recipe exists to make beets taste like their best selves: The maple syrup accentuates their sweetness, the hazelnuts play up their earthiness (but it’s not too earthy, we promise), and the lemon juice brightens up the whole thing.IngredientsMakes about 3 cups1lb. red beets without greens, scrubbed1½tsp. kosher salt, plus more1cup blanched hazelnuts3garlic cloves½cup coarsely chopped parsley½cup (or more) extra-virgin olive oil2Tbsp. (or more) fresh lemon juice1Tbsp. pure maple syrupPreparationStep 1Place beets in a large pot and pour in water to cover by at least 2\"; season with salt. Bring to a boil, then reduce heat and simmer until tender (a paring knife should easily slip through flesh), 45–60 minutes. Transfer to a bowl of ice water and let cool. Peel off skins (they will easily pull away); discard. Coarsely chop beets; set aside.Step 2Heat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 8–10 minutes. Let cool slightly.Step 3Transfer nuts and reserved beets to a food processor and add garlic, parsley, oil, lemon juice, maple syrup, and 1½ tsp. salt; process until smooth. Dip will be fairly loose but will set up in the fridge. Taste and add more lemon juice, oil, and/or salt if needed.Step 4Do Ahead: Dip can be made 1 week ahead. Cover and chill.How would you rate Beet and Hazelnut Dip?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis has become a staple recipe. It's fabulous for holidays, entertaining, or just a delicious and healthy veg snack to have on hand. Everyone that I've made it for raves about it and asks for the recipe. Love everything about it. Curious Alchemist Chicago, IL 11/25/2021Explore Bon AppétitDipBeetVegetableHazelnutNutStarterDairy-FreeGluten-FreeVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}