{"id": "266eafeebbd4e052e3a04b8387a08188", "url": "https://www.bonappetit.com/recipe/brioche-with-foie-gras-coffee-butter", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Brioche with Foie Gras-Coffee Butter Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBrioche with Foie Gras-Coffee ButterSponsored by NespressoFacebookPinterestTwitterEmailCAVANAUGH2 servingsThis is not your average bread and butter. At our Paris in New York dinner, chef Daniel Rose whipped up this decadent concoction using Nespresso Paris Black coffee.PrintIngredients1 cup plus 3 Tbsp. Nespresso Paris Black coffee1 ¼   tsp. gelatin4 oz. cooked foie gras4 Tbsp. butter, softened2 Tbsp. Port wine2 tsp. sugarSalt and pepper2 slices French brioche, toasted1 Tbsp. candied coffee beansFor candied coffee beans:10 coffee beans1 Tbsp. sugarRecipe PreparationPlace 1 cup of Nespresso coffee in a small bowl and sprinkle the gelatin over top. Let sit for 5 minutes. Bring the Port, sugar, and remaining Nespresso coffee to a boil in a small saucepan. Remove the pan from the stove and add the Nespresso coffee and gelatin mixture. Whisk until gelatin is dissolved.Combine the foie gras and butter in the bowl of a food processor. Process until smooth. Pour in the Nespresso coffee and Port mixture, season with salt and pepper, and blend until smooth. Chill the mixture in the refrigerator until well chilled and set up. Spoon onto the toasted brioche and top with the candied coffee beans.For candied coffee beans:Pulse the coffee beans in a coffee grinder once or twice until they are just lightly crushed.Place the crushed beans in a fine mesh sieve to eliminate the very small pieces or dust. Heat the sugar in a small nonstick pan over medium heat. As the sugar melts and caramelizes slightly, add beans and roll in sugar until coated. Remove from the heat.Recipe by chef Daniel RoseSponsored by NespressoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}