{"id": "26817a679b667786c6b1d4d685c4ac9d", "url": "https://www.bonappetit.com/recipe/cold-sichuan-peppercorn-noodles", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Cold Noodles With Sichuan Peppercorn Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCold Noodles With Sichuan Peppercorn DressingBy Simone Tong September 19, 20213.8(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintChef Simone Tong of Little Tong Noodle Shop and Silver Apricot in NYC uses a technique popular in Chinese cooking to pack big flavor into this cold noodle salad: Heat oil just until smoking, then carefully drizzle it over spices and aromatics, like Sichuan peppercorns, garlic, chile flakes, and scallions to create a deliciously fragrant dressing base for any noodle. Save any extra dressing for marinating smashed cucumbers and dipping dumplings.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidSmall Saucepan$155 At AmazonSlotted Spoon$13 $10 At AmazonDish Towel$6.15 At AmazonLarge Pot$55 At AmazonIngredients4 Servings1tsp. Sichuan peppercorns4scallions, thinly sliced4garlic cloves, finely chopped2Tbsp. white or black sesame seeds1½tsp. crushed red pepper flakes1cup vegetable oil½cup tamari soy sauce3Tbsp. balsamic vinegarKosher salt2ears of corn, kernels removed12oz. green beans, trimmed, thinly sliced on a diagonal8oz. dried udon or soba noodlesPreparationStep 1Using the side of a chef’s knife, crush Sichuan peppercorns until coarsely ground. (You can also do this in a spice mill if you have one.) Transfer to a small heatproof bowl and add scallions, garlic, sesame seeds, and red pepper flakes.Step 2Heat oil in a small heavy saucepan until the first sign of smoke. Using a towel to hold the handle, immediately pour oil into bowl with Sichuan peppercorn mixture. (This technique releases the flavors of the aromatics without burning them.) Stir in tamari and vinegar and season dressing with salt; let cool.Step 3Cook corn in a large pot of boiling generously salted water until bright yellow and tender, about 30 seconds. Using a slotted spoon, transfer to a large bowl \tof cold water and let cool.Step 4Cook green beans in same pot of water until bright green and tender, about 1 minute. Using slotted spoon, transfer to bowl with corn and let cool. Drain; \tset vegetables aside.Step 5Return water in pot to a boil and cook noodles according to package directions. Drain and rinse under cold running water; drain well.Step 6Combine noodles and reserved corn and green beans in a large bowl. Drizzle in ½ cup dressing and toss to coat. (You can add more dressing if desired; reserve any leftovers for another use.)Do ahead: Dressing can be made 3 days ahead. Cover and chill.How would you rate Cold Noodles With Sichuan Peppercorn Dressing?Leave a ReviewTell us what you thinkReviews (11)Back to TopTrianglei love this recipe! did not find it too oily... as the recipe says use only 1/2 of the dressing. Alex Canada 1/5/2022Our cooking club made this and here's the results:  Good dish, but a little salty, would cut down on the salt, Agreed, would use less salt since the soy sauce has salt, Very good! Good, but salty, Very good, but salty.  Very good, Very good!Liz PetersonLutz, Florida10/31/2021I had high hopes for this dish, but found it to be pretty underwhelming. As others have comments, it was far too oily -- the otherwise pleasant piquancy of the sauce totally lost in a sea of oil. Disappointed, and would not make again as written. fmColumbus, OH10/24/2021Awesome weeknight meal that is easy but still packs a lot of flavor. I enjoy it served hot and cold. Dana Denver10/12/2021The second time around, I used 1/4 cup Chinese light soy sauce and a teaspoon of dark soy instead of tamari (which seemed like a weird choice to begin with for Sichuan noodles). This improved the sauce, which was too loose and salty as written. Better color, too! I'll be making this again, and probably try swapping in different seasonal vegetables.Anonymous9/26/2021We quite liked this. The sweetness of the corn and beans is a nice balance for the spices in the dressing. It is a light meal and would be a great dish to bring to a picnic or use as a  side to meat or chicken at a BBQ. Will definitely are again especially if I can find the Sichuan peppercorns!LynneWV9/21/2021Too much oil and WAY too much tamari, but tastes pretty good. Would halve both.  I added soft tofu cubes, which I boiled in the same water. More work than I expected but if the dressing had been pre-made this would be a quick meal. BeccaNYC9/21/2021Entirely too much oil, wish I had used half, but....really delicious.   I upped the peppercorns because I love them.  and there is no substitute for sichuan peppercorns, they are a flavor and sensation all their own.  I digress....this is delicious!  I tossed in some lime juice to cut the oil.  Didn't bother with the corn or beans.  Also used Chinese vinegar vs Balsamic.  even though I made changes I don't think I changed the essence of this dish and will be making this all the timeJane ABostonian displaced in NOVA9/20/2021So refreshing to have the Sichuan pepper corn at home. Me and my GF loved it. She's over here breathing heavy from the spice. It wasn't clear why the recipe called for 1 cup of oil, but it makes sense if you save some of the dressing for other recipes. I used 1/2 cup. It might benefit from an ingredient that gives it some crunch, like peanut in the oil dressing. Also it was simply fun to make. Enjoy!PrikonDurham, NC9/17/2021Upfront I will say I did not have the peppercorn but researched substitutes and I used the ground pepper and coriander seeds ground. The dressing needs help in this recipe.  I cut the oil in half. Next time below I are the ingredients I will increase: 8 Scallions, not 4, 6chopped garlic cloves, 2 TBLs Rice Vinegar, 4 TBLs Balsamic, 2 TBLS chopped ginger (add) , 2 TBLs Sambal (add), 1 tsp sesame oil. Make sure you use 8 oz of pasta. JackieNJ9/6/2021Wow, the dressing! So outstanding and it made A LOT.  I was apprehensive, since Sichuan peppercorns are not something that I've liked in the past, but the effect was very subtle and not too tingly. I was also tempted to cut the oil in half, since a cup is a lot, but it all worked out. A perfect work lunch. AnonymousSan Francisco, CA 8/13/2021Explore Bon AppétitChineseEast AsianAsianSichuan PeppercornHerbs & SpicesUdon NoodleNoodlePasta & NoodlesSoba NoodleGreen BeanVegetableCornSummerQuickEasyWeeknight MealsMainDairy-FreeVeganVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Simone Tong"]}