{"id": "2697a39b38802b9f4a65cf765de74391", "url": "https://www.bonappetit.com/story/healthier-barbecue-sauce", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Healthy Barbecue Sauce For Everything You Grill This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMake This Healthier Barbecue Sauce and Put It On Everything You Grill This SummerThis sticky-sweet barbecue sauce is made from just a handful of ingredients, all of which we can fully get behind.By Chris MoroccoJuly 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailCreating a healthier alternative to barbecue sauce isn’t easy. The extreme range of flavors, from piercing vinegar to salty to sweet to barely perceptible umami, isn’t easy to recreate. The first time I tried, I ended up fleeing to the dark corners of the pantry, adding gobs of ketchup and a can of soda. It was, admittedly, delicious.But, this summer, I felt re-inspired. I've found that grilled chicken is one of the fastest, easiest ways of getting protein on my family's plate, but it needs a massively flavorful sauce to finish it during the final minutes of cooking. So I decided that this would be the year I figured out a better barbecue sauce.The version I came up with recreates the full-on concentrated flavor of a good barbecue sauce but with a handful of ingredients that I can fully get behind. It starts with a base of garlic cloves toasted in olive oil, followed by tomato paste for maximum tomatoey umami without the need for ketchup. To that, I add maple syrup, soy sauce, Worcestershire sauce, vinegar, and hot sauce, and it's ready to go.Just as with other barbecue sauces, you can’t put this one on your meat (or fish or summer squash) too soon or it will scorch. Wait until the meat has rendered its fat and browned—or your vegetables have almost finished cooking—before starting to lacquer it on.Turns out, healthy barbecue sauce is a lot like regular barbecue sauce: a bit sticky with sweetness, balanced by tart and tangy tomato flavor, with a vinegary peppery finish. And it takes all of ten minutes. The soda cans are staying where they are.Fire up the grill:Healthyish Barbecued ChickenClassic grilled chicken gets updated with an easy, healthier barbecue sauce.View RecipeExplore Bon AppétitHealthyishGrill BarbecueBarbecueRead MoreLifestyleThis Sweet and Spicy Grilled Squash Goes Out to All the Vegetarians at the BarbecueBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Chris Morocco"]}