{"id": "269b86c120d16e3f8d306f25559cdab9", "url": "https://www.bonappetit.com/recipe/blueberry-and-peach-graham-galette", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Blueberry and Peach Graham Galette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueBlueberry and Peach Graham GaletteBy Samantha SeneviratneJuly 6, 20214.5(46)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrint“I prefer the crust to fruit ratio better in a galette than a fruit pie, so this recipe is perfect for crust lovers,” says baker and recipe developer Samantha Seneviratne. A few graham crackers crumbled into the pastry dough give this homey blueberry and peach galette a sweet and nutty flavor that compliments the fruit.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonFrench Rolling Pin$17 At AmazonPastry Brush$9 At AmazonMicroplane Grater$16 At AmazonIngredients8 ServingsDough4graham crackers (about 2 oz.)1cup (125 g) all-purpose flour1Tbsp. sugar¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt10Tbsp. chilled unsalted butter, cut into piecesFIlling and assembly2large peaches (about 12 oz.), thinly sliced2cups fresh blueberries1Tbsp. cornstarch¾tsp. finely grated lemon zest¼tsp. ground cinnamon⅓cup (67 g) sugar, plus moreAll-purpose flour (for surface)1large egg, beaten to blend2Tbsp. chilled unsalted butter, cut into piecesVanilla ice cream (for serving)PreparationDoughStep 1Process graham crackers, flour, sugar, and salt in a food processor until crackers become crumbs and mixture is combined. Add butter; pulse until mixture resembles coarse sand with some larger pieces remaining. Add ice water by the tablespoonful, pulsing after each addition, until evenly moistened and dough holds together when squeezed (2–4 Tbsp.). Pat into a 1\"-thick disk and wrap tightly in parchment paper or plastic. Chill at least 1 hour.Do ahead: Dough can be made 3 days ahead. Keep chilled.Filling and assemblyStep 2Preheat oven to 400°. Toss peaches, blueberries, cornstarch, lemon zest, cinnamon, and ⅓ cup (67 g) sugar in a large bowl.Step 3Unwrap dough and roll out on a lightly floured sheet of parchment to a 12\" round. Arrange fruit on top, leaving a 1¼\" border. Lift dough edges up and over fruit, pleating as needed. Using parchment paper, slide galette onto a baking sheet; chill 10 minutes.Step 4Brush top of pastry with egg and sprinkle with sugar. Dot filling with butter. Bake galette until fruit is softened and crust is deep golden brown, 40–50 minutes (some juice may leak out).Step 5Serve galette warm or at room temperature with scoops of ice cream.How would you rate Blueberry and Peach Graham Galette?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleHas anyone tried it with frozen peaches? Please advice. Thank you.\nAnonymousChicago, Ol11/17/2021OK, I've baked my share of pastry over the years and never had a problem with the dough like I did with this one. It was a disaster. The dough stuck to the parchment paper and I could not \"slide\" it off. I ended up tossing the dough and turning the fruit into an oat topped crisp - didn't want to waste the filling!. I might try it again, but with a couple of changes - more flour on the parchment and assembling on the baking sheet instead of trying to slide it off the paper. If you use a large pizza pan it will have enough room around the edges to assemble.Donna LavalleeMundelein, IL9/17/2021This was DELICIOUS!  Everyone I served it to had seconds.  Peach and blueberry is a great combination and the graham flavor in the crust is a nice touchJackie MMadison, WI9/11/2021Fantastic and easy recipe! Made this with my daughter this afternoon, with gorgeous fresh Ontario peaches and wild blueberries from Quebec. Use gf flour and graham crackers. Turned out beautifully. We’ll be using the crust recipe to adapt for other fruit galettes all fall. Yum!AnonymousCanada8/23/2021On my first roll out the crust cracked at the edges so I added 2 tbs of ice water, reformed the disk and refrigerated the disk for 15 minutes.  Extra water solved the problem and the second roll out was perfect.  Great recipe.AnonymousPhoenix8/22/2021I have made this twice now, both times I used a refrigerated crust. The first time there was a lot of juice that seeped out. The second time I increased the cornstarch to 2 tablespoons and did not slice the peaches until the crust was ready. Minor seepage this time. Lovely to look at--delicious to eat.JoPendleton, OR8/15/2021Even my mother, who's a baker extraordinaire, said I beat her pie crust.  Well, probably equal.  For a novice, I made the dough once and over did it with ice water.  Tried again.  3 Tbsp OR just scant.  Perfection.   No leftovers, just rave reviews.   Amy OutlawHouston, TX8/9/2021Delicious with the addtion of graham cracker to the crust. I never thought about galettes having a better crust to fruit ratio!! I am a crust lover!!! I did drain the fruit before adding to the crust. So good!!!Mardy MRolling Hills Estates, CA8/7/2021Made this delicious dessert while camping. Added plums and used 1 large peach. I baked it in a cast iron pan. It was enjoyed by all and there was no leftovers. I’m baking another one today. AnonymousChico 8/7/2021I am a self-professed learner in pastry, so it's possible I screwed something up, but I found the crust way too crumbly. No amount of extra ice water/flour helped. I'd be willing to try again, but might try doing it by hand next time to make sure everything is properly hydrated.RitaChicago8/5/2021We loved it!  The crust was perfect, no problems working with it.  Delicious and delicate pastry.  I had one bad peach, so I also used a nectarine and some pitted sweet local cherries with the blueberries.  Farm to table.  Did not use cinnamon with the fruit.  Did use cinnamon graham crackers.  We will be enjoying this again  AnonymousCedarburg, wi8/1/2021I’ve tried twice to make this without much success. The first time , the dough was super sticky and impossible to fold over fruit. I baked it anyway and served as a( very tasty) crumble. I tried a second time & used American butter but this time the dough kept cracking while rolling ,again making it impossible to fold over. When it calls for 4 graham crackers , is it 4 sheets of graham crackers or 4 perforated rectangles? I converted the 2 ounces in the recipe to my cracker box measurements which was 4 sheets of crackers. Is that my problem? Needs clarification . AnonymousPhiladelphia8/1/2021This is an excellent recipe. My berries were a little tart so I added extra sugar. Peaches were super juicy so I did get some leakage. Crust was perfect even with the leakage. Everyone thought it was delicious. Definitely will continue to make this. Marie Fernandina Beach FL7/27/2021I’ve been searching for years for the best way to celebrate peaches and blueberries in the same dessert, and this is it.  I followed the recipe exactly.  The fruit gave off a LOT of liquid in the bowl which I did not try to put into the galette.  Then so much liquid leaked out during baking that I was afraid of a soggy bottom, but no.  The crust was both crispy and flaky.  Perfection!MichelleMetro Boston7/25/2021My fruit was ripe, so my filling didn’t need any additional sugar like the other reviewer suggested. I had bought some peaches and blackberries at the farmers market, so I swapped out the blueberries for blackberries and it turned out great. The flavor of the crust was good, but it was more brittle and less flaky than the crust I normally make. I usually make my dough my hand, but used the food processor this time, so perhaps that’s why it wasn’t as flaky. Either way, I’ll definitely make this one again — it was very easy!KeenaPortland, Oregon7/23/2021Explore Bon AppétitGaletteDessertFruit DessertPeachStone FruitFruitBlueberryBerryGraham CrackerOther IngredientsSummerNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-03", "author": ["Condé Nast", "Samantha Seneviratne"]}