{"id": "26b03778af3472c413cb22a2aa44d01e", "url": "https://www.bonappetit.com/story/maldon-sea-salt-bucket", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "You Need This Big Bucket of Maldon Sea Salt If You Cook Pretty Much Anything at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Need This Big Bucket of Maldon Sea Salt If You Cook Pretty Much Anything at HomeNothing scares me more than running out of those diamond-shaped flecksBy Julia KramerFebruary 28, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThis is a story about harmless addiction and also about why I bought a 3.3-lb bucket of Maldon sea salt.Maldon: the crunchy, diamond-shaped flecks from the southeastern coast of England without which no casually fanned steak or crinkly chocolate-chip cookie would be complete. And yet, all this time, I’d thought Maldon came in one vessel: an 8.5-ounce box. For most of the last decade, I’ve been a passionate but infrequent cook, and by “infrequent” I mean that I typically ate out three meals a day. If I made eggs on the weekend or cutlets for a rare weeknight dinner or a big steak salad for friends, I knew that that box of Maldon would be there in the pantry, ready to scatter a delicate shower of salt onto my plate.Let no steak hit the table without a sprinkle of Maldon.\nAlex LauThen two funny things happened: (1) I had a baby, which means that I no longer eat three meals a day at restaurants. (2) Now that I cook more at home, I go through Maldon at a somewhat alarming speed, and somehow I now live in a neighborhood where those elegant ivory boxes are mysteriously absent from the shelves of the three grocery stores in closest proximity to my apartment. A few weeks ago, this kindled in me such a sense of injustice that I went online to see if I could buy a few boxes in bulk. It was at this moment that Our Benevolent Amazon Overlords introduced me to The Maldon Bucket.You might be thinking, “Are you insane? Why did you not just buy a different flaky sea salt from one of your three surely bougie grocery stories?” I hear you. And in the case of virtually any other product I cook with, I would have picked up another similarly high-quality brand. To the horror of my colleagues I’m sure, I buy olive oil like a complete moron, randomly selecting a different bottle every single time I go to the grocery store, because I have a terrible memory, but I know that the one I got last time wasn’t that great. I would love to be the kind of person who remembers which kind of coconut oil is the one that doesn’t taste like suntan lotion (the refined one?) and which jar is the “good tahini,” but I know, deep down, that’s not me.The fact of the matter is this 8.5-ounce box simply isn't enough.\nPhoto by James MollisonI don’t have the wherewithal to fetishize every ingredient in my pantry. All I have to hold on to is Maldon, which I dispense every so often from my enormous bucket into a pretty little dish that lives next to my stovetop, alongside my stash of Diamond Crystal kosher salt (but that’s another post). I know what Maldon feels like in my hand and how much to reach for to achieve my ideal state of saltiness. I know how hard to press it to crumble it between my fingers. I know how it will disperse itself over a platter of carrots or a caramel-pecan tart. I am not making any claims that Maldon is the best flaky salt in existence, but I am going to argue that if there’s one ingredient worth committing to, it’s the one you put on 99.9 percent of the things you cook: salt. And Maldon happens to be the brand at whose tabernacle I genuflect, and by tabernacle, yes, I mean bucket.Also, I’m addicted to its texture. I figured this out recently, when I was eating some mandoline’d potatoes that had crisped to a gorgeous golden-brown beneath a roasting chicken. (Thank you, Chris Morocco.) When I asked my husband if he thought the dish needed salt, he looked at me as if I were crazy. The potatoes had acted as sponges for god-knows-how-much salt runoff from that bird. It was then that I realized: What I was craving wasn’t salt; it was flaky salt. For certain dishes, it’s not enough to have salt enhancing the flavor of the food. I need to taste the occasional pop of pure salt. I need the satisfaction that comes from that ever-so-fragile crunch, like the sound that impossibly thin glassware makes when clinked. Without flaky salt, my food is incomplete.So while I could tell you that I buy Maldon by the bucket because it’s economical, or because the salt stays fresher in a sealed bucket than in a box I’ll never fully close, the real reason I do so is because I am an addict, and nothing scares me more than shaking that crinkly little bag inside the Maldon box and realizing—shit—I’m out.Buy It: Maldon Sea Salt 3.3-lb Bucket, $29 on AmazonThen put those flakes to work:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingBA RecommendsSea SaltRead MorecultureThe History of Maldon Salt, the Stuff You Already Put on EverythingBy Nick Paumgartenrecipes20 Salted Desserts That Make Us Want to Break Out the MaldonGallery20 SlidesBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-28", "author": ["Condé Nast", "Julia Kramer"]}