{"id": "26cb2e4aed20de864ea898ce89d7653a", "url": "https://www.bonappetit.com/recipe/coconut-peanut-mochi-balls", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Coconut-Peanut Mochi Balls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCoconut-Peanut Mochi BallsBy Kristina ChoNovember 23, 20213.8(26)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrint“I could eat these snowball-like confections by the handful,” writes author Kristina Cho in her new cookbook, Mooncakes and Milk Bread. Cho likens these crave-inducing coconut-peanut mochi balls to sweet dumplings, stuffed to the brim with crunchy roasted peanuts mixed with creamy peanut butter, honey, and a generous pinch of salt. “It’s the satisfying amalgamation of chewy and crunchy that makes the treats so popular,” she writes. Coconut milk keeps the mochi skins soft for days, while the rich peanutty filling bounces between sweet and salty.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonSilicone Baking Mat$21 $14 At AmazonSmall #70 Cookie Scoop$15 At AmazonSilicone Spatula$13 At BA MarketFrench Rolling Pin$17 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxIngredientsMakes 20Mochi113.5-oz. can unsweetened coconut milk1½cups (225 g) glutinous rice flour1cup (200 g) sugarCornstarch (for dusting)Filling and assembly1½cups (180 g) unsalted roasted peanuts⅓cup (90 g) creamy peanut butter3Tbsp. honey1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¾cup unsweetened shredded coconutSpecial EquipmentA silicone baking matPreparationMochiStep 1Whisk together coconut milk, rice flour, and sugar in a medium nonstick saucepan. Cook over medium heat, stirring constantly with a heatproof rubber spatula, until a thick, smooth, slightly sticky dough forms, 5–7 minutes (the dough will pull away from sides of pan).Step 2Generously dust silicone baking mat with cornstarch. Transfer hot mochi to mat and generously dust top with more cornstarch. Roll out mochi to a 15x12\" rectangle. Let cool.Filling and assemblyStep 3Pulse peanuts, peanut butter, honey, and salt in a food processor until mixture resembles very chunky peanut butter. Transfer filling to a small bowl. Place shredded coconut in a shallow bowl.Step 4Cut mochi into twenty 3\" squares. Using a #60 or #70 cookie scoop (about 1 Tbsp.), divide filling among mochi squares (save any remaining filling for toast or smoothies). Stretch mochi around filling to encase, then pinch together to seal; roll between your palms into smooth balls. Working one at a time, roll balls in coconut (if coconut doesn’t stick, brush or spritz mochi lightly with water, then reroll).Do ahead: Mochi balls can be made 5 days ahead. Store airtight at room temperature.Taken from ‘Mooncakes and Milk Bread’ by Kristina Cho. Copyright 2021 by Kristina Cho. Used by permission of Harper Horizon, an imprint of HarperCollins Focus LLC.\n\nBuy it on Amazon.com or Bookshop.orgHow would you rate Coconut-Peanut Mochi Balls?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleyum. Easy to make for first-timers. AnonymousMinneapolis, MN1/23/2022As a home baker who knows how to bake and make, I tried this recipe and it's a big mess. Even after complete cooling of the dough, it is still a mess and won't gather as a ball to fold the nuts. Won't try it againninacalifornia1/13/2022My son, d-i-l and I made these on NY day and had the *most* fun following instructions and covering everything with cornstarch.  :-D The recipe was easy to follow. It really is a dough that forms in the pot - trust the recipe. I should have handled the dough and made a ball to roll out rather than pouring it onto the mat (a bit too generously cornstarched), but we managed. I recommend having cupcake papers ready to put the finished mochi into once they're rolled in the coconut, too. Easy to handle, easy to pick up, and it keeps the coconut from going everywhere. Having that little spritz bottle was a lifesaver for smoothing out the dough when rounding the balls. I think these were even better the next day. Utterly delicious and destined to become a family tradition on New Year's Day.Ruth M.Louisville, KY1/9/2022After reading through the reviews, I made some liberal adjustments :\nI reduced the amount of coconut milk by half, relacing the rest with water. Reason being was I didn't want it to be overly rich. The result was a delightfully light coconut flavor which came thru and paired perfectly with the peanut filling. Not cloying at all.\n\nI also reduced the amount of sugar in the dough drastically to only 1/3 cup. I found the sweetness level to be perfect.\n\nThe dough was very sticky though, even after sprinkling excessively with cornstarch. I found that after leaving it for a few hours, it got considerably more manageable, although by that time my kids had already eaten half the dough as if it were ice cream: scooping it with a spoon and placing a dollop of peanut topping on top! Haha!NafeesahMissouri1/5/2022I would say that this recipe is just okay. I didn’t have a problem with it being messy. If you cook the mochi dough for long enough that it forms a ball in the pot and no longer sticks to your spatula, then it’s fine. I would recommend reducing the sugar in the dough by half though - that’s what I did and it was still quite sweet. I followed everything else pretty exactly and only ended up with 14 mochi, which was fine because they’re so rich you can’t eat too much of it. AnonymousPennsylvania 12/21/2021Not a keeper. The texture of the mochi was soft and squishy. The white blobs after rolling in the coconut were unattractive. I added red and green sprinkles to the coconut which helped.   Frankly a gloppy mess and I really wanted them to be wonderful bc my granddaughter loves mochi.  Bikingbaker Torrington, CT12/16/2021Delicious! I subbed in candied walnuts for the peanuts, and left off the coconut on the outside. I love baked mochi, so I threw these in a 410 oven for 15 minutes and they were FABULOUS.LiisaPasadena, CA12/15/2021I was intrigued by this recipe and the dough was very easy to make and roll out.  However, once cooled, it was a rather sticky mess to work with, although with corn starch coats hands, it was manageable.  Taste was interesting (I love peanut butter), but not sure it will make the cut for my holiday repertoire next year…KD12/14/2021Explore Bon AppétitDessertCoconutFruitCoconut MilkOther IngredientsGlutinous Rice FlourFlourPeanut ButterCondiments, Sauces & PastesChineseEast AsianAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kristina Cho"]}