{"id": "26d90095042604fab1682ca7a3236db3", "url": "https://www.bonappetit.com/story/zainab-salbi", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "After Illness Derailed Her Activism, Zainab Salbi Is Doing More Than Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAfter Illness Derailed Her Activism, Zainab Salbi Is Doing More Than EverThe humanitarian, author, and podcast host fights burnout with meditation, yoga, and lots of za’atar. By Kate DwyerOctober 12, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailTwo years ago, Iraqi American humanitarian, author, and journalist Zainab Salbi collapsed en route to deliver a talk to young philanthropists. She was rushed into emergency surgery and spent the next few days in the ICU with a mystery illness. When she awoke from anesthesia, she was having trouble breathing and believed she would die. In her hospital bed she was surprised to discover that she was not asking herself whether she had accomplished enough in her life, but whether she “lived in kindness” to herself and others. Eventually her illness was diagnosed as either an “unknown viral infection” or Lyme disease, she says, “depending on the doctor.” Over the next 18 months of recovery, with both her physical and cognitive abilities impaired, Salbi spent several hours every day meditating, “because I couldn’t think, I couldn’t write,” she says. This period of intensive reflection brought forth an existential crisis. “If I can’t [be] the activist or the writer or the journalist or whatever, then who am I?” she wondered.In 1993, at the age of 23, Salbi had founded the nonprofit Women for Women International, where she spent almost two decades fighting for women’s rights and setting up food sufficiency centers in war zones, “managing what grew to 700 staff members,” and raising awareness about the plight of women in war. After stepping down as the organization’s CEO in 2011 due to burnout, she produced documentary shows, including #MeToo, Now What? on PBS, The Zainab Salbi Project on HuffPost, and Through Her Eyes at Yahoo News. “I would crash every three or four months because I would work myself to death,” she says. Each time she would recover at a wellness retreat, like the Omega Institute. Once she bounced back, she’d dive headfirst into her work again. “I wasn’t anchored in myself. I would just charge,” she says, raising a clenched fist like Joan of Arc, “but then would be left depleted.”But a year ago, and 12 months into her recovery, she moved to a cabin in Dutchess County, New York, adopted a cat, started tending to a vegetable garden, and switched to a plant-based diet. “To be very honest, I thought I had retired [from humanitarian work],” she says. But after springing into action last month to help evacuate Afghan women leaders whose lives were threatened, she believes her profound lifestyle change has allowed her to become more effective as an activist.Almost everything has changed in her new life. “I am vigilant about meditation and yoga. I don’t call it meditation; I call it an ‘appointment with my heart,’” she says. “With yoga, I call it an appointment with my body. It’s so easy to skip them, but if I call them appointments, I have to [show up].”While experiencing chronic pain during her recovery, an alternative doctor instructed Salbi to switch to a plant-based diet. Within a week, she says, her pain disappeared and she became “so grateful to earth.” During the summer months Salbi grows lettuce, peppers, and a variety of herbs in her upstate garden. The weekend before we spoke via Zoom, her family visited from Washington, D.C., and she made plant-based versions of her favorite Middle Eastern recipes. “I use a lot of old recipes from my mom, but I take the meat away,” she says. One dish, a stew called sabzi, requires lots of greens, like spinach, parsley, and cilantro. “Any greens, you chop, chop, chop, chop, chop,” she says, pantomiming the motion. She then adds onions, tomatoes, and “an old, dried lemon” to vegetable broth, which becomes an “absolutely delicious” green stew.Of all the flavors she grew up with, Salbi’s most obsessed with za’atar, using it in salads or to make homemade pita chips. “I mix za’atar with olive oil to make it into a paste,” she says, before spreading it atop pita and baking until crisp. “I go to Paterson, New Jersey, where there’s a [Middle Eastern neighborhood], and I buy there,” she says. “But every time anybody comes from the Middle East, I beg them for za’atar. My brother was just visiting and he brought me a whole bag of fresh za’atar that was just so profoundly delicious.”On September 29, Salbi launched a podcast called Redefined in partnership with a start-up called FindCenter, where she is now the Chief Awareness Officer. The podcast focuses on thinking about alternative definitions of success, much like Salbi did while she was in the hospital. Early guests included CNN anchor Don Lemon, musician Annie Lennox, and Zen priest Rev. angel Kyodo williams. “It’s much more about how to deal with these moments of the unknown,” Salbi says. “How to deal with your anxiety or your anger, all the issues that we all go through but rarely talk about in public.” Aside from producing Salbi’s podcast, FindCenter—“a digital platform for self-discovery and personal development,” she explains—hosts one of the world’s largest curated catalog of spirituality content, covering books, articles, podcasts, and videos.When her focus shifted to wellness and “this Zen lifestyle,” Salbi believed her activist days were over. “I was like, ‘Oh my god, I lost it.’ Like, I no longer have the activist in me, you know?” Then, on August 13—a week after five provincial capitals in Afghanistan fell to the Taliban, which was closing in on the capital city of Kabul—she got a call from a friend in the human rights community who said, “There’s a list of women who are high-profile leaders in Afghanistan whose lives are at risk and there’s no evacuation plans for them.” Instincts from her former life kicked in reflexively. She called everyone she knew who might be able to make a difference. Some contacts gave money, while some personally “took on the task of the evacuation,” and others spread the word and made important introductions to even more people who could help. “I was like, ‘My sisters are in danger!’” she says of the women, many of whom she knew and had worked with previously through Women for Women International.“[It seemed like] there was no U.S. government plan to truly evacuate [Afghan citizens], or to prioritize the evacuation of women,” she says, tearing up. Salbi contributed to an unofficial coalition of women leaders and women’s organizations that became “a most beautiful and sad movement of sisterhood,” she says. Together, the coalition raised funds and arranged for 500 evacuations and resettlements, and the work is still ongoing, Salbi says. Though she participated as an individual, the coalition is now led by “various groups, including Vital Voices,” the nonprofit founded by Hillary Clinton, Madeleine Albright, and Melanne Verveer.“It became a 24/7 operation where, literally, I slept with my phone next to my head and got calls hourly,” she says. “It is still going on. I mean it’s not talked about [anymore]. I don’t know if the media is even talking about it.” There are still thousands of people who are in Afghanistan, terrified for their lives, she says. “I feel we cannot forget them and we shouldn’t forget them. We have to keep the torch going. But for me, what I realized in the process is that, Wow, yes, the cause does not require [complete] self-sacrifice [to still be effective].”During the past several weeks of advocating for Afghan refugees, she has found that taking a few hours for herself every day has given her more energy. “What helps me stay anchored is not feeling guilty about sleeping, allowing myself to sleep, allowing myself the meditation, allowing myself the healthy food,” she says. As a result, “the last few weeks have not depleted me.” In other words, she’s not expecting to crash and retreat. Now, she says, “I know what it would take to go through this marathon and get the job done. But I also know how not to get lost in the process.”Explore Bon AppétitCultureRead Moreculture‘Kid of the Internet’ Quinta Brunson Wants Us to Keep Growing (and Growing and Growing)By Leigh-Ann JacksoncultureFor Ceramist Stephanie Shih, There’s No Such Thing as Art Without ActivismBy Leah BhabhacultureHow Paralympian Kaleo Kanahele Maclay Gets Through Training, Motherhood, and Running a Coffee ShopBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-12", "author": ["Condé Nast", "Kate Dwyer"]}