{"id": "26e68a0e3a6f097fae63f3d0954004e1", "url": "https://www.bonappetit.com/story/tofu-feta", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Tofu Feta is A Simple Dairy-Free Stand-In For Feta, And You Can Make It With 3 Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Was Skeptical, but Tofu-Feta Is Actually a Good Stand-In for Feta-FetaAnd you can call it tofeta.By Irina GroushevaiaFebruary 24, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes and drinks we make with our eyes closed. Today, tofu feta.As a Russian I am constantly brining, pickling, or fermenting something. At my family’s dacha on the outskirts of Moscow, much of our summer abundance from the garden is canned, pickled, frozen, or somehow preserved for the long winter ahead. But even in my current home in Queens, I have a whole section of the fridge dedicated to jars and containers where water, salt, and vinegar are working their magic on cabbage, green tomatoes, and even tofu. While tofu is not a traditional Russian ingredient, when it's brined it actually makes an excellent dairy-free stand-in for feta.As I began reducing dairy and animal protein in my diet for multiple reasons, I had trouble finding a store-bought replacement for brined cheeses like feta. The manufactured options were just not cutting it texture- and taste-wise. “Why is it so sweet?” I often asked myself when going through different brands. That was before I realized I could get that crumbly, salty, tangy flavor by brining extra-firm tofu. Tofu acts like a sponge, and after it sops up a simple three-ingredient brine made from pantry staples, it delivers an almost identical flavor to traditional fetas.Here’s how to make tofu feta:Drain and press 1 block firm or extra-firm tofu to get rid of excess water. Get out a clean jar or container with a lid (I like using 16-oz. wide-mouth mason jars). Tear 1\"–2\" chunks of the tofu and nestle them into the jar. Dissolve 1 Tbsp. kosher salt by whisking it with ⅓ cup white vinegar and ½ cup hot water. Slowly pour it into the jar, then seal, date, and shake it. Once the jar cools off, send it into the fridge overnight.The tofu feta will keep in the fridge for up to four weeks, if you don’t eat it all first. One of my favorite ways to serve it is to marinate the chunks with olive oil, lemon zest and juice, oregano, and thyme on the countertop for about 15 minutes. Adorn with Halkidiki and Castelvetrano olives and enjoy on its own or with some toasted pita—don’t forget to mop up the marinade at the bottom of the bowl! You can also crumble it into your salads and wraps or make it the main star of a plant-forward sandwich. Or blitz it in a high-speed blender with some of the brine, olive oil, and herbs to make a creamy dip or spread.A delight for vegans and a surprise for omnivores, tofu feta (or tofeta, as I call it) will be a welcome addition to your easy pickling projects. In the meantime I’ll be searching for my own jar among the crowded landscape of sauerkraut and pickled green tomatoes, then shamelessly eating it in the glow of the fridge.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-24", "author": ["Condé Nast", "Irina Groushevaia"]}