{"id": "26f545cd8c383b5dcf5cb04670207936", "url": "https://www.bonappetit.com/recipe/cocoa-coffee-almond-cookies", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Cocoa-Coffee Almond Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCocoa-Coffee Almond CookiesBy Angie Rito and  Scott TacinelliNovember 23, 20213.7(42)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThese cocoa-coffee almond cookies from Italian American, a new book by Angie Rito and Scott Tacinelli, chef-owners of NYC’s Don Angie, crack dramatically as they bake to reveal a deeply fudgy interior. Almond paste makes the cookies extra chewy and coffee adds, as the cookbook notes, “a savory note that complements the chocolate and nut flavors.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonAteco Bowl Scraper$3 At Amazon#30 Cookie Scoop$11 At AmazonSilicone Spatula$13 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes about 126½oz. almond paste (about ¾ cup)1cup (200 g) granulated sugar⅓cup (30 g) unsweetened Dutch-process cocoa powder2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. instant espresso powder2large egg whites⅔cup (84 g) all-purpose flour¾cup (83 g) powdered sugar, siftedPreparationStep 1Pulse almond paste in a food processor until broken up into small pieces. Add granulated sugar, cocoa powder, salt, and espresso powder and pulse, scraping down sides of bowl as needed, until mixture is well combined and mostly powdery with a few small clumps. Add egg whites and process until smooth, about 1 minute. Pulse in flour until just combined.Step 2Transfer dough to a medium bowl; fold in any dry spots with a rubber spatula if needed. Cover and chill at least 1 hour.Step 3Place racks in upper and lower thirds of oven; preheat to 350°. Put powdered sugar in a shallow bowl. Using a #30 cookie scoop (about 2 Tbsp.) and working one at a time, scoop out portions of dough and roll into balls (you should have about 12). Working quickly, roll balls in powdered sugar to coat. Divide between 2 parchment-lined baking sheets, spacing about 3\" apart.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway through, just until puffed and cracked and edges are set (cookies will look slightly underbaked between the cracks), 12–14 minutes. Let cool on baking sheets.Do ahead: Dough can be made 3 days ahead; cover and chill. Cookies can be made 4 days ahead; store airtight at room temperature.\"Reprinted with permission from ‘Italian American’ by Angie Rito and Scott Tacinelli. Copyright 2021. Photographs by Christopher Testani. Published by Clarkson Potter, an imprint of Penguin Random House.\"\n\nBuy now on Amazon or Bookshop.orgHow would you rate Cocoa-Coffee Almond Cookies?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleI'm about to make this recipe for the third time. I agree with the recent comment from Chicago: read the recipe, follow the recipe and you'll have an amazing cookie. My sea salt is fine and dense so I use the lesser amount. VirginiaSWFL3/14/2022These cookies are incredible.  I followed the recipe exactly which means using 1.25 teaspoons of kosher salt (not 2 teaspoons, and specifically kosher style), 200g of sugar, and 6.5 oz of almond paste (not marzipan which contains more sugar than almond paste).  If you follow all these directions, they are very well-balanced, not too sweet and not too salty.  I believe some other reviewers were using the incorrect amount of salt and hence too salty.  Also, the reviewer that said that you don't need salt if the recipe is sweet, that is actually incorrect.  Salt is needed in all sweet baked goods to balance the flavor.  It does not make them salty.  Perhaps that's why your cookies tasted too sweet if you left the salt out because that would actually be a consequence of not balancing the sugar with salt...a cloying sweetness.  \nTry as intended and as written...they are delicious!AnonymousChicago3/1/2022Great recipe! VERY good cookies!MaliaKailua-Kona, HI2/3/2022Halved the salt per other reviews, and these turned out soooo good! Will definitely make again. AnonymousColumbus, Ohio 1/22/2022forget the salt - you don’t need it in something that is meant to be “sweet”\nAlso do use less sugar too…\nso many desserts are ruined by huge amounts of sugar. Why?\nit is the same with jams, ice creams, etc…\ndessert loverCanada1/13/2022Y’all gotta use the Morton’s amount of salt if that’s what you have. It’s what I use, and I know 2 tsp would have been too much. They ARE salty, but they’re also coated in sugar and DENSE. The salt really helps cut it. I’d recommend trying it as written before you riff. (Used homemade almond paste for these in a pinch and it absolutely worked! Better than spending $8 on a tiny tube. Found a recipe on Food52.)AnonymousSouth Carolina12/31/2021Halved both salt and sugar and were still very sweet! Where we're from almond paste/marzipan is plenty sweet on its own so next time will add quarter the original sugar. Unsure what the almond paste in the recipe is like and they are perfect in every other way so still highly recommended. Delicious with some tea. Anonymousaustralia 12/25/2021After reading the reviews, I omitted the salt completely and thought they were delicious- super rich, and a nice complement to the variety we normally serve at Christmas. And so pretty!EmChicago, IL12/24/2021WAY TOO MUCH SALT.  I like others questioned the amount, and did lower a bit, but inedible due to salt.  Didn't even bother to bake them.  I should have read the reviews first.  I am going to make another batch with less 1/2 - 3/4 tsp salt and see how they are.  \nAnonymouscalifornia12/24/2021Way too much salt. I don't know why I trusted this recipe, Don't use more than 1 tsp.Anonymous12/22/2021Love these! They’re very rich and almond-y and can only eat a couple at a time but they’re so goodAnonymous12/20/2021I only added 1/4 tsp of salt and like the result. Love the chewy inside and nice balance of chocolate, almond and coffee. Anonymous12/20/2021Sadly this was awful. Salty!  Wasted a lot of ingredients. Almond paste wasn’t cheap too. Should be only 1/2 tsp of salt.   I knew the quantities sounded off, but should always try recipe exactly the first time. AnonymousNJ12/20/2021Way too salty. Inedible. Probably would have been good with less than half the salt. Nice texture. JTDurham, NC12/19/2021So salty my husband thought it was a joke.  Too many other yummy recipes with almond paste to make these again.JTOak Point, TX12/18/2021Explore Bon AppétitCookieDessertCocoaOther IngredientsAlmondNutCoffeeAlcohol & Other DrinksBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Angie Rito", "Scott Tacinelli"]}