{"id": "26fa113fe871cf9bfeb9cf8b72181092", "url": "https://www.bonappetit.com/story/foods-most-important-year-ever", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "1971 Was Food's Most Important Year—Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFood’s Most Important Year—EverThis month brought holiday menus for Passover and Holi, comforting recipes for a year in quarantine, a look back at 1971, and so much more.By Dawn DavisMarch 25, 2021FacebookTwitterEmailFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what's on her mind by taking over our newsletter. You’ll find recipes she's cooking, stories she's loving, where she's been eating, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I can't recall exactly what got me interested in the year 1971. It might have started with a sliver: Half a century is, after all, a natural inflection point. What I do know is that the discoveries that the razor-sharp Bon Appétit team and I made about the year provoked a lot of discussion and engendered the question, “Is 1971 the year that changed everything culinarily?”If you’ve seen the terrific documentary The Black Godfather, you’ll remember a graphic that shows the endless sway of music executive Clarence Avant. He influenced multiple generations of artists, who then went on to influence subsequent generations. The reporting of Elyse Inamine likewise shows the enormous reach of Alice Waters, who opened her trailblazing restaurant, Chez Panisse, in 1971. When I wrote my book about chefs, If You Can Stand the Heat, some years ago, I remember chef after chef citing Waters’s impact, particularly the way she gave them the okay to look in their backyard rather than toward Europe for inspiration. Another woman I met in conjunction with that book, Edna Lewis, was making moves that year as well, finishing The Edna Lewis Cookbook, the first title in what would become an illustrious catalog.A very 2021-meets-1971 Beef Wellington from Test Kitchen director Chris Morocco.\nPhotograph by Alex Lau, food styling by Victoria Granof, prop styling by Sophie StrangioIt’s also the year that launched corporations that started out small and are now giants with outsize influence over everything from what we drink (Starbucks) to how we chop (Cuisinart). It saw the rise of the salad bar, which I didn’t realize was a funny invention until I read Samantha Irby’s hilarious take on it, and the publication of a landmark book seeking solutions to problems that still haunt us today, Diet for a Small Planet. If you read Jonathan Kauffman's reflection on the book's anniversary, I think you’ll be surprised by what you learn.Shifts in culinary culture don’t happen in a vacuum. Much has been written about the politics of the ’70s, but I was particularly struck by the explosion of cultural content. My favorite discovery was that Soul Train—created, produced, and hosted by Don Cornelius—debuted in 1971 as well, forever changing how exuberance is expressed through dance.Speaking of exuberance, we’ve been through a lot these past 12 months: a lot of emotions and a lot of dirty dishes, for starters. We need comfort and joy. For comfort, we have an assortment of easy yet abundantly flavorful dishes you’ll want to make again and again. Andy Baraghani’s beef stir-fry with celery is as delicious as it is fragrant; the spicy shrimp pilaf left me wanting seconds. For joy, we’ve got recipes to provide some impressive moments for your holiday table, from Chris Morocco’s contemporary take on beef Wellington (hello, 1971!) to a modern collection of Passover dishes, as well as a vibrant feature on Holi, a springtime Hindu celebration of new beginnings with lots of color.Finally, in preparation for spring, I asked Radhi Devlukia-Shetty, an Ayurvedic practitioner, to share with us the link between food and cleansing our body, which is apt not only because a new season is around the corner but also because after a difficult year, we could all use a refresh right now.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-25", "author": ["Condé Nast", "Dawn Davis"]}