{"id": "26fc9a3f9ac5aaf16aa1a196f3faa34e", "url": "https://www.bonappetit.com/story/im-down-with-cubed-squash", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Pre-Packaged Butternut Squash is the Only Pre-Packaged Produce Worth Buying | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Never Buy Packaged Produce Unless It’s Butternut SquashIt's called giving myself a break.By Andrew SpenaOctober 7, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailLet me say this up front: I am fully in support of prepped, plastic-wrapped vegetables when they break down barriers to cooking: They can be game-changers for people with mobility issues or who would otherwise not cook because they’re too busy. I’m in favor of anything that encourages more people to cook at home, and the produce that people put in their own shopping carts is none of my business and none of my concern.Personally, I can’t justify buying produce that’s been robbed of its natural wrapper, exposed to air, and rewrapped in plastic. Yes, I am specifically talking about summer corn that’s had its ends trimmed and a peekaboo window of the husk peeled off. (Sure, you’ve saved some time but at what cost?) But I am also speaking more generally of the farm-to-plastic-wrapper-to-table pipeline. I find that pre-prepped produce isn’t as tasty—you can’t un-oxidize something once it’s exposed to air. And all that unnecessary packaging! Plus, it’s more expensive. It’s just not for me. Unless we’re talking about butternut squash.Sure I can break down a butternut squash the safe way. But also…why? Prepping a butternut squash is only satisfying in that doing so without losing an appendage feels like a win. And since I’m invariably going to be roasting the squash anyway, the time it spends naked and cubed in plastic doesn’t matter to me. Plus, there are so many great butternut squash recipes that become really easy butternut squash recipes when the prep is done for you.Now and then, sure—I’ll take the long route. I’ll roll the dice, use a very sharp knife, and peel and cube the squash myself. But most of the time? It’s Tuesday, I’m tired, I’ve had a hard day, and I’m just trying to make soup ASAP. When I see someone at the store with the cubed butternut squash in their cart, I know they’re probably feeling the same way, and I give them a knowing nod of solidarity.And with that squash:Vegan Butternut Squash SoupIf you've always thought you needed hours to make a luxuriously silky puréed vegetable soup, well, this recipe is here to say you don't! View RecipeExplore Bon AppétitSquashRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-07", "author": ["Condé Nast", "Andrew Spena"]}