{"id": "26fdba018e6272f807ed44799971bc9b", "url": "https://www.bonappetit.com/story/broccoli-garlic-ricotta-toasts", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Broccoli Ricotta Toast Is Fall’s Official Stuff-on-Toast Moment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAnnouncing This Season’s Stuff on Toast: Broccoli and Garlic RicottaMove over, tomatoes. There’s a new kid in town.By Sarah JampelSeptember 26, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailThe “stuff on toast” trend—which is still happening, may it live forever—is basically about piling one delicious thing on top of another. Oh, and bread. Maximalism may not have a place in every category of food (I could live without turducken, glazed donut breakfast sandwiches, and cherpumple, but when it comes to toast (and also pasta), no tasty topper shall be turned away.This summer, we declared one recipe THE tomato toast of the season. Well, the season’s changing, and so is our go-to toast. These Broccoli and Garlic-Ricotta Toasts with Hot Honey are a scene-stealer: Every single part of this 30-minute recipe—starting from the oil-slicked bread and moving to the roasted garlic mixed into ricotta, charred broccoli, and spicy honey thinned with vinegar—sounds delicious. So how could it not be good? (No bizarre plot twist here: It is very good!)You walk the walk, but do you brocc the brocc?The hardest part will be getting to the moment where you build the, ahem, tartines: Not because any step is difficult (toast, roast, stir—it’s a cinch!) but because it takes a great amount of willpower to not eat every component as it’s ready. You’ll have a bread snack as you wait for the oven to heat; you’ll grab a floret or five of singed broccoli as soon as it comes out of the oven; you’ll steal a swipe of ricotta with your finger before you smear it on the toast.But try to persevere. Because as tempting as each part is on its own, it’s begrudgingly true what Jack Johnson says: the salty broccoli, mild and milky ricotta, and zingy hot honey are better together. And bread is the logical vessel.Multiply this by 10 and you have a full meal.\nPhoto by Alex Lau, Food Styling by Sue LiThe recipe has you make snack-sized portions, the sort of elegant appetizers you might serve at a dinner party on the weekend, when 10 p.m. bedtimes do not apply, or—if you’re really an adult—to satiate you as you prepare the real meal. But I’m greedy! I cut fat, dinner-sized slices of sesame bread, then slathered them thick with the garlicky cheese and mounded the broccoli precariously high. Et voilà: What was once an hors d’oeuvre is now a legitimate meal.Most mind-bogglingly of all, this recipe included a FREE TIP that will change the way I roast garlic forever. Rather than roasting a whole head wrapped in an aluminum foil pouch, which can take nearly an hour, you roast individual cloves, still in their skins, on the same tray as the broccoli. When they’re cool enough to handle, squeeze them out like toothpaste (so, from the top of the tube, duh) for that earthy-sweet roasted garlic flavor in half the time.Will I roast garlic every time I roast vegetables now that I know this speed-demon secret? There’s nothing stopping me. Will I add said roasted garlic to a bowl of ricotta—or cream cheese, or hummus, or tomato sauce—now that I know how much it could use the upgrade? There’s nothing stopping me.And will I ever eat broccoli without roasting it to oblivion and plopping it on a bed of cheese? Just no.Enter the enchanted broccoli forest:Broccoli and Garlic-Ricotta Toasts with Hot HoneyCrispy roasted broccoli proves it works just as well as an appetizer as it does a side dish.View RecipeExplore Bon AppétitBroccoliWeeknightFamily MealsRead MoreRoasted and Charred Broccoli with PeanutsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Sarah Jampel"]}