{"id": "27000564f6191cf6743b25ea20f5ad51", "url": "https://www.bonappetit.com/story/snack-plate-strategy", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "A Snack Plate Is the Low-Key Dinner Strategy We Need Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusSnack Plates Are the Low-Key Dinner Strategy We Need Right NowWhen the only thing to do is graze.By Aliza AbarbanelApril 24, 2020FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailSome nights, we immerse ourselves in simmering vats of marinara sauce and rolling out scallion pancakes. But when we’re sick of doing dishes and standing over the stove, we assemble a snack plate.Despite the name, a snack plate is perfectly acceptable to eat for lunch or dinner. Call it aperitivi, mezze, crudités, or adult Lunchables—we love it all. Making a good snack plate is less about cooking and more about curating, and despite what the maximalist charcuterie boards taking over Instagram might have you believe, you don’t need a fridge full of dips or a hidden cache of sourdough. Start with whatever stray produce is hanging out in the crisper, grab a few favored sauces or condiments, and go where your pantry leads you. But first, may we suggest a few upgrades?You don’t actually need a platterOkay, we won’t deny that piling everything onto a glossy ceramic platter makes everything feel pulled together. But a spare cutting board or sheet pan works just as well. Can you eat out of 11 tiny prep bowls? Yes, yes you can.Would eat a bowl of cashew nam prik for dinner.\nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaThrow together a quick dipStir together a quick chile butter, blend up an herby chutney, or mix strained yogurt with grated crunchy produce like radishes, carrots, turnips, or apples. When in doubt, spike anything creamy with a pinch of salt and a jolt of lemon juice.Or upgrade a store-bought oneAssistant food editor Sohla El-Waylly, a proud mezze-for-dinner devotee, prefers to zhuzh up prepackaged dips instead of starting from scratch. “I’ll finish hummus with a quick chhaunk made from cumin, coriander, pepper, and lemon zest, or top baba ganoush with frizzled curry leaves, mustard seeds, and cumin,” she says.Marinate a can’s contents“Anything you crack open from a can or jar should get doused in good olive oil and flaky salt immediately,” says senior food editor Molly Baz. That means artichoke hearts, sardines, cannellini beans, and olives. Add other ingredients if you like—fruity vinegar or citrus juice, crushed garlic, smoked paprika or chile flakes, whatever fresh herbs you might have around—and allow the flavors to meld while you assemble the rest of the platter.Want to really take your snack plate to new heights? Make some pimento cheese crackers.\nPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiDress your raw vegetablesSlice crunchy vegetables like Persian cucumbers, jicama, radishes, and carrots into finger-friendly spears, then toss them with plenty of citrus juice and a hint of salt. Finish with a few sprinkles of sumac, Tajin, or Aleppo-style pepper.Pick a proteinBring on the deli meats (salami! prosciutto! mortadella!) and tinned fish (anchovies! octopus! mussels escabeche!), and don’t be afraid to mix and match. Test kitchen manager Gaby Melian loves to channel Argentinian picadas by pairing cold cuts with jarred piquillo peppers and, when she has it, leftover cold milanesa.Add a starchThick-cut bread is perhaps the obvious choice, but any carb will do. BA staffers are especially fond of stocking their snack plates with parathas, roti, and warmed tortillas. But if you prefer a crunch, we won’t stop you from adding a few seedy crackers or Triscuits, too.Think of this chutney as a green smoothie in dip form.\nMake room for something sweetBalance out the inevitable saltiness of all that meat and cheese with dates, apple slices, berries, or dried apricots. If your fruit supply is low, add a dollop of jam or a drizzle of honey to smear atop cheese.Don’t forget the napkins!Share plates, cutlery, and cute little toothpicks are optional. A spare dish towel (or two) is essential. Your table, and your fingers, will thank you.Explore Bon AppétitSnackWeeknightRead MorecookingThe Fastest, Freshest Way to Transform a Can of BeansBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Aliza Abarbanel"]}