{"id": "2720a2b87b7f8bde46248594227eb598", "url": "https://www.bonappetit.com/story/gourmet-reeses-peanut-butter-cups", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Claire Is Making Gourmet Reese’s Peanut Butter Cups From Home So You Can Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Is Making Gourmet Reese’s Peanut Butter Cups From Home So You Can TooWe got the recipe right here.By The Bon Appétit StaffMay 21, 2020FacebookTwitterEmailPhoto by Claire SaffitzFacebookTwitterEmailFirst it was Gourmet Pop Tarts. Then it was Gourmet Hot Pockets. And now...it’s Gourmet Reese’s Peanut Butter Cups! For the third time in filming the quarantined version of her hit YouTube series Gourmet Makes, Claire Saffitz is re-making her version of the classic chocolate peanut butter snack—this time, using whatever tools and ingredients she’s got at home (yup, that means no well-equipped BA Test Kitchen at her disposal). We’re posting the recipe here so you can give her more “grownup” version a go, and if you’re into it, share your experiences with us, and everyone else who watches the show.For a chance to be featured in an upcoming episode, follow the recipe below and send a video with subject line \"My Reese’s Cups\" to gourmetmakes@gmail.com showcasing your final product, explaining how well they turned out, or any snags you hit along the way. Please keep videos to 60 seconds, shot in landscape with NO music, sent in mp4 or .mov form. Submissions accepted through May 25.Back when Claire was in the Test Kitchen…\nGourmet Reese’s Peanut Butter CupsThese are a grown-up version of beloved Reese’s peanut butter cups, and much less sweet than the original. If you prefer the sweetness of Reese’s, feel free to use milk chocolate instead of semisweet, just be sure to look up the appropriate temperatures for tempering whatever brand you’re using (temperatures vary according to chocolate type and brand, and can usually be found online). That said, if you feel like skipping tempering altogether, that’s perfectly fine too.Makes about 12Ingredients1 cup smooth natural peanut butter½ tsp. vanilla extractKosher salt½ cup sugar11 oz.  semisweet chocolate, finely chopped, dividedSpecial equipment: A candy thermometer, 12 baking cups, preferably dark brown, and a kitchen scaleInstructionsBeat peanut butter, vanilla, and salt in the bowl of a stand mixer fitted with the paddle attachment  on medium speed just until smooth. Stop mixer.Heat sugar and 3 Tbsp. water in a small saucepan over medium, stirring with a heatproof rubber spatula until sugar is dissolved and you have a clear syrup. Stop stirring as soon as mixture comes to a boil, then clip candy thermometer to the side of the pan and continue to cook, swirling pan occasionally and washing down sides with a wet pastry brush to dissolve any sugar crystals, until thermometer registers 248°. Immediately remove from heat.With mixer on medium-low, carefully and gradually  stream syrup down inside of bowl into peanut butter mixture, avoiding the paddle if possible to minimize sugar splatter. As soon as all of the syrup has been added, increase  speed to medium and beat just until mixture comes together in a single mass and pulls away from the sides of the bowl.Transfer filling  to a sheet of parchment paper (don’t scrape the sides of the bowl) and cover with another sheet of parchment paper. While still warm, roll out filling to create an even, ¼”-thick slab. Slide parchment onto a rimmed baking sheet and let sit at room temperature until set, about 1 hour.Uncover filling. Using a round cutter or an upside-down shot glass with a diameter slightly smaller than the base of baking cups, punch out as many rounds of filling as you can. Save  scraps for eating or discard. Cover rounds and chill  until you’re ready to assemble the peanut butter cups.Using scissors, trim baking cups to about ⅔” tall, then place in the cups of a standard 12-cup muffin pan.Pour water into a small saucepan to come 1” up the sides and bring to a bare simmer over medium heat. Remove from heat and place next to muffin pan.Place 5 oz. chocolate in a heatproof bowl and set over saucepan with water. Stir often until chocolate is melted and an instant-read thermometer registers 114°. Remove bowl from saucepan and add 3 oz. “seed” chocolate. Stir vigorously until most of the seed chocolate is melted and thermometer registers 82°. Place bowl back over saucepan and stir constantly until thermometer registers 90°. Chocolate should now be tempered and ready to use.Using 2 spoons and a kitchen scale, dollop 11 g chocolate into each baking cup, then tap pan on counter to spread out chocolate. Remove filling from refrigerator and, working one at a time, gently press each round into chocolate in baking cups so they are centered and chocolate comes up the sides and is level with surface of filling. Let sit at  room temperature until chocolate is set, 10–15 minutes.Add remaining 3 oz. chocolate to tempered chocolate and set over saucepan again (return saucepan to heat if needed); stir until melted.  Using a small offset spatula or spoon, spread about 1 tsp. chocolate over each peanut butter cup, making it  as even as possible and anchoring to the sides of the baking cups. Tap pan on counter, working quickly so chocolate hasn’t had time to set, to smooth out surfaces. Chill until chocolate is set, at least 10 minutes. Serve at room temperature.Do Ahead: Peanut butter cups can be made 1 week ahead. Store airtight at room temperature.Explore Bon AppétitGourmet MakesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "The Bon Appétit Staff"]}