{"id": "272ab9204aa0321508d7730b1d4222f7", "url": "https://www.bonappetit.com/story/poached-eggs-in-stock", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Make Poached Eggs in Chicken Stock—Just Trust Us | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Poached Eggs in Chicken Stock—Just Trust UsThanks for the tip, Seamus Mullen.By Seamus MullenJune 25, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Styling by Emily EisenFacebookTwitterEmailI’ve been drinking “stock” since long before the bone broth craze, and before I had any idea how healthy collagen-rich stock is for the gut. It was just a tasty and quick way to quell my appetite in the kitchen. But I never tried poached eggs in stock until I met a woman named Anonieta.It was 1994, and I was renting a room from her in Caceres, Spain. Anonieta made some of the most bizarre food, some of it amazing, some of it downright raunchy. There was one thing she made that I called the “leather jacket sandwich.” It was basically two halves of a baguette schmeared with a spreadable chorizo that she cured in her cupboard under the sink...right next to the ammonia, just to the left of the rubber gloves. And then there was the sesada, or brain puree, that she loved to serve her grandson. The smell of boiling calves brains didn’t really entice me. But there was one thing she did make, one incredibly delicious wintery treat that, to this day, I can smell in my mind’s nose. She called it “sopa de ajo”—simply “garlic soup”—and it was a rich chicken stock with ample garlic, dry bread, and an egg, poached perfectly in the liquid. Crack the egg and the yolk ran thick through the golden broth.Broth is something we often don’t consider using as an ingredient, but it brings so much to a dish. I will frequently make a meal that is completely vegetarian, save for a rich, deep-flavored broth that I cook the vegetables in. The broth adds a meaty complexity without making the dish too heavy. The addition of an egg turns it into a perfect, easy-down-the-hatch protein-rich meal before or after a long workout, and just the ticket if you feel a tickle of a cold coming on.This dish is my homage to Antonieta’s sopa de ajo. I’ve taken the liberty of adding some bitter greens in the form of radicchio and some morel mushrooms. Crack the egg and swirl your spoon, and the broth becomes a creamy backdrop to the snappy vegetables and the earthy morels. Swirling the eggs into the broth helps them poach perfectly, and while the flavors here are reminiscent of my young adult years in Spain, there’s also something about this that reminds of the austere soups I’ve had in Japan. This is one of those dishes for which simplicity belies its beauty and flavor. When I think back to Spain and to Anonieta, I’m reminded that, so often, the best dishes are just a combination of a few exemplary ingredients, handled with a delicate and deft hand.Get the recipePoached Eggs in Chicken Broth with Mixed VegetablesThis simple veg-forward broth (with #aneggonit) is the ideal cure for whatever ails you.View RecipeExplore Bon AppétitBrothEggHealthyishRead MorecookingThe Garlic Broth Recipe That Brought Me Back to HealthBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-25", "author": ["Condé Nast", "Seamus Mullen"]}