{"id": "272b78d62f83f951bceb3ad60cc6d59e", "url": "https://www.bonappetit.com/story/eggnog-can-be-good", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "The Best Eggnog Tastes Like Melted Ice Cream Mixed With Booze | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Eggnog Tastes Like Melted Ice Cream Mixed With BoozeAnd it definitely doesn't come from a carton. By Al CullitonDecember 13, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.Ever wonder when all of your relatives started bringing their signature dishes to holiday parties? Great Aunt Gloria’s green bean casserole didn’t just materialize out of thin air one year. At some point, it was year one for that casserole. She had to decide to make it a thing. And guess what? It’s time you start your own tradition: making the best eggnog anyone in your family has ever had. Like many old-school holiday dishes, eggnog has, in the minds of many, been relegated to the same undesirable category as fruitcake (which, by the way, is delicious when made properly). But this is just plain wrong! It tastes great, like melted ice cream, and is highly appropriate for wintry celebrations.But how did eggnog get to be a major holiday institution in the first place? I’m glad you asked. Drinks similar to eggnog were served in medieval England, but it wasn’t until centuries later that they picked up the name we call it now. Some of eggnog’s earliest iterations were posset—a milk-and-ale (or wine) drink made more enticing with the addition of honey, spices, or citrus—and flips and purls, both very old English drinks made with eggs to create a pleasing frothy texture along with spirits and/or ale. These beverages influenced what we now know as eggnog, which took on a whole other life when it became popular in the colonial United States.Your new tradition starts now, so get yourself to the store.Your Shopping ListYou'll need all of the ingredients for the base, and booze and spices depending on which of the three variations you choose.For all versions:EggsWhole milkHeavy creamSugarFor the classic:Brandy (Bertoux)Aged rum (Appleton 12)Rye whiskey (Wild Turkey)NutmegFor the old-fashioned:Oloroso sherry (Lustau or Colosia)Madeira (Henriques & Henriques)Whole nutmegAllspice (optional)For the cool-kid version:Mezcal (Vida or Sombra)Crème de cacao (Tempus Fugit is best)Cinnamon stickCocoa powder1. Make the BaseWe’re going to make an all-purpose eggnog base, and then you’ll have a choice of three fun variations. The inherently enjoyable character of eggnog can be weighed down if you’re not careful. I love this recipe from a few years back by BA’s own Amiel Stanek. This recipe adds fluffy egg whites just before serving, giving the whole thing an element of lightness. We also find it to be a fitting foundation for a variety of different spirits.Here’s how you make it: Separate 6 eggs into yolks and whites. Whisk yolks, 1 cup sugar (if you’re making our Mezcal eggnog, reduce sugar by ½ cup, we’ll explain later), and a pinch of salt in a large punch bowl until sugar is dissolved. Gradually whisk in 3 cups whole milk and 2 cups heavy cream. This is the part where you choose your booze—peek below. After that, we’ll let the eggnog meld and then wrap up with the final step. Hint: It involves those egg whites you set aside!2. Choose Your BoozeA Classic ‘NogBrandy and rum were staples of early American drinking. But as time went on, domestically-produced whiskey started to gain favor. So our “classic” recipe is a sort of snapshot of a couple hundred years back, with rye whiskey (which George Washington included in his own recipe), Cognac, and rum. Stir ½ cup aged rum, ½ cup Cognac, and ½ cup rye into your base, then cover and chill for at least two hours. After the last step, see step 3 below, garnish with freshly grated nutmeg.Super Old-FashionedPhoto by Laura MurrayI’m a big fan of fortified wines, and so were the Americans of the early Republic. To keep wine from spoiling on its way from Portugal and Spain to England and, later, America, wines were “fortified” with the addition of alcohol. This eggnog is a little lower ABV because wine replaces the liquor, and, as such, is less expensive to make. Go for a 1 cup nice, nutty oloroso sherry and 1 cup medium-dry Madeira. Stir those into your base. Cover the ‘nog and put it in the fridge for a minimum of two hours. When it’s garnish time, nutmeg works well here again, and just a bit of allspice performs well, too. I’m two-hundred years old, so this is my favorite version of eggnog.The Cool-Kid NogPhoto by Laura MurrayThis one is for all you lovers of Mezcal (I also fall in that category). In this context, it pairs beautifully with another notable product of Mexico: chocolate. A really good crème de cacao is a thing of beauty, providing a rich base note to your cocktails and your eggnog. Use 1¼ cups Mezcal and ⅓ cup crème de cacao. Stir those into your base, then cover and chill the mixture for at least two hours. After the final step, garnish with cocoa powder and freshly grated cinnamon. Don’t think this is too innovative for your relatives: After the first sip, they’ll be clamoring for you to bring it again next year.3. Seal the DealOnce you choose your booze, mix it into your eggnog base, cover, and chill at least 2 hours. When you’re ready to serve, beat the reserved egg whites in a medium bowl, either by hand or with an electric mixer, until stiff peaks form. Gently fold half of egg whites into eggnog. Once almost incorporated, gently fold in other half. Garnish appropriately for your chosen version.Can’t you just picture it? Family holiday party, where your beautiful bowl of eggnog is right there next to the shrimp cocktail and the decorative cheese ball. And there’s a glass in every hand and you’re getting so many compliments! You’re converting eggnog skeptics into eggnog believers, and isn’t that what the holidays are all about?Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlHoliday DrinksEggnogRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast", "Al Culliton"]}