{"id": "272e91d305c55205f596245c3dbf04d6", "url": "https://www.bonappetit.com/story/what-is-crab-paste", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "What Is Crab Paste, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Crab Paste, Anyway?This uniquely savory condiment deserves a permanent spot in your pantry.By Nico AvalleJuly 17, 2021FacebookTwitterEmailFacebookTwitterEmailThis rib-eye recipe from our Short Is Sweet collection perfectly demonstrates a couple of the easiest ways to make homemade steaks taste like something you’d get at a restaurant. First, the meat is cooked in a ripping hot cast-iron pan on top of the grill, which allows you to get an aggressive sear on both sides without setting off your fire alarm. Second, it’s continuously basted in a delicious mixture of ginger, garlic, lemongrass, and, most important, crab paste.Basting a steak in any fat is a great way to bring up the richness and juiciness of the meat without overshadowing its existing flavor. If you’ve ever left a steakhouse wondering why your dinner was so good, the answer is almost certainly that it was slathered with melted butter and herbs while it was cooking. (I mean, when isn’t the answer just “butter”?) But here, Silver Cousler—chef of the forthcoming Neng Jr.’s in Asheville, North Carolina—uses crab paste, which delivers the same richness while adding umami, some fermented funk, and a surfy-turfy moment to every bite.Wait, what exactly is crab paste?While the exact recipe varies somewhat from region to region and brand to brand, crab paste is usually a mixture of fermented crab guts and roe cut with some kind of acid like vinegar or citrus and oil, which makes it a prime candidate for basting meats while they cook. “I consider it a delicacy,” says Cousler, “usually it’s bright orange and made from all female crabs. The brighter it is, the better the quality is.” Cousler personally prefers the Filipinx brand Navarro’s, although says the Thai brand Por Kwan’s version is a good substitute as well.Crab paste shouldn’t be confused with crab “fat,” a mixture of fresh crustacean innards and roe that’s also common in Filipinx and other southeast Asian cuisines, which Cousler says they would usually find at a seafood counter or specialty market. By contrast, fermented crab paste is shelf-stable until opened and can be found in jars or tubs at most Asian grocers. It brings intense, nuanced flavors to the table straight out of the container, which is why it’s such a winner for quick recipes like this summery rib eye. Cousler notes that it is similar to bagoóng, a fermented Filipino shrimp paste with huge briny flavor and bite, although crab paste is much more subtle and rich.Photo by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeWhat else can I do with crab paste?Beyond basting, crab paste has tons of potential for home cooking. Because the ingredients are cooked before fermenting, crab paste can be used as a condiment straight out of the jar, making it one of the easiest ways to add complex fishy flavors to a bowl of white rice as a side dish or snack. Some crab pastes—like Korean gejeot—are more spreadable and homogenous, while others have larger chunks of crab, so it’s worth trying a few brands and varieties to find the topping that best suits your needs.For a more filling meal, Cousler suggests making crab paste fried rice. They treat the paste like a sofrito base—sautéing in a pan alongside garlic, onions, and pickled peppers—before adding cooked rice, vegetables, and other toppings, then cooking until they achieve a nice caramelized color. “You could use crab paste as a soup base,” they add, “but it’s not going to dissolve fully. It’ll leave a greasy top, and I love a dirty soup like that.”If you really love that crustacean flavor and want to bring it to the max, Cousler recommends layering fermented crab paste on fresh shellfish. “I like to get a nice quality shrimp and put crab paste on top,” they say. “It’s so simple and people are like ‘this is crazy!’ It’s seafood on top of seafood.”Get the Recipe:Crab-Paste-Grilled Rib EyeBasting a rib eye with jarred crab paste adds flavor and intensity with almost no effort.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-17", "author": ["Condé Nast", "Nico Avalle"]}