{"id": "272f394e0dd0b01db9b86fc3950eda33", "url": "https://www.bonappetit.com/story/mondo-cannabis-powder", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Mondo Cannabis Powder Is Weed Made for Taking at Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingMondo Cannabis Powder Is Weed Made for Taking at WorkThe anti-anxiety supplement is versatile, sensible, and plays well with food.By Brad LeoneJanuary 29, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI was introduced to cannabis by a friend with a joint. Although that is still the way most people first experience the plant, we’re currently living in what I like to call the Cannabis Renaissance. Folks are creating all kinds of products that dial in to exactly what various consumers want, putting it in everything from gummies to dissolvable mint strips to cooking oils. Personally, I still enjoy rolled cannabis but love exploring all the new edible options too. Which brings me to my new obsession, Mondo cannabis powder.Mondo is marketed as an anti-anxiety supplement that you can take during work hours. Its website promises “anxiety relief without intoxication,” and the small, attractive glass jar is shown resting on a laptop. The powder contains coconut oil, cacao butter, and three parts of the cannabis plant: THC (the compound in cannabis that has psychoactive properties and is still illegal in many states) as well as CBD and CBN (compounds that don't have psychoactive properties but are used to treat pain and stress). The folks at Mondo start by extracting the cannabis compounds by simmering the cannabis in coconut oil, which gives the product a warm, pleasant aroma and taste. How they make it into a dissolvable powder is a trade secret.What I’m really obsessed with is how versatile of a product it is. I've tried plenty of cannabis edibles in my time, but I rarely cook with it myself. Because THC needs a fat source to be absorbed when eaten, you have to infuse the plant in butter or oil, which takes more time and energy than I'm willing to spend. Mondo does the work of infusing for you, so it's ready to mix into anything you can imagine. I can swirl it into salad dressings or into a smoothie without getting that gritty supplement taste or mouthfeel. It can dissolve right into a cup of coffee or tea, and it certainly wouldn’t be bad sprinkled on your morning yogurt with fruit, if you’re into that in the a.m. There are no added sugars, and the jar comes with a 5-milligram dose scoop to allow you to know how much you’re consuming.Everyone responds differently to cannabis products, but, for me, one serving of Mondo is nothing like a typical high. It's great for creative energy: bright and peppy, with none of the dullness or crash that come with some strains of THC. Cannabis products have come a long way since my friend passed me my first joint many moons ago, and I’m glad. It’s been great for me to not have to smoke every time I’ve wanted the benefits of weed. As the industry continues to grow, I’m happy to see that companies like Mondo are giving consumers the ability to micro-dose cannabis in safe, fun—and I’d even say healthy—ways.Buy Mondo at select dispensaries in California.Explore Bon AppétitHealthyishMarijuanaCannabisShoppingRead MoreLifestyleHow to Entertain with Weed: An Etiquette GuideBy Mackenzie WagonerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-20", "author": ["Condé Nast", "Brad Leone"]}