{"id": "273f02fa6cfda446d57fc5f222bf7d83", "url": "https://www.bonappetit.com/story/best-citrus-squeezers", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "The Best Citrus Juicer for Every Type of Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhich Citrus Juicer Is the Best Citrus Juicer for You?The best lemon squeezers for control freaks, luddites, and Jimmy BuffetsBy Amiel StanekDecember 13, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.You know what is most assuredly not the best citrus juicer? Your hands. If you’ve ever tried to wring the juice from a bowlful of halved citrus fruits with your bare paws, whether out of necessity or masochistic curiosity, you know what I’m talking about. Because unless you spend your days idly exercising your mitts with one of those wacky hand worker-outers, you’re probably just not strong enough to squeeze limes and lemons without getting a cramp. And even if you do have hulk hands, trying to juice citrus au naturel makes a hell of a mess—orange juice all over your hands, all over the counter, all over the floor. No thanks!So if your aim is to extract the precious jus from citrus fruits easily and efficiently, you’ll need a device to assist you. Okay! You’ve got options. There are all sorts of citrus-expressing gadgets out there, and the best citrus juicer for you is, in many ways, a question of spirit: Who are you as a cook? What motivates and titillates you in the kitchen? Once you understand these questions, the best citrus juicer will present itself to you.There’s no super lemony olive oil cake without lemon juice.\nPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksOf course, there’s a chance that all of this sounds silly to you, and you’re just trying to make a G-D batch of lemonade or round of mimosas without reading another word. If that sounds like you, order yourself a Chef’n FreshForce Citrus Juicer and move on with your life. But if you’re interested in playing the field, read on.When you’re just trying to get the juice loose: Chef’n FreshForce Citrus JuicerAs mentioned earlier, this no-nonsense lever-style citrus press is going to work really well for most people. Cheaper versions of this same type of squeezer can bend and even break when faced with a hard, sadly underripe lemon half, but not this guy. Made from durable stainless steel and nylon, this high-quality citrus squeezer is strong enough to extract juice from even the most stubborn of fruits without buckling, and its “dual-gear mechanism” (whatever that means) helps to exert extra pressure without extra effort on your part. Plus, it has two tiny peg feet attached to the underside of the squishing bowl, which means you can set it on the counter without it rolling around. It’s the little things, people!Chef'n FreshForce Citrus Juicer$25 $14 at Amazon$25 $15 at Bed Bath & BeyondWhile this manual citrus juicer is our top pick, it’s not without its downsides. It does a medium-good job of catching pulp and seeds, but if you’re really concerned about that kind of thing you’ll still probably want to pass your fresh juice through a fine mesh strainer just to be safe. But the biggest bummer is probably the fact that, while this unit can squish limes as well as lemons, it is just too small to handle larger fruits like oranges and grapefruits.When mortar and pestle is life: Oxo Good Grips Wooden Citrus ReamerDoes the idea of doing things “the regular way” kind of, well, rub you the wrong way? Do you often find yourself performing a kitchen task and wondering if there might be a slightly more arcane and, dare I say, embodied method of accomplishing it? Do you think that pesto just tastes better when it’s been lovingly mortared by hand rather than glibly puréed in a newfangled kitchen gadget like a food processor or blender? Well, friend, have I got a citrus juicer for you!The unfortunately named reamer is hands down the most rustico version of this tool you’re gonna get. It’s basically just a short nub of wood that has a smooth handle on one side and a ridged cone on the other—no moving parts, no problem! To operate it you hold a half of a citrus fruit in one hand and use the other to jam the reamer into the flesh and rotate it back and forth, thus mashing the juice vesicles (that’s a thing, google it!) to a lifeless pulp and letting the liquid rain down into a bowl or other vessel. (Bowl or other vessel: not included.) This juicing process is as hands-on as it is effective—which is to say, very on both counts—and is great if you’re the kind of person who looks at lemon rinds after they’ve been squished and squozed by a lever-style press juicer and thinks to yourself, “It really looks like there might still be some juice in there!” There’s something to be said for doing things the hard way.OXO Good Grips Wooden Citrus Reamer$8 at Amazon$8 at Bed Bath & BeyondIt’s also extremely cool that since a reamer is just a chunk of hardwood, you could probably go a lifetime without having to replace it—there are no screws to come loose, no painted surfaces to become discolored, no removable parts—and it takes up precious little drawer space. It’s also the best budget option if you want to spend no more than $8 on lime juice extraction. Plus, it’s super versatile, capable of juicing everything from a Meyer lemon to a blood orange to a big ol’ ruby red grapefruit; if you can hold it in your hand, you can ream it. The biggest drawback? In addition to being somewhat laborious, you’ll always have to take the extra step of straining the juice to get the seeds out.When you’re just a liiiiiiiittle bit neurotic: Oxo Good Grips Small Citrus JuicerThere are two kinds of recipe people in this world: those who look at ingredient lists and cavalierly eyeball most measurements, and those who will devoutly follow them to the letter, happy to break out the ¼ and ⅛ teaspoons when asked. If you’re the latter, the Oxo Good Grips Small Citrus Juicer might be your speed. It is, in principle, a reamer, but one set on top of a little measuring cup, making it easy to extract a precise amount of juice—not a drop more, and not a drop less. It also has perforations for seed and pulp control, so once you’ve secured your very specific juice yield you can just pop the top and add it to your vinaigrette. Neat! Tidy! Controlled! If these words speak to you, and most of your citrus juice needs come in the form of tablespoons, ounces, and milliliters, then this is the best citrus juicer for you.OXO Good Grips Small Citrus Juicer$11 at Amazon$11 at TargetThe biggest limitation of this unit is pretty clear: If you routinely need to squeeze more than a third of a cup of lemon juice in a go, you’re going to have a tedious time of it. And while you could probably get away with using this to extract some juice from an orange, larger types of citrus are going to be a bit of a struggle. Also: Two pieces are always easier to lose than one. Always.When you’re wasting away again in Margaritaville: Proctor Silex Alex’s Lemonade Stand Citrus Juicer MachineAre you a Heavy Citrus User? Do you own an at-home frozen margarita machine? Does the term “Parrot Head” mean something to you other than the business end of a beautiful tropical bird? Do you live in a lemon grove? Then buckle up, because it sounds like you might need an electric citrus juicer. This one from Proctor Silex is effectively a jumbo, motorized version of the Oxo juicer described above, with a 34-ounce capacity and an auto-reversing reamer that spins of its own accord—plug it in, take half a piece of citrus and press down on the juicing cone, and you’ll have all the juice that piece of fruit has to give in seconds flat. Honestly, it’s pretty sick. It also has two different sized reamer heads optimized for small and large citrus fruits, a pour spout, and a catch that not only filters out seeds but can be adjusted to allow the exact amount of pulp you like to escape into your juice—and all dishwasher-safe. Fun!Proctor Silex Alex's Lemonade Stand Juicer$21 at Amazon$20 at WalmartBut while this device is amazing if you’ve got a ton of citrus to burn through, it’s kind of a drag to have to haul the whole thing from cabinet to countertop to extricate a quarter cup of grapefruit juice for one paloma, the same way it would be annoying to take out the food processor to chop two cloves of garlic. Great for lemonade stand or cocktail party mixer prep, less so for salad dressings. Which is to say, even if you’re the kind of person who deals in large quantities of citrus juice on the regular, you’ll probably still want to have one of the best manual units mentioned above on hand for smaller jobs.We love frozen margaritas. We love pie. We love frozen margarita pie:Explore Bon AppétitShoppingBA RecommendsToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "Amiel Stanek"]}