{"id": "27566790c0019ea23f4822f7cd2f847b", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/dock-lunch", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Dock Lunch Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverDock LunchMount Pleasant’s best-kept secret for lunch and a little readingFacebookPinterestTwitterEmailGrant HarderGO HERE: for homemade comfort food in your new best friend’s sweet old apartment. Owner Elizabeth Bryan actually used to live in this quirky space before it was rezoned to serve food. You’ll see her carrying out plates of barbecue pork and grits, meatloaf sandwiches, and slices of coconut cream pie to Dock Lunch customers she knows (or will soon know) by name.ORDER THE: one of two to five daily specials from the handwritten menu on the wall, plus a slice of whatever Bryan has baked for dessert. (She’s got a fondness for Southern cooking.) She’ll post offerings on Instagram and Facebook, then sell out pretty quickly, usually before 3 p.m. If there’s lemonade when you first walk in, go for it.THE VIBE IS: like you’ve accidentally wandered into someone’s vintage-inspired living room, with mismatched furniture, pink drapes, and bookshelves you can browse while you wait for your lunch.PRACTICAL STUFF: Open Tuesday to Friday, from noon to 4 p.m., and Saturday to Sunday, from 11 a.m. to 3 p.m. Closed Monday. Walk-ins are welcome, and try not to be late—when she’s out, she’s out! She also serves dinner on Friday, from 7 p.m. to 10 p.m., so call 604-879-DOCK to reserve ahead.—Lindsay AndersonGrant HarderGrant HarderGrant HarderWE ALSO LOVE33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryBeta5A Mount Pleasant sweets shop pushing cacao boundaries since 2011The AcornFine-dining in Mount Pleasant that just happens to not include meatExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}