{"id": "275670f15ebe76090c58d457ad078e80", "url": "https://www.bonappetit.com/story/umeboshi-paste", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Umeboshi Paste Is the Vegan Flavor Bomb You Didn’t Know You Needed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingUmeboshi Paste Is the Vegan Flavor Bomb You Didn’t Know You NeededWhat's super flavorful, surprisingly versatile, and can provide a myriad of health benefits?By Julia TauschJuly 16, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI first learned about umeboshi paste—the Japanese condiment made of pureed, fermented ume fruit—from my all-time favorite cookbook, The Cranks Bible by Nadine Abensur. She includes the paste in several recipes and writes, “It sometimes adds the perfect astringent note not just to Japanese dishes but anything similarly inspired.” Intrigued, and freshly in love with a vegan, I tracked down the paste in a health food store and made Abensur’s Quick Aromatic Laksa, aiming to impress. That vegan moved in and stayed for life; I haven’t been without a jar of umeboshi paste since.To make umeboshi, ume—translated variably as a type of plum or apricot—are picked when they’ve just started to ripen in June, covered with salt, weighted, and left to ferment for two weeks. Red perilla leaves are added, which dye the umeboshi their vibrant shade of pink over the next three weeks. The ume are then dried in the summer sun for several days, put back in their fermenting liquid for at least another week, and finally transferred to an airtight container to age for several months or even years. In \"The History and Culture of Japanese Food,” Anthropologist Naomichi Ishige writes, “Occasionally a jar of umeboshi over a hundred years old is found in a storehouse, and the pickles are still edible.”Umeboshi paste, ready to be wielded as a secret culinary weapon.\nPhoto by Emma FishmanAccording to Ishige, unripened ume was used medicinally in China since ancient times, and in premodern Japan “was believed to prevent infection during a plague.” Umeboshi developed in Zen monasteries before spreading to the Samurai class. The Zohyo Monogatari (“Story of the Common Soldiers”) advised warriors short of breath to “take an umeboshi from your provision bag and look at it. Look at it. Don’t eat it. As long as you survive, treasure it where you walk.” In the 1970s, nutritionist Otsuka Shigeru displayed a similar faith in the power of this pickle’s very presence, writing, “Even the middle-aged gentleman experienced in overseas travel somehow recovers his composure by merely remembering the umeboshi in his suitcase as he undergoes the departure process at Haneda International Airport.” Researchers today continue to explore the potential powers of umeboshi, which purportedly include everything from cavity prevention to curing a hangover to inhibiting cancer growth.If the health benefits haven’t sold you, the yumminess and versatility will. Traditionally eaten with rice, I also use umeboshi paste anywhere an omnivore might use anchovies, fish sauce, or Parmesan cheese. I stir it into risotto and pasta puttanesca, blend it into pesto, saute it with a mountain of broccoli, sneak it into Thai curry, and wield it as the until-now-secret weapon in my Caesar dressing. It lifts my tofu-ricotta lasagna out of boring-town, and it gilds the lily of a lemony, capery marinade that I use when I want to conjure sea-vibes out of tempeh (it works!).Certainly you can use miso and nutritional yeast—those other vegan flavor-makers—in all of these dishes, and sometimes I do. But umeboshi paste has a special acidic sharpness that the others just don’t, a tart, almost briny oomph that hits just the right note.Explore Bon AppétitHealthyishJapaneseVeganCondiment/SpreadShoppingRead MoreshoppingThe Fruit That Doubles As My Hangover CureBy Kiki FlynnRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast", "Julia Tausch"]}