{"id": "275acd08aa0da899ab8c2c0daeb592fe", "url": "https://www.bonappetit.com/story/dog-cafe-new-york-city", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "A Dog Café Is Opening in New York City Later This Month | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Dog Café Is Opening in New York City Later This MonthYou provide the dog, they provide the café.By Andrea ParkJanuary 8, 2018FacebookTwitterEmailBoris & HortonFacebookTwitterEmailDogs of New York City, rejoice: Beginning later this month, you'll finally have a place outside of your humans' apartments and the currently snow-filled parks to hang out with your friends. According to Grub Street, the city's first dog café will have a soft opening in mid-January before opening for good later this month.Boris & Horton, located at 12th Street and Avenue A in Manhattan's East Village and named after owners Coppy Holzman and Logan Mikhly's dogs, will offer a much-needed space for dog owners to hang out with their furry and human friends while grabbing a cup of coffee and a bite to eat. Instead of tying their pets' leashes to a nearby pole or tree while quickly running inside to grab a coffee, as is the rule at other cafés, Boris & Horton customers will be able to bring their dogs inside with them. \"We want it to feel as much as possible like your typical coffee shop, but you have the added benefit of hanging out with your dog,\" Holzman told Grub Street.To be clear, this dog café isn't the canine counterpart to the Japanese-style cat cafés that have started popping up around the U.S. While those spaces are typically filled with (usually adoptable) cats just waiting to be played with, Boris & Horton is strictly bring-your-own-dog—although, there's technically nothing stopping dog-less dog-lovers from stopping by to play with the pups who are already hanging out with their owners at the café.Boris & Horton will be divided into two Health Department-approved sections: The café side will offer a selection of pastries from Balthazar, Bien Cuit, and the gluten-free Husk Bakeshop, City of Saints coffee, house-made toasts, and, in the evening, a beer and wine menu. The \"dog side\" will feature a seating area, a shop filled with canine-related goods, a \"puppy Instagram booth,\" and weekend dog adoption events. Visitors to the \"dog side\" will be expected to follow Boris & Horton's house rules, which are listed on the café's website and prohibit off-leash play, \"humping and mounting,\" bringing in more than two dogs per person, and dangerous or disruptive behavior.As long as Boris & Horton's patrons—of the two- and four-legged variety—follow the rules, NYC's first dog café is sure to be a hit with guests of all species. \"It's not just a coffee shop where people sit there with headphones on their laptops,\" Holzman said. \"Dogs sort of break the ice.\"Another way to break the ice...Explore Bon AppétitTrendsTrends + NewsNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-08", "author": ["Condé Nast", "Andrea Park"]}