{"id": "276fdb960b428fcb05c8f7cc1c6c3026", "url": "https://www.bonappetit.com/recipe/chocolate-pudding-pie", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Chocolate Pudding Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueChocolate Pudding PieBy Chris MoroccoOctober 15, 20193.7(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA dazzling chocolate pudding pie cloaked in voluminous whipped cream. The secret to that whipped cream’s great height: Setting it with dissolved gelatin means it won’t deflate or weep when chilled.Ingredients8 servingsCrust2Tbsp. granulated sugar2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2⅔cups all-purpose flour, plus more for dusting1½cups (3 sticks) chilled unsalted butter, cut into ½\" piecesFilling½cup sugar3Tbsp. unsweetened cocoa powder, preferably Dutch-process2Tbsp. cornstarch2large eggs2large egg yolks2½cups whole milk1tsp. vanilla extract½tsp. kosher salt4oz. bittersweet chocolate, choppedAssembly1tsp. unflavored powdered gelatin2cups heavy cream2Tbsp. sugar2tsp. vanilla extract1tsp. kosher saltUnsweetened cocoa powder, preferably Dutch-process (for serving; optional)PreparationCrustStep 1Whisk sugar, salt, and 2⅔ cups flour in a large bowl. Add butter and, using your fingers, smash each piece into a thin disk. Take your time doing this and don’t feel compelled to break butter into even smaller pieces. Drizzle ⅔ cup ice water over, dispersing it as widely as possible, and mix with a rubber spatula to bring mixture together into a shaggy mass.Step 2Turn dough out onto a surface and work together with your hands, pushing and flattening until dough holds together when squeezed in your palm but some streaks of dry flour are still visible. Divide dough into 2 portions.Step 3Flatten 1 portion of dough into an 8\"-diameter disk. Cut into quarters, stack pieces on top of one another, and flatten dough with a rolling pin to about half of its original height. At this point dough should hold together with no dry spots remaining, and have nice big flakes of butter showing. Use a bench scraper or a large knife to clean any clingy bits of dough from surface. Dust surface with flour, then dust top of dough with flour. Roll out to a ¼\"–⅜\"-thick round. Wrap dough around rolling pin and transfer to a standard 9\"-diameter pie dish. Unfurl into dish, then lift edges and allow dough to slump down into dish. Trim overhang to an even 1\" (there will be some excess). Fold overhang under and crimp as desired. Cover and chill until very cold, at least 1 hour and up to 12 hours (cover tightly if chilling longer than 1 hour). Repeat process with remaining dough and another pie dish. Or form into a 1½\"-thick disk, wrap in plastic, and chill up to 3 days (or freeze up to 1 month).Step 4Place a rack in middle of oven; preheat oven to 400°. Lay 2 sheets of parchment paper over dough and fill with pie weights or dried beans (they should fill the dish). Set on a foil-lined rimmed baking sheet (this will keep any butter drips from smoking up your oven). Bake until edges are golden brown and bottom is opaque (carefully lift parchment to check), 30–35 minutes. Remove from oven; reduce oven temperature to 300°. Lift out parchment and weights. Bake crust until evenly chestnut brown all over, 10–15 minutes. If baking both crusts, turn oven dial back up to 400° and let oven preheat; repeat with remaining crust.FillingStep 5Whisk sugar, cocoa powder, and cornstarch in a large saucepan to combine. Add eggs and egg yolks and whisk vigorously, making sure to get into corners of pan, until smooth. Whisk in milk, vanilla, and salt.Step 6Place saucepan over medium heat and bring to a simmer, whisking often and making sure to get into corners of pan, 8–10 minutes (mixture should be bubbling and thickened). Reduce heat and continue to simmer, whisking constantly, 3 minutes. Remove from heat and let pudding cool 5 minutes, whisking several revolutions every minute to prevent any skin from forming.Step 7Add chocolate to pudding and whisk until melted and fully incorporated. Scrape filling into pie crust; smooth surface. Chill until cold and set, at least 2 hours and up to 3 days.AssemblyStep 8Stir gelatin and 1 Tbsp. water in a small bowl. Let sit until solidified, about 5 minutes. Microwave in 5-second intervals until melted, or set in a bowl of very hot water and let sit until melted.Step 9Using an electric mixer, beat cream, sugar, vanilla, and salt in a large bowl until soft peaks form. Add melted gelatin and beat until medium peaks form. Spoon whipped cream over filling, swirling as desired. Chill until set, about 1 hour. Dust with cocoa powder if desired.Step 10Do Ahead: Pie can be made 3 days ahead. Keep chilled.Photo by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHow would you rate Chocolate Pudding Pie?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleShould have read the reviews about the salt! It wasn't bad, being paired with chocolate filling, but more surprising if you're expecting a store bought French Silk pie. Less adventurous eaters will not like it. I think half the salt in the whipped cream would be about right, or skip it all together. If skipping, you may want to add something else somewhere in the recipe to keep it from being too blandNate RIowa11/25/2021I've made this a few times and have enjoyed it, especially after taking note of the minimal salt in the whipped cream.\nOne important note, that I'm not sure I understand in this recipe: the dough makes TWO pie crusts and the filling/whipped cream is for one pie. \nThis is not very explicit in the recipe as you go along, so don't be surprised when you have loads of extra pie dough and not enough filling. Save the extra dough for another pie or double the filling of this one to make two. I have no idea why the serving sizes are so drastically different for one recipe, but wanted to point it out.\nAlso, I now skip the gelatin completely in the whipped cream. The first time I used it, it didn't dissolve fully and there were gross clumps throughout. I just use my standard recipe and top it when ready to serve: 1cup heavy whipping cream and 1 tbsp of sugar. Whip until stiff peaks and refrigerate until ready to serve. SamCleveland11/25/2021Great filling! I was a bit lazy and instead of making a crust I used a Pillsbury Pie Crust and followed the instructions on the box for baking a pie with pudding fillings. The only reason I gave it 4 stars was the salt in the whipped cream. I only used a pinch, but it was still a little much for me. It was fine when you ate the whipped cream with a bit of the chocolate filling. But if you're like me and you like to eat just a spoonful of whipped cream every few bites it was a little much. Just omit the salt in the whipped cream and it would be 5 stars! Veronika ZwickeSeattle, WA9/30/2021Hi, I made this for Thanksgiving and it was good. I read the reviews on the salt, so just added a little in the pastry and 1/4 tsp in the cream. The chocolate pudding was great, it thickened quite quickly and tasted delicious. I used bittersweet chocolate buttons, high quality chocolate and they melted fast. If you take the tart straight from the fridge and serve, the pastry is rock hard. You need to leave it out of the fridge for at least 1 hour before serving. I will make this again but was not blown away by it.Sasha SlorerNYC11/28/2020I made this for yesterday’s Thanksgiving dinner. It looked pretty, but unfortunately, the chocolate part was not good. First of all, it didn’t have a real chocolatey taste and lacked flavor. I have to admit that I got salt-scared based on other reviews, so I only added a pinch or two to the filling. Could that have been the problem? Then, the texture was not right. I think the eggs cooked, despite keeping the flame low. The result:  grainy, not silky, the way chocolate pudding should be. I’d try it again, but with some adjustments. So disappointing. SDNew York, NY 11/27/2020This recipe was amazing. I used an immersion blender to smooth out the pudding before adding the chocolate, but that's because I accidentally added the egg + liquid ingredients all at once to the dry ingredients. If you follow the instructions I'm sure it wouldn't turn out as lumpy. I wonder if the people complaining about the salt in the whipped cream are using a finer grain of salt (Morton or table)? I used the full tsp of kosher salt and thought it tasted perfectly fine. It's balanced pretty nicely by the 2 T of sugar. This was my first time blind-baking a crust and it turned out great. I was eating this pie for days afterwards and the crust held up beautifully (no sogging). All in all I will definitely make this again!ekgrantham5788Austin, TX12/11/2019So...I LOVED this recipe. I thought the salted cream vs the rich chocolate was wonderful. My guests were a little confused about the salted cream, though. I even dialed it back a 1/4 tsp because when I was making it I thought \"wow that sure is a lot of salt in the whipped cream\". I think it all balances nicely, but I think the recipe name is misleading. If there is going to be an element of this recipe that is so significantly salted/punchy with salt - it should be called out in the name. I know that will make the name very wordy, but otherwise if you tell people it's a \"chocolate pudding pie\" people are taking a bite and going...theres something wrong with your whipped cream? It's not bad its just...salty? stickyheelsDurham, NC12/5/2019The filling was delicious, definitely using that with a different crust. The crust was just too salty, Im glad that I didn’t add salt in the whipped cream as well. Honestly, if you leave out most of the salt in this recipe, it would be an amazing pie. Anonymous12/3/2019We made this pie for Thanksgiving and found it to be inedible. The pudding was not sweet enough and the salt in the whipped cream made it taste terrible. My guests who tasted it looked at each other and thought, “Really? Is this a mistake?” We threw away the pie. Fortunately, it wasn’t our only dessert.AnonymousDurham, NC11/29/2019Thought this was just ok. Cooking time for crust was too long. The bottom crust was rock hard, filling was good, but not great. Whipped cream with the amount of salt called for in recipe was terrible. Threw it out and made another batch without the salt. AnonymousRidgefield, WA11/29/2019This pie was a hit. We too thought that the whipped cream was fairly salty, but measured against the chocolate pudding, it was fine. Besides, we figured that we could just tell everyone it was a “Chocolate Pudding and Salted Cream” pie. Anonymous11/29/2019Loved this recipe! The only flaw was I originally added the salt to the whipped cream recipe but didn't end up liking it. I made another batch without salt and it was so much better!!Anonymous11/28/2019This is delicious and so simple! I made the pie and the whipped cream the day before and assembled the day of. The whipped cream fell a little bit so it wasn't quite as tall and elegant but still tasty. If I did it again, I'd save making the whipped cream for closer to serving.  Anonymousaustin11/25/2019This is a very good pie. I made the dough and the lemon meringue all together. This one is a little salty for us, but I enjoyed more than others. \n\nMaking this and the meringue again for thanksgiving. They pair very nicely. AnonymousNYC11/25/20191 tsp of kosher salt to 2 cups of whipped cream? That can't be right. We ended up scraping it all off and making traditional whipped cream.  The chocolate was delicious though.\nAnonymousNew York11/23/2019Explore Bon AppétitPieDessertAmericanChocolateOther IngredientsCocoaNut-FreeBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Chris Morocco"]}