{"id": "2776faef57b158f4120f5a4c8abeea88", "url": "https://www.bonappetit.com/recipe/hawaiian-pizza-with-barbecue-sauce-and-beef-bacon", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Hawaiian Pizza With Barbecue Sauce and Beef Bacon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueHawaiian Pizza With Barbecue Sauce and Beef BaconBy Michael CarterSeptember 14, 20214.1(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis pie is for all the people out there who only think they hate Hawaiian pizza. Slowly but steadily, Down North Pizza in Philadelphia has been converting customers with this pie, listed on the menu as the Flip Side. This Detroit-style version is made with an impossibly fluffy dough and is topped with caramelized pineapple and a tangy, smoky homemade barbecue sauce (feel free to substitute with your favorite store-bought sauce). Executive chef Michael Carter uses beef bacon to keep the pizza halal, but pork bacon works equally well.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMetal Baking Pan$22 At AmazonBlender$32 At AmazonStand Mixer$460 At AmazonSlotted Spoon$13 $10 At AmazonIngredientsMakes one 13x9\" pizzasauce2tsp. extra-virgin olive oil½small sweet onion, thinly sliced115-oz. can tomato sauce¼cup apple cider vinegar¼cup black pepper sauce (such as Lee Kum Kee or KA-ME)3Tbsp. honey2Tbsp. robust-flavored (dark) molasses2Tbsp. tomato paste1Tbsp. mustard powder1Tbsp. Worcestershire sauce1tsp. liquid smoke½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½tsp. garlic powder½tsp. smoked paprika¼tsp. freshly ground black pepper¼tsp. onion powder11\" piece ginger, peeled, coarsely choppeddough2Tbsp. vegetable oil, plus more1Tbsp. instant yeast2tsp. sugar4½cups (550 g) bread flour1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher saltassembly8oz. beef bacon, coarsely chopped2Tbsp. sugar114-oz. can crushed pineapple1lb. low-moisture mozzarella, coarsely grated⅓cup pickled jalapeñosPreparationsauceStep 1Heat oil in a medium saucepan over medium. Cook onion, stirring occasionally, until softened and golden brown, 10–15 minutes. Stir in tomato sauce, vinegar, black pepper sauce, honey, molasses, tomato paste, mustard powder, Worcestershire sauce, liquid smoke, salt, garlic powder, smoked paprika, ground black pepper, onion powder, and ginger. Increase heat to medium-high and bring sauce to a simmer. Reduce heat to medium-low and simmer gently, stirring occasionally, until thickened, 15–20 minutes.Step 2Transfer barbecue sauce to a blender and purée until smooth.Do ahead: Sauce can be made 3 days ahead. Transfer to an airtight container; cover and chill.doughStep 3Generously coat a 13x9\" metal baking pan with oil. Whisk together yeast, sugar, and 2 cups plus 2 Tbsp. room-temperature water in the bowl of a stand mixer. Fit bowl onto mixer fitted with dough hook. Add flour and 2 Tbsp. oil and mix on low speed until just combined, about 1 minute. Scrape down sides of bowl and add salt. Mix on low speed, gradually increasing to medium-low, until dough is smooth and has pulled away from sides of bowl, about 5 minutes (dough will be sticky).Step 4Transfer dough to prepared baking pan (don’t spread it out; dough will spread as it rises). Cover pan with plastic wrap; let rise in a warm, draft-free spot until dough covers most of pan, about 20 minutes.Step 5Preheat oven to 500°. Uncover pan and, using lightly oiled hands, press dough into corners. Let sit, uncovered, until dough has risen slightly, about 20 minutes.Step 6Parbake dough until bottom is just beginning to turn golden brown, about 3 minutes.AssemblyStep 7Heat a medium skillet over medium-high. Cook bacon, stirring often, until cooked through and some fat has cooked out, 5–8 minutes. Using a slotted spoon, transfer bacon to a plate.Step 8Stir sugar and pineapple with juice into fat in skillet. Reduce heat to medium-low. Cook, stirring occasionally, until pineapple is deeply browned and juice has cooked off, 10–20 minutes, depending on amount of juice.Step 9Scatter mozzarella over parbaked dough. Top with bacon and pineapple mixture. Bake until crust is golden brown around edges, 10–15 minutes.Step 10Transfer pizza to a cutting board; slice into 8 pieces. Drizzle barbecue sauce over and top with pickled jalapeños.How would you rate Hawaiian Pizza With Barbecue Sauce and Beef Bacon?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleLMAO, cultural appropriation.  Do libs ever look at themselves in the mirror and say 'WTF'?AnonymousGreen Bay, WI12/18/2021Very tasty pizza.  The spice level was little more than I would have thought. (Good thing I like spicy)\nA lot of different flavors hitting your taste buds at one time, but in a good way.\nThe amount of dough seemed like a lot, I’ve done a Detroit style pan that used half as much flour. \nNext time maybe in a larger sheet pan with less dough.\nI will definitely make again.M8keSpringfield, IL11/20/2021cultural appropriation, lol. \nIt's like getting mad at someone for sitting up front when you called shotgun that one time. Anonymous11/2/2021LMAO cultural appropriation?  Libs are classic. Martin 9/24/2021A lot of work and a lot of pots and pans to clean for some pizza, but it was worth it. These ingredients seem meticulously thought through and this combination of flavors take what we all know as Hawaiian pizza to the next level. This isn't that lame sliced ham and canned pineapple ring pizza... This is made from scratch, made with love, each and every step pizza.JosephSan Francisco9/23/2021The anonymous reviewers should go back to eating their Shaq-a-roni Pizzas.  Hawaiian Pizzas have been around for decades.Steve9/17/2021I love the story behind this recipe and the recipe looks great! Thank you Michael Carter for all you're doing to lift yourself and the people around you up! I wish you great success. I don't want to stir up controversy but I fail to see how calling a pizza with Pineapple (which often comes from Hawaii) is cultural appropriation. Maybe the idea to put Pineapple on a pizza didn't originate in Hawaii (but do you know for sure?) but recognizing where the deliciousness came from seems like an accolade to me.Anonymous605619/16/2021In light of everything that happened at Bon Appetit, I’m super disappointed to see you publish this recipe. There is no such thing as Hawaiian pizza. It’s cultural appropriation and alludes to colonialism and imperialism in Hawaii. Please rename this or remove it from your site.Anonymous9/16/2021Explore Bon AppétitPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Michael Carter"]}