{"id": "277b371e6f9d33cfcfe929c595fa41ff", "url": "https://www.bonappetit.com/recipe/stuffed-eggplant-with-crispy-beef", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Stuffed Eggplant with Crispy Beef Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStuffed Eggplant with Crispy BeefBy Claire SaffitzAugust 7, 20184.5(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintCustardy eggplant, sweet-tart pomegranate, creamy garlic yogurt, and crispy beef—eggplant naysayers, we're coming for you. Easy enough for a weeknight but fancy enough to serve to company, this is your new late-summer standby.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketFlexible Metal Spatula$9.99 At AmazonMedium Bowl$17 At AmazonSpoon$24.69 At AmazonMicroplane$16 At AmazonCast Iron Skillet$30 At AmazonPlatter$29 At AmazonIngredients4 servings2medium globe eggplants (about 1 lb. each)6Tbsp. extra-virgin olive oil, divided, plus more for drizzlingKosher saltFreshly ground black pepper5garlic cloves, divided1small onion½cup parsley leaves with tender stems½cup whole-milk plain yogurt1lb. ground beef½tsp. ground cumin½cup pomegranate arils (about 3 oz.)PreparationStep 1Preheat oven to 425°. Trim stem end off 2 eggplants, then poke holes all over. Cut both eggplants in half lengthwise. Using the tip of the knife, score a shallow 1\"x1\" crosshatch pattern into 4 cut sides.Step 2Place eggplant on a rimmed baking sheet and drizzle with 3 Tbsp. oil. Toss eggplant with clean hands to coat. Season generously on all sides with salt and pepper. Arrange halves cut sides down on baking sheet.Step 3Roast eggplant until undersides are deep golden brown, 20–25 minutes. Using a flexible spatula, turn halves cut side up, scraping pan to release eggplant. Continue to roast until very tender and flesh is collapsed, another 15–20 minutes. Remove from oven and let rest until cool enough to handle.Step 4While eggplant is roasting, prep the filling ingredients and yogurt sauce. First, peel and set aside 1 garlic clove. Smash remaining 4 garlic cloves with the flat side of your knife and remove loosened skin.Step 5Peel and finely chop 1 onion.Step 6Coarsely chop ½ cup parsley and set aside for serving.Step 7Stir ½ cup yogurt and 1 Tbsp. oil in a medium bowl. Using a microplane, grate 1 reserved garlic clove into bowl; season with salt and pepper.Step 8Time to make the filling. Heat remaining 2 Tbsp. oil in a large skillet, preferably cast iron, over medium-high. When oil is shimmering, add 1 lb. beef and press into a single layer with flexible metal spatula. Season with salt and pepper.Step 9Cook undisturbed until beef is browned and crispy on one side, about 4 minutes. Using spatula, toss beef, breaking up into small pieces, then push to one side of skillet.Step 10Add onion and smashed garlic to empty side of skillet and cook, tossing just onion and garlic often, until onion is translucent and mixture is browned in spots, about 3 minutes.Step 11Add ½ tsp. cumin and toss to combine with onion mixture, then toss everything with beef to combine; season with a bit more salt. Continue to cook, tossing constantly and breaking up meat even more, until beef is cooked through and thoroughly mixed, about 1 minute. Remove from heat and let cool slightly.Step 12Smear yogurt mixture across bottom of a platter. Arrange warm eggplant cut sides up over top, allowing any moisture to drip off of eggplant before placing over yogurt. Spoon beef mixture over eggplant.Step 13Scatter ½ cup pomegranate arils over beef. Sprinkle reserved parsley over entire platter. Drizzle with a bit more oil before serving.How would you rate Stuffed Eggplant with Crispy Beef?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleIt was very good, but I did go into it knowing eggplant is very bland. After reading some previous reviews, I  too made some Adjust.  I added chili powder,  Hungarian paprika, oregano. I sauteed the onion and garlic with the spices,, then added the beef. I topped it with a combo of parsley and cilantro as I had both and I need to use them up. I also squeezed a half a lime as a final touch. I loved the pomegranate.  I had everything on hand as a have e eggplants in my backyard garden and picked a few off the vine. I think the amount of beef stuffing can be enough for 3 or 6 halves. But next time, I'm going to try it with ground lamb!PattyOklahoma 11/21/2021This was very good. I made a few adjustments: some 7 spice mix in addition to the cumin; brushed a little pomegranate molasses over the eggplants after roasting  as I didn’t have fresh; mint instead of parsley; a sprinkling of sumac before serving. Really nice recipe. GailSMassachusetts9/25/2021Loved this dish. The only changes I made were to swap dried cranberries for the pomegranate seeds and add lemon zest to the finished dish. Absolutely delicious and relatively simple meal and clean up. Hilary8/15/2021We make this with shredded firm tofu seasoned with kabseh spice and shallots instead of beef. It works beautifully with the eggplant and pomegranate. We swap out the yogurt for non dairy when e serve it to vegan friends. Love this combo. MichelToronto 3/15/2021We liked this recipe. We paid attention to the comments and embellished, adding Worcestershire sauce and a splash of sherry vinegar to brighten the beef, and adding lemon juice and salt to the yogurt. The yogurt tied it all together and was super delish. We skipped the pomegranate and didn’t sub in anything else sweet. Didn’t miss it. RobinSeattle, WA2/16/2021This is kinda tasteless, I would put pomegranate molasses in the beef just before serving next timeACF11/6/2020I added crumbled feta cheese on top and a bit of mayo to the beef - tasted delicious!!AnonymousLondon8/4/2020This was SO good and filling. I didn't have pomegranate but used pine nuts, and added mint in the yogurt sauce. Next time i'll just cook the onions before the meat, as I thought the method wasnt very practical and the meat got a little overcooked while waiting the onions to fully soften. But the eggplant was so custardy and delicious, it wasn't even an issue. I made it without the yogurt for my bf who doesn't eat dairy and he loved it. I have gestational diabetes and this recipe ticks all the boxes of what I can eat so thank you!!!AnonymousFrance3/10/2020Not for me. Bland, tastless waste of some nice eggplants and ground beef. AnonymousSan Diego8/8/2019Meh.  Eggplant was great but beef dry and flavorless.   Tried to amp up the flavor with extra spices and herbs... but didn't make much difference. There are more flavorful recipes for eggplant and meat.   AnonymousJohannesburg South Africa 4/29/2019Great recipe! I'd increase the time to roast the eggplant, as mine weren't as done as I'd like. Couldn't find pomegranate, so subbed lemon juice sweetened with honey and drizzled over the top. Also took one reader's recommendation and topped with pickled red onions. To make healthier, cut down a bit on the olive oil and used fat free Greek yogurt. A delicious meal!Honolulu4/9/2019The basics of this recipe are excellent. The preparation and cooking of the eggplant resulted in a buttery-sweet smooth eggplant filling with the skin offering a hint of crunch. I completely changed the seasoning of the beef to incorporate Greek flavors to use up what was in my fridge, but I kept the way it was cooked, included the garlic and onion. A great base to play with flavors. I'm going to add this into my rotation but try to use more vegetables diced finely into the beef to lighten it up a little. livseesfoodNorth Carolina3/15/2019This recipe is wonderful: the eggplant is custardy, the ground beef makes the meal hearty, and the lovely garlic yogurt dressing is so much more than the sum of it's parts. Will be making this again and again. AnonymousBrooklyn10/16/2018This was super delicious. I can't eat dairy so I subbed in tahini for the yogurt and it was still amazeballs. AnonymousDenver9/13/2018Literally the most delicious meal I've made/eaten in a while. What a great idea. I've made it twice and use whatever fresh bits and bobs I have in the fridge on that day. The last time I made it, I stirred through finely chopped spring onions just as the mince finished cooking, and topped it with chili flakes and pickled red onion along with the herbs. Superb! Lemon wedges and Lemon zest are also amazing. KelHouDurban, South Africa9/10/2018Explore Bon AppétitAmericanEggplantVegetableGround BeefBeefMeatSummerMainGluten-FreeNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Claire Saffitz"]}