{"id": "27885fba23e90a4854b54da39333c7db", "url": "https://www.bonappetit.com/recipe/pan-roasted-halibut-with-herbed-corona-beans", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Pan-Roasted Halibut with Herbed Corona Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2015 IssuePan-Roasted Halibut with Herbed Corona BeansBy Miles Thompson, SHED Restaurant, HealdsburgPhotography by Peden + MunkJanuary 18, 20183.7(27)Read ReviewsTriangleEmailPinterestPrintPeden + MunkEmailPinterestPrintEmailPinterestPrintThe halibut is brined briefly in salt water, which seasons it all the way through.Ingredients6  Servings1½cups dried corona or gigante beans, soaked overnight1shallot, halved2bay leaves, torn in half1½tablespoons plus ¼ cup kosher salt, plus more2anchovy fillets packed in oil, drained, finely chopped1garlic clove, finely grated¾cup finely chopped fresh parsley1tablespoon drained capers, finely chopped1tablespoon finely grated lemon zest1tablespoon fresh lemon juice½cup plus 1 Tbsp. olive oilFreshly ground black pepper65–6-ounce skinless halibut fillets1tablespoon unsalted butter1lemon, cut into wedgesPreparationStep 1Drain beans and transfer to a large pot. Cover with water by at least 2” and add shallot, bay leaves, and 1½ Tbsp. salt. Bring to a boil, then reduce heat and simmer gently, adding water to keep beans submerged, until very soft but not split, 1½–2 hours. Let beans cool in liquid.Step 2Mix anchovies, garlic, parsley, capers, lemon zest, lemon juice, and ½ cup oil in a medium bowl; season with salt and pepper. Drain beans and discard shallot and bay leaves. Add to parsley mixture, tossing to coat (save bean cooking liquid to make soup or add to your next batch of beans; it freezes well). Season beans with salt and more lemon juice, if desired.Step 3Whisk remaining ¼ cup salt with 4 cups water in a shallow baking dish until salt is dissolved; add halibut (it should be submerged) and let sit 30 minutes (don’t let it sit any longer or fish will be too salty).Step 4Remove halibut and pat dry. Heat remaining 1 Tbsp. oil in a large skillet over medium-high and cook halibut (do not season) until a golden brown crust has formed, about 4 minutes. Flip and cook another minute or so, just to finish cooking through and sear the second side. Turn off heat and add butter to skillet. Tilt skillet and spoon foaming butter over fillets for another minute. Serve halibut with beans and lemon wedges for squeezing over.Nutrition Per ServingCalories (kcal) 495 Fat (g) 24 Saturated Fat (g) 5 Cholesterol (mg) 50 Carbohydrates (g) 30 Dietary Fiber (g) 12 Total Sugars (g) 0.5 Protein (g) 46 Sodium (mg) 2550How would you rate Pan-Roasted Halibut with Herbed Corona Beans?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI couldn't find the right beans, so I used canned Cannellini beans. Drained, Rinsed, then cooked them with the shallot, bay leaves, &  salt for about 15-20 mins.\nDid everything else the same after that point; AMAZING and will be one of our regular recipes from now on-husband loved it, too!Anonymous3/9/2020Explore Bon AppétitHalibutFishSeafoodGigante BeanWhite BeanBeanVegetableEasyMainGluten-FreeNut-FreeHealthyishSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-01-20", "author": ["Condé Nast", "Miles Thompson", "Shed Restaurant", "Peden"]}