{"id": "278e892097d6c23a0f9b77cb0fff5136", "url": "https://www.bonappetit.com/recipe/mulled-wine", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Mulled Wine Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2012 IssueMulled WineBy The Bon Appétit Test KitchenMarch 9, 20214.3(84)Read ReviewsTriangleEmailPinterestPrintPhoto by Ditte IsagerEmailPinterestPrintEmailPinterestPrintIn this mulled wine recipe, cardamom, cinnamon, citrus, and fresh apple cider mingle in a heady combination that instantly improves any cold winter day. When it comes to the wine, try Merlot for its softness and fruit-forward flavors—but pretty much any decent bottle of red will do. Just be sure not to let the mixture boil; the barest of simmers will ensure plenty of flavor, but without boiling off all the alcohol.This mulled wine recipe can be made two hours ahead of serving. When you want to start sipping, just rewarm gently over medium-low heat.Editor’s note: This recipe was originally published November 13, 2012.Ingredients12  Servings20whole cloves2tangerines, clementines, or small oranges2750-ml bottles Merlot3cups fresh apple cider8Lady apples (optional)2cinnamon sticks plus 8 for garnish (garnish optional)2green cardamom pods, cracked2cups tawny PortPreparationStep 1Press stem (pointed) end of 10 cloves into each tangerine, piercing through the skin. Place tangerines, wine, cider, Lady apples (if using), 2 cinnamon sticks, and cardamom pods in a large pot. Bring to a bare simmer over medium-low heat; cook gently for 20 minutes. Do Ahead: Mulled wine can be made 2 hours ahead. Cover and let stand at room temperature. Rewarm gently over medium-low heat before continuing.Step 2Stir in Port. Divide among glasses; garnish each with a cinnamon stick and a Lady apple, if desired.Nutrition Per Serving12 servings 1 serving contains:\r Calories (kcal) 310 \rFat (g) 0 \rSaturated Fat (g) 0 \rCholesterol (mg) 0 \rCarbohydrates (g) 20 \rDietary Fiber (g) 1 \rTotal Sugars (g) 18 \rProtein (g) 0 \rSodium (mg) 0How would you rate Mulled Wine?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleIt was okay. . . . I think the flavor profile was off. Needed more cinnamon and cardamom Anonymous11/25/2021Explore Bon AppétitCocktailDrinks AllHot DrinkApple CiderAlcohol & Other DrinksWinterEasyDrinksSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2012-11-13", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}