{"id": "27a0eb8cbbecf08fb34b2d3f43af7995", "url": "https://www.bonappetit.com/recipe/double-dark-chocolate-cookies", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Double Chocolate Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesObscenely Chocolatey Chocolate CookiesBy Rick MartinezDecember 8, 20194.6(67)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintHere's the cookie to bake when you want to impress your friends at the cookie swap but you're not about to spend hours cutting out reindeers and piping royal icing. The big puddles of chocolate offer drama—and tell the tale of the super chocolatey, gooey insides. The best part is that there's no real planning ahead necessary: After just one hour of resting, these cookies are ready for the oven. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Saucepan$39 At AmazonSpatula$12.99 At AmazonLarge Bowl$18 At AmazonMedium Bowl$17 At AmazonSieve$18 At AmazonWhisk$10 At AmazonWooden Spoon$6 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonWire Rack$23 At BA MarketIngredientsMakes 16–182large eggs52-oz. bittersweet chocolate bars (preferably 65%–75% cacao)1cup (2 sticks) unsalted butter1⅔cups (235 g) all-purpose flour1tsp. (5 g) baking soda⅓cup (38 g) Dutch-processed cocoa powder¾cup (170 g; packed) dark brown sugar¼cup (50 g) granulated sugar1½tsp. (6 g) kosher salt1Tbsp. (22 g) vanilla paste or extractPreparationStep 1Your 2 large eggs need to be at room temperature for this recipe. If they aren’t, put them in a small bowl and cover them with hot tap water. This’ll bring them up to speed quickly.→  Here's our guide for bringing eggs, butter, and dairy to room temp.Step 2Coarsely chop four 2-oz. chocolate bars. You want them to be bigger than normal chocolate chips (aim for 3–4 times the size)—this creates the chocolate puddles. Set aside. Chop remaining 2-oz. chocolate bar into 20-ish pieces (you’re going to place one or two pieces atop each cookie).Step 3Cut 2 sticks unsalted butter into large pieces. Cook in a medium saucepan over medium-low heat, stirring often, until it foams, then browns, 7–9 minutes. (Watch carefully since browned butter goes from brown to black in the blink of an eye.) Immediately scrape into a large bowl and let cool slightly, about 5 minutes.Step 4While butter cools, whisk 1⅔ cups all-purpose flour and 1 tsp. baking soda in a medium bowl to combine. Press ⅓ cup cocoa powder through a fine-mesh sieve into bowl (this eliminates those pesky lumps), then whisk again to combine.Step 5Add ¾ cup brown sugar, ¼ cup granulated sugar, and 1½ tsp. kosher salt to browned butter. Using a wooden spoon or rubber spatula, stir vigorously to combine. Add 1 large egg and whisk vigorously until incorporated, about 1 minute. Repeat with remaining 1 large egg, then whisk in 1 Tbsp. vanilla paste.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Switch back to your spatula or spoon to stir in dry ingredients just to combine. Mix in the 4 chopped chocolate bars you set aside. Let dough sit at room temperature at least 1 hour to let flour and cocoa hydrate. The dough will thicken as it sits.Step 7Place a rack in middle of oven; preheat to 375°. Line 2 baking sheets with parchment paper. Shape dough into ping-pong sized balls (about 3 Tbsp.). Arrange on prepared baking sheets, spacing about 3\" apart. Lightly press a chunk or two of remaining chocolate on top of each dough ball.Step 8Bake cookies, rotating pans top to bottom and front to back halfway through, until edges are just set but centers are still soft, 8–10 minutes. Remove from oven and carefully tap pan on stovetop to deflate and flatten cookies. Let cool on baking sheets 10 minutes, then transfer to a wire rack and let cool completely.Step 9Transfer cookies to a platter. Serve and enjoy!Step 10Do Ahead: Dough can be made 3 days ahead; cover and chill. Let dough come to room temperature before baking.How would you rate Obscenely Chocolatey Chocolate Cookies?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleUncomplicated and delicious. It’s no joke about the brown butter though! You gotta watch that sh!r or yer f@cked and burnt. I’ll definitely make these again. Thank you for the great cookie recipe!Hugh Jass Hyattsville, Maryland 1/16/2022Decadent chocolate cookie-- well balanced and perfect for the chocolate lovers in your life. The taste is not sugar forward, it's definitely all about the chocolate. \n\nI followed recipe exactly with the exception of vanilla paste (I used extract) and I did not top with chocolate (completely forgot). I read reviews about the cookies being very large, so I went with 2 tablespoons instead of 3. This worked out well, and I got about 19 cookies from the batch, cooked at 8-9 minutes per sheet. When I make this again, I will be chopping the chocolate a bit smaller to scale with the smaller cookie size. AnonymousRichmond, Virginia12/23/2021Loved these. Used Guittard disks and Askinosie cocoa powder. Followed instructions exactly and they were outstanding. Will absolutely make again. CKNew York City12/20/2021Great recipe! I did try adding fingers with dark blue polish which another reviewer suggested.  I found it added too much crunch and the polish chips were unpalatable.AnonymousSeattle 9/28/2021I give these to friends at Christmas time and get remarks days later on how good they are. The passion of the recipe creator for their work shows in the layered flavors of yum! \n\nP.S. B.A., some blue nail polish on the cook's hands featured in the video demo would have been a nice touch.AnonymousPrescott, Arizona9/12/2021Some of my all time favorite cookies. Perfect chocolate balance. Save extra dough in the fridge for a couple days so you can tear off a couple chunks to have fresh cookies at any time. I use sweeter chocolate because it's what I have, and it's still great. Must make!AnonymousArizona4/22/2021For a sophisticated, brownie-like cookie, these are extremely good.  I followed another Commentor's advice and cut back the salt in the dough by 1/3 and added Maldon flaky salt on top.  And as suggested, I refrigerated the dough for an hour or so. From trial and error, salting them when they are fresh from the oven worked best.  Otherwise I followed the recipe as is.  Next time I would make smaller cookies. And I'd also like to see the difference with just letting the dough rest at room temp as the recipe called for.  These were quick thick out of the oven.  So we banged the pan a couple of times on the stove.  EllenLLong Island, NY12/27/2020Some of the best cookies ever.MLBrooklyn, NY12/25/2020These are SO good. Made according to recipe-- rich, multi-layered chocolate flavor ... I used 1 60% ghiradelli and 1 70% ghiradelli bar. Chocolate flavor develops in the mouth after your first bite, so so good and not too sweet! Looks just like picture, too! A new favorite cookie.AnonymousHouston, TX12/14/2020Please provide a button to print the recipes!\nJeannieSan Antonio12/14/2020Sorry, folks: I intensely dislike undercooked, gooey chewy cookies: I much prefer a good crisp cookie, with only a few rare exceptions....WillCanada12/12/2020We made these exactly as written and they were delicious. They had the texture of a chewy brownie with gooey pockets of chocolate. The brown butter flavor really came through and I really liked the salt level as well. Anonymous8/23/2020I'm a real nit when it comes to quality food and this recipe makes divine cookies- probably the best I've ever made.  I think the key to quality are the ingredients- I used dark chocolate from France that a friend gave me and then  \"black cocoa\" from King Arthur.  I also used fresh vanilla pods and organic unrefined cane sugar.  I used organic butter and eggs as well. Finally, I burned my first batch of butter (by the odor), but then made the second brown butter as expected. The key there was the aroma. The moment it starts to smell sweet and turns caramel color, REMOVE from heat ASAP.   I opted not to use the chocolate bits on top because I found it unnecessary.  Also, I live in Colorado and general baking at 6,000 feet requires adjustments but it's hard to tell what's needed until I see how a sample set bakes.  To my delight, no adjustments were needed.  I baked for 8mins exactly and didn't turn the pan during baking. They turned out just divine.  I will keep this recipe!  There's a famous dessert bar in Denver called DBar with celebrity chef Keegan Gerhard and these cookies are just as good as their's. AnonymousDenver7/29/2020I baked these and they turned out well! I burned the edges a bit so that was on me. The cookies have very cakey texture like the previous comments mentioned - tad bit on the dry side for me but that could be because I baked them for a bit too long. They aren't too sweet which I really enjoy!minpanisaraFrom Thailand, Living in VA6/20/2020Super good cookies! Some reviews mention that they \"aren't that sweet,\" but that just means they aren't hyper-sugary like a lot of other American desserts. They still satisfy my sweet tooth for sure!AnonymousWisconsin, USA5/23/2020Explore Bon AppétitCookieDessertAmericanChocolateOther IngredientsCocoaEasySnackNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-08", "author": ["Condé Nast", "Rick Martinez"]}