{"id": "27afaa5b4b6ee9faf033a2a67d21d954", "url": "https://www.bonappetit.com/recipe/coffee-and-armagnac-roasted-duck-breast", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Coffee and Armagnac Roasted Duck Breast Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDCoffee and Armagnac Roasted Duck BreastSponsored by NespressoFacebookPinterestTwitterEmailCAVANAUGH2 servingsBreak out the Nespresso Master Origin Colombia coffee and the brandy, we’ve got a duck breast to roast. Chef Daniel Rose served this flavor-packed entrée at our Paris in New York dinner.PrintIngredients1 duck breast, with fat cap attached⅔ cup brewed and cooled Nespresso Master Origin Colombia coffee⅓ cup Armagnac12 prunes, pitted1 strip lemon peel1 whole clove1 bay leaf1 bunch thyme2 cinnamon sticks6 peppercorns1 garlic cloveRecipe PreparationScore the fat on the duck in a crosshatch pattern, being careful to only cut through the fat and not the meat.Put the duck breast, prunes, spices, Nespresso coffee, and Armagnac into a plastic re-sealable bag and refrigerate for up to 24 hours, turning occasionally to make sure duck marinates evenly. Remove the duck breast, pat very dry. Place the duck fat side up on a tray and transfer to refrigerator to chill and dry out for 24 hours.Remove the duck and set aside. Strain out the spices and prunes, saving the marinating liquid. Combine the prunes and the marinade in a small sauce pan and bring to a simmer. Simmer for 3-4 minutes until the liquid is syrupy and coats the prunes.Season the duck breast with salt and pepper. Lay fat side down in a cold pan and bring to medium heat. Once nicely colored and a lot of the fat has rendered out, turn the breast over and cook for 2-3 minutes. Remove the breast from the heat and leave to rest before slicing and serving with the warm prunes.Recipe by chef Daniel RoseSponsored by NespressoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}