{"id": "27b46e008875ee3b92a0062a78bece8a", "url": "https://www.bonappetit.com/story/stephanie-shih-ceramist", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "For Ceramist Stephanie Shih, There's No Such Thing as Art Without Activism | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor Ceramist Stephanie H. Shih, There’s No Such Thing as Art Without ActivismThe artist talks black vinegar, working with clay, and sustainable mutual aid.By Leah BhabhaApril 1, 2021FacebookTwitterEmailPhoto by Guillaume ZiccarelliFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Stephanie H. Shih, a Brooklyn-based ceramist who explores Asian American identity through clay interpretations of grocery items.As my workday draws to a close, Stephanie H. Shih’s is just beginning. While we chat, the ceramist is hard at work in her Brooklyn home studio, creating exquisitely detailed sculptures of pantry items. These life-size painted clay Sriracha bottles, Pocky cartons, soy sauce gallons, and instant ramen are part of a series Shih conceived in 2018 called Oriental Grocery, to explore nostalgic foods of the Chinese American diaspora. Shih had been working as a copywriter but started throwing clay as a form of therapy to manage a chronic pain issue. A year later, her ceramics practice had become a full-time endeavor.The project began with hand-folded dumplings; rolled and pleated like the real thing but crafted in creamy porcelain. From there, she moved on to Chinkiang black vinegar, the acidic component in a traditional Chinese dumpling sauce. Posting an image of the yellow-labeled bottle on Instagram immediately struck a chord. “People within the Chinese American diaspora responded to it so strongly because it’s a pretty iconic ingredient within our cuisine,” Shih recalls. “Black vinegar was the piece that really got me thinking about this idea of shared experience and shared nostalgia.”Photograph by Robert BredvadShih is quick to point out that her work is not solely about her own childhood. Instead, she says, it centers around a sense of community based upon mutual experiences growing up. What once had felt personal or private—in this case, cuisine—was in fact shared by so many others. In the three years since she started working on Oriental Grocery, Shih has cultivated an avid audience. She draws on her followers’ memories to crowdsource ingredients central to the Asian American culinary identity, with an emphasis on what she calls “everyday foods.” In July, she’ll open a solo show at Stanley’s in Los Angeles focused on Western groceries that have taken on significance in East Asian cuisines as a result of colonization and military presence, like Spam, Libby’s corned beef, and Vienna Sausages.Here, Shih chats about the ways social justice weaves through her life and work, her favorite political podcast, and what she’s cooking these days.I want my activism and my art… to be one entity. I think this recent surge in mutual aid and activism and donating money is really great, but the only way to sustain our communities is to make those practices part of our everyday lives. I use my art throughout the year to raise money for causes and my audience now knows that’s a really important part of my practice, they know that I don’t really separate the two.Right now I’m excited about a new partnership… with Tyler Steinbrenner of Anti-Conquest Bread Co. Our project, called ACQ Flour Bank, is going to be a way for artists to donate works, which will then be raffled off to provide food for those experiencing food insecurity. Tyler and I share this ethos: that we want mutual aid and community care to be something that is ingrained in every part of our lives—and we want to offer an example of how that can be possible.Working with clay is soothing… and meditative. I love the tactility of the medium—it feels very intuitive to me and I’ve found it to be the best route for connecting what’s in my brain to what’s in my hand.Groceries are intimate because… they are everyday objects that we bring into our homes. We live with them and then use them to feed our loved ones. It’s akin to how before the pandemic, a lot of people didn’t necessarily think about the importance of grocery workers. But since then they’ve become “essential workers”: people who are critical to our survival.Photograph by Robert BredvadFor a lot of second-generation Americans exploring their identity… and their relationship to their identity, food definitely becomes that first tangible connection they have to the culture of their parents. That’s where these conversations about authenticity with cuisine come in, because it’s a very sensitive and sentimental topic for so many people.I love cooking but… it isn’t a luxury I have time for right now, so I just make the same pan-seared pork chops with citrus dressing over and over again. I’m getting ready for a solo show this summer and so I’m spending as much time as possible making work.I keep an unconventional work schedule… because my ceramics studio is in my apartment. Right now, I’m sculpting through the night until sunrise and then I go to bed and wake up halfway through the afternoon. A lot of people feel smothered by their work when they either choose to work from home or are forced to, but for me it’s changed my practice in a way that’s been really fulfilling.While working I listen to… a podcast about Asian identity called Time to Say Goodbye. I need a very large volume of podcasts to keep me company. Something audio-based is the easiest way for me to consume both news analysis and thoughts on identity.Explore Bon AppétitPerson of InterestHealthyishAsianInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-01", "author": ["Condé Nast", "Leah Bhabha"]}