{"id": "27bcc243a97c74318c4feb8b258e84ab", "url": "https://www.bonappetit.com/recipe/steak-salad-with-shallot-vinaigrette", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Steak Salad with Shallot Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSteak Salad with Shallot VinaigretteBy Claire SaffitzSeptember 16, 20184.9(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintCrusty, juicy sliced steak + a fully-loaded salad = what we want to eat most nights of the week, TBH. If searing a steak to perfect medium-rare makes you nervous, we get it! It takes practice, and even seasoned cooks can have a hard time divining the doneness of meat. Our advice? Invest in a decent quality instant-read thermometer to help take the guesswork out of the equation. As for that zippy shallot vinaigrette, do yourself a favor and make a double batch—it'll keep for a week, and is a great dressing for simple salads, grain bowls, and all kinds of cooked meats. This recipe is a part of the Basically 10x10, a collection of ten essential, no-fail recipes that every home cook should have in their arsenal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketPaper Towels$13.45 At AmazonPlate$55 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonWhisk$10 At AmazonPlatter$29 At AmazonCast Iron Skillet$30 At AmazonTongs$13 At AmazonInstant-Read Thermometer$35 At ThermoworksSpoon$24.69 At AmazonIngredients2 servings as a big dinner or 4 as a light lunch11½\"-thick boneless New York strip steak (about 12 oz.)Kosher saltFreshly ground black pepper1small shallot1Tbsp. Dijon mustard1Tbsp. red wine vinegar6Tbsp. extra-virgin olive oil, divided1pint cherry tomatoes2Persian cucumbers1head of butter lettuce2Tbsp. unsalted butter2sprigs thyme1ripe avocadoPreparationStep 1Pat steak dry with paper towels and place on a clean plate. Season very generously all over with salt and pepper. (Think four-fingered pinches of salt—rich proteins like steak need a lot more salt than you might think.) Let it sit at room temperature while you prep your other salad components, at least an hour if possible. (Don't worry: It's safe, and a room-temperature steak will cook more evenly than it will straight out of the fridge.)Step 2Salad dressing time! Peel and finely chop 1 shallot and transfer to a medium bowl. Add 1 Tbsp. mustard and 1 Tbsp. vinegar and whisk to combine. Here comes the fun part: Whisking constantly, slowly stream in 5 Tbsp. olive oil until dressing is thick and emulsified. The word \"slowly\" is key here—if you add the oil all at once, you won't get the creamy, nicely-incorporated vinaigrette you're after. Whisk in 1 Tbsp. water to thin the dressing out a bit. Season with salt to taste, and add another splash of vinegar if you like—it should taste good and punchy.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Prep your other salad ingredients. Slice 1 pint cherry tomatoes in half and transfer to a medium bowl. Slice 2 cucumbers into thin coins and transfer to bowl with tomatoes. Separate lettuce leaves and arrange on a large platter. Cover the lettuce with damp paper towels and chill in the fridge until you’re ready to assemble.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Heat a dry cast-iron skillet over medium-high. Pat steak dry again (the salt will have drawn out some moisture). Seriously: You want the meat to be as dry as possible, which is key to getting the handsome, crusty sear you're after. Rub steak with remaining 1 Tbsp. oil. When we're searing things like steak or chops, we like to oil the surface of the meat rather than the surface of the pan—this allows us to use less oil, and also cuts down on (the inevitable) smoke that comes with this kind of cooking. Speaking of which, this is a good time to turn on the vent above your stove, open a window, and/or get ready to (temporarily!!) deactivate your smoke detector .Step 5Using tongs, gently lay steak in preheated pan. Cook undisturbed—as in, resist the urge to futz with it!—until a golden brown crust forms, about 3 minutes. Turn steak and cook on second side for another 3 minutes.Step 6Turn steak to sear around thinner sides and fat cap until browned, then continue to cook 1 minute per side until steak is medium-rare in the center, 3–5 minutes longer. If you have an instant-read thermometer and you’re uncertain about doneness, insert it into the center of the steak and look for a reading of 120–125°. Continue to cook until you get there.Step 7Remove skillet from heat. Transfer steak to cutting board briefly to rest. Wipe out skillet with a paper towel to remove any blackened oil. Let skillet cool 1–2 minutes, then heat over medium-low. Have a spoon close at hand. Return steak to skillet. Add 2 Tbsp. butter and 2 sprigs thyme and tilt skillet toward you so butter foams and pools along one side. Make sure thyme is swimming in the butter so it can really infuse. Use spoon to scoop up foamy butter and baste over top of steak constantly until butter is fragrant and browned, about 1 minute. Transfer steak to cutting board. It should rest at least 10 minutes—you never want to cut into a steak without resting first, otherwise it will lose a lot of juiciness.Step 8Build your salad: Remove platter of lettuce from refrigerator; season with salt and pepper. (We always like to season our greens before we dress them.) Whisk dressing to combine and drizzle about half over lettuce.Step 9Season tomatoes and cucumbers with salt and pepper. (In case you haven't noticed by now, making sure to season all of your components is key.) Toss with a couple of tablespoons of dressing and arrange in a row along one side of lettuce.Step 10Halve 1 avocado, remove pit, and thinly slice. Fan out slices and arrange over top of lettuce in another row opposite tomatoes and cukes.Step 11Once steak has rested, thinly slice crosswise and shingle slices down across middle of platter. Season steak and avocado with more salt and pepper, then drizzle remaining dressing over avocado and steak. So fancy!How would you rate Steak Salad with Shallot Vinaigrette?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI made this last Christmas and my family insists on it for every holiday now. \n\nThe vinaigrette is a star all on its own and is my go-to for regular weekday salads. \n\nMakes for great leftovers if you aren’t cooking for a crowd. Edith B. Providence, Rhode Island3/26/2022Followec the recipe to a T, except that my store was out of heads of butter lettuce, so I used a bagged mix of butter & red leaf.  Turned out great!  This one is going in the regular rotation.  Next up:  No Fail Roasted Chicken with Garlic & Lemon.JbdwColumbus, Ohio2/28/2021Can you make extra vinergret, can you store it in a ball jar and shake gently or does it have to be made everytime Anonymous8/14/2020Really really goodAnonymousSan Francisco 8/4/2020Loved it! Absolutely loved the recipe, its a must try!AnonymousDenver8/1/2020This salad was delicious, particularly the vinaigrette and the butter/thyme basting at the end.  So much flavour and love that I have a good low carb dinner option.Anonymous7/23/2019The steak and salad instructions are fairly straightforward/stuff I already knew, but I am leaving this comment explicitly to praise this vinaigrette recipe to the HIGH HEAVENS. I have now shared it with basically everyone I know - it’s perfect. I recommend adding some creamy feta and home-pickled red onions to bring the salad up a notch.AnonymousVancouver, BC6/9/2019This was the bomb diggity. Lovely vinaigrette but also worked for my well done-ranch loving husband. I had it as specified and it was fantastic!ElkrusePortland, or4/8/2019This salad was good but it was not special, it was just kind of deeply meh. So much rides on the vinaigrette and I just didn't think it was flavorful enough. I kept thinking that tossing the veggies with a little salad dressing + lime juice or lemon- something else- would have been nice. Maybe adding in another veggies? Just something else. mhdsileskyAustin, TX4/3/2019This salad looks awesome. Can't wait to try it and I'm sure it will be delicious.\n\nI'm using this platform because I don't know how else to communicate my extreme frustration with your newish format. I am an experienced cook and just want the recipe, not all the photos of equipment, etc. Totally unnecessary and annoying. Please change this as it makes it very difficult and time-consuming to copy and save recipes from your site. I have read many other complaints on your site about this. Please change!! Thank you!sesdaJacksonville, FL2/1/2019This is seriously awesome - my partner and I are going to make the vinaigrette tomorrow to have with jacket potatoes and sour cream! Will add this to our weekly repertoire for sure ❤️Sala1106Australia10/23/2018This was phenomenal. New favorite healthy way to curb that steak craving. Direct quote from boyfriend, “hands down the best salad I’ve ever had.” rdh4150Bonn, Germany9/24/2018I really like this, i would make this again. Husband not a salad fan but he like it too. Made garlic toast to go with this. YUM  maggy61962Virginia9/23/2018It good ¯\\_(ツ)_/¯AnonymousToronto9/23/2018Fantastic flavors all the way around.  Will definitely be make this one over and over.Tjmorrison2St. Louis 9/21/2018Explore Bon AppétitSaladAmericanSteakBeefMeatAvocadoVegetableCherry TomatoTomatoLettuceLeafy GreensShallotSummerWeeknight MealsQuickEasyMainGluten-FreeSearLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-16", "author": ["Condé Nast", "Claire Saffitz"]}