{"id": "27cb8ce03ee968ba9565e26f75d2bf91", "url": "https://www.bonappetit.com/recipe/escarole-caesar-with-sardines-and-hazelnuts", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "Escarole Caesar With Sardines and Hazelnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueEscarole Caesar With Sardines and HazelnutsBy Molly BazMarch 30, 20204.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Pearl Jones, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintWhen looking for a sustainable fish option, go for lower-on-the-food-chain guys like sardines. They’re in their full glory in this umami-packed twist on Caesar.Ingredients4 servings½cup blanched hazelnuts13.75-oz. can sardines, drained1garlic clove, finely grated2Tbsp. fresh lemon juice1tsp. Dijon mustard½tsp. freshly ground black pepper, plus more1½oz. Piave cheese or Parmesan, divided½cup mayonnaise2Tbsp. extra-virgin olive oilKosher salt1large head or 2 small heads of escarole (about 1½ lb.), wilted outer leaves removed, inner leaves torn into large piecesLemon wedges (for serving)PreparationStep 1Preheat oven to 325°. Toast hazelnuts on a rimmed baking sheet until deep golden brown, 12–15 minutes. Let cool, then crush or coarsely chop.Step 2Open each sardine with the tip of a paring knife, prying the fillets apart. Remove any bones. Finely chop 2 sardines and transfer to a large bowl. Add garlic, lemon juice, mustard, and ½ tsp. pepper and whisk to combine. Finely grate 1 oz. Piave (about two-thirds) into bowl and add mayonnaise and oil; whisk to combine. Season dressing with salt.Step 3Add escarole and three-fourths of hazelnuts to bowl with dressing and toss well to coat; season with salt and pepper.Step 4Divide salad among plates, top with remaining hazelnuts. Shave remaining ½ oz. Piave over and break remaining sardines into smaller pieces and scatter on top. Serve with lemon wedges for squeezing over.How would you rate Escarole Caesar With Sardines and Hazelnuts?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSuper yummy! It was a bit overdressed so I think I'd use more escarole next time or add the dressing as needed to the escarole, rather than mixing in the same bowl that we made the dressing it. isabellecooks965/8/2020This is a great basic salad recipe to riff on! I didn't have sardines or escarole so I used anchovies and romaine for a classic caesar. I found that 1/3 cup of mayo was more than enough for the salad dressing.  Great for using homemade croutons if you have some stale bread lying around!AnonymousWorcester,MA4/4/2020Everything Molly creates is delish!! I love salads and sardines and never thought about combining those 2 in a delicious dish! gutierrezja4/3/2020This was really good. I didn’t have any hazelnuts so I used walnuts, but I think next time I’ll skip nuts and add croutons for crunch. NYC4/2/2020Explore Bon AppétitSaladEscaroleChicoryLeafy GreensVegetableSardineFishSeafoodHazelnutNutFallEasyWeeknight MealsMainSideGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-30", "author": ["Condé Nast", "Molly Baz"]}