{"id": "282431778d440b5326df8daae89d7c58", "url": "https://www.bonappetit.com/recipe/tomato-and-parmesan-risotto", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Tomato and Parmesan Risotto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueTomato and Parmesan RisottoBy Andy BaraghaniJuly 9, 20194.7(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintUse the smallest tomatoes you can find at the market for this risotto recipe. They’ll be extra sweet and have thin skins.Ingredients4 servings5cups low-sodium chicken broth2Tbsp. extra-virgin olive oil, plus more for drizzling1medium onion, finely chopped3garlic cloves, thinly sliced1Tbsp. tomato paste2cups cherry tomatoes¼tsp. freshly grated nutmeg (optional)1cup arborio or carnaroli riceKosher salt2Tbsp. unsalted butter2oz. finely grated Parmesan (about 1 cup), plus more shaved for servingFreshly ground black pepperPreparationStep 1Bring broth to a simmer in a medium saucepan; keep warm over medium-low heat until ready to use.Step 2Meanwhile, heat 2 Tbsp. oil in a large saucepan over medium. Add onion and cook, stirring often, until golden and very soft, 8–10 minutes. Add garlic and cook, stirring, until softened, about 1 minute. Add tomato paste and cook, stirring often, until it darkens slightly and begins to stick to pan, about 2 minutes. Add tomatoes and nutmeg, if using, and cook, stirring occasionally, until some of the tomatoes begin to burst, about 2 minutes.Step 3Stir in rice; season with salt, and reduce heat to medium-low. Cook, stirring, until some grains are translucent, about 3 minutes. Ladle in 2 cups broth and simmer, stirring frequently, until completely absorbed, 8–10 minutes. Ladle in another 2 cups broth and continue to cook, stirring frequently, until rice is cooked through and most of the broth is absorbed, 12–15 minutes.Step 4Add butter, 2 oz. Parmesan, and remaining 1 cup broth and cook, stirring constantly, until risotto is very creamy looking, about 4 minutes. Taste and season with more salt if needed. Divide risotto among bowls. Top with shaved Parmesan and lots of pepper and drizzle with more oil.How would you rate Tomato and Parmesan Risotto?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleDelicious, great pops of flavor! The only thing that bugged me, and admittedly is something I should have considered, is that a lot of my broth steamed off while it was warming (over very low heat) so I didn't have the final cup in the last step (subbed in water w/ some melted butter and a splash of wine-- worked fine). Definitely will make this one again, but maybe add a little drizzle of broccoli rabe pesto or something JenNY NY1/23/2022Very tasty! I didn't have tomato paste so i used 2/3 tablespoons of tomato passata after cooking the onion and garlic (and let it reduce before adding the rice). I also added a rosemary twig at this point, which I removed later. Worked great!Lívia BadianiBrazil10/31/2021Not at all what was expected. Light, delicate, not tomatoy, just surprised pop of fresh tomato flavor when little tomato hidden in the bite of rice.\nRisotto sometimes sounds too hot on a hot summer day but this was refreshing instead AnonymousTexas9/15/2021This was great. Easy but full of flavour. The cheese seems to be key to getting such creaminess.JulianSydney, Australia6/27/2021This was really delicious - I ate half of it standing at my kitchen counter. I followed the recipe, omitting the nutmeg. I ordered more tomatoes so I can make this again next week. Topped with shaved parm, pepper, and flaky Maldon.Pony RemarkPennsylvania 3/8/2021Loved it. The sweetness of the tomatoes is ridiculously delicious with the savoriness of the parmigiana. Eileen WOklahoma1/23/2021Typically Italian; simple ingredients combined for an explosion of flavor.  Love that it is a recipe that can be made without a trip to the store.AnonymousCalifornia 9/28/2020A-M-A-Z-I-N-G recipe! I made a chicken stock on the side by just boiling then simmering a chicken leg with water, onion, garlic and herbs for three-four hours and topped risotto with a balsamic drizzle and seared scallops.sdemeloCanada5/29/2020Delicious, and full of flavor. I added a little bit of ancho chili powder and ground cayenne and it added just the tiniest kick. It’s parmy,acidic,salty and rich. Nick KressCincinnati, Ohio5/29/2020Umm this recipe is not complete. There is nothing in the ingredients list that tells you how much garlic to add. So how much did you add?AnonymousTexas5/17/2020Delicious!!!! As time consuming risotto is, this full-flavoured hearty dish is worth it. AnonymousBrisbane, Australia1/23/2020This recipe is incredible!! I'm sooo impatient and didn't realize how long risotto takes. Totally worth it. Wish the recipe yielded more so I could eat it all week long, but my husband gobbled it all up in two meals. AnonymousLos Angeles10/1/2019Delicious! Just as I was wondering why I hadn't seen a tomato risotto, Andy saved the day. Risotto can usually be quite neutral but this one is loaded with flavor. It's a shame I've only made it for myself AnonymousHouston8/25/2019Bellissima! Used Swiss Bouillon for the broth instead of chicken (lazy + veg) - took slightly longer to reduce but otherwise as per recipe above. A go-to risotto. macaulaysulkinSheffield, UK8/21/2019Super super good, but needed tons of lemons for brightness.8/19/2019Explore Bon AppétitRisottoItalianEuropeanCherry TomatoTomatoVegetableParmesanCheeseRiceRice & GrainsSummerEasyWeeknight MealsMainGluten-FreeNut-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}