{"id": "2824a6fd4fb6e4ffab38977e1e99e95f", "url": "https://www.bonappetit.com/story/exhale-wellness-app", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "EXHALE Means There's Finally a Wellness App for Women of Color | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingFinally, a Wellness App for Women of ColorNone of the wellness apps I’d come across seemed made for me. Then I found Exhale.By Devyn BeswickJune 29, 2021FacebookTwitterEmailPhoto courtesy of ExhaleFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!I had just about given up on wellness apps when I stumbled upon Exhale, a wellness app for BIWOC (Black, Indigenous, Women of Color). Like many others, I’d fallen into the cycle of downloading and deleting one app after the next. None of them resonated the way I had hoped. None of them seemed capable of addressing the anxiety and stress that I experience as a Black woman. The wellness apps I’d come across until then existed within a whitewashed vacuum that I could not breathe in.When I first opened the Exhale app, I was struck by the tenderness portrayed in the photos of a Black woman with tight coils that crowned her head, submerged in a body of water seemingly filled with milk and honey. For the first time in my emotional well-being journey, I saw myself reflected in these images and the narrative they presented of what healing looks like. The app is broken up into five categories: breathe, affirm, meditate, imagine and listen. Each component invites you to reset and recharge through guided meditations and breathing techniques.I quickly found myself revisiting meditations again and again because they opened something within me that I wanted to keep feeling: peace. I began moving through my days differently, more conscientious of the world around me, its weight, and how I carry that in my body. An alarming number of BIWOC experience microaggressions daily, but many of us are unable to stop and process how we feel and instead must swallow the emotions that may arise. The microaggression meditation invites us to pause and feel the impact of those incidents, easing the stress that can result from harboring emotional pain. The meditation encourages the listener to pause and release any trauma that we are holding on to as a result of everyday harms. It’s helped teach me that we must prioritize the peace and healing we so deserve.Katara McCarty, the founder of Exhale, told me her mission is to create much-needed space for the Black community to rest. We chatted only a few days after the shooting deaths of Daunte Wright and Adam Toledo, all while Derek Chauvin was on trial for the murder of George Floyd. At that moment we were just two Black women, leaning on each another (from a distance) and reminding the other that the Movement for Black Lives is not sustainable if we do not prioritize our mental health.“White supremacist ideology and systemic racism is not set up to allow us to rest,” McCarty says. “It’s not that Black people don’t want to rest, it’s that systems have been created for us to not have that space.”I think of healing as a journey home to oneself, and Exhale captures that effortlessly. And it helps make one thing clear: Our ability to breathe is not to be taken for granted.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingTechnologyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-24", "author": ["Condé Nast", "Devyn Beswick"]}