{"id": "282a485c8359bc69c098bd08def1d9b1", "url": "https://www.bonappetit.com/story/splatter-screen", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "This Splatter Screen Means a Quicker Cleanup and Crispier Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOil Splatters Were My Biggest Kitchen Nemesis—Until I Bought This ToolMy splatter screen lets me fry without fearBy Emma WartzmanMay 4, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Much to my mother’s dismay, I turned into a clean cook only after I moved out of her house. My timing might not have been to her liking, but I did belatedly inherit her penchant for a spotless workplace. I wash dishes and put away ingredients as I go. I employ a trash bowl to keep scraps contained. And when I’m done with a meal, I like my whole kitchen lick-the-counter sparkling clean.It should then come as no surprise that oil splatter from the high heat of the stovetop is the bane of my existence. It gets everywhere, from the nooks to the crannies, and is an absolute pain to wipe up. I lived with this problem for years, begrudgingly lifting up burner grates and scrubbing behind nearby appliances after frying eggs for breakfast and crisping the skin on chicken thighs for dinner. Turns out, the fix was a mere $15 away: a splatter screen.At 13 inches in diameter, this handy tool is so beautifully simple. It rests on top of nearly any size pan—from my small nonstick to my big old cast iron—and once it’s in place, oil stays neatly within the confines of the pan.You see, any cook worth their salt knows that you often need a decent amount of fat to end up with delicious, balanced food. But it’s not just that fat is tasty. It’s also the mechanism that carries heat for even cooking (this is one of the many great lessons Samin Nosrat imparts in Salt, Fat, Acid, Heat—and if you haven’t already read it, get on it). A big flame and a good slick of fat are the keys to charring green beans, searing a perfect steak, and stir-frying a pile of vegetables. But with that magic combo, you inevitably end up in splatter city.A pot lid, of course, would work to contain the splashes and sloshes, but it would ruin your food by trapping steam inside the pan. Moisture is the enemy of crispiness, so even if you started with shimmering hot oil, you’d be left with soggy fritters, lackluster pan-fried potatoes, and rubbery short ribs. The splatter screen, on the other hand, has fine mesh holes big enough to allow steam to escape, but small enough that oil doesn’t stand a chance of going anywhere.When all is said and done, the only mess is on the screen itself—and that can go straight into the dishwasher, an easy cleanup if I’ve ever seen one.Photo by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieOpen Kitchen Splatter Screen$18 $14 at William SonomaExplore Bon AppétitShoppingHighly RecommendToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-04", "author": ["Condé Nast", "Emma Wartzman"]}