{"id": "282e8a2628f38e786a41c5333f26a249", "url": "https://www.bonappetit.com/recipe/life-of-the-party-layer-cake", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Life-of-the-Party Layer Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueLife-of-the-Party Layer CakeBy Amirah KassemDecember 1, 20204.5(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Joshua Kissi, food styling by Roscoe Betsill, prop Styling by Amy Wilson, cake by Flour ShopEmailPinterestPrintEmailPinterestPrintFrom the always-sunny brain of Flour Shop’s Amirah Kassem, this colorful, festive cake with a surprise filling is about as celebratory as it gets. If you don’t have or want to invest in six 6\" pans, you can bake layers in batches two at a time. Let pans cool before cleaning and preparing with fresh parchment between batches.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFat Daddio's 6\" Cake Pan$8 At AmazonChefmaster Liqua-Gel Starter Set$16 At AmazonWilton Decorating Turntable$9 At TargetSmall Offset Spatula$6 At AmazonAteco Bowl Scraper$3 At AmazonSpatula$12.99 At Amazon2\" Circle Cutter$10 At AmazonIngredients8 ServingsCakeNonstick cooking oil spray2⅔cups (335 g) all-purpose flour1Tbsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1½cups (300 g) granulated sugar¾cup (1½ sticks) unsalted butter, room temperature3large eggs1⅓cups whole milk1Tbsp. vanilla extractOrange, green, yellow, red, pink, and black food coloringFrosting and assembly1cup (2 sticks) unsalted butter, room temperature28-oz. packages chilled cream cheese, cut into pieces1Tbsp. vanilla extract2lb. (907 g) powdered sugar2Tbsp. fresh lemon juice½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltYellow, orange, green, red, and black food coloring1½cups sprinkles, chocolate disks, dried fruits, candied citrus peel, and/or candied nuts (for filling)Special equipmentSix 6\" cake pans, a 2\" ring cutter, a pastry bag fitted with a medium round tip, and a cake scraperPreparationCakeStep 1Place a rack in middle of oven; preheat to 350°. Lightly coat pans with nonstick spray. Line bottom of each pan with a parchment paper round. Lightly coat parchment with nonstick spray. Whisk flour, baking powder, and salt in a medium bowl. Using an electric mixer on medium speed, beat sugar and butter in a large bowl, scraping down sides of bowl as needed, until pale and fluffy, about 3 minutes. Add eggs one at a time, beating well and scraping down sides of bowl after each addition.Step 2Combine milk and vanilla in a measuring glass. Reduce speed to low; beat in dry ingredients in 3 additions, alternating with milk mixture in 2 additions, mixing well after each addition. Divide batter evenly among 6 small bowls (if using a scale, about 200 g each).Step 3Color batter in each bowl with orange, green, yellow, red, pink, and black food coloring, adding and stirring in until you reach desired hue. Scrape a color of batter into each prepared pan; smooth surface. Bake cakes, rotating pans halfway through if browning too much in one spot, until tops spring back when very gently pressed and a tester inserted in the center comes out clean (go all the way to the bottom), 16–20 minutes. Transfer pans to wire racks and let cakes cool in pans 10 minutes. Run a small knife or offset spatula around inside of pans to loosen cakes, then turn out onto racks. Remove parchment and let cool completely (keep upside down).ChevronChevronFrosting and AssemblyStep 4Using clean beaters, beat butter on medium speed in a large bowl until smooth. Add cream cheese a few pieces at a time, beating until smooth. Beat in vanilla, then reduce speed to low and add powdered sugar a little at a time, beating until smooth. Mix in lemon juice and salt. Scoop 1 cup frosting into a small bowl; set aside. Add a few drops yellow food coloring to frosting in large bowl and stir well; add more until you reach desired hue.Step 5Turn cakes over. Using ring cutter, punch out a hole in center of each cake except orange cake. Place half of yellow frosting in piping bag (a resealable bag with a corner cut off also will work). Pipe a circle of frosting onto a plate or cake stand. Place black cake on top and pipe several rings of frosting on top of cake. Stack pink cake on top, lining up center holes, and pipe several rings of frosting on top. Repeat with red, yellow, and green cakes. ChevronChevronStep 6Add desired fillings to center of cake. Place orange cake on top to close. Frost outside of cake in an even layer. (It doesn’t need to be perfect; this is just to trap all the loose bits of cake so the next layer will be more even.) Chill, uncovered, until frosting is firm, about 1 hour.ChevronChevronStep 7Coat cake in another layer of frosting, taking your time to make it even. If the frosting isn’t firm, chill another 30 minutes (important when you add the other colors). Divide reserved 1 cup frosting among 4 small bowls and add orange, green, red, and black food coloring to reach desired hue. Place dollops of each color of frosting all over cake. Run scraper around cake in one continuous motion to create smooth streaks of color.ChevronChevronDo ahead: Cake can be made 1 day ahead. Chill, uncovered.How would you rate Life-of-the-Party Layer Cake?Leave a ReviewTell us what you thinkReviews (6)Back to TopTrianglenot a review, but a question. Is there an easy way to make it bigger to serve more?  The math on increasing pan size is a bit bewildering. If I used 8 inch pans would I double the batter recipe? Any ideas on how that would affect the baking time?  Thanks for any advice!Ilex N. IvySharon, CT10/4/2021I made this cake for a special dinner for out of town guests.  \nIt is not hard, but it is time consuming.  I took two days to make it.\nThe vanilla cake is fabulous. The frosting is the best frosting that I have ever made.  I did enhance it with limoncello and it raised the frosting to another level.  The finished cake is a real show stopper.  My guests took pictures and thought it was one of the best cakes that they ever had.\nI am planning to make it again when I have guests.  I already have requests!AnonymousAtlanta, GA, United States3/14/2021This cake is so fun! I only had 8in. cake pans so I evenly divided the batter between 3 pans and baked until a toothpick came out clean as suggested. The layers were definitely thin, but all stacked on top of each other with frosting in between still made quite a cake! We filled it with gummies and sour patch kids, which oddly went well with the icing that has that little bit of lemon. It was fun to make and absolutely delicious! Allie1/31/2021Just made this cake, must say  the cake itself if the best vanilla cake I’ve ever made. Not overly sweet,  soft and fluffy but still great for stacking and holds well under many layers and frosting.  Surprisingly simple to make as well. \nIt’s a keeper!DianaColton, Ca12/20/2020Step 2 (pg 110 in magazine) says: Combine milk and vanilla in a measuring glass. Reduce speed to low; beat in dry ingredients in 3 additions, alternating with milk mixture in 2 additions, mixing well after each addition. Divide batter evenly among 6 small bowls (if using a scale, about 200 g each).\n\nI assume that I am to add the milk and vanilla to the batter in this step? It reads to combine them in a glass, then add dry ingredients to the batter. Anonymous12/9/2020I have been a great admirer of the chef for many years. Can hardly wait to make this extravaganza! stay safe. Namaste, ElizabethAnonymouskitchener ontario12/5/2020Explore Bon AppétitCakeDessertLayer CakeCream CheeseCheeseBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Amirah Kassem"]}