{"id": "28619bd5d3d574ef173bf88677d1d9c2", "url": "https://www.bonappetit.com/story/jana-schmieding-rutherford-falls", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Actor and Comedian Jana Schmieding Is Standing In Her Power | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureActor and Comedian Jana Schmieding Is Standing in Her PowerThe ‘Rutherford Falls’ writer and star talks Native representation on screen, restoring Indigenous foodways, and what she eats on set.By Sonia ChopraJuly 21, 2021FacebookTwitterEmailPhotograph by Kevin ScanlonFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Jana Schmieding, comedian, actor, podcaster, and a writer and costar of TV show ‘Rutherford Falls,’ which premiered on Peacock in April and has just been picked up for a second season.“We see how history informs these two characters' lives and the ways in which people grow and change when the truth about history is told, or dig their heels in and protect their history,” Jana Schmieding tells me over Zoom. Wearing avocado earrings she beaded herself, she’s describing the plot behind Rutherford Falls, a new Peacock Original show that centers on two friends: Nathan Rutherford, a descendant of the founder of the town Rutherford Falls and his best friend Reagan Wells—played by Schmieding—who is a member of the (fictional) Minishonka Nation. She continues, “And it asks the question, whose history do we cling to as Americans? And what happens when new truths are told?”Schmieding, who is Miniconjou and Sicangu Lakota, enrolled in the Cheyenne River Lakota Sioux Tribe, says she got a call from costar Michael Greyeyes not long after the show premiered. “He’s been in a lot of movies, but a lot of the time, his story as a Native person and Native actor has been erased,” she says. “He wanted to prepare me for that potential, but he also said, ‘Something different about this show is that they can no longer ignore us.’” With Native showrunner Sierra Teller Ornelas, three other Native writers and comics in the writer’s room, and Schmieding writing and costarring, representation is foundational to the show. “It is so powerful to be able to say, ‘We’re here.’ We can continue to spread our message, to stand in our power and make demands, and things will change.”In Rutherford Falls, energetic Wells runs a small Minishonka cultural center in a big, glitzy casino, drinks lots of coffee, and truly cares about the people in her life (I hope in season two she also gets to spend more time at the fry bread truck shown in the show’s catchy intro). In real life Schmieding is funny, smart, and passionate—and optimistic about restoring and growing Indigenous foodways and culture. Leading up to the announcement of a second season, we spoke about her relationship to food, the importance of food sovereignty, and what’s missing from wellness culture.In the writers room I ate… a lot of SmartPop! popcorn. I argue popcorn is indigenous, and potato chips are indigenous too. I love good coffee. I like chocolate bars from this Indigenous chocolate company, Bedré, and the Native food brand and winery, Séka Hills, in California, whose garlic herb almonds are so good.Food is a center point... in my family and my community. We don’t gather without food. I also know the history of my people and the trauma we share, especially trauma around food: being separated from your foodways and having to protect seeds during a time of genocide. That’s how important our food culture is to us.A lot of Native people have been separated from... our cultures. There are so many ways of being that have been colonized and silenced and killed. And food culture is something that we, as Indigenous people, hold onto very tightly because it has been one way that we connect to our land. I'm a Miniconjou person, which means “a grower by the river.” We were corn growers; we have names for ourselves that have to do with our food culture and our way of being.I'm connecting with my own food trauma...and trying to process my own history. Recovering and renewing foodways is very much a part of the contemporary Native experience. We are the original cultivators of these lands. There's this narrative—when the settlers came they were taming this wild, savage territory—and that's just not true. There were so many ways food was used to commit genocide. The suppression of food, the elimination of the buffalo during the 19th century, the mass removal of people from their land. I'm learning a lot about it too.In response to the suppression of our culture and community… we always make more food than there are people. There's a Lakota word for giving out leftover food—wateca—that means we make more so that people go home with food as well. There’s this general feeling of abundance. That feeling, that nourishment that we are providing for our community, is a response. It's a response to suppression of food.I really look to the current contemporary food sovereignty movements... like North American Traditional Indigenous Food Systems and Sicangu CDC, a community-based nonprofit with a local farm on my homelands in what is now called South Dakota. I see these local movements building and also these national movements—it's getting more systemic. I gobble up these conferences or these teachings and discussions with Native growers and the Native food protectors, seed protectors, and land protectors. The ability to be self-sustaining and to be autonomous and to live by our own food ways is such a joyful and fulfilling—albeit challenging—idea around reclamation that is really meaningful to me, especially as somebody who loves food.I want to envision… my people as full. I want us to be full again. And I want us to be well fed and nourished and to be okay with that. I don't want us to be doing the colonizers' work by suppressing our eating and continuing to be out of touch with our food. So I work on it individually and look at it more systemically as well.There's a direct link between diet culture and... anti-Blackness and anti-Indigeneity. The settler gaze centers piety and purity in the way that, especially for women, means you have to be anti-savage. It says you should practice control and suppression over food, over all of these that we find joy in. Over a lot of the things that were celebrated by Indigenous people and enslaved African people.I can’t stand the rhetoric… that food is fuel. It is directly linked to weight loss and what I would call “white wellness culture.” Which I feel is a very hard thing to vilify because then people think you're anti-wellness. Well, how come we're not looking at wellness more holistically? How are we not looking at justice as well? We're not looking at restoring foodways as wellness. We're not looking at reparations as wellness, and that doesn't make any sense to me.We are getting to the point… where we’re saying, not only should you not use white sage if you’re a non-Native or -Indigenous person, but also: Stop imposing your wellness values on us. It’s not okay for you to tell us how to live anymore. The desecration of white sage is a new form of taking and appropriating and it’s harmful to Indigenous people who, frankly, couldn’t use these spiritual tools legally until the 1970s. It’s been illegal to practice our ways for so long, and I feel we are coming into a new time right now. We have always had to adapt and evolve in this white culture.I find so much power in who we are... and I just cannot believe how long we've been silenced and suppressed and erased because we have so much beauty and so much to offer. I just love seeing Native chefs popping up and really practicing and teaching us about traditional Indigenous foodways. And of course all of that is tied into land protection and water protection and all of the movements that are going on right now by Indigenous people against these major corporations. Our people are on the ground building farms, cultivating food, and renewing our foodways, and are also on the front lines of these huge land battles—and we always have been.Explore Bon AppétitHealthyishPerson of InterestLifestyleInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-21", "author": ["Condé Nast", "Sonia Chopra"]}