{"id": "2864a5b2799f33c43ad5eea49ea6ad66", "url": "https://www.bonappetit.com/story/never-fail-tomato-tart", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "This Tomato Tart Is So Easy, I Can Tell You How to Make It Over the Phone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tomato Tart Is So Easy, I Can Tell You How to Make It Over the PhoneAnd I have. Many times.By Emily SchultzSeptember 7, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.The funny thing about working at a food magazine is that everyone you know starts to think of you as their personal food concierge. At around 4:45 p.m. every day, my group chats will start going off with things like, “What should I make for dinner tonight? I have two eggplants, a cucumber that’s about to go bad, and some leftover grains.” (P.S.: Make this). Or, “My uncle is coming to town and staying in Brooklyn Heights. Got any recs?” (P.S.: That answer is going to be The Long Island Bar every time).Another thing that happens is that your friends, by osmosis, suddenly get super into having dinner parties. And because you happen to both work at a food magazine and have a type A personality, you feel completely entitled to then perfectly craft—or micromanage, depending on who you ask—these dinner parties to your liking. It's just what happens.In case it wasn't clear, I've been talking about myself here, and this is my real life. If I'm hosting in my tiny Brooklyn apartment, there's no way I'm making the entire meal myself, but I will plan the menu and delegate not only specific dishes but specific recipes to my friends. Which means that I'm always on the hunt for recipes that are delicious, beautiful, and simple enough that said friends—who pretend to be inept in the kitchen even though they most certainly are not!—can feel confident making. Which is where this tomato tart comes in. It's beyond impressive-looking, but basically all you have to do is buy frozen puff pastry, thaw it, poke it a couple of times, put some stuff on it and bake it.Can't go wrong with frozen puff pastry. Can't go wrong with this tomato tart.\nPhoto by Laura Murray, Styling by Sue LiBut just because a recipe is easy doesn't mean that the friend you delegated it to isn't going to call you, panicking, and need to be walked through it. So here's the script. First, let’s start with the frozen puff pastry. You’re going to find it in the freezer aisle of your supermarket, by the frozen pizzas. They’ll usually come in a pack of two or four and TBH, this tart is as good leftover as it is hot, so make more than one! Oh, and it needs to thaw overnight in the fridge. This part is non-negotiable—if you try to work with it while it's frozen, it'll crack, and if you try to thaw it quickly it'll get weird and gummy. (If you're doing this coaching the day of the dinner party, tell them to go ahead make something else. Caprese, maybe?)Moving on. You’re preheating your oven to 375°F degrees and rolling your puff pastry onto parchment paper. IMPORTANT: wax paper and parchment paper aren’t the same thing, and you don’t want your oven to become a big old smoke box. Make yourself a drink, take a big sip, and then prick the rolled out dough with a fork a few times in the center of the dough, which will allow steam to escape and help the thing keep its shape. Combine a clove of grated garlic and a tablespoon of olive oil in a little bowl, and brush this garlicky oil onto the PP. (PP stands for puff pastry, obvs.) If you don’t have a pastry brush, neither do I. Use your fingers! It’s fun, promise.Then, you’re going to slice half of a lemon thinly and scatter those slices—rind and all, but without the seeds!—all over your PP. Use as much as you’d like, though I prefer it a little light on the lemon and heavy on the tomatoes. Use the other half of your lemon to make garnishes for Campari spritzes later and toss some torn basil onto your tart. Then you’re going to cut up your tomatoes into rounds and layer that onto your puff pastry. A little overlap is good! This is a tomato tart in case you forgot. You’re going to sprinkle with a generous amount of salt, pepper and oil and throw that bad boy into the oven. It’ll probably take about 35 minutes, but just watch for browning on the edges and bottom of the pastry! Let it cool completely before you cut into it and bring it over to my house, so all the juices have time to set into their respective seats, and grab some creme fraiche or ricotta on the way over to dollop on top.Look at you and your tomato tart!It’s the most perfect summer party appetizer, and a great way to spend an afternoon on the phone with a friend you're about to spend the whole evening with. Just make sure to reward her with a pitcher of spritzes when she arrives—you both deserve it.Get the recipe:Tomato-Lemon TartUsing frozen puff pastry is the shortcut that makes this tart a new summer weeknight favorite recipe.View RecipeExplore Bon AppétitBasicallyNever FailTomatoTartRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Emily Schultz"]}