{"id": "286d4a98f89040af0aca9701b671820c", "url": "https://www.bonappetit.com/story/superiority-burger-gelato-sorbet", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "ICYMI: Superiority Burger's Gelato and Sorbet Are the Only Ones That Matter in NYC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsICYMI: Superiority Burger’s Gelato and Sorbet Are the Only Ones That Matter in NYCAfter four years, chef Brooks Headley is still making my favorite flavors.By Alex DelanySeptember 5, 2019FacebookTwitterEmailPhoto by Sam HodgsonFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I say that I love the gelato and sorbet at Superiority Burger, I am not exaggerating. It makes me emotional. Eating it inspires the same warmth as the most important human connections in my life. On multiple occasions, I have walked into the vegetarian burger joint, purchased a scoop of each flavor, exited the shop, and walked a circle around the block while enjoying my spoils—only to return a few minutes later to purchase another cup. To be fair, this is nothing new. I’ve been pulling that move for the past four years, ever since the East Village pillar opened for business. And so have a lot of others in this hungry city.We all have Brooks Headley—Superiority Burger’s chef and owner—to thank for that. He makes one gelato and one sorbet each day. Sometimes it’s raspberry sorbet and a date shake gelato. Sometimes it’s coconut gelato and tangerine sorbet. Sometimes it’s strawberry sorbet and labneh gelato.But at the end of the day, it doesn’t really matter what flavors he’s working with. The gelato will always be intensely creamy and flavored in a way that is both familiar and boundary-pushing. The sorbet will be tart and fresh, as if you tripped face first into a stall at the farmers’ market. And together in one cup, they work like veteran Olympic ping pong doubles partners, slapping flavor around the inside of your mouth until—in a euphoric daze—you finish your walk around the block and stumble back into the burger shop for another glorious serving.Go there: Superiority BurgerExplore Bon AppétitNew York CityIce CreamSorbetHighly RecommendGelatoRead MorecultureThis Tahini Gelato Is What All Tahini Desserts Aspire ToBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-05", "author": ["Condé Nast", "Alex Delany"]}