{"id": "286df5e70ce93afdb5216665fda4c7dc", "url": "https://www.bonappetit.com/story/jenny-feldt-restaurant-diary-4", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "I Used to Teach Restaurant Staff About Vodka. Now I Teach Them About Hospitality. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Used to Teach Restaurant Staff About Vodka. Now I Teach Them About Hospitality.In her fourth Restaurant Diary entry, brand ambassador Jenny Feldt explains how her job has changed due to the recent staffing shortage in the restaurant and bar industry.By Jenny Feldt, as told to Elsie YangMay 19, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four people working in the industry. Each week you’ll hear from one of them: farmer Kristyn Leach, wine educator Kyla Peal, line cook Peter Steckler, and bartender turned brand ambassador Jenny Feldt. Here Feldt talks about how the lack of hospitality workers is affecting her restaurant and bar partners, her role at Grey Goose, and the industry at large. Read Feldt’s previous diary entries here.There’s a real shortage of hospitality workers right now.It’s been an issue since the onset of COVID, but I’ve noticed it in particular these last couple of months as restaurants start to open up and are just incredibly short-staffed. In almost every market I work in or visit, I’ve seen the same problem. When the initial restaurant shutdowns pushed hospitality workers out of their jobs, many of them pivoted out of the industry altogether. I know of a lot of folks who went back to school or found jobs outside of bars and restaurants, which offered more stability or benefits. Now some of these hospitality veterans aren’t coming back. Instead, we’re finding a new set of younger staff. For restaurant managers that means training a whole new workforce on the 101s and basics of hospitality. This has shifted my day-to-day focus for our Grey Goose partners, essentially our own restaurant and bar customers.Before, I was spending more time training restaurant and bar staff on the Grey Goose brand or the vodka category as a whole. These days I’m also providing introductory hospitality training. I’m teaching newcomers to the industry about the fundamental steps of service, like how long to wait before greeting a guest after they’ve sat down; how often to check on a table; how to understand and effectively communicate a menu, with descriptions of food and ingredients. In effect I’m providing them with the building blocks of how to create an experience for a guest. Whereas some restaurants have really intense onboarding programs for this kind of information, I’m finding that many teams are so understaffed that they just don’t have time to do this training on their own. So that’s where I come in. I’m doing training that, pre-pandemic, I never would‘ve thought to do or thought would be necessary. For example, I was recently asked to demonstrate how to present a bottle during service, which I’d never been asked to do before. But it’s a great opportunity for me to also learn what restaurants and restaurant workers really need right now and potentially dust off my own skills and services.Photo by Jose PereiroAs the workforce and its needs evolve, so does our curriculum. Throughout the last year our team of ambassadors has been adjusting our training programs as the need arises and letting our partners lead the way when it comes to the content of our offerings. In the beginning, for example, we were focused on how to feed folks in the industry who were food insecure. Today it’s more about helping folks build confidence and showing them that hospitality can be a sustainable career, if you have access to the right amount of educational resources and overall support. We’re just trying to help out as best we can.Even after staffs are trained, a lot of bars and restaurants are having trouble with retaining their employees. I don’t think new hires—many of whom are younger or have never worked in hospitality before—realize how hard working in a restaurant really is. You’re on your feet for about eight to 12 hours straight, have to leave your emotions at the door, and are provided with very few (if any) benefits. So they leave. Or, in other scenarios, given the extreme nature of the understaffing issue, guests are taking out their frustrations on the staff that is around. This doesn’t create a very welcoming environment for someone new to the game.I’ve seen some pretty wild incentive programs to try to attract talent. Some restaurants are literally paying people just to show up for interviews; others are offering a bonus to folks who stay on for at least 90 days. I think that really underscores how desperate the situation has become and how big of a problem this really is.COVID affected restaurants and their employees in such a major way because of the benefit structure. There are so many benefits you don’t have as a front-of-house or back-of-house employee, and you may not realize that you need them until you really need them, such as health insurance. I’m hoping that the pandemic will actually bring about positive change in this regard. Maybe the industry will realize that providing these benefits can not only help obtain stability for its workers but can also allow restaurants to secure talent for an extended period of time. I’ve definitely been working with some bars and restaurants that are already beginning to provide benefits that they didn’t offer before, offering incentives like healthcare and investing in mentorship. I’m really hopeful that we’re all moving in that direction.Explore Bon AppétitRestaurantsRestaurant DiariesCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-19", "author": ["Condé Nast", "Jenny Feldt", "As Told To Elsie Yang"]}