{"id": "286d27ad62d3e56ad2845c79a55fc871", "url": "https://www.bonappetit.com/story/how-you-can-help-restaurants-vote", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "How You Can Help Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow You Can Help RestaurantsVote if you love food.By Sonia ChopraOctober 28, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenFacebookTwitterEmailEvery Tuesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.How are you doing? As we head into next week, I’m doing my best to stay positive and keep my energy up, but most of my cooking prep goes like this: I bookmark recipes like this eggplant dip and this pretzel focaccia (and this Hakka shallot sauce and this apple cider doughnut loaf cake that, I am not kidding, I have had open in a browser tab since I started this job) and then just make quick leftover-laden stir-fries instead of anything that requires advance planning or multiple steps.While my cooking remains pretty lazy, I’m trying to stay engaged politically through this long election season. I’ve turned back to our Vote If You Love Food series time and time again, drawing inspiration from the smart and dedicated people across the industry who are finding meaningful ways to connect with their communities during the lead up to November 3. From starting nonprofits dedicated to mental health and mindfulness like Philly’s Jezabel Careaga is doing to using their businesses to build up their neighborhoods like Pinky Cole in Atlanta is focused on, restaurant folks have used their resources and experience to promote activism and advocacy in a way that is so important and honestly just so cool.Want this letter before it hits the website? Sign up for our newsletter!Illustration by Julia DuffoseSometimes people email or comment to tell us they wish we “stuck to food,” but we all know food and politics are intertwined, that the way we vote affects how food policy is shaped, that it can determine access to ingredients, how workers are paid and what rights they have, and so much more. Restaurateurs like Francesca Hong know this, which is why they’re running for office. And so many others across the industry who lost their jobs during the pandemic have felt it directly and have decided to use their time to phone bank, work the polls, and otherwise try to increase voter turnout.We also asked everyone featured how we—readers, diners, industry members—could most practically and directly help restaurants and advocate for the industry, via activities like donating to organizations that combat food insecurity, contacting policymakers to push for better mental health resources, and offering small business support. I hope these stories and suggestions inspire you like they’ve inspired me. As always, I’d love to hear from you, especially if there are more articles like this that you’d like to see from us. I’m at sonia@bonappetit.com. In the meantime, I’ll be stress-eating tofu and daikon stir-fries and other bottom-of-the-fridge meals.Explore Bon AppétitLetter From The EditorRead MoreElection 2020Some Out-of-Work Restaurant Workers Have Found a New Calling: Getting Out the VoteBy Priya KrishnaElection 2020Aisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.”By Aisha “Pinky” Cole, as told to Leigh-Ann JacksonElection 2020How to Practically and Specifically Help Restaurants This Election YearBy The Bon Appétit StaffElection 2020I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeBy Francesca Hong Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-28", "author": ["Condé Nast", "Sonia Chopra"]}