{"id": "28709ac0db28a911e7bdeb1d46ee4caa", "url": "https://www.bonappetit.com/recipe/tagliatelle-with-prosciutto-and-peas", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Tagliatelle With Prosciutto and Peas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueTagliatelle With Prosciutto and PeasBy Evan FunkeMarch 17, 20204.7(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintIf they’re in season, look for fresh peas. And if not, there is no shame in using frozen—it’s one of the few frozen vegetables we can get behind. This recipe is from Evan Funke, chef-owner of L.A.’s pasta temple, Felix Trattoria.Ingredients4 servings1lb. tagliatelle1½cups shelled fresh peas (from about 1½ lb. pods) or frozen peas½cup (1 stick) unsalted butter6oz. prosciutto, thinly sliced (about 12 slices)16sage leaves2oz. Parmesan, finely grated (about 1 cup), plus more for servingPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally and adding peas about 2 minutes before pasta is done, until al dente. Drain pasta and peas, reserving 1½ cups pasta cooking liquid.Step 2Meanwhile, heat butter in a large Dutch oven or other heavy pot over medium until frothy. Tear prosciutto slices into bite-size pieces and add to pot along with sage. Cook, stirring occasionally, until prosciutto is golden brown and beginning to crisp, about 4 minutes. Remove from heat and let sit until pasta is done.Step 3Add pasta, peas, 2 oz. Parmesan, and 1 cup reserved pasta cooking liquid to pot with prosciutto and return to medium heat. Cook, tossing vigorously and adding more pasta cooking liquid if needed, until saucy and pasta is coated, about 30 seconds. Taste and season with more salt if needed.Step 4Divide pasta among bowls and top with more Parmesan.How would you rate Tagliatelle With Prosciutto and Peas?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis was for 3 of us, I used 8 oz rotini, as a result did not need to add any of the pasta water. Only had around 12 sage leaves but would use at least 20 next time as the flavor was too faint but delicious. Added zest of 1 lemon at the end, and as others have mentioned, lots of black pepper. Easy and excellent!Charleston, SC11/5/2020I pretty much love any dish where I can incorporate prosciutto! Delicious pasta dish, simple and easy to make.AnonymousVictoria, Australia 8/21/2020Who better than Evan to bring out the best of flavor with pasta. Simple ingredients that just make you want to keep eating more.  Listen to Evan and you cant go wrong.sbelvederePayson Az8/1/2020일산오피【bamclick1。com】◈밤클릭◈ ⟐일산마사지⟐일산안마⟐일산유흥⟐일산휴게텔⟐일산풀싸롱⟐일산키스방⟐일산건마⟐일산리얼돌⟐일산출장안마⟐일산룸싸롱⟐일산OPemma oliviasingapore7/7/2020This pasta receipe is fantastic! The steps are easy to folllow and it is delicious. I made the full receipe for my husband and me for tonight and will enjoy the leftovers tomorrow.  Thanks BA! \nIrishkateChicago5/31/2020\nAnonymous5/25/2020So good! One of the two pastas my pasta-hating fiancé admits to liking. Even better the next day. AnonymousWashington, DC4/25/2020Omg this was good and so quick and easy. It’s my new quick throw together dinner. Since I’m from New Mexico I added some red chiliAlbuquerque 4/7/2020This has to be said with a Boston accent...\nThis recipe is a keepa..\nI added the juice of half a lemon\nI did not use sage as I did not have any.\nI used about 4 leaves of fresh basil\nEasy and yummy and who needs to consider calories\nBoston4/5/2020Delicious - we added chopped asparagus and added them in the step with peas, cut the recipe in half for two - perfect portions.  Good quality cheese is important, and lots of black pepper was a needed addition.szmarie70354/2/2020This recipe was soooo easy and sooo good. Re-reading it now, I realize that I forgot to slice the Proscuitto and just tore it into pieces and threw it into the butter...oh, well. Still great. This pasta is flavorful, comforting, and has a vegetable in it so it's healthy, right?AnonymousLos Angeles3/31/2020My wife and I found this recipe to be very disappointing and bland. After dinner, my wife made a separate cream sauce for the leftovers:). I would not recommend it..Larry FeigenbaumCA3/31/2020This came out sooo good!! I halved the recipe but kept 16 sage leaves. YUM! AnonymousIllinois3/29/2020This was delicious! Anonymous3/29/2020So good! I didn't have enough prosciutto on hand and had to use some bacon as well, which made it extra fatty, but it was still crazy delicious. I even foraged for the sage, because I'm on lock down and I. Will. Survive. I made fresh pasta which bright it to an 11. Anna McDermottSalt Lake City, Utah3/25/2020Explore Bon AppétitPastaItalianEuropeanPeaVegetableProsciuttoHamMeatTagliatellePasta & NoodlesSpringQuickEasyWeeknight Meals5 Ingredients or FewerMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Evan Funke"]}