{"id": "2873eb0b78b79734cbd0122fbcc3111f", "url": "https://www.bonappetit.com/recipe/flaky-cranberry-hand-pies", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Flaky Cranberry Hand Pies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueFlaky Cranberry Hand PiesBy Amanda MackOctober 20, 20204.1(50)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“These desserts are an homage to the Thanksgiving traditions I can’t wait to get back to, except I’m putting my own spin on them this year,” says baker Amanda Mack, the owner of Crust by Mack in Baltimore. “Ditch the traditional pie and try smaller ones with bolder flavor.” They can be individually wrapped or placed on a beautiful platter with twine and fresh thyme. You can use frozen cherries instead of the cranberries here; just increase the cornstarch to 4 tsp. Mack’s other desserts include Pecan Pumpkin Spice Chocolate Chip Cookies and Sweet Potato Cake With Salted Cream Cheese Frosting.IngredientsMakes 12-14Dough1cup plus 6 Tbsp. European-style butter (82% fat; such as Kerrygold)2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2cups (250 g) all-purpose flour, plus more for surface6Tbsp. buttermilkFilling and assembly1orange8oz. fresh or frozen cranberries½cup (100 g) granulated sugar1½tsp. vanilla extract1½tsp. cornstarchAll-purpose flour (for dusting)1large egg2Tbsp. raw sugar or sanding sugarPreparationDoughStep 1Cut butter into ½\" pieces and freeze on a small plate 30 minutes.Step 2Pulse salt and 2 cups (250 g) flour in a food processor to combine. Remove butter from freezer and add to processor. Pulse until mixture is crumbly and butter is about pea-size, 30–35 quick pulses. Drizzle in buttermilk, then pulse until a rough ball forms (it will be crumbly). Be careful not to overwork dough.Step 3Turn dough out onto a lightly floured surface and press into a disk. Wrap in plastic and chill at least 1 hour.Step 4Do ahead: Dough can be made 1 day ahead. Keep chilled, or freeze up to 3 months. Thaw overnight in refrigerator before using.Filling and assemblyStep 5While the dough chills, make the filling. Using a vegetable peeler, remove 2 wide strips of zest from orange (avoid white pith as much as possible). Thinly slice zest lengthwise, then cut strips crosswise into very small pieces. Cut orange in half and squeeze 2 Tbsp. juice into a small saucepan. Add cranberries, granulated sugar, vanilla, and 1 tsp. orange zest; stir well. Bring to a boil, stirring until sugar dissolves. Reduce heat; simmer, stirring occasionally, until cranberries are softened, 6–8 minutes.Step 6Stir cornstarch and 1 Tbsp. water in a small bowl to dissolve, then add slurry to cranberry mixture. Simmer, stirring, until filling thickens and looks very shiny and glossy, 30–60 seconds. Scrape into a heatproof bowl and let cool, stirring occasionally. Cover and chill until cold, at least 1 hour.Step 7Roll out dough disk on a lightly floured surface to about ¼\" thick. Using a 3\"-diameter cookie cutter or glass, punch out rounds, transferring to a baking sheet as you go. You should get 20 rounds; chill until ready to use. Gather remaining dough scraps and press into a disk, then wrap in plastic and chill 20 minutes. Roll out dough disk and punch out as many more rounds as you can get (hopefully 8); arrange on another baking sheet.Photograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioStep 8Whisk egg in a small bowl. Remove rounds from fridge and brush edges of each round with egg. Spoon a heaping teaspoonful of filling into the center of half of the rounds. Drape remaining rounds, egg-brushed sides down, on top and crimp edges with a fork to seal. Set remaining egg wash aside. Place pies on a parchment-lined baking sheet and freeze 15 minutes.ChevronChevronStep 9Meanwhile, place a rack in middle of oven; preheat to 400°.Step 10Cut a small slit in the top of each pie, brush with reserved egg, then sprinkle with raw sugar. Line a second baking sheet with parchment paper and divide pies between sheets, spacing at least 2\" apart. Bake until crusts are golden brown and fillings are bubbling, 16–18 minutes. Transfer to a wire rack; let cool until warm.ChevronChevronStep 11Do ahead: Filling can be made 5 days ahead; keep chilled, or freeze up to 3 months. Thaw overnight in refrigerator before using. Hand pies can be baked 1 day ahead; let cool. Store airtight at room temperature.How would you rate Flaky Cranberry Hand Pies?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI like other bakers found the recipe a bit long-winded; still, I liked it and the instructions were easy to follow.  I reduced the amount of butter per other recommendations and dough handled okay with some extra coaxing. I can't help but feel that the ratio of flour to butter is an error.  However the flavor of the baked crust was lacking (perhaps that's where the 6 T of butter that I eliminated might be needed...) to my taste in fact I'd add some sugar to the flour if made again. The filling was also a bit bland; perhaps more orange zest (used a microplane vs. peels and knife).  Interestingly the fragrance while cooking the berries with vanilla was heavenly but didn't transfer much to the finished pie. These made a big impression on dinner guests for their appearance but I found half-eaten ones on plates:(  No bueno.  KristinPortland, Ore11/26/2021Well, they're good, but I wouldn't make them again. 1) They were an absolutely pain to make and 2) it's too much crust for not enough filling. Still good with a bowl of Blue Bell though! For anyone who's curious, I doubled the recipe and froze them to bake on Thanksgiving. Worked great based off of some test results. Think they definitely need to be served though with some sweetened whipped cream/ ice cream to compensate for the cranberry's tartness.SARosslyn, VA11/16/2021Loved these, also ended up doing some with just nutella!MikeMaryland10/31/2021Love these!  Everybody raved about them, had to make more right away.  Only used 1 cup of butter and they were amazing flaky.   I think the key is all the chilling of this dough.  Will be experimenting with other fillings as well.MaureenSaint Helena, CA2/10/2021Fantastic! I made over two days making dough and filling one day and then actually making these day two. Labor intensive but wonderful! Breaking up the prep prevented me from getting too tired and enabled me to use in between time better.JeanneColumbus 1/21/2021Way too much butter. If you’re anything like me and want to follow the recipe exactly, I’m telling you do not. I read reviews saying don’t add the additional 6 tbsp of butter and I did not listen. They were overall pretty good but extremely labor intensive. Sophia HowePortland, OR12/4/2020I needed to use up some leftover cranberries from Thanksgiving, so I halfed this recipe and it was PHENOMENAL! It's like a little pillow full of Christmas. Thanks for a great recipe!Maddi's KitchenMishawaka, IN12/1/2020these were a HUGE hit and I wanted to make them again immediately after we ran out. \n\ni did have some issues with the recipe because BA still has their old recipe up from 2002, and it's very similar but slightly different. PLEASE DELETE THAT DAMN RECIPE thx <3 \n\nsome variations —\n\n- didn't have a food processor for the dough, so i just used one of those hand-held dough blade things and went to town. took forever and i don't think i'd recommend. \n- i didn't cut the butter before freezing it (i was working off the 2002 recipe on accident for a bit). huge mistake. cut the butter first lmao\n- used ice water instead of buttermilk and the dough still turned out fantastic. but if you can use buttermilk or a substitute, I'm sure it'd be better\n- i zested the orange instead of cutting and dicing a peel and i think it might taste better that way. the orange notes in the cranberry were incredible.\n- i mixed the corn starch with the sugar instead of with water\n\noverall delicious, beloved, really lovely the next day for breakfast or with tea.jessLA, CA12/1/2020made these vegan using Country Crock Plant Butter and making a buttermilk sub with vegan yogurt + milk (used 365 almond milk yogurt). i only ended up using half the filling, and would definitely recommend making the dough by hand instead of in the food processor. \n\nin the end though, they turned out really flaky and tasty! just be sure to decrease the amount of salt if you try baking it with store-bought vegan butter, they're usually salted. would definitely make again for a holiday treat.wheres_the_vegNJ11/29/2020The dough ended up being a bit of a pain to work with, but the flavor is incredible and the flake was to die for. Will be making again and trying out cherry and strawberry iterations!LouisPittsburgh, PA11/28/2020they take time with all the chilling of dough but are worth it.  I left off sugar and put one on each plate instead of cranberries and muffins.  all the butter makes them flaky, but might follow one of the reviews and use less butter.  yes, I would make these again, try different fruits and make them as pies.  as long as you're prepared for chilling time (and you need the time so they don't stick), they are easy to make.carsAlexandria, NJ11/27/2020These were great! Like other reviews, I only used 1 cup of butter and found the dough to be plenty buttery. Took longer than expected to make, but worth it!AnonymousNorth Carolina11/27/2020Used only 1cup of butter and still found the pastry to be buttery enough. Thought the recipe needed a bit more sugar but overall they were a hit and I will be making these againAshaWashington DC11/25/2020Extremely flaky and buttery. These hand pies are a crowd pleaser. Would definitely make them again!NicoleToronto, ON11/23/2020These were super delicious. Followed the recipe to a t and they looked beautiful, held up really well in the oven, and the sweet/tart flavors were nicely balanced. A project recipe, but nothing too difficult. Prep the crust and filling in advance perhaps to save some time. So flaky!!KateSeattle, WA11/22/2020Explore Bon AppétitPieDessertAmericanCranberryBerryFruitButtermilkOther IngredientsFallSnackNut-FreeBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Amanda Mack"]}