{"id": "288292f424591d110710607a3167a1ab", "url": "https://www.bonappetit.com/story/kawi-can-jam", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Why Order One Drink When You Can Get a Bucket of Them at Kāwi? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhy Order One Drink When You Can Get a Bucket of Them at Kāwi?There are a dozen canned boozy beverages of every stripe—beer, wine, cider, and two (!) varieties of sake.By Matt DuckorJuly 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m not typically overwhelmed by beverage options when dining out. I stick with the handful of wine regions I typically vibe with—lightly chilled Beaujolais from Morgon, minerally whites from the Loire Valley—and tend to stay away from “house cocktails” in favor of tried and true classics.But this was different. Just as I was settling in for dinner at Kāwi, the latest New York City restaurant from Momofuku kingpin David Chang, what looked like a squat oak wine barrel sliced in half hit the table. It was brimming with crushed ice pellets and a dozen canned boozy beverages of every stripe—beer, wine, cider, and two (!) varieties of sake.I was paralyzed in the best way possible. Where do I even start?! This is the work of Isabella Fitzgerald, the beverage director at Kāwi. While the food from chef Eunjo Park is elegant—the kimbap features Hudson Valley foie gras, for starters—this brought to mind something you might see perched on a table in a backyard somewhere in South Korea on a sweltering summer day. Which is what Fitzgerald was going for. She was inspired by the buckets of beer on offer at karaoke rooms across the globe—Kāwi’s private dining room doubles as a karaoke room, you see—and wondered what would happen if you replace the usual crappy light beer (sorry, Adam) with beverages someone might actually want to drink.The result is what Fitzgerald and the team affectionately call the Kāwi Can Jam. The rotation of drinks changes pretty often—the night I was there, the Can Jam featured Ramona’s refreshing grapefruit wine cooler, crispy sparkling white wine made by VINNY, and a half-dozen heavily chilled sake and craft beers. It’s not technically on the menu, though the team is considering adding it, but for now I’m letting you in on the secret. So, book a karaoke party and be prepared for the delightful  indecision that the Can Jam can cause.Go there: KāwiExplore Bon AppétitHighly RecommendRestaurantsNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Matt Duckor"]}