{"id": "288cb26d1bec31ebc55629ac5dfdd76a", "url": "https://www.bonappetit.com/story/sober-chefs-dinner", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "What Happens When Five Sober Chefs Share a Kitchen? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Happens When Five Sober Chefs Share a Kitchen?Sean Brock, Gregory Gourdet, Gabriel Rucker, Evan Zimmerman, Michael Solomonov, and Andrew Zimmern on why they're hosting a booze-free dinner this week.By Julia BainbridgeSeptember 12, 2018FacebookTwitterEmailFacebookTwitterEmailFifteen minutes into my conversation with bartender Evan Zimmerman, I realize he isn't going to eat half of the tomato focaccia square I purchased at Ellē in Washington, D.C., so I slide the plate back toward me and listen to him while I finish the rest. He can’t eat because his hands are occupied, mimicking how he might pulverize salted peanuts and use them to season the creamy head of nitrogen-charged Coca-Cola.Zimmerman will serve the drink he’s describing, or something like it, at a highly anticipated non-alcoholic-cocktail-paired dinner in Portland this weekend, alongside a roster of some of the most well-regarded chefs in the country. (All 72 tickets for the dinner were purchased within two minutes of going on sale, at a price of $225 each.) Sean Brock, Gregory Gourdet, Gabriel Rucker, Michael Solomonov, and Andrew Zimmern will each prepare a course, and Zimmerman will create a non-alcoholic cocktail to match.The chefs share high achievements: altogether over a dozen restaurants, 13 James Beard awards, three Top Chef appearances (including one competition finalist), a hugely popular food and travel show, and multiple cookbooks. They also all share a lifestyle: sobriety.Brock, whose name was once used as a verb by line cooks in need of a few beers post-shift (“Let’s get Brocked”), now starts his day with a meditation session followed by a bowl of berries with macadamia milk. Gourdet, who hit bottom freebasing cocaine for three days with no sleep, runs marathons and maintains a strict gluten- and dairy-free diet. When I visit Solomonov, a former crack addict, at his restaurant Zahav in Philadelphia, he asks if I brought running shoes and tells me to meet him at 8:30 the next morning. We take a brisk walk before his all-staff meeting.These are, by all accounts, changed men. And with the upcoming dinner, part of the Feast Portland food festival, they’re joining forces for the first time.Rucker, the Portland-based chef and owner of Le Pigeon and Little Bird Bistro and organizer of the dinner, wants to challenge assumptions about what the life of a successful chef looks like. “A lot of young cooks look up to chefs in the press, and the common stigma is, 'I need to be a badass, I need to be able to drink and hold my liquor and then work through the hangover.”Rucker is lucky: He maintained a marriage and a business through years of using alcohol to come down and cocaine to stay up, and his bottom—the term used to refer to an addict's lowest point—was relatively high. One morning, after an evening spent passed out on the couch at home when he was supposed to be dining with his family and neighbors, he decided it was time to make a change. He called his father, who is sober, and asked to go to an AA meeting with him. “He said, ‘I'll take you down the path with me, but you don't get to go back now.’ And I haven't gone back.” Five years into his sobriety, Rucker goes goes to AA once a week, talks to his sponsor every day, and hits the gym most mornings.“My oldest son is seven, and he doesn't remember me drinking,” says Rucker. “He's not gonna grow up remembering me as a drinking dad.”According to the Substance Abuse and Mental Health Services Administration, the highest rates of illicit drug use are found in the accommodations and food services industry, and workers in that industry have the highest rates of substance use disorder: 16.9 percent compared to 9.5 percent on average across other industries. The highest rates of heavy alcohol use are in the mining and construction industries, with accommodations and food services coming in third.\"How do you even gauge what's appropriate when partying is part of the culture of your business?” says Solomonov.Of course, substance abuse and mental health are linked. Last year, Mental Health America (MHA) published the results of its Work Health Survey across 19 industries in the United States. The healthcare, financial services, and the non-profit industries scored in the top 10 percent; manufacturing, retail, and food and beverage scored in the bottom 10 percent.\"This industry can tear you down if you let it,\" says Brock, founding chef of Husk restaurants in Charleston, Nashville, Greenville, and Savannah. \"It tore me down.\" Alcoholism and workaholism were problems for him in equal measure, and he says that industry culture rewarded those behaviors. \"It's almost like you leave society a little bit. There was a period in my life where I didn't have a TV, I didn't have a couch–I didn't want a TV or a couch. I was working seven days a week, nonstop, I had no idea what was going on outside—I couldn't have told you who the president was, probably—and that's what I thought my happy place was. Well, that wasn't true.\"Brock entered a rehab clinic in Arizona in January 2017 and credits the six-week program with not only getting him clean, but also opening him up. “I used to walk into the kitchen and no one would say a word,\" he says. \"They were scared to death, which is the way I wanted it, but once I started showing vulnerability, everything changed.”As the #metoo movement has made waves from film sets to boardrooms and beyond, the food industry is having its own reckoning, and drinking is a big part of that conversation. \"How do you even gauge what's appropriate when partying is part of the culture of your business?” says Solomonov. He doesn’t offer his staff shift drinks anymore. “And you're obviously never going to see me fucked up at the bar with my employees.” Solomonov got sober in 2008, five years after the death of his brother. During the time in between, the chef had cloaked himself in a miasma of crack cocaine, heroin, and Scotch so thick it repelled the grief.Andrew Zimmern, the four-time James Beard Award winner and host of Bizarre Foods on the Travel Channel, remembers the day his own life changed: January 28, 1992. \"I was trying to kill myself in a flophouse hotel after being homeless for a year and thinking that I was a loser in life,\" he says. He ended up waking up in a treatment center in Minnesota instead. During the first five years he was sober, Zimmern thought a lot about patience, tolerance, and understanding. \"Those are the things that were making a difference in my life, and it hit me like a ton of bricks one day that I was working in an industry that needed help with that. And then I realized, the world needs help with that.\"\"It's people who have been in the program and other sober chefs who showed me that life can be better,\" says Gourdet.For those struggling with mental health or substance abuse issues, resources are increasing. Indigo Road Hospitality owner Steve Palmer and Mickey Bakst of the Charleston Grill founded Ben's Friends, a kind of Alcoholics Anonymous for people working in the food and beverage industry, in 2016. There are now chapters in Charleston, Atlanta, and Raleigh, which is run by chef Scott Crawford of Crawford and Son. Palmer and Crawford managed a no-alcohol-allowed “chill space” at last year's Atlanta Food & Wine Festival.Brock teaches Talking Boundaries and Listening Boundaries, a communication structure he learned at the Meadows, to his employees. \"The idea is to still be compassionate and empathetic toward that person even though they called you an asshole,\" he says. He wants to write a guide on surviving the restaurant industry, and he may soon have time. Brock recently announced that he will no longer be involved with Minero, McCrady’s, or McCrady’s Tavern, but will stay on at all Husk locations as a culinary advisor.Matthew Jennings, a Boston-based chef who lost 175 pounds and \"regained [his] addiction to fitness\" after getting sober two years ago, closed his restaurant Townsman in July to launch Full Heart Hospitality, a consulting group that will tackle restaurant menu engineering, recipe development, design, and internal strategy with wellness and social responsibility in mind. \"What I'm really trying to do is write a new manifesto for operations that stresses focusing on people first and productivity second,\" says Jennings, who is not part of the dinner but is outspoken about his newly healthy habits. \"Empathy will dictate the whole conversation.\"Zimmern says he finds more Fortune 100 CEOs quoting University of Houston research professor and author Brené Brown these days than Tony Robbins’ Personal Power program. “She really equates empathy with happiness: If you want to be truly happy, then you have to live life on an empathetic basis,” he says. “When you apply that to the workplace, you end up with a healthier environment in which morale and productivity are increased.\" At his own companies, that means one-on-one meetings and transparency at all levels. “Everyone has the same financial awareness and strategic awareness of the business, from interns to board members.”Gourdet, a former Top Chef contestant and the culinary director for the Departure restaurants in Portland and Denver, tried rehab a couple of times before he got finally sober through Alcoholics Anonymous nine months after moving to Portland. \"It's people who have been in the program and other sober chefs who showed me that life can be better,\" he says. \"So for me, it's extremely important that people who are sober are very vocal about their sobriety and how life can change.\"Alcohol wasn't the problem for bartender Zimmerman—it was heroin, which he kicked on his own with the help of suboxone and a tightly shut bedroom door—but, as a bartender, he finds not drinking freeing. \"It allows for the ability to really fine-tune a drink to better line up with a dish,\" he says. September will be high time for plums in Oregon, so he might balance their sweetness and tartness with seaweed for Rucker's trout course. He'll pick some meadowsweet flowers and infuse their flavor into carrot juice for Brock's summer vegetable and cornbread salad. Zimmern's on the fish course; Zimmerman will juice Granny Smith apples and lightly smoke the results with grapevines, a tart but earthy compliment to shrimp with a Sichuan-style vinaigrette. Solomonov's lobster-wrapped ribeye cap will be met with the clarified juice of caramelized onions with houjicha, a Japanese green tea, and a touch of molasses. \"I know onion juice sounds weird, but with the tea and the molasses, it almost tastes like Madeira,\" says Zimmerman. Finally, he'll serve that carbonated Mexican Coca-Cola with Gourdet's chocolate and peanut dessert. Too often, he says, non-alcoholic “cocktails” lean on acidity alone. \"I want to show that it doesn't have to be all about shrubs and citrus and fruit.\"None of the men involved in the dinner know what the effect will be, but “if one chef de partie in the US decides to get clean and sober after this, that’s enough of a reason to do it,” says Solomonov. According to Brock, “I want [sobriety] to be something people are proud of rather than shameful of. The simple fact that you have made the decision to take better care of yourself? That should be the proudest moment of your day.”Explore Bon AppétitHealthyishNonalcoholicChefsMichael SolomonovAndrew ZimmernFeast PortlandInterviewsRead MorerestaurantsSean Brock on How Sobriety Changed the Way He CooksBy Christine Muhlke and Sean BrockRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-12", "author": ["Condé Nast", "Julia Bainbridge", "Sean Brock"]}