{"id": "2897f5c2098b58eb28c9b6a53ebf6bd8", "url": "https://www.bonappetit.com/recipe/the-spicy-grilled-chicken-sandwich-of-your-dreams", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "The Spicy Grilled Chicken Sandwich of Your Dreams Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDThe Spicy Grilled Chicken Sandwich of Your DreamsSponsored by Heinz® Mayonnaise FacebookPinterestTwitterEmailPhotography by Chelsea Craig Makes 4 sandwiches We’re huge fans of Cutty’s in Boston from husband and wife team Rachel and Charles Kelsey. And we’re especially fond of their spicy chicken sandwich recipe made with NEW Heinz® Mayonnaise.The chicken gets a kick of heat from an overnight brine and is then grilled and stacked atop Heinz® Mayonnaise slathered pain de mie and finished with housemade dill pickles, cheddar cheese, and shredded iceberg. Now THAT’s a chicken sando!PrintIngredients__Chicken__2 oz. vegetable oil2 tsp. cayenne pepper2 tsp. sugar1/2 tsp. Sichuan peppercorns1/2 tsp. black peppercorns1/2 tsp. paprika1/4 tsp. garlic powder2 tablespoons kosher salt2.5 pounds boneless, skinless chicken thighs__Sandwich__8 slices high quality white pan de mie1/2 cup Heinz® Mayonnaise6 oz. thinly sliced dill pickles4 slices cheddar cheese2 cups shredded iceberg lettuceRecipe PreparationChicken PrepCombine the first 7 ingredients in a small saucepan and bring to a simmer. Add the salt and blend the mixture until smooth. Set aside and cool. Add the chicken to the cooled marinade and turn to coat. Refrigerate for at least 2 hours, or overnight. Grill the chicken until lightly charred on the outside and 175°. Let rest.Sandwich Assembly Spread about 1 tablespoon Heinz® Mayonnaise on each slice of bread. Divide the chicken evenly over 4 slices of bread. Divide the pickles evenly over the chicken, then top each with 1 slice of cheddar and about ½ cup shredded iceberg. Put the second slice of bread on each sandwich, cut in half, and enjoy.Sponsored by Heinz® Mayonnaise GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Heinz"]}