{"id": "2899b95e288043dd061fd9528e35a887", "url": "https://www.bonappetit.com/recipe/blackout-chocolate-banana-bread", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Blackout Chocolate Banana Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueBlackout Chocolate Banana BreadBy Molly BazJanuary 12, 20184.5(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintThink of this recipe as a cross between your very favorite banana bread and a crowd-pleasing blackout cake. Whole wheat flour lends a nuttiness to the cake, but feel free to replace it with more all-purpose if that’s what you have on hand.IngredientsMakes one 9x5\" loaf Nonstick vegetable oil spray¾cup all-purpose flour½cup whole wheat flour⅓cup unsweetened cocoa powder1¼teaspoons baking soda¾teaspoon baking powder1teaspoon kosher salt5large very ripe bananas, divided1cup plus 2 tablespoons light brown sugar6tablespoons unsalted butter, room temperature2large eggs⅓cup sour cream1teaspoon vanilla extract4ounces bittersweet chocolate, chopped1tablespoon demerara sugarPreparationStep 1Preheat oven to 350°. Lightly coat a 9x5\" loaf pan with nonstick spray. Line bottom of pan with parchment paper, leaving a generous overhang on long sides.Step 2Whisk all-purpose flour, whole wheat flour, cocoa powder, baking soda, baking powder, and salt in a medium bowl.Step 3Mash 4 bananas with a potato masher or fork in a medium bowl until smooth. Using an electric mixer on medium-high speed (or a stand mixer fitted with the paddle attachment), beat brown sugar and butter in a large bowl until light and fluffy, about 4-5 minutes. Add eggs one at a time and beat until incorporated, scraping down sides of bowl if needed. Reduce speed to medium-low, add sour cream, vanilla, and mashed bananas; beat until combined. The mixture may look grainy and broken at this point, but don’t fret! It will emulsify when the dry ingredients are added.Step 4Reduce mixer speed to low and gradually add dry ingredients, beating just until incorporated (do not overmix or cake will become tough). Fold in chocolate.Step 5Scrape batter into prepared pan and smooth top. Slice remaining banana lengthwise into 3 equally thick planks and place on top of cake, cut sides up. Sprinkle batter, as well as bananas, with demerara sugar.Step 6Bake cake until a tester inserted into the center comes out clean (there may be some melted chocolate residue left on the tester, which is fine), 65–75 minutes.Step 7Transfer pan to a wire rack and let cake cool completely. Using parchment overhang, lift cake from pan and serve.How would you rate Blackout Chocolate Banana Bread?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleThis recipe is really good. \nI substituted creme fraiche  for sour cream, and  omitted choc chips , otherwise I followed the recipe. I sliced the bananas very thinly and baked in the Bundt tin of similar size. \nCake turned out moist, flavorful and the sliced bananas caramelised beautifully. Thank you for the great recipe. TeckSingapore6/30/2021I swapped sour milk for the sour cream (didn't have any), and cut the sugar because I almost always cut the sugar. The batter was a little liquid for me (maybe because of sour milk) so I added a bit more flour to compensate. These are good, but not mind blowing. I will likely go back to my standard banana bread recipe and add cocoa and chocolate chips next time.AnonymousOttawa, Canada6/10/2021Absolutely brilliant. I could have it for dessert. I swapped the whole wheat for Finger millet flour as I had that around and was feeling experimental. That rendered it even more a deeper colour and nutty texture. Also swapped sour cream for yogurt. \nThis is a keeper for sure! Karen India 3/12/2021So good. I subbed buttermilk for the sour cream and swapped in 1/4 cup of buckwheat flour. Super delicious. I’m gonna skip the banana on top next time — it sank into the cake and was kinda weird. Demerara on top added awesome crunch.chelseamorseAstoria, NY7/13/2020This was so good! It turned out exactly how I wanted it. I skipped the bananas on top because I didn't have 5 ripe bananas only 4. I also didn't have demerara sugar so I just sprinkled a little brown sugar over the top. Super delish!AnonymousMinnesota6/10/2020If Molly doesn't like chocolate how did she develop this recipe?\nAnonymousMinneapolis, MN6/10/2020This recipe is a winner! Easy to make, and it tastes wonderful. I have also made the Alison Roman chocolate banana bread but prefer this recipe. They seem similar on the page, but AR's turns out dry and crumbly for me.AnonymousIndianapolis5/27/2020Scrumptious!  Make this recipe.  Made exactly as is(except sugar on top), wouldn't bother with the banana on top, chocolate chips or parchment.  will be making this often...Anonymous5/6/2020Insane knock out. I used a very dark, molassesy brown sugar from Japan that gave it a slightly coffee complex bitterness. Here I come, quarantine 15. CGJ LALos Angeles, CA4/4/2020I think you ripped this off from Alison RomanAnonymousBrooklyn3/24/2020The whole wheat flour is what really makes this, so I would definitely try not to skip it. I think it's still a little heavy on the chocolate; next time I make it, I'm skipping the demerara sugar and the chocolate chips (and for reference, I'm someone who gets annoyed when most people refer to things as 'too sweet' as I have an aggressive sweet tooth), but I'll definitely make it again.\n\nI do have to laugh about the fact that my sliced bananas on top sunk completely into the cake. I actually really liked that; I tried it while still warm and had a little molten banana, THERE'S a new thing. But it definitely takes away from the nice visual aspect if, like me, you rely upon instagram likes to offset the caloric intake of your bakes.AnonymousSan Francisco3/15/2020This was excellent. I made half a batch and put it in an 8x8 pan, which made it only take about 40, 45 minutes. I omiited the demerara sugar since we didn't have any; in my opinion, it's unnecessary because it was perfect without it. I also didn't have wheat flour so I used 1 cup white flour and 1/4 cup wheat germ. Lastly, I topped it with several round slices instead of lengthwise slices. This recipe is a keeper for me.Anonymouscurrently living in S. Korea2/28/2020I made this a few weeks ago and it was amazing. Having read the comments, and since I only have an 8.5\" pan, I made a \"sidecar\" cake in a small loaf pan (maybe a 4\"x3\"x2\" pan?), which was perfect. It is more like a cake than a bread, definitely dessert-y. I have made Alison Roman's chocolate banana bread, too, and though the ingredients and preparation are very similar, I liked this one much more. AnonymousNYC1/13/2020This banana bread is easy and delicious! My only negative feedback is that even though I used a 9x5 loaf pan, a lot of the batter spilled over the edges while baking. Luckily I thought it looked a bit too full before putting it in the oven so I put it on top of a sheet pan, which contained the mess. I'll definitely make this again regardless! AnonymousBoston1/13/2020Awesome recipe. For any other non Americans I have the ingredients with metric conversion:\n¾ cup all-purpose flour + ½ cup whole wheat flour so 1 and 1/4 (150g) \n⅓ cup unsweetened cocoa powder (42g)\n1¼ teaspoons baking soda\n¾ teaspoon baking powder\n1 teaspoon kosher salt\n5 large very ripe bananas, divided\n1 cup plus 2 tablespoons light brown sugar (224g)\n6 tablespoons unsalted butter, room temperature (86g)\n2 large eggs\n⅓ cup sour cream (80g)\n1 teaspoon vanilla extract\n4 ounces bittersweet chocolate, chopped (114g)\n1 tablespoon demerara sugarAnonymous1/5/2020Explore Bon AppétitBreadDessertBananaFruitCocoaOther IngredientsChocolateEasySheet-Pan DinnersSnackNut-FreeBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-12", "author": ["Condé Nast", "Molly Baz"]}