{"id": "289da3896af49631c72e40f1abc0a4dc", "url": "https://www.bonappetit.com/story/little-glass-teapot", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "The Little Glass Teapot I Love So Much I Bought 2 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Little Glass Teapot I Love So Much I Bought 2The lid has a built-in strainer, which is cool. But also: It’s adorable.By Alex BeggsSeptember 20, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ll never forget the time editor-at-large Christine Muhlke told me, “The third steep is my favorite,” over a pot of oolong at Té Company. Will I ever be this sophisticated? I wondered, spilling yuzu linzer cookie crumbs down my pilled sweater. I’ve been trying to recreate that moment, and the ritual, ever since—at my cold, corporate cubicle surrounded by clutter and cookbooks.What I spent weeks intensely searching the Internet for—and real houseware stores with hovering salespeople—was a tiny, desk-sized teapot that I could make loose leaf tea in, one and a half cups at a time, with the option to re-steep up to three times. Is that so much to ask???It was a very snobby and silly search.What I finally landed on was Kinto’s Cast teapot, a short and squat and very adorable 15-ounce glass pot with a stainless steel lid that has a built-in strainer à la French press. (The cup-style strainers drive me crazy, like cleaning out the dish drain after someone dumped their leftover salad in it.) This is a (mostly) decorative teapot that you pour hot (NOT BOILING)* water into, maybe from an electric tea kettle with thermostat in the office kitchenette, and then take to your desk with some kind of butter cookie option. It’s not here to keep your tea scalding and oversteeped for hours. It’s for beauty.It might also be to distract, or get me in the mindset, of being at work, on deadline.\nPhoto by Chelsie CraigThe glass, ghostly teapot showcases the unfurling of jasmine pearls into oceanic detritus, like something you’d watch for 45 minutes in a Cate Blanchett-narrated nature documentary. The kind you pay $35 to see in IMAX. Watching tea leaves expand and wave about inside the Cast teapot has a hypnotic, lava lamp quality without the kitsch, or a Betta fish without the responsibility of parenthood.Have I gone too far or not far enough?After a few minutes of steep time, pour the tea into an equally delicate and unnecessarily beautiful cup—like this lovely glass one from Paola Navone, which allows you to see the color of the tea. Then refill the pot with more water for round two, then three, and if that sounds crazy to you, just ask Christine. The tea transforms upon each re-steeping, which might be the most pretentious thing I’ve ever typed, but it’s true! A bitter green tea might become smooth and vegetal, and I think that’s very cool. I have simple needs.I bought two. One for me, one for my sister, who likes everything that I like in the way that younger sisters do. Also because it was, and is, on sale right now at Argo Tea and if you spend over $50 shipping is free, and if you give a mouse a cookie…she’s going to need some tea to wash it down.Photo by Chelsie CraigBuy it: KINTO Cast teapot, $30 at Argo Tea, or get the 24 ounce from Kinto’s site for $33*P.S. Boiling makes some of the oxygen in water evaporate, oxygen you want to bring out the flavors of the tea, depending on the type. Read more about that, and this whole three-steep idea, in The Tea Sommelier, a fun and fascinating new book about making and drinking tea, which goes into some things touched up here in greater historical and scientific detail. Nerd out!A cookie for your thoughts:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitTeaShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Alex Beggs"]}