{"id": "28a46a81f646f2a19b9a035c07751efd", "url": "https://www.bonappetit.com/story/best-can-opener-oxo-smooth-edge", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "This Can Opener Never Gets Gunk on It and I Love It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Oxo Smooth Edge Can Opener Never Gets Gunk on It and I Love ItModern technology is cool, but this can opener will outlast us all.By Alex BeggsDecember 8, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Sure, a lot of cans “nowadays” come with tabs to open them, but not ALL cans. Especially the cheapest brands on the shelf, which are my favorites. A person needs a can opener.But too many can openers in this country are crusty with gunk, rusty with rust, and dusty with dust! Enough is enough. Invest a small fortune of $23 into this superior, smooth—so smooth—tool, which we've also ranked as one of our favorite can openers. The Oxo Smooth Edge can opener is clunky yet curvy and a little phallic in the way everything is if you cross your eyes long enough.Looking at life sideways is actually how the Oxo Smooth Edge can opener functions so expertly. You have to think sideways too. It took me awhile to figure out how to use it at my in-laws’ last year, but with enough practice and the encouraging words of Cath asking me “to show you one more time?”—I got there.Instead of stabbing down into your can of Manwich and cranking into the manly, meaty mush below, it stabs the SIDE of the can’s lid and cuts neatly around it. Instead of teeter-totter-tilting a sharp-edged piece of metal out of the can with your fingers, now coated in sloppy joe guts, you can use the small clamp on the opener to remove the lid cleanly.If you’re still curious (or confused), you can watch Paula—an Oxo superfan who won a contest to find out who is the biggest Oxo-holic—show how to use it in this YouTube video with a bow chicka wow wow soundtrack. Paula, I’m with you. It’s a great can opener.Nota bene: Because the cutting mechanism never comes in contact with the can’s contents, you don’t even have to wash, rinse, or swipe it with a paper towel after use. Put it back into the junk drawer from whence it came until next time.Your cans don’t know what’s coming:Photo by Laura MurrayOXO Good Grips® Smooth Edge Can Opener$22 at Amazon$23 at Bed Bath & BeyondExplore Bon AppétitShoppingWhat To BuyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-08", "author": ["Condé Nast", "Alex Beggs"]}