{"id": "28bd3be83b653223ebc823b68f4edf08", "url": "https://www.bonappetit.com/story/can-you-eat-sprouted-potatoes", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Can You Eat Sprouted Potatoes? What About Green Potatoes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingReal Talk: Can You Eat Sprouted Potatoes?The potatoes have eyes.By Antara Sinha and Amiel StanekNovember 10, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailWe’ve all been there: You ambitiously purchased the XL bag of potatoes, cooked through a few, and forgot about the rest in the back of your pantry—only to uncover something extraterrestrial-looking a couple of weeks later. What should your next move be? Do you trash them or try to salvage the neglected spuds? The question at hand: Can you eat sprouted potatoes? What about green, discolored, or otherwise ailing spuds?So can you eat sprouted potatoes?The short answer: It depends. When potatoes begin to sprout, the growths (those roots, eyes, and bumps) have a high concentration of compounds called glycoalkaloids that can cause a sharp, unpleasant, bitter taste. For most people you’re not likely to see any ill effects from negligible amounts—in fact, one of those compounds, called solanine, is the same compound that occurs naturally in eggplants, tomatoes, and peppers (a class of plants known as nightshades). In large quantities, however—like in those roots and shoots popping up in the back of your pantry—it can be toxic.If you’ve got otherwise good-looking potatoes that have a few small sprouts, you can carefully remove them with a paring knife—make sure to really get in there and cut around the sprouts, excising any roots, bumps, and eyes—and go about your business. They’ll be fine and just as tasty when you cook them (even if they aren’t looking their best when they’re raw).But if those spuds look like they’ve grown arms and legs and are ready to put up a fight—we’re talking super-long roots, potato eyes that look like they’re staring back at you, extensive growths that are reaching for the sun, it’s probably best to toss them. Large sprouts, growths, and roots will not only be unpleasant to eat, but, in the worst cases, can also make you really sick. Symptoms of poisoning from solanine (the specific type of those harmful compounds found in spoiled potatoes) include everything from a fever and headache to a severely upset stomach.Okay, but what if they’re green?Potatoes that have been exposed to light will begin to produce chlorophyll (green, harmless) as well as solanine. If the green color on your taters is light and mostly skin-deep, peel ’em well to remove the green parts and sally forth, but if they have any more color than that, you’re better off pitching them.And what about those dark spots?If you peel potatoes and find a few dark or discolored spots on the flesh, don’t sweat it—this is likely the result of bruising during transport, or concentrations of natural sugars. Just cut those little spots out (they’re not exactly cute) and proceed.In summary: It’s likely not worth it to save a few spuds past their prime if they’re sprouted and/or green. Play it safe and throw out or compost any potatoes that are severely blighted and save yourself—and your stomach—from a rough time.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-10", "author": ["Condé Nast", "Antara Sinha", "Amiel Stanek"]}