{"id": "28bd0d1bed45390b991005b9f4f4e2a2", "url": "https://www.bonappetit.com/recipe/toasted-pecan-torte-with-butterscotch-topping", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Pecan Torte with Butterscotch Topping Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueToasted Pecan Torte with Butterscotch ToppingBy Claire SaffitzOctober 16, 20182.5(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis low-profile torte is elegant, understated, and—here's the key—make-ahead-able. Plus, it eats like a cross between a pecan pie, sticky toffee pudding, and a butterscotch sundae.Ingredients8 servings 1¼cups (2½ sticks) unsalted butter, room temperature, divided, plus more for pan1½cups all-purpose flour, plus more for pan4½cups pecan halves2¼tsp. baking powder1¾tsp. kosher salt, divided1cup granulated sugar1Tbsp. finely grated orange zest3large eggs, room temperature4Tbsp. rum, divided½cup (packed) dark brown sugar1½cups chilled heavy cream, dividedSpecial EquipmentA 9\"-diameter springform panPreparationStep 1Place a rack in middle of oven; preheat to 350°. Butter and flour pan. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened in color and fragrant, 12–15 minutes. Let cool.Step 2Pulse baking powder, 1 tsp. salt, 1½ cups flour, and 2½ cups pecans in a food processor until nuts are finely ground. Using an electric mixer on medium-high speed, beat granulated sugar, orange zest, and 1 cup butter in a large bowl, scraping down sides, until light and fluffy, about 5 minutes. Add eggs to bowl. Beat until combined and mixture is even fluffier, about 1 minute. Beat in 3 Tbsp. rum; stop mixer and add dry ingredients. Mix on low speed just until combined, then fold a few times with a rubber spatula, scraping bottom and sides of bowl, to ensure batter is evenly mixed. Scrape batter into prepared pan and smooth top.Step 3Bake torte until golden brown and a tester inserted into the center comes out clean, 45–50 minutes. Transfer pan to a wire rack and let torte cool in pan.Step 4Meanwhile, bring brown sugar, ½ cup cream, remaining ¼ cup butter, and remaining 1 Tbsp. rum to a boil in a small saucepan over medium heat, stirring often, and cook until slightly thickened, about 3 minutes. Remove butterscotch from heat and stir in remaining ¾ tsp. salt. Mix in remaining 2 cups pecans and let sit at room temperature, stirring occasionally, until butterscotch is cool but still pourable.Step 5Spread topping over torte.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Whisk remaining 1 cup cream in a large bowl to medium peaks. Serve torte topped with dollops of whipped cream.Step 7Do Ahead: Topping (without pecans) can be made 3 days ahead; cover and chill. Reheat over low before mixing in the nuts. Torte can be baked 1 day ahead; store tightly wrapped at room temperature.How would you rate Toasted Pecan Torte with Butterscotch Topping?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleMade this today and after reading the reviews I remembered what happens when I over-roast nuts for nut butter and how mealy and dry it is without adding more oil. I would guess that most with issues here are experiencing a similar effect. I reduced the roasting time for the nuts in the cake to ~5 minutes, and while the batter was still pretty thick, I don't get the sense that it will be overly dry. SeanRochester, NY11/24/2021has become a thanksgiving staple in our house, superseding even pumpkin pie. I don't know what the complaints are about. It's a little dry, but it has amazing sauce that people adore. I double the topping because it's so good....it look glorious too, especially atop a cake stand.AnonymousMillerton NY11/14/2021I made this with adjustments to the amount of pecans by almost half  and watched the cooking like a hawk. It was cooked perfectly. Any less and the centre would definitely have been underdone, yet as almost every other review said, even with these adjustments, the cake is SO dry. It definitely isn’t quite right even with adjustments.\nThe flavour profile is very unusual and absolutely delicious, sort of like a Christmas pudding without fruit. If I was to make this again I might try almond meal in place of some of the flour, something needs to give this cake MOISTURE. It is crying out for it and drowning it in sauce and cream after the fact trying to counteract this just makes it too rich.Mali brownPerth WESTERN AUSTRALIA1/1/2021I loved this recipe! It was beautiful and delicious! The torte was a drier texture that was really well balanced by the butterscotch topping.  Would definitely make again.Anonymous5/15/2020I ran into similar issues as other reviewers - cake was extremely dry and mealy. The topping was overly sweet. It felt like a waste of pecans.AnonymousDallas10/28/2019Great!!! I only used 1 cup of pecans when processing the flour mixture, and the cake only neede day to bake for 35 minutes (though my oven runs a bit hot). I recommend this with adjustments!AnonymousSacramento12/26/2018I was so disappointed with this recipe!  What a waste of money on all of those expensive pecans!  I made the recipe as printed in the magazine but see now that it's been updated.  This was nowhere near a sticky pudding!  It was a dry sandy hockey puck!  I love BA and watch all of the videos on FB but this was a huge test kitchen fail - at Thanksgiving to boot!snegriPitts11/26/2018After reading the reviews I was nervous to make this as the only dessert for Thanksgiving, but still thought it sounded good enough to try so I decided I would make this but also have a back up. I took one reviewer's suggestion and used only 1 c toasted pecans in the cake batter and while the torte was dense, it was also delicious and voted best of the 3 desserts I made! The orange zest is so nice in this recipe. I chopped up the pecans in the sauce just to make them spread more evenly. I also doubled the sauce because I LOVE butterscotch sauce and this one was so incredibly easy and would be fantastic on just about anything. I tried the cake the next day and it was indeed pretty crumbly. I wonder if there's a syrup that could be poured on once it's baked to make it a bit more moist?AnonymousCincinnati11/25/2018Should have said batter \"was NOT crumbly\".DessertGirlOregon11/23/2018OK, I read all of the reviews after I made the torte.  I used the recipe from the magazine.  My batter was crumbly, but was very thick.  I baked it on Convection Bake 325 for 40 min.  I was worried based on the review that the cake would be dry but it turned out moist.  When I made the topping I thought it could probably use more, so I made another batch.  The topping is salty to the taste alone, but with the cake is very yummy.  A double batch of topping is too much.  I think 1 1/2 would be perfect using the 2 cups pecans.  I also wonder about putting the topping on the torte when it is still warm.  I might try that next time.  Everyone enjoyed the torte at our Thanksgiving.DessertGirlOregon11/23/2018How could BA do this too is at Thanksgiving!? This recipe obviously was not tested. Not professional of you to do that. Please suggest to the intern who did this they might look at another field. rob linneNew York11/23/2018The changes BA made to this recipe didn’t save it from being a dry cake. I made it today for Thanksgiving and predicted after seeing the stiff batter that it wasn’t going to be moist. Disappointing for the effort that’s required. The topping is good but go easy on the salt and the rum, I had to add additional cream to tone down both flavors. Will not be making this again.AnonymousDurham, NC11/23/2018Oh, jeeze. I just ground up the pecans with the flour and now I see all these reviews. I have too many pecans for the revised recipe. Disaster. No way I'm starting again; will toss and find another recipe for dessert for tomorrow. Thank goodness started today.Anonymous11/21/2018I made this recipe a few days ago...saw the bad reviews and cut the amount of pecans in the cake batter (by about half) and it came out great! Moist and a nice vehicle for the butterscotch. Will double the butterscotch recipe next time too. It's so good, I wanted every bite drenched in it. AnonymousLos Angeles11/20/2018Thanks to everyone who left a review. We took your feedback into consideration and changed the quantities of butter and eggs. Do let us know if you end up trying this again!Bon_AppetitNew York, NY11/19/2018Explore Bon AppétitCakeDessertEuropeanAustrianAmericanPecanNutOrangeCitrusFruitRumAlcohol & Other DrinksFallBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}