{"id": "28e77b35caec3692b749fdb6e7fc090d", "url": "https://www.bonappetit.com/story/george-motz-smash-burger", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "I Thought the Smash Burger Couldn’t Get Better—Then I Tried This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Thought the Smash Burger Couldn’t Get Better—Then I Tried ThisA mess of caramelized onions is a smash burger upgrade you deserve. Editor in chief Adam Rapoport explains George Motz’s technique in his weekly newsletter.By Adam RapoportOctober 23, 2018FacebookTwitterEmailPhoto by Daniel TopeteFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I found my new smash burgerYou ever have that experience where you think you know what you’re doing, only to realize you have no clue whatsoever? I got my wake up call last Tuesday.For years now, I thought I was Mister Smash Burger—you know the lacy, crispy griddled patties, glossed with American cheese, slathered with special sauce, and sandwiched between squishy buns. The kind you get at Shake Shack or In-n-Out.Want this letter before it hits the website? Sign up for our newsletter!They’re so easy to make at home that I’ve shot not one, but two videos about how to master them—one indoors and one on your grill. I even wrote an editor’s letter about them for the magazine.But then we invited George Motz to the BA Test Kitchen last week. Motz does smash burger popups from Paris to Sao Paolo, he literally wrote the book on burgers, he directed a documentary on them, and we talked all things burger on the BA Foodcast earlier this year. And he took me to school.We were hosting a party for our Hot 10-winning chefs the night before our annual Best New Restaurants bash. Motz, we figured, could smash burgers so the rest of us could take the night off.Photo by Daniel TopeteHe let us know he would be making his fried-onion burgers. No ketchup, no mustard, no special sauce. No lettuce or tomato. Just patties, American cheese and onions. We were...skeptical. But then he got to work.He formed 3-ounce meat balls the size of, well, a meatball. He set them on a searing hot griddle, and topped them with a tangle of whispy-thin shaved Vidalia onions and a sprinkle of salt. Then, WHAM! He smashed the balls with his his heavy-duty Smashula—like a judge bringing down the gavel. The flattened meat merged with the onions, and simmered away in its own fat.After a couple minutes, he flipped the patties, topped each with a slice of American cheese, and then topped them with slider-size potato buns to “let em ride,” so the buns could absorb all the steam and fat from the grill.And just like that, after about four minutes total, he slid two cheesed patties between the moist buns, caramelized onion whisps hanging out the side. No condiments, just some dill pickle chips to wedge in there.And man, oh man—we were all floored. We couldn’t wrap our heads around the depth of flavor and texture these burgers delivered: crispy, gooey, salty, sweet. They didn’t need a thing.Motz was kind enough to gift me one of his iron-strong, made-to-order Smashulas. And I’m going to put it to work this weekend. I know I’ll start with freshly ground chuck that’s 80 percent lean, 20 percent fat. That’s non negotiable.I’ll form smaller-portioned patties than I usually do. I’ll shave sweet onions on a mandoline so they’re basically translucent. I’ll smash my patties with authority. And then I’ll double them up. As George likes to point out, you get four crispy sides this way, instead of just two.And then I’ll say no to the ketchup and mayo. If they’re half as good as George’s, they won’t need a thing.Get the classic smash burger recipe—but then add lots of onions to the griddle!The BA Smash BurgerView RecipeExplore Bon AppétitBurgersAdam NewsletterRead MoretechniquesYou 10000000% Need a Cast-Iron GriddleBy Amiel StanekcookingHow to Make Special Sauce, a Perfect CondimentBy Alex DelanyThe BA Smash BurgerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Adam Rapoport"]}