{"id": "28e8fdcc4a01273a3310efbcf610f19e", "url": "https://www.bonappetit.com/recipe/lacquered-rib-eye", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Lacquered Rib Eye Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueLacquered Rib EyeBy Chris MoroccoJune 2, 20204.5(15)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThe polar opposite of a marinade, this umami-rich lacquer works all of its savory magic in the final minutes of cooking. The signature piquance of fish sauce in the glaze mellows as it caramelizes on the grill, resulting in a nutty complexity similar to the alluring funk of dry-aged beef. As the steak gets flipped and brushed, that salty-sticky-sweet lacquer hardens in layers to create an über-savory capital-C Crust, an irresistible layer akin to the bark that’s beloved by barbecue enthusiasts.Ingredients2–4 servings¼cup sherry vinegar or red wine vinegar2Tbsp. soy sauce1Tbsp. fish sauce2tsp. sugar1garlic clove, crushedVegetable oil (for grill)12–2½-lb. bone-in rib eye (about 2\" thick), preferably prime or as well-marbled as you can findKosher saltExtra-virgin olive oil (for drizzling)Flaky sea saltLemon wedges (for serving)PreparationStep 1Bring vinegar, soy sauce, fish sauce, sugar, and garlic to a simmer in a small saucepan over medium-high heat. Reduce heat and gently simmer until reduced by about half (it will still be fairly loose and won’t yet coat a spoon), 6–8 minutes. Set sauce aside.Step 2Prepare a grill for high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); oil grate with vegetable oil. Season steak generously with kosher salt. Grill over direct heat, turning every minute, until deeply browned on all sides (including standing it on its side with tongs to render fat cap), 6–8 minutes.Step 3Move steak over indirect heat and grill, turning every 1–2 minutes and moving closer to or farther away from heat as needed to build even color, until an instant-read thermometer inserted into the thickest part of steak registers 100°, 10–12 minutes. Start basting steak. Continue to grill, turning and basting with a light coating of sauce and moving closer to or farther away from heat as needed to create a deep crust on steak without scorching, until very dark brown and thermometer registers 120° for medium-rare (internal temperature should climb to about 130° as steak rests), about 10 minutes. Transfer steak to a wire rack set inside a rimmed baking sheet and let rest 15–30 minutes.Step 4Transfer steak to a cutting board and slice into thick strips. Arrange on a platter; drizzle with olive oil and sprinkle with sea salt. Serve with lemon wedges.How would you rate Lacquered Rib Eye?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI too would like to know if this is possible using a reverse sear.Drew HOith7/30/2021Amazing!AnonymousDetroit, MI5/28/2021Is it possible to do this recipe with a reverse sear, and apply the glaze before searing? Guessing no... but open to thoughtsAnonymousNew York, NY1/10/2021Applied the technique to a NY strip and subbed in Worcestershire (so?) sauce for fish sauce because I was somehow out. Will try again, it turned out moist and delicious. AnonymousMinneapolis 7/1/2020This issue of BA was a hit. Tons of great recipes. Overall, it is a satisfying recipe to make on the grill, and one for those who really like to be attentive over the grill. The lacquer is spot on umami. The 6-8 minute cook to reduce the lacquer will give you less than half, so maybe pull at 4-5 minutes and check.  I've made this recipe twice, once with a tomahawk ribeye and one just bone in. Both times turned out excellent. Both cooks I kept the bone toward the hot side of the grill in hopes of the thickest part cooking closely to the exposed fat cap. It's definitely a keeper, especially as the main parts of the lacquer tend to find a long home in the cabinet. greengoFalls Church, VA6/18/2020Oops, sorry. Please ignore my comment. I guess I can't read. Looking forward to trying this.AnonymousDana Point6/12/2020I saw this in the magazine. The recipe instructions do not say when to apply the sauce.mkangasDana Point6/12/2020Explore Bon AppétitRib Eye SteakSteakBeefMeatMainNut-FreeDairy-FreeKetoGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}