{"id": "28fa42a1758f70302238427f275b3218", "url": "https://www.bonappetit.com/story/frozen-puff-pastry", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Frozen Puff Pastry Exists To Make You Look Very Impressive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFrozen Puff Pastry Exists To Make You Look Very, Very Impressive “Oh, this old thing?\" By Sarah JampelNovember 4, 2019FacebookTwitterEmailFacebookTwitterEmailFrozen puff pastry is like a good jumpsuit (or muumuu): With zero effort, you’ll get impressive-looking results and lots of compliments—over and over and over again. Look at you, a put-together-person who baked something buttery, flaky, and heavenly and dressed yourself like an adult. It’s like no one seems to realize how easy it is.It’s almost as if humans have some evolutionary short-term memory block that prevents us from remembering how every single time puff pastry goes into the oven, it fills the kitchen with wafts of butter (wafts of butter!) and emerges, swelling its perfectly-bronzed chest. We’re impressed no matter how many times we’ve seen it before.Let me tell you a true story—the facts, if you will. At a recent baby shower for a friend, where there were homemade cinnamon rolls (ahem, mine) and all of your typical egg-based brunch dishes (a lotta frittata and strata), as well as a bowl of Ruffles Original potato chips, what people really went wild for was the puff pastry my friend Ali brought: She simply rolled out a sheet of puff pastry, baked it, then covered the top (which bubbled up wildly in the oven) with a lemony herb salad.Puff the magic pastry.\nCondé Nast EntertainmentIf you really want to, you can make your own puff pastry at home, but the frozen store-bought puff—sometimes we splurge for the $$$ brand Dufour, but the more affordable Pepperidge Farm will also work—is a reliable, consistent product that delivers those rich layers in a fraction of the time.With a box of frozen puff pastry, you have cheese twists, pandowdy, a fancy galette, and even a skillet pot pie at your fingertips. The power! The possibility!And while most recipes (and most wise people) would advise you to thaw the pastry in the fridge in its box overnight…there is a workaround. When I forget—which I inevitably do—to transfer it from the freezer to the fridge, I put my puff pastry on a baking sheet, unrolled, then check on it in 10 minutes, at which point it’s usually flexible enough to unfurl. After another 5, it will be good to go.Just like that, you’re on your way to a puff pastry masterpiece that will put another friend’s homemade cinnamon rolls to shame. Not that I’m bitter or anything.Get the recipe:Spinach and Feta Tarte SoleilThe most impressive appetizer to “casually” pull out of the oven when your friends come over (and it also happens to make a nice Thanksgiving snack for while the turkey rests—just sayin').View RecipeExplore Bon AppétitPuff Pastry DoughRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-04", "author": ["Condé Nast", "Sarah Jampel"]}