{"id": "29213d9bcaa89be3307833cf92c67e8e", "url": "https://www.bonappetit.com/story/holiday-drinks-recipes", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "4 Holiday Cocktails to Match Whatever Celebratory Mood You’re In | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 20204 Holiday Cocktails to Match Whatever Celebratory Mood You’re InWish you were by the pool? How about a cozy cabin? There’s a drink for that.By Alex DelanyDecember 1, 2020FacebookTwitterEmailPhoto by Yudi ElaFacebookTwitterEmailWelcome to The Pour, a monthly column about what we’re drinking right now.A holiday cocktail can go in just about any direction, depending on the occasion, the crowd, or, hell, even just how your day’s been going. Which is why for our Holiday Issue this year, we asked some of our favorite booze professionals to make us, well, whatever they wanted to make us for the holidays. And they delivered. Below, we’ve got a recipe to fit whatever vibe you’re feeling. The Fireside MovePhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioWe use orgeat quite a bit at the restaurants. Traditionally it’s an almond syrup, but we’ve made it with everything from walnuts to pistachios. It gives a beautiful toasted nut flavor to a cocktail. Here I used pecans because they remind me of the family pecan tree at my grandparents’ house in Fayetteville, GA. Roasted pecans. Warm baking spices. Citrusy, caramelly Amaro Montenegro. A bit of spicy rye whiskey. They all work well together to create a cocktail that feels toasty. That’s what I love in a winter drink. —Joseph Stinchcomb, beverage director at Saint Leo, Oxford, MSGet the Recipe »The Sparkling Pre-Midnight MovePhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEveryone loves something sparkly for the holidays. And by adding absinthe—which is higher proof and packed with warm flavors—even the least fancy glass of bubbly feels special. Whatever bubbly you have on hand works: Champagne, Prosecco, cava…any of these will bring the party and leave whoever you’re toasting feeling wonderful. —Chelsea Gregoire, owner and consultant at Drinkable GeniusGet the Recipe »The Non-Alcoholic MovePhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioI originally created this as a nonalcoholic pairing for a dessert course. The roasted, earthy notes of the hōjicha (roasted green tea) carry the warming toasted baking spices for a comforting low-caffeine wintertime brew. Now I make this for my husband and myself at home all the time. I love it with shortbread cookies and coffee cake in the morning or with ice cream at night. My parents are back home in Japan and I sent my mom this recipe for a gathering they had last year. She made a big batch and kept it warm in the Crock-Pot for guests to serve themselves. There’s no situation where this wouldn’t be good. —Julia Momose, creative director, Kumiko, ChicagoGet the Recipe »The Not-So-Snowy MovePhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioI want a holiday cocktail that brings me to the pool. I’m that person (usually joined by all my cousins) who drinks tequila at Christmas. Here I make it even beachier with fresh citrus juice, a little bit of red pepper jelly heat and a generous pour of crisp Mexican-style lager. When it comes to the beer, I’m all about Victoria or Pacifico, but I’ll let you go with whatever brand you like, just as long as it’s light and takes you straight to the cabana. —Tiffanie Barriere, drinks educator at The Drinking CoachGet the Recipe »Want more holiday cocktail recipes? We’ve got you covered…Explore Bon AppétitHoliday 2020The PourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Alex Delany"]}