{"id": "2942c5ba292779bbe31fdec48d22b743", "url": "https://www.bonappetit.com/story/molten-caramel-cakes-dulce-de-leche", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Love Is Cool But Molten Caramel Cake Will Never Ghost You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLove Is Cool But Molten Caramel Cake Will Never Ghost YouThis dulce de leche dessert is one way to say I love you—but you should probably also say that.By Alex BeggsFebruary 8, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe no. 1 clichéd Valentine’s Day restaurant dessert is molten chocolate cake. Maybe there’s something lovey-dovey written in chocolate sauce on the edge of the plate like “Love ya, sweetcheeks.” A piano guy plays instrumental Phil Collins in the background. LOVE IS SO BEAUTIFUL! The chocolate oozes out of the center, and you realize it’s a metaphor. Your heart melts.Kisskisskiss!Or something like that. At home, no one goes full molten chocolate cake. It requires making a cake, and a ganache, and doing all kinds of cake gymnastics to make sure the sponge is tender and cooked, the ganache properly melted and silky. It’s a lot.THIS YEAR IT’S GOING TO BE DIFFERENT. Chris Morocco wanted a Valentine Day’s dessert that wasn’t cheesy, difficult, or overdone. (Sorry red velvet, that means you.) Then Chris had an undisputed good idea: molten caramel cake. “Yes we want that,”—said everyone at the ideas meeting.Gimme that oozy center!\nPhoto by Chelsie Craig, Food Styling by Pearl JonesWhen he first began developing the recipe, he made his own caramel. “It was a whole thing,” he sighed. But since store-bought dulce de leche is so good, we went with that instead. (Ease, remember?) FYI, the Bon Appétit Test Kitchen uses San Ignacio or La Serenisima. Here’s the breakdown:The sponge of the caramel cake has dulce de leche in it too, plus the usual cake ingredients (flour, butter, egg, sugar, vanilla, salt). It ends up nutty and toasty from the caramelized milk. Plus, it's plenty salty (in a good way) and moist.The molten filling is dulce de leche with butter added to it. The water in the butter (yes butter has water!) helps the mixture chill and firm up in the freezer, which makes it near solid so that it doesn’t sink into the cake batter. Important!The technique is two steps. Fill sugar-and-butter lined ramekins (this recipe makes four cakes) with cake batter. Make a half-inch divot in the center of the batter and plop the dulce de leche there, right on top. Any deeper and it might sink to the bottom. No need to add more cake batter on top, it’ll all work out I swear. The cakes are done when a tester on the side of the cake, in the sponge part (not the molten center), comes out clean. Invert them onto a plate and say something romantic, something French, like: “voila!” And profess your love for whatever or whoever you’re loving this Valentine’s Day. It might just be this cake.Get the recipe:Molten Caramel CakesEverybody has heard of molten chocolate cake, so we thought we’d try to create a caramel version, with a toffee-ish tender cake encasing a runny dulce de leche center.View RecipeBuy It: San Ignacio Dulce de Leche 2-pack, $20 on amazon.com.Buy It: La Serenisima Dulce de Leche 400gm, $17 on amazon.com.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitValentines DayCaramelDulce de LecheCakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-08", "author": ["Condé Nast", "Alex Beggs"]}