{"id": "2949bf2dddd6babe09ab76d8e3fd9dfa", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/parks-bbq", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Park's BBQ Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesPark’s BBQA Korean barbecue king in KoreatownFacebookPinterestTwitterEmailCourtesy of Park's BBQGO: to Park’s BBQ for the best Korean barbecue in the heart of K-Town, a bold (but true) claim for the constantly changing neighborhood with more smoke-filled barbecue spots per square mile than some major cities. Park’s is king for a reason.ORDER THE: sweet-savory galbi, glistening pork belly, crispy seafood pancake, and, hell, the Wagyu, if you’re ready to party with some ice-cold soju and the wonderful array of banchan.THE VIBE IS: pretty eclectic but very L.A. You’ll find Korean families alongside K-pop stars, diplomats, and chefs sitting at tableside grills and under big metal tubes, like they’re about to be beamed up to meaty heaven.PRACTICAL STUFF: Open every day: Sunday to Thursday, 11 a.m. to 11 p.m., and Friday and Saturday, 11 a.m. to midnight.—Elyse InamineWE ALSO LOVEThe Walker InnFor when you want something quiet, cool, and intimate in KoreatownGrand Central MarketL.A.’s best bites under one downtown roofRiceBarEverything’s coming up rice bowls in downtown L.A.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}