{"id": "294a5241b67ecdd98d1506e96d792bfc", "url": "https://www.bonappetit.com/city-guides/new-york/venue/ko", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Momofuku Ko Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkMomofuku KoHang out with chefs at David Chang’s continually groundbreaking spot in the East VillageFacebookPinterestTwitterEmailZack DeZonGO HERE: for a wildly inventive tasting menu, presented warmly by cooks who seem to be having as much fun as you. This is where you go on your birthday, anniversary, or the day you get a raise. It’s a special occasion spot, but for all other occasions, hit the bar.ORDER THE: the tasting menu for $255, please. At the bar, however, you can order à la carte. Musts: the fried chicken, fried four times and served cold (go with it); the tangy-nutty sourdough crepes (eat with your hands); foie gras pork pie (you’re here, aren’t you?); and the crudo in a bowl-licking sauce. However, the menu changes daily, written in near-illegible notebooks, so best to ask for the verbal version. Don’t sleep on the wines by the glass, an offering of out-there, rare bottles you’d have trouble tracking down elsewhere. We almost forgot the most important dish (!!!): Japanese cheesecake, a brick-shaped sponge-cloud of heaven.WORD TO THE WISE: Ask a lot of questions! These chefs are at the top of their game, and they have a good sense of humor—they’re also right there in front of your seat, so it’s sort of awkward (and rude) to ignore them. If you have no idea what’s on the plate in front of you, get all of the details. It’ll enrich your experience and reveal the near-absurd methods to the madness behind the menu.THE VIBE IS: a dark and moody lair with smooth wood surfaces, like an interior treehouse decorated minimally, save for a fantasy-novel-spray-painted mural and a windowed wall that displays the meat freezer (aging meat counts as art here). Attention to detail of the utmost level, from every handmade ceramic tea cup to delicate glassware that feels like holding a hologram.TO DRINK OR NOT TO DRINK: That’s the question that’s entirely up to you. The alcohol pairings will knock your clogs off. Or you could stick with the incredible tea selection, or explore the ingenious (limited availability!) non-alcoholic pairing, which is unlike any other in town. Instead of clever juice mocktails, they put time—and fermentation—into it, serving complex, flavorful NA drinks that mimic the depth of wine and spirits. Mind-blowing, tbh, especially the hibiscus brew that winks at pinot noir.PRACTICAL STUFF: Open Tuesday through Thursday, from 3 to 11:30 p.m; Friday and Saturday, from 12:30 to 11:30 p.m.; and Sunday, from 12:30 to 3:30 p.m. Closed Monday. Reserve via OpenTable, but, you can’t order the tasting menu at the bar, so don’t even try. The bar is walk-in only and serves as the entrance to the dining room, so it fills up with tasting menu guests at around 7:45 p.m. The good news, though, it’s an unexpected after-work spot where you can easily grab a seat at 6:30 or 7 p.m.—Alex BeggsWE ALSO LOVEAskaThe new New Nordic tasting-menu blowout.Le CoucouA fine French meal that turns any night into a special occasionMission Chinese FoodIt's back. It's better than ever. And there's duck roasted in lotus leaf and clay.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Alex Beggs"]}