{"id": "2951af0c8750d6413f874d45ac9f3e83", "url": "https://www.bonappetit.com/story/super-lemony-cake", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Make This Lemon Olive Oil Cake Your Fall Potluck Go-to | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Lemon Olive Oil Cake Your Fall Potluck Go-toSunny, golden, and perfect for sharing.By Antara SinhaOctober 7, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As someone who just moved into a new apartment and is very slowly restocking kitchen supplies and equipment—but also someone with a major sweet tooth who loves baking—finding simple, non-finicky desserts to ease into autumn baking is an absolute delight. I want the immediate payoff of a sweet treat without stressing over creaming butter and sugar together or trying to properly aerate a batter without a stand mixer.Mina Stone’s Super Lemony Olive Oil Cake checks every box: minimal effort, high payoff, and no special equipment needed. You don’t even need a hand mixer! If you’ve got a whisk and two mixing bowls, then you’ve got everything you need to make this bright, citrusy, perfectly moist cake with just the right note of grassiness from high-quality olive oil. I ate it for breakfast with coffee. I ate it as a pick-me-up snack when the afternoon doldrums hit. I may just commit and eat a hefty slice for dinner too. And without a doubt it is my new go-to cake to bring over to friends’ houses for parties and potlucks.This recipe comes from Stone’s new cookbook, Lemon, Love & Olive Oil, a deeply personal collection of recipes, many of which she learned from her Greek grandmother. Traditionally, Greek olive oil cake uses orange juice and zest, but when she ran out of oranges, Stone swapped in lemons, resulting in this bright, golden-hued stunner of a cake.Lemon, Love & Olive Oil$40 $36 at AmazonThis simple cake very much follows the general ethos of her cookbook, relying on simple, high-quality ingredients, nothing too fussy or particular, and exceedingly approachable techniques. You’ll want to stock up on plenty of feta, tomatoes, and, of course, lemons and high-quality olive oil to cook through the many vibrant, comforting, and shareable dishes in the book. Other standout recipes: Mlitzanosalata, a cold herby eggplant appetizer; Cypriot Bulgur with Toasted Pasta and Tomato, shot through with butter-toasted bits of vermicelli; and Semolina Halvah with Toasted Almonds and Cinnamon, a nutty, toasty dessert that is as striking as it is delicious. If you’re on the hunt for a book to cook through on repeat this fall, Lemon, Love & Olive Oil is the move—and this olive oil cake should be the first recipe on your list.Minimal Effort, Maximum Lemon:Super Lemony Olive Oil CakeWhen life gives you lemons, make Mina Stone's irresistibly moist and zesty olive oil cake. View RecipeExplore Bon AppétitcookingCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-07", "author": ["Condé Nast", "Antara Sinha"]}