{"id": "29637b5cd99917d6e71e800be5a42069", "url": "https://www.bonappetit.com/story/falafel-cake", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "When I Want Falafel But Don't Want to Fry, I Bake a Falafel Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Want Falafel But Don’t Want to Fry, I Bake a Falafel CakeMy lazy shortcut turned into a go-to weeknight meal.By Kendra VaculinMarch 8, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellFacebookTwitterEmailIf I have one major talent in the kitchen, it’s finding the path of least resistance toward the flavors I want to put in my mouth. Most of my meals are made by considering the factors at play—what I most desire to be eating, what ingredients I have, and my willingness to undergo a project—and then puzzling together a route toward dinner that checks as many boxes as possible. The goal is maximum efficiency and maximum reward, everything I want and nothing I don’t. It’s a little bit nutty but mostly fun! I call this mentality the Workaround.A recent Workaround success story is the Big Falafel Cake, a recipe I developed to fit the particular need for falafel without the frying. While I’d always like to eat falafel, with its crispy, craggy edges and tender, herby interior, I usually leave the preparation to the professionals. Not only does deep-frying at home feel like a heavy lift, but I’m also not the type of gal to remember to soak my chickpeas the night before I need them. I figured this meal was an ideal candidate for a Workaround.That’s one large falafel.\nPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Stying by Maeve Sheridan and Molly LongwellSo when I craved falafel on a weeknight, I decided to supersize it and employ the oven, crafting an XL baked falafel cake rather than individual fritters. The base comes together entirely in the food processor, which makes it both speedy to complete and easy to clean up after. First, you blitz red onion, garlic, herbs, and spices (plus some baking powder for lift and a little starch for cohesion) until your biggest onion pieces are about the size of chickpeas. Then you’ll add two cans of drained and rinsed chickpeas and an egg, pulsing to break down and combine. Because canned chickpeas are more tender and less likely to hold their shape than soaked dried chickpeas, take care not to over-blend the mixture or you’ll end up with hummus. Some coarse texture is necessary, so it’s better to err on the side of less broken down than overly so (that’s also why we do the onion and garlic first, which are in no danger of being over-blitzed).Finally, to cook the cake, you’ll transfer the mixture to a hot, oiled skillet to crisp the bottom, then move the whole thing to the oven to finish baking through. By flipping the finished cake onto a plate to serve, you’ll have the browned side on top—delightfully bronzed and begging for you to slice into wedges. This is not super-crunchy deep-fried falafel, but a gently crisped cake with that same tender, herby interior, fragrant with cumin, coriander, and cayenne for an unmistakable falafel flavor. To make it a meal, serve it with a salad on the side (I like cucumbers and pickled red onion, but a green salad or tomato salad would also be great) as well as a drizzle of yogurt sauce for a bit of creamy richness.Baked falafel cake definitely prioritizes efficiency thanks to its speed, reliance on mostly fridge and pantry staples, and avoidance of any techniques that could turn me off on a Wednesday night. But based on the frequency that I’ve come back to the recipe, it might be a dream dinner, not a best-that-I-could-do dinner, after all—a Workaround meal that’s beaten the odds to become a regular part of the rotation.Get the recipeBig Baked Falafel Cake With Cucumber SaladNo need to fight over the last falafel—this sliceable one is big enough for everyone.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-08", "author": ["Condé Nast", "Kendra Vaculin"]}