{"id": "296dc157430618455efb0fc91a1c4b33", "url": "https://www.bonappetit.com/recipe/napa-cabbage-salad-with-parmesan-and-pistachios", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Napa Cabbage Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNapa Cabbage Salad with Parmesan and PistachiosBy Drifters Wife, Portland, MEAugust 14, 20184.8(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Elizabeth CecilEmailPinterestPrintEmailPinterestPrintCrunchy, salty, sweet, and vinegary, this is more of a salad than a slaw. Massaging the cabbage with salt not only seasons it, but also softens the leaves. Pistachios tossed with orange zest and sugar bring an unexpected floral note to the dish. This recipe is from Drifters Wife in Portland, ME, our No. 9 Best New Restaurant 2018.Ingredients4 servings128-oz. Napa cabbage, tough outer leaves removed, halved, leaves torn into 3\"–4\" pieces1½tsp. flaky sea salt, plus more½cup coarsely chopped raw pistachios1tsp. plus 2 Tbsp. extra-virgin olive oil; plus more for drizzling½tsp. freshly ground black pepper, plus more1sprig thyme½tsp. finely grated orange zest½tsp. sugar2Tbsp. apple cider vinegar2tsp. honey, preferably wildflower1cup parsley leaves with tender stems1Tbsp. thinly sliced chives3oz. Parmesan, shaved, plus more for servingPreparationStep 1Preheat oven to 350°. Place cabbage in a large bowl and sprinkle with 1½ tsp. salt. Toss, massaging with your hands, to soften a bit; set aside.Step 2Toss pistachios and 1 tsp. oil on a rimmed baking sheet; season with salt and pepper. Roast, tossing once, until golden brown, about 5 minutes. Transfer to a small bowl. Add thyme, orange zest, and sugar and toss to combine. Let cool; discard thyme sprigs.Step 3Whisk vinegar, honey, and ½ tsp. pepper in a small bowl to combine; season with a pinch of salt. Drizzle over cabbage and add parsley, chives, 3 oz. Parmesan, ¼ cup pistachios, and 2 Tbsp. oil. Toss to combine, then taste and season with more salt and pepper if needed.Step 4Transfer cabbage salad to a platter and top with more Parmesan and remaining pistachios. Season with pepper and drizzle with some more oil.Step 5Do Ahead: Cabbage can be massaged up to 3 hours in advance. Cover and keep chilled.How would you rate Napa Cabbage Salad with Parmesan and Pistachios?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleEasy recipe. I just used a couple of pinches of the flake salt to massage into the cabbage. I did not use the thick white bottom part of the cabbage leaves. Kept the cabbage in the fridge for an hour and a half before serving. Loved the hint of orange through the salad with the toasted pistachios and thyme. I just threw a couple of handfuls parmesan. Served to a group and everyone enjoyed it. Will definitely serve again.NH DEBAmherst,NH7/1/2021I made half of the recipe for the 2 of us last night...outstanding recipe!  What I ended up doing was weighing out 7 oz. net weight of the cabbage, after hand tearing.  My choice was to not have any of the thick white centers of the Napa cabbage.  I did the salt massage, and then added the parsley and chives.  Did this a few hours in advance and kept chilled under dampened paper toweling.  As for the pistachios, I had roasted and salted at hand.  I simply chopped, and combined with the teeny bit of oil, and other components, leaving it covered at room temperature. As for the dressing, I also combined in advance and kept chilled. For serving, all was tossed together, and I ended up using 2 oz. of shaved Reggiano for the final toss. There was no sprinkling of anything over the salad....crazy easy to throw together and serve.  We LOVED it.Jeff WinettSherman Oaks, California6/25/2021It was tasty but don’t think the Parmesan worked.  I’d appreciate it I’d bon appetit would provide the nutritional info for all their recipes. ncohen11Toronto4/11/2020Absolutely outstanding. Two suggestions: 1) definitely let the cabbage settle for a couple hours after the \"messaging\" to give time for the salt to soak into it rather than sit on the surface; 2) I used half the amount of salt called for and it was plenty. Maybe \"flakey\" sea salt is the key but I used normal sea salt grated coarsely. Remember people can always add more salt so err on the side of less. AnonymousChicago3/16/2020This salad was terrific; I did cut the salt and it was still a little salty.  The orange zest was refreshing. A win for the guys in my family who don’t care much for salad. ThanksDonna EPa1/6/2020Good salad, but I found it way too salty. I would cut back on the amount of salt used to soften the cabbage. AnonymousSD11/27/2019This is amazing!  It's so good.  AnonymousDallas9/15/2019This was delicious! Simple to make and packed with great flavors!!Atlanta GA9/20/2018Explore Bon AppétitSaladAmericanNapa CabbageCabbageLeafy GreensVegetablePistachioNutOrangeCitrusFruitParmesanCheeseSideGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Drifters Wife", "Portland"]}