{"id": "29832411f486c4668fcb1990781f7c62", "url": "https://www.bonappetit.com/recipe/pork-tamales-rojas", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Pork Tamales Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork Tamales RojosBy Rick MartinezDecember 13, 20214.1(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIf you’ve never made pork tamales before, the process may seem daunting at first. But as Bon Appétit contributor Rick Martinez explains, “If you can spread peanut butter onto a slice of bread, you can make tamales.” Plus, we promise it’s worth the effort; homemade tamales are far better than what you’re likely to find packaged at the store.There are two types of masa, a dough made from ground nixtamalized corn, to choose from for this tamale recipe. One is fresh masa, which offers the best flavor and texture and is available from specialty markets or artisanal producers who grind their own. The other is instant masa, which is widely available and easy to transform into dough on your own. You can find it along with dried corn husks at tortilla stores/factories, international sections at larger stores, and online. Whichever masa you choose, be sure to save some of the chile purée from the pork filling to incorporate for a little extra color and even more delicious flavor in every bite.If you prefer chicken tamales, Rick has a recipe for them too. And for more tips on how to make tamales, check out Rick’s video.Editor’s note: This recipe was originally published December 16, 2016.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMortar and Pestle$25 At AmazonBlender$32 At AmazonDutch Oven$80 At AmazonOffset Spatula$12 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxIngredientsMakes about 30Pork Filling1tablespoon lard or vegetable oil1small onion, finely chopped5large ancho chiles, stems and seeds removed3dried guajillo chiles, stems and seeds removed2morita chiles2pasilla chiles, stems and seeds removed1½cups low-sodium chicken broth1teaspoon coriander seeds1tablespoon cumin seeds8garlic cloves, peeled1teaspoon crushed Mexican or Italian dried oregano1pound boneless pork shoulder (Boston butt), fat trimmed, cut into 1-inch pieces1pound pork belly, cut into 1-inch pieces1bay leaf2tablespoons kosher salt1tablespoon apple cider vinegarUsing Fresh Masa3pounds fresh coarse-grind corn masa for tamales (unprepared)1¼cups plus 2 tablespoons (or more) lard, melted¼cup low-sodium chicken broth1tablespoon kosher saltUsing Instant Dry Masa3¾cups instant corn masa flour (such as Maseca Tamal Instant Corn Masa Mix)2cups homemade chicken stock or low-sodium chicken broth1¼cups plus 2 tablespoons lard, melted, plus more if needed1tablespoon kosher salt1½teaspoons baking powderAssembly30dried corn husks (from a 1-pound bag)3cups (or more) low-sodium chicken brothFresh salsa and lime wedges (for serving)Special EquipmentA spice mill or mortar and pestlePreparationPork FillingStep 1Heat lard in a large heavy pot over medium-high. Cook onion, stirring occasionally, until golden brown and softened, 6–8 minutes. Add ancho, guajillo, morita, and pasilla chiles and broth and bring to a boil. Cover pot, remove from heat, and let sit, stirring occasionally, 30 minutes to allow chiles to soften.Step 2Meanwhile, toast coriander seeds in a dry small skillet over medium heat, swirling often and adding cumin seeds during the last 30 seconds, until fragrant, about 2 minutes. Let cool; finely grind in spice mill or with mortar and pestle.Step 3Preheat oven to 250°. Transfer chile mixture to a blender; reserve pot. Add ground toasted spices, garlic, and oregano and purée until smooth, adding more broth if mixture is too thick or won't blend, about 2 minutes. Reserve ¼ cup purée for masa and set aside until ready to use. Place pork shoulder, pork belly, bay leaf, salt, and remaining chile purée (about 1¾ cups) in reserved pot. Bring mixture to a boil, cover pot, and transfer to oven. Braise pork until very tender and it shreds easily, 2–2½ hours. Let cool 15 minutes, then skim fat from sauce; discard bay leaf.Step 4Using a potato masher or a large fork, smash pork into sauce until meat is shredded and incorporated into sauce. Stir in vinegar; let cool.Step 5Transfer filling to an airtight container and chill until pork is cold and firm, at least 3 hours.Do Ahead: Filling can be made 3 days ahead. Keep chilled.For Fresh MasaStep 6Mix masa, lard, broth, salt, and reserved chile purée in a large bowl with your hands until well incorporated and mixture looks shiny and smooth, about 4 minutes.ChevronChevronStep 7Slap the top of masa with the palm of your hand, immediately pulling your hand back. If masa doesn’t stick and your hand looks shiny, the dough is ready. If masa sticks, add another 2 Tbsp. lard and knead until incorporated; repeat slap test. If masa still sticks to your hand, repeat process until you get there (another 2 Tbsp. lard should do it).Photo by Alex LauFor Instant Dry MasaStep 8Mix corn masa flour, stock, lard, salt, baking powder, and ¼ cup reserved chile purée in a large bowl with your hands until dough comes together. Continue to knead until mixture looks smooth and shiny, about 4 minutes.Step 9Slap top of masa with the palm of your hand, immediately pulling your hand back; if dough sticks to your hand, add 2 Tbsp. more lard and knead to incorporate. Repeat slap test. If masa doesn’t stick and your hand looks shiny, dough is ready. If masa sticks, continue adding lard 2 Tbsp. at a time and repeat slap test. Let dough sit 30 minutes, uncovered, until the consistency of peanut butter; it will thicken as it sits.AssemblyStep 10Soak husks in a large bowl of hot water until soft and pliable, about 15 minutes. Using your hands, swirl husks in water to loosen any silks or dirt. Drain, rinse, and shake off excess water.Step 11Place a husk on a work surface and gently stretch out wide end. Measure 5\" wide, then tear off any excess (hold onto the scraps; you’ll use them later). The width doesn’t have to be exactly 5\", but if you go any narrower, your tamale might not cover the filling. This recipe makes about 30 tamales; prep a few extra husks in case some tear.Step 12Arrange husk so wide end is closest to you. Spoon 2 heaping Tbsp. masa onto husk about 4\" from the bottom. Using a putty knife, small offset spatula, or butter knife, spread masa into a thin, even layer, covering the width of the husk and about 5\" up the length of the husk; leave the narrow end uncovered. If you mess up, just scrape off masa and start over. Repeat with remaining husks and masa.Photo by Alex LauStep 13Keeping wide end closest to you, place 2 Tbsp. cold pork filling in the center of masa on each husk, forming a log that runs down the center. Fold 1 side of husk over filling, then fold other side over to cover. Holding tamale seam side up, fold narrow, pointed end of husk away from you and under tamale. Set on a rimmed baking sheet seam side up. Repeat with remaining tamales.ChevronChevronArrange and Steam the TamalesStep 14Line a large heavy pot with husk scraps. Crumple a large sheet of foil to form a 3\"-diameter ball. Place ball in center of pot. Using ball as support, prop tamales upright, with folded end down and seam side facing up, around ball; this will take 4–7 tamales. Continue stacking tamales around the ball, leaning them against one another. Pour broth into pot, being careful not to get any inside tamales (broth should come about ¾\" up sides of tamales). Bring liquid to a boil over high heat, then reduce heat to medium-low. Cover pot and simmer tamales, undisturbed, adding more stock as needed to keep some liquid in pot, 40 minutes.ChevronChevronStep 15Remove a tamale from pot; let cool 3 minutes. (If you don’t let it rest before checking, masa will stick to husk and appear gummy.) Remove husk; if masa sticks to husk, it’s not ready. Carefully refold and return to pot. Cook 5 minutes more; check again. If husk peels back easily, tamales are done. Remove from heat, uncover, and let sit 10 minutes before unwrapping. Serve with salsa and lime wedges for squeezing over.How would you rate Pork Tamales Rojos?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleFollowed the directions to the letter and ended up with a disintegrated wet mess.  Anonymous1/4/2022I LOVE tamales!!! Thank you for posting this although in my Mexican American family growing up helping out in our family restaurant I never really had the urge to make them my self but now I have children and definitely making tamales is too special not too pass on- PLUS they cost way too much at the store 😅 Happy Holidays we will bring in New Year eating lots of yummy tamales🎉2022 ✌🏼🕊KariTexas12/28/2021I hate working with corn meal especially when it comes to tortillas and tamales because even the instructions on the package ARE NEVER accurate. My husband gave me a tip as far as knowing if the masa is correct. I made the masa according to the package instructions, but added way more water and enough lard to make the consistency similar to a sticky consistency that can easily come off your hand. Also, if u put a piece of masa in water, it should float because fat floats. That tip lit a lightbulb in my head because I was struggling to get the masa mixed properly and it took me an hour to figure out. I made a modified version of the pork Chile and had to substitute some of the Chilis. I didn't care too much for the pork. I liked my beef tamales instead. Anonymous2823012/25/2021Solid Recipe. I tested the recipe last year using premade masa and the tamales came out GREAT. \n\nJeffEl Dorado Hills, CA12/22/2021I vowed to never make tamales again after spending nearly 24 hours making them my first time. this recipe looks doable- I think I'll try again!Anonymoushouston 12/22/2021Hahaha - remind me again… how many “steps” involved in spreading peanut butter on toast? Thinking it’s about 16 fewer than this recipe John WPlanet Earth12/22/2021To AV8R in Alabama: I’m a 99er, and an aspiring cook. Of course I wanted to attempt this recipe. Life is short and tamales are good. That, to me,  is pretty simple! Loved the recipe. I will make them again! Thanks BA!AnonymousSeattle12/22/2021Oh come ON.\nYou seriously think home cooks will attempt this?\nIt was fun to read, anyway.\nPlease remember KISS.\nKeep It Simple Stupid.\n🤣AV8Rcoastal Alabama12/22/2021I live in NM. This is not traditional. AnonymousEspanola, New Mexico12/22/2021how many tamales does this make? serving size?jayCa12/1/2021I just wasted a lot of time and a lot of masa (plus my chilli paste) because the author, despite saying that you can use instant masa, did not mention that the amounts of lard and water need to change. Terrible instructions for that. Use steph's instructions to adjust the masa. All of the other comments are the same. A real shame to have this kind of oversight on a 5 year old bon appetit article.TristanOttawa, ON5/10/2021FYI: 3 3/4 cups instant corn masa flour + 1 3/4 cup water + 1 1/2 teaspoon baking powder is equal to 3 lb fresh masa. StephBaltimore, MD3/1/2021My lack of tamale knowledge was most to blame here...but I knew something was off when I combined the fat / masa.  With all due respect, I think this could use a revision. I see where I made the mistake, but I could see others overlooking it as well.\n\nJust a suggestion, always enjoy the content here!  And the flavors were definitely on point!  Cheers 🍻 Nickp1986Chicago, il1/12/2021Sounds about right. Texan who made tamales either her godmother, here. A couple tips I'd add would be, first, ditch the foil ball. We put an upside down bowl in the pot and  stacked the tamales against it. No need to waste foil. We streamed them with water, as well. Also, add a coin (we used a penny) to the bottom of the pot when steaming. If it stops rattling, you know the liquid is gone and you need to add water. This gives you an audible indication without having to lose the steam/heat if you lift the lid to check.MCSan Antonio12/8/2020These are the most delicious things I've ever made and I'm so glad I took the plunge to try them! The instructions are very helpful and I felt knowledgeable about making these despite not knowing anything before reading the recipe and they turned out so well!Philadelphia, PA4/11/2020Explore Bon AppétitMexicanLatin AmericanCentral AmericanMasaRice & GrainsPork ShoulderPorkMeatPork BellyPasilla ChileChileVegetableAncho ChileGuajillo ChileMainGluten-FreeDairy-FreeNut-FreeSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-12-16", "author": ["Condé Nast", "Rick Martinez"]}