{"id": "2985af1118fa2bcc9fdbcc0d6ff984f6", "url": "https://www.bonappetit.com/recipe/sweet-and-sour-pork-tenderloin", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Sweet and Sour Pork Tenderloin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSweet-and-Sour Pork TenderloinBy Kat BoytsovaApril 21, 20194.9(40)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThe tangy, mouthwatering sauce here is inspired by agrodolce, an Italian sweet and sour sauce made by reducing vinegar, sugar, and spices. It's pretty much always delicious, but here we build the sauce in the same pan that we seared the pork, giving it even more richness and flavor. Let's talk about pork tenderloin for a second. This crowd-pleasing cut sometimes gets a bad rap for being dry, but that's just because most people overcook it. Whatever you've been told before, 140° is the internal temperature you're looking for here—the meat will still be a bit pink, but it's totally safe to eat and will be unbelievably juicy.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonLarge Bowl$18 At AmazonLarge Skillet$84 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketWooden Spoon$6 At AmazonWhisk$10 At AmazonGlass Measuring Cup$19.99 At AmazonInstant-Read Thermometer$35 At ThermoworksIngredients4 servings2pork tenderloins (about 2 lb. total)1tsp. freshly ground black pepper3tsp. kosher salt, divided2medium red onions1medium head of red leaf lettuce1large fennel bulb (with stems and fronds)3Tbsp. cold unsalted butter5Tbsp. extra-virgin olive oil, divided5Tbsp. honey1tsp. crushed red pepper flakes1cup plus 1 Tbsp. red wine vinegarPreparationStep 1Pat 2 pork tenderloins (about 2 lb. total) dry with paper towels. Season all over with 1 tsp. black pepper and 2 tsp. salt. Let sit at room temperature until ready to cook.Step 2Meanwhile, do some prep. Halve 2 medium red onions through the core. Trim off ends, peel, and slice into ½\"-thick wedges lengthwise. Transfer to a medium bowl and set aside.Step 3Wash and dry 1 medium head of red leaf lettuce, then tear into bite-sized pieces. Transfer to a large bowl.Step 4Tear off nice looking fronds from 1 fennel bulb and transfer to bowl with lettuce. Trim a few inches from tops of stems, then remove stems from bulb. Cut bulb in half lengthwise and remove core. Thinly slice stems and bulb crosswise and add to bowl with lettuce. Chill until ready to use.Step 5Cut 3 Tbsp. cold unsalted butter into small pieces. Chill until ready to use.Step 6Heat 2 Tbsp. extra-virgin olive oil in a large skillet over medium-high until shimmering. Sear tenderloins until golden brown on each side, about 2 minutes per side, 6–8 minutes total.Step 7Using tongs, transfer pork to a plate. Cook onion, 1 Tbsp. extra-virgin oil, and ½ tsp. salt in same pan in a single layer over medium-high heat, tossing occasionally, until well browned and beginning to soften, about 5 minutes.Step 8Whisk 5 Tbsp. honey, 1 tsp. red pepper flakes (if you don’t like things spicy, cut the amount of red pepper in half, but we really love how the spiciness balances the sweetness here), 1 cup red wine vinegar, and ¼ cup water in a glass measuring cup and add to pan. (Make sure you get all that honey!) Bring to a simmer.Step 9Return pork to pan and cook, turning every 5 minutes and reducing heat as needed to keep sauce at a low simmer, until an instant-read thermometer inserted into the thickest part of the meat registers 140°, 12–20 minutes. (Start testing for doneness after 10 minutes; pork will cook differently depending on the size of the tenderloin you're working with. It’s important to use a thermometer in this case because it’s very easy to overcook a lean cut like this, and nobody likes dry pork!) Transfer pork to a cutting board to rest. This will lock in all the juices and let the pork continue to cook just a bit.Step 10Continue to cook sauce, stirring occasionally, until thick and syrupy, 3–5 minutes. Remove from heat and stir in cold butter with tongs until fully incorporated.Step 11Add remaining 2 Tbsp. extra-virgin olive oil, 1 Tbsp. red wine vinegar, and ½ tsp. salt to salad and toss to combine.Step 12Slice pork tenderloin on a diagonal. Divide among plates and spoon agrodolce sauce over. Serve salad alongside.How would you rate Sweet-and-Sour Pork Tenderloin?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleI’ve made this dish five or six times now and each time it’s a huge hit. I sent the link to a family member who agreed this is one of the best dishes she’s made in a long time. I end up serving it over jasmine rice and a side of sautéed cabbage. 1/10 recommend Kristina Tampa, FL3/20/2022Amazing! I had some pork tenderloin at hand and was looking for a recipe with a sauce different from the classic roast the first time I tried it. This was perfect. My entire family, including my mom, who stubbornly tries new dishes, loved it. It tastes even better the day after or cold straight from the fridge. I would consider increasing the sauce amount. It’s that good. Only issue with the recipe is that it takes waaaayyyy longer than indicated to reach the sauce’s syrupy consistency.  To avoid this, I would recommend increasing the temperature a bit. I have an electric stove, so that might be the reason for this. Otherwise, a recipe I go back to time and time again. AnonymousSan Juan, Puerto Rico2/21/2022The onion sauce is the main star here, and it's incredible. Others mentioned the flavors not permeating the pork, and I have to agree. That being said, I did get a nice, tender pork tenderloin cooking according to recipe. Once smothered with the jammy onion sauce, it's a sweet and tangy flavor punch with a nice kick at the finish (I used a heaping tsp of red pepper flakes). AnonymousRichmond, Virginia9/2/2021I think I would really like to use the sweat and sour pork tenderloin recipe but there is a stupid window that pops up on the upper right side of the screen that makes reading the directions super difficult.  Got better things to do than play around with this.Dave WCourtenay, BC7/29/2021my entire family LOVED this recipe the first time I made it months ago!  Just came back to refresh my memory because I'm making again tonight.  Easy and fabulous! KimSanta Monica, CA12/4/2020I used raspberry wine vinegar bc it's all I had and didn't love it. Anonymous8/21/2020It’s summertime and it’s hot, so I decided to serve this at room temperature – and believe I’ve solved the issue mentioned by other reviewer‘s that the flavour of the sauce did not permeate the meat. I made this today for a family supper, But wanted to make it earlier in the day when it was cooler, and didn’t want to be spending time over the stove instead of visiting. So I made it about four hours in advance, slice the meat and pour the sauce over-and refrigerated it, Pulling it out of the refrigerator an hour before serving and pasting with the sauce. Rave reviews! This is definitely going to remain on my shortlist. I did shoot a little bit – I added a small palmful of chopped fresh thyme. My son-in-law was actually humming to himself as he ate it because he found it so delicious!wcavers3774Victoria, B.C., Canada8/3/2020I am reprinting the recipe to make this again tonight! I made this last Friday for my husband's sake, but we all enjoyed it so much I'm making it again only a week later. Thanks for the great recipe!hscugliaFlorida5/15/2020Made it with regular onions but it turned out amazing, also gave them even more browning. The sauce made the dish so good and I am not even a fan of pork tenderloin.AnonymousSpain4/22/2020DELICIOUS pork dish (I didn't make the salad). I didn't know that red onions could taste so good!  My husband's only complaint was that the delicious flavors didn't penetrate the pork.  Not sure what to do about that - any suggestions?  Will make this again for sure.AnonymousNew London, PA3/2/2020This is SO good and SO easy! Since I'm usually feeding two I use half as much meat, but make the same amount of onions (cause they're so good) using about a half/three-quarter recipe for the sauce; even with half the meat it feeds 3 very hungry people. It's been added to my rotation- highly recommend.  Zoe KypurosNYC1/23/2020I will never make pork tenderloin another way, this is absolutely perfect! I have made it multiple times and wouldn't change a thing.AnonymousIndiana, USA11/19/2019I would definitely make the pork/sauce again. Not too sure about the salad though... The sauce is delicious and I'd try making it for another protein like chicken. Very tasty!heather eatsMontreal10/31/2019Delicious! AnonymousSt. Paul10/20/2019I absolutely love the new interface of the website. Love the way the ingredients are displayed and also the mini videos. Might be a generation thing, Im 25 years old and this layout definitely helps my style of cooking, but then again, I never print the recipes Im making.finagarAtlanta9/3/2019Explore Bon AppétitPork TenderloinPorkMeatMainGluten-FreeNut-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-21", "author": ["Condé Nast", "Kat Boytsova"]}