{"id": "2992320afbce296d1e5e58521efec033", "url": "https://www.bonappetit.com/story/roast-your-fruit", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "How to Roast Fruit And Turn Mediocre Berries, Apples, Pears, and Stone Fruit Into Something Special | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSad Winter Fruit Is Meant to Be RoastedI don’t need pie dough or a cobbler topping when I’ve got Hot Fruit.By Antara SinhaFebruary 11, 2022FacebookTwitterEmailAlex LauFacebookTwitterEmailFor all the good fruit in the world—the first strawberry of the spring, the platonic peach, the airport banana (wait a minute, aren’t all bananas the same?)—there’s bound to be sad (maybe even bad) fruit too. Whether you’ve picked up some unfortunately tart apples at the supermarket, your pears got a little bruised and beaten up in your tote bag on the way home, or your berries are looking pale, sad fruit is a small tragedy.While blitzing them into oblivion into a smoothie or throwing them to the back of your freezer for when inspiration strikes are both viable options, please consider Hot Fruit. Think of jammy pie filling, syrupy-sweet berry cobbler with burnt sugar edges—heck, even the sticky insides of a Toaster Strudel—but spoonable, speedier, and more versatile. A from-scratch homemade pie on a weeknight? Exhausting. A quick tray of baked peaches with a dollop of whipped cream? Inspired. No, I won’t complain about a flaky crust or a craggy cobbler topping (who do you take me for?), but I also don’t need those pastry casings in order to enjoy Hot Fruit.Compared to making jam on the stovetop, roasting fruit in the oven brings out incomparably nuanced flavor. Instead of essentially boiling the fruit in its own juices, the ambient heat of the oven allows the sugars to caramelize, the fruit to soften slowly and evenly, and the corners to get jammy and the slightest bit charred. (Plus, there’s less stirring!) In sum, roasting fruit in the oven is how you turn otherwise mediocre fruit into something special.Here’s how to roast fruit:I like to follow a simple formula: sliced/chopped fruit of your choice + a sweetener to taste + a flavoring/aromatic + a pinch of saltThe fruit you go with is entirely up to you, but make sure they’re cut into relatively even pieces (for consistent cooking times) and note that different fruits will roast at different rates. More delicate berries will bake much faster—and yield a jammier consistency—than larger slices of hardier fruit such as apples and pears.While it can be tempting to forgo the sweetener element altogether, it’s essential to help get the caramelization started in the oven. Give your fruit a taste: If it’s especially tart (a mouth-puckering Granny Smith apple, for example), you’ll want a little more than, say, some overripe nectarines that could do with a spoonful or two of granulated sugar. Liquid sweeteners and syrups such as honey and maple syrup are delicious, but keep in mind that they get darker faster than white sugar in the oven.You can also use a mix of fruit—but keep in mind that they’ll bake at slightly different rates.\nPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFor another layer of flavor, add anything from floral extracts, citrus zest, and sprigs of fresh herbs like hardy rosemary or summer basil (you’ll want to pull these out after they bake), to ground or whole spices (like crushed cardamom pods, whole cloves, or a cinnamon stick), to a splash of vanilla or almond extract. A few of my favorite combinations:Apples + maple syrup + cinnamonPeaches + agave + lavenderStrawberries + brown sugar + crushed cardamom podsToss it all together in a large bowl, then spread in a single layer on a sheet pan or in a baking dish and roast at 350°. Start checking after 20 minutes to decide if you want them syrupy and jammy, or if you want to continue roasting for more caramelization. If you’d like to stave off more moisture while also halting more darkening, you can lower the temperature and keep baking. Or, if you’re a fan of a little bit of char, turn your broiler on for the last couple minutes and keep a close eye until the fruit is the color you’re looking for.From there, it’s up to you how to use your bounty: Toss baked pears into winter salads with a zippy vinaigrette and crumbly cheese, spoon roasted strawberries over your morning oatmeal, top saucy cherries on a scoop of ice cream, fold fragrant peaches into quick-bread batter before baking, mash and spread cooked apples between cake layers, or stir apricots into yogurt and granola—with Hot Fruit, you’ve got a world of fruitful possibilities lined up. Who needs pie dough?Explore Bon AppétitFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-11", "author": ["Condé Nast", "Antara Sinha"]}