{"id": "29a19743d9aa054c85d51fb717aff3b6", "url": "https://www.bonappetit.com/story/domaine-glinavos-paleokerioso", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Bring Your Host This Wine and Win At Being a Dinner Party Guest | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBring Your Host This Wine and Win At Being a Dinner Party GuestIf your friends shopped, cleaned, and cooked for you, the least you could do is bring them this bottle.By Emily SchultzMay 22, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I have a lot of thoughts when it comes to being the perfect guest at a dinner party. If you too want to be invited back, time to pay attention: Show up on time. ALWAYS ask your host if there’s anything you can bring—or any way you can help—on the morning of. Put your phone away. Take charge and clean up. If you think this sounds crazy, just remember that your friend, colleague, acquaintance just opened up their home to you, and took the time to grocery shop, prep, and cook you an entire meal! That’s so kind of said person!But the real way to seal the deal is to bring something nice for your host. Bodega flowers? So lovely! A chocolate bar with pretty packaging? YOU ROCK! My personal favorite? A bottle of Domaine Glinavos' Paleokerioso, a small (and affordable) semi-sparkling, skin-contact wine from Greece.The thing I love about semi-sparklers—Italian lambrusco and French pétillent among them—is that their soft bubbles, gentler than full-on Champagne or Cava, are the perfect thing for a casual celebration, like when your friend roasts you a whole fish on a Friday night. (The name “Paleokerioso” means “old fashioned” in Greek, and nods to the country’s longstanding history of semi-sparkling winemaking.) As a skin-contact white, it also looks like a liquid sunset glow—you know, that romantic orange shade the sun casts on just about everything on its way down for the day? Well it looks amazing in the glass and feels festive to drink. Have I mentioned it tastes INCREDIBLE, like bubbly cooked apples in a fresh apple pie, with a refreshing orange candy zing?Best yet, though, is that it comes in a petite 500 mL bottle, the most perfect-sized way to say “thank you” to someone who did something thoughtful. It’s small enough that they could nurse it themselves while putting the house back together or after a long day at work weeks from the dinner. Whenever they decide to pop it, they’ll be so grateful you brought it, they might even ask when you’re next available to come over and share it.Learn more: Domaine Glinavos' PaleokeriosoExplore Bon AppétitHighly RecommendWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-22", "author": ["Condé Nast", "Emily Schultz"]}