{"id": "29b03d5885248f2a2914f2f220162da6", "url": "https://www.bonappetit.com/story/canned-soup-tips", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "How to Make Canned Soup Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCanned Soup Is Convenient—and With a Little TLC, It Can Also Be DeliciousLike life, canned soup is what you make it.By Ali FrancisFebruary 18, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailIn Cheap Tricks, we’ll help you make the most out of everyday supermarket staples. Next up: How to make canned soup better—super, even.There was a yearlong phase in my life where all I would eat for lunch was canned soup. I was starting a food business and had no time and even less money. Every day I would open a can, toddle over to the microwave, and pull my trusty bag of chopped herbs, spices, and miscellaneous cheeses out of the fridge—as my coworkers silently wondered if I was finally losing it. I knew what they didn’t: Like a blank canvas, a can of soup is full of infinite possibility. Ever since, those deeply misunderstood tins have held a warm place in my heart.At least half of you reading this probably disagree with that sentiment. “Canned soup” are two objectively benign words that nonetheless tend to create division in just about any group. Some people ( 🙋‍♀️) adore them for their convenience and versatility, while others lob critiques that are decidedly not appropriate for the internet. Okay, I’ll admit: A lot of the dusty tins you find on grocery store shelves are a little, well, lackluster. But even if I’d opt for a brothy, homemade chowder or a hearty vegetarian ramen most of the time, canned soups are an affordable, faster-to-prepare option. Canned soup, like life, is what you make it.All you need to prepare a steaming bowl of soup that rivals the homemade stuff, is a few key ingredients and a can-do attitude. Here’s how to make canned soup (and maybe your life?) better.Start with an aromatic basePretty much every can of soup already contains aromatics. But to put some pep back in your soup’s step, you’re going to want to add more. Start by sautéing any combination of finely chopped vegetables and alliums—like onion, garlic, carrots, celery, bell peppers, and ginger. Whatever you choose is going to infuse the entire can of soup you’re about to heat. A shorter sauté will result in a sweeter, less potent base, whereas a longer cook will brown your ingredients for a deeper, more savory vibe.All out of alliums? An aromatic base can also be achieved with sturdy herbs, spices, or condiments. Enliven plain (and thin) soups by blooming a combination in oil before heating. Sizzle a pinch of Madras curry powder, garam masala, equal parts ground cumin and smoked paprika, or a sprig of rosemary in your saucepan, then add butternut squash soup. Thyme, crushed red pepper flakes, and bay leaves work well with mushroom soup. And a can of tomato soup is practically begging to begin with a scoop of sautéed red curry paste or harissa or a sprinkle of dried oregano and basil.Dilute, dilute, diluteChunkier soups, like black bean or lentil, tend to lean thick—and, it must be said, gloopy. To thin them out (and dial down the intense salinity), add more water or low-sodium stock while they’re heating. (If you overdo it, don’t stress: Continue simmering until the liquid has reduced to your desired consistency.) For virtually anything but the brothy bois, like chicken noodle soup or Italian minestrone, you could also stir in some coconut milk, warmed cream, or crème fraîche to add body and richness.Behold your blenderWhen making her hammy chickpea soup, recipe developer and author Carla Lalli Music purées half for a best-of-both-worlds situation: creamy (without the dairy!) and chunky at the same time. Your thicker, bean- or veggie-based canned soups will benefit from the same treatment.Once hot, pour half the contents of your saucepan (being sure to include some liquid), into your blender. Whiz that up until it’s velvety, like a bisque, and then stir back into the saucepan. (Or use an immersion blender—no transferring necessary.) Or take things to the next level by adding a dollop of umami-rich miso—or a scoop of nut or seed butter, leftover mashed potatoes, or steamed cauliflower—before blending for an even creamier, more flavorful base.Go big on the greensSenior cooking editor Sarah Jampel loves adding a heck-load of greens to her soups. In her lemony tortellini number, a whole bunch of mature spinach gets thrown in. It’s a strategy that works for the canned variety too: For some added vibrancy (and, sure, health!) wilt in a few handfuls of fresh or frozen kale, spinach, or Swiss chard. Frozen peas and leftover roasted broccoli or sweet potatoes are also welcome at the party.Lean into the extrasLasagna has meat. A sandwich has bread. Soup, bless its heart, skews a little on the unsatisfying side. To turn what is essentially liquid and fiber into a full-blown meal, add cooked rice, pasta, farro, quinoa, or any grain that, as my astrologer would say, “speaks to you.” Beware: Grains take on liquid, so you might need to add additional water if you go this route.Or take the protein path. For a filling and aesthetically pleasing lunch, boil an egg and serve it, halved, on top. Or brown some quality sausage or bacon before heating your soup. Or stir in some shredded rotisserie chicken for extra heft.Add some acidFood director Chris Morocco’s Creamy-ish of Mushroom Soup relies on dry white wine for a rich, tangy vibe—and there’s probably a leftover guzzle for the chef. Smart! Canned soup-ers can follow suit: After sautéing your aromatics, deglaze the pan with a glug of the Good Juice. You can also stir a splash of acid—like lemon juice, white wine vinegar, or apple cider vinegar—to brighten things up.Top it all offI gotta be honest: Even after all the effort spent coaxing max flavor out of my canned soups, deciding what goes on top is still the funnest part. Add swirls of pesto, chili crisp, hot sauce, sour cream, or salted yogurt. Garnish your bowl with fried shallots, garlic chips, croutons, or a mish-mash of toasted seeds. Douse tender, fresh herbs—like cilantro, dill, parsley, or basil—in good-quality olive oil and vinegar and pile them on top. Crumble feta or grate Parmesan with abandon. Crush up a handful of pita, potato, or corn chips and sprinkle them over everything. Fry a grilled cheese sandwich and do with it what you know you should.Show canned soups some love, and they’ll be there—like little beacons of hope and tin-coated-steel—when you need them most.Explore Bon AppétitcookingCheap TricksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-18", "author": ["Condé Nast", "Ali Francis"]}