{"id": "29b89883f993cd84410fc29f7cc55785", "url": "https://www.bonappetit.com/story/jets-pizza-ranch-dressing", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "The Perfect Jet’s Pizza Order Includes the $4 Squeeze Bottle of Ranch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Perfect Jet’s Pizza Order Includes the $4 Squeeze Bottle of RanchLook at that happy man jetting off into space! You could be that happy!By Alex BeggsMay 20, 2020FacebookTwitterEmailPhoto Courtesy of Jet's PizzaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.“DON’T FORGET THE SIDE BOTTLE OF RANCH!”Jet’s Pizza is a Michigan-born chain with stores across the country, known for its variety of flavored crusts (why would you get anything other than TURBO I don’t even know), side orders of breads that are just pizza sliced into sticks, and buttery, mathematically masterful eight-corner Detroit-style pies (the move). Every slice is a crispy-edged corner. Every slice is perfect. After the Detroit Tigers’ opening day last year when sports still existed, we had a huge family gathering, tables covered in grease-stained Jet’s boxes. And among them: a full squeeze bottle of Jet’s ranch dressing. That’ll be $4, and worth every penny.It might be Hidden Valley mix for all I know. I don’t care. I’m from the religious upbringing of dipping pizza into ranch dressing and either you’re with me or you’re not—that’s a right bestowed upon us by the American constitution. In fuzzy-lensed memories of my youth, slightly sunburned lifeguards sit around a table with a shared plate full of ranch in the center for communal dipping. MEMORIES. Shared ranch plates, though, are a thing of the germ-ridden past.Which is good news for the squeeze bottle. Just squeeze a puddle of ranch on the upper quadrant of your plate and replenish as needed. The little plastic side containers aren’t big enough for a family, which is any group of people over one. Leftovers? You’ve got ranch for every salad and every piece of roasted broccoli in your foreseeable future. Or, as Jet’s own Facebook pages suggest, use it as toothpaste. Once it’s used up, you’ve got a cute little squeeze bottle with a cheerful round-faced man jetting off into space to refill with simple syrup, or whatever.I was recently in Traverse City, Michigan, quarantining for two contactless weeks with my guy and one night, we ordered Jet’s. We needed Jet’s! When we asked the employee on the phone to leave the pizza on the porch because we were self-isolating, he replied enthusiastically in the voice of a Midwestern Lebowski, “That sounds RAD, man!” Then he said something about how he’d seen videos of people fighting over milk (??okay??). “Oh, and a squeeze bottle of ranch, please!” we chimed in. Can’t forget.Order it: Find a Jet’s location near you.Explore Bon AppétitHighly RecommendPizzaRead Moreculture8 Styles of Regional Pizza to Know, Love, and CherishBy Arthur BovinorestaurantsI Go to Dearborn, Michigan, Just For This LunchBy Alex DelanycultureThe Frozen Pizza That Won Over This Pizza SnobBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Alex Beggs"]}