{"id": "29d6ee7d6ee695b1834a64a5b60c311d", "url": "https://www.bonappetit.com/recipe/charred-cabbage-with-goat-cheese-raita-and-cucumbers", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Charred Grilled Cabbage  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCharred Cabbage with Goat Cheese Raita and CucumbersBy Andy BaraghaniMay 22, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this vegetarian grilling recipe, go hard when charring the cabbage wedges—to the point you might think you did something wrong. They are dense and resilient and need a long time on the grill to soften. Serve this summer side dish with a refreshing raita sauce and crunchy Corn Nuts on top, and prepare to be amazed.Ingredients4 servings1garlic clove, smashed4oz. fresh goat cheese1½cups plain whole-milk Greek yogurt2cups mint leaves, divided2cups parsley leaves with tender stems, divided2Tbsp. extra-virgin olive oil, plus more for drizzling2Tbsp. fresh lemon juice, dividedKosher salt1medium head of purple cabbage (about 2½ lb.)3Persian cucumbers, thinly sliced½cup crushed Corn NutsAleppo-style pepper (for serving)PreparationStep 1Pulse garlic, goat cheese, yogurt, 1 cup mint, 1 cup parsley, 2 Tbsp. oil, and 1 Tbsp. lemon juice in a food processor until smooth and pale green. Transfer raita to a medium bowl; season with salt.Step 2Prepare a grill for medium heat. Cut cabbage in half through core. Cut each half into 3 wedges, keeping core intact. Drizzle wedges with oil to coat and season all over with salt. Grill until deeply charred on all sides (pretty much blackened) and a paring knife easily slips through the center, 8–10 minutes per side. Transfer to a cutting board and let cool 5 minutes (this also allows the cabbage to steam and become tender on the inside). Cut each wedge in half crosswise.Step 3Toss cucumbers, remaining 1 cup mint, remaining 1 cup parsley, and remaining 1 Tbsp. lemon juice in a medium bowl. Season salad with a big pinch of salt and toss again.Step 4Spread raita over plates; place a few pieces of cabbage on each. Top with salad and Corn Nuts. Sprinkle with Aleppo-style pepper; drizzle with more oil.Step 5Do Ahead: Raita can be made 1 day ahead. Cover and chill.How would you rate Charred Cabbage with Goat Cheese Raita and Cucumbers?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis seems a perfect blend of flavors. I will totally blend in goat cheese with yogurt (actually I would use kefir cheese for a thick creamy consistency to hold up against the herbs). Other veggie ideas are roasted peppers and eggplant. Such potential. Nandita SinghOakland1/14/2020The flavors of this were delicious! However the grill time in this recipe was vastly inadequate for medium temp grill. I let them go for 12 minutes a side and then rested then for 5 and they were still very crunchy. Next time I will bake the wedges for 20 minutes after grilling. AnonymousSan Antonio8/7/2018Explore Bon AppétitSaladRed CabbageCabbageLeafy GreensVegetableGoat CheeseCheeseCucumberSummerEasyQuickSideGluten-FreeNut-FreeVegetarianHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}