{"id": "29e6cdbaae79ebb44e193471ec82a2f5", "url": "https://www.bonappetit.com/story/best-homemade-pasta-is-ricotta-gnocchi", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Ricotta Gnocchi Gets You That \"Fresh Pasta Experience\" With Less of the Labor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRicotta Gnocchi Gets You That \"Fresh Pasta Experience\" With Less of the LaborIf you've never made homemade pasta before, start here.By Sarah JampelApril 28, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailA couple weeks back, Alex Beggs made a very convincing case for getting into pasta-making at home. The thing is, Alex Beggs did a lot of research, consulted experts, made several rounds of dough, and is generally fabulous. And she also has a pasta roller.Maybe you, too, are generally fabulous but you don’t have a pasta roller or the several hours it takes to research and execute fresh dough. Yet you still want homemade pasta because, as Selena says, the heart wants what it wants. In that case, I’m proposing ricotta gnocchi. Little pillowy dumplings made from a mixture of fresh ricotta (i.e. not salata), flour, parmesan, and eggs, they require neither machine nor rolling pin. With your bare (clean!) hands, you can make them from start to finish in about 30 minutes as long as you don’t dilly-dally.Gnocchi is a broad category of small, chubby, soft pastas with many variations within Italy and also all over the world, from Brazil to Somalia. Gnocchi can be made from semolina flour, cornmeal, breadcrumbs, or polenta, among other ingredients. (In France, gnocchis à la parisienne is made from choux pastry, the same dough used to make éclairs and cream puffs!)When it comes to choosing what sort of gnocchi to make, ricotta is reliable and forgiving. For potato gnocchi, you must first boil and rice potatoes. But ricotta gnocchi—called ndunderi in Amalfi where they originated—can be mixed and shaped immediately. And while potato gnocchi have a tendency to become gummy or leaden when weighed down with flour or over-handled, ricotta gnocchi are more foolproof. Mix together the dough, roll into strands, cut strands into nubs, and boil.These aren’t as creamy and light as ricotta gnudi, named “naked” because they resemble the inside of a ravioli filling and are just barely bound together. And that gives these ricotta gnocchi a distinct advantage! They’re not so delicate that they fall apart when tossed with sauce. Pair them with a buttery sauce of peas and herbs if you’re grasping for springtime feelings, or go with marinara, pesto, or sage/rosemary/thyme and brown butter. You can even toss the gnocchi with a bit of olive oil and grated mozzarella, transfer to an oven-safe dish or skillet, and bake until the cheese is melted and bubbling.You can also freeze your uncooked gnocchi on a lined baking sheet, then transfer them to a container or plastic bag when they’re frozen solid. Tuck it in the back of the freezer for a night when you need dinner in 15 minutes flat. Because homemade pasta never tastes better than when you were expecting to be eating a bowl of popcorn instead.Get the recipe:Springy Ricotta Gnocchi With Peas and HerbsIf you’ve ever been intimidated by the thought of making fresh pasta at home, look no further. Ricotta gnocchi is simple to make, and it’s faster and more foolproof than its potato counterparts. The only tricky part is adding enough flour so that your dough is easy to work with, but not so much that it becomes stodgy or tough. If you don't want to make the buttery herb and pea sauce, use whatever you'd prefer, be it marinara, pesto, or sage and brown butter. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-28", "author": ["Condé Nast", "Sarah Jampel"]}