{"id": "29ef13114b8c749b6701bf2b5b9d90c1", "url": "https://www.bonappetit.com/story/thanksgiving-etiquette-2020", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Is It Ever Okay…to Skip Thanksgiving Altogether? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Skip Thanksgiving Altogether?Advice for Thanksgiving gatherings small and very small.By Alex BeggsNovember 23, 2020FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.How do I do Thanksgiving for one without an inordinate amount of leftovers? —All Alone AndreaMy sister did this last year and gave rave reviews. She made ONLY her favorites (all BA recipes because she is supportive of my career): mashed potatoes, green bean casserole, cornbread stuffing with chorizo, “maybe a salad?”, and cranberry-lime pie for dessert. That’s right—no turkey. She halved everything but the pie. Let this inspire you.Illustration by Cari Vander YachtWe need an answer once for all: What time should the Thanksgiving meal be served? —Horological Hal Cocktails at 5:30 p.m., dinner at 7! 10? 8:30? Is anyone going to actually listen to ME? Every family seems to have their Thanksgiving hour set in stone (Plymouth Rock? Oof). I swear the 3 p.m. diners wait an entire year to eat at their off-kilter hour. Whatever time the host says, we comply—and complain. It’s a point of contention as predictable as the mashed potato lumps. Accept both.I’ve met two people who do themed Thanksgivings. Hollywood theme, nautical. Is this weird enough to work? —Mystified Madison Themed Thanksgiving sounds weird, but then again, so does celebrating the verrrrrrry murky story of our nation’s founding. Maybe the best thing about Thanksgiving is the fact that we all celebrate it a little differently. I’m thinking about boiling lobsters!Illustration by Cari Vander YachtAre we supposed to mash together everything on the plate? –Jumbled JoJo Whoa, whoa, whoa, stop it right there. No. The only time these dishes should commingle is in the inexplicable, very real product that is Thanksgiving dinner-flavored candy corn.Can I put raisins in stuffing? —Miffed Melissa Once my [redacted family member] made a casserole for a church picnic that no one ate, so she brought it home. “The raisins in this are great!” my dad said, eating the leftovers. They were flies. Even THAT wasn’t a good occasion for raisins.Illustration by Cari Vander YachtWhat if we just skip Thanksgiving this year? What can we do instead? —Substitute Selene Yes! I love canceling plans so much that I get separation anxiety when I leave my couch. Plus, with rising COVID-19 cases across the country, the last thing we need to do right now is gather indoors with often older relatives. Terrible idea. Take the year off and have fun with the opportunity to do whatever you want. Here are some fantastic ideas for alternate Thanksgivings:Marathon every Friends Thanksgiving episode while eating elaborate nachos.Go for a long and lonely hike with a thermos of soup and your thoughts.Online shop (the #deals!) until your eyes blur and your thighs burn.See what’s up at the beach.Light a pumpkin spice candle and summon your ancestors.Season your cast-iron pans by making 14 batches of bacon; eat bacon.Cry a little bit.Find something lost.Donate to your local food bank, duh!When is it acceptable to pick up a slice of pumpkin pie and eat it like a pizza? —Chaotic Chelsea Standing at the fridge at 7:07 a.m. in your night pajamas? Always. At the dinner table in your day pajamas? Never.Illustration by Cari Vander YachtIs it appropriate to catapult spoonfuls of mashed potatoes at relatives as a punishment for their bad behavior? —Knockout Kennedy In an election/pandemic/devastating fire year? YES! This is what we’ve come to.How do I avoid a Thanksgiving Zoom? —Evasive EdgarEveryone sent me this question! You don’t want to coordinate and do tech support for 26 family members while simultaneously trussing a turkey and “having a great time”? Huh, strange. I wrote this in August, but I sensed, based on the bros at the frat house playing germ pong a few blocks away from me, that this infectious world wasn’t going to be much different in November. And somehow now it’s worse. Tell your fam you’re going to be frantically cooking all day but you can pop in to say hello for five minutes at 11:35 a.m. Set your timer for six minutes and when it goes off during the call, say, “OHMYGOSH THAT’S MY PIE!” and Shut. That. Screen.Illustration by Cari Vander YachtIf you have to leave early, can you request pie to go? —Rushed Rahm Yes, especially if you’re headed out to work. Thank you, essential workers! Hazard pay, paid time off, and pie for all. Grateful to ya.Explore Bon AppétitEtiquetteThanksgivingIs It Ever OkayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-23", "author": ["Condé Nast", "Alex Beggs"]}