{"id": "2a1189a5ab02c782a74e5e04bbab15b3", "url": "https://www.bonappetit.com/recipe/char-siu-wellington", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Char Siu Wellington Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueChar Siu WellingtonBy Peter SomOctober 15, 20214.9(26)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintFor this Thanksgiving centerpiece recipe, developer and fashion designer Peter Som combined the flavors of very Cantonese char siu pork with those of very British beef Wellington. As a kid there was nothing Som liked more than when his grandmother would bring over still-warm char siu from Chinatown; he prized the edges in particular—slightly charred and fatty, with ample amounts of that sticky honeyed glaze. This version features pork loin marinated in a classic salty-sweet mixture of hoisin, honey, Shaoxing wine (Chinese rice wine), and five-spice powder, then roasted inside an old-school puff pastry crust. Meanwhile, the marinade is repurposed to create a silky, umami-rich gravy that comes together in a jiff. There are quite a few steps to this recipe, but most of the work can be done in advance, which will make day-of cooking a snap.For the rest of Som’s Thanksgiving menu, see his recipes for Asian Pear Salad With Peanut-Lime Dressing, Roasted Brussels Sprouts With Gochujang Brown Butter, Sweet Potato Tian, Dutch Oven No Mai Fan, and Milk Tea Bread Pudding With Crème Anglaise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonInstant-Read Thermometer$35 At ThermoworksShaoxing Wine$4 At Weee!French Rolling Pin$17 At AmazonPastry Brush$9 At AmazonMesh Sieve$13 At AmazonTongs$13 At AmazonLarge Skillet$84 At AmazonIngredients8 ServingsMarinade5garlic cloves, thinly sliced½cup hoisin sauce½cup light brown sugar¼cup honey¼cup Shaoxing wine (Chinese rice wine) or medium-dry sherry¼cup soy sauce2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. five-spice powder2tsp. toasted sesame oil1tsp. freshly ground white or black pepper½tsp. red food coloring (optional)13¾–4-lb. boneless pork loinDuxelles1large shallot, coarsely chopped3garlic cloves1lb. shiitake mushrooms, stems removed½cup (packed) cilantro leaves with tender stems1Tbsp. grapeseed oil or vegetable oil½cup Shaoxing wine (Chinese rice wine) or medium-dry sherryKosher salt, freshly ground pepperAssembly2Tbsp. all-purpose flour, plus more for dusting2sheets frozen puff pastry (two 14-oz. packages or one 17.3-oz. package), thawed8oz. prosciutto, thinly sliced1large egg, beaten to blendFlaky sea salt2Tbsp. unsalted butter1cup low-sodium chicken brothCilantro leaves with tender stems (for serving)PreparationMarinadeStep 1Combine garlic, hoisin, brown sugar, honey, wine, soy sauce, salt, five-spice powder, oil, pepper, and food coloring (if using) in a large baking dish or 2-gal. resealable plastic freezer bag. Add pork loin to marinade and turn to coat. Cover baking dish with plastic wrap or seal bag. Chill, turning loin a few times, at least 4 hours and up to 12 hours.DuxellesStep 2Working in 2 batches, pulse shallot, garlic, mushrooms, and cilantro in a food processor just until finely chopped (do not overprocess).Step 3Heat oil in a large skillet over medium. Cook mushroom mixture, stirring occasionally, until mushrooms have started to brown and pan is almost dry, 5–7 minutes. Pour in wine and reduce heat to low. Cook, stirring once or twice, until pan is dry, 10–15 minutes. Season with salt and pepper. Transfer duxelles to a medium bowl and chill until cold, at least 30 minutes.Do Ahead: Duxelles can be made 2 days ahead. Transfer to an airtight container; cover and chill.AssemblyStep 4Remove loin from fridge and let sit at room temperature 1 hour.Step 5Place a rack in middle of oven; preheat to 400°. Remove loin from marinade and pat dry with paper towels. Strain marinade through a fine-mesh sieve into a small bowl and chill until ready to use. Place loin, fat side up, on a foil-lined rimmed baking sheet and roast 30 minutes. Let cool. If loin is tied, remove twine.Step 6Dust a work surface lightly with flour and unfold both sheets of puff pastry on surface. Arrange sheets side by side, with long sides facing you and short sides overlapping slightly. Press short sides together with your fingers or a rolling pin to seal and form one long rectangle. Dust pastry with flour, then roll out to large enough to encase loin.Step 7Spread duxelles over center of pastry to create a rectangle about the length of loin, leaving a 1\" border at top and bottom. Lay prosciutto slices, overlapping slightly, across duxelles. Place loin on top of prosciutto. Starting with edge closest to you, roll up pastry, letting top and bottom edges overlap slightly; trim any excess, then pinch edges together to seal. Turn Wellington seam side down and twist ends to seal. Trim any excess pastry from sides, but make sure loin is completely encased in pastry. Transfer Wellington to a rimmed baking sheet and chill until pastry is firm, about 1 hour.Step 8Preheat oven to 400°. Lightly brush pastry all over with egg. Using a sharp paring knife, cut 3 diagonal slits in pastry across top of Wellington to let steam escape (do not cut all the way down into the meat). Sprinkle Wellington with sea salt.Step 9Bake Wellington until pastry is deep golden brown all over and an instant-read thermometer inserted into the center registers 145° (the temperature will climb as Wellington rests), 30–40 minutes. Transfer to a wire rack set inside a rimmed baking sheet and let rest 15 minutes.Step 10Meanwhile, melt butter in a medium skillet over medium heat. Whisk in 2 Tbsp. flour and cook until mixture is golden brown, about 2 minutes. Pour in broth and cook, whisking often, until thickened, about 3 minutes. Add reserved marinade and reduce heat to medium-low. Simmer, whisking occasionally, until gravy is slightly thickened, about 5 minutes.Step 11Transfer Wellington to a platter and arrange cilantro around. Cut into thick slices and serve with gravy alongside for pouring over.Do Ahead: Wellington can be assembled 1 day ahead; cover with foil and chill. Let sit at room temperature 30–40 minutes before baking.How would you rate Char Siu Wellington?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleUsed skinless pork loin with a decent amount of fat cap (about half an inch). A good recipe!Anonymoussingapore12/26/2021Made for Thanksgiving. I really enjoyed the char siu part, but those flavors do overwhelm the prosciutto and duxelles. I will definitely make a pork loin with this marinade again, but skip the Wellington part which was just unnecessary. Also, I found the cook times extremely low in the recipe. My oven runs hot, and I still found that I needed another 40 minutes or so for my 4lb loin. AnonymousMichigan11/26/2021It says to pre-roast the loin for 30 minutes at 400 degrees, then cool it before assembling.  What should the internal temperature be before pulling it from the oven?RickWPalm Springs, CA11/18/2021I hate when people completely change the recipe and then leave a review. But here I go…\n\nI divided this recipe into thirds using a pork tenderloin that I seared on all sides (instead of roasting) and one sheet of Pepperidge Farm puff pasty. Despite scaling things down this was excellent; the gravy tied things together and the referenced Gochujang Brussels sprouts were an excellent accompaniment. Will make again.  EFoMarshall, VA 11/8/2021I was curious how flavors like prosciutto, mushrooms and hoisin would work together so I tried this. Short answer is they don't. The sauce was extremely sweet and even in small doses completely overwhelmed and or/clashed with the other flavors in the dish.  This took a lot of time to prepare  and is truly not worth the effort.  Will not be making it again.Susan illinois10/31/2021Four foodie friends loved this - everyone had seconds. The Wellington by itself was wonderful -but the sauce transported it to a different dimension!  The recipe was silent about the fat on the roast - I would recommend trimming it to about 1/4 inch. Also recommend adding only about half the marinade (we had over 2 C, plus pan drippings) to the sauce and then taste to see if you need more.  I don’t eat a lot of salt, and adding all of it would have made the sauce overly salty.  In fact, we had enough marinade leftover for a second batch of sauce for the leftovers - fortunate, as the first batch was inhaled, it was so good. Being Asian, the creative combination of flavors evoked so many great food memories that I will definitely make this again.GloriaKensington, CA10/21/2021Absolutely delicious! Prepared this for a dinner party and everyone gave it a big thumbs up! The flavors of the Wellington are fantastic without the gravy but the addition of the gravy took the dish to a whole new level. \n\nOne thing I would do differently would be to use a sheet of parchment paper to place the puff pastry on before rolling out to desired size. The parchment paper helps to lift the edge of the pastry as you roll the pork loin giving better control for a nice bottom seam. \n\nThanks for a new take on a classic!AnonymousSouthern California 10/21/2021Looks fantastic! Looks like another of Peter Som’s scrumptious creations. May try it with pork shoulder in the filling!Anonymous10/19/2021I will definitely do this for my next dinner party!  Looks fantastic!AnonymousSan Francisco 10/19/2021Links for the rest of Som's Thanksgiving menu are broken!Anonymous10/18/2021Explore Bon AppétitPuff Pastry DoughPork LoinPorkMeatThanksgivingChineseEast AsianAsianRoastBritishEuropeanDinnerMushroomVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Peter Som"]}