{"id": "2a1dff3ba21302e0b92f5be96efcf530", "url": "https://www.bonappetit.com/recipe/tahdig-with-cranberries-and-herbs", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Tahdig With Cranberries and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueTahdig With Cranberries and HerbsBy Sohla El-WayllyOctober 20, 20204.1(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis tahdig is dressed up with cranberries and woody herbs for a Thanksgiving-y, festive feel. Use a large lightweight nonstick pot with a tight-fitting lid to properly steam the rice and develop a crispy crust that easily releases from the pot (nonstick heats—and transfers heat—quickly). Wrapping the lid with a kitchen towel prevents the steam from condensing and rolling down the sides of the pot. Seek out high-quality aged basmati rice, preferably parboiled or sella, which is steamed and dried. It cooks up fluffier and is more forgiving. This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.Ingredients4 - 6 Servings2½cups basmati rice, preferably sella¾cup plus ½ tsp. Diamond Crystal or 7 Tbsp. plus ¼ tsp. Morton kosher salt½cup ghee⅓cup unsweetened dried cranberries2sprigs rosemary2sprigs sage2sprigs thymeBig pinch of saffron threads1tsp. sugar1large egg yolk2Tbsp. plain whole-milk Greek \t\tyogurtSpecial equipmentA mortar and pestlePreparationStep 1Place rice in a medium bowl. Pour in cool water to cover and gently agitate grains with your hands; drain. Repeat process until water is almost clear, at least 2 more times. Cover again with cool water and let soak at least 15 minutes and up to 2 hours.Step 2Bring ¾ cup Diamond Crystal or 7 Tbsp. Morton kosher salt and 3 quarts water to a rapid boil in a large nonstick pot. Drain rice and add all at once to pot (it will sink to the bottom). Stir a few times with a wooden spoon to prevent sticking, then stop stirring. Return water to a simmer and cook until grains are nearly doubled in size and most of rice is rapidly bubbling up to the surface, 3–7 minutes, depending on quality of rice. When you bite into a grain, you should see a small white core; grains should remain firm. Drain rice and rinse under cold running water until cool; reserve pot. Set rice aside.Step 3Melt ghee in a small saucepan over medium heat. Add cranberries, rosemary, sage, and thyme and cook, stirring occasionally, until cranberries are plump and herbs frizzle and crisp, about 5 minutes. Using a slotted spoon, transfer cranberries and herbs to a plate. Set ghee aside.Step 4Grind saffron and sugar with mortar and pestle to a fine powder. Add 2 Tbsp. hot water and stir to dissolve; set aside.Step 5Mix egg yolk, yogurt, half of reserved ghee (scant ¼ cup), 1 Tbsp. saffron mixture, and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a medium bowl. Add 1½ cups reserved rice and gently stir to combine. Transfer to reserved pot and spread in an even layer with a spoon. Arrange herbs on top. Using a large spoon, mound half of remaining rice on top in a small hill, taking care that rice does not touch the sides of pot. Top with cranberries, then mound remaining rice over. Using the handle of a wooden spoon or a chopstick, make a hole in the center of the mound all the way to just above tahdig (the bottom layer). This will help the steam circulate throughout the rice. Drizzle remaining saffron mixture and ghee over, followed by 2 Tbsp. water. Wrap lid with a kitchen towel; cover pot. Secure ends of towel to pot handles with rubber bands or twine.Step 6Set pot over medium-high heat. Do not uncover at any point. Cook until sides of pot are very hot to the touch and you can hear the tahdig simmering, about 5 minutes. Reduce heat to medium-low and cook, undisturbed, until rice begins to smell toasty (but not burnt) and simmering sounds have subsided, 40–45 minutes. (If it’s your first time making tahdig, start checking for cues after 25 minutes. Timing can vary greatly depending on your pot and burners.) Remove lid; the rice should be fluffy and fully cooked. Using an offset spatula or fork, lift the bottom layer and take a peek to see if a crust has formed. If not, re-cover pot and continue cooking another 10 minutes. Once it has, remove pot from heat and let rice sit, covered, 10 minutes.Step 7Uncover rice and scoop off mounded rice along with cranberries and herbs to a platter. Loosen rice crust with an offset spatula and either turn out onto another plate or break into large pieces in the pot and place atop rice, golden side up.Step 8Do ahead: Rice can be parboiled 2 days ahead. Transfer to an airtight container; cover and chill. Bring to room temperature before using.How would you rate Tahdig With Cranberries and Herbs?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleA difficult recipe to replicate unless you have a gas stove, which I don't..try making the rice from a site called recipetineats that recipe does the version of making the rice in the oven AnonymousToronto Canada1/25/2022They didn't test this recipe! The recipe called for 7 tablespoons of salt ??? I totally questioned that but went ahead and followed the recipe. However it was way way tooooo salty! That's an insane amount of salt. I then looked up other recipe versions of this dish only to find the majority used 1 tablespoon.  I cooked this ahead of thanksgiving to give myself a head start. I'm disappointed I wasted all this food and my time. AnonymousPotomac, MD11/20/2021My problems with this recipe are admittedly user error, and probably incorrect equipment, but I'm leaving my experience for others to note. The only pot I had large enough for this quantity was an enameled dutch oven, and I believe the heat conducted through the cast iron was the culprit. Rookie mistake, I guess. I also have finicky burners that run hot and sporadic (apartment rental life). The tagdig was charred to a blackened crisp in only 25 minutes, and my burner was set to low heat after the first 4 minutes.\n\nThe flavors are delicious. The herbs and cranberry smell like heaven. I believe I did everything right except for the burn factor. I might try it again in a new pot, and will keep my burner on the lowest setting for the entire time, even the beginning. I may also increase the quantity of ghee mixture to drizzle over the mound of rice in the end, as it felt like a scant drizzle and much of the rice was uncoated.RebeccaLos Angeles, CA11/28/2020This was fantastic!  The directions were easy to follow and the tahdig came out perfect!AnonymousPortland, OR11/8/2020Explore Bon AppétitIranianMiddle EasternPersianCranberryBerryFruitRiceRice & GrainsFallMainGluten-FreeNut-FreeThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}