{"id": "2a256743b091e06c16854dd6092f84f3", "url": "https://www.bonappetit.com/story/does-egg-size-matter", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "What Size Eggs Should You Use For Baking? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Size Eggs Should You Use For Baking?Large is in charge.By Sarah JampelDecember 18, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailTroubleshooting other people’s baking recipes is one of my favorite pastimes (my own recipes: that’s a different story).I like to go through all of the possibilities—the temperature of the oven, whether the flour was measured by volume or weight, if the butter is European-style or has a high percentage of water—but a sneaky culprit, one I admittedly hadn’t spent much time pondering, is the eggs. Specifically, the eggs’ size. [No, I will not be making any “size matters” jokes in this article so if that’s what you’re here for, turn around now.]In The Good Book of Southern Baking, Kelly Fields, chef and owner of Willa Jean in New Orleans, writes, “There are only two real rules on eggs, y’all: get them fresh and get them local.” But she also goes on to say that all of her recipes call for large eggs. The same is true of two other baking books that came out this year—Claire Saffitz’s Dessert Person and Melissa Weller’s A Good Bake—and also applies to almost any baking recipe you’ll encounter. “Large is always a good assumption,” says Jocelyn Drexinger, owner of New Hampshire bakery Mint and Mallow and baker at Nellie’s Free Range. “95–99% of the time, recipes are developed with large eggs.” (Of course, if a recipe is specifically formulated with a certain egg size—one famous Contessa, for example, bakes with extra-large—seek them out for the most successful result.)Egg size matters more in some baking recipes than others. One good rule of thumb to keep in mind: The more eggs in a recipe, the more size will have a significant impact. As you add more eggs, that difference in weight—~2 ounces for a large compared to ~2 ¼ ounces for an XL and ~2 ½ for a jumbo—is amplified. When a recipe calls for 4 eggs, for example, that small ¼-ounce discrepancy is suddenly a whopping 1 ounce.You’ll also want to consider whether the eggs are vital for structure and/or flavor. In recipes that rely on eggs for leavening—like sponge cakes, meringues, meringue-based cookies, choux pastry—or for thickening—like pastry cream and lemon curd—you need a certain amount of egg for your dessert to reach its intended height, texture, and/or thickness. Use eggs that are too small and your cake could be under-leavened; too much whipped egg and it could rise dramatically in the oven, then fall when it’s not able to handle the weight of the excess liquid.Eggs also affect the ratio of dry to wet ingredients, which changes the result even if those eggs don’t play a critical role in leavening. Whereas cookies and cakes made with small eggs can be dry, dense, and crumbly, those made with big ones can be heavy, wet, and rubbery. Some cookies could pancake, while others might turn out overly cakey. Dough that you need to roll out—like for sugar cookies—could be frustratingly wet and sticky.Then there are what Drexinger calls “finicky recipes,” where precision is important, and even a small difference in egg size can make a big change. In these cases—like if you’re making a “high ratio” cake where the weight of sugar is nearly equal to the weight of flour—eggs are vital to the structure of the baked good, holding the sugar, fat, and flour in harmony.And don’t forget taste! In certain desserts—custards, ice creams, flans, simple sponge cakes—eggs provide that inimitable eggy flavor, and using smaller eggs will mean less of it. (In places where egg flavor really shines, their quality and freshness are also imperative.)Okay, but what if you like to keep jumbo eggs around for scrambling, frying, poaching, and hard-boiling? Or what if large eggs are nowhere to be found?The absolute best way to convert is, frankly, sort of annoying, since you’ll need to get out the kitchen scale. You’ll want to figure out the intended weight of the eggs. If the recipe calls for 3 large eggs, that’s about 150 grams. You’ll need to crack and whisk the eggs you’re using, weighing until you reach 150. Save any extra for tomorrow’s scramble (or a future egg wash). If your recipe calls for just whites or just yolks, you’ll need to do the same thing—separate your eggs, whisk them together, then weigh out the amount that’s called for (I use this handy chart from Cook’s Illustrated).But all in all, unless you’re throwing caution to the wind and using four jumbo eggs when a recipe calls for four large, you’ll “still get a cake or a cookie,” says Drexinger, “but it might not be exactly what the recipe developer intended.”But where do medium eggs even come from???Excuse Me, Why Do 'Medium' Eggs Exist?Excuse me while I have an existential crisis in the egg aisle.View StoryExplore Bon AppétitEggBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-18", "author": ["Condé Nast", "Sarah Jampel"]}