{"id": "2a31e6499345b1b2c48657496d21822b", "url": "https://www.bonappetit.com/recipe/slow-cooked-scallions-with-ginger-and-chile", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Scallions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Cooked Scallions with Ginger and ChileBy Claire SaffitzAugust 14, 2018EmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintLeave scallions in the oven for about an hour to draw out their sweetness for a low-maintenance side dish.Ingredients6 servings12oz. scallions, roots trimmed½head of garlic12\" piece ginger, scrubbed, very thinly sliced crosswise2dried chiles de árbol or ½ tsp. crushed red pepper flakes½cup extra-virgin olive oil¾tsp. kosher salt1Tbsp. unseasoned rice vinegarPreparationStep 1Place a rack in middle of oven and preheat to 350°. Toss scallions, garlic, ginger, chiles, oil, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast vegetables, tossing 2 or 3 times, until golden brown, very tender, and crisp around edges, 60–70 minutes. Let cool slightly, then add vinegar and toss to coat.How would you rate Slow-Cooked Scallions with Ginger and Chile?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentAmericanScallionOnionVegetableGingerHerbs & SpicesEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}