{"id": "2a31e05d601368756813466e111e2a47", "url": "https://www.bonappetit.com/recipe/date-and-soy-braised-short-ribs", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Date-and-Soy-Braised Short Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueDate-and-Soy-Braised Short RibsBy Zaynab IssaMarch 15, 20224.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintInspired by flavors of Filipino adobo, these short ribs are the pinnacle of comfort. While the short ribs cook, the Medjool dates melt into the sauce, adding depth and just-enough sweetness. The spring-y snap pea salad adds crunch and freshness, but feel free to switch it up with your raw vegetables of choice—smashed cucumbers with cilantro would be just as delicious.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonTongs$13 At AmazonCitrus Juicer$7 At AmazonWooden Spoon$6 At AmazonIngredients4–6 servings3–4lb. English-style bone-in beef short ribs, cut into 3\" segmentsKosher salt2Tbsp. vegetable oil, divided1large onion, thinly sliced10garlic cloves, smashed2Tbsp. double-concentrated tomato paste8Medjool dates, pitted, coarsely chopped3dried bay leaves¾cup soy sauce½cup distilled white vinegar1Tbsp. freshly cracked black pepper1½\" piece ginger, scrubbed, cut into matchsticks1½cups sugar snap peas, thinly sliced on a diagonal⅓cup coarsely chopped mint¾tsp. crushed red pepper flakes1Tbsp. plus 1½ tsp. fresh lime juiceCooked white rice and lime wedges (for serving)PreparationStep 1Season short ribs liberally with salt. Let sit at room temperature 1 hour.Step 2Heat 1 Tbsp. oil in a large Dutch oven over medium-high. Working in batches if needed, cook ribs, turning occasionally and reducing heat if needed to prevent scorching, until browned all over, 8–12 minutes. Transfer to a plate. Pour off all but 1 Tbsp. fat from pot.Step 3Set pot back over medium-high heat and pour in remaining 1 Tbsp. oil. Cook onion and garlic, stirring occasionally, until onion is softened, about 5 minutes. Add tomato paste and cook, stirring often, until paste begins to separate and stick to bottom of pot, about 3 minutes. Stir in dates, bay leaves, soy sauce, vinegar, pepper, and 4 cups water.Step 4Return short ribs to pot and turn to coat. Bring liquid to a simmer, then reduce heat and cover partially with a lid. Simmer gently, turning ribs occasionally and skimming fat from surface, until meat is very tender, 3½–4½ hours.Step 5Transfer short ribs to a platter. If needed, bring braising liquid to a boil and cook until thick enough to coat a spoon. Taste and season with more salt if needed. Remove and discard bay leaves.Step 6Toss ginger, sugar snap peas, mint, and red pepper flakes in a medium bowl to combine; season with salt. Drizzle lime juice over salad and toss to coat.Step 7Spoon sauce over short ribs; scatter salad over. Serve with rice and lime wedges alongside.Do ahead: Short ribs can be braised 3 days ahead. Let cool; cover and chill. Reheat, covered, over medium-low.How would you rate Date-and-Soy-Braised Short Ribs?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerMainDairy-FreeNut-FreeBraiseShort RibBeefMeatDateDried FruitFruitSugar Snap PeaPeaVegetableRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Zaynab Issa"]}