{"id": "2a315ddfae4bf9156fc58ccacc93d390", "url": "https://www.bonappetit.com/story/cynar-amaro-for-all-seasons", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Cynar Is an Amaro for All Seasons, Including this Hellish Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCynar Is an Amaro for All Seasons, Including this Hellish SpringMixed into spritzes. Stirred into cocktails. Poured into beers. Cynar does it all.By Alex DelanyMay 15, 2020FacebookTwitterEmailPhoto by Laura Murray, props by Allie WistFacebookTwitterEmailWelcome to Glass Half Full, a monthly column from drinks editor Alex Delany about what he’s drinking (and loving) right now.Here’s the short sell on Cynar: It’s an Italian amaro that’s been around forever. It’s loaded with flavor. It’s low-ABV. It’s versatile. It’s consistent. And it’s accessible across the USA. Cool? You’re a Cynar (pronounced chee-nar) fan now? Awesome. You can leave and go buy a bottle, if you’d like. Or you could stay for a minute while I wax poetic about why I always keep a stash at home.Developed in Venice in the 1950s, the main flavor of note here is artichoke, which gives it a vegetal bitterness that’s balanced by notes of green sugar cane and raisins. It falls pretty solidly in the middle of the bitter-sweet amaro spectrum; not crazy bitter, not crazy sweet. Cynar is an amaro for all seasons, if you will, which makes it especially perfect right now, when I’m looking to use the contents of my bar in as many different ways as possible.That balance is part of the reason I find it so flexible and easy to use. I’ll substitute it in place of sweet vermouth in cocktails like the Negroni, Americano, or the Manhattan for a deeper, more bitter dimension. I love it in a Lil’ Ripper and a proper spritz. The first time I dropped an ounce into a Budweiser I understood what a revelation felt like. But when I’m feeling lazy, I’ll just pour a couple fingers in a rocks glass with a large ice cube and add a slice of citrus peel and call it a day. However I serve it, though, it’s rare that I’ll just have one: At just 16.5% ABV (compared to your average whiskey or tequila’s 40-45%), Cynar is good for drink after drink.With all the mileage that this amaro sees in my house, shouldn’t I be worried about blowing through my supply right now? Nope, I’m all set. Those geniuses over at the Cynar factory knew to package it in a 1 liter bottle.Buy it: Cynar 1 Liter Bottle, $30 at DrizlyExplore Bon AppétitGlass Half FullRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-15", "author": ["Condé Nast", "Alex Delany"]}