{"id": "2a32c72aa645aab9c05611e4a019f5cb", "url": "https://www.bonappetit.com/story/peter-steckler-restaurant-diary-4", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "How I'm Making a Living Wage as a Line Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I’m Making a Living Wage as a Line CookIn his fourth Restaurant Diary entry, line cook Peter Steckler explains how the restaurant he works at handles the wage gap between the front-of-house and the back-of-house.By Peter Steckler, as told to Allyson ReedyMay 12, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: wine educator Kyla Peal, bartender turned brand ambassador Jenny Feldt, farmer Kristyn Leach, and line cook Peter Steckler. Here Steckler shares how American Elm, the Denver restaurant he works at, is helping back-of-house workers make a living wage. Read his previous diary entries here.The big news here is that Denver restaurants can now operate at 100 percent capacity, as long as there’s still six feet of spacing between tables. We’re still at 50 percent at American Elm because our dining room isn’t big enough to seat at full capacity with the spacing requirements, but we’re planning on going up to 100 percent in May when the rules change again. On May 16, the six feet requirement is expected to drop, and we’ll open up bar seating at that point as well. The last month has already been the busiest since I started working here, and this should only rev up things even more. Personally, I’m really excited about it, both for the challenge and also to go out to restaurants again myself.We’re still actively hiring at the restaurant, and as business picks up we’ll need even more people. A lot of restaurants are having a hard time hiring right now, since a lot of people have left the industry or chose to stay on unemployment. We’re feeling the squeeze, too, but we’ve gotten some talented people through our door. I think we’ve been able to attract new employees because of the leadership in the kitchen. My boss [executive chef Brent Turnipseede] creates a good work environment—we’re not a cutthroat kitchen where people yell at each other, and I think that’s refreshing for a lot of people.We also have a living wage fee added to checks that goes directly to kitchen workers, and I think that helps attract people. That’s one of the reasons I joined this restaurant after being laid off from my previous restaurant job last March. We have the traditional tipping model, plus a 1.5 percent living wage fee added to the check that goes to the back-of-house staff. That fee is distributed based on how many hours you work, and since I’ve been working so many hours, it makes a pretty big difference in my paycheck. It’s been on the check since the restaurant opened in August 2019. Something else the management has been doing is giving all of the tips on take-out orders directly to back-of-house workers, while front-of-house workers get dine-in tips. That’s major as we’ve had so many more to-go orders this year. On a big Friday night filled with takeout, that additional cash is very nice. Between those take-out tips and the 1.5 percent fee, I think I made an extra $7,000 or $8,000 last year. But even with all these things, there’s still a big gap in pay between the front-of-house and back-of-house.From what I understand, management is looking to make more changes like this to address the wage gap between the front and back of the house. We’re at $14.77 an hour as of January 1 for non-tipped workers and $11.75 an hour for tipped; the base was $11.10 an hour for non-tipped in 2019, as a point of reference, so it did climb pretty high, pretty fast. These recent minimum wage hikes further exacerbated that gap. (Editor’s note: Some restaurants raise menu prices to account for higher labor costs. However, this means checks will be higher along with tips, which only increases the wage disparity between front-of-house and back-of-house workers.) At the last restaurant I worked at, we didn’t have anything like that living wage fee. I made $14 an hour while some servers were walking away with six figures. How does that make sense? I know service is such an important part of the dining experience, and I have so much respect for the servers working at our restaurant and at the restaurants I’ve worked at in the past, but there’s a big inequality in how much we’re paid.I hope that we transition to a model where there’s a flat service charge on all checks and it’s distributed appropriately. It seems like a no-brainer when the wage gap is so significant. The money needs to be distributed more fairly, and narrowing that gap will make it so much easier to hire kitchen workers and attract more people to the industry in general.It’s also important for diners to understand the true cost of going out and that making a great meal is not cheap. They need to understand that there is a huge discrepancy between what most servers make and what the people cooking their food make. Minimum wage hikes only make that discrepancy worse. I really think that in a couple years, tipping will look very different than what it looks like now.Explore Bon AppétitRestaurant DiariesCoronavirusRestaurantsDenverPeopleFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-12", "author": ["Condé Nast", "Peter Steckler", "As Told To Allyson Reedy"]}