{"id": "2a41d527d6d77b324c3bfdcb701413ec", "url": "https://www.bonappetit.com/story/best-cooking-gifts-for-kids-gift-guide", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "16 Cooking Gifts for Kids Who Love to Help in the Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping16 Cooking Gifts for Kids That Go Beyond the Easy-Bake OvenThey don’t want kitchen toys—they want kitchen tools!By Tiffany HopkinsOctober 29, 2021FacebookTwitterEmailPhoto by Yunhee Kim, Prop Styling by Christopher WhiteFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Being an eight-year-old in the ’90s meant being obsessed with things that made me feel older. I watched NSYNC on TRL because that’s what my teenage sister did, and I loved cooking with my mom and aunties because it made me feel mature. I begged my parents for the O.G. Easy-Bake Oven—baking brownies for the neighborhood kids (the little dears) felt like a very adult thing to do. These days kids still want to feel older—as confirmed by my niece—but they’re a little more advanced. Play kitchens and light bulb–powered ovens? Please. Instead, young chefs are interested in baking cupcakes from scratch, cooking with real spices, and using their own dedicated knife set. Below you’ll find some of the best cooking gifts for kids—and if you play your cards right, they might even let you borrow them.Children’s Cotton ApronInspired by African prints, this thick cotton twill apron will make any kid feel like a pro in the kitchen. It is colorful and durable and has a big front pocket for holding cooking tools.\n$24 at EtsySoft-Serve Ice Cream MakerFact: Kids won’t beg you to buy them ice cream when they can make their own. This fully automatic machine makes super smooth ice cream, fro-yo, and sorbet in under 30 minutes.\n$130 at Bed Bath & Beyond$185 $102 at AmazonEmoji Cookie CuttersHelp your nephew make poop emoji–shaped cookies, and you will be his favorite aunt for life. This three-piece set of cookie cutters is made with sturdy BPA-free plastic and will keep the kids giggling.\n$15 at AmazonMini TongsA cardinal rule for cooking gifts for kids: Small hands need small kitchen tools, like this 6\" set of tongs. “My kids often refuse to touch food with their hands (and if they do, let’s face it, their outfit will usually tell the tale)—but how much more fun is tossing green beans, turning sausages, or flipping tortillas when they have special kid-size tongs?” says BA test kitchen director Chris Morocco. “Having their own special tools makes them a lot more likely to get involved in the kitchen.”\n$20 at Williams-SonomaMortadella Pool FloatThis five-foot pink pool float has a face freckled with bits of cracked pepper and saturated fat. It’s the perfect gift for the epicurean little one who prefers mortadella to bologna. Who am I kidding? I want this for myself.\n$68 at Katie KimmelKalamata’s Kitchen Book and Spicewalla SetWritten by sommelier Sarah Thomas, Kalamata’s Kitchen is an inspiring picture book for the next generation of curious eaters and courageous cooks. Follow Kalamata through her imaginary world of food, then take the adventures to the kitchen with a custom set of ethically sourced spices—cumin! turmeric! mustard seed!—from BA favorite Spicewalla.\n$36 at SpicewallaWorld's Largest Gummy WormThis three-pound gummy worm is a great gift idea for the child of your closest frenemy. It’s two feet long, dual-flavored (cherry and blue razz), has a shelf life of a whole year, and will make for one very hyper tiny chef.\n$32 at AmazonBake Away CookbookWritten by teenager Sahana Vij, Bake Away features 20 simple desserts, each accompanied with stunning visuals, that take readers on a road trip of creativity and self-expression. Bake her coconut chocolate tart, citrus poppy seed bread, and chai-infused cake and celebrate the beauty of giving—100% of Vij’s royalties will be donated to No Kid Hungry.\n$25 at Target$26 $23 at AmazonCast-Iron Skillet“You might think that kids need a lightweight pan, but that is wrong!” Morocco says. He recommends sticking with hefty pans (a 9\" skillet is a great size) that’ll sit securely on the stovetop: “Letting Finn cook his own pancake makes him flip his shit, he gets so excited—get real tools and real pans, though. None of the toy stuff.”\n$150 at Le Creuset$165 at AmazonRaindrop Cake KitIt’s the cake that broke the internet. Think of this cooking kit as a fun science project that uses a few simple ingredients—agar-agar, spring water, roasted soy bean flour, and black sugar cane syrup—to create an uber refreshing, slightly sweet jelly cake. Psst: It’s vegan and gluten-free.\n$45 at GoldbellyDash Mini Donut MakerThis zero-fuss countertop doughnut maker allows little chefs to make deliciously warm and fluffy doughnuts in minutes—no frying required. Just fill it with your favorite batter (or store-bought cake mix), close the lid, and set the timer. The auto shut-off function means nothing will ever burn.\n$25 at Amazon$25 $20 at TargetDinosaur Taco HoldersEating tacos from a plate? Snooooze. Eating tacos from an angry T. rex taco holder? THRILLING! These dinos hold two hard-shell tacos each. Plus, they’re durable and dishwasher-safe.\n$20 at Uncommon Goods (Tricerataco)$25 at Uncommon Goods (Tacosaurus Rex)KAI My First Chef’s KnifeAnother product popular in Morocco’s home test kitchen, this stainless-steel knife is perfect for young cooks. The grippy rubber handle is the right size for small hands, and the serrated blade and rounded tip allow beginners to learn knife skills while staying safe. They’ll be graduating to a chef’s knife in no time.\n$25 $20 at Williams-SonomaGingerbread House KitWith this five-piece set, making a whimsical gingerbread house from scratch is simple. It comes with an instruction pamphlet, a festive spatula, a frosting bottle, and two silicone baking molds—all optimally sized for kid bakers and their adult helpers.\n$36 at Amazon$30 at Uncommon GoodsTattly Pizza TattoosNothing makes kids feel all grown-up like a set of tattoos, just like grandma’s. This cheesy pepperoni pizza pack by illustrator Julia Rothman is made with nontoxic veggie-based ink.\n$5 at TattlyBirthday Balloon SprinklesGive the kid chef in your life a sprinkles upgrade this holiday season with a brightly colored blend of nonpareils, candy beads, and confetti stars.\n$9 at Fancy SprinklesExplore Bon AppétitGift GuidesShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-29", "author": ["Condé Nast", "Tiffany Hopkins"]}