{"id": "2a447323b26d753311f92f53aa1f7cd4", "url": "https://www.bonappetit.com/story/edible-glitter", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Edible Glitter Helps Every Meal Shine Bright Like a Diamond | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopEditors' PicksEdible Glitter Helps Every Meal Shine Bright Like a DiamondMaybe you’ve tried adding glitter to cupcakes. But have you tried it on shrimp?By Melissa Kravitz HoeffnerMarch 18, 2022FacebookTwitterEmailPhotography by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Every year, starting in the weeks following Thanksgiving and running through mid-April, my home cooking sheds its typically bright hue. Verdant green pastas, colorful salads, and flamboyant stir-fries are a mere summer daydream. Gone are the near-neon orange squashes and royal purple beets from my late fall CSA. My cozy season cooking adopts a neutral palate, a slew of browns and tans and taupes that would look chic on a Nora Ephron heroine but is rather lackluster against the glare of my off-white Crate and Barrel plates.I know, lush winter greens exist. Tuscan kale can dress up a cauliflower soup or pot of beans like confetti on a vanilla cake. Still, my motivation to put on multiple layers and trek to my grocery store for picked-over veggies wanes. Comfort food, often the shelf-stable type, reigns.Luckily for my mood, and my cooking, an ingredient lurking on my spice rack completely transformed my drab weather cooking: Fancy Sprinkle’s Edible Glitter. Often used to decorate twee cocktails or cakes, this glitzy, fine powder has made its way onto all types of savory fare in my kitchen, sprucing up and inspiring what would otherwise be lackluster mid-winter meals.Photograph by Isa ZapataFancy Sprinkles Edible GlitterShop Now at Fancy SprinklesThe obsession started with a box of unicorn-shaped mac and cheese, the emergency provision I hoard in the highest corner of my cabinet (only accessible by stepstool and desperate reach) for those days when only powdered cheese will do. As I stirred the unicorn heads and stars, I realized that, although no one in Kraft R&D asked me, this cheer-me-up meal would be even better with a small addition: sparkles.I grabbed a tiny jar of Fancy Sprinkles’ amethyst purple Prism Powder from the pantry, left over from a recipe-development project I’d never quite gotten off the ground. I dispersed the gleaming flecks over my bowl of fantasy-shaped pasta with a small spoon. My mood immediately lightened. The noodles were beautiful. Brag-worthy. Post-worthy. The glitter had no taste whatsoever, no nutritional value, no purpose other than sparking joy. Isn’t that what comfort food is all about?Amethyst Purple Prism Powder$14 at Fancy SprinklesAfter uncapping that first jar of Prism Powder, a sparkly culinary monster emerged from within. If glitter was so good on a low-rent noodle, how much better could it get from here? Spoiler: Much. The glitter goes a long way—just a few shakes from the $14 jar significantly coats a portion of food with enough gleam to feel both economical and special, like a showering of parm. My favorite way to adorn a dish with glitter: a small mesh strainer. Hold the strainer over the food and gently tap to allow glitter to disperse in a sparkly shower over your dish, as if you were dusting a cake with icing sugar. A makeup brush or fingertip works for dense applications, and Fancy Sprinkles also sells a dusting pump for easy, low mess spray application.I experimented with folding glitter into dough (fail—it just absorbed into obscurity) and stirring sparkles into pan sauces (also fail, but fun to watch). In the end, I found that sprinkling it on top of my lunches was by far the best use of my rainbow of Prism Powders. A generous adornment of gold to a fresh bowl of cacio e pepe made the one-pot pasta restaurant worthy, IMHO. A plate of radiatori with store-bought pesto was fully amped up with green glitter, as was my afternoon matcha latte. A sad bowl of cereal became a celebratory mid-morning feast, thanks to a few glitter shakes. The pink hue is ideal for one-sheet salmon dinners and a stunner of a shrimp cocktail. Leftovers get spruced up with kaleidoscopic glitters, not only hiding discoloration and flaws for Instagram, but also adding a touch of specialness to a days-old soup. Like fresh herbs, flaky salt, or spicy chili flakes, edible glitter is a garnish that improves pretty much everything.You know what to do:Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-18", "author": ["Condé Nast", "Melissa Kravitz Hoeffner"]}