{"id": "2a53f85ca3f6a0d3d896309be56e869a", "url": "https://www.bonappetit.com/story/savory-french-toast-vegetarian-steak", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Savory French Toast Is My Vegetarian Steak Swap | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSavory French Toast Is My Vegetarian Steak Swap“Bread Steak” hits the spot when a slab of cauliflower just won’t cut it.By David TamarkinJune 24, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I stopped eating steak, it was for environmental reasons and nothing else. So while that decision curbed my dinner’s emissions, it did nothing to curb my cravings. Sometimes, I wanted a slab of something absolutely lavish in the center of my plate—and for whatever reason, a cauliflower steak just wasn’t going to cut it.Instead, my carnivore’s palate led me to the Bread Steak. A custard-soaked, Parmesan-crusted chunk of sourdough—essentially savory French toast—that really is decadent in the vein of a rib eye. It’s fatty. It’s salty. And if you do it right, it’s downright meaty.I cook my Bread Steak like I used to cook “real” steak: I pan-roast it, getting it golden on the stovetop before sprinkling on some parm and a little sugar (for caramelization’s sake) and sticking it under the broiler to crisp up. When the bread is ready, it’s browned and crusty on the outside and, just like a perfectly cooked piece of beef, reveals a tender center when cut open.To make it, I start by whisking together 2 large eggs, ¾ cup of whole milk, and ½ teaspoon of salt in a bowl. Then, I lay 2¾-inch-thick slices of crusty sourdough bread in a shallow baking dish and pour the custard mixture over the bread. I'll let the bread soak for around 10 minutes, turning the slices once or twice. Then, I’ll get a large nonstick or cast-iron skillet going over medium heat and turn on the broiler. I hit the pan with a drizzle of oil, lift the bread out of the baking dish and let any excess custard drip off, and carefully lay the slices into the pan and cook on both sides until golden brown, about 3 minutes per side. Then I’ll shower the top sides of the slices with a good bit of grated Parmesan and a sprinkling of sugar, and then slide the skillet under the broiler until the cheese is browned and the slices are super crisp, about 2–3 minutes more. And voilà: Bread Steaks!A thick piece of this savory French toast can be eaten on its own for a snack, but if this is dinner, I pile it high with raw vegetables. Garlicky marinated tomatoes and fat dollops of creamy ricotta. Sliced snap peas and quick-pickled shallots tossed with just enough good olive oil to make it slick. A tangle of raw zucchini dressed with lime juice and chile crisp. I scatter a bit of whatever herb is on its last leg over top, and pair it with a glass of whatever bottle of wine/beer/vermouth is already open. The Bread Steak can go with all of it; the only thing it doesn’t like to hang with is beef.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-23", "author": ["Condé Nast", "David Tamarkin"]}