{"id": "2a56e31f73359396c9f4fae48daaf90f", "url": "https://www.bonappetit.com/story/before-i-got-sick", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "What I Wish I Did Before I Got Sick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat I Wish I Did Before I Got SickWhen I was feeling bad, I was desperate for advice.By Amanda ShapiroApril 9, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Kat Boytsova, Prop Styling by Emily EisenFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This week, for the Healthyish Guide to Being Alone, I wrote about going through what I think was Covid-19 on my own: what I did, what I didn't do, and what I'd do differently.I was hesitant to write about it because, first of all, I never got tested and can’t be sure I had it (though the two doctors I talked to remotely said it was likely). Also, people’s symptoms have varied so widely, I wasn’t sure how relevant one person’s experience could be. And I didn’t want to claim to be an expert in viruses, medicine, or herbalism. I’m just an editor at a food magazine who happened to get sick.But, as I wrote last week, at a time when panic seems to be the default reaction and so much is unknown, we need all the rational and supportive information we can get. There’s been so much written about how to prevent infection and stop the spread, but the CDC’s advice on what to do if you get sick is woefully basic: rest, hydrate, go to the hospital if you can’t breathe. When I was feeling bad, I was desperate for advice. Doctors were difficult to reach, so instead I found myself scrolling Twitter, a virtual cesspool where the scariest, saddest, and most alarming cases float to the top. That was...not good for me.The most helpful guidance came my way through friends who sent thoughtful personal accounts, suggestions for home remedies, and, quite literally, soup. I relied on those resources when I was taking care of myself, and I decided to pass on their best advice in the hopes that you or someone you love will find it useful.Tomorrow at 3 p.m. ET, I’ll be going live on Healthyish’s Instagram with my friend and chef Camille Becerra,who had a similar bout with suspected Covid-19 around the same time. We’ll talk about the immune-supporting foods we’ve been leaning on, the importance of rest, and how to stay calm (or at least calmish) even if you’re not feeling well.Come with your questions, and we’ll see you tomorrow.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterCoronavirusessayRead MorecultureWhat I Wish I Did: A Guide to Getting Through Covid-19 AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Amanda Shapiro"]}