{"id": "2a5a7912cd11dfa3add3409334deae90", "url": "https://www.bonappetit.com/story/never-fail-soy-marinated-eggs", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Add These Soy-Marinated Eggs to My List of Favorite Things | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAdd These Soy-Marinated Eggs to My List of Favorite ThingsThe list was pretty much just New Jersey, black clothing, and frittatas. That is, until these soy marinated eggs came into my life.By Emily SchultzMarch 15, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Here are a few things you should know about me. I talk about the cultural significance of Jersey Shore at least once a day. I wear a lot of black clothing. And eggs are a food group to me.Whether they’re fried, scambled, baked into a frittata with tons of veggies or soft boiled, I truly cannot get enough eggs in my life. They’re just a perfect food, and go with any sauce. (I love sauces too, BTW.) But these soy-marinated eggs? They changed everything.I first fell in love with these soy-marinated eggs on a chilly day in November when senior food editor Chris Morocco was testing recipes—like he does—for a March feature story we ran featuring recipes from chef Sohui Kim’s cookbook Korean Home Cooking. On the table he had red-wine and soy braised short ribs, white rice, lightly-pickled cucumbers, and a gallon-sized container of brown liquid with eggs submerged in them. Curious, I took one out and ate it over a bed of warm rice. The inside had remained perfectly jammy—the result of cooking an egg in simmering water for seven minutes exactly—while the outside tasted like salty-umami heaven and had a light brown stain, like your favorite brown lipstick from 1998. I HAD to have these at my house.So when this story finally came out in print, I immediately made The Eggs. I cut them up and ate them with Kim’s kimchi Jjiggae and some white rice from my rice cooker, spooning the extra marinade over the whole thing, and then proceeded to eat them plain the next morning for a very salty breakfast. It’s literally so easy, but I’ll tell you how to do it because I like you.She's perfect.\nPhoto by Chelsie CraigFirst, you have to boil the eggs. My preferred method for a jammy, custardy interior is as follows. Bring water to boil and gently lower however many eggs you’d like into the water. Set your timer for seven minutes exactly and fill a bowl with ice water. After the seven minutes is up, you’ll plunge your eggs into the ice water to stop them from cooking any longer. Dump the remaining hot water out of your pot and add garlic, chiles (I used red pepper flakes because I didn’t have chiles), soy sauce, mirin, vinegar, and two cups of water. Stir and bring that whole thing to a boil. While that mixture is heating, peel all of your eggs! (I like to crack the bottom and peel out from there, in case you were wondering.) Once the soy sauce mixture has come to a boil, turn the heat off and add the eggs. Let them sit right there in the pot for an hour, and then you’re ready to serve! Or you can transfer the whole thing to the fridge. The whites of eggs are porous which means that flavor spreads throughout the whole egg, which is honestly why this marinating method works. The longer you keep them submerged in the marinade, the more soy sauce flavor they’ll take on. Love to learn about science, right?So, yeah, to all of my friends: Apologies in advance if I start bringing up these soy marinated eggs in regular daily conversations. You're just...going to have to get used to it.Get the recipe:Soy-Marinated EggsWhat’s better than a jammy egg? One that’s been sitting in a tangy-salty marinade of chiles, soy, mirin, and vinegar, like this classic star of Korean banchan.View RecipeExplore Bon AppétitBasicallyNever FailHard-Boiled EggsEggSoy SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Emily Schultz"]}