{"id": "2a60f4cadef989284fa314d73473b5e4", "url": "https://www.bonappetit.com/story/diet-coke", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "I’m the Drinks Editor at BA and, Yes, My Favorite Beverage Is Diet Coke  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m the Drinks Editor at BA and, Yes, My Favorite Beverage Is Diet CokeNo further questions at this time.By Alex DelanyMarch 9, 2020FacebookTwitterEmailPhoto by Laura Murray, Styling by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I don’t need to introduce you to Diet Coke. You’ve met. I won’t be blowing any minds by explaining what Diet Coke is or how popular it is across the globe (and around our office—Beggs, Jampel, you know what I’m talking about). But have you had a can of Diet Coke recently? Do you remember how wildly delicious it is? I have. And I do. I drink it all the time. (It’s been my soda of choice since I was diagnosed with type 1 diabetes at age 3.) Diet Coke is a perfect beverage, and I love it.Sure, I know that Diet Coke’s color isn’t natural. That its sweetness comes from aspartame. That it has a chemical-y taste—especially when sipped straight from the can, the premiere Diet Coke delivery vehicle. But that’s actually why I find it so lovely. The flavor lands somewhere between the mineral flavor we prize in white wines like Chenin Blanc or Muscadet and the bitterness found in lemon zest. And when you take that flavor and mix it with baking spices and a hint of vanilla, well, you get a soda that sort of tastes like an amaro. A soda that the entire world has fallen in love with.Yes, Diet Coke makes food taste better—banh mi, tacos al pastor, papri chaat, a slice of New York–style cheese pizza. On its own, though, that’s when you can mainline the pure potential of the beverage. In the depths of a mid-afternoon slump? Diet Coke is the answer. Hungover? Diet Coke, also the answer. Not in the mood to drink at the bar? The answer is...yeah, Diet Coke. It’s a wonderfully chilled breath of adrenaline and happiness packaged in a 12-ounce aluminum can that’s consistently good, every time. What more could you want?Buy it: Diet Coke, $6 for 12-pack at TargetAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingSodaRead MorecultureI’m Now a Leisure Soda Guy, Thanks to These Refreshing Leisure SodasBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-09", "author": ["Condé Nast", "Alex Delany"]}