{"id": "2a63a1201b27022388f36c179ba03f85", "url": "https://www.bonappetit.com/story/gift-guide-2021", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "The 33 Best Gifts (2021) For Food People | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Ultimate Bon Appétit Gift Guide for Every Food Person You KnowHand-marbled serving bowls, gift-worthy coffee subscriptions, and the platonic ideal of a panettoneBy MacKenzie Chung FeganNovember 19, 2021FacebookTwitterEmailPhoto by Yunhee Kim, Prop Styling by Christopher WhiteFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.It’s the season for togetherness, charity, goodwill toward mankind! Also presents. Mostly presents. With that in mind we’ve assembled the best gifts (for 2021 and beyond) for everyone on your list—or at least everyone on your list who enjoys eating, drinking, and being merry. Go to Wired for the tech gifts.For your dog walker, coworkers, or the guy you’ve been on only two dates with, check out some of our favorite things to give—including plenty of food gifts and stocking stuffers—for under 50 bucks.Have a tiny tyrant in the kitchen? We’ve got great gifts for kids who love to cook, including a knife for small hands and a mortadella pool float.The best cookbooks of the year also make the best presents.For the chef who’s trying to be more eco-conscious, we’ve rounded up some sustainable gifts for a greener kitchen.Our gardening gift guide was written by pastry chef turned backyard farmer Natasha Li Pickowicz. Find out what boots she recommends for both the garden and the kitchen.Speaking of bakers, here are 38 gift ideas for the cake makers and bread whisperers in your life.Head over to our review of the best coffee subscription boxes for a thoughtful gift that keeps on giving into the new year.For the just-right Christmas gift for folks whose tree is up immediately after Thanksgiving, check out our favorite edible (and quaffable) advent calendars.We’ve also got a food puzzle holiday gift guide for cozy cashmere-swaddled nights by the fire.Finding holiday shopping overwhelming? Get ’em all food ornaments and pour yourself a beer.But for your nearest and dearest, we’ve chosen a few gifts we think will bring a little extra sparkle to the season. These are the modernist Dutch ovens, handmade ceramics, and top-shelf mezcals we’ve been coveting all year—and coming from a group of people who handle a lot of ceramics and drink a lot of mezcal, that’s saying something. Read on for the best gifts for the extra-special food people in your life.Photograph by Emma FishmanFor the aunt with the fake orchidsHelp her do better. Gift her a dried arrangement in one of these sculptural papier-mâché vessels made from recycled paper. It will last just as long as fake flowers but is a serious home decor upgrade.Serax Papier Mâche Vessels$60 at Food52For the friend who is celebrating minimalism’s demiseIf you know someone (me) who is done with white-on-cream-on-white, these napkins from Kenyan brand Siafu Home are anything but beige. The Lesso set is crafted from vintage fabric, while the Congolese napkins are hand screen-printed on 100% cotton and finished with a contrasting scalloped edge.Lesso Napkins$120 at Goodee (Set of 6)Congolese Napkins (Set of 6)$100 at Goodee$100 at NordstromFor your brother who starts every sentence with “When I studied abroad in Florence...”We’ve never met a panettone we didn’t like, but Olivieri 1882’s are in a class of their own. Even your bro will be impressed. Go with the classic or wild out with triple chocolate or salted caramel apricot. On the off chance you have any left over, get ready for the best French toast of your life.Panettone$75 at GoldbellyFor your dad who still buys ground coffeeFor better coffee you need to be grinding your beans at home, DAD. This incredibly handsome countertop burr grinder from Fellow will take his Aeropress, pour-over, or French press to the next level. If Pops is an espresso drinker, though, this gadget isn’t for him; get the Mazzer Mini.Fellow Ode Brew Grinder$299 at Bon Appétit Market$299 at NordstromFor your host but actually for yourselfIf you’re traveling for the holidays, gift your host a generously sized mug from Mudwitch and then steal it for yourself every morning. San Francisco ceramist Viviana Matsuda’s wares sell out quickly, so keep an eye on their Instagram for info about drops and restocks.Angles MugShop Now at Mud WitchPhotograph by Emma FishmanFor the modernist cookNo shade to those heritage French brands, but these sleek enameled cast-iron Dutch ovens designed by chef Sergio Herman for Serax have us feeling weak at the knees. These are heirloom pieces that will have your future grandkids remarking on your exquisite taste.Serax Dutch Oven$210 at Amazon$200 at Food52For the organization enthusiastThis brass dabba from Diaspora Co. keeps your giftee’s most-used spices neat and within reach instead of perilously stacked on a shelf next to the stove. Each piece is hand-spun by a single craftsman in Bangalore who has been honing his trade for over 25 years, and it comes with your choice of seven jars of high-quality, ethically-sourced spices (including Diaspora's best-selling turmeric).Masala Dabba$200 at Diaspora Co.For your Deadhead uncle or Zoomer cousinThis 53\"-long tie-dyed runner, made from reclaimed denim linen, is the rare gift that’s appropriate for the olds and youngs alike.Tie Dye Denim Runner$78 at Goldune$78 at Wolf and BadgerFor the kawaii cookMaking rice just got cuter. This ceramic Japanese rice cooker (from Hario, which makes some of our favorite coffee gear) whistles like a tea kettle when it’s time to take it off the flame. Measuring is a snap as well—add enough rice to reach the first line on the interior of the pot, then water up to the second line and you’re good to go.Hario Rice Cooker$75 at Food52 (Small)$95 at Food52 (Large)For the friend who is into loose-leaf tea and extreme dramaYou know the one. Hand-thrown on a wheel, this red stoneware tea strainer and mug ensemble is from Montréal-based ceramics studio Léa & Nicolas.Ensemble à thé$88 at Léa & NicolasFor your cottagecore niblingLet them live out their pastoral fantasies with this extremely charming picnic basket from KAZI Goods, handwoven in Ghana.Handwoven Picnic Basket$90 at MaisonetteFor the most flamboyant person you knowThis literal chalice is giving me strong debauched Roman emperor energy. Made of lapis lazuli, serpentine, and brass, the Onix Cup from Colombian designer Natalia Criado is the ideal gift for the lovable Nero in your life.Natalia Criado Marble Cup$320 $256 at The Webster$256 at The ListFor the cook who will not be tied downIt’s no secret that we’re Team Cross-Back Apron over at BA—they’re comfy, flattering, and not all that dissimilar to the shapeless smocks I wear out to dinner. Hand-loomed in Guatemala, these utility aprons from MINNA are made of heavy-weight cotton and come in cheery colors like mint green and golden honey.Utility Apron$135 at MinnaFor your best friend who moved to L.A. (but left her heart in New York)It’s a classic for a reason. Carnegie Deli's 8\" Cheesecake hits just the right textural spot between dense and creamy, and it’s not overly sweet.Carnegie Deli 8” Cheesecake$99 at AmazonFor your FoodTok-obsessed husbandIf it’s trending, he wants it, and he won’t stop talking about the GE Opal nugget ice maker. It’s a chunk of change, but if we had to guess, there will be some good deals on the good ice come Black Friday.GE Profile Opal Nugget Ice Maker$529 $499 at AmazonFor the hostess with the high-end scented candle collectionThankfully, this fruit confit candle, a collaboration between BA and Rue B, has little in common with this dubiously styled fruit confit recipe from 2003, but it will fill your house with the scent of warm spiced citrus and stone fruit. Figs more your thing? We’ve got that too.The Fig Candle$50 at Bon Appétit Merch ShopThe Fruit Confit Candle$50 at Bon Appétit Merch ShopPhotograph by Emma FishmanFor your boo who has been dropping hints about jewelryGemstones? In this economy? If a real emerald isn’t in the cards, give your SO a box of these crunchy-on-the-outside, gummy-on-the-inside vegan sweets that are dupes for precious stones. They come in flavors like yuzu and hibiscus-cranberry, are made with agar-agar—that seaweed-derived gel you may remember from preparing petri dishes in science class—and are elegantly packaged in luxe jewelry boxes.Crystal Treat Jewelry Box$64 at Misaky TokyoFrom our sponsor: For the sister whose motto is ABH (Always Be Hydrating)LifeStraw’s glass water pitcher filters out over 30 very un-delicious contaminants including microplastics, PFAs, lead, and bacteria. Unlike some clunky competitors, it’s attractive enough to go from fridge to tabletop. Sponsored by LifeStraw.LifeStraw Home Pitcher$55 at Life StrawFor the study buddy who got you through Archeology 101The markings on these printed linen napkins are inspired by First Nations pottery and tools unearthed in Southern Manitoba, Canada. For Anishinaabe designer Destiny Seymour, these patterns belong not only in museums, frozen in time, but also at the tables where we gather with loved ones.Bezhig and Niswi Napkins$68 at Indigo ArrowsFor your weirdest family memberHand-blown in Brooklyn by artist Grace Whiteside, these glass tumblers come in any array of colors, from moody plum to highlighter yellow, and feature bulbous bubbles begging to be booped.Bubble Cup$110 at GolduneFor your pal who wants to be OprahYou get a salmon belly! You get a salmon belly! A 5-lb. box of smoked king salmon bellies from Alaska Gold Seafood fishermen’s co-op contains somewhere between 22 and 45 individual pieces, depending on size, so your friend can give them out with generous abandon. Cut from wild-caught king salmon and cured with sugar, salt, and soy sauce, there’s a reason this rich, fatty cut is often called “salmon candy.”Smoked King Salmon Bellies$195 at Alaska GoldFor your grandma who always asks what Chris Morocco, “that nice young man from the YouTube,” is up toWhat he’s up to is cooking with the Hestan NanoBond titanium sauté pan, his current favorite piece of cookware. The price tag is hefty, but it’s the most durable stainless-steel pan we’ve used.Titanium Sauce Pans$330 $264 at Hestan$330 at AmazonFor the home baristaA three-month subscription to Trade Coffee would make a fine gift, but for something a little more festive, opt for this celebration box. The initial package will arrive with three bags—light, medium, and dark roast—from one of Trade’s partner roasters like Alma Coffee, a Georgia-based roaster run by a 5th-generation coffee farmer and a military veteran. After sampling all three, your lucky recipient can take a quiz and Trade will send them a fourth bag based on their preferences.Trade Coffee Celebration Box$80 at Trade CoffeeFor your mother-in-law with the killer glassware collectionTwo natural winemakers (Chris Brockway and Bridget Leary of California’s Broc Cellars) and a furniture designer (Rafi Ajl of the Long Confidence) walk into a glassblowing workshop (Glow Glass Studio), and out come these gorgeous low-profile wine glasses. I use mine for small slurps of Frappato and also nips of whiskey and hot tea.Wine Glass$55 at Broc CellarsFor the hostess with vintage sensibilitiesPop some Lambrusco and fire up the fondue pot. Tory Burch’s Spongeware Pitcher is apparently inspired by speckled and splotchy 19th-century stoneware, but it’s giving me straight ’70s vibes all the way.Spongeware Pitcher$98 at Tory BurchPhoto by Emma FishmanFor the person with the backyard citrus treeUse this footed clay tray, handcrafted in Colombia, to hold lemons or fresh avocados—or to serve a party-size amount of guacamole.Ames Mini Barro Tray$205 at GoodeeFor the best friend who better be willing to shareThese small-batch limited-edition mezcals from OAX Original are meant to be sipped and savored, but we’d consider buying them for the gorg ceramic bottles alone. The Tepeztate expression, distilled from marbled agaves that take 25 years to reach maturity, is especially exceptional.OAX Original MezcalsShop Now at Reserve BarFor the fiancée with cold feetWe can’t think of a better stocking stuffer than socks, and we can’t think of better socks than the ones in the BA Merch Store. Get the olive pair for the martini lover in your life and send a pointed message to the person who served you gritty greens with these bathing kale socks.The Olive Socks$22 at Bon Appétit Merch ShopThe Super Kale Socks$22 at Bon Appétit Merch ShopFor the friend with the giant burn mark on their wood tableMade in Uganda from sustainably harvested acacia wood and cow horn, this trivet from xN Studio is as lovely as it is functional.Acacia Wood Trivet$60 at xN StudioPhoto by Emma FishmanFor the flower childFloral tea company The Qi sells dried flowers like rose and chrysanthemum that bloom in hot water. It’d be a shame to hide the blossoms behind the porcelain walls of a regular teapot, so they collaborated with designer Sophie Lou Jacobsen on this borosilicate glass teapot, which is a stunner in its own right. It’s just as good for coffee or hojicha as it is for herbal and floral brews.Bloom Teapot$75 at Nordstrom$75 at The QiFor the dinner party artistThis 60x60\" square of organic cotton from Brooklyn design studio Fefo looks like a painter’s drop cloth dyed with splotches of radicchio and rose. Use it as a tablecloth in the winter and a picnic blanket come summer.Picnic Blanket$150 at FefoFor the star gazer who needs a saladLucky are the greens that get served in these porcelain serving bowls, each hand-cast in Nashville by Sarah Cihat. The marbling pattern is reminiscent of a moody night sky.Stellar Serving Bowl$180 at MisetteFor the cook who wears his love for BA on his sleeveOr, er, apron. Hedley & Bennett makes some of our favorites, which is why we collaborated with them on this signature apron with sky blue accents.The BA Apron$125 at Bon Appétit Merch ShopFor your chic-as-shit sister-in-lawModern and minimalist, this steel Hanukkah menorah comes in elegant neutral tones like charcoal and off-white as well as navy blue, rust red, and Dijonnaise yellow.Trace Chanukiah$155 at Nordstrom$155 at Via MarisFor yourself, after your last house guest has leftPut on every last piece of jewelry you own, pop open a bag of potato chips, and sip a sopping wet martini out of this softly angular mouth-blown Italian coupe from East Fork and R+D Lab. Self-care, baby.Martini Coupe$126 at East Fork (2-Pack)Prefer to go the DIY gift route? There’s always cookies:Explore Bon AppétitShoppingGift GuidesCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-19", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}