{"id": "2a6f9d6c77db95cd56e504c5733f7ba7", "url": "https://www.bonappetit.com/story/sound-view-hotel-north-fork", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "It’s Still Summer, So I’m Still Summering at This Dreamy Hotel on the North Fork | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Still Summer, So I’m Still Summering at This Dreamy Hotel on the North ForkUntil September 24 hits, you can find me at the Sound View in Greenport, New York, eating lobster rolls at a pool overlooking a beach.By Hilary CadiganSeptember 6, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Quit it with the pumpkin spice press releases and targeted Instagram sweater ads, people. It’s 80 degrees outside! It’s still summer! It ain’t officially over until September 23! Which means if you live in New York, it’s time to sneak out of work early, board the Long Island Railroad, ride it all the way out to the North Fork’s tip, and hunker down at the Sound View, a beachfront hotel in the sleepy town of Greenport.Here is where you’ll find me, sunning myself on the rocky shoreline as the waves lap my toes. Slurping popsicles beside a turquoise pool manned by a beefy blonde lifeguard that looks like he literally answered a casting call for beefy blonde lifeguards. Not showering before dinner so my hair maintains its frizz-less, salty beach waves as long as possible. Sound View is an amalgamation of every nostalgic summer memory I’ve ever had, combined into one retro-on-purpose paradise complete with a quarter mile of private beach, and it’s the only place I want to be right now.‘Cause here’s the thing about summering-as-an-adult: By the time you realize it’s happening, most of it’s already booked up with deadlines and family obligations and weddings in the midwest. Which is why it wasn’t until late August that my husband and I finally took a summer weekend trip of our own volition. So we had to make it count.Pretty sure there’s more than one lobster in there.\nPhoto by Tara DonneImmediately upon checking into one of the Sound View’s cedar-paneled rooms, all clean white sheets and sailcloth pillows and views straight out onto the beach (ALL of the rooms at the Sound View look straight out onto the beach), I felt my blood pressure slow. For lunch, we jammed lobster rolls the size of our faces into our faces by the pool. Come late afternoon, we sat on our sandswept porch drinking canned rosé and watched the sky turn gold. For dinner at The Halyard (Sound View’s hotel-restaurant-that-decidedly-doesn’t-suck), we grabbed a corner table on the open-air deck and ate peak-season heirloom tomato gazpacho and crisply seared scallops caught just a few miles away. Afterwards, loose on Greenport IPAs, we moseyed over to the piano bar for karaoke night and performed Alanis Morissette duets for a group of drunken Scottish people (all of whom are now our best friends) late into the night. It was a perfect weekend, the kind that made summer feel as endless as it did in the good old days, back before Google calendars existed.Come September 24th, I’ll give up the ghost, shove my swimsuit collection under the bed, switch over to my fall skincare routine, and let summer be pried out of my cold, still-tan fingers. But until then, keep your pumpkin spice nightmares to yourself.Go there: Sound ViewExplore Bon AppétitHighly RecommendHotelsNorth ForkRead MorecultureThis Stylish Hotel Soothes My Travel-Weary SoulBy Emma FishmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-06", "author": ["Condé Nast", "Hilary Cadigan"]}