{"id": "2a7befe529afdef58402c59ce32c803f", "url": "https://www.bonappetit.com/story/island-wine", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "To Hold Onto Summer, Pop a Bottle of Island Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingTo Hold Onto Summer, Pop a Bottle of Island WineWines from southern European islands will transport you somewhere balmy, breezy, and beachy.By Joseph HernandezSeptember 7, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As summer fades I’m feeling wistful. I should’ve spent more time at the beach, said yes early and often, gotten so deliciously sun-drunk that I forgot to reapply SPF. But instead of wallowing in my regret (we have all winter for that), I’ve been seeking out island wines, which instantly transport me back to the season’s peak.Island wines, a catch-all term describing wines from southern European island locales (think Sardinia, Sicily, and Santorini, among others), are full of freshness and verve, perfect for early fall porch hangs, when the warmth still lingers in the air. While every island has its own terroir, climate, and indigenous grapes, there are a few key elements that help explain the defining features of this easy, breezy wine style.Quick geology lesson: Islands are typically formed by volcanic activity, and the resulting soil is porous with great drainage, the right combo for encouraging vine roots to grow deep in search of nutrients. These austere conditions yield more flavorful wine, as the hardy vines vigorously soak up minerals and channel all their energy into fruit production. Constant ocean breezes help keep moisture-loving diseases and pests at bay, and proximity to the sea encourages the kinds of temperature shifts that produce high-acidity thirst quenchers. Some pros even argue that these wines deliver an intriguing saline quality, as if kissed by salt carried on a sea breeze.These natural advantages gloss over the human ingenuity of ancient winemaking, though. In some places, wind can be a particularly challenging growing condition, requiring creativity. Head to the Canary Islands and you’ll find cratered vineyards that look like the surface of the moon, which helps prevent young vines from being uprooted by stiff gales. The grapevines of Santorini are as iconic as the white-washed, blue-domed architecture; for generations winemakers have trained each of their vines into a basket-shaped kouloura, which shields the precious grapes growing within from harsh winds. These factors yield wines that almost always fascinate. Though flavors range, aromatic island whites can be refreshingly bracing, like licking a salted lemon on the beach. Reds are more seductively ethereal, like catching a whiff of cardamom and clove wafting through a market square.At their best these wines are as transportive as a time machine. To me they are summer in a bottle, a reminder that though the days grow shorter and the world drains of color, I can still say yes to the things that matter.Photo courtesy of Parcelle WineCOS FrappatoIndigenous to Sicily, frappato produces a light red that is wonderful chilled. Pair with the last of the tomatoes.$35 at Parcelle WinePhoto courtesy of Astor WineDomaine Santamaria La Boutanche RougeA lip-smacking Corsican blend that plays as well with grilled veg as it does with hearty pastas.$23 at Irving BottlePhoto courtesy of Astor WineGaralis Terra AmberaThis wine from the Greek island of Lemnos has the acidity and light tannins of a perfect Arnold Palmer.$22 at Astor Wines$25 at DrizlyExplore Bon AppétitThe PourShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-07", "author": ["Condé Nast", "Joseph Hernandez"]}