{"id": "2a87370280dec5be6ea93069f4968fd8", "url": "https://www.bonappetit.com/recipe/tangy-brisket-with-fennel-and-herbs", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Brisket With Fennel and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueTangy Brisket With Fennel and HerbsBy Alison RomanNovember 19, 20194.8(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintAlison Roman wants to make a brisket worth looking forward to. This one is seasoned heavily with salt and pepper, seared until deeply browned, strewn with caramelized savory aromatics (no mushy carrots!), and braised until fall-apart tender. When it’s nearly done, crank the oven and brown the top again, restoring the crust lost in the braise and reducing the liquid to a rich spoonable sauce. “And yeah,” she adds, “of course there will be red pepper flakes because every hunk of meat deserves some heat and I like what I like.” Serve this with crisped boiled potatoes, thick slices of toast, or rice noodles.Ingredients8–10 servings14–5-lb. piece untrimmed flat-cut beef brisketKosher saltFreshly ground black pepper4Tbsp. vegetable oil, divided1medium onion, cut through root end into 1\"-thick wedges1large fennel bulb, cut through root end into 1\"-thick wedges3celery stalks, cut into 2\" pieces, plus 1 cup leaves1head of garlic, halved crosswise½bunch thyme, oregano, or marjoram¾cup distilled white vinegar¼cup low-sodium soy sauce or Worcestershire sauce2cups mixed tender herbs (such as parsley, mint, and/or cilantro)½lemonCrushed red pepper flakes (optional)Flaky sea saltPreparationStep 1Preheat oven to 300°. Season brisket on all sides with kosher salt (about 1 tsp. Diamond Crystal or ½ tsp. Morton per lb.) and pepper and set on a rimmed baking sheet. Chill, uncovered, at least 12 hours and up to 2 days.Step 2Heat 2 Tbsp. oil in a large heavy pot over medium. Cook brisket, fatty side down, until deeply browned (it might be snug at first, but the meat will shrink as it cooks), 10–12 minutes. Turn and cook until the other side is deeply browned, 8–10 minutes. Turn onto edges and brown (this isn’t necessary, but it will add more flavor). Transfer to a platter.Step 3Pour off fat in pot; discard. Pour remaining 2 Tbsp. oil into pot; set over medium-high heat. Add onion and season with kosher salt and pepper. Cook, stirring occasionally, until softened and beginning to brown and frizzle around the edges, about 3 minutes.Step 4Add fennel, celery, garlic, and thyme and toss to coat; season with kosher salt and pepper. Add vinegar, soy sauce, and 4 cups water. Place brisket in pot, arranging fatty side up; it should be submerged. (Use tongs to work it in there. If anything has to poke out of the liquid, let it be the vegetables.) Bring to a simmer, then cover and slide into the oven. Braise (without peeking) 3 hours. Check brisket; it should be very tender (the tip of a knife should easily pierce meat). If not, braise another 20 minutes or so and check again.Step 5Uncover brisket and increase oven temperature to 425°. Roast until liquid is reduced by three-fourths and top of brisket is crisp and deeply browned (it should be extremely tender), 50–60 minutes. Let cool slightly, then transfer to a cutting board. Slice with a serrated knife or shred with your hands. Skim fat from surface of braising liquid.Step 6Just before meat is done, place tender herbs and celery leaves in a small bowl; squeeze some juice from lemon over and toss to coat.Step 7Arrange meat on a platter. Spoon vegetables and braising liquid in pot around meat and top with herb salad. Sprinkle with red pepper flakes, if desired, and sea salt.Step 8Do Ahead: Brisket can be braised (but not roasted) 1 day ahead. Let cool; cover and chill. Uncover and remove fat from surface. Continue with roasting process before serving.How would you rate Tangy Brisket With Fennel and Herbs?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleHaven’t made this, but found it on a BA list for recommended Passover recipes. Ashkenazi Jews do not eat soy for Passover…. Can anyone recommend a substitute for the Worcestershire or soy sauce that would still build the umami? LaurenBrooklyn, NY3/5/2022Even losing my grip on the brisket, dropping it in the pot, and splashing myself in the face with hot oil wasn't enough to ruin this recipe.  Absolutely delicious!  I am planning on making it again, but with a piece of chuck, since brisket can be so expensive.  I made it as written, but might try splitting the soy/worchestershire 50/50 next time to see if I like it that way.AnonymousRochester NY1/4/2022While delicious, someone anyone needed to proofread this recipe. I found it confusing and had to reread many times especially the first part but that’s a given. My friend who later talked to me also said this without me even bringing it up after trying the recipe for thanksgiving. However, thank you for the recipe Rachel TangNew York, NY11/27/2021This is the best brisket recipe I ever tried. Perfect balance of flavors. I started the recipe the day before in a slow cooker and finished it in the oven before dinner.Aloisia PJefferson ME4/1/2021This is the second brisket I have prepared in the last 30 days and this recipe is superior to the first. I followed the recipe and instructions but cooked ours in a pressure cooker for two hours. Thank you.Bees in the  GardenMidcoast Maine3/28/2021I never really cared about brisket before this recipe. The first time I made it was for Thanksgiving 2020 and obviously was the best Thanksgiving ever. Just made it again for New Year's because I couldn't stop thinking about it---it's flawless! I used unseasoned veg stock both times which probably amped up the flavors, but I bet the water also produced a similar result. Thanks so much for showing me that brisket can be the bomb .  com !Katie FischerBrooklyn, NY1/2/2021wow wow wow AnonymousToronto, Canada12/14/2020The best brisket recipe I’ve ever made. Even the leftovers were amazing and they didn’t last long!\nFollowed the recipe exactly as written. Perfection!ShannonLos Angeles CA11/13/2020Delicious... this may be the best brisket I’ve ever made. The meat is tender and juicy and the flavorful crust created by the hot blast of oven heat at the end is heavenly. Will definitely make this again!AnonymousLos Angeles CA6/20/2020I've made this twice and it was a huge hit both times, got many requests for the recipe. The second time I added a Tbs or two of Gochujang to the braising liquid, which gave it a nice bit of extra kick. I also added a little bit of fish sauce for some extra umami, not sure if that really made a perceptible difference but the result was delicious. I recommend saving some of the braising liquid, I used it to marinate some mushrooms and it was great!burkejohnSan Francisco4/7/2020Huge hit.  Many requests for the recipe and no leftovers.AnonymousDenver12/30/2019Can this be made in an Instant Pot or slow cooker ? We Anonymous12/29/2019Made it for 12/22 evening and evrr e one liked it.  Sort of hard to submerge the whole cut w the size of pot I had and the recommended liquid.  AnonymousBainbridge Island 12/24/2019I'm in the midst of making this recipe. What is a half a bunch of Thyme? You mean a bunch of time that you pick? from the store? Not specific at all. It's braising now and smells delicious. I've never made brisket before and after 71 Chanukahs, I'm finally making one this year. Wish me luck!\nAnonymousVashon Island Washington STATE12/21/2019I made this last week for a small dinner party and am joyously eating the leftovers with my partner. The meat is tender and flavorful and the fennel melts in your mouth. My partner got a bigger brisket than was called for so it did not get completely submerged in the broth (I even added more to the pot but a little still stuck out!) but it did not matter. It was amazing and I will definitely be making this again when we want to eat something rich and comforting in the cold Chicago winters.AnonymousChicago12/9/2019Explore Bon AppétitBrisketBeefMeatFennelVegetableMainDairy-FreeGluten-FreeBraiseRosh HashanahHanukkahPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Alison Roman"]}