{"id": "2a9682792a901122956f33d4ab417276", "url": "https://www.bonappetit.com/story/sour-milk-tips", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "Expired Milk - How to Use It Up Instead of Wasting It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour “Expired” Milk Still Has So Much More to GiveMake the most of your funky friend.By Stephanie Loomis PappasSeptember 17, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIn Basically on a Budget, we’ll talk tips, ingredients, and recipes that’ll help you save money and eat well.Milk doesn’t turn bad at the stroke of midnight, but I still find myself pouring out the last few ounces on the expiration date because our main milk drinker is a six-year-old who does not enjoy any funky flavors with his Frosted Mini-Wheats. During these past few months, however, pouring any milk down the drain has felt extravagantly wasteful, especially if using it could delay the next grocery trip by another day or two.If, as is the case in my family, a gallon is too much but a half gallon is never enough, here are five strategies to help you turn your expired milk into liquid gold.Note: At my house, we always have just a bit too much whole milk, which provides the extra fat that makes some of the following recipes possible. If you’re using skim milk, skip the richer recipes like panna cotta and ricotta.1. Compare it to buttermilk.The first step to using up the expired milk is to reconsider it. Sour implies “spoiled,” but there’s a difference between the faintly tangy milk in your fridge and the clumpy milk in a sippy cup that you found behind the couch. The latter is best sent to the sink while the former is, with a little creativity, drinkable, enjoyable, and prized. (Soured milk, a broad category that includes fermented and cultured milk as well, is a valuable ingredient both made at home and purchased in grocery stores in much of the world.)What’s going on in your milk jug is just fermentation. Think of it like quarantine sourdough without the work. The yeasts in a sourdough starter consume the sugars in the new flour you add each day. Likewise, the bacteria already present in your milk consume the sugars in that milk to produce lactic acid, which creates the familiar “how old is this milk?” smell. The cultured buttermilk you buy at the grocery store is just milk with extra bacteria added to help speed up that same fermentation process.For that matter, neither home-soured nor commercially soured milk is “real” buttermilk. As Sandor Katz explains in The Art of Fermentation, true buttermilk is a by-product of the butter-making process. But if using the term buttermilk is what gets you thinking more creatively about what’s in the bottom of the milk jug, know that your sour milk will perform about the same as store-bought buttermilk. Call yours small-batch artisanal buttermilk and get started on the next four strategies.2. Sweeten it.If your milk is a sniff away from its prime, you have a fine justification for eating the aggressively sugared cereal of your choice—the tang of the milk will be effectively masked by marshmallows. Sour milk also adds complexity to a stovetop porridge with a blend of steel-cut and quick oats, and it works especially well in recipes that already call for buttermilk like crepes, pancakes, and waffles.“Sour milk pancakes” doesn’t have quite the same ring to it.\nAlex LauAs the milk further sours, you can use it in recipes that call for more sugar. Start by turning your kitchen into a tea shop. Bring a cup of milk to a simmer and then add a tablespoon of sugar, whatever strong black tea you have around, and a few whole spices like cloves, cardamom, and cinnamon. Boil for five minutes, then enjoy your chai-inspired beverage hot or iced in your now wonderfully scented kitchen.If panic shopping has left you with too much milk and too much heavy cream, you can combine equal parts of each to make a lighter version of mason jar ice cream. We’ve tried dark chocolate and raspberry, both of which masked any sour flavor and delighted both grown-ups and kids.Or buy a box of gelatin for keeping on hand and you can make weekly panna cotta. While some recipes call for pouring the cooked mixture into ramekins or molds, I’ve been pouring it into Picardie tumblers for easy prep and cleanup. While it’s technically dessert, we can’t be choosy during these trying times, so I’ve been eating my sour milk panna cotta for breakfast along with blueberries and basil.3. Bake it.Sour milk is a great choice for savory baking because it acts as a leavening agent at the same time that it adds a slight tang to the finished product. It’s also an excuse to make my grandmother’s buttery scones, which I’ve been loading up with jam for second breakfasts.To help stretch the time between grocery trips, we’ve challenged ourselves to use the small amounts of neglected grains collecting dust in mason jars. Our sour milk has helped us transform cornmeal into snappy cornbread muffins, with and without salted Fresno peppers.A little sour milk is undetectable.\nPhoto by Chelsie CraigIf you planted an ambitious number of herbs in your panic garden, expired milk can also help hack down overgrown rosemary, basil, and mint, all of which I added to the milk before stirring it into these versatile herb and cheese poppers.My favorite use-up-the-milk recipe is the pretzel knot from Wolfgang Puck’s CUT. Clipped out of Bon Appétit in March 2009 and always at the front of my recipe box, this recipe gives me the chance to virtuously finish the milk and also less virtuously finish the beer left over from the pretzel-poaching liquid.4. Fry it.Expired milk is a great adhesive for a thick layer of breadcrumbs, and breadcrumbs turn any less-than-glorious produce into tasty snacks. Squash, eggplant, and green tomatoes are all great. And why stop at vegetables? Fried rounds of goat cheese go with everything.But the most impressive expired milk recipe I’ve tried to date is my husband’s fridge-and-freezer-clearing meatballs, which used three frozen slices of bread, freezer-burned steak trimmings, sour milk, and a squeeze of anchovy paste I bought two years ago but was previously never brave enough to try. Tossed into a long-simmered jar sauce, the meatballs made for one of the more delicious plates of pasta I’ve had in years and served as a good reminder that many of the dishes we love were created by people looking to stretch their food budgets.5. Ever heard of cheese?If you’ve ever started a recipe only to find you forgot to buy buttermilk, you’ve learned that you can make faux-buttermilk by adding a teaspoon of white vinegar or lemon juice to a cup of milk. So if your milk is already a little sour, why not keep the process going and ferment your milk more? When you’re down to the last two cups of milk and have a lemon and five minutes, you can make a half batch of J. Kenji López-Alt’s microwave ricotta from The Food Lab.All you need now? Crackers.\nPhoto by Chelsea KylePour the milk into a microwave-safe container. (I used my 2-cup Pyrex, which leaves just enough extra space for stirring.) Juice the lemon and stir it into the milk with ¼ tsp. salt. Microwave until bubbling, about 4 minutes, then stir until curds form. Scoop the curds onto a paper towel-lined strainer and wait at least five minutes to start eating, but not so long that your family eats all the ricotta before you get to taste it.The only problem with this recipe is that it yields delicious ricotta and about two cups of lemony, salty whey. The whey works great in place of cooking water for pasta or vegetables, but that seemed to me like yet another, albeit roundabout, way to pour milk down the drain. So I made one more pass through my dusty mason jars to make semolina-whey crackers using this ratio. The crackers paired perfectly with the second batch of ricotta (as I wasn’t fast enough to taste my first one), which means I have two more cups of whey to try in another batch. I’m thinking rye.Stephanie Loomis Pappas writes at snackdinner, where she teaches parents how to research, and at snack lunch, where she teaches parents how to write their kids’ college essays.Explore Bon AppétitBasically on a BudgetMilkRead Morecooking6 Delicious Ways to Bulk Up Instant NoodlesBy Hetty McKinnoncookingThe Secret to My Award-Winning Bread is a $4 Foil Roasting PanBy Emma BarkercookingListen Up, Bakers: You Could Be Saving Lots of Money With DIY Vanilla ExtractBy Courtney SprewerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-17", "author": ["Condé Nast", "Stephanie Loomis Pappas"]}