{"id": "2ac0521cba4ae94e4cfa89a5cacc2ff0", "url": "https://www.bonappetit.com/story/soy-pickled-radishes", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Soy-Pickled Radish from My Shanghai By Betty Liu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTangy, Crunchy Soy-Pickled Radishes Are on Constant Rotation in My KitchenThey're meant to be a premeal “appetite opener”—but that doesn't stop me from snacking on them all day.By Betty LiuMarch 20, 2021FacebookTwitterEmailPhoto by Betty Liu FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My debut cookbook, My Shanghai: Recipes and Stories from a City on the Water, is about homestyle Chinese food from a family from Shanghai—the food of my family. While the cuisine of Shanghai is often labeled as sweet, to do so is to oversimplify the region’s palate. Instead, the cuisine focuses on the vibrance of the ingredients. In my book I highlight the rich abundance of produce found in Shanghai and its surrounding regions, whose land is richly fed by China’s longest river, the Yangtze. Its tributaries crisscross through the region, creating not only picturesque water towns but also fertile land full of vibrant produce.This recipe, soy-pickled radish, is a perfect example of a seemingly simple dish that, thanks to careful, deliberate preparation, is full of flavor. The fermentation draws out the radishes’ sweet notes. This crispy, tangy juicy pickle is meant to 开胃kai wei, which means “open your appetite,” but I find myself sneaking bites throughout the meal, or even as a snack outside of a meal. It’s delightful as part of a pickle spread with breakfast congee—in fact, sometimes I’ll have plain congee with only these soy-pickled radishes. It’s hard to resist touching the daikon for two days, but the resulting pickle is worth it: savory yet sweet, tangy, and crispy.Here's what you do: Choose a daikon radish that is white and firm, without visible holes or discoloration. I look for a firm, small radish, about 2\"  in diameter and 9\" long. You don’t have to peel it, as the skin crisps up beautifully and holds the disks together, but if there are any bruises or “hairs” growing out, you can peel that part off.After washing it, cut off and discard the ends and slice into ¼\" slices. Toss with about 1 tsp. kosher salt and let rest for 30 minutes. Rinse, drain, and toss with 1 tsp. granulated sugar this time, then let rest another half hour. Do this two more times, rinsing and draining between each step, for a total of three cycles of salt and sugar. This process rids the raw daikon of its spicy and bitter taste, leaving behind its deep, floral notes.After rinsing and draining for a final time, squeeze daikon slightly to wring out any excess liquid. Place the slices in a clean, nonreactive container. Next, make a brine of light soy sauce, rice vinegar, black vinegar, and sugar. For 1 daikon, I use approximately ⅓ cup light soy sauce, 2 Tbsp. rice vinegar, 1 Tbsp. black vinegar, and 2 Tbsp. sugar. The ratios can be played with to accommodate your preferences. I like a tangy pickle, but if you want one that is saltier, add more soy sauce or reduce the amount of sugar. Stir together to dissolve sugar, then pour this mixture over the radish and add enough boiled-then-cooled water to the container until the daikon slices are just covered (usually about ½ cup). Let sit in the fridge for at least 2 days. Pickles will keep (and become stronger in flavor) in the fridge for a month.When I was choosing which recipes to include in my book, I deliberately chose recipes that could be made at home, for all levels, and I especially wanted to include the recipes that make a constant rotation in my own kitchen. This is certainly one of them. My Shanghai: Recipes and Stories from a City on the Water by Betty Liu$35 $29 at Amazon$32 at BookshopPartially excerpted from MY SHANGHAI by Betty Liu. Copyright © 2021 by Betty Liu. Published by Harper Design, an imprint of HarperCollins Publishers. Reprinted by permission.Explore Bon AppétitIt's That SimpleChineseSichuanRadishPickleDaikonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-20", "author": ["Condé Nast", "Betty Liu"]}