{"id": "2adeaf97a79ac77c51375f9f81e0013c", "url": "https://www.bonappetit.com/story/things-got-weird", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Basically Letter From the Editor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThings Are Going a Little Haywire in My Kitchen, HBU?The weekly dispatch, featuring measuring piles of roasted veg, measuring spoons, and dreams of rhubarb.By Sarah JampelApril 22, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hi Basically readers,Every week I say it, but this time I mean it: This was the week things got weird. I made the strangest soup (think shrimp, harissa, potatoes, leeks), burnt an entire batch of granola for the first time in years, and didn’t put on jeans even once (I ditched that goal).But I also attended a Zoom bachelorette party, watched my husband play virtual trivia, crossed the Brooklyn Bridge by foot, made banana bread and bread-bread on the same day, listened to hours of the “2000s throwbacks” Spotify playlist, received a contactless delivery of gummy bears and chili oil from a great friend, and discussed the merits of expeller-pressed oils at length with my BA colleagues.Amid all this, I was bopping around the kitchen, and wanted to share a few hopefully helpful thoughts. Here it goes!Want this letter before it hits the website? Sign up for our newsletter!One Good TipUnhitch Your Measuring SpoonsI understand why measuring spoons come tied together—otherwise, you might lose that quarter teaspoon to the depths of your utensil drawer (or maybe it’d get lost in the shipping and selling process?). But I find it’s most convenient when my spoons roam freely. They’re easier to reach for and put to use, and the whole set doesn’t get dirty thanks to one oily interloper.If you’re in the market for a new set, I recommend this one from OXO because the spoons nest together magnetically: No one gets lost but each member has independence.Photo and Food Styling by Sarah Jampel Best Thing I Ate Last WeekRoasted Veg Loves Dressing, TooHonestly, last week I mostly ate matzo in various forms: matzo brei with parm and black pepper, matzo “lasagna” with spinach, lemon, feta, and mozzarella, matzo “pizza” (the key to preventing sog is to melt a layer of cheese on first, then add the sauce). But I also received a delivery of a ton of root vegetables—parsnips, beets, carrots, potatoes—from a local farm.Normally I season my vegetables pre-roasting, with olive oil, ground or crushed spices, and salt, but considering I’ve got so many to get through, I’ve started dressing them after, in addition. Roasted veg can be dressed just like salad greens, taking kindly to vinaigrettes and creamy dressings. I made a nuoc cham dressing for my carrots, then used the leftovers to dress roasted sweet potatoes and cauliflower later in the week, too.Moment of AppreciationMy Favorite (Free!) AppIf you already know about the “Measure” app on iPhones, do you love it? If you don’t already know about it, are you prepared to have your mind blown? All you have to do is open the app and wave your phone up and down like a weirdo for a few seconds, and then you can measure ANYTHING. That’s right: You’ll never have to wonder how big your loaf pan is (and why on earth it isn’t labeled!). In a moment of real boredom, I even measured my two cats from nose to tail to compare the two (one is a half foot longer).Photo and Food styling by Sarah Jampel This Week I’m Going To...Try to track down rhubarb, my most beloved fruit* besides quinceProbably (and sadly) finish all four seasons of Please Like Me, an Australian TV show that aired from 2013 to 2016; it makes me cringe as much as it makes me laugh—I’ve zipped through it and I’ll be sad to finishDo some piñata research (I’ve got big plans for a future b-day celebration for a friend); any advice welcome!Turn the chipotles in adobo hanging out in the fridge into a spicy dipMake at least one hot breakfast, probably using my sourdough discardSend a couple of get well cards in the mailSee you here next week!*Technically a member of the buckwheat family, rhubarb was declared a fruit in 1947 by the U.S. Customs Court to reflect its culinary use. Tell THAT to the next person you chat with.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-22", "author": ["Condé Nast", "Sarah Jampel"]}