{"id": "2afe08e58a3ebdb1a44f3569e931a528", "url": "https://www.bonappetit.com/story/2018-super-bowl-menu-chili", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Your 2018 Super Bowl Menu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenYour 2018 Super Bowl Menu: Chili, Cornbread, and Hot Honey ButterAnd for dessert? Super fudgy brownies.By Alex DelanyJanuary 11, 2018FacebookTwitterEmailPhoto by Bobbi LinFacebookTwitterEmailOn the Super Bowl menu this year: Beef Chili, Skillet Cornbread, Hot Honey Butter, and Fudgy Brownies.There are a few things I'll leave my seat for when the Super Bowl is on—this is an evening when couch space is guarded with one's life. But a bowl of chili is one of them. Not just any chili, though. I'm talking about a monumental pot of deeply flavorful, perfectly spiced beef chili. In Claire Saffitz's new recipe (below), using intact dried chiles instead of jarred powders contributes a more complex flavor and saturated color. And you're drinking already, so why not pour some beer into the pot? Lager imparts just the right amount of bitterness, rounding out the chilis. Then pile on as many chili toppings as you can handle: everything from Fritos to chopped red onion to sour cream to avocado.While you're up, grab a piece of skillet cornbread with a healthy serving of hot honey butter, and snag another beer before the commercial break's over. The game might be on TV, but as real Super Bowl party champions can attest, athletics matter in the trip to and from the kitchen, too. Make a victory lap for those extra fudgy brownies.You can pull this Super Bowl menu off no problem if you think ahead. Make the chili up to four days before. Let it cool, and then refrigerate. The morning of the game, assemble and bake the cornbread, and mix the hot honey butter (it's only three ingredients!). An hour before kickoff, it's time to reheat the chili and prep all the fixings. Put them all in bowls for your chili assembly line. This is how you get it done, team.Get the recipes:Beef ChiliMake a big pot of this rich, meaty chili, a side of cornbread, and then never leave the couch.View RecipeClassic Skillet CornbreadWe follow the three tenets of traditional Southern cornbread: No sugar added, no flour, and baked in a cast-iron skillet.View RecipeHot Honey ButterThis hot honey butter is only 3 ingredients—and heaven on cornbread.View RecipeFudgy BrowniesThese are super chocolaty, dense brownies, just begging for a scoop of ice cream on top.View RecipeHead right this way for even more Super Bowl recipe ideas.Need an appetizer? Make Bob Armstrong, a queso masterpiece:Explore Bon AppétitSuper BowlChiliPartyRead MorecookingA Homemade Cheesesteak Is a Thing of BeautyBy Chris Morocco and Brad LeonerecipesThe BA Super Bowl Headquartersrecipes63 Super Bowl Dip Recipes for Game-Day Winners and Half-Time ViewersGallery63 SlidesBy Joe SevierRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Alex Delany", "Brad Leone"]}