{"id": "2b02eae99e54fbe8deb1397cbf3f7d23", "url": "https://www.bonappetit.com/story/the-queer-gym", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "The Queer Gym Founder Nathalie Huerta on LGBTQ-friendly Spaces and What She Learned From Ayahuasca | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNathalie Huerta on Founding The Queer Gym and What Ayahuasca Taught HerThe owner of Oakland's queer-friendly gym believes that boring means consistency, and consistency means success.By Melissa Pandika October 10, 2018FacebookTwitterEmailFacebookTwitterEmailIn our new series Person of Interest, we talk to notable people about what they're into right now. Up first, Nathalie Huerta, owner The Queer Gym, an LGBTQ-friendly gym in Oakland, CA.Growing up playing basketball, Nathalie Huerta felt at home training in gyms. But that all changed when she was 19, after she came out as a lesbian and began presenting as more masculine. Other gym-goers often stared at her; some women even hid from her in the locker room. “The gym went from a place where I felt comfortable to a place I wanted to avoid,” she says.Huerta’s experience inspired her to open the Queer Gym in Oakland in 2010. By making LGBTQ community members feel included, the Queer Gym aims to give them equal access to health and wellness. Here, classes open with students sharing their pronouns, trainers customize workouts for clients undergoing gender confirmation surgery—and due to the prevalence of body image issues in the trans community in particular, there are zero mirrors.We recently caught up with Huerta in her office at the Queer Gym to talk about why she likes boring routines, her love for Drake, and how ayahuasca helped her embrace her feminine energy.My morning routine starts with… Waking up at 6:30, checking my calendar on my phone, and taking a quick shower. My wife might make breakfast; we normally have eggs, spinach, sausage and coffee. Then I drive to the gym to work out. I’ll park and do a 10-minute meditation on the Headspace app. If I don’t do all of that right away, the rest of the world takes over my day. I find myself repeating, “Boring is where it’s at.” I like to have my boring morning routine. Boring means consistency, and consistency means success. The more complex you make your daily life, the harder it is to get things done.The workout I’m crushing right now is... Full body barbell work at the gym three times a week, and running or going on a hike two days a week. My favorite workout is basketball, though. I play in pickup groups twice a week. There’s not one thing in life I can’t relate back to a lesson I learned in basketball: playing well with others, being coachable, being uncomfortable and growing, being humble when you win.My go-to workout playlist is… The“This is Drake” Spotify playlist. I’ve always loved Drake. He’s tough enough not to be fucked with, but soft enough that you want to take him home to meet Mom. “Marvin’s Room” got me through some shit. That’s my favorite Drake song.The movie I can’t stop watching is…Limitless. Even if that pill doesn’t exist, what if we tried even a little to tap into that potential? That’s one of the reasons I became a trainer—I get to help people do that. At the Queer Gym, we offer a six-week challenge. When we check in with clients on the third week, we see a huge difference from when they started. They walk in here like they’re the shit, like, “This ain’t nothing. I’m just going to keep going.” It’s about giving them their swag back.The wellness practice I’ve been digging lately is… Ayahuasca. My best friend got me into it. We drove to Ojai in southern California and did it with 40 or 50 people. That was life-changing. It helped me realize that I was getting pushback on things I wanted to accomplish because I was trying to lead with masculine energy. In my ayahuasca experience, I saw my mom and grandmothers. I saw that even though my dad and grandfathers were “men’s men” out in the world, they were all about the wife and kids at home. It was really the women who were leaders in my family. The ayahuasca told me, “You’re in with the guys. That’s your tool to show men how to be better leaders. But if you want to make a change, you need to be a little softer, a little more mindful of people’s hearts.” Ayahuasca is like Mother Earth slapping you in the face, pointing out the areas you need to fix. I’m planning on doing it again, probably by the end of the year, but I need to sit with it for a while.Explore Bon AppétitPerson of InterestHealthyishOaklandCaliforniaprofileRead MorecultureHospitality Activist Ashtin Berry Enjoys Caviar Potato Chips, Radical Self-Awareness, and a Good Twerk SessionBy Shanika HillocksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Melissa Pandika"]}