{"id": "2b1696a5c559764ffb103965c39e6e8e", "url": "https://www.bonappetit.com/story/edible-steaming-rack", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "For More Flavor and Less Gear, Make Your Steaming Rack Edible | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor More Flavor and Less Gear, Make Your Steaming Rack EdibleNo special equipment required.By Antara SinhaFebruary 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Stying by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailI’ve always considered steaming—especially larger, more unwieldy pieces of fish or vegetables—a finicky process, with metal steaming baskets that clang around in boiling water and inevitably burn me. And that’s why Jessie YuChen’s Special Steamed Whole Fish was a revelation. By nestling a whole fish atop a bed of onions, ginger, and scallions instead of on a steaming rack, YuChen avoids calling for any special equipment. Plus, YuChen puts to rest, once and for all, the false assumption that steamed food is drab, bland, or boring. As the fish cooks, the aromatics at the bottom of the pot perfume its flesh and the juices from the fish seep back into the aromatics, creating a built-in brothy, tender vegetable side. It’s a delicious give-and-take.The good news is you can use this technique with almost any veg or protein you have in your fridge. Here are YuChen’s tips on how to do it successfully.Get creative with your protein.A whole fish, like in YuChen’s recipe, makes for a stunning presentation, but it’s not the only option. Blocks of firm, marinated tofu, whole prawns, lobster, crab, and pork or seafood meatballs are all delicious here—just be careful about steaming more than one type of protein at once, as they’re likely to have different cook times. As a general rule of thumb, you’ll want to stay away from proteins that typically need a good sear to taste their best. Red meat and poultry may not be at their best in this application.Pick a sturdy veggie base.“Look for veggies with structure,” YuChen says. This isn’t the time to reach for the greens in your crisper drawer that’ll wilt at the first kiss of heat (hello, baby spinach and watery lettuce). Instead, you’ll want hardier vegetables, like winter squash, roots like daikon radish, oyster mushrooms, the whites of scallions, broccoli or cauliflower, or a bed of greens that you’re okay with going tender (kale, bok choy, cabbage). “It will work for any vegetable with a steaming time of around 8 minutes,” YuChen advises.You’ll want to cut your vegetables evenly to ensure uniform cooking time and to offer a level surface for your protein to rest on. Make sure your vegetable base elevates your protein at least a couple of centimeters above the bottom of the pan—otherwise, you’ll be braising rather than steaming.It’s all about the aromatics.This is the fun part. Add a wide variety of aromatics to your vegetable base (the ratio of aromatics to vegetables is up to you and what you have available), as they make up the bulk of the flavor your protein will soak up during the steaming process. Fresh ginger, scallion greens, garlic, Thai basil, onions, lemongrass, fennel bulb, leeks, celery, shallots, or even slices of bright citrus (great as a bed for firm, white fish) are all game. While you may want to pick out tougher, more fibrous aromatics like ginger and lemongrass before eating, most will cook down to a saucy consistency to be enjoyed over your protein when serving. “You can really customize it with what you have on-hand,” says YuChen, making this a technique you can add to your arsenal of one-pot weeknight cooking—no unwieldy steaming equipment required.Getting steamyJessie’s Special Steamed Whole FishA showstopping whole fish is a Lunar New Year staple. Assistant food editor Jessie YuChen’s version is straightforward yet stunning, doesn’t require any special equipment, and did we mention it’s absolutely delicious?View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Antara Sinha"]}