{"id": "2b1d4164ffe55b3502d34b0c39029c17", "url": "https://www.bonappetit.com/story/india-is-in-crisis-covid", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "The Food Businesses Helping with India's Covid Crisis | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusIndia Is in CrisisHow you can help during the current COVID-19 outbreak, according to food businesses.By Sonia Chopra and Rachel GurjarApril 29, 2021FacebookTwitterEmailPhoto by Bryan FountainFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.In India, where just about 2% of the population is fully vaccinated, the COVID-19 crisis is getting worse by the day. Hospitals are running out of oxygen. People are going hungry in isolation. The news is so staggering that I can barely look at my phone without crying. Of course I have a personal connection to India, but beyond that, the country has lent so much to the culinary landscape in the U.S. and around the world. So it’s been heartening to see chefs, business owners, and other industry leaders here raising awareness and funds for India now. BA associate food editor Rachel Gurjar and I collected this list of organizations, resources, and individuals who are doing that work. We encourage you to read more about the catastrophe and, if you feel so moved, to consider donating to efforts.Divia Thani, the global editorial director for Condé Nast Traveller, and her staff in India published a list of verified organizations that people outside of India can donate to, including Mission Oxygen; CNT culinary editor Smitha Menon also wrote about the Indian food businesses who are helping with COVID-19 relief. Sana Javeri Kadri, the CEO and founder of spice company Diaspora Co., has been working tirelessly to educate folks on what’s going on across India, starting with this list of vetted organizations, including hunger relief charities Khaana Chahiye and Mazdoor Kitchen—and if you donate $50 or more, you’ll get a free Diaspora tote. And chefs like Thomas Zacharias are supporting a range of fundraising campaigns through the platform Mutual Aid India.Instagram contentThis content can also be viewed on the site it originates from.Below, hear from others in the food world who live in or have business ties to India on how they are helping.“We are donating 15% of online sales at Brooklyn Delhi this week to GiveIndia’s effort to feed families struggling with hunger during the 2nd COVID wave. As a parent with two small children, I was most drawn to this mission. We put together a Stories Highlight on our Instagram with more resources and ways to donate.” —Chitra Agrawal, founder, Brooklyn Delhi“Feeding from Far and Enrich Lives Foundation are two charities I support. Both of them are Mumbai-based and provide meals to the people in the most starved pockets of the city, who need ration kits as they get severely impacted with lockdowns—if COVID-19 doesn’t kill them, hunger will. Both charities are verified, and they are able to help the section of the society that desperately needs it.” —Saransh Goila, founder, Covid Meals for India and cofounder, Goila Butter Chicken“We will donate $1 from every FC Masala jar [from the Floyd Cardoz x Burlap & Barrel collection] sold in April and May to Feeding India and Mission Oxygen. India is a part of my soul. I am walking my journey from March 2020 alongside all who are losing loved ones to this horrible virus. I know how our lives turned upside down in an instant from losing [my husband Floyd Cardoz] and I will do whatever we can collectively to save someone and their families from this relentless ache.” —Barkha Cardoz, managing member, Floyd Cardoz Legacy, LLC.“Our brand wouldn’t exist without the generosity and knowledge of our textile partners in India. In the world we hope to live in, resources aren’t just a one-way street. We shouldn’t benefit from the labor or culture of a place without recognizing the humans connected to it. If we’ve learned anything in the last year, it’s that we aren’t helpless. We are splitting donations [from 10% of sales this week] between GiveIndia and the Hemkunt Foundation.” —Nisha Mirani, founder, Sunday/Monday“We are choosing to support GiveIndia. Malai is deeply rooted in celebrating the rich and vibrant culture of India, and we are moved to do our part to help during this horrific time. Many of our vendors (spice companies and merchandise vendors) are based in India, and I want to be able to support them in any way I can via sales in our Brooklyn scoop shop [10% of sales will be donated].” —Pooja Bavishi, founder and CEO, MalaiExplore Bon AppétitLetter From The EditorCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-29", "author": ["Condé Nast", "Sonia Chopra", "Rachel Gurjar"]}