{"id": "2b27e277bf6c076740c056309378289e", "url": "https://www.bonappetit.com/story/riot-ribs-pdx", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "No Matter How Many Meals Riot Ribs Serves, They Are Still Going to Attack Us | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNo Matter How Many Meals We Serve, They’re Still Going to Attack UsAn organizer behind Portland, Oregon’s Riot Ribs on finding their volunteer-run, mutual-aid kitchen at the center of the city’s Black Lives Matter protests. By As Told To Tuck WoodstockJuly 29, 2020FacebookTwitterEmailAll of Riot Ribs's grills were donated or purchased with donations.Photo by Celeste NocheFacebookTwitterEmailFor nearly two months, hundreds of Portlanders have gathered nightly outside the Portland Police Bureau’s central precinct to demand justice for Black victims of police violence. In early July, President Trump sent federal agents to Portland to “quell” the demonstrations, inspiring thousands of additional residents to take to the streets in protest. Across from the nightly skirmishes sat Riot Ribs, a 24-hour, volunteer-run outdoor kitchen fueled entirely by community donations. After less than two weeks providing non-stop free food to protesters and passerby alike, Riot Ribs became the focus of targeted, destructive raids by the police. Their story evolved from a small mutual-aid project borne out of necessity into a testament to sheer will, withstanding tear gas, park sweeps, and crowd-control munitions. Then, just as quickly as it grew, Riot Ribs collapsed. On July 28, the group announced it was pivoting the project to Revolution Ribs, trading their home in Lownsdale Square for a pair of sprinter vans to rove the country in search of hungry protesters to feed. Here, one of the organizers behind the project (who asked to remain anonymous for their safety) explains in their own words what went down.We never really imagined that it would get this big. We didn’t ever want to be the center of Portland protests, or the glue holding them together. We were just there to feed people. But we knew we were getting too big.Riot Ribs started out as one grill on July 4th, manned by an original Black Panther named Lorenzo. That night, police tear gassed him while he barbecued. Everyone saw what was happening, and donations started showing up the next day. We all pitched in and found a role that we were comfortable with. Most of the volunteers are houseless and live out here in the park.In the beginning, four or five of us would try to find a car that we could use for that night’s meat run, but eventually, it just came to us. Salads, mac and cheese, pork butt, burgers, hot dogs, lamb, cheesecake, ice cream...the other day, we got 11 grill donations. We were a thousand coolers in. We were serving more people than we ever imagined. Like, thousands a day. We never accepted payment for food. We were 24/7. And our ribs are damn good.A Riot Ribs plate, with grilled ribs, corn, and fresh watermelon.\nPhoto by Celeste NocheBut the government doesn’t like mutual aid. It goes against Western ideals—capitalism, individualism—to the fullest. We’re the opposite of the extreme violence imposed on us by the Portland Police Bureau, the park rangers, and the federal government: Two weeks ago, we had people offering haircuts. We had people out here with laptops filing for unemployment on hotspots, finding a way to talk to their family. We did anything we could when we had the resources. No matter what we do, no matter how much we do for the community, they’re still going to attack us, and they’re still going to tear gas us, and they’re still going to raid us.We were raided at 4 o’clock in the morning, once. Park rangers showed up with the police and took all of our stuff, kicked everyone out—that was kind of shocking. They told us we had to get our stuff on the east side of town, so we got a U-haul. Once we’d loaded it up, the cops slashed the tires and towed it. Also shocking.Officers intentionally came to Riot Ribs with tear gas and pepper spray. Pepper spray we could deal with, because it’s just capsaicin, but tear gas lays a powder on all of our stuff. It doesn’t just affect the people who are throwing water bottles over the fence; it also affects the people who live in this park, and community members who just want to use the park facilities. It has a lasting effect—it’s not just temporary crowd control. Any time we opened a new box of chips, it’s all over.A night at Riot Ribs.\nPhoto by Celeste NocheWe came here to feed people, and we felt like we set up a good system. As long as the state keeps inflicting violence on people, especially people who are just trying to eat, we were planning to be out here cooking. But there was a lot of greed and selfishness that came with it. People who volunteered weren’t in it for the right reasons—they were grilling, but they were also stealing money from the tip jar. We had no authority to kick anybody out. We decided to halt operations in Lownsdale Square for fear of our safety.So our group created Revolution Ribs. We bought two used sprinter vans, filled up their tanks, and got them grills and coolers. We have four people sleeping and cooking in each van—they have the ability to mobilize and help out other communities, so they picked up and left. They’re already in the Bay Area, and they’ll eventually head east.We’re going to continue feeding the house-less community and supporting the Black Lives Matter protesters, anywhere we can, no matter what, as long as we’re able. It was never about becoming big. It was never about the feds. It was always just about feeding people. We want to make sure that mission doesn’t get lost.Explore Bon AppétitFirst PersonPortlandRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-29", "author": ["Condé Nast", "As Told To Tuck Woodstock"]}