{"id": "2b2700363a60faefba858c4bfebade45", "url": "https://www.bonappetit.com/recipe/mojito", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Mojito Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2016 IssueMojitoBy Chris MoroccoPhotography by Ted CavanaughMarch 23, 20224.3(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellEmailPinterestPrintEmailPinterestPrintOn a sweltering summer evening, nothing hits quite like a mojito with its blast of fresh mint and fizzy finish. Like many classic cocktails, it has a storied (if murky, in this case) history. Some say it descends from a similar drink called “El Draque.” Others argue that this rum cocktail started among Cuba’s rural farm workers, and from there traveled to Havana’s bars where American tourists first tried it. Among those tipplers was famously (or allegedly, depending upon who you ask) Ernest Hemingway.There’s no official word on whether Hemingway actually drank mojitos and if he did, which recipe he liked, but this one keeps things classic. Muddling, or gently bruising two mint sprigs in the simple syrup before shaking helps release the herb’s oils, which gives the drink its refreshing factor. Crush the leaves gently (press down, twist, repeat x 4) just until the smell of mint wafts up from the shaker. Too much muddling can turn a drink bitter. Don’t worry if the mint leaves tear apart in this process, they will be strained out. Serving the drink with large ice cubes helps keep it cold and strong on the hottest of days. For the garnish, smack a fresh sprig of mint between your palms to help release its aroma before adding it to the tall Collins glass.Editor’s note: This recipe was originally published in April 2016.IngredientsMakes 1 serving¾ounce simple syrup2sprigs mint, plus more for serving2ounces white rum¾ounce fresh lime juiceClub soda (for serving)PreparationStep 1Muddle simple syrup and 2 mint sprigs in a cocktail shaker. Add rum and lime juice. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds.Step 2Strain cocktail through a Hawthorne strainer or a slotted spoon into a tall Collins glass filled with ice. Top off with club soda; garnish with more mint.How would you rate Mojito?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleYes!  This is perfect.  Mojita made with another liquor is also really good especially when replacing clear rum with vodka.  Tequila has also made an excellent substitute in place of rum as it delivers that edge of the flavor as rum yet it has it’s own unique taste.  Thanks.North Carolina 7/12/2020Explore Bon AppétitCocktailDrinks AllMojitoMintHerbs & SpicesLimeCitrusFruitQuickEasyDrinksCubanCaribbeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-04-19", "author": ["Condé Nast", "Chris Morocco", "Ted Cavanaugh"]}