{"id": "2b386de9fa11249e91e51865cc9c5f42", "url": "https://www.bonappetit.com/story/breakfast-blondies", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Your Breakfast Meal Prep Strategy Should Involve Gluten Free Blondies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleRejoice! Breakfast Blondies Are Here to Make Your Mornings BetterBetween these blondies and Daylight Saving, your mornings are getting brighter.By Anna StockwellMarch 12, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailEating a proper breakfast on weekdays just doesn’t happen for most people, including me. I am perpetually late, usually groggy, and often cranky, but I also demand coffee and sustenance as soon as I finally stop hitting snooze and get out of bed. That’s why a little breakfast meal prep can save my day. In a perfect world I would always have a batch of these low-sugar, high-protein-and-fiber, gluten-free Breakfast Blondies on hand to eat while simultaneously getting dressed, grooming my eyebrows, and applying Living Luminizer to my face. In real life, I do breakfast meal prep maybe once a month. But when it happens, everything is better in my world.Remaking desserts so they’re suitable for breakfast is one of our favorite pastimes (see: breakfast cookies). A breakfast blondie was a natural next step, but it was harder than I expected. It took me three failed attempts at making classic blondies with gluten-free flours instead of wheat to realize that this was not the right direction—not enough real sustenance in there to count as breakfast, and they required too much sugar to make it work. Two more failures involving a mix of almond butter and oat flour. Then I realized that almond butter can actually take the place of flour. Have you ever had flourless peanut butter cookies? It works, trust me! I kept some flax meal in there, because ground flax seeds are good for us all, especially in the morning. And I began each batch by browning butter and toasting nuts at the same time, a trick I am especially fond of for improving the flavor of both the nuts and the butter. (These breakfast blondies work with any variety of nut, or a mix, but I especially like walnuts since it feels like a classic blondie move.)I played with using either maple syrup or coconut sugar, because of course there should be no refined sugar in my breakfast, please. Maple syrup tasted the best, so all that was left was to figure out the eggs. Turns out that three eggs whisked (not stirred!) vigorously into the batter was the secret to a shiny crackly top and a moist center.A total of 10 batches of blondies later, I landed where I wanted to be. I fed one to my coworker Emily who thought it was a normal blondie and looked a little confused after a few bites.“This is really good, Anna, and I like it, but did you know this blondie tastes kind of like a healthy muffin?” She was worried that I had done something wrong.“No, no Emily, this is a breakfast blondie,” I explained.“Ooooooh. Well then, it’s perfect.” And I have to admit that I agree.It's the most important meal of the dayBreakfast BlondiesForget breakfast bars or muffins: Our new favorite grab-and-go breakfast is a blondie.View RecipeExplore Bon AppétitHealthyishGluten FreeBreakfastBakeAlmondRead MoreLifestyleThese Muesli Muffins Are Peak Fall...And They Happen to Be Gluten FreeBy Anna StockwellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Anna Stockwell"]}