{"id": "2b5a69d510462f4677a0ac196eb93f8d", "url": "https://www.bonappetit.com/recipe/almond-butter-and-jam-quick-bread", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Almond Butter and Jam Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAlmond Butter and Jam Quick BreadBy Sarah JampelNovember 5, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWith hearty rye flour, pockets of fig jam, and plenty of protein-rich almond butter, this not-too-sweet quick bread is like your favorite piece of toast in cake form. Seek out smooth fig jam without chunks of fruit for easy swirling.IngredientsMakes one 9x5\" loafUnsalted butter (for pan)1cup (120 g) all-purpose flour¾cup (77 g) rye flour1½tsp. baking powder1tsp. ground cinnamon1¼tsp. kosher salt, plus more4large eggs½cup extra-virgin olive oil1tsp. vanilla extract½cup almond butter¾cup (150 g) (packed) light brown sugar¾cup buttermilk (or scant ¾ cup milk or oat milk plus 1 Tbsp. apple cider vinegar)½cup smooth fig jam, divided⅓cup sliced almonds2tsp. raw sugarPreparationStep 1Preheat oven to 350°. Butter a 9x5x3\" loaf pan. Line pan with parchment, then butter parchment.Step 2Whisk all-purpose flour, rye flour, baking powder, cinnamon, and 1¼ tsp. salt in a medium bowl.Step 3Whisk egg yolks, oil, and vanilla in a large bowl. Add almond butter and whisk until smooth. Add brown sugar and buttermilk and whisk until smooth. Sift dry ingredients into egg yolk mixture, then fold gently to combine.Step 4Whisk egg whites in another medium bowl until frothy, about 2 minutes. Fold into batter until incorporated.Step 5Pour half of batter into pan. Dollop half of jam over. Using a small offset spatula or butter knife, swirl into batter. Pour in remaining batter. Dollop remaining jam over and swirl again.Step 6Mix almonds, raw sugar, and a pinch of salt in a small bowl. Sprinkle evenly over batter.Step 7Bake bread until risen, almonds are toasted, and a tester inserted into the center comes out clean, 50–60 minutes. Transfer pan to a wire rack and let cool 5 minutes, then remove loaf from pan and let cool completely, at least 1 hour.Step 8Do Ahead: Bread can be made 4 days ahead. Wrap tightly in plastic and store at room temperature.How would you rate Almond Butter and Jam Quick Bread?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI love this recipe! Just made it today and it's the perfect balance of salty and sweet and savory. I wanted something that was really nutty and not too sweet so I only added a half cup of sugar and upped the almond butter a bit and it turned out great! Have been snacking on it ever since.Anonymous12/8/2019Explore Bon AppétitBreadAlmondNutFigFruitRye FlourFlourButtermilkOther IngredientsSnackHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Sarah Jampel"]}