{"id": "2b63e520dacc79002c51c7d9742229b2", "url": "https://www.bonappetit.com/story/minimalist-chili-crisp", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "For Chili Crisp That's All About the Crisp, Hold Back on the Oil and Double Down on the Soybeans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Minimalist Chili Crisp Is All About the CrispThe crunchier the chili crisp, the closer to heaven.By Karen YuanFebruary 1, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes and drinks we make with our eyes closed. Today, chili crisp.Some people made sourdough in quarantine, but I made chili crisp. When my cravings and loneliness were at their highest, I looked inside my pantry and dreamed of crunch. I had only a few chili crisp ingredients, but I determinedly cobbled something together—and I was surprised by how good it tasted. Now I always turn to that handful of ingredients when I make the condiment.Chili crisp can feature so many ingredients—like crispy fried garlic, fennel seeds, scallions, and star anise—that add all sorts of flavors. But I’ve stripped down the crisp to its spicy, crunchy essentials. For me that’s dried red chiles, roasted and salted soybeans or peanuts, and dried onion or shallot. With those three ingredients—plus vegetable oil, salt, and sugar—I get a crisp that’s hot, salty, sweet, and, thanks to the soybeans or peanuts, full of texture. When I’m in the mood, I like to add Sichuan peppercorns, sesame seeds, and sesame oil so the crisp is extra fragrant—but those are optional not elemental.When it comes to the crisp-to-oil ratio, I like much, much more crisp than oil. The key to a chili crisp that’s so crunchy it’s like a spicy trail mix? A huge number of soybeans. When I thought about why I enjoy this chili crisp so much, I realized that it’s like a little baby version of Lao Gan Ma’s Chili Oil With Fermented Soybeans, which has a much longer ingredient list.Here’s how to make my chili crisp: Pulverize ½ cup dried red chiles into little flakes in a food processor or spice grinder. (I use Chinese chiles, but it’s probably okay if you use other types. If you don’t have whole chiles, substitute about ⅓ cup crushed red pepper flakes.) Smash  ¼–⅓ cup roasted and salted soybeans (more soybeans = more crunch) into randomly-sized pieces with the flat of a knife or a rolling pin. It’s okay—even good—if some remain whole while others are closer to the size of rice grains. If you don’t have soybeans on hand, you can use roasted and salted peanuts; the crisp will crunch just as good.Then, heat ¾ cup vegetable oil—I like soybean or peanut oil—in a saucepan over medium-high. Once the oil is hot, reduce heat to medium, add ½ cup minced dried onion or shallot and 2 tsp. salt, and cook, stirring frequently, until the alliums are brown, about 3–5 minutes. Add the chile flakes, soybeans or peanuts, and 1 tsp. sugar. Add 1 tsp. Sichuan peppercorns, if you crave that tingling sensation. Cook for about a minute to release the spicy flavors. If you want to amp up the heat, simmer for about 3–5 minutes more, until the oil looks redder and redder. Add a splash of sesame oil for extra fragrance. Turn off the heat and stir in 2 tsp. sesame seeds, if you’re using them.After everything cools down, transfer the chili crisp to a sealed container and stick it in the fridge. Pour it over everything you eat (maybe even things you don’t eat?). It’s great for congee, tofu, or soups—all of which highlight its glorious texture—but you can also smother noodles and dumplings, roast chicken (my personal favorite), green salads, eggs, and maybe even sourdough—if you’re still making it, that is.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-01", "author": ["Condé Nast", "Karen Yuan"]}