{"id": "2b6d9ac294f9e08f3974be4355bdaa93", "url": "https://www.bonappetit.com/story/lemoniest-lemonade-recipe", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "The Lemoniest Lemonade Recipe Tastes Like Liquid Sunshine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Lemoniest Lemonade Recipe Tastes Like Liquid SunshineIt takes one extra step and a few—okay, more than a few—extra hours, but it is WORTH IT.By Amiel StanekJuly 18, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailBasically editor Amiel Stanek spends all day every day trying to help readers get dinner on the table as quick and efficiently as possible. So when he gets to cook at home, he likes to slow things down and be a little...extra. Welcome to Not So Fast, a monthly column about what he’s cooking.You know that meme that features two stacked images of Drake from his 2015 “Hotline Bling” video? In the top image, his right hand is open and extended across his body, while his face is strained down and to the left—a clear expression of “NAH”. (This is where memers add an image of something they detest.) In the bottom image, he’s facing the camera, smiling head tilted back slightly, with his left hand pointing casually and approvingly to the space beside him (insert image of something you love), the gesture of “Now THAT’S what I’m TALKING about!” It’s a format that explores personal and cultural dichotomies, used by thousands upon thousands of memers to express the polarities of distaste and delight between, say, off-brand mayo and Hellmann’s, or Hillary Clinton and Bernie Sanders, or Uber and Lyft. And every time I see it, I think about lemonade.Fill in your feelings.\nWhy lemonade? Well, let’s just say that I have feelings about the way that most people make lemonade. If I knew how to use Photoshop, the top image in the Drake meme above, the“nay” would be a big ol’ pile of squeezed lemon halves, each one an empty shell of sunny yellow skin. The bottom image—the “yay”—would be the exact same big ol’ pile of squeezed lemon halves, except that the citruses (citri?) would be shock-white, peeled or zested so that only the pith remained. Why? Because lemons are a gift in two parts: the juice and the peel. And when people squeeze lemons to make lemonade without first figuring out some fun way to use all of that peel, well, I get Sad.Lemon juice is a wonderful thing, sure. Sunny and toe-curlingly tart, it has all the appeal of an excitable puppy—it’s right there, jumping up and down, impossible to miss and easy to love. But lemon peel is a different story. The peel (or zest) is full of the essential oils of the lemon, which offer thrills all their own. Rich and complex, they have all of the bright, brilliant flavor of the citrus with none of the acidity—sultry, mysterious, almost feline. When combined, the juice and peel are a powerhouse, the truest and fullest expression of the fruit. And if you’re unconvinced, I promise that this lemonade recipe will change your mind.First, you make an extremely hipstery-sounding thing called an oleo-saccharum, a super-citrusy sugar syrup I first wrote about in a 2015 issue of Bon Appétit. Bartenders love the stuff because it allows them to incorporate sweetness and bright complexity into cocktails at the same damn time, and while it sounds like a part of an incantation the witches from Macbeth might whisper over a bubbling cauldron, it’s dumb-easy to make. You just take a vegetable peeler and remove all of the peel from 6 large lemons in wide strips, place them in a large bowl, throw in 1 cup of sugar and massage the mixture with your (clean!) hands for a minute or two. Cover the bowl and let it sit out at room temp for at least 3 hours and up to a whole day; the flavors will intensify over time, so I like to give it the full 24 if I can. That’s it! As the mixture sits, the sugar will draw out all of the hyper-fragrant essential oils from the lemon peels, leaving you with a sludgy, lemonier-than-lemony syrup. Give it a taste why dontcha. LIQUID. SUNSHINE. That meme I was talking about makes a lot more sense now, doesn’t it?Oleo-saccharum! That’s the stuff!\nTed CavanaughNow that you’ve got your oleo-saccharum, it’s lemonade time! (FWIW, this recipe is based on BA’s Best Lemonade, but a double batch, and with the oleo-saccharum standing in for the simple syrup.) Cut those weird, white, naked-looking lemons in half, squeeze them by whatever means you like best, and get any seeds out of there—you should end up with about 1½ cups of lemon juice. Pour 6 cups of water into the bowl with your oleo-saccharum, stir it around a bit to dissolve any still-crystalline sugar left at the bottom, and pour it all through a fine mesh strainer into a large pitcher or jar. (Now you can throw out those completely spent lemon peels; they’ve done everything they could.) Add that lemon juice, give it all a good stir, and pour yourself a sip. Is that not the lemoniest lemonade that ever did lemonade? Is it not like getting dog-licked by a big goofy sunglass-wearing cartoon sun??I know, right? And before you ask: Why, yes, it does taste delicious with a shot of gin or tequila in it!So now, the next time you find yourself in a situation where you have lemons to juice, you’ll aways remember: peel first, squeeze later, and waste not a brilliant drop of lemon flavor. You don’t want Drake to show you the hand, do you?Another way to utilize lemon peels:Explore Bon AppétitNot So FastLemon ZestLemon PeelLemonLemonadeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-18", "author": ["Condé Nast", "Amiel Stanek"]}