{"id": "2b6d2ed08200bdc57e580469763fbad6", "url": "https://www.bonappetit.com/story/the-fly-chicken-sandwhich", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Chicken Sandwich From The Fly Is The Perfect Thing for Not Sharing With Anyone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Chicken Sandwich From The Fly Is The Perfect Thing for Not Sharing With AnyoneIts pillowy potato roll, perfectly tender meat, and crunchy slaw are just for me, thanks.By Emily SchultzApril 17, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I grew up the oldest of three sisters. Sharing became a thing I had to do, not something I ever wanted to do. I’ve learned to live with it, and sometimes, maybe even enjoy it. At The Fly in Brooklyn, for instance, there are a bunch of things that are great to split: the perfectly seasoned rotisserie chicken, bottles of natural wine, the large U-shaped bar that takes up nearly the whole room. There is, however, one thing that is best enjoyed on your own. It’s the chicken sandwich, and (surprise, surprise) it’s my favorite thing on the menu.The whole thing is just small enough that you can hold it one-handed (that’s one of my hands, not yours), which is important because I always have a chilled glass of wine in the other.The meat is pulled from last night’s rotisserie chicken—a combo of white and dark, plus the crispy, salty skin—and topped with a bright and crunchy onion-radish-celery slaw, with a swipe of aioli spread across both ends of the Shewolf Bakery potato roll. It’s compact, juicy, and satisfying. Left to my own devices, I’ll eat the whole thing in three bites. Don’t worry, though, I’m happy to share my fries.Go there: The FlyExplore Bon AppétitHighly RecommendRestaurantsBrooklynRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-17", "author": ["Condé Nast", "Emily Schultz"]}