{"id": "2b70c83cb05e2fc16d645c2998507901", "url": "https://www.bonappetit.com/story/best-coffee-alternatives", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Need a Coffee Substitute to Ease Your Jitters? Start With These | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping13 Excellent Coffee Substitutes for People Sick of That Damn JoeFrom frothy matcha lattes to roasted barley blends, you’ve got options.By Ali FrancisFebruary 26, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If I don’t mainline a cup of coffee first thing upon waking, my brain will suddenly play host to what feels like a small maniac wielding a jackhammer. My writing gets all wobbly and nonsensical. (Don’t worry, I’m caffeinated right now!) And I find it borderline impossible to focus, which, unfortunately, is kinda a prerequisite to being employed—which, also unfortunately, is a prerequisite to making money. Which, most unfortunately, is—you get it. So why would I go looking for the best coffee substitute on the market?Let’s just say I’m harboring a trenta-size dislike for the fact that I am in somewhat of a codependent relationship with coffee. (Other things too, according to my therapist.) And attaching my whole self to anything just doesn’t feel smart. What if, when the world ends, I’m stuck in my bunker without coffee or electricity? Dealing with caffeine withdrawals while simultaneously trying to skirmish for the last tin of beans is not ideal. Not at all.But maybe you clicked on this list of coffee substitutes because the side effects—anxiety, digestive issues, or midafternoon fatigue—that can come from a day on the drip (coffee) are simply untenable. Or maybe you’re bored with your same old brew and looking to shake up that morning routine. Whatever the reason, from matcha lattes to roasted barley blends, there are truly so many creative beverages out there. I drank an unholy amount of liquid to bring you these: the very best coffee substitutes.Some caffeineClevr Matcha SuperLatteFluffy, creamy, and a little sweet. This latte blend is laced with stress-reducing adaptogens—like reishi, lion’s mane, and ashwagandha—stone-milled matcha, and probiotics, for a dairy- and jitter-free morning wake-up call. (Matcha is lower in caffeine per serving than coffee and takes longer to release.) The coconut milk and oat milk powder base means all you need to do is add some hot water and stir, making this a great camping option. When I’m  home, with electricity and shelter, I like to froth or blend a scoop of powder with hot water for a seriously cloudlike bev.Clevr Matcha SuperLatte$28 at ClevrMUD\\WTR Masala ChaiThe branding  of this coffee substitute gave me major brutalist Soylent vibes, and the first sip tasted earthy in a kind of bracing way. But just a tablespoon of the caramelly sweetener (you’ll need to purchase that separately) brought out the spice-forward flavor profile—which was kind of like a hot chocolate spiked with masala chai. Made with black tea, mushrooms like cordyceps and chaga, cacao, cinnamon, turmeric, and a pinch of salt, MUD\\WTR contains about one-seventh of the caffeine in coffee. Froth in some of their coconut milk and MCT oil creamer (also sold separately, but whatever milk is in your fridge will work fine) and you’ll be in for a silky-smooth treat that leaves watery old coffee in the dust.MUD\\WTR Masala Chai$50 at MUD/WTRFirebelly Tea No Ordinary Joe“This tea is WILD,” I told my boyfriend, sipping away on the couch one morning. The combination of bitter yerba mate and dark cacao shells, sweet licorice root, roasted chicory root, and dandelion made this herbaceous brew taste so uncannily coffeelike that bleary-eyed me could barely tell the difference. Pair this one with milk and sugar if you like your coffee on the sweeter side.Firebelly Tea No Ordinary Joe$19 at Firebelly TeaOne Stripe Chai Co. Chai Me at HomeSonia Chopra, our executive editor, is obsessed with this company and this particular South Asian masala chai blend. Firstly, it’s foolproof to make: You brew a good scoop of the spice-and-tea blend with some milk and water, strain the fragrant mixture into a mug, and add a sweetener of choice (if you’re into it). The black tea offers a little hit of caffeine and the green cardamom, ginger, and black pepper are spicy, warming, and worth getting out of bed for. As Chopra writes, “It’s just a very, very good drink.”One Stripe Chai Co. Chai Me At Home$16 at One Stripe Chai$16 at Bubble GoodsGuayakí Yerba MateThis herbal tea has been drunk in South America for centuries, and for good reason. The flavor, which is slightly more earthy and floral than coffee but less bitter, is delicious. If you’re about the health benefits, know that yerba mate is full of antioxidants and contains more caffeine than some teas but less than coffee, so it’s great for people that need a gentle energy boost without the crash. It’s also incredibly easy to make: Put a teabag in your cup, then steep it in boiling water for at least five minutes. I like to top mine off with frothed milk (yes, I’m a one-trick pony) and stir in a teaspoon of brown sugar.Guayakí Yerba Mate$15 at Hive$24 at AmazonA lot less caffeineGolde Cacao Turmeric Latte BlendGolden milk meets Swiss Miss: This drink is the best of two already very great worlds. An excellent choice for the less decisive among us (me). And who needs a whole bunch of caffeine (cacao beans have less than one twentieth of the caffeine in coffee beans) when you’ve got peppy ginger, cinnamon, cardamom, and black pepper to coax you to life? I’m not kidding when I say there have been times when I’ve labeled my morning alarm “golden choc latte” as an added incentive to get out of bed. Yes, this is also delicious stirred into your regular coffee. Oatmeal too.Golde Cacao Turmeric Latte Blend$29 at Golde$29 at AmazonRenude ChagaccinoI did not realize before ordering this product that it’s intended to be added to your morning coffee. (The adaptogenic chaga mushrooms are supposed to ease those jittery caffeine vibes.) To stay true to my test, I tried it straight up. It was like watery, cinnamon-y, and a-little-too-sweet hot chocolate. Not bad. Much better in coffee. Buy it if you just ain’t interested in quitting the beans but do want to go easier on the adrenals, and use code “bonappetit” for 15% off until March 31.Renude Chagaccino$30 at RenudeNo caffeineFour Sigmatic Mushroom Cacao Mix With ReishiThis is hot chocolate that’s been zhuzhed up with coconut sugar, reishi mushroom, cinnamon, cardamom, and stevia. It’s very tasty, especially when whisked into hot oat milk, topped with marshmallows, and consumed alongside an episode of And Just Like That. It’s also complex enough to hold its own against your morning cup of joe, sweet enough to help you power though the afternoon “Who finished the cookies?” slump, and wellness enough to add to your post-workout banana smoothie.Four Sigmatic Mushroom Cacao Mix$16 at Four Sigmatic$16 at AmazonFull transparency: Cacao contains caffeine, but when we reached out to Four Sigmatic the brand confirmed there is no caffeine in their products.Teeccino Dandelion Herbal Tea SamplerIf you blindfolded me and served me any one of Teeccino’s herbal teas, I’m not totally sure I could guess it wasn’t coffee. Made from roasted carob, chicory, and dandelion root, these herbal bevs have every bit of the coffee flavor, with none of the caffeine. The dark roast is the closest dupe, but the caramel nut, coconut, and mocha mint varieties took me right back to my university days when I was obsessed with adding flavored syrups to my skinny flat whites. Buy a sampler pack and pick a tea bag out willy-nilly for a fun morning roulette. Something to look forward to!Teeccino Dandelion Herbal Teas$6 at Thrive Market$9 at AmazonRasa OriginalI’m riding the Rasa wave until I burn my dang tongue off. This stuff—made from chicory, burdock, and dandelion—tastes vaguely of dark butterscotch. Like a Werther’s Original (remember those?) that fell in the fire. It’s not a perfect coffee imitation, but it’s a good adaptogen-packed alternative for people who like a dark, complex blend or want a late-night espresso without the tweaks. I’ll fill up my French press and sip on it all morning long.Rasa Original$24 at RasaDandy BlendLike liquid Whoppers without the chocolate shell. This powdered blend of dandelion root, chicory, barley, and rye reminded me a lot of the malted milks I coveted growing up, especially when served cold. It’s reminiscent of coffee, but a lot less bitter, and I love that it dissolves instantly—no fancy brew gear required. A nice alternative for people living their best post-modern hippie lives and those who can’t stomach acidic brews.Dandy Blend$8 at IHerb$23 at Amazon (Pack of 2)Wooden Spoon Herbs Herbal CoffeePacked with prebiotics (plant fibers that help good bacteria grow in your gut), this herbal coffee tasted a bit like the Dandy Blend. Only it's made from maca root—which, fun fact, may increase libido—mesquite pod, burdock root, and cinnamon bark. Overall, it’s got that caramelized flavor but is slightly more bitter, making it marginally closer to coffee. Drink Dandy during the day and this one at night? *Wink wink.*Wooden Spoon Herbs Herbal Coffee$38 at Wooden Spoon$38 at Bubble GoodsCrastan OrzoThe Italians invented this imitation coffee made from roasted barley during World War II, but they’re still drinking it. Why? Because it’s so good—malty and deep brown like coffee, but way less astringent. In Italy, the roasted grains are used in espresso machines and other coffee makers at cafes (order a caffè d’orzo), but this version is instant and dissolves easily in hot or cold water or milk. Buy it if you wake every morning wishing you were in Tuscany. (Who, me?)Crastan Orzo$15 at AmazonMore highly-caffeinated content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThe Coffee to Water Ratio That Makes a Perfect BrewThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeThese Are the Best Drip Coffee Makers, According to a Highly Caffeinated BA StafferBA Reviews: Is the Gaggia Classic Pro Espresso Machine Worth It?Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-26", "author": ["Condé Nast", "Ali Francis"]}