{"id": "2b7e4aa9247e7d39b32ef9aaaf233da9", "url": "https://www.bonappetit.com/story/noelle-hotel-nashville", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "I’d Stay at This Hotel For the Free Sparkling Water Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’d Stay at This Hotel For the Free Sparkling Water AloneIt’s the little things, people!By Amiel StanekNovember 11, 2019FacebookTwitterEmailPhoto courtesy of NoelleFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Travel can be depleting, disorienting, and perhaps most significantly, dehydrating. Which is why, upon arriving to one’s hotel room in an unfamiliar city after hours and hours of trains, planes, and taxi rides, there is no crueler joke than that bottle of water perched promiscuously on the bedside table. You want it. You need it. You can think of nothing more soothing than unscrewing its cap and letting the cool liquid run down your parched throat. And then: the sign. Eight F*ING dollars?! The indignity!(And yes, I am well aware that there is a tap in the bathroom, but there is also a part of me that suspects that hotels make their tap water taste especially bad so you’ll give up and just buy the bottle of water. But I digress.)So you’ll understand why, after a particularly long jag on the road last spring, I almost wept with joy and disbelief upon walking into my crisply appointed room at Nashville’s Noelle hotel. There was plenty to be grateful for: elegant but not overwrought furnishings, a comfy-looking king bed, tasteful crown molding. But the thing that blew my gourd was the conspicuous absence of a scandalously overpriced, booby-trapped bottle of name-brand water on the nightstand, and the conspicuous presence of an empty, reusable water bottle in its place, along with a note indicating that I would find complimentary filtered still and sparkling taps in the hallway. Seriously?!I ran out of my room so fast I almost left my key behind. Sure enough, just a few paces from my door, there were three chic taps: one for bubbly water, one for still ice water, and one labeled “ambient,” as in room temp. (Weird flex on that last one, but okay!) I filled my bottle with cold flat water, chugged the whole thing standing right there, gasped like a diver come up for air, and giddily refilled it with the fizzy stuff to bring back to my room. I felt like a wilted houseplant suddenly brought back to life. I was overjoyed.If my reaction sounds like hyperbole, trust me: It isn’t. Travel is dehumanizing—full-body scans and bag searches, other people’s cars and other people’s beds—and, as anyone who has thrilled over a free cookie on a long flight can attest, it really is the little things that count. And, oh, how they count! So hats off to you, Noelle, for making this weary traveler’s day all those months ago. Here’s hoping more hotels start to follow suit.Go there: NoelleExplore Bon AppétitHighly RecommendHotelsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-11", "author": ["Condé Nast", "Amiel Stanek"]}