{"id": "2b8ad328fdbc9833be6770c2255711b1", "url": "https://www.bonappetit.com/story/mental-health-resources-for-restaurant-workers", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Restaurant Workers Need More Than Healthcare This Election Year. They Need Mental Health Support. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseRestaurant Workers Need More Than Health Care. They Need Mental Health SupportShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020Restaurant Workers Need More Than Health Care. They Need Mental Health SupportJezabel Careaga, the owner of Jezabel’s Café in Philadelphia, explains why it’s hard for restaurants to offer it, what she’s doing to fill in the gap, and what advocacy looks like now.By Priya KrishnaOctober 20, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailHealth care has become one of the most critical issues this election, especially in the midst of the pandemic. Much of the debate centers on who should pay for it: the government or the individual. But for Jezabel Careaga, the owner of Jezabel’s Café in Philadelphia, the health care debate is ignoring a glaring crisis that’s affecting millions in the restaurant industry and beyond: mental health.The restaurant industry suffers from some of the highest rates of mental illness in any field. The pandemic has exacerbated this, as many restaurant workers are returning to work. Yet, in the U.S., many of them can’t even afford so much as a therapy appointment. Careaga wants to change that. After struggling with her own mental health and unable to find affordable care, she has spent her career fighting to make mental health accessible to her workers and others in the industry. In 2019, she started Fuerza for Humans, a nonprofit that shares mental health resources with hospitality workers as well as gives space for dialogue. She was about to launch new initiatives, like a mindfulness workshop paired with cooking, when the pandemic hit.Here, Careaga explains why mental health needs to be part of the health care conversation this election and what that means for restaurant workers.You migrated to the U.S. from Argentina in your mid-20s. When did you realize that the attention paid to mental health in this country was sorely lacking?In 2011 I went through a tough separation. That is when I was like, “I need mental health resources.” I had just opened Jezebel’s a year earlier, and I tried to get care through my insurance, then outside of insurance. But there was no way to get an affordable rate. Here, for a person like me, it costs around $450 per month for health insurance, and I am not getting much. That just includes the basics—you get access to just a few mental health physicians, and you still have to pay a $50 copay. So it’s still not that affordable.In Argentina it is very different. The most expensive, top-of-the-line, everything-included insurance—dental, vision, therapy, even cosmetic surgery—we are talking about $150 a month.Also, while many companies in the U.S. pay for employees’s insurance, I don’t offer health insurance through my café. We are trying to figure out how we can do that in 2021, but for us to absorb that right now is a big cost.Can you break that down? Why is it so hard for restaurants to offer basic health care?At this point, we can afford to pay a percentage of an employee’s health insurance and the employee covers the rest of it. But even still, we have to take that cost and build it into the prices. Instead of a dish being $12, $14, or $15, now we are talking $18 or $22. Customers don’t want to pay that, though, because someone else is always offering that dish somewhere else for $12. This is a conversation I have had with many other owners here in Philadelphia: How do you build that cost into your everyday operations? Every other industry does it. Why can’t we do it? It’s because—and I don’t want to say this in a disrespectful way—people want to get food for cheap. But food for cheap costs us in the long run—in health, but especially mental health. If you are not taking care of your mental health now, by 2030 it will be worse.Why is mental health a uniquely large challenge for the restaurant industry?We are always taking care of everybody else except ourselves. We are always focusing so much on the other person while running on zero gas. This is so common in the restaurant industry. We are all stretched super thin, bending over backwards…They bend over backwards, their mental health deteriorates, and then they have no health care coverage to deal with these issues.Yes. I suffer from some form of depression and anxiety. And listen, if I go through this as a restaurant owner and have a hard time finding affordable [mental health] care, imagine what a [restaurant worker] who doesn’t have that motivation, who definitely can’t afford those resources out of pocket, or who needs a job to feed their family goes through. I have workers who struggle to just get out of bed to come to work on time. These are just basic small things people can’t do.What kind of mental health resources do you offer your employees?We currently offer support via a company called Quest, which is an employee assistance program that gives access to mental health services like online mental health assessments and therapy at an affordable rate. They have a wide range of physicians, and you can register for yourself plus your significant other. We as a company pay $1,000 a year for access to these services, which is very reasonable. I was seeing a therapist who happens to provide his services through Quest, and he recommended that I take a look at their mental health program for my staff.A couple employees have used it—one of them was going through a separation and she has talked to someone several times, which has been a really positive thing for her. The best part has been that they can access those resources on their own. I am removing myself from the middle: They can register through the company and they can still call me anytime, but they don’t have to ask for permission to use this. They have that freedom.How did Fuerza for Humans start?Someone invited me to do this eight-week mindfulness program by a professor named Jenny Mills. She was amazing. She approached mindfulness in a very humanizing way: She talked about her own daily frustrations, like how her husband sometimes doesn’t do the dishes. It was a reminder that there is no right or wrong way to be in the moment. She made mindfulness feel like a very regular, everyday thing. After doing this, I wanted more people [in the restaurant industry] to be able to access this mental health resource.I had my first sessions with a therapist at the age of five. My grandma took care of me from when I was born until kindergarten while my parents were at work. Her home was my cocoon, and her meals were so nourishing. Right before starting school, we moved to a new neighborhood and she wasn’t there everyday to take care of me. I had a hard time adjusting, until I started to chat with a therapist. After that, I have been doing therapy on and off since I was 16, and it helps me to evolve and grow.That separation from my grandma is what took me on my path to mental health. And that connection to mental health led me to start hosting these dinners called “If My Grandma Were to Cook You Dinner,” where different chefs in the city cooked these simple meals inspired by what their grandmas made for them. We donated the funds toward hosting mindfulness workshops with Jenny [for restaurant workers]. “Fuerza” means both strength and power in Spanish. So we called the initiative “Fuerza for Humans.” It made sense to tie the dinner series with offering resources for mental health, because when I think of fuerza, I think of my grandma.Inside Jezabel’s Café \nPhoto by Laura MurraySo what is the latest with Fuerza for Humans?We became a nonprofit in 2019 and we were supposed to start with a mindfulness meeting in February or March. Then everything went on pause. We were working with the Free Library of Philadelphia, which has a full kitchen, on doing mindfulness classes there, the idea being that people are in a space that feels familiar. During the classes, they can, for example, focus their attention on the mixer while breathing in and out. We had all the meetings leading up to this except the actual class itself. Now we are trying to figure out how we can get back to it. Maybe an online session or smaller, shorter sessions.How do you hope Fuerza for Humans will impact your employees and the industry at large?I think it will allow them to have a more balanced life. As someone who can be a workaholic, that is something I have to find within myself. I have to be really conscious about it. I want people to know they have this resource that can allow them to take care of their mind. We really stigmatize mental health, but if you get treated for your mental health, you might have a better relationship with every human in your life. I don’t expect that this will touch everybody, but if I can touch five or seven or 10 people, and in five years their lives have improved a bit, I have done my job. They get to have a bit of a better life by having mental health services.That work feels especially important amidst the pandemic, when so many restaurant workers are under increased stress and fear for their health and well-being.Absolutely. The pandemic magnified any problems we were having in society. This is an even better moment to be like, This is what matters in life. My mental health matters. My well-being matters. I really hope that people take time to pay attention to mental health because if we don’t take this moment to say, “Let’s change things,” then what will it take to move our community forward?What do you think mental health coverage should look like in a health care plan?In the same way that we get our blood sugar level checked, we should get a mental health check-up. And it shouldn’t cost $250. It’s that basic. We don’t have to make it complicated. The government has to do something and help us out, but this is also a conversation to have with restaurateurs. I ask them, “What mental health conversations are you having with people before you hire them?”What kind of impact do you think regular access to mental health resources would have on the restaurant industry?It will help everyone inside of restaurants to not be constantly run down. People will be more present and do more meaningful work. At the end of the day, that is what we want. We want people here to be fulfilled. And there is a ripple effect to offering mental health resources now. If we are thinking more mindfulness is going to change everything in the next six months, that is not realistic. We are working to help people running restaurants in 2030. This is a long term plan.What are ways that people can advocate for these issues to their elected officials?Part of it is just having the conversations with your own community about how mental health affects everybody. Every single human in one way or the other has struggled with something. It is necessary to have the conversation and to normalize it. I heard a podcast that [television host and cookbook author] Samin Nosrat did, and hearing her talk about her struggle with mental health—she is someone who can really influence our society. People should be able to say, “I have anxiety,” like they say, “I have a cold.” That is the beginning—advocacy at the bigger levels comes after.How you can help make mental health more accessible to restaurant workers, according to Careaga:Visit the National Alliance on Mental Illness to learn how to contact your policymakers to advocate for mental health resources. NAMI is not industry-specific, but it is the nation’s largest grassroots mental health organization dedicated to advocacy, education, support, and public awareness so that the millions of Americans (and their families) affected by mental illness can build better lives—including restaurant workers.Get certified in the mind-body-medicine program through the Center for Mind-Body Medicine and learn how to help others deal with personal trauma.Explore Bon AppétitRestaurantsRead MoreElection 2020How to Practically and Specifically Help Restaurants This Election YearBy The Bon Appétit StaffElection 2020I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeBy Francesca Hong Election 2020Aisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.”By Aisha “Pinky” Cole, as told to Leigh-Ann JacksonrestaurantsWhat I Learned Covering Restaurants During the PandemicBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Priya Krishna"]}