{"id": "2b90d31bde76e3f7beadf209088dacf7", "url": "https://www.bonappetit.com/recipe/cookies-and-black-sesame-cream-ice-cream", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Cookies and Black Sesame Cream No-Churn Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueCookies and Black Sesame CreamBy Sarah JampelJune 2, 20204.7(3)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintA dream came true: Cookies and cream meets black sesame ice cream. It’s nutty, textured, and not-too-sweet. We preferred Nabisco chocolate wafers here, but you could also use Oreos or any chocolate cookie your heart desires.IngredientsMakes about 8 cups½cup (70 g) black sesame seeds114-oz. can sweetened condensed milk1tsp. kosher salt2cups heavy cream3oz. chocolate wafer cookies, crushed into large pieces (about 1 cup)PreparationStep 1Toast sesame seeds in a dry large skillet over medium heat, stirring often, until fragrant and just starting to crackle, about 2 minutes. Transfer to a food processor or blender and pulse, scraping down sides as needed, until seeds are finely chopped but haven’t formed a paste, about 3 minutes in a food processor, and about 2 minutes in a blender.Step 2Mix together ground sesame seeds, condensed milk, and salt in a medium bowl.Step 3Using an electric mixer, beat cream in a small bowl, starting on low speed and gradually increasing to medium-high as it thickens, until billowy and stiff peaks form, about 5 minutes.Step 4Add a dollop of whipped cream to condensed milk mixture and mix in with a rubber spatula (this is just to lighten it so that the next stage—folding—is easier). Add remaining whipped cream and fold in, running spatula down sides and along bottom of bowl and lifting up through center and over top while rotating bowl to integrate without deflating, until very few streaks of condensed milk mixture remain. Fold in crushed cookies; scrape ice cream base into a loaf pan that’s at least 8½x4½\". Cover with plastic wrap or an airtight silicone lid and freeze until solid, at least 8 hours.Step 5To serve, transfer loaf pan to refrigerator and let ice cream soften 10 minutes before scooping into bowls.Step 6Do ahead: Ice cream can be made 1 week ahead. Keep frozen.How would you rate Cookies and Black Sesame Cream?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is seriously magic. Not only is it very easy to put together, but the end result has the texture you expect from ice cream with even richer flavor. As someone with a tiny kitchen who can't have an ice cream maker, my prayers have been answered here. Can't wait to try more flavors with this base formula.bentley_weisNew York6/15/2020I was so excited when I saw this recipe- my family was skeptical. But this ice cream was easy to make, and pure magic. Creamy, nutty, and deeply flavored. Definitely use the Nabisco chocolate wafers- better than oreos in this application! Thank you Sarah for another awesome recipe!\nJust make it!emmykSeattle6/8/2020Explore Bon AppétitIce CreamFrozen DessertDessertSummerEasy5 Ingredients or FewerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}