{"id": "2b9d6aa4e66a46fcc2a6c73a1abfcea5", "url": "https://www.bonappetit.com/recipe/spicy-citrus-refresher", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Spicy Citrus Juice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueSpicy Citrus RefresherBy Anna Stockwell and Sohla El-WayllyNovember 19, 20194.4(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis big batch of jalapeño-spiced orange-lime juice keeps in the fridge for a couple of days. Pour it over ice and top it with seltzer for a refreshing alcohol-free pick-me-up, or stir a splash of rum into your serving for a cocktail.Ingredients10–12 servings4limes7navel oranges, divided2small jalapeños, divided1cup sugar½tsp. kosher salt12oz. white rum (optional)Club soda (for serving)PreparationStep 1Juice limes and 6 oranges into a large pitcher. (You should have about ¾ cup lime juice and 1¼ cups orange juice.) Discard lime rinds and half of the orange rinds. Cut remaining orange rinds into quarters and place in a large saucepan.Step 2Coarsely chop 1 jalapeño and add to orange rinds along with sugar and salt. Using a muddler or dowel-style rolling pin, muddle rinds until thoroughly smooshed and much of the sugar and salt is dissolved, about 3 minutes. Stir in 1 cup warm water and let sit at least 10 minutes and up to 1 hour.Step 3Strain orange mixture through a fine-mesh sieve into pitcher with juice, gently pressing with a spoon to extract as much liquid as possible; discard solids. Thinly slice remaining orange and add to pitcher. Remove seeds from remaining jalapeño; thinly slice into rounds and add to pitcher.Step 4To serve, pour 2 oz. juice mixture and 1 oz. rum, if using, into an ice-filled glass. Top off with club soda; stir to combine.Step 5Do Ahead: Juice mixture can be made 2 days ahead. Cover and chill.How would you rate Spicy Citrus Refresher?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleLove this recipe! I think it could be spicier, but that's personal preference; tastes great as the recipe is! I like to use a combo of navel oranges and blood oranges, and I'll make a big batch of the juice on the weekend and have easy, quick cocktails all week long! Doesn't take long to throw together and for me it's definitely worth it.AnonymousWaco, Tx5/23/2021I absolutely love this recipe! It is the perfect combo of refreshing, sweet, and spicy. It is a bit time consuming for a cocktail, but it's a great cocktail to make when you have more time (for example, during a quarantine!). I added lime seltzer instead of club soda, and salted the rim of my glass.BrynnMac18Philadelphia3/25/2020I was somewhat unimpressed with this. It was a lot of work but didn’t taste like anything special. In my opinion the same thing probably could have been achieved by muddling a few jalapeños slices in sugar and then adding some OJ and lime juice. Definitely didn’t need the seltzer, either. We found the tequila worked well too if you don’t like rum. Chicago1/8/2020Explore Bon AppétitPitcher DrinkDrinks AllCocktailCold DrinkOrangeCitrusFruitJalapeñoChileVegetableRumAlcohol & Other DrinksWinterEasyDrinksNonalcoholicHealthyishSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Anna Stockwell", "Sohla El-Waylly"]}