{"id": "2bb8cd3eb45c8c3e87da69b9353862de", "url": "https://www.bonappetit.com/story/healthyish-homecoming-tickets", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Come Hang Out with Us at Healthyish Homecoming! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCome Hang Out with Us at Healthyish Homecoming!Get your tickets for our festival in Brooklyn on June 9.By Adam RapoportMay 31, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailIt's almost time for Healthyish Homecoming! Buy your tickets now.A few weeks ago on Mother’s Day, my wife and I found ourselves with a free afternoon. Our son was off on an all-day playdate, so we decided to make the most of it. Simone signed us up for a 12 p.m. yoga class (her idea) followed by lunch at a brothy, spicy, veg-centric Japanese curry spot around the corner (also her idea).Ten years ago, I might have scoffed and eye-rolled at our itinerary. But people change. Even ones like me, who never think they do.Over the last few years, I’ve become the guy who reaches for a green juice (extra ginger, please) on those days when I need a boost. On nights when I’m not mixing myself a cocktail, I pour myself a fizzy kombucha on the rocks, and tell myself that it tastes like pét-nat.I’ve got a trainer. I sneak off to yoga when I can.Photo by Alex LauI do all of this not because it’s in vogue (although, it is), but because it makes me feel good. Really good. And it’s this way of thinking—enjoy the good things in life, while balancing them with the good-for-you things in life—that fuels our Healthyish website. Have you checked out Healthyish? I’m consistently amazed at what a diverse spectrum of people come not just for straight-up delicious recipes, but to talk about wellness in a straight-up, down-to-earth way.I’d like to take credit for the rapid-fire success of Healthyish, but the kudos go to editor Amanda Shapiro, who has infused it with its infectious personality and purpose.And it’s Shapiro who, last year, asked the question: What if we brought Healthyish to life? Funny how a simple query can lead to something big.Saturday, June 9 is the first-ever Healthyish Homecoming, a day-long festival of talks, food, and drink here in New York City. There will be panels and seminars, featuring folks like New York Times writer and podcast host Jenna Wortham and Dining In cookbook dynamo Alison Roman (of The Cookies fame). Grammy Award-winning actress Cynthia Erivo will be there. And Nic Jammet, co-founder of Sweetgreen. And many, many more.Photo by Rachel KartenNot that it’s all talking. Heather Sperling and Emily Fiffer, of LA’s favorite Healthyish restaurant, Botanica, will be making lunch for everybody. And because being healthy isn’t much fun without a side order of ish, Hanna Black and Carla Perez-Gallardo from Lil’ Deb’s Oasis up in Hudson, New York, will be serving up cocktails and snacks at day’s end.Oh yeah, and for people like me, who can’t sit still for more than 30 minutes, Chloe Kernaghan from Sky Ting Yoga will be there to lead us through some “active moments” throughout the day.I’ll be honest, Healthyish Homecoming is the kind of thing I never would have considered going to 10 years ago. Which is exactly why I’ll be there come next Saturday. Buy your tickets here and join us.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "Adam Rapoport"]}