{"id": "2bbfbf7dfd37239a4cce8f359711137e", "url": "https://www.bonappetit.com/story/tofu-scramble", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Tofu Scramble is a Nutritious, Vegan Breakfast That's Easy to Make-Ahead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf Tofu Scramble Can Fuel My CrossFit Workouts, It Can Keep You Satisfied Until Lunch A great source of P.B.P. (a.k.a. plant-based protein). By Lukas VolgerFebruary 7, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My breakfasts used to primarily consist of steel-cut oats or a plate of scrambled eggs. But then, inspired by what I’ll call “a deepening of my relationship with my gym” (as in, CrossFit workouts six times a week), I started becoming more “intentional” with my breakfasts and looked for help in the plant-based protein department. The tofu scramble, with its ample protein, ease of preparation, and endless versatility, called to me as the answer I was looking for. And once I learned to treat it like a stir-fry rather than like scrambled eggs, I quickly became a tofu scramble convert.As I share in my new cookbook Start Simple: Eleven Everyday Ingredients for Countless Weeknight Meals (tofu is one of the 11 ingredients!), I start with a “body vegetable”—something a bit hearty, that adds some substance and textural contrast. Usually it’s about a cup of peeled and diced sweet potato, which feels breakfast-y to me, but diced winter squash works well, too. In my widest skillet, I fry the chopped veg in a splash of olive oil, stirring every now and then, until it takes on a good amount of searing and blistering. If it looks nice and seared but a paring knife can’t easily pierce a hunk, I’ll add a splash of water to the pan and cover it to finish cooking by steam for a few minutes longer. (I don’t actually have a lid that fits my skillet, so I just set a baking sheet on top!) The potatoes or squash should be fully cooked before moving on to the next step.Meanwhile, I prep the tofu. To dry it out, I slice it into thick slabs, lay them out on a cutting board, and blot out the moisture with a clean towel. Then I mash everything up with a big fork, right there on the cutting board, until I’ve got pieces ranging in size from a lentil to a kidney bean. These are what I lovingly refer to as “the scrambles.” Once the sweet potatoes are done, scrape the scrambles into the pan, along with a few scallions—green and white parts—that’ve been thinly sliced. (In place of the scallions, you could also brown an onion, cooking it along with the sweet potato, but scallions are my preference, being quick-cooking “jewels of nutrition hiding in plain sight.”) Stir the pan often, until the tofu dries out a bit. Unlike eggs, you’re not cooking the tofu; you’re looking for the moisture to evaporate so as to prevent a wet-sludge situation.Photo by Chelsie CraigHere is where I think I’ve found a fun innovation. I’m anti-turmeric when it comes to tofu scrambles; I like tofu on its own terms, no need to trick me into thinking that I’m eating eggs. Instead, I push the skillet into more of a sweet-spicy yet familiarly breakfast-y direction by making a quick little maple-sriracha glaze. This really complements the sweet potato or squash. I clear a space in the middle of the pan, then pour in about a tablespoon of maple syrup, along with a good squeeze of sriracha, and about 2 teaspoons water to thin it out. Your pan should already be nice and hot, so the mixture will immediately bubble away and caramelize deliciously. Stir to evenly coat the tofu and vegetables. When I’m looking for even more protein, I add a can of black beans (rinsed and well drained) for extra body and texture, plus earthy, beany flavor.All this makes enough to serve four people, and leftovers keep really well. Anything I’m not eating immediately I transfer to a Tupperware to cool and then store in the fridge. It’s good for three days or so and takes just a few minutes to reheat some future morning.But when I’m planning to eat it immediately, I stir in a big handful of tender greens, tossing them into the mixture just until they wilt. Baby kale, spinach, and arugula all work well—something with a little assertiveness is best, and avoid anything too hardy (like kale, collards, or chard) that take a long time to soften. I also throw in a handful of chopped cilantro, which brightens up the whole dish, but chives and parsley go well, too. These are nice, but not essential; leave them out if you don’t have any herbs on hand. (It’s best to add the greens and herbs to serve—so if you’re reheating the leftovers, stir in the greens once the scramble is reheated, followed by the herbs.)Then I serve it steaming hot, with a few slices of avocado on the side. The avocado is cool and creamy, and perfectly rounds out the flavors and textures. And then you have before you a flavorful and hearty, nutrient-packed, plant-based, über-filling breakfast which happens to be friendly to both CrossFit die-hards and their fallen angels, too.Lukas Volger is a food writer, recipe developer, and co-creator of Jarry magazine. His newest book is Start Simple: Eleven Everyday Ingredients for Countless Weeknight Meals .Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-07", "author": ["Condé Nast", "Lukas Volger"]}