{"id": "2bc095d420e39ce7b8a2a2fee322022d", "url": "https://www.bonappetit.com/story/khiar-shoor-grief", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "Persian Cucumbers: In My Search for Khiar Shoor, I Found My Dad Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn My Search for Khiar Shoor, I Found My Dad AgainWe loved eating Persian pickles together. After he died, I looked everywhere for the right one.By Lauren HakimiDecember 20, 2021FacebookTwitterEmailIllustration by Melanie LambrickFacebookTwitterEmailWhen my dad died two and a half years ago, my family faced a question: What do we do with all the pickles?Some swam in a container full of brine in the refrigerator. Most sat in cans in the garage, where they still remain, ready just in case he ever comes back. My dad really loved pickles.Sometimes, on Sunday mornings, he poured a can of them into a black plastic container and just ate the stubby things whole, one by one, until they were gone. That was how he taught me to eat them, too, and before I even learned the words “cucumber” and “pickle” I knew the Persian words “khiar” and “khiar shoor.” I would pluck them out of his Sunday lunches, and he’d pretend to be angry at me for stealing his food. “That was for my own consump-shen,” he’d squeal, at the same time pushing his plate toward me.When I moved from Great Neck, New York, to Manhattan for college, one of the first things I did was look for cucumbers and pickles. I went to the typical chains: Whole Foods and Trader Joe’s. The fruits there were unlike what I was used to seeing. The pickles came in jars, not cans—some of them were even sliced, not whole. The cucumbers looked long and flimsy, more like zucchinis than the short, firm fruits I saw at my local kosher Persian grocery stores. It occurred to me that Great Neck’s kosher grocery stores mostly sold Israeli and Persian varieties, not necessarily because these were objectively superior to other cucumbers (which they are!) but because Great Neck was full of Persian Jews like me. I bought Trader Joe’s flimsy cucumbers but they languished in my refrigerator and I never ate them.It was even harder to find half-sour pickles. I’d eaten them as a child when my dad took my siblings and me to Ben’s, an Eastern European-style kosher deli in Wheatley Plaza on Long Island. When we sat down at the booth next to the statues of David and Goliath, there were always two little bowls on the table: one with coleslaw, and one with two kinds of pickles—full-sour and half-sour. The full sours were all well and good, but it was the half sours, with their neon green color and promise of juiciness, that really appealed to me. My dad took note of my preference. He would go to a vacant nearby table and trade our full-sour pickles for their half-sour pickles so that I’d have a whole bowl of the better type. Though he liked them too, he never took one from me. After a meal of fries and Dr. Brown’s black cherry soda, I’d sit in my dad’s lap and eat a rainbow sugar cookie. Outside the restaurant, he fished a penny out of his pocket for me to throw into the fountain and make a wish, but I already had everything I could wish for.My family hasn’t been to Ben’s in years; my dad was usually the one who took us. That means I’ve gone a while without half-sour pickles. It’s not as though I didn’t try to find some. I looked them up online but they were too expensive for me, and I’m not much of an online shopper anyway. Then, on a recent Sunday morning in Great Neck, I insisted upon going grocery shopping with my mom (when she went alone, she never bought anything I asked for). There they were, oddly placed between the milk and hash browns at ShopRite: jars of Ba-Tampte half-sour pickles for only $3.49. “They probably won’t taste like the ones at Ben’s,” my mom warned. “But if you want, take one.”At home, before I ate my favorite type of pickle for the first time in years, I was afraid it wouldn’t taste the same anymore. I was afraid I wouldn’t like them, like the Real American Chain Store patron I’d become since starting college. But as I drained the brine in the sink and sat down to eat, the scent in my nose felt like a homecoming. I finally took a bite. So rubbery, so crispy, so juicy. I’d forgotten how much of their textural power came from the little bumps on their skin. The item in my hand was no longer a pickle; it was a proper khiar shoor. I practically heard my dad utter those glorious words, his lips pursed for the “shoor.” I saw his eyes widen and his eyebrows move upward as he chewed. “Nashode be donya,” he’d say after he swallowed; out of this world. He said that about every fruit and every vegetable I ever saw him eat. After we buried him, the rabbi tried to assure me that heaven has everything. I don’t believe in heaven, but that day, I suspended my disbelief. “Even pickles?” I asked, and everyone laughed. Yes, even pickles. The khiar shoor in my hand was nashode be donya; it was heavenly. I sat for a minute in awe. Then I reached for another, then another.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-20", "author": ["Condé Nast", "Lauren Hakimi"]}