{"id": "2bdf403e781fc328d7fcabd877ab8ac3", "url": "https://www.bonappetit.com/story/never-fail-green-sauce", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "This Green Sauce Is the Most Useful Condiment There Is, End of Story | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Green Sauce Is the Most Useful Condiment There Is, End of StoryAnd it's a righteous excuse to use all those aging herbs in your fridge.By Alex DelanyMay 10, 2019FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.There used to be a part of my fridge that I referred to as The Graveyard. Bottom shelf. Back right corner. Behind some real estate known as The Leftovers Zone. Without fail, a bag of herbs would end up in The Graveyard every week. Whether it was a half-bunch of cilantro, a whole bunch of parsley, or a few sprigs of mint, I'd open the bag to see wilted, brown, sad herbs with only a shade of the vibrant flavor they once possessed. But that was long ago. That doesn't happen to me any more. Because since I started making this green sauce, I've never wasted a bunch of half-used herbs since. And I've never looked back.Maybe you call it salsa verde. Maybe you call it chimichurri. Or maybe you have your own cute little name for it. But green sauce is the ultimate insurance policy against herbs gone to waste. It's versatile. It's incredibly delicious. And it comes together in minutes.You start with whatever herbs you want. For real. Any combination of tender herbs like parsley, cilantro, mint, basil, or dill. (Steer clear of hardy herbs like thyme, rosemary, and sage here; they'll be too strong.) Whatever you have in the fridge. It's totally up to you. You just need about a cup of them once they're finely chopped. Then add 3 chopped garlic cloves, 1 finely chopped shallot, 1 tsp. kosher salt, ½ cup of red wine vinegar, and ¾ cup of olive oil. If you're feeling lazy, you can throw the garlic, herbs, and shallot into a food processor, but chopping everything by hand will work just fine.Double or triple that batch if you have the ammo for it. This green sauce will last for another week in the fridge, so you're essentially doubling the life of your herbs. And in that week you can use the tangy, fatty, herb-packed sauce for just about anything.Tender herbs, otherwise known as green sauce fuel.\nTED+CHELSEA CAVANAUGHAny grilled, roasted, or seared protein will welcome green sauce. Steak. Fish. A whole damn chicken. Maybe even some roasted vegetables too. Just spoon it right on top. And if you want to get the flavor going earlier, you can also use your green sauce as a marinade.We're talking about the chameleon of condiments here. You can go for the drizzle or the marinade, but you can also stir some into Greek yogurt for an incredibly simple dip. You can mix it into plain white rice for a more vibrant grain option or spread a bit on your sandwich or toast. Green sauce can be made from any tender herb and serve just about any purpose. It can be anything you want it to be. You know, within reason. If you're looking for a raise at work or a new car or a someone to sublet your apartment...maybe look somewhere else. If you're looking to never waste another bunch of herbs, you're in the right spot.Want an actual recipe? We've got that.Chimichurri SauceThis colorful chimichurri recipe doubles as a marinade and works as an accompaniment to all cuts of beef—or anything else you want to gussy up.View RecipeExplore Bon AppétitBasicallyherbSalsa VerdeChimichurriRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-10", "author": ["Condé Nast", "Alex Delany"]}