{"id": "2be098da8e8a1ee75bd03494cd553160", "url": "https://www.bonappetit.com/story/two-pasta-dinner", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Two Pastas Are Better Than One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTwo Pastas Are Better Than OneSometimes, everyone should get a dinner they like.By Adam RapoportAugust 27, 2019FacebookTwitterEmailHeidi's BridgeFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When you’ve got a mother-in-law who’s allergic to shellfish, an 11-year-old who won’t look at the stuff, a wife who is obsessed with linguine vongole, and a father in law who asks why you didn’t buy more clams, that’s when you make two pastas for dinner.To be clear, I’m not suggesting anyone else actually do this. But it was an interesting exercise, at least, in shared stove-top negotiations and marital relations.Simone’s parents were visiting for the weekend, along with Cousin Tony (who was firmly on Team Vongole), and Simone announced she was making her favorite pasta for dinner. She alerted me that I was on the hook for something that both Marlon and her mom would like.Without missing a beat, I settled on Molly Baz’s pasta al limone, a luscious, super simple recipe, fit for grandmas and grandsons alike.On a tight four-burner stove, we filled up a big stock pot with liberally salted water. Into that would go enough dried pasta for both dishes—a little over a pound for five people.Want this letter before it hits the website? Sign up for our newsletter!Who can say no to this pasta al limone?\nPhoto by Chelsie Craig, Food Styling by Kate BuckensMeanwhile, in a cast-iron paella pan, Simone set to work on the clams, filling it with a few glugs of olive oil, and some smashed garlic. Eventually, in went two dozen little necks, a generous splash of rosé and, because it’s August, a big handful of sun gold tomatoes.Elbow to elbow, I started on the limone sauce in an oval Dutch oven. Heavy cream, butter, lemon zest. Simmer.Just as the spaghetti chitarra was approaching al dente, we added a cup of starchy pasta water to each cooking vessel to help emulsify the sauces. We then tonged the pasta straight into pots and I showered the creamy limone with a handful of finely grated parm.Despite my initial skepticism, we got both pastas to the table simultaneously, all hot and saucy and glossy. I won’t say which was better (no point in starting an argument with my wife now, given we emerged from our cook-off unscathed). I’ll just say that maybe making two pastas for dinner isn’t such a crazy idea, after all.Get the recipes:BA's Best Linguine and ClamsClams vary in brininess and the amount of liquid they’ll release during cooking, so you’ll need to adjust the salt and add pasta water accordingly. To prevent the sauce from getting too salty, we recommend a measured amount of salt for the pasta water. If possible, look for an artisanal dried pasta for this recipe—the rougher surface texture will catch the slippery sauce better.View Recipe Pasta al LimoneThis creamy lemon pasta recipe is luscious and amply cheesy, but still bright and fresh. Best part: You can make it for dinner in just 15 minutes.View RecipeExplore Bon AppétitAdam NewsletterPastaRead MorecookingThe Pasta Salad That Won’t Get Weird at the PicnicBy Alex BeggscookingYou Couldn’t Pay Me to Eat Angel HairBy Carla Lalli MusiccookingThe Kinda-Healthy Kale Pasta I Can Always Count OnBy Elyse InaminecookingNo-Cook Puttanesca Is Here To Save Your Very Sweaty SummerBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Adam Rapoport"]}