{"id": "2beb7a6de58fbb56b0cd8065f6fe0082", "url": "https://www.bonappetit.com/story/line-cook-nycs-fanciest-restaurants", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "At Le Coucou, A Day In the Life of a Line Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Day In the Life of a Line Cook at One of NYC's Fanciest RestaurantsNana Araba Wilmot makes the food almost every night at Le Coucou, but you'd never know her name.By Amanda ShapiroMarch 1, 2018FacebookTwitterEmailPhoto by Jimmy FontaineFacebookTwitterEmailIf you follow major restaurant openings, you’ve probably heard of New York’s Le Coucou. Maybe you know of Daniel Rose, its much-fêted 40-year-old executive chef, who was born outside Chicago and proved his talents with three restaurants in Paris. And it’s possible you’re familiar with Stephen Starr, the megawatt Philadelphia-based restaurateur who co-owns Le Coucou. But the name Nana Araba Wilmot? It won’t ring a bell.Yet on any given night, chances are Wilmot will be in the kitchen in her tall white toque, long black braids hanging down her back. When you order the tender sole, set in a shallow pool of vermouth-butter sauce and dotted with precisely peeled grapes, it’s Wilmot who will have made it. And the powder-white fish cakes and the monkfish bathed in shellfish broth: Those are hers too. Hours later, when you’ve had your last sip of Bordeaux, paid your check, and left the golden-lit dining room, Wilmot will still be there, cleaning her station and sharpening her knives. She’s just one of 1.6 million line cooks in the United States, trying to build a life out of 11-hour shifts. Without cooks like her, those restaurants you obsess over, those dishes you snap photos of, wouldn’t exist. So wouldn’t you like to know what it’s like to be her for a day?On her way to work, Wilmot listens to Solange and Ghanaian hip-hop.\nPhoto by Jimmy Fontaine12:00 p.m.To get a glimpse into Wilmot’s world, I spent a day with her last December, trailing her through the end of her long shift.We meet in Bed-Stuy, Brooklyn, in the three-bedroom apartment she shares with a Columbia University adjunct instructor and a guy who does something in HR—she’s not totally sure. Usually they’re gone when she gets up and asleep when she gets home. We take a seat at a table across from a small L-shape kitchen. “I never cook here,” Wilmot says sheepishly. She isn’t chatty, but she listens carefully, then talks in long, thoughtful paragraphs. She’s someone you want to draw out and get to know.Wilmot's bedroom in the Bed-Stuy apartment she shares with two roommates.\nPhoto by Jimmy FontaineThere’s no closet in Wilmot’s room, but there are windows, which she likes. Her mattress lies on the floor. Her monthly rent is $870; her 30-day MetroCard is $121. There’s also a gym membership she might cancel. She makes $15 an hour, on the high end for a line cook. Nationally, the median hourly wage for line cooks is under $12; 19 percent of them live in poverty. Taxes and health insurance come out of her paycheck weekly. She’s not sure how the math works out. “I just pull it together by the end of the month,” she says, “somehow.”Wilmot isn’t cooking until something better comes along; she’s cooking because she loves to and wants to make it a career. She works five days a week, nearly 11 hours a day. She spends the few free hours she has outside of work and sleep doing what she calls “focusing up.” Some days that means boxing or doing yoga. She reads Anthony Bourdain’s Kitchen Confidential for career inspiration and Julia Child’s Mastering the Art of French Cooking for practical skills. Today, on the half-hour subway ride to Le Coucou, she reads the Bible on her iPad. (She was raised Episcopalian outside Philadelphia.) She listens to Solange to feel calm; hiplife, a Ghanaian style of hip-hop, to get pumped.Wilmot reads a biography of chef Ferran Adriá on the C train.\nPhoto by Jimmy FontaineWhen she emerges from the C train in Soho, it’s snowing. It’s the week before Christmas and the city is even more keyed up than usual. The restaurants are mobbed. Wilmot heads to the back door of Le Coucou, then to the locker room, where she changes into her white kitchen shirt and grabs her tools. At 2:30, the kitchen is organized pandemonium. The lunch staff is finishing a shift, the dishwashers are cranking, and the dinner cooks have started to arrive. Wilmot can’t clock in until 3, but she always shows up early because she needs the time to prep before service.She starts her shift by making beurre blanc for the $44 halibut entrée, a pristine piece of fish perched atop pickled daikon and served on a gold-rimmed plate. It is perhaps the only seafood dish that could be mistaken for melting vanilla ice cream. She sweats shallots and ginger in a pot that spans two burners, adds a bottle of white wine, three quarts of heavy cream, and about two pounds of butter. Meanwhile, she boils potatoes for the pommes purée (silky mashed potatoes) and stocks her station with everything she’ll need for the four dishes she’ll execute all night: fillets of monkfish, sole, and halibut; canisters of sauces ready to be ladled; squeeze bottles of water, wine, and grapeseed oil; trays of thyme, salt, butter, beech mushrooms, and peeled grapes.Wilmot lets out a pre-service smile.\nPhoto by Jimmy FontaineWilmot is one of 14 line cooks at Le Coucou; five are women and nine are men. These numbers shift, but, generally, the gender breakdown is more balanced than in the typical restaurant kitchen; nationwide, 27 percent of line cooks are female. That night there were also a female sous-chef and saucier, a couple of female prep cooks, and five women on the pastry team. Justin Bogle, Le Coucou’s chef de cuisine, who’s involved with hiring, says the gender makeup is not by design: “The women come on and hang tight here, and the dudes just fall off.” Rose, Le Coucou’s low-key acclaimed chef, who spent much of the past decade in Paris running his restaurant Spring, doesn’t see women cooks as an anomaly. “I didn’t work in New York before,” he says. “So I’m not sure how different [Le Coucou] is, but people tell me it’s very different. It’s not a macho kitchen.”Fine-dining restaurants often do better at hiring women than other kitchens; in 2014, the New York Times reported that in some of the country’s most well-regarded restaurant groups, between 30 and 50 percent of cooks were women. But it’s become clear that kitchens with more gender diversity aren’t necessarily friendlier places. Mario Batali, who’s been accused of sexual harassment against female employees, was one of the restaurateurs counted in the Times poll. Then there’s the issue of career growth. About one in four line cooks is female; about one in seven head chefs is.The evening's orders.\nPhoto by Jimmy FontaineWilmot is at Le Coucou because Bogle gave her a leg up. They met working for Jose Garces’ restaurant group in Philly after Wilmot graduated from culinary school in 2013. He brought Wilmot to New York to open the Spanish restaurant Amada. When he left for Le Coucou, he hired Wilmot there, too. She knows his wife; he’s met her mom. At work she calls him Pop.It’s common for chefs to hire through people they know, which is why the position physically closest on the line to the chef de cuisine is often the most coveted role. In this copper-accented kitchen, that position is meat roast, the cook who sears, for example, the beef filet, then passes it to Bogle, who tastes and checks the temp before a runner carefully swipes the rim with a piece of linen and whisks it off to the dining room. Next to meat roast is what the cooks call meat entremet, who prepares, among other things, the marrow jus that goes with the beef filet. Wilmot is next to entremet at the fish station. Around the corner there’s hot appetizers and garde manger (cold starters, like foie gras terrine). Meat roast is the spot Wilmot has her eye on. She’s 30, senior to some of the other line cooks by nearly ten years. “I’m older and more serious than a lot of these kids,” she says. “I have more to prove and less time to make mistakes.”When the toque goes on, things get serious.\nPhoto by Jimmy Fontaine4:50 p.m.Just before dinner service begins, it’s as if the whole restaurant inhales deeply. The dining room lights dim to a forgiving glow. Floor managers straighten knives, flick invisible specks of dust from velvet-upholstered chairs. A bartender fusses beneath shelves of unmarked bottles, backlit so their liquids shine in shades of gold and brown. At each table a tapered candle waits to be lit. In the kitchen there’s a frenzy of mopping, then the line cooks put on their toques—the tall chef hats they’re meant to wear and that will likely get tossed aside in the heat of service. For the last time that night, Wilmot stands still.When Le Coucou opened in June 2016, New Yorkers of a certain economic bracket seemed to realize, all at once, how much they wanted its modern take on classic French cuisine. The New York Times gave it three stars; this magazine named it one of the Top 50 best new restaurants last year. Eater called it “nearly flawless,” and the James Beard Foundation awarded it best new restaurant in the country. It’s open seven days a week, three meals a day. Reservations for dinner are booked out a month in advance. Bogle likes to remind the staff of this: “Most of the people you’re cooking for have waited a long time to pay a lot of money to eat here,” he tells the group. “Make it worth something.”Wilmot bastes the pike quenelles.\nPhoto by Jimmy FontaineBy 5:02, three tables are seated. At 5:14, a receipt machine at Wilmot’s station spits out a ticket. Table 23’s order is in. Every time a server logs an order, the chef de cuisine and every line cook receive tickets. Wilmot takes a Sharpie and writes over hers in big letters: H is for halibut. S is for sole. M is for monkfish stew made with shellfish stock and a sautéed lobster claw, cooked in a copper pot that goes directly to the table. And Q is for quenelles, pike fish whipped with cream and egg, then scooped into cloudlike ellipsoids and served in a lobster broth.By 5:30, the restaurant is full from Wilmot’s view, and she has four tickets tucked into the stainless-steel bar that runs above the cooks’ stations. Wilmot turns from the stove to her prep counter, then back again, a two-step she’s danced a hundred times already that night, her braids whipping behind. At times the whole kitchen seems to revolve around her. Temperature and texture are crucial for fish, and it can all go sideways if there’s even a 30-second delay. She’s constantly telling the other line cooks how many minutes out she is so they can time their dishes accordingly.Wilmot spoons foam over the quenelles.\nPhoto by Jimmy FontaineAt 7:41, she runs out of sauté pans. She yells back to the dish pit, then goes herself to find more. A guest sends back a halibut, saying it’s undercooked. At 8:43, she’s got eight tickets on the wall. Bogle is yelling for another halibut. She needs to move faster, needs to catch up. Rose appears at her elbow, deceptively casual in a black T-shirt.“You’re putting too much color on that, Nana,” he says, pointing to a piece of monkfish in a skillet. He wants a lighter sear on the lobster claw, too. “Toss, toss, done,” he tells her, calm but insistent. “You’re just warming it through.”As far as chef talking-tos go, it’s a mild one, but it couldn’t happen at a worse moment. When Rose moves away, Wilmot groans and bunches up her face. She bangs the pans harder, moves even faster, shouts even louder as the orders come in: “Oui, chef!”Even with Bogle’s support, Wilmot can struggle at Le Coucou. She started in late 2016, just after the Times’ three-star review. The pace and pressure were more intense than anywhere she’d worked before; it was like being initiated into a club with rules she didn’t understand.The restaurant's chef de cuisine, Justin Bogle, plating sole.\nPhoto by Jimmy FontaineShe found an unlikely mentor in a cook named Deborah Jean, who trained her on the hot apps station. Jean was the first black woman Wilmot had ever met on the line. She was nearly eight years younger, with the confidence of someone twice her age. The two butted heads at first, but Jean’s attitude eventually rubbed off on Wilmot: “She taught me that I could be myself in the kitchen, even though no one else looks like me.” And Jean found a friend she didn’t know she needed. “It’s hard when you’re the only black person in the room,” Jean told me later. “You hold back, not knowing you’re holding back until that one person walks through the door.”\nSince Jean left Le Coucou last fall, Wilmot is the only black person in the kitchen. (Nationally, 14 percent of line cooks are black; only 9 percent of head chefs are black.) This reality is not new for her. Growing up, she was the only black kid in her class. In high school, there were more kids of color, but they didn’t exactly welcome Wilmot. “I was always too black to be white and too white to be black,” she says.When I looked into what’s been documented as far as racial discrimination in restaurants, most of what I found focused on job segregation. Statistically, restaurant workers who are black are most likely to work as fast-food cooks or cashiers and counter attendants, two of the lowest-paying jobs in the industry. Front-of-house jobs like servers and managers are more likely to be white, while people of color are relegated to low-wage back-of-house jobs like dishwashers. These stories don’t capture the experiences of people like Wilmot—a skilled, ambitious woman of color who wants to stay in the kitchen. That is, as long as she can make a living wage.Wilmot sautès beech mushrooms and bastes monkfish while working the fish station.\nPhoto by Jimmy Fontaine10:30 p.m.The night slows. The “Oui, chefs” get quieter and less frequent. The orders come in further apart. Line cooks pause at their stations to eat slices of pilfered bread. Wilmot cracks jokes with the cook on meat entremet. Her shoulders relax. It wasn’t her best night, she decides, but it wasn’t her worst.The last ticket prints at 11:35, and almost immediately, a massive cleanup effort begins. It’s like eight hours earlier but in reverse: Sauces go back into quart containers, everything comes off the prep station and into the walk-in fridge. Buckets of soapy water slosh onto the floors.Wilmot changes out of her kitchen shirt, packs  up her tools, and stashes them back in her locker. She’s out early tonight; it’s only 1 a.m. She stops in the office to say good night to Bogle. Often they’ll recap the night, the week. “A lot of younger cooks don’t have the balls to come to me and say, ‘How did I mess up? How can I fill holes in my game?’” Bogle told me. “But Nana reflects.”The calm before the storm: Wilmot looks out on the empty dining room before service.\nPhoto by Jimmy FontaineSometimes a group of cooks will get food in Chinatown or beers at Whiskey Tavern nearby, but tonight, for Wilmot at least, the plan is to sleep, if she can. She walks out the heavy black door into a gust of arctic air.The most immediate concern for Wilmot is economic: Her annual income after taxes and health insurance, if she works 50-plus hours a week, comes to somewhere around $30,000—a take-home pay that makes a middle-class life in New York extremely difficult. There’s a notorious wage gap between back-of-house and front-of-house staff in restaurants, and it can be especially wide at expensive ones like Le Coucou, thanks to tips on meals that run well into the hundreds even before an order of that 1996 white Burgundy. Servers here are reportedly taking home $300 on a good night, tallying an annual income that can hit six figures.Wilmot breaks down her station.\nPhoto by Jimmy FontaineWhen she lived in Philadelphia, Wilmot says, she had a life. She had time to see her family and to work as a youth director at her church. “Everything in New York is harder,” she says. “It doesn’t really feel sustainable.”Wilmot will be 31 next week. When I ask her what she wants to be doing in five years, she doesn’t have an easy answer. She wants to keep cooking; she wants to get married and have kids. She talks about “having it all,” but she isn’t quite sure how to do it. There are plenty of married men in the restaurant industry; all the women she knows are single, and none of them has kids.An early night.\nPhoto by Jimmy FontaineWilmot has health insurance now through Starr Restaurant Group. About half of fine-dining restaurants provide it, but the monthly deduction is often out of reach on a cook’s salary. Wilmot gets a one-week vacation, unlike 70 percent of fine-dining employees who don’t receive paid time off or paid sick leave. If Wilmot were to have a child, she could get two months off with half pay under New York’s new Paid Family Leave policy, and the restaurant would legally have to hold a job for her. Rose told me that he’s used to his employees taking parental leave because in France it’s mandated by national law. “If someone who works here has a baby, it’s a validation of my restaurant that people feel secure here and have a future,” he says. Even working for a restaurant group that offers health insurance and a chef who understands the value of family leave, a line cook with a child would still face innumerable hurdles, like paying for and managing childcare during 11-hour shifts.Wilmot and floor manager Tye Anderson debate whether to go out after a long shift.\nPhoto by Jimmy FontaineFor now, though, Wilmot is focused on making it to meat roast, getting the light sear on that monkfish right, and figuring out where she might want to cook next. “If you asked me a couple years ago, I would’ve been like, ‘Yeah, I want to open my own restaurant,’” she says. “But the more you get into the industry, you see how competitive and stressful it is, and you’re like, ‘Do I really want that?’” Still, she dreams about what her maybe-someday restaurant might look like. It would be back in Philly, and it would serve upscale Afro-Caribbean food. When Wilmot was growing up, her grandmother, who came from Ghana to live with her family, taught her how to make the building blocks of Ghanaian food like jollof rice and red stew. “I love what I grew up on,” she says. “I love how soulful it is and the memories I get when I eat that food, and I’ve never seen it done like fine dining before.”When Wilmot was first out of culinary school, she tried out for a kitchen job alongside another guy going for the same position. He jumped in and worked the station while Wilmot hung back, and he’s the one who got the gig. It was a hard early lesson that jobs aren’t handed out in this industry; they have to be grabbed. When I ask Wilmot what she wants to tell aspiring line cooks, she answers easily: “It is possible. They can do it,” she says. “People will try to take it away from you, but you have to take it back.”Since this article was published in our March issue, Wilmot has been promoted to meat entremet at Le Coucou.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Amanda Shapiro"]}