{"id": "2bffc00b93746a64ac51ca507f41f087", "url": "https://www.bonappetit.com/story/how-to-poach-an-egg-with-confidence", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "How to Poach An Egg With Confidence And Grace | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Poach An Egg With Confidence And Grace Even if it's your very first time. By Sarah JampelOctober 21, 2019FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailThere are certain cooking techniques that have an aura of mystery—roasting a chicken; achieving the crust of crisp rice on a tachin; folding a smooth, pale French omelette; grilling a steak to medium-rare; and poaching an egg.Some years ago, even the thought of poaching an egg sent shivers down my spine. I remember standing over the stove with my mom nearby, losing egg after egg to the pot of water. I must've gone through a half-dozen before I got it (kinda sorta) right.I read up on what the pros suggested—like using only farm-fresh eggs, or boiling those eggs in their shells for 8–10 seconds before poaching, or adding vinegar to the water to help the egg white firm up, or creating a whirlpool with your spoon to encourage the egg to wrap around the yolk, Fantasia-style. But over the years, I realized that the keys to success weren't nearly so involved. Turns out that all you actually need to do for perfect poached eggs (that is, runny in the center, with firm but not bouncy whites) is 1) strain them, and 2) cook them gently.What's a frisée salad without the poached egg on top? \nLet's explain. Straining the eggs, as Molly Baz recommends for her bistro-style Frisée Salad With Warm Bacon Vinaigrette, gets rid of any loosey-goosey egg whites, creating a neater, more contained final product without tons of fly-away whites.Simply crack the eggs, one at a time, into a fine-mesh sieve and discard any of the whites that fall through. Strain as many eggs as you're going to poach and add them a bowl. Don't worry about the eggs co-mingling: They'll stay as discrete entities as long as you're reasonably gentle.Now that you're all set up, heed the second key to poaching eggs: Cook them gently. If your water is too hot (as in, boiling vigorously), the yolk and white might separate, leaving you with a poached egg that's not only ugly, but also unevenly cooked. No good!So as soon as the water is at a gentle boil, lower the bowl with the eggs into the pot, pulling it back once an egg as dropped in. Repeat with all of your eggs, then  immediately remove the pot from the heat and set a timer for 3 minutes. With the pot off heat, the eggs have an opportunity to cook undisturbed.Once your timer goes off, check the eggs: The whites should be firm, enrobing the liquidy centers—like sturdy water balloons or packing peanuts. If not, leave your eggs in there for a minute longer, until they're cooked to your preference. Remove them with a slotted spoon, then gently blot on a paper towel or clean dish cloth. This is important: Damp eggs will make toast soggy and grits watery.And that's all there is to it! Not so scary, right? All that's left to do is to get out a fork. You simply can't make poached eggs without watching the egg yolk dribble out—it's the law.Get the recipe:Frisée Salad With Warm Bacon VinaigrettePoaching eggs is one of those cooking techniques that's shrouded in mystery—but for no good reason! We have two tricks that will help you poach with confidence, even if it's the first time. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-21", "author": ["Condé Nast", "Sarah Jampel"]}