{"id": "2c10a72e36678b844ca2b2e037b1c5f0", "url": "https://www.bonappetit.com/story/best-new-restaurants-hot-10-2019-check-in", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "How the Best New Restaurants of 2019 Are Faring Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow the Best New Restaurants of 2019 Are Faring NowLast year’s Hot 10 have weathered the pandemic with resiliency, creativity, and grit. Here’s how each of them met the moment.By The Bon Appétit StaffSeptember 30, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.It’s hard to imagine that about a year ago we were crammed in a big warehouse in Brooklyn with 2,000 other food lovers, celebrating the Hot 10, America’s Best New Restaurants of 2019. Back then, Kopitiam was looking to expand to two more locations in New York City, and Khao Noodle Shop was planning to open a second restaurant in Dallas. Instead, a global pandemic brought the entire industry to its knees. No restaurant was immune, including the ones on our list. Restaurants were forced to close, furlough employees, figure out takeout and delivery, apply for confusing loans, and generally rethink how they operate not only to survive but to keep doing what they love. We always enjoy catching up with the Hot 10 family from years past, but now more than ever, we wanted to know how they were getting through these trying times.Photo by Alex LauNo. 1: Konbi in Los AngelesAkira Akuto, chef and co-owner: When the Hot 10 came out, we expected a big hit. Managing that demand was difficult. We have a small space, which is always crowded, but we’re used to that kind of problem-solving. That’s always been a thing for Konbi.When COVID-19 hit, we got PPP early (Editor’s note: PPP, the Paycheck Protection Program, is a forgivable loan that pays for payroll, rent, and utilities under specific conditions, like hiring back all employees. If those conditions aren’t met, then the loan needs to be paid back in two years). We were fortunate. We paid our people to stay home, while Nick and I decided to do maintenance work. With such a busy fall, the space was falling apart. Over the course of a couple months, we cleared the space, redid the floors, restructured the management system, and rebuilt the space as takeout only.Nick Montgomery, chef and co-owner: When we reopened in the first week of June, people were excited to have the foods they loved available again. It was nice to make people happy. That’s a big part of what we want to do at Konbi—bring joy.Service is one hundred percent takeout now. We hope we can bring back what Konbi was before, but we’re just fortunate to have our take-out window. We have online ordering, which we’ve never done before.AA: It was basically like opening a pop-up. We worked through it all theoretically, expecting to make changes once it actually opened. At this point we’re only down 8 or 9% from our numbers last year, which is definitely lucky.NM: Supply chain is tough, though. Deliveries are less frequent, and only half of the vendors are showing up at the farmers market. We have to keep more on hand at the restaurant, but we can’t plug in another fridge. We’d flip the breaker.AA: We’ve found the next level of limitations of Konbi. We maxed out storage. The menu is as big as it can be. If something new comes on, something has to leave.NM: But we’ve tried hard to not let the situation stop us from doing what we normally do.AA: Yeah, it’s been a lot of logistical stuff we’ve never thought about. But we’re open. I think that’s a big driver of Konbi’s success: We’re always willing to change. –As told to Alex DelanyPhoto by Alex LauNo. 2: Khao Noodle Shop in DallasDonny Sirisavath, chef-owner: 2020 was supposed to be an awesome year for us: We had lines out the door, collaboration events planned with other Hot 10 winners, and a new concept coming called Khao Len, which was going to be all about “playful food” from our childhoods, like ramen burgers and roti tacos.We had just started looking for a location when all hell broke loose. Like, you think you’re the No. 2 restaurant in the nation? Well, here comes COVID-19. Accolades don’t mean shit in a global pandemic. We shut down in March and quickly pivoted to a take-out model. We hadn’t done that before because dine-in was our whole thing: open kitchen, communal tables—it was all about the full experience. That all changed as we scrambled to figure out how to take orders, how to portion, how to travel. Initially, I was doing deliveries myself in my old classic Land Cruiser—my baby! I didn’t want to switch to an outside delivery service because they don’t care about the food. But now I’m using Favor [a Texas-based delivery platform] because I know each dish will get to customers fresh.We’re also selling dry goods, like our beef jerky and sauces, in our new Khaovenience Mart, along with imported Asian snacks and ingredients and fresh produce from local farmers. I feel like I’m my mom now, making and selling anything and everything I can think of, like a true immigrant. Finding a way to survive.There are days I’m super depressed and stressed-out. Some days we’re making as little as $100 in profit. We blew through our PPP loan and I don’t know how we’re gonna pay it back next year; our landlord was charging us half rent, but this is the last month before we have to pay in full again. That’s why we had to open up our patio, start doing dine-in again as safely as possible. It’s heartbreaking to see restaurants suffer like this. We need to pass the Restaurants Act or our industry is going to be a dying breed. I’m especially worried for the mom-and-pop restaurants. But I’m grateful for my team and my customers. My mom always taught me there are bumps in the road but you can’t go backward—you have to keep moving forward. It’s all you can do. –As told to Hilary CadiganPhoto by Emma FishmanNo. 3: Longoven in Richmond, VAPatrick Phelan, chef and co-owner: The Hot 10 recognition put a lot of eyes on us and the city of Richmond. A lot more people came; some people had never tried a tasting menu before. Like all restaurants, after October, we did this mad race to February, which is the end of the holiday season (Valentine’s Day). Then the pandemic came in March. We went from 110 mph to zero.We closed the restaurant and had to lay everyone off. We got PPP, and I jumped into advocacy once my good friend Steven Satterfield introduced me to the IRC (Independent Restaurant Coalition). We slowly survived; we started doing meal donations in May and other things, but at a certain point we were like, There is nothing worse than letting a restaurant sit. In June, we got a small team together, about seven of us, and put together a menu and began to offer a to-go experience as well as patio dining. Andrew [Manning, co-chef and co-owner] brought back his old concept, Brasa, a wood-fired grill pop-up. Meg [Fitzroy, pastry chef and co-owner] and Meredith [Herrera, pastry chef] started a bakery, Fitzroy & Herrera, out of the window by the pass. We leaned on our pop-up experience, so it wasn’t a big deal putting a menu together each week. It got us excited.If there is any silver lining in this pandemic, it’s been this opportunity to reflect. We’ve been thinking a lot about equity in the restaurant—what someone makes in the FOH compared to the BOH, the hours we all work. The pandemic has drawn back the curtains. So this time has been great to challenge the norms, structure, and hierarchy of restaurants. I have no idea what the restaurant will look like in the future and what the hell we’re going to do for winter, but if we can make it through this, that’s huge. –As told to Elyse InaminePhoto by Michael Graydon + Nikole HerriottNo. 4: Ochre Bakery in DetroitJessica Hicks, co-owner: We shut down right before it became mandatory in Michigan. Everything felt very insecure and the staff wasn’t comfortable. Then the schools closed. My husband [co-owner Daisuke Hughes] and I have two little kids and three businesses, which meant that it was basically impossible for us to remain sane and both work full-time. So we took it as an opportunity to really spend time with our family and reevaluate our priorities.Early on I was worried about the farming community; it was March so a lot of people had already bought crops for this year. But I talked with farmers about ways to survive without restaurants, and it turns out that because people were cooking at home more and not wanting to go to supermarkets, the direct-to-consumer relationships were working really well. That was a relief; it made me feel less pressure to reopen. And most of our staff were making more on unemployment then they would’ve working for us.For about two months we did a series of scaled-back Saturday pop-ups. They were scarily successful—having huge crowds of people lining up almost felt irresponsible. After George Floyd was murdered, we did a bunch of fundraising events; our staff would donate their time, and 50 percent of everything we made went to local organizations like the Detroit Justice Center and Detroit People’s Food Co-op.You know, I opened this bakery wanting to have a positive effect, but we felt like a mirage in a food desert. We weren’t accessible in the ways I wanted us to be. I don’t think there’s an easy solution when you’re trying to use good quality ingredients and pay people well—it’s complicated—but going forward we’re focusing on food security for our community and upping our employees’ quality of life.To do that, we’re becoming more of a grocery store with relaxed food options—no more plated made-to-order dishes. We’re limiting what we’re making so we can be more efficient. We’re selling in bulk to minimize labor and maximize affordability: organic lentils, big containers of olive oil, 50-pound bags of flour. If we have kohlrabi from the farm down the street, we’ll also provide recipes so people know what to do with it. We’ll still sell birthday cakes and dips and soups and sandwiches, but it won’t be as precious anymore, and we’ll offer day-old bread at reduced rates. We’ve applied to accept EBT cards, which means changing our offerings and upping the ratio of bread we sell to qualify.I’ve come to the conclusion that I don’t ever want to run a traditional restaurant again. Ochre has been magical, but it nearly drove me crazy—and I lost my appendix in the process. This pandemic has made me realize the importance of prioritizing space for life. In this industry it’s really easy to just get on that hamster wheel of working and not even realizing when you need to stop. But you do need to stop sometimes. You need to hold yourself accountable. You need to set boundaries. —As told to Hilary CadiganPhoto by Alex LauNo. 5: The Elysian Bar in New OrleansAlex Harrell, chef: Before COVID-19, we were rolling into the high season. From New Year’s Eve all the way into June, you have Mardi Gras, the French Quarter Festival, the Jazz and Heritage Festival, and very large university graduations, which all carry your business into the summer. In early March, we had just finalized our first spring menu change, and we were excited about the local produce coming in. Then we shut down.The entire staff was furloughed until we received our PPP loan. When everyone was back on payroll in June, we started doing takeout and contactless curbside pick-up for family-style meals. We had a little success, and we began offering outdoor dining. But once restaurants in New Orleans started doing cocktails, we had an uptick in cases, so the city shut booze service down. A lot of restaurants operate at a 60-40 profit split between food and booze, but for us—with such a big bar program—it’s more like 50-50. We definitely felt that hit, especially with the hotel being empty. The hotel has 71 rooms, and maybe 25 percent of business on weekends came from hotel guests. We really missed those guests.But the summer humidity and heat are disappearing, which brings more people out. The Saints are back to playing football. The city feels like it’s starting to come alive again. We’re still in phase two out of four, which limits indoor dining to 50 percent capacity without bar seating. Our staff looks at this as a new challenge. We all want to get back to cooking and serving the type of food we enjoy. The kitchen is excited again. Now it’s a matter of continuing to be smart and safe, keeping our fingers crossed, and doing our best. –As told to Alex DelanyPhoto by Alex LauNo. 6: Kopitiam in New York CityMoonlynn Tsai, general manager and co-owner: I remember the issue came out on a random Tuesday, in the middle of the week. Tuesdays are usually pretty mellow at Kopitiam, but that day we were just packed—it was like weekend crowds on a weekday. I remember feeling like it was a new beginning for the restaurant.Kyo Pang, chef and co-owner: We had to double up on a lot of the menu items we were selling: kaya toast, pandan chicken, things like that. On a regular day we’d have about 200 covers; after the Hot 10, we went up to more than 300 covers a day.We were thinking about ways to expand, so we checked out two new locations, one on the Lower East Side and one in Brooklyn. But because of COVID-19, all of that stopped. We didn’t even know what was going to happen with Kopitiam. The week after the citywide lockdown in March, we saw a drop-off of 40 percent.MT: At the time, getting 10 orders a day was a cause for celebration. Before the pandemic, we had reached the point where we felt like Kopitiam was growing legs, that we were toddlers now and that we could let go a little bit. But then when the pandemic hit, we had to furlough everybody.It was very important to us to take care of our team even as they were furloughed and distancing at home, because they had all been living paycheck to paycheck. I’m so proud that we were able to pay both our front- and back-of-house staff in full for a month before unemployment benefits started coming in. We did that entirely through sales, not through a restaurant fund. We started selling our coffee, merch, nasi lemak kits, anything we could think of. But people were so excited to find ways to support us that I think we did close to 500 percent of what we used to do in retail sales.Now, we’re slowly bringing back a few people to help us. I’m still at the restaurant every day, and then on Wednesdays [my partner] Yin and I operate Heart of Dinner. I’ve never played tetris with time so well in my life.The restaurant industry is generally very supportive, but receiving so much love and care from this community has been really inspiring. Without our government stepping in, I’m very scared for what will happen in the winter when all these grants are gone and it starts getting colder and things like food insecurity will only get worse. But I’m proud to see companies like Rethink Food pivoting so fast to support more people and all the industry coalitions like ROAR. The landscape is going to change for sure—a lot of restaurants [here in Chinatown] have shuttered permanently. It’s going to look so different, but we’re hopeful; Chinatown is really resilient. –As told to Christina ChaeyPhoto by Marcus NilssonNo. 7: Tailor in NashvilleVivek Surti, chef and co-owner: We had been open for about 10 months, and we were doing well, not killing it. But after the Hot 10 came out, our business doubled. We had a full dining room, 30 people at each of our two seatings. The whole room came to life. Every month was getting better and better.Then March came. A tornado hit Nashville on March 3; luckily we weren’t affected but many restaurants within a block of us were. We had to close because we lost power. A few days after we came back for service, on March 15, the mayor held a press conference about coronavirus and we suddenly got all these calls and emails about wanting to cancel reservations. On March 23, the stay-at-home order was issued.[Co-owner] Heather Southerland and I came together to figure out what to do. Our main priority was taking care of our employees. We kept all 11 on payroll (our PPP loan helped). We considered takeout, but we didn’t feel safe with people being in close quarters. Plus, the restaurant is more of an experience thing. So we took it week by week, watching what was happening to figure out the best time to reopen with the right processes in place.We reopened on August 6 with one seating at 7 p.m. that you reserved and paid for ahead of time. We sanitized surfaces before and after service, checked and logged the temperatures for every person who stepped in the building, and everyone wore masks. We shared our protocols with diners, but we also welcomed them like we always do and told them the story behind the dishes. One person who came said, “After four months, I feel human again.”This one-seating model allows us to take our time and focus on each dish; it feels like we’re reconnecting with cooking. That’s rewarding when you’ve spent a year being “go, go, go, go.” At the same time we’re able to continue providing a comfortable place for people and promoting South Asian-American food and first-generation cuisine. We don’t know what the future holds, but we’re sticking to what we do best. We have plans if that doesn’t work, but we’re hoping it does. –As told to Elyse InaminePhoto by Alex LauNo. 8: Le Comptoir du Vin in BaltimoreRosemary Liss and Will Mester, chefs and co-owners: As a restaurant, we’ve completely shifted gears. March 14 was our last night of service, and the next week was really crazy, like, “What the hell are we gonna do?” Our dining room is tiny, so we couldn’t do dine-in anymore, and we had to furlough everyone but Kelsey Martin, our sous-chef and baker.In those early days people were going hard, stocking pantries with booze, so we acted fast by photographing all the wine, putting it up for sale on our website, offering curbside pick-up. Selling off our inventory is what saved us. We built the business back up from there, working with more and more importers and distributors; making sandwiches with Kelsey’s house-baked focaccia; selling prepared foods like our pâté, imported products like tinned anchovies and French salt and really nice vinegars, and of course, wine—which we can get really wild with now that we aren’t so constrained by food pairings. In August, we shut down for two weeks, and a carpenter friend built shelves and a wine rack, which completely transformed our space. We’ve essentially become a shop—and it’s been enormously satisfying!After our BA feature last year, we got really busy. People would come for birthdays and special occasions, and because we’re so small, we’d get booked out a month in advance. Since COVID-19, we’ve become more of a neighborhood spot, more relaxed with people popping in for a sandwich and a bottle of wine. We’re building out a small patio in the back, which should open this fall. We’ll serve wine and charcuterie, and we’ll have a heater so we can keep it open year-round, like they do at cafés in France where people sit outside with blankets, smoking and drinking and enjoying each other’s company, no matter the temperature.COVID has forced us to make changes quickly, and that’s been terrifying, but it’s also given us a chance to stop grinding for a second, to think about how to thrive within these constraints. How to turn these changes into something sustainable. How to rebuild something that lasts but also has the ability to evolve. –As told to Hilary CadiganPhoto by Laura MurrayNo. 9: Matt’s BBQ Tacos in Portland, ORMatt Vicedomini, chef-owner: We couldn’t make enough food, especially after the Hot 10. There was a never-ending line. But in early March, everyone could sense something. We saw what was happening in Italy, and we didn’t know what the government’s plan was here. I started reaching out to the health department to ask about good protocols. Not to criticize them, but I got the sense that no one knew what the hell was going on. So we shut down, along with pretty much every other restaurant.I played a lot of video games. I stressed-out. I researched online ordering and built a new website and checked the news every hour. I paid for our employees PTO and health insurance during that month—we got PPP to help with payroll and stuff—but I realized we needed to open because of all the expenses.Around late April, we opened for online ordering only. For the first two weeks, we offered preset barbecue taco dinners, just 50 orders a day and spacing out pick-ups so every 15 minutes we had no more than five customers at a time. After that we transitioned to a more normal menu for breakfast and lunch, again only online orders and spacing out pick-ups.Since we’re a food cart, we’re built for to-go and social distancing. We’re doing about two-thirds of our normal volume, which I feel great about. We’ve brought back almost the entire staff. All things considered, we’re in pretty good shape. I could share with you the new juices that I’m making or the 5,000-square-foot warehouse I bought pre-COVID-19 that we’re still turning into a barbecue production kitchen, but that just doesn’t feel right. My only goal is to make it through the other side. –As told to Elyse InaminePhoto by Alex LauNo. 10: The Wolf’s Tailor in DenverKelly Whitaker, chef and restaurateur: We had a total shutdown on April 1, and the Wolf’s Tailor immediately went from being the busiest restaurant in our restaurant group to nothing. We weren’t super established, and our food didn’t travel well whereas our other restaurants held strong because people were already used to ordering takeout from there.When we reopened Wolf at the beginning of May, we only served tasting menus at $45 a head. Since we’re a small-format restaurant to begin with and we’re now only able to seat at 50 percent capacity, having someone take up a table to just have a Negroni doesn’t financially make sense for us.Now that we’re seeing more people who are comfortable coming in with small groups, we’re going to bring back our donabe, which have always been a big part of this restaurant. We’re going to have two heated tents outside all winter that can each seat four to six people, and it’s going to be like Colorado glamping with donabe, focusing on this one-pot meal with some sides.We also launched a grain mill and have started selling flour wholesale to chefs as well as to consumers all over the U.S. Five years ago we planted 200 acres of five varieties of heirloom grains with our farmers. I’m now sitting on 500,000 pounds of grains. At the beginning of the pandemic, we started selling a ton of flour at [our bakery and mill] Dry Storage. People would come in and buy 20 pounds at a time and we’d be like, “Um, do you have a restaurant?” and they’d be like, “No, I’m baking!” I think the whole sourdough bread craze that happened at the beginning of the pandemic is going to come back for the winter. We now sell kilo bags to the consumer, and I have a whole facility in Boulder where we mill flour for chefs.Right now, we’re thinking about how to have big conversations about the city of Denver. We’re in a pivotal election year, so through the end of the year our restaurant group is going to focus on some of these issues, such as rethinking our supply chains, which is why the grain mill is a big thing for us right now. And at least through the election, we’ll be running [our retail shop and restaurant] Brutø as an advocacy kitchen to host pop-ups from our chefs and friends in the industry. We went from questioning our existence altogether to starting the advocacy kitchen and a flour mill, and it’s been awesome to see our team get more excited than ever before about what we’re doing. –As told to Christina ChaeyExplore Bon AppétitRestaurantsChefsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-30", "author": ["Condé Nast", "The Bon Appétit Staff"]}