{"id": "2c1191f777370c0beec5845fa95f4b99", "url": "https://www.bonappetit.com/story/lunch-break", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "I Don’t Know If It’s Tuesday or Thursday, But I Know What I’m Doing at Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI Don’t Know If It’s Tuesday or Thursday, But I Know What I’m Doing at LunchClocks are melting Salvador Dali-style, but I'm taking an actual lunch break. By Aliza AbarbanelApril 19, 2020FacebookTwitterEmailIllustration by Martina PaukovaFacebookTwitterEmailSince going into isolation, my concept of time is hazier than a Grateful Dead show. I’m lucky to be able to work from home, but the lack of a commute, coworkers, or appointments has completely eroded any sense of routine. I’ve spent weeks stoically ignoring most of the unsolicited advice online about trying to keep your routine intact. (Sorry, but I’m not putting on pants and walking around the block each morning to mimic my commute.) I’d sit down on the couch to check my email and look up four hours later, dazzled with blue light and ravenous— then grab food and return to the same position for the rest of the day.So no wonder it feels like clocks are melting Salvador Dali-style. It’s time to make a change. While everyone else in my neighborhood seems to have taken up jogging, I’m taking an actual lunch break.In my days of office dwelling, I mainly used lunchtime to run errands or wade through my inbox while eating with my coworkers.  But now that those things are no longer an option, I'm trying a new approach. For my own good, I set an alarm for 1 p.m. (creatively titled “lunch”). I also literally called in some reinforcements: my mom, in LA. If you’re not already maxed out on screen-time, you should definitely give FaceTime lunch dates a try.Time zones get in the way of us actually eating lunch “together.” Still, it’s a good excuse to connect over a meal, even if I’m eating salad while my mom makes breakfast. I FaceTimed her a few days ago and we talked about the spring produce I’m waiting on in New York (which she’s had in California for weeks), the recipes we’re eyeing for the weekend, and my dad’s nascent-but-thriving sourdough endeavor. It felt familiar at a time when nothing else does.I thought about embracing other lunch-hour activities, like a daily 12 p.m. yoga livestream, but I had trouble sticking to a strict timeline. And, really, I just want to cook myself a hot lunch. Now, I finally have a routine: With Buena Vista Social Club on the speakers, I bloom spices for comforting pots of dal, turn leftover fish into tacos, and griddle way more than my fair share of quesadillas. Cooking has always been meditative for me, but it turns out that taking time out of my workday to turn off my brain and slice some onions is especially potent stuff.I don't always have time to cook a full meal in the middle of the day, but as the days get warmer, I’m going to try eating outside when I can.  There’s a shuttered restaurant on my corner, quietly waiting for the curve to bend, with a few benches in front perfect for perching with a PB&J. Maybe I’ll call my mom and show her the cherry blossoms.Explore Bon AppétitHealthyishLunchCoronavirusSelf CareessayRead MoreCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomBy Phillip PicardiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-19", "author": ["Condé Nast", "Aliza Abarbanel"]}