{"id": "2c1daa50b7ff7ad02e8a6ea4422c08b7", "url": "https://www.bonappetit.com/recipe/summer-corn-rice", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Summer Corn Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSummer Corn RiceBy Hana AsbrinkJuly 18, 20215.0(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Kay BoytsovaEmailPinterestPrintEmailPinterestPrintThis easy, delicately flavored Japanese-style dish is the perfect way to showcase fresh sweet corn when it is in season. Short-grain sushi rice gets cooked with corn (including its cob!) in water that's been infused with kombu and soy sauce, creating a sweet and savory springboard for all sorts of summer meals. There are so many simple ways to enjoy it: alongside a fresh salad, miso soup, or grilled meat; mixed with a dab of butter and topped with shredded shiso leaves; sautéed with butter and more soy sauce as a quick fried rice; shaped into onigiri (rice balls) with flaked cooked salmon tucked into its center. This recipe is easily halved, and you can also make it in a rice cooker.—Hana AsbrinkAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan with Lid$39 At AmazonMesh Sieve$13 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWooden Spoon$6 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonIngredients4–6 servings2cups sushi rice1ear of corn1Tbsp. soy sauce; plus more for serving (optional)1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt15x3\"piece dried kombuUnsalted butter and toasted sesame oil (for serving; optional)PreparationStep 1Soak the rice. Place 2 cups sushi rice in a medium bowl and pour in water to cover. Rinse rice, swishing around with your hand. Drain and repeat two to three times until water is mostly clear (it doesn’t have to be crystal clear, just not cloudy). Cover with fresh cold water and let sit 30 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Meanwhile, prepare the corn. Shuck 1 ear of corn, then place horizontally on a cutting board. Cut off kernels with a chef’s knife, rotating cob as you finish each side. Stand cob upright and using the back of the knife, scrape cob to release corn juices and starch (a.k.a. the milk) from cob onto kernels. If cob is too long to fit in your pot, cut in half.Step 3Drain rice. Combine rice and 2¼ cups water in a small Dutch oven or large saucepan. Stir in 1 Tbsp. soy sauce and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, then place corn, corn milk, cob, and one 5x3\" piece dried kombu on top of rice. Press to submerge in water. Cover pot with a tight-fitting lid and bring to a boil over medium-high heat, 6–8 minutes (listen for it). Reduce heat to low and continue cooking (still covered) 15 minutes more. Remove from heat and let sit, covered, 10 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Remove lid and pull out cob and kombu; discard. Fluff with a rice paddle or wide wooden spoon, mixing corn and rice together. (If you happen to get a light golden crust on the bottom of your rice—enjoy it!) Serve warm, topped with a small pat of unsalted butter and drizzled with toasted sesame oil and more soy sauce if desired.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Summer Corn Rice?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI've made this recipe twice now. The second time I cut back on the soy sauce a little.\nThis a great way to appreciate the fresh sweet taste of summer corn.  IMO I don't think it needs the butter and sesame oil to finish it off.  It's so good the way it is!!Mardy MRolling Hills Estates, CA8/23/2021Very simple and delicious. This recipe makes a LOT of rice. I wish it had specified how much yield you should expect from your corn. The cobs I had were on the smaller side, so I used two and I'm very glad I did. In fact, I might have used even more. I was surprised that the kernels stayed nicely crunchy, and not overcooked at all. The butter is a nice addition and the sesame oil is good, too -- but I felt it turned the dish into something different. Without it, I appreciate the corn flavor much more clearly.AnonymousKansas City7/27/2021Explore Bon AppétitJapaneseEast AsianAsianCornVegetableKombuSeaweedOther IngredientsRiceRice & GrainsSummerEasyWeeknight MealsSideVegetarianDairy-FreeVeganSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-18", "author": ["Condé Nast", "Hana Asbrink"]}