{"id": "2c1edd65fc429068906df6a2d3d53c48", "url": "https://www.bonappetit.com/recipe/thai-tea-ice-cream", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Thai Tea Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSwirled No-Churn Thai Tea Ice CreamBy Sarah JampelJuly 17, 20194.1(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe hardest part of this recipe is tracking down Thai tea mix (or waiting for it to arrive in the mail)—but it’s worth it. Tantalizingly vanilla-y and deeply spiced, it dials back the sweetness of the ice cream. And you’ll go through any leftovers quickly: Brew, pour over ice, and stir in sweetened condensed milk.IngredientsMakes about 8 cups2½cups heavy cream, divided½cup Thai tea mix (such as Pantai)1tsp. vanilla extract1⅓cups sweetened condensed milk (from one 14-oz. can), divided½tsp. kosher salt, divided½cup roasted, salted peanuts, very finely choppedPreparationStep 1Bring 1½ cups cream to a bare simmer in a small saucepan over medium-low heat. Add tea mix, stir to combine, then remove from heat and let steep 30 minutes. Strain through a fine-mesh sieve into a glass measuring cup, pressing to push out all of the liquid (you should have about 1 cup; it’s okay if there are flecks of tea leaves). Chill until cold (use an ice bath to speed up the process, if you wish).Step 2Beat vanilla, ⅔ cup condensed milk, ¼ tsp. salt, and remaining 1 cup cream in the bowl of a stand mixer fitted with the whisk attachment on low speed until combined. Increase speed to medium-high and continue to beat until the whisk leaves trails and you have soft peaks and a beautiful, billowy mixture, 2–3 minutes (you can also do this with hand-held beaters and a large bowl). Transfer to a large bowl, then use a rubber spatula to gently fold in peanuts. (It’s okay to leave big streaks of nuts!)Step 3Pour chilled Thai tea cream into mixer bowl (no need to wipe out). Add remaining ⅔ cup condensed milk and ¼ tsp. salt. Beat on low speed until combined. Increase speed to medium-high and continue to beat until mixture looks just like the first one, 4–5 minutes. Be careful not to overbeat, as it can quickly go from creamy to grainy.Step 4Scoop mixture into bowl with vanilla base, then gently fold the two together in just a few strokes so that you have big ripples of each. If you fold too many times, you’ll lose the swirls (but don’t worry; the flavor won’t suffer!). Transfer to a 9x5\" loaf pan; smooth top. Cover with plastic wrap and freeze at least 6 hours.Step 5Let ice cream sit at room temperature 5–7 minutes, then use an ice cream scoop dipped in hot water to distribute scoops among bowls.Step 6Do Ahead: Ice cream can be made 1 week ahead. Keep frozen.Photo by Chelsie Craig, food styling by Kat BoytsovaHow would you rate Swirled No-Churn Thai Tea Ice Cream?Leave a ReviewTell us what you thinkReviews (13)Back to TopTrianglePerfect, refreshing, rich and delicious.\nMade recipe as is and don't think it needs tweaking.  \nTo get as much cream after steeping, I pressed tea leaves well against the sieve. You do loose about 2 Tbsp cream but you can make up the difference with plain heavy cream, or use as is and it works fine.  \nCan't wait to make this again.LynnPetaluma, CA8/1/2021Other reviews say this ice cream is too sweet--honestly, I thought the sweetness was right, but that it was SO rich. I only wanted to eat a little bit at a time. This feels to me like both a good thing and a bad thing: the flavor and texture were marvelous--just a little bit... much. I wonder how I would even go about toning down the richness the next time I make it. Suggestions are welcome!AnonymousSt. Louis, MO10/15/2020I would cut back on the amount of Thai Tea used in the steeping process. The heavy cream wanted to stick to the tea leaves and not go through my strainer. Besides that technical note, the flavor is great and texture is nice and creamy for being a no churn ice cream. Anonymous7/24/2020Wow, this was absolutely fantastic. I did everything with a hand whisk, and it turned out perfectly. Yeah, it's extremely sweet, but I followed a previous commenter and added salt more liberally (and toasted the peanuts!) and it balanced things out nicely. It's a unique summer indulgence.AnonymousNew York City6/29/2020This recipe was AMAZING. In response to other reviewers commenting that it was too sweet, I made one change that I think was essential. Instead of cutting down on the sweetened condensed milk- which seems to be essential for the texture- I used fine grain Himalayan pink salt as a replacement for regular salt. I also roasted and salted my own peanuts (out of necessity) using the same salt. I feel that using fine grain in equal measurement helped distribute the salt better throughout the cream. The result was a creamy, salty sweet delight with a pleasant calming spice from the tea. Really unlike any ice cream that I have tasted.joielevivrePittsburgh, PA6/5/2020This is such an exciting ice cream! Followed the recipe, using coarse kosher salt.  Substituted the peanuts for crushed Nutter Butters and an extra punch of salt, since we didn’t have any peanuts.  Wow! Would definitely recommend this combination. The cookies add the needed salt and crunch to break up the sweetness and creaminess of the rest of the ice cream. AnonymousPortland, OR6/1/2020I was really looking forward to trying this recipe however it was far too sweet (and I have a sweet tooth!!). It was a tad less sweet the next day and the day after that so it was a bit more bearable to eat. I will make this again but will reduce the condensed milk by half. Don’t skip the peanuts as it balances out the sweetness and adds a fantastic texture (I grounded the salted peanuts in a mini food processor). AnonymousManhattan, NYC4/21/2020Because most reviews said the recipe was too sweet, I cut the condensed milk in half and subbed for evaporated milk. I think this affected the texture a bit (it took a long time with a hand mixer to get the vanilla to the desired texture, and impossible to get the thai ice cream mixture to the fluffiness it was supposed to be)...regardless, it wasn't too sweet for me with these adjustments! The peanuts were nice, but I think if you want peanuts either get them unsalted or half the salt (1/4 tsp total). A little too salty for me. AnonymousBerkeley. CA4/10/2020I cut the sweetened condensed milk in half, since the comments all said it was too sweet. But the resulting ice cream kind of had the texture of styrofoam.\nAnonymous3/10/2020Way too sweet :( After trying to eat it a couple times I ended up throwing out the rest because it was making me feel a bit sick and my boyfriend wouldn't touch it. On the positive, I tried making thai iced tea with the leftover tea mix and that's been such a great discovery! Better luck next time..AnonymousSan Francisco, CA8/12/2019Definitely got a good strong Thai Tea flavor from this! If I make it again, I want to sub out some of the sweetened condensed milk for regular evaporated milk. The sweetened condensed milk does make it very sweet and somewhat affects the texture, bringing in some syrupiness. AnonymousTennessee8/11/2019I love Thai iced tea and the flavor was spot on, however I found it way too sweet. Important to note I excluded the peanuts because I am not a huge fan of peanuts, and I wonder if this may be the culprit to the overwhelming sweetness; maybe the salt in the nuts was supposed to balance out the sweet. So I will only consume my batch in small scoops at a time, and if I make this again I will try to use the peanuts.\nOtherwise, the texture of the ice cream was perfect--smooth and creamy, the taste was strong and deep like Thai tea, and it was beautiful too with the swirls of orange. So if you choose to make this without the nuts, just be aware it may turn out exceptionally sweet.always-hungryLong Island, NY7/30/2019Hello guys i tried this but the tea taste wasnt strong enough and the part where i was straining the thai tea cream through the sieve was really difficult (yield was much less than one cup of cream)..is there a chance i can extract the thai tea using evaporated milk instead?Anonymous7/29/2019Explore Bon AppétitIce CreamFrozen DessertDessertThaiSoutheast AsianAsianEasy5 Ingredients or FewerGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-17", "author": ["Condé Nast", "Sarah Jampel"]}