{"id": "2c22301ae6c4a207593207e2658026f2", "url": "https://www.bonappetit.com/story/3-ways-we-love-to-refuel-for-the-new-year", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "3 Ways We Love to Refuel for the New Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Ways We Love to Refuel for the New YearWith the last glow and glitter of the holidays like a flicker in our rearview mirrors, the new year is the time to establish new, healthy routines and ways to make ourselves feel balanced. Whether you have an urge for a serene workout on your yoga mat, a burst of energy to hike and climb, or a moment to sit and re-center for your upcoming week—the fuel you give your body should be the very best. Here are a few ways we like to eat clean, get active, and stay present at the beginning of a brand new year.By LarabarJanuary 4, 2018FacebookTwitterEmailFacebookTwitterEmailNama-Start the Day the Right WayThe alarm goes off, and your morning needs a jump start before you make your way onto your mat. To help you get into the flow of your next yoga or Pilates class, start with seven simple ingredients from LÄRABAR. Made with almonds, sprouted chia seeds, honey, maple syrup, coconut oil, cinnamon, and sea salt, the LÄRABAR Maple Cinnamon Nut & Seed Crunchy Bar is a simple and tasty way to start your day.Yes, You Can Climb Every Mountain!Ok, you’re ready to clip on the carabiner and get climbing—but even the most avid adventurer could use a little sustenance to prepare. For a delicious snack on your way to the top, grab the LÄRABAR Original Chocolate Chip Cookie Dough and enjoy the creaminess of cashews and richness of Fair Trade Certified™ chocolate chips. With only four ingredients (cashews, dates, chocolate chips, and sea salt), it’s something you can feel good about packing for your day of scaling rock faces and climbing to your next peak.Sit Back, Relax, and Enjoy a Well-Deserved TreatEven the most active folks among us need a little time for R&R. (Rest and relaxation, for those who need a little nudge.) Yes, even while you’re kicking back after a day of activity to take some “me time,” make sure you relax with something simple and flavorful. LÄRABAR Caramel Sea Salt Bites are truffle-like bites made with only seven ingredients to satisfy your sweet craving. You’ll taste the natural sweetness of dates, almonds, maple sugar, dried coconut, coconut flour, sea salt, and vanilla extract in each perfect morsel. Go ahead, have another.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast"]}