{"id": "2c2c83dfbb736ab0252ee713a1831c82", "url": "https://www.bonappetit.com/story/pizza-party-right-now", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "How to Have a Pizza Party Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Have a Pizza Party Right NowFive pies, two ovens, one stoop.By Christina ChaeyAugust 1, 2020FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish friends,I miss restaurants in general, but I especially miss restaurant pizza: beautifully puffy, too hot to eat immediately, with big, charred bubbles that shatter at the touch. And if you’ve ever made DIY pizza, you know it’s...very-hard-to-impossible to recreate it at home.But as long as you’re not trying to turn out Roberta’s-quality pies, pizza night is simple enough to pull off (on a weeknight, no less!)—you just need a plan and a few staples. Here’s how a group of friends and I went about it on a recent Tuesday night.The first issue was figuring out the dough, which I was more than happy to pass to my friend Alex, an extraordinary home bread-baker. She slow-fermented a batch of sourdough pizza dough, then shaped the dough into five small pies and par-baked them until they were firm but not quite cooked through. And then she somehow figured out how to stack all the pies on top of one another and bike them over to my stoop. Hero.Meanwhile, I cranked my own oven to 500°F so that I could get the pies in the oven as soon as I finished topping them. I thawed some extra pizza sauce I’d frozen when I cross-tested Sarah Jampel’s new Vegetarian Pan Pizza With Lots of Greens, which is a great, not-scary baking project to take on if you conquered your fear of yeast by making Basically’s No-Knead Focaccia. (You could use either recipe to make the dough for your own DIY pies.)Just look at those bubbles.\nPhoto by Christina ChaeyOur friend Zach brought an assortment of toppings (black olives, mushrooms, spicy soppressata, arugula, ricotta) that I combined to make four different pies, plus a side of garlicky breadsticks. Each pie got a drizzle of good olive oil, grated parm, a few grinds of black pepper, and a sprinkle of crunchy Jacobsen Salt Co. flakes. (I keep a Chef’s Jar in the pantry and set a tiny bowl of it out on my counter for everyday use.) As the pies came out of the oven, I cut them into big slices and slid them onto sheet trays to bring out to the stoop.Some pie inspo for ya:Pie #1Tomato sauce + mozzarella + sautéed mushrooms + thinly shaved garlic cloves + big chunks of torn jarred artichokesPie #2Tomato sauce + grated parm; after pie is cooked, top with mature arugula + mixed soft herbs (e.g. fennel fronds, dill, basil, parsley, mint) tossed with lemon juice, olive oil, salt and pepperPie #3Tomato sauce + mozzarella + spicy soppressata + black olives + thinly shaved white onion; after pie is cooked, top with torn fresh basil + grated parmPie #4Ricotta seasoned with lemon zest, juice, salt and pepper + chopped preserved lemons; after pie is cooked, top with chopped fennel fronds + drizzles of honey + Xi’an Famous Foods chili oilGarlic breadsticksBrush a mix of melted butter + grated garlic + chopped parsley onto one pie sliced into long breadsticks; sprinkle breadsticks with grated parm and bake at 350°F until warmed through and crisp.Happy DIY-ing,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishRead MoreLifestyleHow I Get My Smoothies So GoodBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-01", "author": ["Condé Nast", "Christina Chaey"]}