{"id": "2c2f0950ba20e2d66a2c77d9d0ee429a", "url": "https://www.bonappetit.com/story/trade-coffee", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "I Get My Coffee Mailed To Me And It's 100% Worth It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Get My Coffee Mailed to Me and It’s 100% Worth ItEach time a bag of beans from Trade Coffee arrives, it’s like a little caffeinated gift.By June KimFebruary 22, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The happiest moment of my day is at 7 a.m. when I wake up, stumble into the kitchen, listen to the buzz of my Breville Barista Express as it powers on, and brew a perfect cup of coffee. It’s the way I love to start my day, a sacred morning ritual that is for me and only me. I had my coffee- making system down pat, but I'd often run into a very unfortunate issue—I'd go through all the preparations of making my morning coffee only to realize I was out of beans. Big groan. Would I have to drag myself to a grocery store for a mediocre bag of coffee beans? Would I default to buying cold brew from my local coffee shop for the third day in a row? My routine was dialed in, but running out of coffee beans became the one recurring hiccup to my near-perfect morning.This cycle of torture finally ended a few years ago, when my husband casually mentioned that he had signed us up for a coffee subscription called Trade Coffee, a service that would deliver freshly roasted, ethically sourced bags of coffee every few weeks right to our doorstep. (It also happens to be one of BA’s favorite coffee subscription services.) We took a curated quiz online to share how we make our coffee, the type of roast we typically prefer, our experience with making coffee, and our taste preferences. A few days later, the first shipment arrived—a brightly colored bag from Red Rooster Coffee in Floyd, Virginia. It was a medium roast blend with sweet notes of berry and undertones of chocolate, and it was delicious. I also learned that Trade Coffee is dedicated to sustainability—their coffee bags are biodegradable and some of their partner roasters compost their coffee bean chaff with local farms—and passionate about community. The company pays careful attention to sourcing and ethical prices directly to farmers and roasters. I was completely sold—high-quality coffee I can feel good about!Trade Coffee SubscriptionShop Now at Trade CoffeeA few weeks later the next bag of coffee arrived. The Flatlander Signature Blend from PT's Coffee in Topeka, Kansas is medium bodied with hints of citrus and a toasty, nutty finish—an absolute delight of a way to start my morning. Since then, I’ve gotten 54 bags of coffee delivered to our home, and truly, I’ve never received a bag of coffee I didn’t enjoy. When I open the front door and see that little red package containing the next surprise bag of coffee, it feels like a small act of self love—and now, my perfect morning coffee routine is in fact, perfect.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-22", "author": ["Condé Nast", "June Kim"]}