{"id": "2c3cb388db94e660ffcdcf45334c5686", "url": "https://www.bonappetit.com/recipe/pilaf-with-vermicelli", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Pilaf With Vermicelli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssuePilaf With VermicelliBy Nadia OwusuJanuary 12, 20214.8(49)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintWe developed this recipe with Aftershocks writer Nadia Owusu, inspired by her memories of childhood meals with her Armenian-American mother (you can read her beautiful essay about a shared meal here). The dish gets its wonderful nutty flavor from toasting dry pasta in copious amounts of butter, a method used in pilaf traditions across communities, including in the Armenian diaspora, Syria, and Lebanon.Ingredients4 - 6 Servings4Tbsp. unsalted butter2oz. angel hair pasta or vermicelli, broken into 1\"–2\" pieces (about ¾ cup)1½cups basmati or other long-grain white rice, rinsed well2¼cups low-sodium chicken broth or waterKosher saltPreparationMelt butter in a large saucepan over medium heat. Add pasta and cook, stirring often, until golden brown and very fragrant, about 4 minutes. Add rice and gently stir to coat in butter. Add broth and a big pinch of salt, increase heat to medium-high, and bring to a simmer. Stir once, then cover and reduce heat to low. Cook until broth is absorbed and rice is tender, 18–20 minutes. Remove from heat, uncover, and fluff rice gently with a fork. Cover and let sit 5–10 minutes before serving.How would you rate Pilaf With Vermicelli?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleBoth my mom and grandmother would make this version of pilaf, simple, buttery and delicious. The only variation in the process was to reserve 3/4 of the vermicelli (I’ve been using fideos) to add to the rice AFTER cooking, to add a little crunch.\n\nThat was how my Armenian great grandmother made pilaf, from the town of Adana in Southern Turkey (Anatolia).\n\nGrowing up, this rice would be paired with most meals, but my favorite was lamb shish kebab …nothing we loved more was that lamb, (ONLY lamb on the skewer), skewers of charred tomatoes and peppers, and a piping hot, heaping spoon of this rice (and some lavash or pita)… every Memorial Day, this was the meal that would end our summers and begin our school years.\n\nAh, the wonder years :)\n\nMaking this pilaf right now!GreekArmenianGarden City, NY1/1/2022Mom would make it as we were kids, We all loved itCraig OSan Jose Ca12/26/2021Pilaf with vermicelli... the San Francisco treat. Anonymous2873212/21/2021Love this rice. Super easy to whip up. Kids adore the buttery flavor and always eat it up. I like to experiment with different spices when making this, but the way the recipe is written is fabulous. Mother of FoolsLas Vegas2/11/2021My Egyptian grandmother would make this rice for me anytime I visited her (she'd make the chicken stock herself by boiling a whole chicken in seasoned water). A good addition are a few (5 or so) cardamom pods, when making it myself I've added ground cardamom instead and it gives a similar flavour. I've had success with all sorts of straight noodles in this dish- since switching to a gluten free diet (due to Celiac disease) I use gluten free spaghettini which toasts up just fine. I normally use parboiled rice, but basmati rice also works. shiranaottawa, on2/4/2021Ingredients are the same...amounts may differ, using low-sodium broth vs. regular broth is a choice, and perhaps the preparation may change slightly; however, recipe is definitely the same recipe handed down from my Grandmother who survived the1915 massacres and immigrated to the US with 2 young sons.  Her great grand children are now making it - basically the same.JackieColorado1/20/2021I made this because of the very enthusiastic reviews. But I was very disappointed. Frankly, Rice-A-Roni is much better. I won’t make this again.Fran LoveLafayette CA1/19/2021This is the best rice dish I have had in my entire life ... I have been making the exact dish since 1976 when a friend in LA showed me how to make it. Everyone I have ever served it to also loves it.  But this is the first time I have ever seen the recipe written down. I have normally used coiled Fedelini, which is impossible to find anymore, but is just coiled angle hair, and i broke it up into little sticks as I browned it!Bob PFolsom CA1/16/2021Beautiful and delicious. My Syrian/Lebanese American mother still makes this wonderful dish at age 96 and it is as good today as it was when her mother made it when we were children. It is also very good if you add caramelized onions, or pine nuts browned in butter to the top before serving. \nThe author’s story was filled with hope and healing. Thank you for sharing this most personal life journey.JamieNewport, NY1/16/2021This is, like others who have commented, the very same recipe MY mother used. She was not Armenian but rather an Eastern European Jew who fled the Nazis in 1939. I am so impressed and moved by Nadia’s story of her reconciliation with her mother and identified their connection through this oft passed down recipe. My mother has been gone for many years now but I will reconnect with her the next time I prepare pilaf.Micki SchneiderSan Diego, CA1/16/2021I cannot believe my EYES! My great grandma Maritza Soorsoorian passed this down to her daughter (my grandmother) who passed it down to my father and mother and then to me. This was (and is still) my favorite meal growing up. I would get so excited when my mom said she was making pilaf. I would always see “Rice Pilaf” on menus on restaurants and at stores and would always be very confused about it looking a any other way than this. THIS is the way to do rice pilaf! Maybe shorter vermicelli/pasta noodles and a pinch of fresh squeezed lemon, but this is the most familiar sight I have ever seen when reading the words “rice pilaf”. Thank you for publishing this. So many of my community feels seen because of this. Thank you. Blow away!!Maritza HamiltonMaryland1/15/2021I have been fixing \"Pilaf\" for 45 years. I hated when I would see pilaf on a menu because I knew it was the Armenian way.\nI also use fine egg noodles and real butter. I also will add a chicken or beef bouillon cube to change the flavor a bit.Lynda WilsonFountain Florida1/15/2021This was yummy - so much better than the box stuff. Any chance Nadia would be willing to share the other recipes mentioned in her piece? Susannew london, ct1/12/2021This is a very good recipe. I am another who has been making pilaf for over 50 years using a recipe from my Armenian grandmother. We do a couple of things differently from your recipe -  we stir the rice into the pasta (or fine egg noodles),  before adding the broth and let it cook for a few minutes, stirring occasionally - the rice will plump up a bit, giving it a deeper flavor.  Once done cooking, we let it rest in the pan for 15 minutes. Janet1/12/2021I too have been making pilaf for more than 50 years. The broth should be boiling before adding it to the rice and noodles. Turn down the heat to low at this time. Stir with a fork and cover. Continue with rest of recipe. PattiDayton 1/12/2021Explore Bon AppétitPilafArmenianMiddle EasternRiceRice & GrainsEasyWeeknight MealsQuickSideVegetarianNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Nadia Owusu"]}