{"id": "2c3d27159b4022a9c7c88a6b9c6aaf4f", "url": "https://www.bonappetit.com/story/kwame-alexander-fried-chicken", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "My Mother's Fried Chicken Was a Link to My Past—and My Daughter's Future | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Mother's Fried Chicken Was a Link to My Past—and My Daughter's FutureFrying chicken right is like riding a bike backward. Or writing a sonnet. It's hard, sometimes elusive—but in the face of loss, it can also be life-giving.By Kwame AlexanderMay 25, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by D'Mytrek BrownFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.The last meal I shared with my mother was in a capacious hospital room in Chesapeake, Virginia. It was breakfast time and the sun was a carefree soul galloping through the window like a wild horse. Having not eaten much in the 48 hours since she’d been admitted with complications of sarcoidosis, she was quite hungry. So I fed her. Spooned the applesauce. Placed in her mouth a few ice chips from the water glass she couldn’t finish (crunching ice always gratified her). That was 2017. The year my heart broke into a million jagged puzzle pieces.None of us is ever prepared for death. When a great tree falls, the birds, with no branch to perch on, scatter. Looking for a new home. In the four years since my graceful mother has passed, I’ve been searching. Thumbing through old scrapbooks, sprinkling her ashes in places we lived and traveled— Brooklyn and St. Croix and Fayetteville, North Carolina—all in an effort to find some solace. To find a new home.In 2018, when the American School in London invited me to become its inaugural Innovator-in-Residence, I welcomed the opportunity for that solace, along with a professional reboot. I’d gotten into a writing rhythm that, while successful, felt almost too comfortable. The process of coming up with a beginning, middle, and end was akin to riding a bike for me, and I could cruise through a story, arms akimbo, head to the wind. I needed to challenge my storytelling normal, become inspired in new and exciting ways, learn to pop a wheelie.Part of moving yourself forward in a life-giving way is to take the things from the past that have helped shape and mold you and use them as anchors to the future. My own vision of what lay ahead came during two farewell dinners hosted by friends in the summer of 2019. First, award-winning children’s book illustrator Melissa Sweet crafted homemade lobster rolls the size of my arms in her palsy-walsy Maine home. Then I drove south to dine alfresco—grilled snapper, cheddar biscuits, Summer in a Bottle rosé—in celebration of Jacqueline Woodson’s latest novel at her family’s country estate. These two women not only burned in the kitchen, but laughed and told stories and answered phone calls and helped with homework and listened. At the same time. With the cool and calm of a river flowing in a forest. Just like my mother used to do. Determined to do the same, the new Kwame would find his way home not only by moving to London but by cooking.In my first few weeks there, I figured out how to catch a bus to Maida Vale, write at an outdoor café while sipping English breakfast tea, and take refuge at the bottom of the London Library when it rained. I also learned to make some pretty tasty pasta—fettuccine Alfredo, spinach lasagna—that my finicky 11-year-old daughter, Samayah, actually enjoyed.As the weeks turned to months, I discovered the best walking route to Samayah’s new school. I learned how to listen and acknowledge her cries for independence and smile when she grabbed my hand and held it, our fingers braided like the cornrows her mother designed. I learned how to answer her not-so-random questions about why can’t we get a car or do you have to walk me the whole way or can we have a break from pasta… and make Granny’s fried chicken for dinner?“If you read good books, when you write, good books will come out of you,” wrote Natalie Goldberg in Writing Down the Bones. Thus, I imagined, if you read good cookbooks, good food would come out of your kitchen. So I immersed myself in a plethora of cooking primers, instructional videos, and blogs. I cooked daily while listening to music, helping Samayah with homework, and just being in the moment. My recipe file fattened. Some meals turned out delicious the first time: Fish chowder. Ghanaian red red. Lobster mac and cheese (which almost didn’t happen ’cause lobster meat in London is more expensive than beluga caviar). Others required experimentation: Tuscan bread salad. Blueberry scones. Beer-battered fish. Unfortunately, my buttermilk pancakes looked, and tasted, more like crepes. Fortunately, my daughter loves crepes. But she also loves chicken, and she kept asking me to make it.During my adolescent summers, my mother often took us to Virginia Beach where we’d spend the day building sandcastles, swimming too far out, and screaming bloody murder when we got bit by a jellyfish. Two things loom large in those memories. One was this: As hungry as we were from playing in the water, we hated getting out of it for lunch because of my mother’s belief that one must wait 30 minutes to swim after eating (or face severe cramps due to lack of blood flow to the stomach and thus drown). The other: Once you bit into one of my mother’s crispy, juicy fried chicken drumsticks, the complaining stopped. She charmed us.Until she was five, Samayah was a vegetarian—until we sent her to my mother’s for her own summer weekend. As the story goes, Granny packed the three visiting grandchildren into her burgundy Hyundai one Saturday morning and carted them off to Virginia Beach for a day of swimming and sandcastles. Around midday she summoned each of them from the water and handed out brown paper bags full of chicken. When Samayah came home I understood the resoluteness in her smile. “Daddy, I’m not a vegetarian anymore.”Fried chicken was one of my mother’s signature dishes, as it was my grandmother’s, and her grandmother’s before that. Now that I wanted to continue the tradition for my daughter in my modest London kitchen, I needed the recipe. So I called around to my sisters, my aunts, even my father (who only ever lovingly made two dishes, mustard mac and cheese and tad-too-bland baked chicken). But I got the same answer from each of them: There is no recipe. They simply used a little bit of this and a little bit of that and cooked it until it was done. These reveals were often followed by joyous remembrances of picnics and Sunday dinners and family reunions, and every now and then I’d get a clue: Barbara had that cast-iron skillet. Your grandmother used Crisco. The paper bag? They say it’s to better coat the chicken, but we only used it ’cause Momma used it. Garlic powder. Paprika. And don’t forget the oil has gotta be hot!This is how I began putting the pieces of my puzzle back together again. I’d go to the butcher down the block and buy six wings and two breasts one day, four thighs and five legs another. Try to remember my mother in the kitchen—her fingers covered in flour, her jubilant singing filling the room, her seasoned spirit. Imagine and reimagine the ingredients in her brown paper bag. See her placing the chicken in her pan, allowing each piece room to breathe. And every time I cooked, I felt a little bit closer to her, perched on a branch of her life.Frying chicken right can feel like riding a bike backward. Or writing a sonnet. It’s hard, sometimes elusive. But there is a form to guide you, and with practice you can find the flow. For me it took a dozen tries, and yet the ecstatic look on my kid’s face when she bit into that twelfth and final chicken wing was worth the wait. She got what she’d asked for. So did I. Through cooking I’d reunited with my mother, forged a powerful kinship. It was life-giving.This one beautiful life is a series of puzzles. If you’re fortunate you get someone to show you how they fit together. If you’re really lucky, when they’re gone, you learn how to let their memory guide you, hug you, gather you. So that when you get sad and unsure—because this new puzzle seems undoable—at least you have the precious memories to feed you while you put the pieces back together and find your way home.Get the Recipe:Barbara’s Picnic Fried ChickenIt took poet Kwame Alexander twelve tries to recreate his late mother’s perfectly crispy-juicy fried chicken. Luckily, he wrote down the recipe for you.View RecipeKwame Alexander is the poet-in-residence at NPR’s ‘Morning Edition’ and cocreator of a Disney+ series based on his Newbery Medal–winning novel, ‘The Crossover.’Explore Bon AppétitAll on the TableFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Kwame Alexander"]}