{"id": "2c3d499a7f84335df5778c4b106b359d", "url": "https://www.bonappetit.com/story/how-to-make-fresh-ricotta", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "How to Make Fresh Ricotta So That You'll Never Be Without | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Fresh Ricotta So You'll Never Be Far From CheeseForget “love”: All you need is milk, acid, and salt.By Jarrett MelendezFebruary 18, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Some of my strongest cravings have hit during the worst possible times—like when my partner and I were snowed in and we just HAD to have lasagna. Naturally, we were missing ricotta, and there was no way we were making it to the store. Now, I know there’s some talk about whether ricotta even belongs in lasagna, but that’s how my mom always made it, and it’s how I make it most of the time. So for us lasagna wasn’t happening without it.Fortunately, ricotta is shockingly easy to make. All you need is milk, some kind of acid, like vinegar or lemon juice, and salt. That’s it. No, really!Having never made our own ricotta before, we didn’t know what to expect. We hoped that it might work. That it would be fine. Passable. Edible? We definitely didn’t expect that it would be so beautifully textured, utterly flavorful, and an instant staple that we would never, ever buy grocery store ricotta again.We ended up eating so much of it while it was still warm that we almost didn’t have enough for the recipe. The lasagna that was my reason for living a mere hour earlier became a distant memory the second that fluffy, salty, bright, fresh cheese hit our mouths.We used an entire gallon of milk for our first foray into ricotta making, and that blessed us with piles of cheese that rivaled the snowdrifts in the yard. Fortunately, this recipe is easy to scale up or down—the method below makes just over a pound of ricotta pretty reliably. It’s also a really great way to blow through milk that’s close to, or just past, its best-by date.Here's how to make fresh ricotta:To make about 1 pound, pour 3 quarts whole milk (avoid ultra-pasteurized), ¼ cup white vinegar, and ½ teaspoon kosher salt into a large, heavy-bottomed pot over medium heat. You can subtly change the flavor by choosing different acids: Lemon juice will give it a hint of lemon, while plain white vinegar won’t alter the flavor too much. I highly recommend experimenting with different acids—my partner has gotten really into making his own vinegar, and his pumpkin-beet vinegar made for a really interesting ricotta.Bring the mixture to the absolute barest simmer you can, adjusting the heat as necessary—the mixture should be steaming, but not bubbling. If you have a thermometer, 180–185° is the sweet spot but 10° in either direction will still net you some tasty cheese.Once you reach that temperature range, maintain it for about 25 minutes without stirring—we want big fluffy curds, and stirring will break those up. You’ll notice the milk start to separate pretty early and curds will start forming throughout the heating process. Remove from heat, and use a slotted spoon to scoop the curds into a colander double-lined with cheesecloth. Resist the temptation to dump the curds and whey from the pot to the strainer—doing this will clog the cheesecloth and drastically increase the time it takes to strain. Different draining times will result in different textures and moisture levels—I find that letting the ricotta sit in the lined colander for about 30 minutes is right for most applications, i.e. pizza topping, lasagna/manicotti/ravioli filling. If you, like me, just want to eat it by the spoonful or spread onto toast, 5–10 minutes is plenty. Once you’ve harvested your curds, don’t toss that whey down the sink! Use it in smoothies, a replacement for water in bread recipes, or even to make stock or boil grains.Try your fresh ricotta in salad, incorporated into ricotta gnocchi, or spread on slices of toasted baguette with a little lemon zest, olive oil, and freshly cracked black pepper. Whatever you plan on using your fresh ricotta for, plan on making more than you need—that first “quality control” taste test never stops at just one spoonful.Jarrett Melendez is a graphic novel writer and former cook living in Boston with his partner Stuart, and their collection of plush pigs.If you've got it, flaunt it:1 / 65ChevronChevronCantaloupe with Sugar Snap Peas and Ricotta SalataView RecipeExplore Bon AppétitIt's That SimpleRicottaCheeseMilkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Jarrett Melendez"]}