{"id": "2c41a5c6af2d1955085a39d4cdf513d7", "url": "https://www.bonappetit.com/recipe/grilled-bacon-blts", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Grilled Bacon BLTs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueGrilled Bacon BLTsBy Deb PerelmanAugust 13, 20193.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintWhen Smitten Kitchen’s Deb Perelman decided to make BLTs for her family, she vowed not to mess with them. There’s white bread and full-fat mayonnaise. There isn’t kale in place of iceberg. Definitely no turkey bacon. “A perfect BLT is a pure and delicious thing that I wanted my kids to experience properly, especially since we only have them a couple of times a year.” Grilling the bacon helps stretch the summery vibes into fall, and as a bonus you’ll save your kitchen from a greasy mess.Ingredients4 servings½cup mayonnaise1½tsp. (or more) Sriracha1lb. thick-cut bacon (thin strips have a tendency to get burnt and overly crisp)8½\"-thick slices white sandwich or Pullman bread2ripe medium beefsteak tomatoes, cut into thick slicesFlaky sea saltFreshly ground black pepper½head of iceberg lettuce, leaves separatedPreparationStep 1Prepare a grill for medium heat. Stir together mayonnaise and Sriracha in a small bowl. Taste and add as much Sriracha as desired to meet your preferred level of spiciness.Step 2Arrange bacon strips across grate and grill until lightly charred around the edges, 5–7 minutes. (Flare-ups are common, so lower the lid if needed and carefully raise just to check doneness.) Turn bacon over and grill until browned and crisp, about 4 minutes. Cooking times can vary significantly based on how thick your bacon is and the heat of your grill. (If you’re grilling bacon for the first time, keep a close eye on it and check often.) Transfer bacon to paper towels to drain.Step 3Arrange bread on grate and grill until toasted, about 30 seconds per side. Transfer to a cutting board.Step 4Spread Sriracha mayonnaise over 1 side of each slice of bread. Season tomatoes with salt and pepper, then build sandwiches with lettuce on the bottom, tomatoes in the middle, and bacon on top (tear lettuce leaves and cut bacon in half to fit nicely if needed). Close up sandwiches and slice in half on a diagonal.Step 5You can also serve this as a BLT buffet: Arrange toast, bacon, tomatoes, and lettuce on platters with Sriracha mayo and salt and pepper alongside and let everyone make their own.Photo by Alex Lau, Food Styling by Susie TheodorouHow would you rate Grilled Bacon BLTs?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSince we've already gone out of the box with siracha mayo I'll do me. Pure mayonnaise, absolutely add avocado, beef steak tomato, thick bacon, lots of iceberg all on top of sliced sourdough. Glencrest Hills 3/4/2020Bosh!  A BLT without avocado is hardly worth eating.  And you should substitute aioli for the mayonnaise.  A BLAT sandwich without garlic?  Heresy!  As to white sandwich bread when cuomo or ciabatta is available?  Have you no shame?The banks of the Willamette8/24/2019Explore Bon AppétitSandwichAmericanBaconCured MeatMeatIceberg LettuceLettuceLeafy GreensVegetableTomatoSummerFallQuickEasyWeeknight MealsDairy-FreeNut-FreeGrillingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Deb Perelman"]}