{"id": "2c4bac4a58599cb961cfc1db0740f736", "url": "https://www.bonappetit.com/story/frankie-and-jos-vegan-ice-cream-shop-seattle", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "The Vegan Ice Cream That Made Me Actually Like Vegan Ice Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Vegan Ice Cream That Made Me Actually Like Vegan Ice CreamThis Seattle scoop shop makes an exceedingly creamy version, with not an ice granule to be found.By Priya KrishnaSeptember 10, 2019FacebookTwitterEmailPHOTO BY AJ RAGASAFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I was skeptical when my friend Khushbu first told me about Frankie & Jo’s, a mini ice cream shop chain in Seattle. “Vegan ice cream but not terrible,” her text said. Vegan ice cream is usually an immediate pass for me. It’s chunky, icy, and dense. But after giving it a try this past summer, I’d go so far as to say that Frankie and Jo’s not only wasn’t terrible—this ice cream changed me!The Capitol Hill shop is small, with minimal décor. That’s okay. You’re here for the frozen stuff. The base incorporates cashews and coconut milk, making the ice cream exceedingly creamy. You can run your spoon right through it, with not an ice granule to be found. There are all sorts of interesting flavors too—brown sugar vanilla, chocolate tahini—but the one you must try is salty caramel ash, a mildly sweet, jet black scoop flavored with burnt vegan caramel, coconut oil, vanilla extract, and sea salt. If you’ve ever had salted caramel flavored anything, this is nothing like that. It’s better. More subtle. You can taste the inherent richness of the base, the intensity of the vanilla, and the slight smokiness of the caramel. And we haven’t even talked about the waffle cone! Made with maple syrup, oat flour, and flax seeds, it is crunchy with just the right amount of bendiness and chew. You’ll want to eat it like a cookie.I visited at least a half dozen ice cream shops during that short trip to Seattle (you’ve got to respect a city where it is cold most of the year, yet there is an ice cream shop on every block). All of them dairy-based, mind you. And yet, after all that, it’s the vegan option that I can’t stop thinking about. Life sure is wild sometimes.Go there: Frankie & Jo’sExplore Bon AppétitHighly RecommendSeattleIce CreamRead MorerestaurantsThe Hype Ice Cream I’m Willing to Wait in Long, Near-Rioting Lines ForBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "Priya Krishna"]}