{"id": "2c50ccc53edfa06d6c04f78074d9b065", "url": "https://www.bonappetit.com/story/mexican-food-greatest-cuisine", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Why Did It Take a White Chef to Pique My Interest in My Own Mexican Culture? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureWhy Did It Take a White Chef to Pique My Interest in My Own Mexican Culture?My path to becoming a Chicano taco expert was paved with internalized racism. But now the food I grew up rejecting is my greatest passion—and my career.By Javier CabralFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel ShepardFacebookTwitterEmailI still trip out about the person I’ve become: a food writer with an expertise in Mexican food, especially tacos. Tacos are my life. I live and breathe them and spend all day figuring out ways to get people excited about them. I just co-wrote a cookbook on Oaxacan home cooking; I am the editor in chief of L.A. Taco, an indie publication dedicated to celebrating the taco lifestyle; and I curated all the tacos featured on Netflix’s Taco Chronicles.But half my life I preferred any cuisine other than Mexican food.I never wanted to eat my mother’s cooking. Her spongey chicharrón en salsa verde; her soggy chilaquiles, made the traditional way with leftover tortillas; her extra-garlicky salsas hiding in old margarine containers; her stinky unpasteurized cheese, gifted by loved ones who’d just returned from trips back home. Those wheels of chile-washed funk were as good as gold, but all I wanted was a slice of American cheese.I filled up on a fast-food circuit instead, eating at a different chain every day after school. Personal pan pizzas with extra cheese from Pizza Hut on Monday. Greasy brown bags of curly fries and tacos from Jack in the Box on Tuesday. Plain hamburgers at McDonald’s on Wednesday. And so on. The school system aided the habit, rewarding me with free vouchers for these places just for showing up (I never missed a day).The rest of my family always told me I would regret skipping my mother’s meals when I was older.Both my parents were born in Zacatecas, Mexico, and moved to East Los Angeles in the early ’60s, as part of the first waves of rural Mexican migrants in the city. They both had to work as children to survive, so they dropped out of school in third grade. Without knowing a lick of English, my dad opened an upholstery store, sharing the space with my mom’s thrift shop.Her cooking was the food my parents ate when they didn’t have anything else, but now they had something else. My palate came to signify the next phase in their assimilation: the child who chooses bland American staples over the cuisine of his heritage.A seven-year-old Javier at Disneyland.\nPhoto courtesy Javier CabralThat all began to change once I became a teenager. My universe opened and new interests came charging in: Crust punk, weed, and a new appreciation for global cuisine.I traded Jack in the Box for pho, dumplings, banh mi, falafel. And when I couldn’t afford them, I’d walk into every restaurant and collect their take-out menus to study on my long bus rides home. I started watching cooking shows on PBS like Simply Ming, How to Cook Everything, and America’s Test Kitchen. When I was 14 I saw my first episode of Rick Bayless’s Mexico One Plate at a Time.Watching a white chef from Oklahoma make things like sikil pak, a Mayan pumpkin seed salsa,  on public television was a revelatory experience. It was the moment I understood that Mexican food was worth celebrating. That it was vibrant and diverse and had value. It was then that I learned to love my first bowl of black beans. That I fried my first plantain. That I invested in understanding the wide world of Mexican cuisine. And that I began to write about it. I launched my own food blog to document my thoughts and people started reading my posts, commenting on them, engaging with them. I got my first paid article writing about tamales for the now-defunct LàTeen magazine. I was 16 years old.Why did it take a white chef to pique my interest in my own culture?Internalized racism can be so quiet you don’t even know it’s there until it’s too late, when something inside you ruptures. It can make you believe that your culture is lesser, that your food is unhealthy, that it is cheap, that it is so dirty it can unleash something as forbidding as “Montezuma's Revenge.” It can also convince you that only the blessings of mainstream white culture make it worthy.If I could go back in time, I would tell my spoiled-brat kid self to go ahead and make a meal out of tacos de frijol because that is the dish that made your parents strong. That it’s the dish that built entire empires. That you can thank Mexican food for cacao, corn, tomatoes, vanilla, and chia. Combine these indigenous power foods with the Old World force of Spain via mestizaje, and it’s no wonder why there’s an entirely new subculture dedicated to the Taco Life. Hell, there's a taco emoji, and it sits right between two staples of the American diet: french fries and a plate of spaghetti.It shouldn’t have taken me this long to understand that. But it did. And now the rest of the country is catching up. We are in the midst of a taco awakening. White chefs, brown chefs, immigrant chefs, and third-generation chefs are taking Mexican cuisine to unprecedented heights. There’s $20 carnitas, vegan al pastor, hamachi-filled chiles rellenos—a brave new taco world unfolding in front of our eyes.And now it’s my responsibility to say who deserves the limelight. Whose cooking matters. What chefs deserve the attention. To remind you why you shouldn’t complain about the bill at a nice Mexican restaurant, when you probably wouldn’t think twice if it were Italian or French.And yes, my family was right, I do regret not eating my mother’s meals. And while I can’t change the past, I can honor her cooking by continuing to push regional flavors and their makers forward.Mexican food is the best cuisine on the planet, dammit. And I don’t need anyone else to help me justify why.Javier Cabral is the editor in chief of L.A. Taco, associate producer for The Taco Chronicles, and the co-author of Oaxaca: Home Cooking From the Heart of Mexico. Follow his never-ending taco rager at @theglutster.Want More Stories From Taco Nation? Right This Way...In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsWhy Korean Tacos Are Margaret Cho’s American DreamCooking in the Midst of a Border Crisis Is About More Than SurvivalAnd so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Javier Cabral"]}