{"id": "2c54684b1dcd0097c1cfc16d91d6c0a5", "url": "https://www.bonappetit.com/story/sana-javeri-kadri", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Sana Javeri Kadri of Diaspora Co on Why You Should Buy Better Turmeric | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle\"I'm Not a Woo-Woo Wellness Ayurvedic Yoga Instructor Selling You Turmeric\"Sana Javeri Kadri wants a lot more out of this sought-after spice than a trendy latte.By Priya KrishnaJanuary 17, 2019FacebookTwitterEmailPhoto by Prarthna SinghFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.Sana Javeri Kadri distinctly remembers the first time she tried a turmeric latte in the U.S. It was the summer of 2016, she was commuting to her old job in marketing at San Francisco’s Bi-Rite Creamery, and she spotted it on the menu at a local café. “It was disgusting,” she recalls. “They used way too much turmeric. They had added it to make the drink bright yellow without giving any thought to making it delicious.” She threw the latte in the trash.“I dismissed the turmeric trend as silly,” she says now, sitting in the living room of her pastel-colored house in Oakland, surrounded by clear encyclopedia-size bags of the vibrantly hued spice. “I was like, ‘This is going to go away really quickly.’” But it didn’t. Soon enough turmeric was on countless coffee shop menus and in the pages of glossy food magazines, praised as a miracle spice for its nutritional benefits. “I realized that, clearly, something was happening,” she says.Sana Javeri Kadri, a 25-year-old Mumbai native with bouncy blackish-brown curls and a bubbly voice, is the founder of spice company Diaspora Co. Her house, which she shares with her girlfriend, Rosie Russell, and their rescue dog, Lily, doubled as the headquarters of the business at the time of my visit and, thanks to all that turmeric, smells perennially of earth.It’s a sunny, cloudless morning, and Javeri Kadri offers me something to drink. She quickly clarifies that she doesn’t do turmeric lattes. “I have never made one in my life,” she says proudly. This is because, like many Indians, she associates the combination of turmeric and milk—also known as haldi doodh—with sick days.Instead, she sets about whisking matcha and water in a small bowl, pouring it into two glasses lined with maple syrup and adding rice milk and ice. It’s delicious, like a pot of melted green tea ice cream. While I sip, I ask Javeri Kadri how business is going. She tells me that when the company launched online in August 2017 with essentially no advance marketing, all the turmeric sold out in three hours. The irony here is palpable: The very drink that Javeri Kadri refuses to make, that she hated so much when she tried it back in 2016, made her business wildly successful from the start.Javeri Kadri handling turmeric at Chavan Brothers Masala, a family owned spice shop and local grinder at Lalbaug Market in Mumbai.\nPhoto by Prarthna SinghLong before Diaspora Co., Javeri Kadri had been interested in the single-origin food movement—companies that responsibly source ingredients, like, say, coffee or cacao, from a particular grower. “I saw how these people were taking a crop where there is injustice and a lack of transparency and solving a problem,” she says.In India, many aspects of the food industry have been similarly whitewashed—particularly the spice trade, which relied on enslaved people to grow, harvest, and transport goods during European colonization 200 or so years ago. “It was completely scrubbed out of Westerners’ consciousness that you should care about your spices and where they come from,” Javeri Kadri says. “It was to the benefit of colonizers to not say that this comes from slave labor.” While colonization is long gone, a similar supply chain persists. The vast majority of the money from spice cultivation goes into the hands of corporate food companies and various middle men (auctioneers, processors, wholesalers), while farmers in India aren’t fairly compensated.As she watched the popularity of turmeric grow throughout 2016, Javeri Kadri asked a few owners of American spice companies if they knew exactly where their product was coming from, but no one was able to give her a precise answer. So in early 2017 she moved back to Mumbai and visited the Indian Institute of Spices Research in Kozhikode, Kerala. What she found was that the most popular varietal of turmeric sold in the U.S.—Alleppey turmeric—wasn’t actually a varietal at all. It was the name of a vacation destination in southern India favored by Europeans during colonization. “They decided that all turmeric that met a [certain shade] and size would be Alleppey turmeric,” Javeri Kadri explains. “Any indigenous knowledge of local varietals and nuances had more or less been stamped out.”Meanwhile, the Indian Institute of Spices Research had been seed-saving scientific varietals of turmeric that were aromatic, brightly colored, high yielding, and high in curcumen—the ingredient that gives the spice its anti-inflammatory and antioxidant properties. But those varietals didn’t exist on the commercial market. So Javeri Kadri decided she would work directly with Indian farmers—eliminating all of the middle agents—and export these turmeric varieties herself.Getting the business set up was not easy, even for an India native like Javeri Kadri, who speaks Hindi, Gujarati, and Marathi. She had to file unending paperwork with the Spices Board of India, spend months going back and forth with farmers to understand the cultivation process, and educate herself on the complex Indian laws governing exporting spices.Javeri Kadri also had to contend with being a queer woman in a country where women are still not afforded equal rights as men, and gay sex was illegal until this September. “These farmers have never seen anybody like me,” she says, and many of her partners in India tell her that she is the first woman they have ever done business with. She also hasn’t directly come out to any of her Indian colleagues for fear that it would jeopardize her fledgling business.Turmeric being processed into a powder at the Lalbaug Market market.\nPhoto by Prarthna SinghDiaspora Co. now has two full-time and four part-time employees and primarily sells pragati turmeric, an heirloom varietal with a high curcumen content. You’ll find the modern, playful pink packaging everywhere from Third Culture Bakery in Berkeley to the sleek Indian all-day café Pondicheri, which has locations in Houston and New York and sells T-shirts that say “Keep Calm and Curry On.” Twenty percent of her business is selling to these restaurants and shops, while the other 80 percent comes from her online store.She just published Diaspora Co.’s first zine, Cooking with Gold, which includes recipes for coffee with turmeric and ghee and “millennial face gunk” (a turmeric-based scrub that Javeri Kadri swears by). She sells Diaspora Co. tote bags, whose bright color is an exact match with the turmeric (“You don’t even want to know how much effort went into making that happen,” she says). Of her approach to branding, she says: “I was adamant about saying that I am not a woo-woo wellness Ayurvedic yoga instructor selling you turmeric. I am a queer woman of color who is a supply-chain nerd selling you turmeric.”Back at Diaspora HQ, finished with her iced matcha, Javeri Kadri wanders into her small kitchen to make us some eggs fried in ghee. She lays the sizzled eggs over a leftover batch of pinto beans and ham hocks and sits down to eat. She loves cooking in this hybridized, not-strictly-Indian way.That said, she has complicated feelings about the way in which turmeric has suffused mainstream American cuisine, from wellness tonics to soups to salad dressings, and how health junkies are treating the spice like a new discovery.  “I wish I could show you the messages I get from women who tell me how their chakras are in sync and Ayurveda has saved their soul,” she says with a sigh. And despite the fact that the coffee shops she sells to keep offering her turmeric lattes, she hasn’t changed her mind about the drink.On the other hand, Javeri Kadri reasons, “If people are paying a premium for my turmeric so I can pay the farmers the best price possible, I don’t really care what they do with it.” Eventually Javeri Kadri wants to build a sustainable supply chain that can be applied to other spices, like cardamom and cumin, and then to crops like rice. Colonialism ruled India for so many years, she says. “We just don’t know how to separate ourselves from that.”But food, Javeri Kadri believes, can be a powerful means of changing this mentality. “It’s world domination, our way.”Explore Bon AppétitThe Healthyish 22HealthyishTurmericSpiceessayRead MoreLifestyleHow Wellness Influencers Made Indian Food a TrendBy  Khushbu ShahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Priya Krishna"]}