{"id": "2c59cfece87fa721484885cfc09f1235", "url": "https://www.bonappetit.com/story/glacce-bottle", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Testing the Glacce Bottle With a Big Chunk of Rose Quartz in the Middle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Drank From the $80 Crystal Water Bottle. Here's My Story.I never thought I was the type to drink out of a rose quartz water bottle until there I was, drinking out of a rose quartz water bottle.By Rachel Sugar September 27, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIn I Did The Thing, Rachel Sugar sacrifices her time and her sanity in the name of wellness \"research.\" First up: the $80 Glacce bottle that ate Instagram.I am not a crystals person. I have never owned a crystal. I have never wanted to own a crystal. Once, in elementary school, we grew sugar crystals, but then we ate them. That is as close to crystals as I have come. And, yet, in this strange age in which even reasonable, non-Gwyneth people are dabbling in spiritual rocks , I have become increasingly aware of their existence.And then I found the water bottle.I was perusing my favorite source of vagina eggs, the GOOP web store, just to see what I might be into if I had much more disposable income and were also someone else. And there it was: the Glacce water bottle. The Glacce water bottle is like a regular water bottle, only it’s glass instead of a lighter, more practical material, and it has a giant crystal in it, which, the website explains, is to “infuse the water with positive energy.” Most of what I’d read about crystals has focused on how I should integrate them into my “spiritual practice,” which sounded daunting because I don’t have a spiritual practice. As I understood it, though, the water bottle just required me to drink water.There are five different crystals to choose from, and the company suggests you use “your intuition” to see “which bottle you are most drawn to.” I liked the pink one, on account of how it was pink. According to Glacce (like “lace,” but with a G first), rose quartz is “the stone of unconditional love,” and helps harness “the feminine energy of compassion, love, peace, tenderness, healing, and nourishment.”A few days later, the package arrived, and I let it sit on my desk, unopened, for three days. A thing to know about this water bottle is that it costs $80. That is a huge amount of money for a bottle, even if it does have a very large crystal in it. (Technically, the crystal is removable.) And so what? People buy luxury goods all the time. It’s a problem, but because gross income inequality is a problem, not because there is anything inherently unworthy about luxury water bottles. (And this water bottle is very nice.) My concern, I decided, was that this was not just a regular $80 water bottle, but a bottle that was promising to do something I worried it couldn’t actually do. This would be a good time to mention that there’s no scientific evidence to suggest that crystals have any innate healing properties at all.To be fair to the bottle, it didn’t make any of the claims I find particularly alarming about the wellness industry. The accompanying copy did not promise to “detoxify” me. There was no discussion of ambient “inflammation.” It did say something about healing—“each crystal possess its own unique frequency known to help with certain ailments & enhance desired qualities in one’s life”—but that felt comfortably non-specific. It wasn’t suggesting that drinking crystal water, which, in crystal-talk, is called a “crystal elixir,” would cure my headaches or fix my anxiety or make me nicer to my mother. Or, at least, it wasn’t exactly claiming any of that. But I still couldn’t tell you exactly what it was claiming, except that it had to do with positive energy, or maybe it didn’t, and so I called Sharon Leslie, who co-founded Glacce with childhood friend Julia Schoen, and who was very, very patient with me.The instructions for the bottle suggested I might want to charge my crystal by meditating with it. To do that, Leslie explains, I could pick an intention for my crystal, and then really focus on that intention while holding it. That way, my focused, intentional energy could be “transferred” into the crystal, and the crystal, in turn, would transfer it into the water. Like, right now, she’s on a business trip, so she’s been drinking from the rose quartz, because it reminds her of self-love and self-discovery. “Every time I see this pink beautiful little quartz, I think, ‘Okay, my intention is to focus on being good to myself. My intention is to work on communicating more clearly and to be more present.’”In my apartment, I set a timer for five minutes and fondle my rose quartz with my eyes closed while trying to imbue it with soothing thoughts. “I will probably be okay!” I think. “I am reasonably competent!” Then I think sappy thoughts about people I love. Then I wait for 51 more seconds until the timer beeps.Over the next several days, I walk around Brooklyn sipping from my Glacce. Unlike most water bottles, it is neither light nor durable. It is 1.16 pounds empty. It is made of glass. Using the standard metrics of water bottle success, it fails. For the first week, I am terrified I am going to trip and break it. Also I am terrified I am going to run into someone I know. I don’t want people to think I’m the kind of person who drinks from $80 crystal water bottles!, I think, drinking from my $80 crystal water bottle.By week two, though, the water bottle is the only thing I can talk about. I love it, and I don’t know why. Leslie and Schoen grew up using crystals; for them, the idea that the stones have power is “kind of like second nature to us.” I don’t think my water is spiritually different, and, still, I’m really into this bottle. It does give me a sense of control and well-being. I do feel feminine, or, at least, like an Instagram influencer, which is kind of the same thing. I like how pretty the bottle is. I am both thrifty and practical, but the bottle is neither. It is not just nice, but stupid-nice. For the first time, I understand why someone might spend several thousand dollars on a tote bag.As the Glacce founders see it, the aesthetics of the bottle is part of its power. “Beauty plays a role in the healing process,” Leslie says. “It’s part of why we go out in nature.” Beauty brings joy, and joy inspires presence, and, according to the website, “the more present we can be, the more gracefully we allow our bodies to heal, the more bliss we experience, and the deeper we can feel this form of gratitude, the more magic we welcome into our everyday lives.” Maybe I care about that on a subconscious level. On a conscious level, I think: Nice things are really nice.I’d been nervous, talking to Leslie, to broach the whole lack-of-science thing, but she brings it up first. “My cousin sent me this article today that was really cool, about the placebo effect in relation to crystals,” she says. Published in Time last fall, the article looks at a small study—one of the few on healing crystals—that showed that people who meditated with crystals reported feeling similar crystal-induced sensations, regardless of whether the crystal in question was real or a fake. What mattered, the study suggested, wasn’t the crystals themselves; it was whether the subjects believed in the crystals.If crystals only have power because you think they do, isn’t that still a kind of power? Yes, but maybe a fraught one, according to Dr. Jen Gunter, the Bay Area OB/GYN and noted critic of the wellness industrial complex. Her concern isn’t just that the placebo effect can “lead people with serious illnesses to postpone effective medical care,” she writes, although that is also true. Her concern is that the wellness industry is fundamentally built on “medical conspiracy theories”—a mistrust not just of doctors, but of the concept of evidence-based science.I still don’t believe in crystals. But, still, every time I sip from the bottle, I see the crystal, which reminds me that I’m trying to be calm and generous and less generally freaked out, because I decided it would. “Like a rubber band that reminds you not to bite your nails!” I told my boyfriend, “but about my personality!” (I still bite my nails.) You don’t need a crystal for that, of course. You could use a chunk of granite. But the crystal, well, like Leslie said, it’s pretty. It looks cool.“We are doomed to aspire for the rest of our lives,” concluded Taffy Brodesser-Akner, in her recent New York Times Magazine opus explaining GOOP’s cult of wellness. “Aspiration is suffering. Wellness is suffering. As soon as you level up, you greet how infinite the possibilities are, and it all becomes too awful to live without.”But my standards are very low. I am still so far from the highest peaks of wellness. I have made no further life changes since the bottle and I have not been tempted to. And, yet, I like it.Buy it: Glacce Crystal Elixir Water Bottle, $80All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishI Did the ThingTrendsRead MoreLifestyleThere's a Crystal For That: A Highly Specific GuideGallery7 SlidesBy Lilli ShermanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-27", "author": ["Condé Nast", "Rachel Sugar"]}