{"id": "2c5b1cd9ffec8684a7d0ee21495bcb9b", "url": "https://www.bonappetit.com/story/welly-bottle", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "This Insulated Water Bottle Keeps EVERYTHING Icy Cold | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Water Bottle Keeps EVERYTHING Icy ColdEven when the subway platform is a million degrees, my hibiscus sun tea is perfectly chilled.By Aliza AbarbanelJuly 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Have you ever sipped ice-cold cucumber water on the beach, the sun heating the sand to a sultry 98 degrees? Or drank hibiscus sun tea on a subway platform so humid, it feels like standing in a mouth? Trust me: There is no greater pleasure. And when it's as hot as it's been in New York this summer, Welly’s insulated bottle is my best weapon.Its BPA-free bottle is made from lightweight (but sturdy) bamboo, with a wide mouth to easily accommodate ice cubes or cucumber spears. The double-walled vacuum insulation is designed to keep drinks cold for 24 hours and hot for six hours—while I’ve never tested it for this long, I've never had a problem with lukewarm liquids in this bottle.When the temperature dips below 70 degrees, I fully plan on using the removable infuser to brew tea on the go. But for now I’ll be filling my Welly bottle with something cold and delicious. And if the mood strikes to pour in a little rosé sangria, no one will be the wiser —Aliza Abarbanel, assistant editorBuy it: Welly Bamboo Water Bottle, $30All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThe Perfect Glass for Morning Espresso and Evening Pét-NatBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-27", "author": ["Condé Nast", "Aliza Abarbanel"]}