{"id": "2c5f7a908e62be2eb8ce6d48beae3614", "url": "https://www.bonappetit.com/story/best-things-added-to-pantry-2018", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "The 16 Best Things We Added to Our Pantry This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 16 Best Things We Added to Our Pantry This YearWe made space for new go-to grains, and found new ways to spice up weeknight meals.By The Bon Appétit StaffDecember 27, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIs there anything less inspiring than the idea of a “pantry staple”? Think about it: By its very nature, they’re the most ordinary, quotidian, unspecial stuff you could possibly keep around. But it doesn’t have to be that way. This year, in an attempt to keep things exciting in our kitchens, we added some new tricks to our fridges and cupboards. We’re talking flavor bombs like an umami-rich fish salt and a smoky-hot spice, toasty sesame seeds to amp up dressings and salads, and nutty, toothsome wheat berries to give your usual go-to grains a rest. Sure they’ll be a whole new crop of things to fall for in the new year, but we’re still psyched about these goodies.Red Boat Fish SaltI love Red Boat’s fish salt, which is made from just anchovies and sea salt. It’s saved me more than once when I’ve run out of the tinned stuff. Add a pinch to Caesar dressing or fish stew, mix it to make anchovy-salted butter, or stir it into olive oil and make croutons. —Amanda Shapiro, senior editor, HealthyishBuy it: Red Boat Fish Salt, $15 on AmazonJacobsen Flaky Sea SaltAbout six months ago I finally got around to buying flaky sea salt, namely Jacobsen sea salt, for cooking at home (I already had a stash at the office). Once I finally got it, I never looked back. I showed my roommate the ways of the flaky sea salt too, and now we both use it on everything from eggs to roasted veg to meats. —Emily Schultz, social media managerBuy It: Jacobsen Hand-Harvested Pure Flake Sea Salt, $30 on AmazonEden Foods Toasted Seasoned Sesame SeedsDoes anyone toast their own sesame seeds? I doubt it, and untoasted sesame seeds are mostly a waste of time. Toasting brings out the flavor, and yet most nuts and seeds in supermarkets aren’t optimally toasted, including the ones that claim they are. The one exception is toasted sesame seeds, sometimes labelled gomasio, which I started keeping on hand this year. They are cheap and crazy flavorful and so nicely toasted—they don’t have any of the charred spots I get when I do them in a skillet on the stovetop, totally pissed I’m toasting seeds on Tuesday night. It’s easy to sprinkle them with abandon on salads and vegetables, or blend them into dressings. —Chris Morocco, senior food editorBuy It: Eden Foods Toasted Seasoned Sesame Seeds, $3 at VitaCostBob’s Red Mill Wheat BerriesWheat berries became my grain of choice this year. I love how nutty and chewy they are—cook ‘em like pasta and they stay especially al dente. I’m convinced they turn what might otherwise be a sad whatever’s-left-in-my-fridge salad into a meal actually worth looking forward to. —Sasha Levine, senior editorBuy It: Bob’s Red Mill Wheat Berries, $9 on AmazonPhoto by Max FalkowitzBlack Urfa ChiliThe spices now available to us home cooks are better than ever. New companies selling single-origin, direct-trade spices are popping up left and right, and I want to try them all. But the one I obsessed over in 2018 was Black Urfa Chili from Burlap & Barrel. I’ve been sprinkling it on every snack I make—from eggs to hummus to cucumbers doused in rice vinegar—and cooking with it too, adding it to braises and sauces. If you know Aleppo-style pepper, Black Urfa will seem similar, but it’s smokier and sweeter, and the burn lingers longer. I’m in love. —Anna Stockwell, senior food editorBuy It: Black Urfa Chili, $9 at Burlap & BarrelMarumoto Neri Black TahiniI use black tahini in place of regular tahini when I want a more intense sesame punch. It’s woodsier, smokier, mustier, and a little more bitter, and great in hummus, baba ghanouj, or sesame noodles. I also use it in baking when I need black sesame paste to fill babka or brioche, or when I want black sesame frangipane for a tart. Marumoto Neri is my splurge Japanese brand with a cleaner, toastier flavor that isn’t as earthy and muddy as my go-to everyday black tahini, Kevala. —Sarah Jampel, contributing editorBuy It: Marumoto Neri Black Tahini, $27 on AmazonKitchen Garden Farm Organic Habanero SrirachaI spend so much impulse ca$h at R&D Foods, a gourmet wonderland in Brooklyn. The last thing I bought was Kitchen Garden Farm’s sriracha, which is mostly chiles and vinegar so instead of being gloppy like ketchup from corn syrup, it’s close to liquid. And VERY spicy. The chile flavor is bright and nearly fruity. I can’t eat eggs without it. —Alex Beggs, senior staff writerBuy It: Kitchen Garden Farm Organic Habanero Sriracha, $8 from Kitchen Garden FarmHaechandle Jaeraesik Doenjang Soybean PasteI was adopted from Korea, but didn’t start really cooking the cuisine until this year. Doenjang was one of my first purchases to make a hearty and flavorful soybean stew (doenjang jjigae). Made from fermented soybeans, it’s umami-rich and salty with sweet undertones. It’s great mixed into broth for a quick soup, added to sauteed or roasted vegetables, or stirred into batter for a green onion pajeon (pancake). It also works in marinades and braises, like bossam pork wraps (for that I follow Maangchi’s lead). I am not picky about brands when I buy it in Asian grocery stores, but you can get a 1 lb. tub on Amazon that will last a year in the fridge. —Alyse Whitney, associate editorBuy It: CJ Haechandle Jaeraesik Doenjang Soybean Paste, $11 on AmazonPhoto by ChristabelTexas Gold Black GarlicI was gifted this black garlic by my friend Mitch last time I was in San Antonio, and it is truly the best. It’s the best-quality garlic, grown in Texas and fermented until it gets all sweet and soft and funk-ified. I put this garlic on eggs. I spread it on toast. I put it on pizza. I mix it into pasta sauces. I add it to soups and stir-fries. I munch the cloves whole, I kid you not. It was like eating umami. This garlic did no wrong by me in 2018. —Priya Krishna, contributing writerBuy It:Texas Gold Black Garlic, $9 at texasblackgoldgarlic.comSpicewalla Middle Eastern Spice CollectionI got this Middle Eastern spice trio from Spicewalla as a gift, and oh ’twas a good one. There’s spicy-smoky harissa, tart-tannic za’atar, and an Ethiopian-inspired berbere that defies description. I like to rub them onto barbecued meats, sprinkle them onto scrambled eggs or out-of-season avocado toast, and mix them into olive oil for drizzling flatbread. I’m also really into the fact that these spices are small-batch and ethically sourced by one of my favorite chefs, Meherwan Irani. —Hilary Cadigan, associate editorBuy It: Spicewalla Middle Eastern Spice Collection, $13 on SpicewallaMother in Law’s KimchiI feel like I’m the last person at BA who made sure that they always have a jar of kimchi in their fridge. What was I thinking?! As everyone else already knew, it’s now my go-to for adding instant punch to a meal, from crispy chicken cutlets to basic white rice. —Adam Rapoport, editor in chiefBuy It: Mother in Law’s Kimchi, $10 at LuckyVitaminBob’s Red Mill PolentaI have never thought of polenta as a weeknight recipe until our oven polenta with crispy mushrooms recipe! You don’t have to stir it until it’s done, so it’s one of the easiest recipes in my arsenal. I now keep polenta on hand at all times, and this recipe has become my go-to when I have no idea what to make for dinner. —Kate Fenoglio, associate production managerBuy It: Bob’s Red Mill Polenta, $3 at Thrive MarketAleppo PepperSocial media guru Rachel Karten gifted me some aleppo pepper last holiday and it didn’t last long—it went on Caprese salad, Brussels sprouts, sautéed green beans, eggs, literally everything. I love how toasty it tastes. —Erika Owen, associate audience development directorBuy It: Zamouri Spices Aleppo Pepper, $8 on AmazonBadshah Chaat MasalaI spirited a box of chaat masala out of the office after Priya Krishna sang its praises in an article. It’s a heady mix of dried mango powder, black salt, cumin, chili powder, and coriander, and it adds a blast of umami funk to anything you sprinkle it on. Priya suggests adding it to almond butter toast, but I’ve taken to liberally dusting roasted eggplant with it (à la Gunpowder), which gets all wonderfully crispy and savory. Priya describes it as the only acceptable type of store-bought Indian spice blend you should have in your kitchen, and man do I feel lucky to have it in mine. —Aliza Abarbanel, editorial assistant, HealthyishBuy It: Badshah Chaat Masala, $5 on AmazonAedan Country MisoThe only thing I like about jet lag is that I’m up when no one else is. Which means while most San Francisco residents are still hitting snooze at 8 a.m. on a Saturday, I’m already running around the Ferry Building farmers’ market and snatching up all the good stuff. My favorite find this year has been the Aedan Country Miso, so intensely nutty and earthy that it puts the mass-produced stuff to shame. (It’s made with two types of koji, rice, and barley, which is why you see oats riddled throughout!) Mashed into chicken meatballs or even eaten raw with crudités, this miso is as versatile as The Rock—it just goes with everything! —Elyse Inamine, digital restaurant editorBuy It: Aedan Country Miso, $12 at Good Eggs, or check for local retailers and farmers’ markets near you here.Photo by Max FalkowitzBurlap & Barrel’s Cured SumacFor Burlap & Barrel’s tart and vivacious sumac, the berries are cured in salt and ground up. It’s giving my go-to dish of roasted chickpeas and herbs an invigorating citrus-like finish (and a deep red-violet hue that you couldn’t dream up). —Tommy Werner, assistant video producerBuy It: Burlap & Barrel’s Cured Sumac, $10 on Burlap & Barrel All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitholiday2018ShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-27", "author": ["Condé Nast", "The Bon Appétit Staff"]}