{"id": "2c626d8e5dd6b619615e306a1458c64a", "url": "https://www.bonappetit.com/story/tomato-pie-pizzeria-beddia", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "The Tomato Pie Isn’t the Only Reason I’ll Wait in Line at Pizzeria Beddia, But It’s the Best One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Tomato Pie Isn’t the Only Reason I’ll Wait in Line at Pizzeria Beddia, But It’s the Best OneEveryone talks about the pizza, but this garlicky-sweet number is a true sleeper hit.By Emily SchultzJuly 4, 2019FacebookTwitterEmailPhoto by Joseph BeddiaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When you go to Pizzeria Beddia in Philadelphia, there are a few things you know you have to do. 1) Wait a really long time. 2) Take a photo of the cutesy cloud light fixture. 3) Drink a glass (or two) of natural wine (Las Jaras!). 4) Order more pizza than you can possibly imagine eating. But if you’re not also adding “eat a tomato pie” to your list, then you’re missing out on one of the best things on the new Beddia menu.Tomato pie is a Philly staple (just ask the folks at Sarcone’s or Gaeta’s), and it’s something the man, the myth, the legend chef-owner Joe Beddia developed in between closing the first iteration of his pizzeria in 2018 and opening this new one this past April. It’s like focaccia covered with a garlicky layer of tomato sauce and best served at room temperature.At Beddia, they ferment the pizza dough a little longer (a cold and slow proof gives it more flavor), then let it rise in a pan with tons of grassy extra virgin olive oil. They bake the dough with a thick swipe of tomato sauce, which is also used on Beddia’s famous pies, then slather on more sauce when it comes out of the oven. Finally, the whole thing is topped with ultra-fragrant Sicilian oregano and another glug of glossy olive oil. The result is a crispy-gone-soggy, super savory bite of Philadelphia culinary culture.So yeah, it may not be the first thing people think to wait hours and hours for at Beddia, but it’s definitely my thing.Go there: Pizzeria BeddiaExplore Bon AppétitHighly RecommendPhiladelphiaPizzaRead MorerestaurantsJoe Beddia’s New Pizza Place Is Over-Hyped, According to Joe BeddiaBy Dayna EvansRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-04", "author": ["Condé Nast", "Emily Schultz"]}