{"id": "2c639a9ff5ba67b3980da08ca4620ce6", "url": "https://www.bonappetit.com/story/brads-fathers-day-gift-guide", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "A Father’s Day Food Gifts Wishlist for the Kitchen-Obsessed Dad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Slightly Ridiculous Father's Day Wishlist from a Food-Obsessed DadFrom a knife made of meteorites to a really nice cooler.By Alex DelanyJune 7, 2018FacebookTwitterEmailPhoto by Vincent CrossFacebookTwitterEmailThese are some of Test Kitchen Manager Brad Leone's personal interests: Surfing, weird fish, grilling, cutting things with knives, drinking beers, chopping down trees, sourcing Maple wood, making tables from Maple wood, and telling people how beautiful Maple wood is. Our test kitchen manager is into some pretty cool stuff. He also happens to be a Dad, so it only seemed right to see what Brad had his eye on for Father's Day. We told him to come up with a dream list of food-related father's day gifts, and he did not disappoint. From approachable butter keepers and steamers to knives made from meteorites and Robert Redford-inspired headwear, Brad has quite the eccentric (and maybe a little bit expensive) list.Photo by Ted CavanaughYeti Tundra CoolerI love insulation. You can quote me on that. Yeti's are so great. I'll use it all summer long for beers or camping; I recently made ribs Yeti, which traps in all the post-grill warmth and breaks down muscle tissue to make them nice and tender. I don't have anything against the cooler I have now, but this is just way better. I love amazing insulated boxes.Buy it: Yeti Tundra 50 Cooler, $330 on AmazonViking Wine (and Beer) CellarI'm all about the haul. You know, when you take a trip to a brewery and bring back a bunch of bottles. I went upstate to Suarez Family Brewery and Plan Bee Farm Brewery, and I brought back so many bottles. I'd love to have a nice place to store the ones I really want to save for a special occasion.Buy it: Viking Undercounter Refrigerator, $2600 at AJ MadisonEthan PalmerStackable Bamboo SteamerI've been getting back into steaming a lot. I've been doing vegetables, fish, dumplings, tons of stuff. My son Grif will eat steamed anything, but he likes fish particularly. That'd be a good gift for the both of us.Buy it: Stackable Bamboo Steamer, $20 on AmazonDanny KimCopper CookwareCopper is a superior product. It heats quickly, cooks evenly, and when it's done with the tin inside, it's basically non-stick. It's such a good conductor. The real reason I love it though is the natural patina it develops over time. They look so beautiful.Buy it: Mauviel 10-Piece Cookware Set, $1300 at Crate & Barrel or Mauviel Copper Bowl, $89 on AmazonTed CavanaughFrench Butter KeeperYou know, I really like room temperature butter, and I don't have a vessel to keep it in at home. My crusty bread needs some of that.Buy it: Sawyer Ceramics French Butter Keeper, $45 at Food52Courtesy of Kramer Knives, Inc.Bob Kramer Meteorite KnifeI think this is probably pretty expensive, but it's awesome. Bob melts down meteorites and extracts the metal. Space rocks. Come on. It's badass. I don't want to mention what I'd do to get one of these. A Bob Kramer original would do if this is out of the picture though. [Editor's Note: We're not really sure where to get the Meteorite Knives or how many exist, but apparently they cost around $31,000.00, so you might want to settle for the more affordable ones.]Buy it: Bob Kramer 8\" Stainless Damascus Chef’s Knife, $400 at Sur La TableMortar and PestleThis is a fantastic tool to have, especially when you want to open up flavors with sauces and rubs. I have a small one now, but I'd like to get one that's a bit larger, so I can up the size of my batches.Buy it: Stone Mortar and Pestle, $46 on AmazonPhoto courtesy of FilsonFilson Bush HatYou know, this has nothing to do with food or anything, but I've never worn one of these. I want to. One that's kind of like what Brad Pitt wears in A River Runs Through It. With a leather strap. I think it could work. I think I'd really like that a lot.Buy it: Filson Bush Hat, $65 at MoosejawOver the Father's Day stuff? Watch Brad make Tepache.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitGift GuidesBrad LeoneFather's DayToolsRead MorecultureA Father’s Day Menu That’ll Knock His Socks and Sandals OffBy Jill Baughmanrecipes31 Classic Father's Day Recipes for the Awesome Dads in Your LifeGallery31 SlidesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-06-07", "author": ["Condé Nast", "Alex Delany"]}