{"id": "2c87995a99ead67bc8a01c660dec248b", "url": "https://www.bonappetit.com/story/rockaway-beach-bakery", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Rockaway Beach Bakery Is the Real Reason I Go to the Beach | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRockaway Beach Bakery Is the Real Reason I Go to the BeachThe housemade baked goods are worth the 45-minute drive—and getting over my fear of the ocean.By Chris MoroccoAugust 9, 2019FacebookTwitterEmailPhoto by Chris CristianoFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.A day at the beach with my kids is one of the least relaxing activities I can think of. Watching a four-year-old and a six-year-old (neither of whom can swim!) frolic in the waves is no reward for driving 45 minutes (each way!) from Brooklyn to Rockaway Beach in Queens. Yet, here we are. When I’m not pacing up and down the shore, frantically looking for their bobbing heads, my kids put me to work ferrying buckets of water onto the sand for them to build castles. Did I mention I’m also afraid of the water?The real reason I am always up for a trip to the beach is that it gives me an excuse to visit Rockaway Beach Bakery, where housemade baked goods, good coffee, chill vibes, and backyard space all converge. Anyone who knows me is sick of hearing me complain that New York cafes usually lack all of the above, especially on the baking front. I mean, I get it: The economic reality of running most cafes in the city means selling pastries from wholesalers. They might be serviceable, but it’s like déjà vu when I scan the offerings in most pastry cases.Tag yourself.\nPhoto by Chris CristianoRockaway Beach Bakery does all the baking on-site, and the difference is clear. The owner, Tracy Obolsky, is a pastry chef. (She worked at Morgenstern’s, Esca, North End Grill, and Cook Shop in the city.) She’s also an avid surfer, which is how she ended up in the Rockaways. The joy of Obolsky’s baking is that nothing feels like an afterthought. Vegan muffins, which rarely appeal to non-vegans, are just as delicious and heartfelt as the towering croissant loaf. Her seasonal danishes are outstanding: whorls of buttery dough festooned with crunchy sugar crystals and filled with guava or strawberry-rhubarb jams. And the pecan buns—sticky, rich, and always fresh—are textbook perfection.A single bite of one of these is reason enough to plan a whole beach trip. The 10 minutes of peace I get while my kids are too enraptured by their pastries to talk, wander into the waves, or ask me to be their sherpa doesn’t hurt either.Go there: Rockaway Beach BakeryExplore Bon AppétitHighly RecommendNew York CityNew YorkRead MorerestaurantsVenezuelan Sticky Buns > Regular Sticky Buns, Always and ForeverBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-09", "author": ["Condé Nast", "Chris Morocco"]}