{"id": "2c8b3ff99b095af0e7f13cd3e5992687", "url": "https://www.bonappetit.com/recipe/bas-best-green-bean-casserole", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "BA's Best Green Bean Casserole Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2016 IssueBA's Best Green Bean CasseroleBy Chris MoroccoOctober 16, 20214.8(180)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintFor many, no Thanksgiving is complete without a green bean casserole recipe. Created in 1955 by Dorcas Reilly and her team in the Campbell’s home economics department, it is served at 20 million tables every year, according to the company.In 2016 BA’s own Chris Morocco set out to make his own version, swapping out Campbell’s Cream of Mushroom Soup for sliced criminis and a béchamel finished with Parmesan, which captures the intensity of just-seared mushrooms as well as all the umami potential of the nutty aged cheese. Well-browned mushrooms are crucial for building flavor here, so make sure not to salt them until they’ve reached a dark brown hue (salting them too soon will lead to soggy, steamed ʼshrooms instead).As for the crispy topping everyone is vying for at the Thanksgiving table? You can make your own with fried shallots, but French’s are astonishingly delicious and practically define this recipe, so we didn’t mess with them here. (Plus, you can find them at pretty much any grocery store.)If you need a year off from the icon—or want to add another green bean dish to your menu—here are many more options to choose from.Editor’s note: This recipe was originally published November 11, 2016.Ingredients8 servings2pounds green beansKosher salt2tablespoons olive oil, divided1pound cremini mushrooms, sliced, divided6tablespoons unsalted butter, divided4large sprigs thyme2tablespoons all-purpose flour1¼cups whole milk1cup heavy cream4garlic cloves, finely grated½cup grated ParmesanFreshly ground black pepper¾cup French’s fried onionsPreparationStep 1Preheat oven to 375°. Working in batches, cook green beans in a large pot of boiling salted water until bright green and halfway to tenderness, about 3 minutes per batch. Drain and let cool; trim stem ends.Step 2Heat 1 Tbsp. oil in a large skillet over medium-high. Cook half of mushrooms, without stirring, until golden brown underneath, about 2 minutes. Toss and continue to cook, tossing occasionally, until browned on both sides, about 3 minutes more. Add 2 Tbsp. butter and 2 thyme sprigs to pan. Cook, tossing occasionally, until butter browns and mushrooms are dark brown and very tender, about 4 minutes longer. Season with salt and transfer to a plate. Repeat with 2 Tbsp. butter, salt, and remaining oil, mushrooms, and thyme.Step 3Melt remaining 2 Tbsp. butter in a large saucepan over medium-low. Whisk in flour and cook, whisking occasionally, until roux is golden brown and smells mildly nutty, about 4 minutes. Whisk in milk and cream. Increase heat and bring to a simmer, whisking often, and cook until béchamel sauce is thick and bubbling, about 5 minutes. Remove from heat and whisk in garlic and Parmesan; season with salt and pepper.Step 4Arrange green beans and mushrooms in a 2-qt. baking dish. Pour sauce over (it may not look like enough, but it will get saucier as it bakes). Cover tightly with foil and bake until sauce is bubbling, 25–30 minutes. Uncover and continue to bake until casserole is lightly browned on top and around the edges, 15–20 minutes longer. Top with fried onions and continue to bake just until onions are slightly darker and fragrant, about 3 minutes. Let sit 10 minutes to set before serving.How would you rate BA's Best Green Bean Casserole?Leave a ReviewTell us what you thinkReviews (69)Back to TopTriangleVery good flavors but oh, so rich. Mixed reviews at Thanksgiving. As others have said, salt to taste as you make the dish in every phase….especially season the bechamel to taste prior to adding to the beans/mushrooms. VinyljunkeeDetroit Metro, Michigan11/29/2021This was a hit. It was voted “most bougiest” dish at my thanksgiving dinner and everyone was raving about the bechemal sauce. Definitely follow other people’s suggestions and season / taste appropriately throughout the prep! I added fresh thyme, mustard powder, paprika, freshly ground black pepper and salt to my sauce.\n\nI also used French green beans instead of standard and made my own fried onion topping. I soaked the onions in buttermilk for 10 min before I hand rolled them in seasoned GF flour mix to fry.\n\nThe only problem is that this casserole took a long time to make! I did double it because we had over ten people at dinner and I insisted on making my own onions…next time I will prep all my vegetables the night before to cut down on kitchen time! Makes sense that the recipe recommends getting store bought onions but everyone who tried it wouldn’t stop raving about the homemade variety. Keeps the “from scratch” essence of this version.Biji Los Angeles11/28/2021It was a timely process, but the results were amazing. Everyone loved it. I will be making this again and again. ldworthiEl Dorado, Kansas11/27/2021Phenomenal. The bechamel sauce is so worth it, and everything came together wonderfully in the oven. I seasoned with plenty of salt and cracked pepper, plus some smoked paprika and italian seasoning. It wasn’t bland at all.CA11/26/2021Absolutely delicious! Several reviews mentioned mentioned to make sure you salted to taste. I did roast the mushroom at 425 with the thyme and garlic and oil for 15 minutes as another reviewer suggested. I added the butter when they were done. Everybody at my table loved them!Kathy BCT11/26/2021Incredible! Made this for Thanksgiving and it was my favorite dish. The mushrooms and the bechamel took a bit longer than anticipated, but perfectly reasonable for a large casserole and a special meal. The toasty umami from the mushrooms is fabulous. The Parmesan and the garlic added plenty of flavor to the sauce, and the parboiling helped make sure the green beans were perfectly soft (this is an issue with some elevated GBCs I’ve had in the past, not soft enough). Definitely salt the sauce and cook it down enough where the water released from the vegetables in the oven won’t make it too liquid!EmmaChicago, IL11/26/2021This is delicious.  It is easy to make and everyone loved it.GingkogirlChapel Hill, NC11/25/2021A member of my household has a serious dairy allergy and gluten intolerance. So I got to thinking how the hell I'm going to do this with a vegan approach? Coconut cream + almond milk? The coco cream isn't bad but almond milk is very \"meh\" as it does not taste \"milky\" when it's cooked. \n\nI opted to sub the cup of \"milk\" with a porcini broth, and the cream is subbed with coconut cream (from the top of the can, get the stuff that separates, not the homogenous coconut milk/cream). 1 oz of dried porcinis simmered for an hour.\n\nOH MY GOD is it worth it. WOW. I could eat all 2 lbs of these green bean drenched in heaven all by myself. \nMission accomplished.SDBoston-ish11/25/2021I never leave reviews but this is hands down the best green bean casserole - extra time, but other it’s so worth it. Made this 5x so far and never fails - a thanksgiving staple! Ashley Los Angeles 11/20/2021those of yall saying you can't make it the day before: you can. and i have the burns from making the bechamel to prove it. make your bechamel two days in advance. cut and blanch your green beans the day before. cut your mushrooms the day before. an hour and a half before serving, warm up the bechamel in a pan with a little milk, saute your mushrooms, and assemble everything as described. made these yesterday for christmas. the kicker? i had all my other dishes on the dinner table and completely forgot the casserole in the oven- which i had turned off before sitting down. the casserole never made it to the table. it wasn't until after coffee and dessert that i realized it was still in the oven- perferctly baked, and still warm. taste and season your food THROUGHOUT the cooking process, kids.olivia pchicago, illinois12/27/2020This is kind of a weird recipe! It turned out fine, but I see what other people are saying about it being bland. Except that with 4 grated cloves of garlic, it was INTENSE. The garlic is so strong it’s almost not edible. It doesn’t get cooked enough when you add it raw to the gravy. I think I would make something like this again by using a version of the Bon Appétit recipe for Creamy-ish Mushroom Soup (by the same author) instead of the gravy in this recipe. Sb8888New York, NY12/26/2020Not sure how other people had bad experiences... I followed the recipe to a T but I just did all the mushrooms at once in a large skillet instead of breaking it into two. My household loves mushrooms so I have their cook down to science. The roux instructions were perfect and the béchamel sauce turned out amazing. Taste your food before it goes in the oven and you'll be just fine. Do people not do that? Saving this recipe forever, it's going into my recipe box 🥰LauraFlorida12/26/2020worst thing about this recipe is that you cannot make it the day before. after refrigeration the sauce never really got saucey. it just kind of glommed up. otherwise it was good.btwicetallahassee, fl12/26/2020Hands down the best green bean casserole.  This is typically a dish I only make on Thanksgiving but since I started making this version my very picky 22 yr old daughter has started requesting it for part of her birthday dinners along with any other time I am willing to make it.  Slightly labor intensive but worth the effort.  Sarah Illinois12/24/2020Truly the best recipe I've ever used.  Three days later my guests are raving about my caserol.  One friend reported having a dream about it.Dan MooreAlbuquerque, New Mexico11/29/2020Explore Bon AppétitCasseroleAmericanGreen BeanVegetableCrimini MushroomMushroomFallEasySideNut-FreeVegetarianThanksgivingChristmasDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-11-11", "author": ["Condé Nast", "Chris Morocco"]}