{"id": "2c8c58f835ada0f717222312e1bcd9d0", "url": "https://www.bonappetit.com/story/red-sauce", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Welcome to Red Sauce America | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFrom chicken parm to clams casino, this is our celebration of the Italian-American restaurants we love.By Bon AppétitApril 16, 2019FacebookTwitterEmailFacebookTwitterEmailThe oversize portions. The red-and-white-checked tablecloths. A carafe of the house red. Old-school Italian-American restaurants, a.k.a. red sauce joints, are the kind of institutions you’ll find, with very few deviations, in just about any city in America. But as we discovered upon reaching out to dozens of writers, chefs, and celebrities, these restaurants are about a lot more than a plate of penne alla vodka. Whether or not you’re Italian, red sauce likely means something to you—about family, or home, or history, or politics, or class, or citizenship, or selfhood, or otherness, or all the above, or a million other things. And that’s what this package is all about. Welcome to Red Sauce America.A Home Is More Than a House. Sometimes It’s Also a Red Sauce Restaurant“The longer I live in Los Angeles,” writes Roxane Gay, “the more I try to find places where I feel like a thread in the fabric of something bigger than myself.”\nEnter: Little Dom’s.\nView Story Meet the Waiter With Half a Century’s Worth of Wisdom and Wisecracks to ShareSilvio Frlic has been working at Brooklyn red sauce stalwart Bamonte’s for 41 years. Silvio Frlic has seen some things. He shares the juicy details with Hilary Cadigan.\nView Story Red Sauce Heaven Is a Place...in New OrleansBrett Martin grew up in Brooklyn, the epicenter of Italian-American food. But it wasn’t until he moved down South that he learned to truly appreciate the stuff.\nView Story The Chef Carrying on Chicago’s Red Sauce Legacy Is Ecuadoran Immigrant Arturo AucaquizhpiAfter quietly rising through the unsung ranks at local icon Gene & Georgetti, one ambitious cook opened his own classic Italian steakhouse, reports Mike Sula.\nView Story MY GO-TO“My parents took me to L&B Spumoni Gardens when I was a kid. Every time I come back to New York I have to go to Brooklyn to have that pizza. I have yet to have someone come close to re-creating it.”—Joey Fatone, singer, *NSYNC Francese Is the All-Time Best Soggy Meat Soaked in Delicious SauceBut how could chef Tyler Kord convince his Italian brother-in-law of this indisputable fact?\nView Story The Incredible Costless Abundance of Macaroni Grill’s Free BreadSarah Jampel asks: But how does it even make sense for them to offer this?\nView Story When Will American Chinese Food Get the Red Sauce Treatment?Chris Ying looks at the way Italian Americans have progressed from a demonized immigrant group to an unquestioned part of the country’s fabric, and thinks, damn, I want that too.\nView Story MY GO-TO“When I do get the chance for a slow, excellent meal with good company, Sotto Sotto in Atlanta never fails. I rarely stray from their strozzapreti alla salsiccia, a thick pasta layered with a last-meal–worthy bolognese.”—Stacey Abrams, politician Six Degrees of Chicken Cutlet: A Dish-by-Dish ExplainerHow many ways can you possibly cook a pounded-thin piece of chicken breast? Well, as any self-respecting red sauce menu will tell you, the answer is…a lot. Amiel Stanek explores the options.\nView Story How I Got My Booth: Coach Barry Switzer on Othello’s in Norman, OklahomaWhen the legendary football coach first moved to Oklahoma, the only Italian food available was Chef Boyardee. Then he met chef Pasquale Benso, reports Greg Elwell.\nView Story The Bizarre History of Buca di Beppo, America’s Most Postmodern Red Sauce ChainPriya Krishna investigates how a Lutheran from central Illinois created a genre-defining Italian-American restaurant.\nView Story Everything You Ever Wanted to Know About NYC's Most Exclusive Italian Restaurant...But Couldn't Get in to AskThe hardest reservation in New York is Rao’s, a one-room red sauce joint in East Harlem. Co-owner Frank Pellegrino Jr. gives Aliza Abarbanel a peek through the hallowed red door.\nView Story CHEF’S PICK“Lynette Hawkins of Giacomo’s may be the most underrated chef in Houston. She makes a crispy porchetta that has the right amount of fattiness, and the menu reads with the warmth and kitsch you’d expect from a place you’d truly call a joint.”—Justin Yu, Better Luck Tomorrow, Houston How Did Italian Food Become “Red Sauce”?Paul Freedman, the Yale historian who wrote the book Ten Restaurants That Changed America, breaks it down.\nView Story Pesto Alfredo and the Power of Emotional EatingHow dairy-doused cutlets at La Famiglia Giorgio’s in Boston became Cleopatra Zuli’s ritual—and a space for fantasizing about what family could look like.\nView Story The True Measure of a Red Sauce Restaurant? Its Antipasto PlatterAlex Delany’s case in point: Zeppoli in Collingswood, New Jersey.\nView Story Sure, Chicken Parm Is Great, But Have You Tried Limoncello?At Frankies 457 Spuntino in Brooklyn, the real fun starts when the after-dinner drinks hit the table, argues Andrew Knowlton.\nView Story MY GO-TO“I lived upstairs from Il Cortile in NYC during the first years of The Sopranos. I would look from my window into the restaurant to see who was around, and I would go down. It eventually became home base for the cast—that’s where they would take you after you got killed.”—Steve Schirripa, actor, The Sopranos How a Family of Greeks Ended Up with an Iconic Italian Restaurant in the Deep SouthVirginia Willis shares the story of the oldest Italian restaurant in Augusta, Georgia, a fifth-generation, Greek family–owned red sauce joint.\nView Story I Fell in Love Over Fried Mozzarella and Billy JoelThere’s nothing quite like that “muzzadelle” feeling, writes Emma Straub.\nView Story My Three Decades of Pizza at Sergio’sBut for Amanda Shapiro, it was never really about the food.\nView Story At Atlanta’s Longest-Running Italian Restaurant, You Don’t Fix What Isn’t BrokenFor the owner of Nino’s, the hardest part of letting go is making sure things stay exactly the same, reports food critic Christiane Lauterbach.\nView Story CHEF’S PICK“For my favorite northern Ohio, cash-only, nostalgic fare, I go to Geracis in University Heights. We order the salad of sliced deli meats, follow that with some stuffed peppers, then some gnocchi or cavatelli, and we finish with a chicken scallopini or osso buco. All is bliss.”—Jonathon Sawyer, The Greenhouse Tavern, Cleveland The Aspirational Food World Tried (and Failed) to Shame My Love of Red SauceHow Alex Pemoulie of Mean Sandwich rediscovered her favorite cuisine at Restaurant Machiavelli in Seattle.\nView Story What It’s Like to Bartend for the Stars...for 51 YearsMike Gotovac, a bartender at the legendary L.A. celebrity hangout Dan Tana’s, talks to Maggie Lange on working half a century in the biz.\nView Story Why I Take All My First Dates to Olive GardenIt starts with free wine samples, endless breadsticks, and keeping Kristen Arnett’s expectations low.\nView Story Chicken Parm Is My Self-CareCarey Polis finds the cure to what ails her under a blanket of cheese.\nView Story CHEF’S PICK“You’re sucked into a different time from the moment you walk into La Scarola in Chicago. Some of my favorite dishes are the sautéed escarole, the pasta e fagioli soup, and any of the classic pastas like linguine and clams (I prefer the white sauce).”—Sarah Grueneberg, Monteverde, Chicago All Chianti Is My Kind of ChiantiMarissa Ross, BA’s wine editor, has a not-so-guilty pleasure.\nView Story I’ve Been Going to Tommaso All My Life, and Not Just for the Free OperaSome red sauce joints serve a side of spaghetti. Giulia Melucci’s favorite Brooklyn spot, Tommaso, serves a side of crooning Italian ballads.\nView Story To Understand Pittsburgh, You Have to Understand Greens and BeansMelissa McCart on one city’s humble, but indisputable, iconic dish.\nView Story Breadsticks from a Different TimeThe Detroit suburbs have gone through a massive demographic change in the past 60 years, reports Michigan native Tracie McMillan. Gino’s has been around during all of it.\nView Story CHEF’S PICK“Rao’s in Harlem is the spot that means the most to me. It’s an experience not everyone gets to have. It’s old school, it’s real deal! If you ever get a chance you gotta go. Chef Dino and the team will treat you right.”—Guy Fieri, Food Network host Art Critics Weigh in on That Same Mural You See in Every Red Sauce JointSarah Cascone examines the theory that “the worse the art in restaurants, the better the food.”\nView Story How I Got My Booth: The Tuesday Night Boys at Pietro’sJason Hochman, Larry Zakarin, and their friends have been coming to this iconic NYC Italian steakhouse for 15 years and counting, reports Eric Ginsburg.\nView Story How Did Red Sauce Joints Become the Last Remaining Bastions of Unquestioned Veal Consumption?Bobby Finger’s moral dilemma.\nView Story My Singular Obsession with Carrabba’s Chicken BryanWait—and who’s Bryan? Alex Beggs investigates.\nView StoryCHEF’S PICK“When I moved from Argentina to D.C., I started looking for a place that stocked all the things I missed, like alfajores. I found Vace Italian Delicatessen. One little corner of the store has all the Argentinian staples, but you can also get a huge frozen lasagna, freshly made mozzarella, and sandwiches that could feed a family of four.”—Daniela Moreira, Timber Pizza Co., Washington, D.C. I’ve Changed Since College, But Thank Goodness La Viola Hasn’tBrette Warshaw revisits a night at Philly’s prime spot for carb-loading, reckless drinking, and trying on adulthood.\nView Story The Best Worst Take-Out Counter Employee Suburban Boston Has Ever SeenHilary Cadigan’s summers doing who even knows what at Bertucci’s.\nView Story A Chipwich on the Beach Is Italian-American TooHow summers at the Jersey Shore expanded Emily Schultz’s definition of red sauce.\nView Story O Thou, My Generous Rossi’s RistoranteA poem to portion sizes, by Kelly Conaboy.\nView Story CHEF’S PICK“Every time I go back to my hometown of Monroe, Louisiana, I try to go to Genusa’s. The Genusa family opened it over 50 years ago, and generations of Genusas still work the restaurant to this day! I love the warmth of the place. But obviously I come here for the spaghetti and meatballs.”—Elise Wiggins, Cattivella, Denver “I Don’t Want to Change. I’m Who I Am”How do you keep the old customers while also courting the new? Jen Doll asks 73-year-old restaurateur Frank Guido.\nView Story The Best Chef’s Table Is the L&B Spumoni Gardens Chef’s TableElyse Inamine prepares for a red sauce baptism.\nView Story Scenes From a Chianti-Soaked Italian RestaurantMolly Birnbaum spends a Friday night at Camille’s, a Providence, Rhode Island, legend more than a century in the making.\nView Story I Eat at Sole di Capri for the Photo-Realistic TableclothsHave you ever eaten Italian food on top of photos of...Italian food? Lauren Larson recommends it.\nView Story MY GO-TO“Madeo in L.A. is a really small, intimate place. It has this one particular pasta that I love: a branzino ravioli. The branzino is in the ravioli. It sounds crazy, I know. The fish melts in your mouth as you’re eating it.”—Mario Lopez, actor & TV host, ExtraWhen I’m Craving Italian Food in Philly, I Go to…an Irish Pub?Alex Delany on Murph’s, where the Guinness is plentiful and the Bolognese is perfect.\nView Story How I Got My Booth: Falling in Love at Missouri’s Most Romantic Red Sauce JointLiz Cook meets Laura Hartley Maxey and Scott Maxey, one of many couples who got engaged at V’s Italiano Ristorante.\nView Story My Favorite Red Sauce Joint Is HauntedSo why has Claire Carusillo never been visited?\nView Story The Only Consistent Thing About Lombardino’s Is Its Ever-Broken FountainMadeleine Davies hopes this mini Trevi Fountain in Madison, Wisconsin, never changes.\nView Story CHEF’S PICK“Growing up in Mission, Kansas, I often went to Italian Delight for lunch with my second-gen Sicilian grandfather. I usually got the classic iceberg salad and a slice of cheese pizza. I didn’t usually get dessert, but I’ll always remember the sign. It read something like: ‘$9, if you think that’s too expensive, then try to make it yourself!”—Brad Kilgore, Alter, Miami Looking for Comfort in Minnesota, I Found CossettaThis mostaccioli haven was not just Bao Ong’s introduction to Italian-American food. It was his introduction to restaurants, period.\nView StoryIt’s Not a Summer Night Out in Staten Island Without a Denino’s and Ralph’s DoubleheaderA pair of restaurant soul mates if there ever was one, argues Myles Tanzer.\nView StoryCreditsProject Leads: Hilary Cadigan, Julia Kramer, Sasha Levine, Carey PolisEditors: Alex Delany, Elyse Inamine, Meryl Rothstein, Amiel Stanek, Emma WartzmanPhoto Editors: Michelle Heimerman, Mathea MillmanArt & Design: Chris Cristiano, Bryan FountainSocial: Rachel Karten, Emily SchultzCopy & Research: Brian Carroll, Andrew Gillings, Joyce Pendola, Greg Robertson, Susan Sedman, Tanisha Sykes, Leslie Anne WigginsThanks to: Emma Fishman, Alex Lau, Annalee Soskin, Michele Outland, Adam RapoportExplore Bon AppétitRed SauceItalian AmericanRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Bon Appétit"]}