{"id": "2c93a2a9929f8b9b0b4901610b2ca093", "url": "https://www.bonappetit.com/story/simplehuman-dish-rack", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "The Simplehuman Dish Rack Makes Your Life Look Less Messy Than It Really Is | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Dish Rack That Makes Your Life Look Less Messy Than it Really IsThis rack can fit a Dutch oven, fragile wine glasses, sharp knives, and eight plates, with room for more—and without anything breaking in the drying process.By Alyse WhitneyOctober 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The first question people ask me when they walk into my kitchen is, “Where did you get that dish rack?” It is definitely the biggest thing in my kitchen, but no matter how many dishes are piled inside of it, my simplehuman dish rack looks neatly organized like it’s part of a stock photoshoot. Plates and bowls are shingled in their designated spaces along the back, frying pans line up in the middle, glasses and mugs hang securely off the side, and sharp knives stay handle-side up in wooden slots. And even with all of that, there’s still room for items like a mandoline, clean leftover storage containers, and a cutting board without hitting capacity.For most of my adult life, I had the standard, cheap plastic dish drying rack that I had to replace at least once a year because it got mildewy, moldy, or cracked in half. Then a few years ago, I decided to splurge on the simplehuman dish rack I eyed at Bed Bath & Beyond at least six times before committing. It was stainless steel and shining in the aisle, and since I hand wash all of my dishes (dishwashers are unicorns in budget-friendly New York City apartments) I needed space to dry them all. I bought the $80 dish rack with a 20 percent off coupon, registered it for its five-year warranty, and have zero regrets.But even if you have a dishwasher, I highly recommend getting this larger rack (19.8\"W x 17.7\"L x 13.3\"H), because you’ll inevitably have to hand-wash things like your Dutch oven, fragile ceramics, and wine glasses. It’s literally thought of everything: The drip tray is expandable and can slide to the left or the right of the rack. There's a swivel spout that looks like a water slide so you can aim residual water right into the sink (you can put the rack on either side of the sink this way). The wine glass rack can hang even XXL wine glasses upside down by the base of the stem. Oh, and there’s an anti-residue coating on the plastic tray so water spreads and dries more quickly, making sure there’s no gnarly build-up or weird smells coming from your rack. To be honest, I haven’t cleaned it in the nearly two years that I’ve owned it... and it looks almost as good as new. I wipe the outside down when I clean, but it has a fingerprint-proof, rust-proof finish so I don’t have to do much.As anyone whose come to my house and casually mentioned the piece now well knows, this is the Cadillac of dish racks. But if you think it’s too big for your kitchen, simplehuman also makes a compact version (11.9\"W x 15\"L x 8.9\"H) that is slightly smaller and $30 cheaper, but I say go big or go home. It’s an investment in the illusion that you have your life together, and impressing people is priceless.Photo by Alex Lau Simplehuman Steel Frame Dish Rack$90 at AmazonExplore Bon AppétitCleaningShoppingGet OrganizedRead MorecultureStop Being Gross and Learn How to Clean Your KitchenBy Jolie KerrcultureIt’s Time to Embrace the Granny CartBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-24", "author": ["Condé Nast", "Alyse Whitney"]}