{"id": "2c950be59d7e00ffa03971278dcaa1b3", "url": "https://www.bonappetit.com/recipe/spicy-coconut-healthyish-fried-chicken", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Gluten-Free Fried Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueHealthyish Fried ChickenBy Sohla El-WayllyMarch 9, 20204.3(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWe really went for it here, drawing on the flavor and texture of idli podi (a coarsely ground spice mixture that also goes by the name “gunpowder spice”) to create a gluten-free version of craggy-crunchy fried chicken. Our version swaps chickpea flour and sesame seeds for wheat flour, and, once fried, we dust it with lime zest, coconut, and crushed red pepper flakes. Be sure to fry the chicken to a deep brown to create superior crunch and coax out the nutty flavors of the chickpea flour and sesame seeds. And don’t skip the honey: It will balance out all the bold flavors.Ingredients4-6 Servings2cups buttermilk3Tbsp. plus ¾ tsp. Diamond Crystal or 5¾ tsp. Morton kosher salt, divided4lb. bone-in, skin-on chicken thighs, drumsticks, and/or wings1¾cups cornstarch, divided2cups chickpea flour½cup sesame seedsVegetable oil (for frying; 2–3 cups)2limes3Tbsp. unsweetened shredded coconut1Tbsp. crushed red pepper flakesHoney (for drizzling)Special EquipmentA deep-fry thermometer; a spice mill or mortar and pestlePreparationStep 1Whisk buttermilk and 2 Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt in a medium bowl to combine. Add chicken and toss to coat in buttermilk. Cover and chill at least 3 hours and up to 12 hours (go the full time if you can).Step 2Drain chicken in a colander set over a bowl (the leftover buttermilk brine will become part of your coating later), using your hands to scrape off as much buttermilk as you can.Step 3Place 1½ cups cornstarch in a shallow bowl. Whisk chickpea flour, sesame seeds, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, and remaining ¼ cup cornstarch in a another shallow bowl. Add reserved ¼ cup of the buttermilk brine to the bowl with chickpea flour and rub in with your fingers until mixture is the texture of coarse meal with some larger pieces.Step 4Set a wire rack inside a rimmed baking sheet and line with paper towels. Pour oil into a medium cast-iron skillet to come 1\"–1½\" up the sides. Prop thermometer in oil so bulb is submerged and heat over medium-high until thermometer registers 325°, about 5 minutes.Step 5Meanwhile, finely grate lime zest into a spice mill or mortar and pestle with a Microplane. Cut limes into wedges; set aside for serving. Add coconut, red pepper flakes, and remaining ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt to spice mill and grind to a fine powder.Step 6Working with 1 piece at a time, dredge chicken in cornstarch, gently patting to remove excess. Dip in buttermilk brine, letting excess drip back into bowl, and coat in chickpea flour mixture, pressing firmly to adhere. Gently shake off any loose bits. Carefully slide chicken into skillet. Repeat with half of the remaining chicken. The oil temperature will drop when you add the chicken, so let it come back up to temperature gradually. Fry chicken, undisturbed, adjusting heat as needed so temperature never goes above 325°, until deeply golden brown underneath, 9–11 minutes. Turn over and fry until other side is deep golden brown, about 7 minutes. Transfer chicken to prepared rack and let drain. Immediately drizzle with honey and sprinkle with half of coconut mixture. Repeat frying process with remaining chicken and coconut mixture.Step 7Serve chicken with reserved lime wedges for squeezing over.How would you rate Healthyish Fried Chicken?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleThis recipe is stellar! We have tried a few different meat variations, and in our latest we used thin cut chicken breasts. The texture was amazing! It was a great ratio of fried goodness to chicken. The honey + lime + coconut combo is unlike anything else. We're keeping this one around for sure.HannahBryan, TX7/9/2021Can this be done in an air fryer? Kathy GOak Ridge, TN6/10/2021Read the comments before making this and am glad I used a thermometer. I used all the pieces from a whole organic chicken including the breast and decided to put the fried chicken pieces on a rack in the hot oven to avoid undercooking and to let them shed some more of the excess oil. I started with the biggest pieces in declining order so that they would get more time in the oven than the smallerones. It was supercrisp but not heavy and I really recommend it. Thank you Sohla!JeaKassel, Germany3/25/2021How can this be Healthyish when you offer no nutritional information? I can't find calories anywhere on this website. Am I missing somethig?stonecall8/10/2020Delish! We misread the recipe and accidentally added the full 1.25 cups of cornstarch to the chickpea flour mixture. Instead of redoing it, we decided to just accept it and double dredge in that same mixture. It probably meant an extra thick coating because it definitely had a way thicker crust than traditional fried chicken. The coconut, lime, red pepper topping was a nice addition. This recipe was delicious, juicy, and apparently forgiving. :)AnonymousMichigan 5/20/2020Absolutely delicious!!! Definitely recommend trying for yourself. My grandma has celiac and she hasn’t had fried chicken in years so it was pretty cool to make it up for her. Fried it up in a cast iron skillet I’ve had in my family since 1929 which just made it better. MaddynorthwestOlympia, WA 4/12/2020I've had this twice and it was amazing. It's quite different and surprisingly light for fried chicken. The 1-star \"not idli podi\" and \"not healthy\" reviews are comically stupid. Thanks for the great recipe. AnonymousAustralia4/5/2020This is a fantastic recipe! Due to COVID-19, there was a lack of some (many) ingredients and I made the following subs: potato starch for cornstarch, buckwheat flour for chickpea flour, and flaxseed for shredded coconut, all in equal amounts. The recipe still came out fantastic and my co-social-distancing roommate and neighbours (food was handed off at a safe distance on our porches) housed this. If you're looking for a project/distraction at the moment, this recipe deserves a spot high on your list. Thank you Sohla!arvin.salehBoston, MA3/26/2020Made this last night it was amazing! Wouldn't change a thing!Anonymousvancouver3/24/2020So freaking good, very crispy and crunchy, didn’t get my temp exactly right for the first batch so the color was right but the chicken wasn’t fully cookedCamp_belljDallas, TX3/23/2020To previous commenters, this chicken is skillet fried not deep-fried, and absolutely delicious. This website isn't called Healthy... HealthyISH, huge emphasis on the ISH. Loved it  <3AnonymousNew York, NY3/16/2020Delicious! Sad that people are leaving 1-star reviews just for commentary and not because they actually cooked the recipe and didn't like itAnonymousTennessee3/14/2020@Peggy Sue, idli podi is made of dried chilis, urad dal, chickpeas, salt and sesame seeds. This recipe has  chickpea flour, red chile flakes, salt, and sesame seeds, aka the flavors of idli podi.\n\nAlso, this recipe is clearly \"healthyish,\" aka the name of the website, and not claiming to be healthy. Maybe wait to review a recipe until you make it?AnonymousNew York3/12/2020This is outstanding!  It was my dinner tonight. The dredge reminds me of those little sesame stick snacks. Thanks Sohla!AnonymousSt Paul, MN3/11/2020bruh i do not care if this is healthy or not, if u want good fried chicken make this recipe AnonymousCanada3/10/2020Explore Bon AppétitFried ChickenChicken ThighChickenPoultryChicken WingChickpea FlourFlourChicken DrumstickButtermilkOther IngredientsMainGluten-FreeHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-09", "author": ["Condé Nast", "Sohla El-Waylly"]}