{"id": "2c9ea800542495f42851cfbb0fb8acb3", "url": "https://www.bonappetit.com/recipe/brown-butter-and-pistachio-sables", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Brown Butter and Pistachio Sablés Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueBrown Butter and Pistachio SablésBy Molly BazDecember 1, 20204.6(61)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“Christmas Eve in the Baz household means one cookie and one cookie only: crumbly, sugar-dusted Greek kourabiedes,” says Molly Baz. “No one in the family can remember why (we’re not even Greek!), but every year, like clockwork, my mom pulls out the tattered recipe from an overstuffed manila folder and gets to work. Half the cookies go on a plate for Santa—along with carrot sticks for his reindeer (yes, I am still a whole-hearted believer)—and the rest disappear over the next few days. But this year I’ll switch things up, replacing the walnuts with pistachios, the cloves with subtler bay leaves, and the powdered sugar with a sleek sugar glaze. The result looks nothing like the original, but something tells me Santa won’t mind.”IngredientsMakes 301cup (2 sticks) unsalted butter, cut into 1\" pieces2large fresh bay leaves or 6 dried bay leaves⅓cup plus 2 Tbsp. raw pistachios or any nut2large egg yolks1½tsp. vanilla extract, divided2¾cups (303 g) powdered sugar, divided¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1½cups (188 g) all-purpose flourPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Cook butter and bay leaves in a small nonstick skillet over medium-low heat, swirling occasionally, until milk solids are a deep amber color and butter smells very nutty, 6–8 minutes. (Be careful, it may sputter!) Fish out and discard bay leaves. Pour butter into a medium bowl, scraping in any browned bits. Set bowl with butter over a large bowl filled with ice water; let cool, stirring often, until slightly cooler than room temperature (not until hard), 15–20 minutes. (Or chill in fridge about 1 hour.)Step 2Meanwhile, toast ⅓ cup pistachios on a large rimmed baking sheet, tossing halfway through, until golden brown, 10–13 minutes. Let cool, then finely chop.Step 3Scrape butter into a large bowl. Using an electric mixer on medium-high speed, beat until light beige and fluffy, about 3 minutes. Reduce mixer speed to medium-low; beat in egg yolks and ½ tsp. vanilla, followed by ¾ cup (83 g) powdered sugar, scraping down sides of bowl as needed. Beat in chopped toasted pistachios and ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, then add flour in 2 additions. Beat until dough comes together. (It may look crumbly, but it should hold together when squeezed in your palm.) Transfer dough to a large piece of parchment paper and pat into a loose square. Cover with a second piece of parchment and roll out to a 9\" square about ¼\" thick. Chill dough 20 minutes.Step 4Uncover dough; cut into 1½\"-wide strips. Cut strips at a 45° angle about 1½\" apart, creating oblique diamonds. Arrange cookies on 2 parchment-lined baking sheets, spacing 1\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are golden, 14–18 minutes. Let cool.Step 5Finely chop remaining 2 Tbsp. pistachios. Whisk a pinch of salt, remaining 2 cups (220 g) powdered sugar, remaining 1 tsp. vanilla, and 6–8 tsp. water in a small shallow bowl until thick and glossy (not runny, although it should drip off the whisk). Add more water or powdered sugar if needed.Step 6Working one at a time, dip tops of cookies in glaze, letting excess drip back into bowl; smooth with a spoon if needed. Sprinkle with pistachios and let sit 10 minutes to set.Do ahead: Cookies can be made 3 days ahead. Store air tight at room temperature.How would you rate Brown Butter and Pistachio Sablés?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleAdded orange zest to the glaze & a teeny tiny drop of almond extract to the batter. A HUGE hit at Thanksgiving! AnnieRaleigh, NC11/27/2021One of the better cookies I've made. Everyone I gave them to loved them. They're so pretty too. I really leaned into the sweet and salty thing and used roasted, lightly salted pistachios, and they turned out phenomenal. I'm looking forward to including these in a cookie swapLaurenAustin, Texas10/3/2021These turned out so delicious.  Perfect for an afternoon cup of coffee.  They were pretty easy to throw together with great results.  Just take your time, scrap down the paddle a lot, and really watch to make sure they don't burn at the end.  So good!  I wish I could post pics here!  The good ones looked just like the picture (the bad ones are chef snacks)JamieOhio2/2/2021I think these are the best cookies that I've made. The flavor of the bay leaves was present in the final product but it was subtle and pleasant. The texture is AMAZING! So delicate and buttery. Also, I made these a bit late but these would make the perfect holiday cookie to gift to people.RyleeWashington1/25/2021These cookies were Perfect! Needed to chill for longer than recommended but that works. They look deceivingly similar to Indian or Mediterranean sweets but taste like sables. The Bay leaves may be the secret here, but I'm guessing the browned butter bits did most of the heavy lifting here. Glazing them took too long though.Nitya San Jose, California1/24/2021Made these per the recipe.  Absolutely fantastic cookie.  The bay leaf (I used nice ones from Rancho Gordo) add a wonderful herbal element.  I found the glaze to be a bit thin, not like the picture, but the taste was right on.  My entire family loved these.  Will add to the yearly cookie rotation. JillDenver, CO1/7/2021Made half recipe and smaller cookies. 1 1/2  diamond are just too big. Were very good! Keep the bay leaves as in recipe! Ak Gary12/27/2020These are SO pretty and SO fabulous I literally can't even handle it. I felt like I was on the great british baking show just absolutely killing the technical round.  If you follow the recipe instructions they are also quite easy to execute. To keep the crisp, neat edges like they have in the picture, I just used the side of a large knife to quickly re-shape them right after they came out of the oven (while they were still hot!) Everyone should make these because they are such a hit and you feel like such a bad B when you serve these works of art.MorganGrand Rapids, MI12/25/2020These were such an interesting take on a cookie! Very savory and delicate. They go perfect with my morning coffee. \nIf I were to make again, I would probably only use one bay leaf in the butter(it was very powerful) and I now have a handle on how to cut the diamonds so they will be more perfect diamonds (also a nice shape for minimal dough waste!)Lauren California 12/25/2020Needed a last minute baked gift and I had everything for these on hand.  Wow!  I had planned on reducing the amount of bay leaves, but a previous comment convinced me to include the full amount.  So delicious!  An unusual cookie flavoring, but adds a lovely flavor- really don’t skip the bay leaves.\n\nA couple reviewers mentioned spreading in the oven.  I did two things.  Completely browning the butter (as directed in the recipe) and bringing it to a golden, nutty liquid with dark brown solids would remove any residual water.  Step two was doubling the chilling time as noted by a previous comment. \nNot sure if the chilling was a factor, but my cookies didn’t spread and had clean crisp edges.\n\nDipping the cooled cookies in the glaze was super easy and fast!  I had a small jar of pink “peppercorns”.  Chopped up a half teaspoon and added that to the pistachio garnish for a little extra color and just a little hint of heat.\n\nThis is a winner!  Molly’s brown butter sables will be a tradition going forward!Bob in RIWoonsocket, RI12/24/2020These are delicious cookies, but the first batch was badly burnt at 13 minutes. Second batch was perfect at 10.5 mins. Making the diamonds wasted a lot of dough in the first batch, so for the redo I just cut equal rectangles. The glaze worked fine, but you have to watch for crumbs dropping from the sides of the delicate cookies.  They take patience but your reward is a very tasty treat.Gregg CSan Francisco, CA12/23/2020These are amazing! (In the end, lost a little patience creating diamonds and used a cookie cutter for the last few.) Thank you!AnonymousToronto ON Canada12/21/2020Delicious complex flavor—I made cookie boxes with 6 different cookies and these were unanimously the favorites. Dipping them in icing was impossible as they were so delicate, so I used an icing spatula for them. I think next time I will pipe the icing around the edge and flood it. Also the cookies spread a bit in the oven so all that work to shape the cookies right was unnecessary—not sure how to alleviate that. But the taste on these was unbelievable and they still look really pretty with the sprinkle of greenJosh12/21/2020These cookies are great (and not too sweet!). Though I found it pretty hard to replicate the picture, possibly due to my own inexperience. I found that the icing sugar needed A LOT more water and even then I couldn't dip it because the cookies were so delicate. Instead, I had to spread the icing with a butter knife (which was also kind of difficult to do evenly). Also, getting the exact crisp shape as pictured is extremely difficult. Overall great recipe though.ErnestToronto, ON12/18/2020These are so delicious. Quite easy to make as well! Not too sweet, nice and buttery and nutty. I agree that with another reviewer that the bay leaf really adds a nice dimension. Made exactly as written and they do spread a bit so they do not have the crisp lines of the ones in the picture. Also in the picture there are salt or sugar crystals that are not in the recipe. H JSoCal12/12/2020Explore Bon AppétitCookieDessertPistachioNutSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Molly Baz"]}