{"id": "2c9f3bec16373b1a7ecd00214ab338b4", "url": "https://www.bonappetit.com/story/holiday-gifts-curated-by-cool-people", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "All the Gifts You Want, Curated By the Coolest People We Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll the Gifts You Want, Curated By the Coolest People We KnowA designy bottle opener, lamps made of bread, an aspirational lazy Susan, and a whole lot more.By The Bon Appétit StaffNovember 19, 2019FacebookTwitterEmailPhoto by Alex Lau, prop styling by Rebecca BartosheskyFacebookTwitterEmailHoliday (a.k.a. gift giving) season is nigh. But instead of succumbing to the anxiety-driven rhetorical question cycle—Where did the time go?! Do I have any other ideas beyond quirky dish towels?!—we’re asking ourselves very different questions this year. What’s the thing that people like cartoonist Liana Finck and designer John Derian can’t stop thinking about? What kind of kitchen gear are chefs like Kwame Onwuachi or Margarita Manzke actually excited about? What would Eva Chen do? But these questions aren’t rhetorical: We actually asked these people—and a whole lot of other chefs, winemakers, artists, writers, bakers, shopkeepers, and Instagram influencers that we know, love, and trust implicitly—for all their gifting picks this season. And then...we decided to share all that intel with you here. You’re welcome.Find the rest of our 2019 gift guides right here.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Photo by Alex Lau, prop styling by Rebecca BartosheskyThe Tote Bag for Precious Cargo“Before we opened our shop, we were looking around for tote bags to stock. Then we saw this one and just thought, ‘Why didn’t we think of that?’ The Àplat Culinary Dish Tote. Àplat is so smart. It allows you to carry things horizontally: casseroles, cobblers, avocados and stone fruit and other things from the farmer’s market that you don’t want to stack up on each other and bruise. In the past, we used a piece of cardboard and a brown paper bag to transport pies and baked things to friends’ places. This is a much nicer presentation for something you’ve labored over for three hours. Whenever we bring it out, we get lots of ‘ooohs.’” —Michelle Mungcal and Ken Concepcion, owners of Now Serving in L.A.Buy it: Àplat Culinary Dish Tote, $64 at ÀplatPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Opener With a Sense of Humor“I’ve always enjoyed collecting little objects because they make me feel like I’m home. Now I have a revolving crew of tiny things I’ve picked up as I’ve grown and moved around, mostly fruits and vegetables by different makers, like this Spoon & Tamago Brass Lotus Root Bottle Opener. It’s quiet and understated. And I like that it’s heavier than it looks. It’s a tangible way to root yourself in the world.” —Liana Finck, New Yorker cartoonist and illustratorBuy it: Spoon & Tamago Brass Lotus Root Bottle Opener, $72 at Spoon & TamagoPhoto by Alex LauThe Pretzels Worth Buying by the Bucket“Lancaster County, Pennsylvania, is home to Martin’s Pretzels, which makes one thing and one thing only: the best pretzels I’ve ever eaten. When I first had them, I was blown away by the crunchiness, the super-salty bites, the deep flavor that’s developed from the long baking, and the sourdough tang. All that makes them great to eat on their own, but I go a number of different routes now. Into them with cream cheese. Or really spicy mustard like French Dijon. Or you can melt 72% dark chocolate and dip them in there. That’s actually a business I’d like to open one day. No one’s taking a good pretzel and making chocolate- covered pretzels. After pizza, that might be my calling.” —Joe Beddia, chef-owner, Pizzeria Beddia, PhiladelphiaBuy it: Martin’s Pretzels, $23 at AmazonPhoto by Alex Lau, prop styling by Rebecca BartosheskyA Wine Club We’d Actually Join“We’re both into wine, and when we recently remodeled our apartment on the third floor of Elske, we finally had the space to get a dedicated wine fridge. We gravitate toward wine shops where we feel like we can just trust the recommendations from the staff, and that’s the thought process behind a lot of the wine subscription clubs these types of shops run. In Chicago, Diversey Wine has an amazing club that really highlights the natural wines they stock at the shop. They include high-acid whites with characteristics of beer and cider and lighter reds that we like to chill. But really, we like that they choose for us. We own a restaurant. We’re pretty busy people... with a wine fridge.” —David and Anna Posey, chefs and co-owners, Elske, ChicagoBuy it: Diversey Wine, $50 a month for two bottles at Diversey WinePhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Tablecloth That’s Runway-Ready“I’m not a clothes shopper. When I walked into Nigerian designer Busayo Olupona’s Brooklyn store, I planned to be in and out. Instead, I spent three hours admiring prints, trying on pieces from her clothing collections, and chatting. As soon as I saw the Ileshin Print Table Cloth, I knew I needed one.” —Yewande Komolafe, chef, recipe developer, and writerBuy it: Ileshin Print Table Cloth, $105 at BusayoPhoto by Alex LauThe Tiny Teapot With a Big Impact\"I found this Hario Cha Cha Kyusu “Kaku” 450 ml Teapot while my husband and I were opening our restaurant, L’Auberge Carmel in Carmel-by-the-Sea, California. We love how the glass shows off the tea’s color. We still use the teapots, and we get more compliments on them than the tea itself.” —Margarita Manzke, pastry chef, République, L.A.Buy it: Hario Cha Cha Kyusu “Kaku” 450 ml Teapot, $18 at AmazonPhoto by Alex LauThe Knife Stand That Keeps Things Sharp“As a chef I try out a lot of products. Most of them aren’t good. That’s why I was surprised when I got into Material’s Knife Stand. I really like the midcentury-modern vibes, its clean lines, and how cool it looks in my kitchen. It also keeps knives sharp since they don’t rub against each other.” —Kwame Onwuachi, chef, Kith/Kin, Washington, D.C.Buy it: Material’s Knife Stand, $75 at Material KitchenPhoto by Alex LauThe Wine Importers’ Favorite Winter Spirit“This spirit is based on Malört, the notorious Chicago liquor we force our visiting friends to take as a shot. But Letherbee Bësk is a totally different experience, much more refined, with notes of wormwood and rosemary. When winter rolls in, we sip it slowly—straight or mixed into cocktails.” —Olen Amelia and Ben Deter, wine distributors, Minum Selections, ChicagoBuy it: Letherbee Bësk, $30 at Binny'sPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Master Baker’s Trusty Bread Knife“Over the years I’ve used a lot of bread knives, and they unfortunately all have one thing in common: They’re moderately good for a moderate period of time. That’s not the case with my 10.75\" Tojiro Bread Knife. At home I eat bread every day. My wife, son, and I go through about three loaves of bread a week, and if you know the bread we bake at Boulted, you know there’s some aggressive crust on our levain loaves. This knife—which is sturdy, balanced, and not too heavy—slides straight through them, even after using it multiple times a day for about a year. All I really need to do is control the direction of the blade. There’s no fighting with it. It feels so natural. Bread is a really important part of my life, and this makes it even more enjoyable. I love this knife. Really.”\n—Joshua Bellamy, baker and co-owner, Boulted Bread, Raleigh, NCBuy it: 10.75\" Tojiro Bread Knife, $63 at Cutlery and MorePhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Napkins That’ll Make Mom Proud“My parents have a thing for napkins. Much to their chagrin, my children and I are horrible cretins who use paper towels (I know!), if anything (even worse!). But that’s changed this year thanks to these Bauhaus-inspired Blockshop Textiles Lil Nan Napkins. My mom is going to be so proud.”\n—Emma Straub, novelist and owner of Books Are Magic, BrooklynBut it: Blockshop Textiles Lil Nan Napkins, $14 each at Blockshop TextilesPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Retro Pots That Still Wow“When I was a kid, my mother swore by CorningWare Visions Cookware. I had forgotten all about them until recently, when I found a set in a random kitchen supply store. I fell in love with them again when I saw how these glass stew pots make food sparkle.” —Kalen Kaminski, prop stylist and founder of UpstateBuy it: CorningWare Visions Cookware, $120 for five-piece set at CorningwarePhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Tortilla Press This Fashion Editor Lives For“Corn tortillas are one of my favorite foods. Growing up, I would eat them with jam and butter for breakfast whenever I visited my dad in Mazatlán. That was my madeleine moment. Since then I’ve always wanted to make my own tortillas, but I was missing the press. That’s because I keep a very minimal kitchen—I only have three knives. Then I got Gabriela Cámara’s My Mexico City Kitchen. It was the final push I needed to buy my Chef’s Secret Red Tortilla Press. I tried looking for the presses in her book, but they were too big or expensive. So I spent an hour reading reviews on Amazon until I found this beautiful red one. The first few weeks, I messed around with online recipes. I tried cooking with coconut oil, lard, nothing. Now I just follow the recipe on the Bob’s Red Mill masa harina bag. I use my press at least once a week just to make two or three fresh corn tortillas. I’m pretty sure my obsession has ruined tortillas for the rest of the people in my life, but I don’t care.” —Stella Bugbee, editor in chief, The CutBuy it: Chef’s Secret Red Tortilla Press, $16 at AmazonPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Cheesy Star of the Snack Table“My friend Kathleen Cotter, who runs the Bloomy Rind in Nashville, introduced me to this semisoft Julianna Capriole Goat Cheese. Biting into it, you get all the flavors of the herbes de Provence and marigold petals, then the funk and creaminess of the cheese. I immediately asked for a wheel.” —Vivek Surti, chef-owner, Tailor, NashvilleBuy it: Julianna Capriole Goat Cheese, $38 at Gourmet Food WorldPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Ladle That Turns Serving Into an Art“I have a few ladles from Japan, but this Lue Brass Ladle handmade by Ruka Kikuchi is by far the best. I first discovered his brassware while traveling in southern Japan a few years ago. It’s functional yet beautiful, a ladle you can use in the kitchen but also bring tableside to serve guests.” —Jeni Afuso, photographer at DYLAN + JENIBuy it: Lue Brass Ladle, $96 at Heath CeramicsPhoto by Alex LauThe Self-Care Salve“After spending all day in the kitchen, I smell like an unnatural combination of red sauce and chocolate cake. To combat that, I shower and then apply Monk Oil City Skin Potion all over my body to feel human again. It has yarrow flower essence, cedar, and lavender, and it smells floral and earthy without being musky.” —Zoë Kanan, head baker, Freehand Hotel, NYCBuy it: City Skin Potion, $56 at Monk OilPhoto by Alex LauThe Dreamy Platter That’s Also Durable“Ceramic serving-ware is either super gorgeous and $642, or it’s really inexpensive stuff—and you can tell. I feel like this Year & Day Serving Platter hits that ideal in-between. I have three of these, so if my daughter puts cupcakes on it and then decides to throw it on the ground, I won’t have a mental breakdown.” —Eva Chen, director of fashion partnerships, InstagramBuy it: Year & Day Serving Platter, $50 at Year & DayPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Little Glass That Makes Beer Taste Better\"I used to work in a bar in college, and Sam Shepard would come in and sip his beer out of a little glass. Then I became sort of obsessed with tiny vessels. It just seemed so elevated, not like big American pint glasses that feel like you’re taking a swig from a fishbowl. Last year, when I was at Sushi Noz in New York City, I came across this elegant Shotoku Glass Co. Medium Usuhari Glass made by an old Japanese light bulb manufacturer. The guy next to me was drinking Asahi out of these small thin glasses. It looked so good. I ended up ordering three or four of those little Asahi. I’m sure there is a beer aficionado who thinks this is sacrilege, but for me, this is perfect.\" —Brooks Reitz, restaurateur behind Melfi’s, Leon’s Oyster Shop, and Little Jack’s Tavern, CharlestonBuy it: Shotoku Glass Co. Medium Usuhari Glass, $40 at Ukiyo HomePhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Lamps That Are Literally(!) Made of Bread“I saw these Pampshade Bread Lamps for the first time in Paris, then reencountered them at a trade show in New York City and immediately fell for them. I’m a real fan of anything that is sort of fake or has an optical illusion. I think it’s so cool that they’re bread, not papier-mâché. They’re made by Japanese designer Yukiko Morita, who hollows out fresh loaves and other baked goods, fills them with LED lights and battery packs, and covers them with resin. There’s something so funny, whimsical, and neutral about them that would make them fit in anywhere. They’d be really nice in the kitchen, plugged in to look like bread that’s been illuminated or in an office for a little bit of humor. It’s a no-brainer for gifting because people will appreciate the personality in these and enjoy them much more than getting another scarf (especially when they already have 30).” —John Derian, designer and founder, John Derian Co., NYCBuy it: Pampshade Bread Lamps, from $50 at The WebsterPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Hand Soap Your Kitchen Deserves“Karen Kim makes these beautiful soap bars through her company Binu Binu, all natural and handmade in Toronto. They’re inspired by traditional Korean bathhouses. I’ve been selling her soaps and was like, ‘We should make a soap together.’ So we created the Herriott Grace Kitchen Soap & Dish with scents to complement the kitchen, like cedarwood and eucalyptus.” —Nikole Herriott, photographer and co-owner, Herriott Grace, TorontoBuy it: Herriott Grace Kitchen Soap & Dish, $142 at Herriot GracePhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Tea Your Winemaker Loves Unconditionally“Leaves and Flowers makes a tea for just about any mood: from the buckwheat Soba Cha tea, which is nutty and toasty and just what I want in the morning before I’m ready to eat, to the Leaves of Grass, which is rich and herbaceous and perfect for an after-dinner beverage thanks to lemon verbena, peppermint, and tarragon. The teas all come from small local California farms and are dried and packed by hand. Plus, I have a big clear teapot, so the whole herbs and flowers look beautiful as they brew no matter what I choose.” —Martha Stoumen, winemaker and founder, Martha Stoumen WinesBuy it: Leaves and Flowers, $14–$17 for 1 oz. at Leaves and FlowersPhoto by Alex Lau, prop styling by Rebecca BartosheskyThe Aspirational Lazy Susan“In my book, any good dinner is served family-style. If you’re not sharing, what’s the point of eating with another person, right? That’s why I adore the Concrete Cat Lazy Susan from Coming Soon. Whether it’s a predinner cheese and charcuterie spread with a bowl of popcorn, or a lemony yogurt and za’atar condiment and some spoons during dinner, or mochi ice cream and vermouth spritz ingredients after dinner, I want everyone at the table involved. And my table is beige. So this lazy Susan adds color and joy. I think that anything surrounding your dinner and/or touching your table should be fun and joyful.” —Sierra Tishgart, cofounder, Great Jones, NYCBuy it: Concrete Cat Lazy Susan, $265 at Coming SoonExplore Bon AppétitGift GuidesShoppingHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "The Bon Appétit Staff"]}