{"id": "2ca22341e824410a59f4536568848d33", "url": "https://www.bonappetit.com/recipe/valentines-day-dinner-menu", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "How to Cook a Valentine's Day Dinner That Shows You Care, but Not Like in a Really Over-the-Top Way Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueHow to Cook a Valentine's Day Dinner That Shows You Care, but Not Like in a Really Over-the-Top WayBy Claire SaffitzFebruary 9, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintA date night menu that's perfect for two. Marinated Olives and Feta to kick things off, followed by a crispy, juicy Date Night Pork Chop, and a Chocolate Dutch Baby to round out the festivities.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketPaper Towels$13.45 At AmazonPlate$55 At Bon Appétit MarketTongs$13 At AmazonMedium Skillet$60 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonGlass Measuring Cup$19.99 At AmazonPlastic Wrap$9.84 At AmazonSieve$18 At AmazonCutting Board$10 At IKEAVegetable Peeler$10 At AmazonSmall Saucepan$155 At AmazonShallow Serving Bowl$26.99 At AmazonChef's Knife$34.53 At AmazonCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksMedium #40 Cookie Scoop$16 At AmazonIngredients2 servings1lb. bone-in pork loin chop, 1–1½\" thickKosher saltFreshly ground black pepper3large eggs⅓cup all-purpose flour¼cup sugar3Tbsp. unsweetened cocoa powder½cup whole milk4oz. drained Castelvetrano, Cerignola, or other unpitted green olives3garlic cloves1lemon¾cup extra-virgin olive oil, divided½tsp. crushed red pepper flakes3oz. fetaCrusty bread (for serving)1oz. bittersweet, semisweet, or milk chocolate¼cup heavy cream1oz. Parmesan3Tbsp. raw unblanched hazelnuts1medium shallot1large or 2 small Belgian endive2½tsp. honey, divided1small Pink Lady apple1Tbsp. unsalted butterCoffee ice cream (for serving)PreparationStep 1First things first: Get some prep work out of the way before your date arrives. Season 1 lb. pork loin chop (1–1½\" thick) and let it sit out at room temperature (it cooks much more evenly that way). Pat chop dry with paper towels and place on a plate. Season generously on both sides with salt and pepper, turning with tongs; set aside and let sit on the counter while you work on all the other dishes.Step 2Next you’re going to pivot to dessert prep. It’ll only take you a few minutes, but you want to let the Dutch baby batter rest while you make the rest of the dinner. Arrange a rack in center of oven; preheat to 400°. Place a dry medium skillet on rack to preheat.Step 3Whisk 3 eggs, ⅓ cup flour, ¼ cup sugar, 3 Tbsp. cocoa powder, and ¾ tsp. salt in a medium bowl until smooth.Step 4Whisking constantly, slowly stream ½ cup milk into egg mixture. Cover with plastic and let batter rest.Step 5Now, for the appetizer. Drain 4 oz. olives and place on a cutting board. Lightly smash with the heel of your hand just to break apart skin and flatten slightly. Smash 3 garlic cloves and peel. Using a vegetable peeler, remove peel from 1 lemon in long wide strips. Save remaining lemon for later (you’re going to use it with the pork).Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Cook lemon peel, olives, garlic, ½ cup oil, and ½ tsp. red pepper flakes in a small saucepan over medium-low heat, swirling occasionally, until garlic is sizzling and golden around the edges, 5–7 minutes.Step 7Meanwhile, crumble 3 oz. feta into a shallow serving bowl.Step 8Pour oil mixture over feta. Let sit at least 10 minutes and up to 1 hour.Step 9When your date shows up and you're ready to serve the appetizer, tear bread into large pieces and place in oven directly on rack next to skillet. Bake until craggy edges are golden, 5–8 minutes. Place bowl of marinated feta and olives on a large plate, and set bread alongside for dipping.Step 10Oh, you fancy, huh? Give yourself a pat on the back, pour a couple glasses of something bubbly, and be your charming self. Whose great idea was it to stay in on Valentine's Day? That's right: yours.→  Looking for sparkling wine that won't break the bank? We got you.Step 11After you've done a little snacking and schmoozing, do a little more casual dessert prep. Chop 1 oz. chocolate on cutting board. Wash out small saucepan you just used and transfer chocolate to saucepan. Add ¼ cup cream and cook over low heat, whisking often, until chocolate is melted and mixture is completely smooth; season with a pinch of salt. Keep warm over low heat.Step 12You’re doing great! Now, on to the main event. Prep your ingredients for the pork dish: Shave 1 oz. Parmesan with a vegetable peeler, then use your fingers to break into small shards. Cover with a damp paper towel (to prevent it from drying out). Using the bottom of another medium skillet, preferably cast iron, smash 3 Tbsp. hazelnuts, a few at a time, on cutting board, breaking into bits. Peel 1 shallot, then finely chop. Separate leaves from 1 large or 2 small endive, trimming from the bottom as you work your way to the core. Place in a medium bowl, cover with damp paper towel, and chill until ready to use.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 13Preheat skillet you used to smash hazelnuts over medium heat. Drizzle ½ tsp. honey over one side of pork chop, then drizzle with 1 Tbsp. oil. Rub with clean hands all over surface of chop, then turn and rub second side with same honey-oil mixture to evenly coat; this will help pork caramelize as you cook it. Speaking of which, if you don't have a decent hood above your stove, this might be a good time to open a window and turn on a box fan, because things are about to get a liiiiiittle...smoky.Step 14Lay pork in skillet and cook, leaving it be, until first side is dark brown and caramelized all over, about 3 minutes. Turn and cook second side until browned, about 3 minutes longer. Turn pork chop upright and hold on its side with tongs to sear fat cap; cook about 2 minutes.Step 15Reduce heat to low and cook chop on both sides 1 more minute. Transfer to cutting board and insert an instant-read thermometer into middle of chop, about ½\" from bone. It should register about 130°. If it’s under, cook 1–2 more minutes, then let rest on cutting board 5–10 minutes. Remove skillet from heat.Step 16Add hazelnuts and 2 Tbsp. oil to skillet. Cook over medium-low heat, stirring with tongs, until hazelnuts turn golden, about 3 minutes.Step 17Add shallot; season with salt and pepper. Cook, stirring often, until shallots are softened and browned and hazelnuts smell toasty, about 2 minutes.Step 18Stir in remaining 2 tsp. honey. Cut zested lemon in half and squeeze juice from one half into skillet. Stir to combine, then remove from heat.Step 19Cut around core of 1 apple, removing flesh in 3 lobes. Thinly slice 2 of the 3 pieces, then snack on the remaining piece if you like.Step 20Remove bowl of endive from refrigerator and add apple and cheese; season with salt and pepper. Drizzle with remaining 1 Tbsp. oil, squeeze second lemon half over, and toss to coat.Step 21Cut bone away from chop and cut meat into ½\"-thick slices. Place pork and bone on one side of a large plate and pour juices over; season with salt.Step 22Light a couple of candles and pour some glasses of that red wine: It's almost dinner time.Step 23Gently arrange salad next to chop. Spoon shallot-hazelnut mixture over salad and pork and serve. Give yourself a round of applause, because this dinner looks goooooood.Step 24When you’re ready to move on to dessert, remove skillet from oven (watch that hot handle!) and add 1 Tbsp. butter; swirl skillet to melt, making sure to coat entire bottom and sides of skillet.Step 25Give batter a quick whisk to reincorporate, then pour into skillet. Quickly transfer to oven, taking care because the handle is hot.Step 26Bake until pancake is dramatically puffed and edges are curling inward toward center but center is still moist, 10–12 minutes. Remove skillet from oven (watch for that handle again) and let rest about 2 minutes. The pancake will immediately begin to fall, but that’s normal. Meanwhile, pull ice cream out of freezer to let it soften slightly.Step 27Top with 2 scoops ice cream and drizzle with warm chocolate sauce; serve warm.Step 28And you have our permission to save the dishes for tomorrow...How would you rate How to Cook a Valentine's Day Dinner That Shows You Care, but Not Like in a Really Over-the-Top Way?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis was exactly as advertised—nothing too fancy, but just fancy enough. I really loved that the recipe was organized around a full menu, and the little gifs too? Nice touch, made it super easy. CeruleanArcata, California2/15/2022Explore Bon AppétitPork LoinPorkMeatCastelvetrano OliveOliveOther IngredientsFetaCheeseChocolateDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Claire Saffitz"]}