{"id": "2cae54332632664bec4063a7d1560f4f", "url": "https://www.bonappetit.com/recipe/no-grill-elote", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Elote Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNo-Grill EloteBy Molly BazAugust 25, 20194.5(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintWe love charred, mayo-slathered corn too much to have it only when the grill's fired up. This indoor-friendly stovetop method gets you those blackened, juicy-yet-crisp kernels without the charcoal. While the cobs might not be as smoky as what you'd get from grilling, the deeply toasted flavor of ancho chile powder helps compensate. If you can't find ancho chile powder, chipotle chile powder or the hotter cayenne chile powder will work (but start with just 1/2 tsp. and scale up slowly—it's spicy). Chili powder will also work, although it's usually mixed with other ingredients like garlic powder, onion powder, and cumin, so read the ingredient list to know what you're getting.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketCast Iron Skillet$30 At AmazonTongs$13 At AmazonWhisk$10 At AmazonLoaf Pan$15 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMicroplane$16 At AmazonPlatter$29 At AmazonIngredients4 servings4ears of corn½cup mayonnaise½cup sour cream or Mexican crema1cup finely grated Cotija cheese (about 4 oz.), divided2tsp. ancho chile powder, plus more for serving½tsp. kosher salt, plus more1cup cilantro leaves1garlic clove2limesPreparationStep 1Husk 4 ears of corn, removing any silk. Snap off any ends (they're technically called \"shanks\"!) that are still attached so that the cobs will fit inside a large cast-iron skillet.Step 2Heat cast-iron skillet over medium-high until very hot, about 4 minutes. You want the pan to super hot when you add the cobs so that they start to char right away. Arrange corn cobs in a single layer in skillet and cook, turning with tongs every 3–4 minutes, until charred in lots of places but not totally blackened, 15–20 minutes total.Step 3Meanwhile, whisk ½ cup mayonnaise, ½ cup sour cream, ½ cup grated Cotija, 2 tsp. ancho chile powder, and ½ tsp. salt in a 9x5\" loaf pan.Step 4Finely chop 1 cup cilantro leaves (you should get about 3 Tbsp. when you're finished). Set aside 1 Tbsp. cilantro for serving. Add remaining cilantro to mayonnaise mixture. Grate 1 garlic clove into mayonnaise mixture using a Microplane and whisk to combine. Finely grate zest of 1 lime into mayo, then slice down the center and squeeze in the juice of half. Cut remaining 1½ limes into wedges; set aside for serving.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Using tongs, roll corn in mayonnaise mixture. Transfer corn to a platter, sprinkle generously with more Cotija, and dust with more ancho chile powder. Garnish with reserved 1 Tbsp. chopped cilantro. Serve reserved lime wedges alongside for squeezing over corn.How would you rate No-Grill Elote?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI would comment on the hater but a was of time. Made similar for guest. A big hit. I browned frozen corn and used low salt ingredients to meet their dietary needs. Served it on the Lanai in Florida, on the patio in NJ. knock that chip off your shoulder.MeKarenbNJ/FLA8/20/2021The objection to the phrase \"street food\" is based on a misunderstanding. Not ALL Mexican food is being called \"street food\". This recipe for elote is for what is often sold, um, on the actual street. Of course BA knows Mexicans also eat indoors!! There is no slur. In fact, my city has several restaurants that choose to name themselves \"street food\" (Mexican and Indian.) Don't make insults up where none exist.AnonymousLouisville KY7/7/2021I'm an American living in Baja California. The property term IS \"Street Food\"!\nThis is what the locals call it. \"Street Taco's\" are tacos with a smaller tortilla shell about 4.5 inches in diameter. These are sold all over Mexico as well as on the West Coast and Southwestern States. The regular size taco shells are a bit bigger and used for Fish Taco's and other taco fillings. Some burritos are made with the same size tortillas. It's kind of hard to find the jumbo size flour tortillas in Mexico that are so popular in the the US that are used for large burritos and quesadillas.Valeena Caballero Rosarito Beach, Baja California, MX and San Diego, CA7/4/2021Really delicious. Added a little chipotle adobo sauce to give it an extra kick. Be warned the occasional loud outburst of pop noises coming from the corn whilst cooking can be quite jarring!Chef_sadgalLos Angeles9/2/2020Okay, this recipe is great as it is but my best results come with 2 slight modifications. First, instead of ancho chili in the mayo mixture I used something called Xilli which is smoked chipotle peppers in a jar and adds so much depth to pretty much anything. I got mine at orchard grocer but they probably sell it lots of places. \n\nSecond, instead of cotija I used what I had on hand which happened to be perfect. It’s a very salty cheese that tastes slightly of bacon and shreds up more than it grates called chechil, mixed with a mild hard cheese I grated with a microplane. If you can get your hands on Xilli and chechil I highly recommend giving them a try in this recipe!AnonymousAlabama6/4/2020Just in case the anonymous reader who is offended by the term \"street\" food is reading...  I don't think this is meant as a slur or degradation in any way.  I think this term comes from big cities and maybe places in Mexico or wherever having street carts serving food.  In my opinion, some of those carts have the best food in the world.  HellenbackMobile, AL5/7/2020The anonymous user below shouldn't be hating on this recipe simply because of its name. It's absolutely delicious! I'm Hispanic (Mexican) and this tasted just as good as the kind you get from the vendero! I made it for my whole family and even had to make extras. This is a recipe that I'll keep for ages. It'll come in handy for winter too. genesisenriquezChicago9/27/2019Please stop calling Mexican food \"street\" food. Who came up with that? It's gone too far and it makes being a Latina who likes to cook very frustrating when reading any cooking magazines. Any time you type \"Mexican street\", please backspace. It's patronizing, okay?\n\nWe've always called our tacos \"tacos\" and elote \"elote\".  Have some respect. AnonymousChicago9/6/2019I can't eat corn *on* the cob, so I ever so slightly decreased the amount of mayo-sour cream and cut the kernels off the cobs, but did everything else exactly the same. It's perfect, and so easy to throw together! Get that last-of-the-season farmer's market corn and get on this!chasspodChicago9/3/2019Explore Bon AppétitMexicanLatin AmericanCornVegetableCotijaCheeseAncho ChileChileChipotleSummerQuickEasyWeeknight MealsSideGluten-FreeNut-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-25", "author": ["Condé Nast", "Molly Baz"]}