{"id": "2cb933da2dc6d9b137ebfc48c82e3f85", "url": "https://www.bonappetit.com/story/how-to-make-a-frittata-stovetop", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Make a Frittata on Your Stovetop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make a Frittata on Your StovetopDo you know how to make a frittata? You don't need to use an oven. All you need is a skillet, a burner, and spatula.By Alex DelanyJanuary 11, 2018FacebookTwitterEmailBrian W FerryFacebookTwitterEmailOnce you realize that a frittata isn’t the same as an omelet, they aren’t really that hard to comprehend: Eggs for a crowd, made in a skillet. If you know how to make a frittata, you know it's customizable, and well within reach for even the most amateur of home cooks. The only complicated thing is figuring out where the hell to put the “T’s” when spelling it.If you don't know how to make one, welcome to the club. Frittatas are traditionally started on the stove and finished in the same skillet in the oven, but sometimes we just want life to be simpler, without the whole pre-heating ordeal. That’s why we’re giving you a step-by-step run-through of our stovetop frittata, because at the end of the day, we’re all just human beings sharing the same frittata experience.Chop It UpFirst things first, when you’re picking your ingredients to add into your frittata, make sure you chop them small. Not microscopic, but small enough that they won’t disrupt the even cooking of the eggs. Think dice-size. You know, the cubes with dots on each of the six sides.The Right MaterialsStart your frittata in an oiled non-stick skillet. You need a non-stick skillet for this, since we’ll be flipping this thing all around. No buts. No exceptions. You’ll also need a silicon spatula. Pour your mix of eggs and fillers into the skillet, heated over medium heat. A good ratio to keep the egg-to-pan relationship manageable is eight eggs for a medium-sized pan.Spread the WealthOnce the eggs start to cook, you should start pushing the curds to the middle of the skillet, lifting the flat surface on the bottom and letting the raw, liquid eggs move to the outside. This ensures that all of the eggs in the pan cook at the same rate. Do this frequently. Your eggs will appreciate it.The First FlipNow we have to flip the eggs, so the other side can cook. Here’s an important tip: Don’t flip your eggs until they’re mostly cooked on the first side. This isn’t an even split. We want to cook 85% of the eggs initially, and then flip them to finish off the last bit. Flipping the eggs requires a plate and some confidence. Place the plate face-down on top of the skillet, and flip the two, so that the frittata falls onto the plate. When you remove the skillet, you’ll see the browned underside of frittata.The Re-EntryThere will be a little bit of loose egg that gets lost in the flip and re-entry (because it’s not 100% cooked), but that’s just part of the process. Re-oil the skillet, and slide the frittata off of the plate and back into the skillet, finishing off the last 15% of the eggs. Once you turn off the heat, let your frittata rest in the skillet for a minute before taking it out.The Flip and SliceYou’ve made it to the final flip. Put whatever you’re going to serve this on (we like a cutting board) on top of the skillet, and turn the whole thing over. Remove the skillet, slice up your perfectly-set, marvelously-browned frittata, and have yourself a day.Want to see the whole thing go down? Here's the full frittata recipe:Use-It-Up FrittataYou can put whatever you want in it, and you don't even need to turn on your oven.View RecipeExplore Bon AppétitFrittataEggBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Alex Delany"]}