{"id": "2ccdf5690285f8756d7a1e19d0f2d04f", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/haroo", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Haroo Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverHarooHome-style Korean on Richmond’s famous Food StreetFacebookPinterestTwitterEmailGrant HarderGO HERE: for beautifully prepared Korean food by a quietly hospitable husband and wife team named Richard and Sophia Kang. She cooks, he serves—looking tidy and welcoming in a folded apron—and they do it all at Haroo, a quirky upstairs space at the end of Richmond’s Alexandra Road (nicknamed Food Street for its plethora of restaurants).ORDER THE: delightfully crisp seafood pancake; cheese tteokbokki in targin (Korean rice cakes smothered in a smoky, spicy tomato sauce and topped with cheese); and bibimbap with all the banchan. But for a crowd, the special flower-shaped bibimbap is really great: layers of rice, bulgogi, kimchi, and vegetables are pressed into a flower-shaped mold, which is removed before an elaborate display of garnishes are added on top.THE VIBE IS: down-home Korean grandmother with quaint curtains and apple-print pillows. Diners predominantly include young couples and groups of friends in the know. If there’s music, it’s barely audible; instead, it’s all about the quiet enjoyment of food and friendly service.PRACTICAL STUFF: Open Tuesday to Sunday, from 5 p.m. to 10 p.m. Closed Monday. Reservations welcome by phone.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEMaenamReinvented Thai cuisine (and cocktails) in Kitsilano   Vij’sGame-changing Indian cuisine and hospitality in Cambie since 1994Café MedinaThe city’s downtown brunch institutionExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}