{"id": "2cce5de37fa0a84dedb348b8548e034d", "url": "https://www.bonappetit.com/recipe/caramelized-pork-and-cucumber-stir-fry", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Caramelized Pork and Cucumber Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCaramelized Pork and Cucumber Stir-FryBy Christina ChaeyAugust 10, 20214.6(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintMy bottle of Lee Kum Kee Premium Oyster Flavored Sauce is the security blanket of my condiment cabinet. The glossy Chinese condiment includes sugar, salt, cornstarch, and oyster flavoring (made from reduced oysters) and is anything but subtle. It brings a huge punch of umami-rich, sweet-meets-salty flavor to anything it touches. (And, accordingly, a little bit of the stuff goes a long way.) It’s like four sauces in one. I like to stir some into a stir-fry sauce, as I do here, but on nights when I’m feeling extra-lazy, I simply drizzle a little oyster sauce right out of the bottle over anything from quickly sautéed hearty Asian greens to seared tofu. —Christina ChaeyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonVegetable Peeler$10 At AmazonColander$11 At AmazonStainless Steel Mixing Bowls$26 At AmazonIngredients4 Servings1large slicing cucumber, peeled in alternating lengthwise strips, halved lengthwise, seeds removed, halves sliced crosswiseon a diagonal ½\" thick1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more2Tbsp. oyster sauce2Tbsp. soy sauce2Tbsp. Shaoxing wine (Chinese rice wine) or medium-dry sherry1lb. ground pork3Tbsp. grapeseed or vegetable oil, divided1Fresno chile, seeds removed, thinly sliced11\"-piece ginger, peeled, finely grated2garlic cloves, finely grated½tsp. freshly ground white or black pepperSteamed white rice (for serving)PreparationStep 1Toss cucumber slices and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl to coat evenly. Let sit until cucumber slices start to release their liquid, about 10 minutes.Step 2Meanwhile, stir oyster sauce, soy sauce, and Shaoxing wine in a small bowl to combine; set aside.Step 3Using your hands, form pork into five or six small patties. Season lightly with salt; set aside.Step 4Drain cucumber slices in a colander and rinse well under cool running water. Drain, shaking off any excess water, then pat dry with a kitchen towel.Step 5Heat 1 Tbsp. oil in a large skillet over medium-high. Cook cucumber slices, tossing vigorously, until crisp-tender, about 1 minute. Transfer to a plate.Step 6Wipe out skillet and heat remaining 2 Tbsp. oil over medium-high. Add reserved pork patties; gently flatten with a spatula. Cook, pressing occasionally to help meat make contact with pan, until deeply browned and crisp underneath, about 4 minutes. Flip patties; cook until other side is deeply browned and crisp, about 4 minutes. Break up pork into large pieces; continue to cook until no longer pink, about 1 minute. Add chile, ginger, garlic, and white pepper and cook, stirring constantly, until fragrant, about 30 seconds. Add cucumber back to skillet along with reserved sauce. Cook, tossing often, until sauce is reduced and evenly coats pork and cucumber slices, about 1 minute. Serve stir-fry with rice.How would you rate Caramelized Pork and Cucumber Stir-Fry?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleGreat recipe! I did not find the dish too salty, especially when served with white rice. The only change I made was a light splash of rice vinegar, just for personal taste. For anyone confused about the pork patty step, it's to create more surface area for browning. If you're rushed on time or it's just not that big of a deal to you, it can be skipped. Personally I feel that it adds a lot to the dish. A great weeknight recipe.Michelle B.Tucson, AZ3/10/2022Easy for a weeknight and excellent flavor. I was fine with the amount of salt. Separately stir-fried some baby bok choy for a nice green side dish. Will probably use more cucumber next time.NellAustin, TX1/14/2022Agreed with other commenters that it ended up a bit salty. I added a few splashes of Chinkiang vinegar and it cut the saltiness and brightened the dish up nicely. Definitely recommend that if you have anySitaramChicago9/20/2021Delicious! I didn't add the salt to the pork per the reviews.  Which it didn't taste salty to.  My pork was overcooked and turned out dry.  Maybe cook it quicker next time?TaraIndiana9/8/2021Very nice. Agree that it could use more veg but that's always an option. I like the crispiness of the pork. I guess that's why the patties work. Would make this again.Ronnie BCalgary, Canada9/7/2021Tasty. Wouldn’t have thought you could use cucumbers this way. Agree it can be salty and didn’t need to be made into patties.  I think this could have handled more veg.  OmarNew York9/3/2021I’m trying to figure out the point of shaping the pork into patties and then breaking the patties up. Seems like a pointless extra step when you can just cook up the ground pork?Anonymous8/23/2021Really delicious. It was a little on the salty side, so I might recommend not salting the pork patties. The oyster sauce and soy sauce pack enough salty flavor into the dish.ZachMadison, WI8/18/2021Explore Bon AppétitRice and Grain BowlStir-FryChineseEast AsianAsianCucumberVegetableGround PorkPorkMeatQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Christina Chaey"]}