{"id": "2cd873d26199ab149ad82f1e6d684d6a", "url": "https://www.bonappetit.com/recipe/marinated-beans-with-celery-and-ricotta-salata", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Marinated Beans with Celery and Ricotta Salata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueMarinated Beans with Celery and Ricotta SalataBy Ignacio MattosApril 17, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis side dish is so fast and easy, you can make a big batch and have it for the whole week. The simple marinade will fancy up any type of canned beans. Make breakfast an occasion by serving these beans alongside breakfast calzones, a savory peach and shaved fennel salad, and torta pasqualina.Ingredients8 servings 415-oz. cans cannellini (white kidney) beans, navy beans, and/or black-eyed peas, rinsed4celery stalks, thinly sliced⅔cup extra-virgin olive oil6Tbsp. white wine vinegar1Tbsp. coarsely chopped thyme, plus more for servingKosher salt4oz. ricotta salata (salted dry ricotta), crumbledFreshly ground black pepperPreparationStep 1Toss beans, celery, oil, vinegar, and 1 Tbsp. thyme in a large bowl to combine; season generously with salt.Step 2Just before serving, transfer beans to a shallow bowl and top with ricotta salata, pepper, and more thyme.Step 3Do Ahead: Bean salad (without celery and ricotta salata) can be made 3 days ahead. Cover and chill.How would you rate Marinated Beans with Celery and Ricotta Salata?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis has become a favorite, and we eat it often, especially in the summer. Always a hit when we bring it to the barbecue. We've also found that it works with literally any combination of canned beans, and it's best if you've got a variety of different sizes and textures - butter beans are especially nice in contrast to smaller beans, and slightly firmer pigeon peas add a nice pop of color too. I've never found ricotta salata so I usually sub feta or skip it altogether. DuffuserIndiana8/10/2021Love this salad.  Super easy, flavorful, healthy and goes with literally anything I am serving!!!CarlaEdina, MN11/30/2020So easy, super delicious. A great side dish and yields a lot for meal prepping  - I like to have this with some added rosemary and lemon juice over mixed greens!AnonymousNYC3/26/2020Explore Bon AppétitItalianEuropeanCeleryVegetableRicotta SalataRicottaCheeseKidney BeanBeanBlack-Eyed PeaCannellini BeanWhite BeanQuickEasySideGluten-FreeNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}