{"id": "2cddac0fa2d63b1a51c6027742097832", "url": "https://www.bonappetit.com/recipe/celery-and-salted-lemon-cocktail", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Celery and Salted Lemon Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCelery and Salted Lemon CocktailBy Andy BaraghaniNovember 23, 20213.6(7)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintInspired by the Salty Dog (grapefruit juice with vodka or gin), this refreshing cocktail recipe mixes puréed celery and preserved lemon with vodka and club soda. Don’t skip the celery leaves: They impart big celery flavor and just might become your new favorite salad green. Pro tip: Start by using just 1 jarred lemon and tasting before adding the next—the amount of salt varies from brand to brand.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCocktail Picks$5 At AmazonMesh Sieve$13 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonIngredients8 - 10 Servings8large celery stalks, chopped, plus as many leaves as you have2preserved lemons, seeds removed, chopped, plus 3 Tbsp. brine2cups vodkaChilled club soda (for serving)Small Manchego cheese pieces, tinned seafood (such as smoked mussels, boquerones, or clams), lemon wedges, and/or olives (for serving)special equipment8–10cocktail skewersPreparationStep 1Purée celery stalks and leaves, preserved lemons, brine, and 2 cups cold water in a blender until very smooth. Strain through a fine-mesh sieve into a pitcher. (Do not force it; you want to keep any solids from going through. You should have 3–4 cups.) Chill celery mixture at least 20 minutes before using.Step 2To serve, stir vodka into celery mixture and pour 3–4 oz. into each of 8–10 tall ice-filled glasses (they should be about three fourths full). Top off each cocktail with 1–2 oz. club soda. Thread garnishes of your choice onto skewers and garnish each cocktail with a skewer.Do ahead: Celery mixture can be made 1 day ahead. Keep chilled. Stir well before using.How would you rate Celery and Salted Lemon Cocktail?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleTossed it after 2 sips. I don’t know what went wrong. AnonymousSeattle, WA1/9/2022I love this drink! I don’t like sweet, so if you are looking for even a little sweet read the title, read the ingredients, use reading comprehension and think carefully, oh this is salty and tastes like celery and preserved lemons (which also don’t taste like fresh lemons). That being said, it’s such a wonderful alternative to a Bloody Mary or some other day time drink, and I would also advise sticking to the recipe as well because it is really important to strain and also not overwhelm with the lemons or too much vodka. JamesNew York, NY1/2/2022Explore Bon AppétitDrinksCocktailDrinks AllPitcher DrinkCeleryVegetableLemonCitrusFruitVodkaAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Andy Baraghani"]}