{"id": "2cdfa83e1f51a742a861c8c7da83a581", "url": "https://www.bonappetit.com/story/full-fat-yogurt-is-the-only-yogurt-worth-buying", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Full-Fat Yogurt Is the Only Yogurt Worth Buying | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFull-Fat Yogurt Is the Only Yogurt Worth BuyingDon’t water down the flavor of your sauces, dressings, and marinades with the low-fat stuff.By Alyse WhitneyNovember 1, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailImagine that you spent all day making a hearty, slow-simmered stew. The broth had thickened into a stick-to-your-ribs meal that would help you through the cold months, helping suspend big chunks of braised meat and tender vegetables. But then, just as you were about to serve it to your guests, you dumped a cup of water into the pot, turning it into a paler, blander, thinner version of itself.That’s what happens when you buy low-fat yogurt: You’re getting a watered-down version of the rich, creamy, thick, and tangy dairy that you could be mixing into dips, dressings, and marinades. And there’s no way to make it taste as good as the full-fat stuff.We know that stew and yogurt are very different, but we wanted to paint a picture of just how dramatically different low-fat and full-fat yogurt can be. Recent research has proved that whole-fat isn’t evil, and some even say it’s even beneficial to your overall health. And eating a little bit of whole-milk yogurt (which is between 4–5 percent fat content, by the way) is better than eating a whole tub of low-fat stuff, which is usually full of stabilizers, has a chalky texture, and will cause anything you make to taste just a little off.Make your yogurt dips the best they can be by using the full-fat stuff.\nPhoto by Chelsie CraigWhen you use a low-fat yogurt in a recipe—whether a yogurt cake or a sauce to dip chickpea fritters into—you’re diluting the flavor, and it’s tough to reverse your mistakes. Whole milk yogurt is luscious, full of good fat, and carries all the flavors of a given dish, whether you're working with a bunch of fresh herbs, pungent grated garlic, or hot chiles.This is most apparent in regular yogurt, which is already thinner than Greek yogurt, its strained, thicker, tangier, denser sibling. Fat-free Greek yogurt is still thick, sure, but there is no flavor there; it’s fake thick, and is a bland fraud with unappealing gritty texture. Our favorite yogurt to cook with Wallaby Greek yogurt, which is silky, tangy-but-not-too-sour, rich, and is just as delicious on its own as it is atop shakshuka, or in a marinade for lamb chops.This is Wallaby Greek yogurt that we loooove. Buy it by the tub!\nWe typically call for Greek yogurt in our recipes because it is more versatile—you can always thin out Greek yogurt if you need to, but it's harder to concentrate the flavor and texture of regular yogurt on the fly. Once you add olive oil, lemon juice, and salt, you have a spoonable or dippable sauce for meat, vegetables, or even chips. If you did the same to regular yogurt, it could become too loose. And that’s a lose-lose situation.The TL;DR version of all of this is: Buy full-fat yogurt. If you've been messing around with the low-fat stuff, everything you use it for will taste better. Clear eyes, full-fat yogurt, can’t lose.How about some homemade yogurt ranch?Every Night Salad with Yogurt RanchThis crunchy romaine number, drizzled with a creamy, craveable yogurt-based homemade ranch dressing, is the kind of salad that goes with just about anything, from delivery pizza to pan-seared pork chops.View RecipeExplore Bon AppétitBasicallyYogurtGreek YogurtRead MorecookingThis Romaine Salad with Homemade Ranch Saved My Social LifeBy Jesse SparkscookingThis Is a Yogurt Dip Recipe You'll Want to Tell Strangers AboutBy Alex DelanycookingYogurt Marinating Is the Best MarinatingBy Alex DelanycookingThis Is the Only Difference Between Greek Yogurt and Regular YogurtBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Alyse Whitney"]}