{"id": "2ce2c6684dd73585c466318e1af0ca0f", "url": "https://www.bonappetit.com/story/taco-nation", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "This Is Taco Nation | Bon Appétit\n\n\n\n\n   \n        \n  \n\n Has there ever been a more important time in this country for tacos? Not only are they more dynamic and widespread than ever (jackfruit birria in East L.A.! Duck fat tortillas in Kansas!), they’re a cultural lightning rod for some of today’s most pressing issues. So we called upon some of America’s notable taco fanatics and asked: What, exactly, do tacos mean to you? For some, it’s a matter of simple pleasure. For others, an identity. A form of political expression. This is a collection of those stories, along with our picks for must-try tacos across the country and some really excellent recipes courtesy of our resident taco maestro, Rick Martinez. So let’s, uh, taco ’bout tacos, shall we?  \n  \n\n \n    \n  \n\n  \n\n\nTacos in the U.S. are made possible by the migration of people and that special alchemy that happens when cultures coexist. That’s what Mando Rayo found while traveling the country for his TV show, United Tacos of America: the new and the tried-and-true; faithful interpretations from across the border and unique local creations. Here are 10 he can’t stop thinking about.\n\n\n\n\n\nTripas\nTortillería y Taquería Ramírez, Lexington, KY\nCrispy boiled and fried beef intestines + local Kentucky corn + a rickety Mexican tortilla machine = a very tasty example of what happens when south and sur collide.\n\n\n\nCarnitas Surtidas\nCarnitas Uruapan, Chicago\nHerb-kissed Michoacán-style carnitas are king in Chicago, but none compare to this crispy-on-the-outside, juicy-on-the-inside pork-fried pork, made by the same family for more than 40 years. \n\n\n\nGoat Birria\nGoat Mafia, Compton, CA  \nA Jaliscan staple—meaty red stew laced with chiles—gets the L.A. taco treatment with local goat, dried chiles, chocolate, and California oranges sourced from the chef’s uncle’s backyard.\n\n\n\nPlacero\nHorchata Deli Grocery, Queens\nYes, haters, NYC does have great tacos. But you might have to go to Jackson Heights, a.k.a. Puebla York, to find them. This one’s packed with rice, chile relleno, nopales, and a hard-boiled egg. \n\n\n\nSmoked Barbacoa\nEddie O’s Texas Barbecue, Houston\nTraditional Tejano cooking meets Houston’s high-stakes craft BBQ scene in these crazy-tender pecan-smoked beef cheeks, served on fresh flour tortillas made by the pitmaster’s abuela.\n\n\n\nCochinita Pibil\nCocina Luchadoras, Baltimore\nThis Yucatán classic nods to Baltimore’s rapidly growing Mexican population: Citrus-marinated pork cooked under banana leaves is shredded into a house-nixtamalized corn tortilla. \n\n\n\nBaja Fish\nTJ Oyster, San Diego\nJust over the border from Baja, San Diego often feels like an extension of Mexico. So do these corn tortillas topped with hot battered tilapia, cabbage, and a dollop of creamy, creamy crema. \n\n\n\nShrimp al Pastor\nTaqueria El Paraiso, New Orleans\nAfter Katrina, Mexican immigrants came to help rebuild the city, creating in their wake Mexican-Creole crossovers like this taco full of gulf shrimp cooked to pineapple-y pastor perfection.\n\n\n\nDuck Carnitas\nNixta Taqueria, Austin\nIn Austin, tradition and novelty go hand in hand. These blue corn tortillas are nixtamalized Aztec-style, paired with not-so-traditional duck confit carnitas, and topped with spicy green salsa cruda.\n\n\n\nKiss Chicken\nKiss Pollos Estilo Sinaloa, Phoenix\nLeave it to the Sinaloans, one of Phoenix’s largest immigrant groups, to make an excellent chicken taco: charcoal-grilled, doused in cheese, sprinkled with pork, and wrapped in two corn tortillas.\n\n   \n  \n\n  \n\n\n\n\n\n\nThese Vegan Tacos Are More Than a Trend\n\nFor a growing group of Chicana cooks, eating meat-free is about reclaiming their roots.\nby LESLEY TÉLLEZ\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nTacos Are My Resistance\n\n\n\n\nIn the kitchen, I teach my kids how to be Mexican and proud.\nby MANUEL GONZALES\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nI Went Looking for My Mexican Identity and Found It at Plaza Fiesta\n\nGrowing up in the South, I struggled to locate my Mexican-ness. Then, Mexico came to me.\nby JENNIFER ZYMAN\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\nYou Know Him As Machete, But Have You Tried His Tacos?\n\n\n\n\nThey're what taught actor-turned-restaurateur Danny Trejo some of his most important life lessons.\nas told to HILARY CADIGAN\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nSandra Cisneros’s grandfather didn’t talk much—instead, he spoke through his handmade tortillas.\nREAD MORE\n   \n  \n\n  \n\n\n\n\nPork Volcánes\n\n\n\n\n\n\n\n\n\nPork Volcánes\n\n\n“In northern Mexico, this taco is called a vampiro because the crunchy fried tortilla looks like a vampire bat wing. Down south, it’s volcán—maybe since they see more volcanoes than bats! Either way, juicy pork al pastor and oozy quesillo are a brilliant combo.” —RICK MARTINEZ\nGET THE RECIPE\n\n\n\n\n\n\n\n\n\n\n \n\nBig Taco Moments in the USA\nFrom canned tortillas to crispy carnitas, professor Steven Alvarez (who teaches a Taco Literacy class at St. John’s University in Queens), traces how the American taco found its way\n\n\n\n\n\n1905\nThough tacos gained popularity as a Mexican street snack in the late 1800s (and wrapping food in tortillas traces back to the Aztecs), this is the year of their first known mention in a U.S. newspaper. Brought across the border by migrant workers, tacos were typically sold out of pushcarts in border cities like San Antonio and L.A.\n\n\n\n1937\nAt Mitla Cafe in San Bernardino, CA, the Rodriguez family’s fried tacos dorados—literally “golden tacos”—hit the scene. Three decades later a dude named Glen Bell would take notice, infiltrate the kitchen, and use them as the model for the standardized hard-shell tacos at his own restaurant, a little place called Taco Bell. Perhaps you’ve heard of it.\n\n\n\n1955\nTacos get the official American food treatment of the day when a company named Ashley Foods of El Paso (a precursor to Old El Paso) markets the first taco dinner kit nationally. It introduces the concept of tacos as “Mexican sandwiches.” Oof. The kit includes Ashley brand canned tortillas (…no comment), beans, taco sauce, and…a tortilla fryer. \n\n\n\n1960\nSecond-generation Lebanese immigrants in Mexico City adapt the shawarma rotisserie technique into the trompo—a vertical slow-cooked pork spit, marinated with pineapple and sliced onto a tortilla—which became what we know today as tacos al pastor. It would take another generation, however, before they became a standard in taquerias across the U.S.\n\n\n\n1974\nMexico City traffic cop turned Los Angeles dishwasher turned entrepreneur Raul Martinez converts an ice cream truck into the world’s first taco truck. He parks it outside a bar in Cypress Park, selling meaty soft-shell tacos topped with his signature homemade salsa. It’s so successful that he opens a brick-and-mortar within six months, which today has expanded into the multimillion-dollar restaurant chain King Taco.\n\n\n\n1983\nRubio’s—a chain specializing in deep-fried breaded fish tacos referred to as Baja style—opens in San Diego. Though popular among surfer bros in Southern California in the 1960s, fish tacos were eaten in Mexican seaside communities across the Pacific and Gulf Coasts long before any of the Beach Boys were even born. \n\n\n\n1989\nFast-food chain Taco John’s trademarks Taco Tuesday® nationally (except in New Jersey, where Gregory’s Hotel, of all places, holds the trademark and dares to also serve tacos on Thursdays). Both companies have held tight to their trademarks, much to the chagrin of LeBron James, who tried and failed to get his own in 2019.\n\n\n\n1994\nThe Mexican peso crisis—a sudden devaluation of the peso against the dollar—leads to mass migration across the border and beyond to places like Kentucky and New York. Regional tacos such as al pastor, placeros, and birria come too, expanding America’s taco horizons for good.\n\n\n\n2015\nWelcome to the world, taco emoji! After years of griping from taco-hungry typers around the world, an official Taco Bell petition, and multiple rounds of tacoless additions (including four types of mailboxes and 25 clocks), the Unicode Consortium adds to the official emoji keyboard a tiny taco, cementing its status as pop culture icon. Except…it’s a hard shell. The battle continues.\n\n   \n  \n\n     \n  \n\n  \n\n\nJorge Ramos\nUnivision News Anchor\n\n                “When my son Nicolas lived in Miami, I’d take him to Talavera—the best Mexican restaurant in town. Just the two of us. We’d get tacos de queso fundido con chorizo. These hot three-bite tortillas filled with melted cheese and meat were a taste of home. But more importantly, they were a way to connect my American-born son with his Mexican roots. To remind him that he’s the son of an immigrant. That kind of straight talk is easier with an excuse like food in front of you.”\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCooking in the Midst of a Border Crisis\n\nFor asylum seekers in Matamoros, Mexico, daily meals are about more than just survival.\nby MICHELLE GARCÍA\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOld El Paso Taco Seasoning Is Wildly Inauthentic. I Love It Anyway\n\nMom did what she could with the supermarket's Global Flavors section in our small town.\nby AMANDA SHAPIRO\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\nWhy Did It Take a White Chef to Pique My Interest in My Own Culture?\n\n\n\n\nMy path to becoming a taco expert was paved with internalized racism. Now I know better.\nby JAVIER CABRAL\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nRoy Choi’s Korean Tacos Are My American Dream\n\nFor comedian Margaret Cho, fusion is the finest form of flattery.\nas told to SASHA LEVINE\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\nBecky G\nMusician\n\n                “When I was growing up, my family would drive to Taco Dollar, a truck with dollar bills spray-painted all over it that parked in Inglewood, L.A. Sitting on crates outside, eating their asada tacos on tortillas made from scratch was a huge part of my childhood. With more recognition, it’s become harder for me to enjoy them at the truck. But we still go. Now my dad just buys them and we hide in the car to eat.”\n            \n\n\n\n\n\n\n\n\n\n    \n  \n\n  \n\n\n\n\n\n\nO Crunchwrap Supreme, How I Love Thee\n\nThrough life’s greatest, worst, and most hungover moments, this euphoric mash-up has been there for me.\nby GABE BERGADO\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBeet Tostada\n\n\n\n\n\n\n\n\n\nBeet Tostada\n\n\n“Many think Mexican food is heavy and meat-forward, but that came with Spanish colonization—before, it was mostly vegetables. I tapped into that tradition by seasoning beets with chorizo spices. An egg on top adds Texas-style breakfast taco vibes.” —R.M.\nGET THE RECIPE\n\n\n\n\n\n\n\n\n\n\n\n\nTony Gonzalez\nFox Sports Analyst and Podcast Host\n\n                “I always ask my guests on Wide Open what their last meal would be. For me the answer is most definitely the pork rib tacos from Escuela Taqueria in L.A. They are crispy, a little sweet, and have that perfect chewiness. It’s love and peace and joy all wrapped up into one scrumdiddlyumptious bite. When all I want is a comforting meal, I know I will always get it at Escuela Taqueria.”\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Are H-E-B’s Flour Tortillas So Dang Good?\n\nTexans know: These chewy, buttery beauties are a state treasure. But where did they come from?\nby ALEX BEGGS\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nI’m a Border Kid. This Is How I Cook.\n\n\n\n\nClaudette Zepeda doesn't need man-made boundaries around her life—or her food.\nas told to HILARY CADIGAN\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat Price Can You Put on a Taco Truck Taco?\n\nI come to my favorite New York City taco truck for the perfectly seasoned lengua tacos, but I stay for the community. \nby FRANCIS LAM\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\nTacos Were My Comfort, But I Had to Give Them Up to Get Pregnant\n\n\n\n\nSometimes, your salve becomes your kryptonite.\nby KATIE GUTIERREZ\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\nCristela Alonzo\nActor\n\n                “I love the bean-and-egg breakfast tacos from the Laredo Taco Company, inside a Stripes in the Rio Grande Valley where I grew up. Yes, I’m picking gas station tacos. Go with me on this. They’re simple but delicious and remind me of my mom, who used to cook double shifts at a Mexican restaurant for $150 a week. She had very little to work with, so her tacos had to be simple, just like these. When food reminds you of your own life, you know it was cooked with heart.”\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\nGoat Birria\n\n\n\n\n\n\n\n\n\nGoat Birria\n\n\n“I may get some hate mail for this, but I’m not that into the thin consomé traditionally served with birria. Instead of straining out all the flavorful aromatics nestled up against that slow-roasting goat meat, I purée them with the jus for a super-flavorful dip or drizzle.” —R.M.\nGET THE RECIPE\n\n\n   \n  \n\n     \n  \n\n         \n  \n\n  \n\n\n\n\n\n\nIt's Time We Give the Combo Platter the Credit It Deserves\n\nA plate of tacos, rice, and beans is a fixture of Mexican American restaurants. But it’s seldom celebrated.\nby PATRICIA ESCÁRCEGA\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTortillas in the U.S. Have Never Been Better—Here's Why\n\nA great taco must start with an excellent tortilla. The only question is, which one will you choose?\n\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\nThe Taco Truck That Saved My Marriage\n\n\n\n\nIs a love story even a love story if it doesn’t feature tacos?\nby ADA LIMÓN\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\nAtlanta's Most Exciting Taco Doesn't Come From a Taqueria\n\nGeorgia-based, California-born, Mexico-rooted chef Maricela Vega can sum up her complicated identity in this one dish.\nby ELYSE INAMINE\n\nREAD MORE\n\n\n\n\n\n\n\n\n\n\n\nRaúl Castillo\nActor and Playwright\n\n                “There's a taqueria in San Juan, Texas, called Taqueria Rios. It's low-key and run by the Rios family, who’s owned it for decades. The place has never changed. I started going there with my whole family—my parents, uncle, aunts, and cousins—when I was around 14. More than 20 years later, I still go every time I’m home for the tacos bistec. I rarely eat meat, but there are two situations in which I do: when my mom cooks and when I go to Taqueria Rios.”\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStrawberries? Tarragon? Rick Martinez shows us how to make salsa out of anything.\nREAD MORE\n\n  \n  \n\n  \n\n\n\n\nDuck Carnitas\n\n\n\n\n\n\n\n\n\nDuck Carnitas\n\n\n“Carnitas are my favorite taco in the universe. My dad makes a classic pork version, but here I use luscious slow-roasted duck confit with crispy duck skin chicharrones cooked in pork fat. Same texture, same flavor…but extra extra, just like me.” —R.M.\nGET THE RECIPE\n\n\n    Project Leads: Hilary Cadigan, Sasha Levine, Rick Martinez   Photo Editors: Emma Fishman, Michelle Heimerman, Allie Wist   Art & Design: Chris Cristiano, Bryan Fountain   Illustration: Miguel Reyes, Daniel Shepard   Development: Alexander Ratner   Social: Rachel Karten, Emily Schultz   Copy & Research: Brian Carroll, Joseph Hernandez, Joyce Pendola, Greg Robertson   Special Thanks: Aliza Abarbanel, Caitlin Brody, Christa Guerra, Rebecca Jurkevich, Julia Kramer, Alex Lau, Laura Murray, Michele Outland, Alp Ozcelik, Carey Polis, Adam Rapoport, Meryl Rothstein, Amanda Shapiro, Annalee Soskin", "date": "2020-02-13", "author": ["Condé Nast", "Lesley Téllez", "Manuel Gonzales", "Jennifer Zyman", "As Told To Hilary Cadigan", "Jorge Ramos", "Michelle García", "Amanda Shapiro", "Javier Cabral", "As Told To Sasha Levine"]}