{"id": "2ce64a347ff82f0fb895685eef1e58d6", "url": "https://www.bonappetit.com/story/when-did-healthyish-pizza-become-a-thing", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "When Did Healthy Pizza Become a Thing? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen Did Healthyish Pizza Become a Thing?Pizzerias are going back to the traditional pizza making methods to make airy, more easily digestible pies.By Priya KrishnaSeptember 7, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Anna HamptonFacebookTwitterEmailThere are few foods more synonymous with the term “guilty pleasure” than pizza. Not coincidentally, there have been countless, mostly disappointing attempts at bringing pizza into the realm of health food. See: cauliflower pizza, pita bread pizza, and the strange, protein-filled abomination that is “meat crust” pizza.But the most compelling example of healthy (or at least healthyish) pizza isn’t an attempt to banish carbs or pack in protein. It’s the pizzerias that are going back to traditional pizza making methods, and putting a little more time and energy into the ingredients and process. I’m talking about the soft, doughy pies at Una Pizza Napoletana in New York; the sour, light crust at Ops in Brooklyn; the crackled, pleasantly chewy slices at Timber Pizza Company in D.C., and more.It’s pizza that doesn’t make you feel like crap: It’s airy, more easily digestible, and not saturated with toppings—the dough is the main event.To be clear, Italians have been making pizza this way for centuries. In the U.S., chefs like Chris Bianco from Pizzeria Bianco in Phoenix and Chad Robertson from Tartine Bakery in San Francisco have been championing pizza made with quality ingredients, natural fermentation, and obsessive care since the ’90s and early 2000s, respectively. But their techniques are finally going mainstream, as slice joints are getting custom-made flour from Italian milling companies, and even milling their own grains in their basement.The secret to top-notch pizza starts with the flour. The problem with most pizza places, according to Marie Tribouilloy, co-owner of Ops, is that they use flour loaded with artificial chemicals—the wheat has been treated with pesticides, and the flour has been bleached to maintain the white color. “This distorts the fundamentals of the flour and makes it less digestible,” she says, killing off the nutrients and keeping mostly sugars and starches. According to Tribouilloy and many others, bad flour is partially to blame for the rise in gluten intolerance over the past few years (her pizza, she says, is eaten by gluten-free folk alike).Instead, at Ops, Tribouilloy uses flour from a few different sources, all certified organic. Daniela Moreira, of Timber, uses King Arthur Flour, which is chemical and bleach free. Both Anthony Mangieri, chef and co-owner of Una Pizza Napoletana and chef Daniele Uditi of Pizzana in Los Angeles work with Italian milling companies to produce their flour because, according to Mangieri, they “generally have a better understanding on blending wheats to make them work [for pizza].”Then there are the pizzerias that mill their own grains. At Etto in Washington D.C., red wheatberries and spelt berries are made into flour using a special mill from Austria, which uses a volcanic stone to grind and sift the flour. Similarly, at Scarr’s Pizza in New York, owner Scarr Pimentel uses a combination of heritage wheat flour as well as milled wheatberries for his pizza. The idea, Etto co-owner Amy Morgan explains, is that the more freshly milled the flour, the more nutrients it will contain. Plus, she says, the resulting texture of the pizza (“crisp, crunchy, light, chewy!”) is worth the effort.Step two to healthier pizza, it seems, is the yeast. Most of your everyday pizzerias use commercial yeast, which speeds up the fermentation process but doesn’t allow for the breakdown of the glutens in the flour that people tend to have a hard time digesting. At these new-wave pizzerias, “commercial yeast” is practically a dirty word. Most rely on natural leavening or wild yeasts, which means the dough can take anywhere from one to four days to ferment. It makes for dough that is far more flavorful; as Mangieri puts it, “light, weird, interesting, wild.”Even the toppings at these spots abide by the simple, natural route. Cheese is used but sparingly and from local, family-owned creameries. The vegetables are sourced from the farmers’ market (and also used in salads and other menu items, which are treated with the same care as the pizza itself). And the pizza is never over-topped, so that the dough can shine. “The dough should taste like something, like eating a delicious bread,” Tribouilloy says. “It’s not just a vessel for toppings.”Every pizza chef has their own tricks: Mangieri doesn’t refrigerate the dough, as he believes leaving it at room temperature gives it the highest level of digestibility; Morgan uses a special mixer that doesn’t heat the dough as it mixes, since heating the dough renders the pizza more dense; Wade Moises, the chef of Rosemary’s Pizza in New York, cooks his pizza at a lower temperature and for a few minutes longer than his peers, as he says this ensures there is no raw flour left over that the body can’t digest.At its core, pizza was never meant to be unhealthy food, says Uditi, who is originally from Italy. In the Mediterranean diet, it is actually one of the most balanced dishes out there: “You have good carbs from the dough, tomatoes, fiber, cheese that is full of good proteins,” he says. It’s just that so many American pizzerias have co-opted the process with poor ingredients and shortcuts.This wave of pizzerias, then, is not an innovation—just a return to pizza’s original form. “In Italy,” Uditi says, “we have always been eating healthy pizza.”A note on making pizza at home:The secret to the airy yet supremely nourishing pizzas Daniela Moreira serves at Timber is active yeast (which gives the pizza its pleasant tang), hand-kneaded dough, and fresh, vibrant toppings—like a garlicky carrot top pesto, plus thinly sliced carrots, pea shoots, and serrano chiles. Mastering her pizza at home isn’t crazy hard, but it does require some patience. Plus, Moreira’s carrot top pesto topping can be used in dozens of ways (pasta sauce! salad dressing! dipping sauce!) aside from pizza. Moreira recommends using King Arthur flour and she’ll often ferment her dough for up to 3 days, to ensure the glutens get fully broken down.Get the recipe:Herby Pizza with Carrot Top PestoThis garlicky carrot top pesto can be used in dozens of ways (pasta sauce! salad dressing! dipping sauce!) aside from pizza.View RecipeExplore Bon AppétitHealthyishSuperpoweredPizzaTrendsRead MorerestaurantsThis Slice Shop Is Low-Key Milling Its Own GrainsBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Priya Krishna"]}