{"id": "2cee788ba77295d4b011efe98db00473", "url": "https://www.bonappetit.com/story/verjus-san-francisco-design-tour", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "A Design Tour of San Francisco’s Rustic-Modern Wine Bar, Verjus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Little Things: A Design Tour of San Francisco’s Rustic-Modern Wine Bar, VerjusYears of intense antiquing, meat-slicer collecting, and general gallivanting through Europe gives the space its distinct vibe.By Cassandra Landry June 10, 2019FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailSan Francisco’s Financial District is quick-service-restaurant central, filled with long lines, terrible puns, and limp salads. Then there’s Verjus. The newest bar/restaurant/wine store/housewares shop from Lindsay and Michael Tusk of Quince and Cotogna fame, it’s a culinary wonderland that’s redefining what fast-casual means for the city.Enter through the wine shop and you’ll be transported to what appears to be a cross between a Spanish pintxo bar and a Parisian cave à manger (essentially a wine shop with snacks). But really it’s a scrapbook of the Tusks’ European adventures. The 30 tapas bars they’ve hit up in Spain inspired the sleek counter, where you can pick up some of the olives, tortilla española, and tinned fish on display (or order from the glowing menu) and then grab a table. The midcentury-style tables are made by French designer Pierre Chapo, whom the Tusks discovered in Provence; they then commissioned his son to build the chairs. The items stocked in an apothecary cabinet Lindsay nabbed at a notoriously cutthroat antique fair in Parma aren’t just for show; they’re also for sale. And in true cave style, you can buy a bottle of wine at the bar to take home—or settle in and make a night of it.This kind of casual is exactly what the Tusks craved—and something they wanted to share with their hometown. Here’s how they weaved it all together at Verjus.Photo by TollesonThe MenuIn lieu of paper menus, the Tusks created a maximalist marquee–like light box—inspired by the designs of Isaac Julien—that stretches the length of the dining room and features the more French leanings of the restaurant. Go ahead and stare.Photo by Aubrie PickThe SlicerMeet the Cadillac of meat cutters. Michael collects slicers—he has six—but this 1920s Van Berkel model on Verjus’ countertop is his favorite. “It’s meant to be a design piece but also functional when we need it,” he says. That workhorse slices about 600 paper-thin sheets of house-made charcuterie a night.Photo by Aubrie PickThe MusicWine director Matt Cirne and Michael bonded over the Replacements, so it’s no surprise they invested in a quality sound system here. In hi-fi nerdspeak, that means vintage Rogers speakers, a McIntosh pre-amp, and a McIntosh power amp to pipe their vinyl collections.Photo by Aubrie PickThe KnivesThe corners of Verjus are packed with mementos from the couple’s time spent roaming the globe, including these stunning cheese knives from Paris, hung as they’d be in a cave à manger.Photo by Christopher StarkThe CabinetIn its former life the cabinet served as a shop case for an apothecary in 1890s Florence. These days it displays housewares available for purchase, from French ceramics to Japanese cedar ice buckets.Photo by Aubrie PickThe Conserva BarThe 30 some-odd tapas bars the Tusks hit up over the years in San Sebastián, Barcelona, and Madrid inspired this set-up that focuses on the Spanish side of Verjus. The bar is made with the same elm used elsewhere in the space and crowned with a sleek yet functional stainless steel counter. All the chalkboard menu options are laid out on top—croissants, olives, and tortilla espanola—and behind it you’ll see 30 varieties of tinned fish, which you can eat with accompaniments like pimentón and lemon. “It’s about breaking down barriers,” Lindsay says. “You can order based on what catches your eye, which brings a certain amount of freedom.”Photo by TollesonThe CeilingLindsay imagined installing mirrors overhead—she loves how they bring more light into a room. But she couldn’t shake off the burgundy ceiling she’d seen at Le Baron Rouge, a blue-collar wine bar in Paris. She found a happy medium in this reflective oxblood-red paint made by Fine Paints of Europe with its high-gloss “Brilliant” finish.Photo by Aubrie PickThe Wine ShelvesLindsay hired local artisan Michael Mellon to create custom elm shelving that can fit magnums alongside regular bottles, like the cult favorite Vini Viti Vinci’s 2016 Vieilles Vignes. The design is inspired by the modern tables and chairs to create a harmonious look.Photo by Aubrie PickThe FurnitureDuring a trip to L’Ile sur la Sorgue in Provence, the Tusks discovered Pierre Chapo, a mid-century French furniture designer known for a warm, yet functional aesthetic. They fell in love with his work and ended up purchasing his round elm tables as well as commissioning Chapo’s son, also a furniture designer, to make chairs and smaller tables.Photo by Aubrie PickThe Knick KnacksLike the home of any good traveler, the corners of Verjus are packed with mementos from the couple’s time spent roaming the globe, from a model plane given as an opening gift by a close friend to a giant pig named Pierre atop the wine fridge. These cheeky planters were nabbed on a recent trip to Mexico City—you can find something similar on Etsy if you search “face planters” (really).Photo by Aubrie PickThe Table MiseEach table is set with tiny canteens of Santa Maria Portuguese olive oil, a mild varietal they discovered on a trip to Lisbon; a rotating selection of high-quality table salts (right now you’ll find shakers of Sel Guérande gray sea salt); pepper mills; and diner-style napkin dispensers that mimic the utilitarian offerings at tapas bars. It’s all meant to encourage you to make yourself at home. “You go through a lot of napkins when you have small plates!” Lindsay says.Photo by Aubrie PickThe LightsWhile you’re gawking at the ceilings, pay attention to the light. Those vintage nickel-plated brass pendants are by Luigi Caccia Dominioni and the blown-glass globes in the window are by Gino Sarfatti—two mid-century Italian designers known for their whimsical, yet minimalist creations made of stark metalwork and round glass. Lindsay found both at the same antique fair in Parma and quickly nabbed them, like a pro.Explore Bon AppétitDesignRestaurantsSan FranciscoRead MorerestaurantsHow Tiny Lou’s Turned an X-Rated History into Its Plush, Neon-Lit FutureGallery7 SlidesBy Angela HansbergercultureAre Restaurant Chairs Getting More Comfortable?By Alex BeggscultureWhat Does Your Restaurant Tote Say About You?By Alex DelanycultureWe’re Obsessed With This Restaurant’s Weird and Wonderful Instagram AccountBy Emily Schultz and Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-10", "author": ["Condé Nast", "Cassandra Landry", "Rachel Karten"]}