{"id": "2d090eee50150909c8be8fcbd15ea285", "url": "https://www.bonappetit.com/story/stop-expecting-plastic-straws", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "We’re All Adults Here—Stop Expecting Plastic Straws in Your Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWe’re All Adults Here—Stop Expecting Plastic Straws in Your DrinkAfter going through at least 1,000 straws in one day at a bar, Kelsey Ramage of Trash Tiki says enough is enough.By Elyse InamineMay 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailBack when Kelsey Ramage was tending the bar at Dandelyan in London (no. 2 on the World’s Best Bar list), plastic straws seemed like Swiss Army knives. Bartenders relied on them to taste cocktails in a quick and sanitary way before they went out to customers. Patrons needed them to sip drinks without getting a noseful of ice or garnish. And no one ever gave it a second thought.“Plastic straws were essentially another piece of serviceware,” says Ramage. “So it’s the last thing to go, even in nice restaurants or bars.”Ramage estimates Dandelyan churned through “thousands” of plastic straws any given day. The plastic straw epidemic is real, people (Dandelyan has since switched to compostable straws). According to the Plastic Pollution Coalition, over 500 million plastic straws are used each day. In the restaurant and bar industry, they have long been a seemingly necessary evil; they are to bartenders what metal tasting spoons are to chefs.But recently, hospitality giants are clapping back: Danny Meyer just announced Union Square Hospitality Group will start using biodegradable straws, McDonald’s is phasing out plastic straws in the UK and considering the same in the US, and even Alaska Airlines is looking for a compostable version. In New York City, we’ve seen restaurants like La Mercerie and bars like The Dead Rabbit opt for metal straws. Nyesha Arrington, the chef behind Native in Los Angeles, recently tipped us off on farmer Alex Weiser’s straw made of actual straw.Ramage, along with bartender Iain Griffiths, started Trash Tiki, a roving cocktail pop-up that teaches fellow bartenders how to bring sustainability to the bar—and have a little fun with it.“No one needs another lecture on how modern society is beating the shit out of Mother Nature on a daily basis,” Griffiths and Ramage write on their website. “It’s not about overhauling your whole program but taking the smaller steps....and hopefully we can get a few of your more serious cocktail jerks to lighten up, have some fun, and listen to some better fucking music for once.”We need to find a more sustainable presentation for this piña colada.\nPhoto By Alex LauThat begins with getting rid of plastic straws. After their rude awakening at Dandelyan, Ramage and Griffiths got to work, researching and testing out every type of straw alternative. Paper straws disintegrated before the drink was served. Metal straws messed with the mouthfeel. Sugar straws were just “absolutely horrible,” according to Ramage. Finally, they found their favorite: Panda Packaging, a super clean bamboo straw that doesn’t have the usual grassy aftertaste. (You can find more bamboo straws on Amazon, but Panda Packaging had the least aftertaste, per Ramage and Griffiths.)These are the straws Ramage and Griffiths bring with them on the road for their Trash Tiki pop-ups, but if you can’t track them down in time, make like Ramage and Griffiths when they run out of their supply. Rejigger your drink so it’s with crushed ice, on the rocks, or up; skip the straw; and make it the point of conversation.“When we explain to people why the drink doesn’t need a straw, they are usually pretty receptive,” says Ramage. “Only in a couple instances, people have been like ‘I need to keep my lipstick on.’”Her response? “Buy better lipstick,” Ramage says, with a chuckle.A summer cocktail you definitely don’t need a straw for:Explore Bon AppétitBarsCocktailSustainableRead MorecultureWhen Will the Tyranny of Paper Straws End?By Alex BeggsrestaurantsMission Chinese Just Reinvented the Tiki Cocktail (Hint: It Changes Colors)By Emily EisenPhotography by Alex LausponsoredLetting the Wine Do the Talking at Napa's Sustainable Frog's Leap WineryBy Edward JonesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Elyse Inamine"]}