{"id": "2d221989c797ad77453f95e93b725f7d", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/fellows", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Fellows Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoFellowsAmerican burgers that are better than burgers in America.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for a taste of Americana as interpreted by Japan. The Japanese have exerted a great amount of effort to adopt certain aspects of the American aesthetic (think high-quality denim, rock bands, and fashion tribes devoted to one particular style, like vintage denim or all black). It‘s only right, then, that the quintessential American foodstuff—the hamburger—would find a home here. Fellows makes every aspect of their charcoal-grilled burgers from scratch, with all the details handled as they would be at a high-end burger place in the States. When you taste one, you realize that you could be anywhere in America, but you’re here—and it might be even better.ORDER THE: double and make it a triple. With flavors like this, more is always more. The teriyaki burger—a patty glazed in sticky teriyaki sauce—is a great version of the Japanese classic that you can find all over the city. And the addition of a fried egg is always a good choice.THE VIBE IS: more American than America. With flea-market bric-a-brac and blues music, worn wooden walls and metal folding chairs, the scene is perfect. You could be in a Japanese daydream of what America is, or you could be lost in a pocket of fantasy where an America of yore has remained intact.PRACTICAL STUFF: Open Tuesday to Saturday from 11:30 a.m. to 4 p.m. for lunch and 6 p.m. to 10 p.m. for dinner. Open Sundays from 11:30 a.m. to 7 p.m. Closed on Mondays. The lines on weekends are long and they close shop early if they sell out for the day, so plan accordingly. The menu is in English and Japanese and the staff speaks some English. The nearest subway stations are Omotesando and Harajuku.Photo by Xavier Girard LachaîneThat classic yellow-red flavor duo, holding it down in the background.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}