{"id": "2d25de8c1569e513347dc1b2cb636f69", "url": "https://www.bonappetit.com/recipe/butternut-squash-steaks-with-brown-butter-sage-sauce", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Squash Steaks with Brown Butter-Sage Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueButternut Squash Steaks with Brown Butter-Sage SauceBy Anna StockwellSeptember 18, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintApplying the classic steakhouse butter-basting technique to slabs of butternut squash turns it into a hearty vegetarian main.Ingredients2 servings1large butternut squash (about 3 lb.), preferably one with a long thick neck1Tbsp. extra-virgin olive oil2Tbsp. unsalted butter, cut into pieces6sage leaves2garlic cloves, crushed1Tbsp. fresh lemon juiceKosher salt, freshly ground pepperPreparationStep 1Cut the neck off of squash; reserve base for another use. Trim the stem off the neck then peel. Resting neck on cut base, cut in half lengthwise, creating two lobes. Trim off outer rounded side of each piece to create two ¾\"-thick steaks (about 6 oz. per steak); reserve trimmed off sides for another use.Step 2Heat oil in a large heavy skillet over medium. Cook squash steaks, turning every 3 minutes, until deeply browned on both sides and fork-tender, about 15 minutes. Add butter, sage, and garlic to skillet, tilt pan toward you so that butter pools on one side, and use a large spoon to continually baste steaks with butter. Cook, basting, until butter is no longer bubbling, smells nutty, and is beginning to brown, about 1 minute. Remove from heat and stir in lemon juice; season with salt and pepper.Step 3Transfer squash steaks to plates and spoon sauce over.How would you rate Butternut Squash Steaks with Brown Butter-Sage Sauce?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made this recipe for dinner and made a couple of changes; I added walnut halves to the pan for some texture, and finished the sauce with aged sherry vinegar instead of lemon juice. It was delicious! I served it with farro and wilted baby kale. Will definitely be making this again!Louise MetcalfeCharlotte, NC1/3/2021Just made this recipe and I must say it was delicious. I made without sage so would love to redo to taste the difference. Either way, I will be adding this to my fave recipes list and making it again. Zaira De La CruzQueens, New York5/26/2020I wouldn't change a thing. This is delicious. Adeline MoyaParis10/27/2018Explore Bon AppétitAmericanButternut SquashSquashVegetableSageHerbs & SpicesFallWinterSideMainNut-FreeGluten-FreeVegetarianSautéThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Anna Stockwell"]}