{"id": "2d3202d4c46a3b633c6ba333b83507f6", "url": "https://www.bonappetit.com/story/saffron-rice-recipe", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "This Saffron Rice Recipe Is My Fullest Expression of Iranian Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Saffron Rice Recipe Is My Fullest Expression of Iranian FoodNotes from a lifetime of eating (and cooking) with saffron.By Andy BaraghaniFebruary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis post is part of Andy Baraghani's Guide to Modern Middle Eastern Cooking. Get all his recipes, tips, and stories here.I still get nervous every time I cook Iranian-style rice, even though I’ve done it—and spoken and written about it—hundreds of times. In my culture, cooking rice is a ceremonial process; it’s the true test of what makes a great cook of Iranian cuisine. Before I was barely able to reach the kitchen counter, I’d watch the women in my family go through the laborious steps of cooking rice. They’d rinse, soak, parboil, and steam, with a million little steps and secrets in between. The goal was to achieve fluffy, fragrant rice, not a single grain stuck to another or broken (that would bring shame to the family...and I’m only kind of kidding).But there was one rice dish that broke many of these sacred rules and steps. I remember being somewhat confused the first time I saw this dish, known as tachin, being prepared. My mother would take parboiled rice and mix it with yogurt, oil, and egg yolks, like she were making a cake. And she was, kind of: a savory rice cake. She would add a splash of saffron water into the batter, and pour it into a rectangular baking dish, layering a few slices of chicken breast in the center. It would go in the oven for about an hour, then she’d let it cool slightly before placing a platter on top of the baking dish, and with grace and courage, she would invert the baking dish onto the platter, revealing the deep, golden brown rice crust that formed on the bottom, the coveted \"tahdig.\" She’d finish it with a sprinkling of barberries, the tart shrub that she’d already plumped in warm butter and a bit of sugar to mellow its acidity. We’d cut square slices and eat them with handfuls of tender herbs. It was buttery, fragrant, and a little indulgent. Not having much of a sweet tooth, it became my favorite cake.When it came time to adapt the recipe for Healthyish, I knew there were a few things I wanted to change without damaging my reputation with my mother and the entire Iranian community. First and foremost, I wanted to use a pie pan so the tachin would be round and smaller than the long, rectangular ones I was used to. This recipe still easily serves four: I never felt tachin was that good after a day or two. Second, I left out the chicken so that it’s vegetarian, and, frankly, I didn’t miss the meat. Instead, I layer the rice with barberries (no big deal if you can’t find them; you can use dried sour cherries). I highly suggest you use a glass pie pan so you can check when the rice on the bottom has gone from a golden-orange hue to a caramelized crunchy crust.With just a handful of basic ingredients (and that decidedly non-basic ingredient, saffron), tachin is the full expression of Iranian food: beautiful, surprising, and deeply comforting.Make tachin:Crunchy Baked Saffron Rice with Barberries (Tachin)This stunning crispy rice, also known as tachin, is buttery and rich. It's easier to make than it seems.View RecipeStocking up on saffron and barberries? Check out Andy's 18 essential ingredients and where to buy them online.Explore Bon AppétitHealthyishSaffronRicePersianMiddle EasternRead MorecookingWhat Is Saffron, The World's Most Legendary Spice?By Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Andy Baraghani"]}