{"id": "2d38e3b8bba89b4fd19054e9a640f0d5", "url": "https://www.bonappetit.com/recipe/chicken-bacon-smash-burgers", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Chicken-Bacon Smash Burgers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueChicken-Bacon Smash BurgersBy Ali Slagle February 8, 20223.8(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, food styling by Pearl Jones, prop styling by Marina BevilacquaEmailPinterestPrintEmailPinterestPrintThe chicken burgers from Ali Slagle’s cookbook I Dream of Dinner (So You Don’t Have To) have a little secret—they’re cooked in bacon fat, which adds flavor and moisture to the ground meat. And that’s not all: The chicken meatballs are smashed into a thin layer and topped with thinly sliced onion and jalapeño, yielding browned, juicy burgers juxtaposed with the sweetness and heat of the charred vegetables. Layer it all onto a toasty bun with the crispy bacon and as much ketchup as you please, then wonder how only a handful of ingredients brought such big flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonHeavy Metal Spatula$4 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonIngredientsMakes 41lb. ground chicken2tsp. vegetable oil4hamburger buns8bacon slices (not thick-cut), halved crosswise, dividedKosher salt, freshly ground pepper1small red onion, very thinly sliced, divided1jalapeño, very thinly sliced, dividedKetchup (for serving)PreparationStep 1Working the meat as little as possible, roll chicken into 4 meatballs (4 oz. each); press down slightly to make tops flat.Step 2Heat oil in a large cast-iron skillet over medium-high. Working in 2 batches, toast hamburger buns, cut sides down, until golden, about 1 minute. Transfer to plates.Step 3Add half of the bacon to same skillet and cook until browned and crisp, about 2 minutes per side. Place 4 pieces on top of 2 of the bottom bun.Step 4Season 2 meatballs generously with salt and pepper. Place them far apart in skillet. Using a spatula, smash meatballs down as thin as you can (use another kitchen tool to drive the spatula down toward the skillet to help flatten the meat against it). Top each with about a quarter of the onion and the jalapeño; press into meat. Cook patties, untouched, until browned underneath, about 2 minutes. Flip over and cook until patties are cooked through and onion is golden, about 1 minute. Transfer patties to bottom buns with bacon. Repeat process with remaining bacon, chicken, onion, and jalapeño to make 2 more burgers.Step 5Close up hamburgers and serve with ketchup alongside.How would you rate Chicken-Bacon Smash Burgers?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI really like the smashing technique with the onions and peppers on top which cook upon flipping, but found the recipe seemingly unfinished with ketchup a weird and minimal pairing. Adding some Mayo and lettuce was a must, and I think tomato would have been a nice addition but I didn’t have any available.Erika Minneapolis MN USA 3/5/2022This was so delicious and super quick. I did step it up by serving it on homemade burger buns with some Bon Appetit slightly sweet quick pickled onions.  The mandoline really helped make the onion and jalapeno slices really thin and uniform.Julianne Renton Washington 2/20/2022Explore Bon AppétitDinnerLunch5 Ingredients or FewerOne-Pot MealsWeeknightEasyQuickNut-FreeDairy-FreeBurgerGround ChickenChickenPoultryBaconCured MeatMeatRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Slagle"]}