{"id": "2d3a21e6944121152e9de86ca8ee7a0a", "url": "https://www.bonappetit.com/story/intermittent-fasting", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "What's Intermittent Fasting, and Should We Be Doing It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat's Up With Intermittent Fasting, and Should We Be Doing It?Research shows not eating for stretches at a time could actually be good for your health.By Jennifer Bradley FranklinJune 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’m not great at diets. While my health-conscious friends try paleo, Whole30, and low-carb regimens, such restrictive measures put me off. If they don’t work, I’ve deprived myself for no good reason. Worse, if they produced great results, I’d feel like I’d never get to indulge in my favorite things (pasta! cheese! wine!) with abandon again. I’m probably not alone, given the recent flurry of interest around intermittent fasting (IF), a schedule of eating as opposed to a true diet. Advocates say simply changing your “feeding window” can boost metabolism, give the digestive system time to rest and promote lean muscle growth. If it worked for Hugh Jackman, Jennifer Aniston, and Miranda Kerr and won’t keep me from an occasional dessert, I wanted to know more.What is IF and why should one consider it?Fasting is any time you abstain from eating. It’s why our morning meal is called breakfast, literally breaking the fast after sleeping. IF strategically stretches that period. Two popular methods include the 16:8, with 16 calorie-free hours followed by eight hours of normal eating, and the 5:2, with two restricted days of approximately 500 calories interspersed among five normal calorie days.The potential benefits as a weight-loss strategy are compelling, says Jennifer McDaniel, a registered dietitian nutritionist (RDN). “Some researchers have shown that losing weight by IF can help preserve lean body mass and potentially be a more sustainable approach compared to chronic calorie cutting.” McDaniel, a spokesperson for the Academy of Nutrition and Dietetics, adds that studies have shown that IF may also reduce certain risk factors for heart disease, improve memory, lower risk for Parkinson’s and Alzheimer’s and lower systemic inflammation. The theory behind this is that when the body is in a fasting state, it stops producing as many growth hormones and proteins and can repair cells.But isn’t breakfast the most important meal of the day?“Medically there's actually no requirement whatsoever,” explains Dr. Jason Fung, a Toronto-based M.D. and author of The Complete Guide to Fasting. “When you don't eat, your body simply switches from burning food to burning body fat and sugar.” For a non-morning person like me, not eating until noon means one less reason to rush first thing. I like it already.But I work out. Is that safe?“Intermittent fasting helps with the maintenance of skeletal muscle mass, which is the opposite of what you'd think,” says Amanda Tress, founder of the FASTer Way to Fat Loss, a six-week online program built around IF. Before discovering fasting, the Florida-based mom of three struggled with high blood pressure and adrenal fatigue. She adjusted her diet and became a personal trainer, but she noticed that even clients who ate well and hit the gym regularly weren’t always seeing desired results. “I started experimenting with IF, and people started burning fat like you wouldn’t believe,” she says.Fung echoes those sentiments. “Your body has a giant store of calories. One pound of fat is roughly 3,500 calories, so most people have at least 10 [or more] pounds just sitting in our bodies. If you need it, your body will use it.”But I feel hungry.Eating every few hours is a habit for most, and we’re bombarded with ads and images of mouth-watering food almost constantly [I dare you to scroll through the BA recipes and not feel famished]. “It's not fun, but you can give your body the instruction it's okay to not eat,” Fung says. Staying properly hydrated is vital since dehydration can masquerade as hunger. Bored with plain water? Tress recommends adding lemon juice or drinking tea. Black coffee is also allowed in moderation. “You could try some bone broth or kombucha, as long as you stay under about 50 calories,” she says.It’s not for everyone.There are certain groups who shouldn’t try fasting, intermittent or otherwise, including women who are pregnant, trying to conceive or breastfeeding or anyone with a history of eating disorders. “If you have a history of thyroid issues, consult your physician before following an IF protocol as it may interfere with thyroid hormone production,” McDaniel adds.IF might get easier.In this food-loving writer’s experience, strategies for success help, but there’s no replacement for old-fashioned willpower. Initially, all I could think about was Vietnamese coffee and eggs, and I don’t even like eggs that much. I drank my pitiful water and forged ahead. Fast forward a few weeks and instead of restriction, IF feels like freedom. I don't have to think about scarfing down breakfast before my first meeting, and I have better mental clarity. I think I may have found my non-diet diet of choice.Explore Bon AppétitHealthyishTrendsRead MoreshoppingI Eat Dinner at 4 p.m. and Trust Me It’s GreatBy Jennifer Still Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-02", "author": ["Condé Nast", "Jennifer Bradley Franklin"]}