{"id": "2d4acab81b6a2ec949dfd3e5aac3dea3", "url": "https://www.bonappetit.com/recipe/steamed-kabocha-with-ginger-soy-dressing", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Steamed Kabocha Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueSteamed Kabocha With Ginger-Soy DressingBy Sohla El-WayllyJanuary 7, 20204.2(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintLife’s not all about roasted vegetables. When they’re steamed, vegetables come out refreshed and hydrated, as if they’ve spent a day at the spa. They taste like their best selves, ready to be zhuzhed up with a punchy ginger-soy dressing. It all happens in the time it would take to heat up the oven—and there’s no oily baking sheet to clean when you’re done.Ingredients4 servings3scallions, white and dark green parts separated, thinly sliced1garlic clove, finely chopped2Tbsp. seasoned rice vinegar2Tbsp. toasted sesame oil1Tbsp. soy sauce2tsp. honey1tsp. finely chopped peeled ginger1small kabocha or 2 acorn squash (about 2 lb.)1tsp. toasted sesame seedsPreparationStep 1Pour water into a large saucepan, wide skillet, or large wok to come 1\" up the sides and place over medium-high heat. Mix white and pale-green parts of scallions, garlic, vinegar, oil, soy sauce, honey, and ginger in a small heatproof ramekin. Set inside a large bamboo steamer off heat (or, if using a metal insert, don’t bring water to a simmer and fit into saucepan before adding dressing. Cover dressing with foil.)Step 2Cut squash in half; scoop out and discard seeds. Slice into ½\"-thick wedges. Arrange in steamer basket around ramekin, overlapping a little if needed (for metal insert, add as much squash as will fit without piling up, placing over dressing).  Set over saucepan (or turn on heat), cover, and steam until squash is tender (a tester, skewer, or paring knife should easily slide through flesh), 13–15 minutes.Step 3Transfer squash to a platter and top with scallion greens and sesame seeds. Serve with dressing alongside.How would you rate Steamed Kabocha With Ginger-Soy Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleEasy to put together if you have all the ingredients on hand. love that you can eat the skin of a kabocha squash, it makes prep quite easy! Could have made a little extra dressingCécileBoston, MA11/2/2021Throw the squash seeds away?? Why? Lightly toast them for a tasty snack, shell and all!Jersey City, NJ10/1/2020This has quickly become a lunch-at-home favorite; easy, healthy, riffable. It was great the first time, made as directed, and it was great the next four times adjusted to our tastes/fridge situation; swap the sauce for leftovers or your  favorite quick mix (but still cook it in a ramekin in the steamer, for gooey thickness and ease). Have fun with toppings; we liked toasted coconut with cardamom, toasted puffed rice with cumin and salt,  bonito, crumbled seaweed snacks etc etc (and always loads of scallions). I like to steam for more like 50 minutes, for really lavishly soft squashAnonymousBoston MA4/30/2020Explore Bon AppétitEast AsianAsianKabocha SquashSquashVegetableWinterQuickEasySideStarterDairy-FreeVegetarianHealthyishSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Sohla El-Waylly"]}