{"id": "2d553acbcee933f938f172bec41f6425", "url": "https://www.bonappetit.com/recipe/paccheri-with-shellfish-squid-and-tomatoes", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Pasta with Shellfish, Squid, and Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssuePaccheri with Shellfish, Squid, and TomatoesBy Ignacio MattosApril 17, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThink of paccheri as the big brother to rigatoni that will catch and be draped in so much saucy goodness. Yes, seafood cooks quickly, but sometimes it’s worth it to spend some time building layers of flavor into a sauce as you would with a big pot of ragù. For an over-the-top dinner menu, serve this with arugula with Italian plums, Romano bean salad, grilled red mullet, grilled bistecca, and brioche au rhum. We said over-the-top.Ingredients8 servings3medium tomatoes, halved, seeds and cores removed12oz. cleaned squid, bodies and tentacles separated6Tbsp. extra-virgin olive oil, divided, plus more for drizzling1½lb. small shrimp, preferably head-on, peeled, deveined, shells and heads reserved2cups dry white wine, divided6garlic cloves, thinly sliced1lb. cockles or Manila clams, scrubbed1lb. mussels, scrubbed, debearded½tsp. crushed red pepper flakes2lb. paccheri or other large tube pastaKosher salt1Tbsp. fish sauce (optional)1cup torn basilPreparationStep 1Grate tomatoes, cut side down, on the largest holes of a box grater into a medium bowl until only the skin is left. Finely chop skin and add to bowl.Step 2Cut squid bodies in half lengthwise, then cut each half crosswise into ½\" pieces. Place in a small bowl. Cut tentacles in half crosswise; add to bowl.Step 3Heat 3 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Add reserved shrimp shells and heads (if using). Cook, smashing down on shells and heads, until shells are beginning to brown, 10–12 minutes. Add 1 cup wine and cook until reduced by half and alcohol aroma is gone, about 5 minutes. Add 2 cups water and bring to a boil. Reduce heat to a bare simmer and cook until reduced by one-third, 15–20 minutes. Let stock cool 20 minutes, then strain through a fine-mesh sieve, pressing on solids, into a heatproof measuring glass (you should have about 1½ cups). Set aside.Step 4Wipe out pot. Pour in remaining 3 Tbsp. oil and heat over medium. Add garlic and cook, stirring occasionally, until just golden, about 5 minutes. Add grated tomatoes and cook, stirring occasionally, until tomatoes thicken slightly and begin to stick to bottom of pot, 6–8 minutes. Add cockles, mussels, red pepper flakes, and remaining 1 cup wine. Cover pot and cook, shaking occasionally, until cockles and mussels are open, about 5 minutes. Using a slotted spoon, transfer cockles and mussels to a medium bowl, leaving behind any that have not opened. Cover pot again and cook unopened cockles and mussels another minute or so, then transfer to bowl with others. Discard any that have not opened at this point. Keep shellfish sauce warm.Step 5Meanwhile, cook pasta in a large pot of boiling salted water, until just slightly under al dente, 6–8 minutes.Step 6Using a heatproof measuring cup, scoop out about 1 cup pasta water. Transfer pasta to pot with sauce with a slotted spoon or mesh spider. Add reserved stock and bring to a boil. Reduce heat to a simmer and add shrimp and squid to sauce. Cook, tossing constantly and adding pasta water a splash at a time as needed, until pasta is al dente and sauce is glossy and thick enough to cling to noodles, about 5 minutes. Add fish sauce, if using, and fold in steamed cockles and mussels. Taste and season with salt if needed.Step 7Transfer pasta to a platter. Top with basil and drizzle with oil.How would you rate Paccheri with Shellfish, Squid, and Tomatoes?Leave a ReviewTell us what you thinkExplore Bon AppétitPastaItalianEuropeanSquidShellfishSeafoodShrimpClamMusselMainNut-FreeDairy-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}