{"id": "2d6bc7796d5c20661f7ce94044e808e2", "url": "https://www.bonappetit.com/story/types-of-cinnamon", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "All the Types of Cinnamon, Explained | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDid You Know That There Are Different Types of Cinnamon?Not all cinnamon is created equal.By Alex DelanySeptember 27, 2018FacebookTwitterEmailFacebookTwitterEmailFrom here on out, your life will be split into two periods: the time before you read this article and the time after. Before, you were young and naive, an amateur in the world of cinnamon. After, well, after you read this, you’re going to be a cinnamon professional, a walking, talking cinnamon encyclopedia. You’ll know that all cinnamon isn’t the same. That there are different types of cinnamon that originate from and grow in different places. And they all taste a bit different from one another.Cinnamon is separated into two main categories: cassia cinnamon and Ceylon cinnamon. While both are harvested in sheets found beneath the bark of trees belonging to the same scientific family, they produce distinctly different products. The two types of cinnamon are differentiated by the way they are harvested, their taste, their smell, and the chemical compounds found within them. Let’s start with the most commonly available version: cassia cinnamon.Cassia cinnamon is what you probably know as cinnamon, the ground red-brown powder that’s found in spice cabinets and suburban grocery stores across the country and the world. Before it's ground, when it's in bark-like form, cassia cinnamon is rougher in texture, darker in color, and rolled in thicker sheets than Ceylon cinnamon. Cassia cinnamon’s potency is what made it the go-to for home cooks and industrial producers—it has a more intense flavor, so a little bit of that special powder goes a long way.There are three specific types of cassia cinnamon—Indonesian, Chinese, and Saigon—all with different levels of flavor and situations that they are best suited for. Indonesian cassia is the sweetest and most mild of the cassia cinnamons, and is the most common in America. Chinese cassia, on the other hand has a strong, bitter flavor. Chinese cassia isn’t as common in the States, and is mainly used medicinally in China. And then there’s Saigon cassia, which is intensely fragrant and flavorful, almost spicy, and generally our preferred cassia variety.Ceylon cinnamon really shines in spice-forward baked goods like morning buns.\nPhoto by Alex LauNow, let’s talk about Ceylon cinnamon, a variety sometimes referred to \"true\" cinnamon\" and native to Sri Lanka. If you ask us, this is the good stuff, and like most good things, it’s a little more expensive and a little harder to find at your standard-issue grocery store. When Ceylon cinnamon is harvested, the sheets that are taken from the tree are usually processed by hand and rolled into flat layers that are much thinner and finer in texture than those rolled from cassia cinnamon.And then there’s the taste. Ceylon cinnamon’s flavor and aroma are extremely mild and delicate—it definitely reads as \"cinnamon,\" but with subtle, almost floral notes in there. Tasting Ceylon cinnamon is like listening to your favorite vinyl record on a $4,000 stereo system, from the comfort of a leather Eames lounge chair, while cassia cinnamon is like listening to an mp3 version of the same album on the stereo in your friend Steve’s 1993 Honda Civic. You can still appreciate the music in the car, but...the chair. That’s where you want to be.Some people will tell you that that cassia cinnamon is \"fake\" cinnamon and Ceylon cinnamon is real cinnamon. This is not true. They are both real types of cinnamon, but we're inclined to think that Ceylon is a higher quality spice across the board. Using cassia cinnamon is totally fine, but Ceylon cinnamon is definitely worth seeking out, especially if you're a cinnamon-flavored dessert enthusiast. For the sake of your taste buds, your food, and the speakers in your friend Steve’s Honda Civic. Everyone wins.And then use that cinnamon in some banana pudding:Caramelized Banana PuddingThe classic we all know and love—but better.View RecipeExplore Bon AppétitCinnamonSpiceBakeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-27", "author": ["Condé Nast", "Alex Delany"]}