{"id": "2d6fb3224a6ab6668828ad5fe0f941da", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/manfreds", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Manfreds Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenManfredsThe still boundary-pushing, still neighborhood-y restaurant in Outer NørrebroFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: because chef Christian F. Puglisi’s seven-year-old casual wine bar offshoot of Relæ still feels pretty radical. Chefs from around the world have filled their tables with his family-style plates of charred veggies, that famous beef tartare, and bottles of natural wine, then went forth to spread the gospel. (At least that’s our take.) Puglisi makes this destination feel like a neighborhood spot as locals often stop for takeout (pro hotel tip!).ORDER THE: beef tartare; short ribs with rhubarb chutney; and potatoes with fermented mushroom cream. But if you can’t decide: Get the family-style tasting for the table.THE VIBE IS: casual, fun, easy—though if you didn’t reserve, getting a seat requires patience. Bonus: International food hipster is spoken here.PRACTICAL STUFF: Open every day for lunch, from noon to 3:30 p.m., and dinner, from 5 p.m. to 10 p.m.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEMirabellePlan a mini croissant- and yogurt-filled vacation at this café-like spot in NørreboroRelæLive a little with the Nørrebro tasting-menu restaurant that’s still making waves BæstPizza perfected in Inner NørrebroExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}