{"id": "2d82649f17292ba30af4d1afe853752e", "url": "https://www.bonappetit.com/story/buttered-toast-feud", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Make a Tarte Tatin This Weekend! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake a Tarte Tatin This Weekend!It’s apple season, after all.By Alex BeggsSeptember 14, 2019FacebookTwitterEmailDon’t wait too long before inverting this tart; the caramel will stick if it gets cold.Michael Graydon + Nikole HerriottFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Apple sauce tarte tatinI spent a small fortune on Honeycrisp apples last weekend and roped Christina Chaey into coming over and helping me make a tarte tatin. I wanted to accomplish a project in order to unlock the next level in the inner video game I call baking. Chaey brought a Heilala vanilla bean, a.k.a. “the good shit” and her line cook expertise. In the time it took me to peel one apple, Chaey had flown through three. I wore an apron while she was the one who stood over the pan, stirring a caramel. There’s a crucial step where you cook the apple “lobes” (not halves, but thirds) in caramel and wait for them to shrink. If, say, you start arguing about what the word “lobe” means, the apples might cook too long, the caramel evaporate too much, and you’ll realize when the whole thing is done and flipped precariously on a platter...that you made delicious apple sauce tarte tatin. We did our best. I poured some pink champagne. Pictured above, the Bon Appétit recipe photo. Below, our mushy buddy.Photo by Christina ChaeyUnlock the next level: Vanilla Bean Tarte TatinMmm plant butterThis week, Country Crock margarine, the container my mom kept in the fridge filled with congealed leftover spaghetti, announced a new oil-based spread called “plant butter.” As a general fan of exaggeration and poetic interpretation, I love it. Sounds so natural, so smooth, so spreadable. Just like good PR.Want this letter before it hits the website? Sign up for our newsletter!Who lives in a pineappleWe announced our Top 50 restaurant list this week and readers were excited to find their cities on the list (especially Dallas), and plenty had feedback. Instagram fan Jakeneilson screamed: “MATTS BBQ GUYS WHATS GOOD” (What’s good: the breakfast tacos.) Azfarbakar asked: “Did you guys use the SpongeBob font?” [Crickets]. Scott tweeted: “Has anyone on your staff ever been to Florida? This is the third year in a row with no restaurants from the third largest state in the country. It is comical.” Scott, I’m sorry, we have. Pghutch55 commented: “Sea urchin recipes??!!!! The otters love em” Okay!!A cornference“I don’t know how much you know about enzymology…” is one note I took at the Corn Symposium hosted by the food consulting company Topic48 last weekend. My nutrition goddess Marion Nestle kicked off the day of thought-provoking corn-tent with a Comic-Sans slideshow that derailed everything I ever thought about corn. Like corn on the cob smeared with plant butter? Well guess what, corn isn’t a toothy summer snack, CORN IS CAPITALISM. (We were at The New School.) Only a tiny percentage of corn grown in the U.S. is used for food, mostly, it’s for ethanol, animal feed, and starches, and crazy industrial products that are fillers in your breakfast cereal and fireworks. Alyshia Galvez, author of Eating Nafta, gave a riveting talk about the effect of American-exported corn in Mexico, where beautiful native corn varieties are getting harder and harder to find (while diabetes is getting too easy to find). A talk about corn in art by the food scholar Darra Goldstein delighted me to no end (see the propaganda poster from WWI above). Then my pal Francesco D’Angelo, the former anthropologist at the restaurant Mil, spoke about chicha, the creamy-tart-fizzy Peruvian corn beer, and poured everyone a cup from a giant plastic gas can, as they do in the Andes. When a produce-specific symposium comes to town, I’m telling ya, don’t miss it.Lotta lasagnaI made my first lasagna—!!!—on Sunday from Anna Hezel’s wonderful new cookbook Lasagna. You can trust every single recipe in this cookbook because no one, other than Garfield, loves lasagna more than Anna, who wrote this hilarious piece on the baked pasta last year. She has PASSION. She has IMAGINATION. And most importantly, she has TASTE BUDS. And look at her now, the book is blurbed by Jim Davis his lasagna-loving self! I made the mushroom lasagna, and it was smashing. I separated the task into four parts: Browning mushrooms, whisking bechamel, shredding various cheeses, boiling noodles. And it came together seamlessly (gaze upon my sweet child). Serve with Chris Morocco’s Italian restaurant salad and unbutton that top one. You know, on your pants.Pop-Tarts appearSuddenly in the office snack area, shared by four magazines, Pop-Tarts (no relation) appeared. And quickly disappeared. An overheard conversation in the hallway revealed employees staking out for the dropoff (around 11 a.m.), and then taking the entire stash (not okay). One BA staffer, Cristina Martinez, became...slightly fanatical. “Marty walked four flights looking for them yesterday,” Meryl Rothstein told me. But every time she toasts them, disaster looms. “She likes when it bursts into flames temporarily,” said Meryl. Jesse Sparks stepped in, and now he toasts them for her. “She’s almost started a fire on multiple occasions,” he said, “once for real, and twice—very close.”Unnecessary food meme of the weekIs that toast...oiled?Unnecessary food feud of the weekSpeaking of REAL BUTTER and toaster ovens, a podcast fan (Hi Bonnie!) wrote in: “Please settle the ultimate underground culinary debate: eating toast and bread butter side up or down? I’m a longtime proponent of butter side up as the most conventional way to eat toast, but the thought always lingers that butter side down is potentially a more practical way to get the toppings directly to the tastebuds. What are your thoughts?”Oh, we have them. “That’s gonna be a no,” said pretty much everyone. “That guarantees a gnarly texture on the roof of your mouth,” said Alex Delany. “Just eat straight butter,” suggested Aliza Abarbanel. A conversation derailed into the discovery that both Jesse Sparks and Sarah Jampel pre-butter their bread before toasting (in a toaster oven or oven) for an all-around better butter experience. This technique avoids dreaded, unevenly distributed cold butter splotches. “People with up-and-down toasters are living sad, sad lives,” said Jesse. (Jampel: “I wrote about this MANY years ago.” Sarah, it was 2015.) Carey Polis blurted out: “My friend once thought butter was cheese and ate a slice of it!” I can think of worse mistakes.Explore Bon AppétitBeggs NewsletterRead MorecultureCinderella Lattes, Lonely Tomatoes, and Butter BoysBy Alex BeggscultureMy Favorite Farmers’ Market Challenge RecipeBy Alex BeggscultureMake Minty Limeade This Weekend (Tequila Optional)By Alex BeggscultureCook the Cover! It’s FoolproofBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-14", "author": ["Condé Nast", "Alex Beggs"]}