{"id": "2d946abd4dcd32ab7243a56b94d5049d", "url": "https://www.bonappetit.com/city-guides/venue/murrays-cheese", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Murray's Cheese Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkMurray's CheeseA cheese lover's dream shop in the West VillageFacebookPinterestTwitterEmailCourtesy of Murray's CheeseGO HERE: for the best cheese selection in New York City and, really, the whole dang country. Murray's is a dairy mecca, no question.ORDER: cheese you can't find anywhere else. Murray's cheesemongers know their stuff and you should ask them questions, even if you don't know your Moses Sleeper from your Brie de Meaux. They'll help guide your choices and give you samples to try.THE VIBE IS: a gleaming, pristine shop that stacks shelves high with lots of specialty food items beyond cheese. Pick up some fancy pasta or local beers while you're there—or get a grilled cheese for lunch. This is exactly the kind of place to send your out-of-town friends who want to purchase a NYC food souvenir. For New Yorkers, there are classes several nights a week on cheese 101, mozzarella making, cheese and beer pairing, and lots more (You just might see a BonApp editor teaching one of them!).PRACTICAL STUFF: The West Village flagship store is open daily from 8 a.m. to 9 p.m. except on Sundays, when it opens at 9 a.m. and closes at 8 p.m. There's also a stand at Grand Central Market, and you can find Murray's-curated cheese at Kroger grocery stores across the country. Book classes here—they're fun.—Carey PolisWE ALSO LOVESOS ChefsWhere serious cooks stock up in the East VillageBuvetteTrès West Village, with hints of ParisDon AngieCheeky Italian-American in the West VillageExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Carey Polis"]}