{"id": "2d9a1fda05cc55989fc05c4bbabbf8fc", "url": "https://www.bonappetit.com/recipe/big-ass-beach-hoagie", "year": 2019.0, "month": 6.0, "day": 5.0, "content": "Giant Italian-Style Hoagie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBig Ass Beach HoagieBy Molly BazJune 30, 20194.8(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintHere's the situation: You're headed to the beach—or the park, or a music festival, or a bonfire (?!)—with a group. You need something you can make in advance that will withstand the long journey and impress the friends who only thought to bring Swedish Fish and a bag of popcorn. Here's the solution: This sandwich, which looks like it came from the Italian deli of your dreams and which you'll definitely want to eat whilst in a beach chair, watching the waves hit the sand (or the dogs scamper in the park etc.). While we love the trifecta of mortadella, soppressata, and cooked ham, feel free to get creative with the meats you choose. Just remember to get a mix of cured and cooked for an array of flavors and textures.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonParchment Paper$3 At AmazonLarge Basting Spoon$16.37 At AmazonPlastic Wrap$9.84 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients4 servings1head of iceberg lettuce½small red onion1½cups pickled peppadew or pepperoncini peppers, plus ¼ cup pickled pepper brine1cup jarred mixed giardiniera or 4 dill pickle spears⅔cup mayonnaiseKosher salt116x4\" loaf sesame bread or other Italian hoagie bread⅓lb. thinly sliced cooked ham⅓lb. thinly sliced mortadella⅓lb. thinly sliced soppressata⅓lb. sliced provoloneCoarsely ground black pepperPreparationStep 1Prep your veg! Cut 1 head of iceberg lettuce in half through the core. Peel off flimsy outer layers. Reserve one half for another use (perhaps this Iceberg Salad with Italian Dressing?). Cut remaining half in half again through the core (so you have two quarters), then thinly slice crosswise to create shreds. Peel  ½ small red onion and cut in half through the root. Thinly slice each wedge lengthwise so that you make wispy arcs. Cut 1½ cups pickled peppadew peppers in half.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Drain and finely chop 1 cup jarred mixed giardiniera. Aim for the veg to be the size of peas—you don't want huge pieces that will get in the way of your sandwich experience. Transfer to a small bowl. Stir in ⅔ cup mayonnaise; taste and season with salt.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Slightly overlap 2 sheets of parchment paper to create 1 larger sheet. Cut 16x4\" loaf sesame bread in half lengthwise with a serrated knife and place on parchment. You will build the sandwich on parchment for easy wrapping and cutting.Step 4Spread giardiniera mayonnaise on cut sides of bread with a large spoon.Step 5Layer ⅓ lb. thinly sliced cooked ham, ⅓ lb. thinly sliced mortadella, ⅓ lb. thinly sliced soppressata, and ⅓ lb. sliced provolone on bottom half of bread, folding or draping as necessary to keep it tidy and within confines of bread.Step 6Spread onion and peppadew peppers over meats and cheese.Step 7Top with shredded lettuce. It will seem like a lot and you may not think it's possible to pack it all on—but have a little faith and don't hold back. Once you close up the sandwich, the lettuce will compact down quite a bit and you'll be grateful you piled on more than you thought was necessary.Step 8Drizzle ¼ cup pickled pepper brine over lettuce. (Acidic, spicy, and slightly sweet, pickle brine is one of our favorite stand-ins for vinegar or lemon juice.) Season lettuce generously with salt and pepper. Gather up overhang of parchment paper and securely wrap. Cut in half with your serrated knife. Make a sawing motion (rather than a pressing one) so that you're not squishing your sandwich.Step 9Wrap entire hoagie tightly in plastic wrap, then cut crosswise into 4 even sections. (The plastic wrap acts sort of like a girdle, holding in all of the meat, cheese, and veg so that they won't fly out when you slice smaller segments. It also acts as an insurance against leaking.) If you're taking your sandwich out into the world, wrap again in plastic or slip back into bread bag for easy transporting.How would you rate Big Ass Beach Hoagie?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI’m sure this is very tasty, but it is NOT a Hoagie.\n\nA Hoagie never and oh, I do mean NEVER has mayonnaise on an Italian.\n\nNevah.Philly BoyPhilly 3/17/2022Great flavors. It was just a touch hard to keep in one piece but the messiness makes for a great sandwichcbruett7/19/2020Mayo on a hoagie is not a hoagie. Olive oil and oregano. Anonymous6/3/2020Love it. I've made it to take on my last two camping trips, and will make it in the future. It's rich yet not heavy, it hits all the sweet/sour/buttery notes that you could want in a sandwich, and you can pretty much riff on it however you want to... It's really just a big-ass hoagie.AnonymousCully, Portland, OR5/23/2020This was so good! Paul0358Oklahoma9/20/2019Looks like a reduced version of Muffuletta.\nthechewinn_novaNoVA (Northern Virginia)7/16/2019THIS. WAS. DELICIOUS. Saw it on my Instagram in the morning, was eating it at a friend’s (not-beach) apartment eight hours later. Peppadews were a hit - not to be missed. My supermarket didn’t have giardineria (not that I could pronounce it anyway) so I subbed with Grillo’s Italian dills. Forgot the mortadella and still lived. Go make this sandwich!Alice AleksandrovichNYC7/2/2019Explore Bon AppétitSandwichItalian AmericanAmericanProvoloneCheeseHamMeatMortadellaCured MeatSoppressataSalamiIceberg LettuceLettuceLeafy GreensVegetableQuickEasyWeeknight MealsMainSuper BowlFourth Of JulyMemorial DayLabor DayLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-30", "author": ["Condé Nast", "Molly Baz"]}