{"id": "2da9a99e1e718fa5c33a1b8fe696af38", "url": "https://www.bonappetit.com/story/kopitiam-review", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "Kopitiam Is a New All-Day Cafe That Feels Like It’s Been There Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe New All-Day Cafe That Feels Like It’s Been There ForeverNewly expanded Kopitiam has the Malaysian food we crave at a shockingly affordable price.By Jasmine LeeAugust 30, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailAlong with Vignelli plates and Maldon on sliced avocados, one of my simplest pleasures used to come on steamy Sundays, after strolling leisurely past long and very fashionable brunch lines on Canal Street, into the tiniest cafe next door called Kopitiam. Squeezing onto a stool, I’d rub elbows with my fellow Chinese-speaking neighbors and prepare to lose myself in a bowl of cold, briny sesame noodles. Between the soft scent of pandan leaves and coconut milk and funky hits of sambal belacan—I always left wanting more variations on the unique Nyonya flavors and textures than Penang-born chef and owner Kyo Pang could churn out of her shoebox-sized storefront.Imagine the despair I felt when the news of a 25-percent rent spike came. It seemed like an inevitable nail in the coffin for the neighborhood’s most welcomed new spot (they opened in 2015). But six months after moving out of her first location, Pang, with her new business partner Moonlynn Tsai, has returned triumphantly with a newly expanded Kopitiam, now an all-day-cafe decked out in industrial modern and tropical flourishes, just a block from where it used to be.Pouring Kopitam's Iced Milo Dinosaur drink.\nPhoto by Chelsea KyleCome on the weekend and you’ll try to (unsuccessfully) resist ordering everything off the new daily specials board. If you’re lucky, Pang has sourced the ingredients to make assam laksa—its rich broth a result of simmering fish bones for hours until they dissolve. And hopefully they haven’t sold out of beef rendang. Fragrant lemongrass and coconut milk features prominently in this dry, slow-cooked curry, which is expertly cut with a hint of tangy tamarind and chiles. In the oyster omelette, each bite of oyster hides in barely set eggs, held together by a sheer batter of sticky sweet potato flour, which forms a delicate crisp around the edges. And for under eight dollars, there are familiar offerings like nasi lemak, which features umami-rich anchovies that are dry-fried with peanuts and chili oil, or pulut panggang—sticky rice stuffed with lemongrass and dried shrimp, wrapped and steamed in banana leaves.“The contrasting flavors must move around the palate like a full circle. I’ve learned many life lessons from that basic philosophy,” Pang says about the hallmark characteristics of Chinese Peranakan cuisine. Known more popularly as Nyonya cuisine (an adapted Portuguese word for “young girl” or “woman”) throughout Southeast Asia, the food carries with it a proud matriarchal culture, led by rough and tumble brides who, generations ago, endured displacement, slavery, and colonization. As a third generation Nyonya who came out to her family as gay the same year she opened shop, Pang sees food as a link between her family’s past and present. She painstakingly makes just about everything including her sauces from scratch, sourcing fresh pandan leaves from Thailand to ensure her dishes don’t miss a beat.Kopitiam's Pulut Panggang.\nPhoto by Chelsea KyleFor Pang, nothing is more nostalgic than a bowl of soft-poached eggs in mushroom soy sauce and a side of buttery kaya toast, its pandan jam oozing out like molten jade. (Go ahead, follow the lead of the local high school students one table over and dip the toast in your eggs.) This classic combination of sweet and salty remains a generational staple at every kopi tiam (a Malay-Hokkien portmanteau for “coffee shop”) in Southeast Asia, where the vitality of a neighborhood’s social life may have once been measured by stacks of coffee, tea, or Milo-stained porcelain cups.Here in New York, where neoliberal kitsch and rising rents continue to encroach on the local cha-chaan-teng, Pang goes beyond nostalgic recreation. In just three years, she’s established bonds with regular customers, many of whom come from Chinese families in the neighborhood. Despite Kopitiam’s expansion, she stays set on serving the working-class community that remains. At the end of your meal, you can smile knowing that you’ve got enough change left to buy dessert—a sweet potato mochi stuffed with sandy palm sugar and shredded coconut—to eat on the road as you pass the brunch lines, which only continue to grow.Explore Bon AppétitHealthyishRestaurantsNew York CityNew YorkMalaysianRead MoreLifestyle29B Teahouse Is the One Place Where I'm a Regular in NYCBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-30", "author": ["Condé Nast", "Jasmine Lee"]}