{"id": "2dac978a5f54cfdf23e83669068d805f", "url": "https://www.bonappetit.com/recipe/ina-gartens-raspberry-baked-alaska", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Ina Garten’s Raspberry Baked Alaska Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueIna Garten’s Raspberry Baked AlaskaBy Ina GartenNovember 1, 20184.8(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintThere are three types of meringues. French meringue is the basic version with egg whites and granulated sugar, Italian meringue uses sugar syrup instead of granulated sugar, and Swiss meringue—which I use here—is made by first heating egg whites and sugar over a double boiler before beating them. It makes a dense, glossy, marshmallow-like meringue, which is perfect over a scoop of ice cream and slice of pound cake to make a baked Alaska. This is a ‘WOW’ dessert that you can make ahead, freeze, and bake just before serving.Reprinted from Cook Like a Pro: Recipes & Tips for Home Cooks. Copyright © 2018 by Ina Garten. Photographs by Quentin Bacon. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Ingredients6 servingsFresh Raspberry Sauce1(6-oz.) package fresh raspberries½cup sugar1cup (12 oz.) seedless raspberry jam, such as Tiptree1Tbsp. framboise liqueurCake and Assembly1(1-lb.) store-bought pound cake1pint raspberry sorbet, such as Ciao Bella1pint vanilla ice cream, such as Häagen-Dazs8extra-large egg whites1½cups sugar2tsp. vanilla extract½tsp. cream of tartar½tsp. kosher saltPreparationFresh Raspberry SauceStep 1Bring raspberries, sugar, and ¼ cup water to a boil in a small saucepan over medium heat. Reduce heat to medium-low and simmer 4 minutes. Transfer raspberry mixture to a food processor fitted with the steel blade. Add jam and liqueur and process until smooth. Transfer to an airtight container and chill.Step 2Do Ahead: Sauce can be made 1 week ahead. Keep chilled.Cake and AssemblyStep 3Slice cake into six ½\"-thick slices. Cut out six 2½\"-diameter circles—one from each slice—with an unfluted round cookie cutter; discard scraps. (You can also use a small knife.) Place rounds 2\" apart on a flat dish that will fit in your freezer.Step 4Soften sorbet and ice cream just enough to be able to scoop them with a standard 2¼\"-diameter ice cream scoop (15–30 seconds in the microwave works). Fill half the scoop with sorbet and the rest of the scoop with ice cream. Arrange scoop of sorbet/ice cream flat side down in the center of each round. Freeze until ice cream is very hard, at least 30 minutes.Step 5Meanwhile, preheat oven to 500°. Heat egg whites and sugar in a medium heatproof bowl set over a saucepan of barely simmering water, whisking constantly, until a candy thermometer registers 120° and sugar is dissolved. Pour mixture into a large bowl. Add vanilla, cream of tartar, and salt. Using an electric mixer on medium speed, beat 1 minute, then increase speed to high and beat until egg whites form stiff, glossy peaks, about 5 minutes.Step 6Transfer rounds to a parchment-lined rimmed baking sheet. Working quickly, spread meringue with a spoon or small spatula over rounds and sorbet/ice cream, making lots of peaks all over with the back of the spoon. (You can also use a pastry bag fitted with a large fluted tip and pipe meringue thickly around each ball of ice cream and cake.) Be sure all of the sorbet/ice cream is covered with meringue. Bake, rotating pan once halfway through, until edges of meringues are browned, 2½–3 minutes. Divide among plates, drizzle fresh raspberry sauce around meringues, and serve immediately.Step 7Do Ahead: Baked Alaskas can be assembled 3 days ahead. Keep frozen—but don’t cover them, because the meringue won’t freeze hard and you’ll ruin the piping. Bake before serving.How would you rate Ina Garten’s Raspberry Baked Alaska?Leave a ReviewTell us what you thinkExplore Bon AppétitFrozen DessertDessertRaspberryBerryFruitNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Ina Garten"]}