{"id": "2dba02ac8a016634b66e793eda7d0b56", "url": "https://www.bonappetit.com/story/mushroom-farm", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "I Ordered a Mushroom Farm, and a Week Later I Had Mushrooms | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI Ordered Two Bags of Dirt, and a Week Later I Had MushroomsOrdering an organic mushroom kit was the best decision I've made since I started self-quarantining.By Toniann FernandezApril 24, 2020FacebookTwitterEmailPhoto by Laura Murray FacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I was three weeks into quarantine and out of my job as a restaurant manager when two mushroom blocks arrived at my doorstep. They had come via Smallhold, organic mushroom growers whose“minifarms” can usually be found fruiting fresh fungi in restaurants around NYC.  When the coronavirus outbreak shut these restaurants down, Smallhold kept farming, and began sending spores to apartments all over the city.I thanked the gloved, masked delivery person for what looked like big plastic bags of dirt inoculated with mycelium, the living organism from which mushrooms grow. So were born Sturgeon and Roe, my blue oyster and lion’s mane fraternal mushroom twins.I spritzed the blocks through holes cut in the bag and over the next week, my mushrooms seemed to unfurl and develop by the hour, growing taller, wider, and shifting colors from the deep blue of a shark’s skin to pearlescent grays and browns. Textures changed. The lion’s mane grew from knobby to puffy, and the oyster mushrooms’ stalks shone like baleen teeth.Their development was obviously remarkable, but another remarkable thing happened: I was going to sleep excited, and waking up excited too. With Sturgeon and Roe blossoming, I felt connected again. I found myself monitoring not only the growth of my fungi, but checking in on the progress of others on Smallhold’s Instagram. I salivated over images of gourmet mushrooms growing in the hands of people who know what to do with them—chefs, servers, food nerds.Mushrooms are the fruit of an underground internet. Their mycelium threads create vast subterranean networks by which the mushrooms find nutrients and communicate with each other (and other plants too). Bringing a mushroom block into your home feels like plugging into that internet, connecting to other growers while keeping a safe distance, and, of course, enjoying the delicious results.Plug in with Smallhold: Lion's mane or blue oyster grow kits, $30. Blocks will fruit up to three times, yielding up to three pounds of mushrooms.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishShoppingMushroomHealthyish Loves ItRead MoreCoronavirusThis App Helps Me Cook With What I Have Instead of Heading to the Store AgainBy Nayantara DuttaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Toniann Fernandez"]}