{"id": "2dd6286616b55f97ea020850374f9bdc", "url": "https://www.bonappetit.com/story/healthyish-homecoming", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Healthyish Homecoming is on June 9th: Here Are 12 Burning Questions That'll Finally Be Answered There  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle12 Burning Questions That Will Finally Be Answered at Healthyish HomecomingWe're so excited to hang IRL.By The Healthyish TeamMay 10, 2018FacebookTwitterEmailFacebookTwitterEmailHealthyish Homecoming is a month away! It’s full of inspiring conversations with a next-level lineup of people changing the way we think about wellness. And, of course, this all-day hang at the 1 Hotel Brooklyn Bridge will have plenty of feel-good food to keep you powered up from A.M. stretch to cocktail time. Trust us: You gotta be there. Not just for the new friends and the good vibes, but for the ~ knowledge ~! Because we've got questions, and we know you do too. Here are some things we’re excited to (finally!) get to the bottom of:Will Alison Roman bring The Cookies to her entrepreneurship panel—and will we have to share?!Is CBD really going to turn us into the chillest/most productive people alive?How can we understand more about food sovereignty, and what can we do to promote food access here and around the world?How many face masks, body scrubs, and crystals can one person reasonably pass off as self-care? And is it really self-care if your bank account is struggling?Where can we find more diverse, inclusive “natural beauty products?” And how can we get that coveted dewy glow without, um, putting chemicals on our faces?How much kombucha does Health-Ade CEO and co-founder Daina Trout drink in a day, and can we get in on that unlimited supply?How is Yemi Amu’s Oko Farms cultivating freshwater fish in the middle of Brooklyn, and... can we feed them?How is Reem Assil making social justice into a sustainable business model at Reem's California and beyond?How does Alisha Ramos make staying in look as good as it feels with Girls’ Night In? Does she get Instagram-induced FOMO like the rest of us?What does Nzinga Knight’s non-alcoholic, spicy-sweet Brooklyn-made sorrel taste like?How is Black Girl in Om founder Lauren Ash reinventing the wellness industry and how can we do it like her?And can we all camp out at the 1 Hotel when this whole thing is over?Healthyish Homecoming is happening on June 9th at 1 Hotel Brooklyn Bridge. It's a day full of good food and good vibes, with panels, one-on-one mentoring sessions, and time to hang IRL with the Healthyish community. Buy your tickets before they sell out!Explore Bon AppétitHealthyishRead MoreLifestyleIntroducing Healthyish Superpowered: A New Kind of Dinner PartyBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "The Healthyish Team"]}