{"id": "2de68891c38260e398bd0bf90db6e97a", "url": "https://www.bonappetit.com/recipe/garlic-miso-butter-mashed-potatoes", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Garlic-Miso Butter Mashed Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueGarlic-Miso Butter Mashed PotatoesBy Brad LeoneOctober 19, 20213.7(37)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrint“A couple of spoonfuls of miso adds a little extra umami and saltiness to these spuds, a subtle bridge between the roasted garlic and dairy that nobody will quite be able to put their finger on. And yes: These potatoes are actually mashed. I’m not going to stop you from pulling out a ricer or food mill if supersmooth is your thing, but I personally like a bit of texture—a few bits of intact potato remind you that you’re actually eating, you know, potatoes.” —Brad Leone, video hostAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronPotato Masher$10.19 At AmazonVegetable Peeler$10 At AmazonNordic Ware Naturals Quarter Sheet Pan$22 At Amazon (Pack of 2)Wooden Spoon$6 At AmazonLarge Pot$55 At AmazonIngredients8 Servings2heads of garlic1Tbsp. extra-virgin olive oilKosher salt1cup (2 sticks) unsalted butter, room temperature2Tbsp. white or yellow misoFreshly ground black pepper4lb. medium Yukon Gold potatoes1½cups heavy creamPreparationStep 1Preheat oven to 350°. Cut ½\" off top of each head of garlic to expose just the tops of the cloves inside. Place on a 12\"-square piece of parchment paper or foil. Drizzle with oil and season with salt. Drizzle 1 tsp. water over.Step 2Bring edges of parchment up and over garlic and fold together to make a packet and seal. Place on a small rimmed baking sheet and bake until very tender, 60–75 minutes.Step 3Let garlic sit until cool enough to handle, then squeeze out cloves into a medium bowl. Add butter and mash together into a paste with a wooden spoon or stiff rubber spatula. Add miso and mix well. Season garlic-miso butter with salt and pepper; set aside.Step 4Peel and quarter potatoes. Place in a large pot and pour in water to cover by 1\"; season generously with salt. Bring water to a boil over medium-high, then reduce heat and simmer gently, stirring occasionally, until potatoes are very tender (a tester or paring knife should easily slide into flesh), about 20 minutes from the time water starts to simmer. Drain potatoes and let sit 5 minutes to dry out; reserve pot.Step 5Bring cream to a simmer in reserved pot over medium-high. Remove from heat and return potatoes to pot. Set aside about 3 Tbsp. garlic-miso butter for serving and add remaining garlic-miso butter to pot. Using a potato masher (or use a potato ricer or food mill if you prefer a silkier texture), smash potatoes until mostly smooth; taste and season mashed potatoes with salt.Step 6Transfer mashed potatoes to a large shallow bowl. Top with reserved garlic-miso butter and season generously with more pepper.Do ahead: Mashed potatoes can be made 2 days ahead. Cover and chill potatoes and reserved garlic-miso butter separately. Reheat potatoes over medium, stirring often and adding ¼ cup milk or water to thin if needed.How would you rate Garlic-Miso Butter Mashed Potatoes?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI read the reviews beforehand and adjusted the amount of cream to put in and ohhhh boy, the taste was so good with the garlic. Would probably put in less butter next time for the sake of my belly fat though RebeccaJapan 1/10/2022Made these for Christmas dinner and, as others have noted, the flavor-profile is great but the recipe is a mess. I halved the butter and used only 2 Tbsp of cream; the potatoes were delicious but still bordering on too creamy. On reheating today they turned very soupy — much more so than any mashed potatoes I’ve ever made before. It’s just speculation but I wonder if the amylolytic enzymes in the miso work to break down the potato starch over time.AndrewAnaheim, CA12/26/2021At first glance I knew I wanted to make these for their flavor profile. After a more in-depth look, I instinctively knew that there was way too much butter and cream, (hadn't even looked at the reviews until afterward) both of which I reduced drastically. I always keep roasted garlic paste in the fridge and had just happened to make a new batch the day prior, so I was ready to go. Topped with thinly sliced scallion greens, the potato mash made a great companion to our Braised Asian-Style Pork Shanks.Russell HartmanLanghorne, PA12/6/2021I made the epic mistake of making this for Thanksgiving.  It.was.awful.  I followed the recipe precisely, but if I had wanted soup, I’d have made soup.  Frantically adding a ton of flour (unfortunately no potato flour on hand) and whipping furiously, it was *just* fit to serve.  My potatoes were perfect, but the rest of the ingredient portions were way off.\n\nI suggest BA removes this one until they’ve tested it properly.  JudyGBerlin, Germany12/4/2021I made these for Thanksgiving and they turned out fantastic. At first when I put everything together it seemed like it was going to be too liquidy, but then I stirred the potatoes like mad with the masher, whipping them into a frenzy and suddenly they came together to form the perfect texture. You really need to put some muscle into it to get the potatoes fully incorporated with the cream and butter. But the end result was amazing.JoannKBCLos Angeles, CA12/3/2021I cooked this dish on Thanksgiving and I actually had a different experience from everyone else - I followed the recipe exact as written out (although I only had one head of garlic in my kitchen instead of using two) and it came out perfect! The consistency wasn't watery at all. Great flavor, even with less garlic, and it was very creamy (not soupy!). Next time I would personally add a bit more miso, although with the proper amount of roasted garlic I'm sure it might've been more well-balanced in its flavor profile. I will say that one thing I did was make sure to lay out my potatoes after boiling them and completely dry them out. That's the only contributing factor I can think of that led to a creamy, non-watery/non-soupy consistency like so many others' resulted in. Great, easy recipe!AJCA12/2/2021Okay so I’ve made dozens of BA recipes and I’m pretty good at making mashed potatoes, and I was intrigued by the addition of miso so gave it a shot. Epic fail. Potato soup. Way too much butter or cream or both. I should have known. Someone got the measurement wrong in the test kitchen. Basically inedible. Disappointed Thanksgiving guests. And by the way, what’s with a recipe using 4 lbs of potatoes when a standard bag of potatoes is 5 lbs? Do better.Jeffrey WFalmouth, Maine11/26/2021Heed the warning about thin, soupy potatoes! I cut the butter and cream down significantly based on reviews (1 stick, 2/3 c). The flavor was delicious and they started out perfect texture, but by the time we went back for seconds they were runny and they were soupy by the end of the meal. I don’t get it- starches usually firm up. Might do 1/2 stick butter, tablespoons of cream next time. Sara M11/26/2021Brad, we love you--we do, but, these potatoes were not it, man. Flavor was fantastic, but no matter what we did and how many extra potatoes we added, they were still so watery. I wonder if the miso was breaking the potatoes down?  Mckenzie WyllieMinneapolis, MN11/25/2021These turned out so watery. I had a feeling it was too much cream, so I dialed back and it still turned out watery. I love butter- but it was way too much butter. The bigs of roasted garlic was nice, would add more miso. EliseChicago, IL11/21/2021I agree with others great flavor, but don't make them ahead of time unless it's a hearty potato soup your after...Merlin11/17/2021Loved the addition of miso to the mash! Like the others though, I too found these too liquidy by the end. Personally I thought there was too much butter, so next time I’d cut it down. Maybe some of the cream too. SpatulaCityLos Angeles11/10/2021I made these for my annual Friendsgiving party. The flavor was on point! It was interesting enough to delight the foodies but familiar enough to make my dad happy too (he's the type who has stuck with the same tried and true recipes for decades). I agree with the other reviewer that they were far too watery. When they were freshly mashed they were perfect, but as the night went on they turned into a slop. I'll make the miso garlic butter again but err on the side of way less cream.LuPittsburgh, PA11/9/2021I tried this recipe last night.  It came out way too liquidy.  Taste was good though.  If I make again, I would increase the garlic and miso, and decrease the cream and butter.AnonymousPhiladelphia, PA11/8/2021I’m making these tonight! I will post my review!! Laurie G. Williamsburg, VA11/3/2021Explore Bon AppétitGarlicVegetableMisoCondiments, Sauces & PastesMashed PotatoesThanksgivingVegetarianDinnerSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Brad Leone"]}