{"id": "2dea41bff02679f7ad75f2ace2f51048", "url": "https://www.bonappetit.com/story/joy-of-cooking-2019-edition", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "A Case for Three Copies of the Joy of Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Case for Three Copies of the Joy of CookingThey just keep getting bigger with every update—and better too.By Alex BeggsFebruary 3, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailSome things in life never change??? No way! Not true. Terrible saying. Only my social security number and the stupid electoral college come to mind. Everything in life is constantly changing. It’s thrilling, really, especially as it relates to the sprouting grays on my scalp. I like to greet them individually, marking the updated version of me.This year, the Joy of Cooking, that gigantic encyclopedic cookbook you may already own/love/rely on, published a huge update of their own, as they do every once in a while—this is their ninth edition since the first one came out in 1931. THOUSANDS of recipes have been refreshed and modernized (mushroom bacon anyone?), hundreds of new recipes were added (while some fuddy duddys were dropped), and I’d argue it’s worth adding to your bookshelf even if you already have two previous versions there—as I do.One version has a lovely blue-and-white diamond-pattern cover and is the size of a Victorian novel. For a cookbook, it’s tiny. That’s my late aunt Barbara’s copy, and I’m guessing, her mother’s before her. It was published in 1946 and flipping through it is affordable time travel. “Prune Soufflé.” “Crabmeat Canapes III.” “Foundation Recipe for Mayonnaise Jelly”!This copy of the Joy is imbued with more history than any other cookbook I own (and maybe you feel the same way about yours). In the 1950s, Barb’s mother was a linen-ironing, silver-polishing, meatloaf-baking Kansas housewife. But two decades later, Barb was a feminist activist, a college revolutionary, and then a business woman who held her own among bourbon-sniffing suits in New York in the ’80s. She polished the silver she inherited from her mother, loved to cook, and collected salt and pepper shakers. That Joy of Cooking reminds me of her. It reminds me that you can carry the past along with you as you move forward. It makes me crave meatloaf.The second copy is my boyfriend’s, a college graduation gift he received along with an iPod and a keg of Bell’s Two-Hearted. It’s the 2006 edition. The soup chapter has wrinkly dried brown puddles all over the place; it’s kinda gross. This copy reminds me of his bachelor bro apartment, where he made me clams that we worried would kill us. He’s a good, messy cook. This is his cookbook.But the pristine 2019 version is mine.When I’m writing, I use it as an encyclopedia (I know Google exists!). I can rely on the information to be true, thorough, and clear. When I’m cooking, I use it for baseline recipes. Tortilla soup, cornbread, quiche. I go to the Joy when I’m making something for the first time—I’ve got my eye currently on mapo dofu—because I know I’m getting the most classic, straightforward version of that dish. The recipe for chicken cordon bleu will deliver that nostalgia you’re chasing.The reading experience of the new edition is textbook-like. Thin paper, simple blocks of text, minimal illustration. In order to contain, well, everything through the decades, it’s had to cut some of the joyful stuff: Irma Rombauer’s sassy musings on “attractive ways to serve canapés,” an illustrated guide to skinning a squirrel, the “luncheon” chapter. It’s solidly a resource, and that’s okay. I’ve got plenty of other cookbooks to flip through on a Thursday night when I want to daydream about what to make this weekend. I’ll go through a phase with those, years will pass, and I’ll donate a few to make room for more. But the Joy won’t budge.In the new edition, the scope of recipes, ingredients, and techniques are more global than before; an ingredient index opens with agave syrup and ajwain. If you’ve been holding on to an old edition but not exactly craving aspic, you need this update. (Plus it’s like, 1200 pages for only $21.) With so much ground to cover, there aren’t a lot of steppy, cheffy, creative riffs. I’d go as far to say, on the whole, the recipes are easy. That’s why this book is still one of the best gifts you can give a new cook. Write a note in the front cover, include the date and occasion and the page number of a dish you love (and a strong hint that you’re awaiting a dinner invite). The Joy endures when it’s shared.Sometimes I worry a little bit about how the Joy will make itself indispensable in this decluttered new world. Does the Joy...spark joy? I don’t have the patience to polish silver or have an eye for tomato-shaped salt and pepper shakers. But the Joy of Cooking carries more weight than those things (not just because it’s extremely heavy). It’s not a tchotchke on a shelf but an explosion of knowledge in a tidy container. It’s the ultimate desert island cookbook. Tidy me to hell, what other cookbook contains both a chocolate mousse recipe, a mezcal explainer, and shredded cheese conversion chart??? And if you’re lucky enough to have one that’s been handed down, then you know it contains much more.Most things in life change. Interest rates, tastes for Jell-O, the legroom on airplanes. It’s a comfort to me that the Joy has too.Buy it: The Joy of Cooking, $21 on AmazonAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Get the recipe:Chicken Cordon BleuThis classic recipe features chicken breasts stuffed with thin slices of ham and cheese that are then coated in breadcrumbs and pan-fried.View RecipeExplore Bon AppétitCookbookscookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-03", "author": ["Condé Nast", "Alex Beggs"]}