{"id": "2deaea083a712d7019d5ea6fe1ddc726", "url": "https://www.bonappetit.com/story/feeling-better-this-year", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "I'm Feeling Better This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI'm Feeling Better This YearCatch up in the new year with Healthyish editor Amanda ShapiroBy Amanda ShapiroJanuary 16, 2020FacebookTwitterEmailIllustrations by Justyna StasikFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,It’s been nearly a month since my last newsletter and, well, I’ve missed you! So much has happened: a new decade, a new Feel Good Food Plan, a new Healthyish issue of Bon Appétit. If you’re not already a subscriber, you can find the issue at Whole Foods or...your local airport? (Where do people buy magazines these days?)Here on the internet, we just launched 20 Ways to Feel Better in 2020. It’s got a lot of our best tips from the Healthyish issue, like these summer-in-winter recipes from Lil’ Deb’s Oasis (drooling over that braised chicken), a guide to getting exactly what you want at a dispensary, and wise words from Samin Nosrat on her ongoing journey toward loving the body she’s in.I also wrote something; it’s about trying to date while trying not to drink. Spoiler: I failed. There’s more I could’ve said about that summer of 16 first dates that page space (and propriety—it’s a food magazine, people!) didn’t allow. I do want to mention that deciding whether to drink or not drink is a privilege, that people with substance abuse problems don’t have the luxury of choosing so casually, and that it did kind of freak me out when I realized how strong the pull of alcohol could be.What else is going on? I made some resolutions. The BA Test Kitchen made some more important resolutions. I reread this timeless Joan Didion essay and thought a lot about self-respect. I watched so much TV and so many movies and remembered all the big boys of 2019 who I loved, including Adam Driver even though I thought his character in Marriage Story was both dull and ingratiating and I much prefer Sam Rockwell in Fosse/Verdon for my boys-behaving-badly fix. On the flip side, the soapy-as-ever L Word redux and Greta Gerwig’s already classic Little Women made me think that my life could use more strong female leads—and that men can just be background characters sometimes. (The Academy has not gotten this memo.)Besides watching television, I’ve gotten into Broccoli magazine’s weed podcast and Rachelle Robinett’s Supernatural Series, which has me experimenting with breakfast concoctions that look like mud and taste like health but actually keep me full until lunch (a rare feat). And I’ve realized that, more than any sort of visioning or manifesting or Co—Star-ing or dry-brushing, the best way to get what I want is to put it on my Trello list.So here’s to more list-making, less mindless drinking, more greens but also fudge, less money stress, more female friendships, and to feeling better in 2020...whatever that looks like for you.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleI Think About These a LotBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-16", "author": ["Condé Nast", "Amanda Shapiro"]}