{"id": "2df786c77d464953eeeeecac22e32618", "url": "https://www.bonappetit.com/story/red-hook-tavern-wedge-salad", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "I Would Change Absolutely Nothing About the Wedge Salad at Red Hook Tavern | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Would Change Absolutely Nothing About the Wedge Salad at Red Hook TavernIt’s not just the perfect wedge salad. It’s the perfect salad. By Priya KrishnaNovember 12, 2019FacebookTwitterEmailPhoto by Daniel KriegerFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The issue I have with most wedge salads is that they…aren’t very good. Instead of crunchy, watery lettuce, we get sad, plastic-y leaves. Instead of a bright, clean buttermilk dressing, we get tasteless goop. Instead of crispy, salty, smoky pieces of bacon, we get weakly flavored bacon bits. EXCEPT for the wedge at Red Hook Tavern, a cozy, casual spot in Brooklyn by Billy Durney. He’s also the guy who convinced me that there is in fact good barbecue in New York (see: his other restaurant, Hometown Bar-B-Que). And now he’s done it again with the wedge salad.Here, the salad comes as five gorgeous, seemingly hand selected cups of lettuce, drizzled but not glopped with a buttermilk dressing that’s flecked generously with herbs and big buttery breadcrumbs. But the best part is the one long, thick, platonic strip of bacon splayed over the top. You can eat the wedge like a hand salad. You can casually snack on the piece of bacon. You can get the perfect ratio of crumb to lettuce to dressing to bacon in every bite. I have already forgotten about the burger—the keynote item on the menu, which is great, but…it’s not the salad. Which is just so good, it improves on every single thing that can make a wedge salad so bad. Is there even one thing that I would change about this wedge salad to make it better? Nothing. Absolutely nothing. It’s already perfect.Go there: Red Hook TavernExplore Bon AppétitHighly RecommendRestaurantsBrooklynSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-12", "author": ["Condé Nast", "Priya Krishna"]}