{"id": "2dfb9fc915134112741990114fad1193", "url": "https://www.bonappetit.com/story/abra-berens-grist", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Abra Berens' New Cookbook Made Me a Grain and Bean Evangelist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rootin’ Tootin’ New Cookbook Made Me a Grain and Bean EvangelistAbra Berens’s new cookbook ‘Grist’ is a game-changing (grain-changing?) addition to your fall library.By Alex BeggsOctober 6, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Frances BoswellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.What a strange and chewy coincidence it is that 2021 has been blessed with not one but three new cookbooks that get down with grains. In January I wrote about baking all the goodies from Roxana Jullapat’s Mother Grains, and this fall we’ve got Grains for Every Season from Joshua McFadden and Martha Holmberg, and now there's my latest obsession, Grist from Abra Berens.I’ll let you muse on why the grain books are popping off (also good: popped grains). Maybe it’s something about how, in times of crisis and discord, (some) Americans seek hippie ideals—peace, buckwheat, and psilocybin—in the hopes that it’ll help us calm down and get along again. Heady stuff. But what I really want to redirect your attention to is how delicious and full of possibility Grist is. Read on for the recipes!The premise is: Abra Berens is the chef at Granor Farm in Three Oaks, Michigan, where she runs a dinner series, works on the farm, and advocates for the region’s local food community. Her first book, Ruffage (2019), was all about veg. We loved it. Grist stars beans, lentils, and grains—three things I’ve been trying to eat more of in between all the cheese, gin, and salami. In 2019, our senior food editor Christina Chaey said Ruffage changed the way she thought about vegetables. In 2021, I can easily say that Grist changed the way I think about grains.Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes$35 $30 at AmazonWhat makes Grist so special is that Berens has taken things a step further than saying, “lentils are good for you, easy to cook, and tasty, here are some recipes.” Even though those things are true. Here she also connects each ingredient to the place, people, and history behind it. I was eating lentils because I love their versatility—I had no idea how regenerative they are for soil too.The cookbook also feels distinctly a product of the pandemic, one that marks a place in time and will stand the test of it.During the pandemic, as Berens writes in Grist, we saw how fragile, fraught, and unfair our food supply is—some stuck-at-home cooks got into sourdough while millions went hungry. We saw people buying shopping carts full of the shelf-stable beans and grains that Berens dedicates her book to. When grocery stores ran out of goods because of interrupted distribution, the demand for local foods increased. At the same time, thousands of largely immigrant farm and factory workers were put on the frontlines of the virus.Berens grapples with all of these tensions in Grist with unadorned, beautiful writing that’s honest and open, and sometimes very funny. There’s a through line of gratitude, too, for these natural resources, their long, complex histories, and the people who tend to them. She gives her words the respect she gives lentils, which is, well, a lot.If you read every page, you’ll learn about how both bleak and inspiring it is to be a farmer right now, every part of the buckwheat plant, how cowpeas came to America woven into the hair of enslaved people, and how wild rice is harvested by Native farmers in Minnesota (and that it’s not even technically rice!). Each group of recipes features an interview with someone in the local food and farming community. When she asks Carl Wagner, a seed cleaner, what he wishes more people knew about his work, he answers, “Simply knowing that this is part of buying a bag of flour or a bottle of whiskey. In some ways, knowing that we exist is enough.”And if you make the recipes, you’ll learn easy ways to cook grains, how to meal prep with black beans, and how to turn any grain into a crispy fritter. You’ll never be bored, and you’ll happen to get lots of fiber, protein, and minerals in your body along the way. Trust me, in time the farts will subside.To the recipes!The sauce/condiment section of Grist is a gold mine. I made the bacon vinaigrette this week and have used it as a dressing for a farro salad, marinated beans in it, and stared at it lovingly every time I opened the fridge. I have big plans for the brown butter vinaigrette on roasted sweet potatoes and the walnut aillade on air-fried Brussels sprouts. The mushroom cream sauce is calling to me.The first recipe I made was trout with mustard-dressed bulgur (here we have it with salmon). Bulgur is just parboiled wheat berries, so all you have to do is rehydrate it—either by boiling it for 10 minutes like you would pasta, or soaking it with boiling water from your kettle—cover, and fluff 10-15 minutes later. Easiest grain ever. But also, that mustard dressing is so easy and creamy. I made it another week to dress a farro and cucumber salad for a tailgate and it was almost as popular as the French onion dip. Almost!Crispy Salmon With BulgurA simple meal of crispy-skinned salmon and fast-cooking bulgur gets a special boost thanks to a creamy mustard dressing.View RecipeChickpeas: smashed and crisped, they’re ready to be the base for anything you’re making for dinner tonight.Garlicky Smashed Chickpeas With CornThese aren’t your average crispy chickpeas–here, garlicky garbanzos get lightly smashed before frying, creating layers of texture.View RecipeSince reading Grist, I’ve been making big batches of what I think of as “the thing of the week” and then frying it up, tossing it in salads, or marinating it in dressing depending on my mood. When bulgur is the grain of the week, I love frying it in a pan with some oil until it almost pops and then adding the crispy bits to salads. You MUST try this. When lentils are “the thing of the week,” I make this easy recipe in which you fry them up and serve with brats, cauliflower, and a lemon-herb sauce:Fried Lentils and BratwurstLooking for something new to do with the lentils sitting in your pantry? Fry ’em until crisp, then pair with juicy sausages and a citrusy mojo sauce.View RecipeAnd finally, rice. This thicker-than-congee rice porridge is so easy—throw in some cheese, greens, call it a day—you can’t not make it this winter.Cheesy Rice Porridge With GreensThis 5-ingredient rice porridge is pure cold-weather comfort in a bowl. (Did we mention it’s cheesy? It’s cheesy.)View RecipeThese are just four great dishes from a book so packed with recipes (and SO MANY variations on those recipes) that you will definitely find something for dinner tonight, tomorrow, and next Wednesday. The ingredient lists are minimal and the cost of the groceries is low too, relying mostly on cheap dry goods, vegetables, and the occasional protein. You have permission to use canned beans and to skip the Beano and to substitute dairy to your heart’s content. And mine is very, very content.Explore Bon AppétitBookscookingCookbooksRead MorecultureMatthew Raiford’s New Cookbook Celebrates Black Resistance by ExistenceBy Michael W. TwittycultureHow My Own Cookbook Carried Me When Everything Fell ApartBy Heidi Swanson, As Told To Emily WilsonLifestyleHow Writing a Cookbook Helped Me Break Free From Diet CultureBy Julia TurshenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-06", "author": ["Condé Nast", "Alex Beggs"]}