{"id": "2e0212a3693d976af2c761ccbaecddc7", "url": "https://www.bonappetit.com/story/patatas-revolconas-mashed-potatoes", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Patatas Revolconas Are Spanish-Style Mashed Potatoes With Garlic, Paprika, and Crispy Bacon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPatatas Revolconas Are Garlicky, Porky Mashed PotatoesSome of Spain's signature flavors, wrapped up in one super-comforting dish.By Benjamin KemperMarch 11, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Central Spain, with its brutal winters and vast fertile plains, is home to some spectacular comfort food. There are hearty bean stews studded with wild game, Flintstone-size steaks of black Aliveña beef, and snappy chorizo sausages that gush hot, heavenly juices. But to me, an American in Madrid with a soft spot for mashed potatoes, no dish satisfies on a cold, blustery day like patatas revolconas.Patatas revolconas hail from four landlocked provinces west of Madrid: Salamanca, Ávila, Toledo, and Cáceres. They're garlicky, smoky with pimentón, and heady with bacon fat and olive oil—the signature flavors of central Spain wrapped up in one bite. Unlike the mild butter-and-cream purées that grace many a Thanksgiving table, these spuds are chunky, bold, spicy, and downright dazzling to behold—deep, glowing orange like a goddamn sunset. And as if all that rich, potatoey goodness weren’t enough, the dish is finished with a handful of torreznos (pork rinds) fried so crisp they’re virtually onomatopoeic. Some (okay, me) even double down on the LDL with a runny fried egg.In the six years that I’ve lived in Spain, patatas revolconas have been my padding of choice on many a beer-drenched tapas crawl. I always thought of them as bar food—until last month, when a friend gifted me a pound of pimentón from his village in Extremadura. From the instant I stuck my nose in the bag, I couldn’t shake the craving: Quiero revolconas. Trouble was, I had no idea how to make them.That’s how I found myself zigzagging up the Sierra de Guadarrama mountain range to a century-old taberna called Restaurante Santa María, which, by all accounts, makes some of the dreamiest revolconas on earth. “Patatas revolconas are mountain food,” said Pablo Barrera, the fourth-generation owner. “Good pork, good potatoes, good pimentón—the ingredients aren’t anything out of the ordinary.” (To be fair, Americans won’t be able to find real-deal papada adobada—spiced cured pork jowl and Barrera’s choice meat for the crispy bits—but slab bacon is a fine substitute.) The secret to knockout revolconas, Barrera told me, is how those ingredients are combined. So he got to cooking, and I got to scribbling.To make four liberal servings, peel 2 lb. medium Yukon Gold potatoes and place them in a pot. Add 2 peeled garlic cloves, 3 Tbsp. kosher salt, 1 bay leaf, and enough water to cover by 2\". Bring the water to a boil over high heat, then simmer over medium-low heat for 25 minutes, or until the potatoes are easily pierced with a knife. Turn off the heat and leave the potatoes in the pot (we’ll need the liquid later on).While the potatoes are boiling, place ¼ cup extra-virgin olive oil in a cold large skillet or wok. Add 1¼ lb. slab bacon cut into rectangular, thumb-size batons, and place over medium-low heat. Fry, stirring occasionally, until bacon is translucent and the fat begins to render, about 15 minutes. Increase the heat to medium, continue frying for 10 minutes (the bacon should be slightly golden now), and then to medium-high to cook until the strips are deep brown all over and well-crisped, about 10 minutes longer. With a slotted spoon, transfer to a paper towel-lined plate.Pour off enough fat (into a jar for safekeeping) to leave approximately ⅓ cup in the pan. Set heat to medium-low and add 2 Tbsp. pimentón. (At Santa María they go with the mild “dulce” variety, but you can experiment with medium and hot, you know, to feel something.) Stir for 20 seconds, then slowly—very slowly, to avoid spattering—ladle in ½ cup potato cooking liquid. Reserve 1½ additional cups of the potato liquid, drain the potatoes and garlic, and return them to the pot set over low heat. Add all of the pimentón liquid to the potatoes and mash coarsely. The mixture should be slightly looser and less gloppy than American-style mashed potatoes and not as smooth; add additional potato liquid as needed to achieve that texture. Mound the potatoes into individual bowls or onto one large serving dish and stick the bacon pieces all over the top.If you’re feeling extravagant, use that leftover bacon fat to fry an egg, then slide it on top of the potatoes. Dig in while the revolconas are hot, passing bread and pitchers of red wine as they do in the Spanish countryside, reveling in the creamy-crunchy contrast contained in each spoonful.Benjamin Kemper is a freelance food and travel writer based in Madrid, Spain.Explore Bon AppétitIt's That SimplePotatoMashed PotatoesSpanishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-11", "author": ["Condé Nast", "Benjamin Kemper"]}