{"id": "2e0aea1745d102e2db1a7c419cf8b5fb", "url": "https://www.bonappetit.com/story/martha-stewart-entertaining-december-cookbook-club", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Martha Stewart’s Legendary First Book Is Our December Cookbook Club Pick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMartha Stewart’s Legendary First Book Is Our December Cookbook Club PickThis 1980s icon is the holiday party companion you need this season.By Julia KramerDecember 3, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailBefore she launched a magazine and moguled a media empire and bathed her Sicilian donkeys and took her first Uber ride, Martha Helen Stewart ran a catering company in Connecticut. In 1982, Clarkson Potter published her first book, Entertaining—a catalogue of her catering feats, including no less than three variations on an omelette party. This iconic book is still in print thirtysome years later, and it’s our selection for the third month of the Bon Appétit Cookbook Club. Allow me to explain why!How many cookbooks do you actually cook out of? As something of a cookbook hoarder, I’m embarrassed to admit that my answer to that is relatively few. Most of the books that come across my desk float in and out; only a scarce few are, uh, lucky enough to get stained with smudges of olive oil. So when my colleagues and I decided to launch this here Cookbook Club, we knew from the onset that we didn’t want to feature only new books. We wanted this to be an opportunity to give a little love to those that had withstood the test of time. So to follow two new releases—Nik Sharma’s modern Indian-American tome and a sweet little book called Almonds, Anchovies, and Pancetta—we knew that only one book could sum up the joy, the excess, the roquefort-stuffed aspirations of the coming holiday season: Martha Stewart’s Entertaining.To kick things off, we’ve got Martha’s recipe for Ham and Cheese Feuilleté, which appears in the chapter of the book titled “Cocktails for Two Hundred: Country Fare.” (Don’t worry: BA food editor Molly Baz adapted the recipe to a slightly more manageable scale.) Later this week, we’ll be hosting our own Cookbook Club potluck, where a bunch of us on staff will be skewering lamb and forming smoked trout into chevrons. So grab a new or old copy of the book, round up two hundred of your closest friends, and holiday party like it’s 1982.Get the recipe:Ham and Cheese FeuilletéThese ham-and-cheese bites are the perfect cocktail party appetizer.View RecipePick up a copy of Entertaining wherever you buy cookbooks. And if you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon Appétitholiday2018CookbooksEntertainingcookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Julia Kramer"]}