{"id": "2e0d44b135ee734dd94e56bb7e4e2afd", "url": "https://www.bonappetit.com/recipe/chocolate-tahini-linzer-cookies", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chocolate-Tahini Linzer Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueChocolate-Tahini Linzer CookiesBy Chris MoroccoNovember 20, 20184.7(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintMelt tahini with chocolate in whatever shade you please for a glossy bittersweet filling that will sandwich together rich cocoa shortbreads. As long as you have one large and one small cookie cutter, they don’t have to be the same shape. Feel free to mix and match diamonds, squares, and teardrops. As for that tahini—now’s not the time to skimp on quality. Considering it’s such a dominate player, make sure you buy the best.IngredientsMakes 20–30 (depending on size)1½cups all-purpose flour¾cup Dutch-process cocoa powder¾tsp. baking powder1tsp. kosher salt, plus more1cup granulated sugar¾cup (1½ sticks) unsalted butter, room temperature1large egg1tsp. vanilla extractWhite sanding sugar (for sprinkling)½cup white, milk, or dark chocolate chips or wafers (disks, pistoles, fèves)2Tbsp. tahini (such as Soom)Special EquipmentAssorted 2\"–3\"and 1\"–1½\" cookie cuttersPreparationStep 1Whisk flour, cocoa powder, baking powder, and 1 tsp. salt in a medium bowl to combine. Beat granulated sugar and butter in the bowl of a stand mixer fitted with paddle attachment on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat to incorporate, about 1 minute. Reduce speed to low and add dry ingredients. Beat just until dough comes together. Divide in half and pat each into a disk; wrap tightly in plastic. Chill just long enough that dough is rollable and no longer sticky, about 30 minutes.Step 2Working one at a time, roll out dough between 2 sheets of parchment paper until ⅛\" thick. Slide onto baking sheets, still sandwiched between parchment, and chill until very firm, about 1 hour.Step 3Place racks in upper and lower thirds of oven; preheat to 350°. Carefully peel away top sheets of parchment from dough and punch out cookies with larger cutters. Punch out centers of half of cookies with smaller cutters. Carefully transfer whole cookies with a spatula to a parchment-lined baking sheet, spacing 1\" apart. Sprinkle remaining cut-out cookies with sanding sugar, then transfer to another parchment-lined baking sheet. Bake cookies until edges are set, 7–10 minutes. Let cool on baking sheets. Repeat process with scraps (chill dough again before punching out shapes).Step 4Melt chocolate and tahini in a bowl in a microwave in 20-second bursts, stirring after each, until chocolate is melted (or melt in a heatproof bowl set over a saucepan of simmering water; do not let bowl touch water). Stir to combine and season with salt. Spread filling over whole cookies; top with cut-out cookies.Step 5Do Ahead: Cookies can be assembled 5 days ahead. Store airtight at room temperature.Photo by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiHow would you rate Chocolate-Tahini Linzer Cookies?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleLoved these! The recipe itself is relatively simple, only that the rolling, chilling and cutting out shapes can be time and labour intensive. Chocolate and tahini is such a great combo!! kailisingapore11/17/2020I highly recommend these cookies. Easy to make AND super impressive. I’m sure they would be even more amazing using the Dutch cocoa powder and white sanding sugar, but normal cocoa powder and white sugar worked for me. casey.galangCalifornia5/18/2020These were amazing! I forgot the sanding sugar but they still turned out fine. I also added a bit more tahini for flavor.  I recommend if you have the time.AnonymousBoca Raton, FL12/27/2019These were difficult to work with but ultimately got the most praise out of all of my holiday cookies this year. I would recommend chilling in the freezer for 10-15 minutes  after rolling out thin, since the dough breaks apart incredibly easily when soft. Also, I might add a bit more tahini to the filling as it wasn’t as pronounced as i would like. That said the flavor of the cookies is complex and well textured, and they ended up beautiful.sbrookshTakoma Park MD12/19/2019I'm vegan and substituted the egg white and yoke with egg replacer. They turned out great! Like others mentioned, lot's of chilling time, but if you just follow the instructions, you shouldn't have a problem. Will def make again.AnonymousOntario, Canada12/18/2019These were, by far, the most fiddly cookies I had ever attempted to make. But they were so worth it. They took me a few hours to complete, maybe I got distracted, maybe the recipe has a lot of moving parts that make it difficult for one person to do everything in one night after a full shift at work, maybe it was because I made a few batches all at once. Maybe. That being said, if I had a full day off, I might be tempted to make these again. I followed the recipe with my first batch, and then half milk chocolate half dark chocolate on my second batch, and my third batch was all milk chocolate. My personal favourite was the combinations of the two chocolates. The science didn't work and the chocolate didn't fully set (that was 100% my fault) but I thought they were bitter enough for dark chocolate lovers while still maintaining the sweetness for milk chocolate lovers. Overall these cookies were as fun to make as they were to look at and to eat. I will definitely be trying these again.kgibsonCalifornia12/2/2019was so intimidated to make these! The balance of the flavors was crazy good (I think i was a little shy of the tahini amount / eyeballed it hah!) These are def a PROJECT if you want to make em cute like the picture - with lots of rolling out, popping the dough in the freezer for a sec and repeating but I was up for the challenge and they turned out far better than I could have dreamed! Were super impressive gifts. kmarxmarxchicago, il1/5/2019These were so tasty! Just enough salt to balance out the sweetness, and the tahini and chocolate was such an awesome combo that I never would have thought of. I will definitely be making these againAnonymousAustin12/23/2018I thought these cookies were absolutely delicious. The dough, however, was super delicate and difficult to work with. The moment it got warm (which it will because you have to roll them out super thin), it got sticky which made cutting out the shapes a nightmare. I would recommend re-chilling the dough after you roll it so that it's hard by the time you cut out the cookies and the shapes won't stretch. I did this with my second batch and it really helped. \nAlso -- for anyone else who only has rimmed baking sheets -- make sure that you cut the parchment to lay completely flat on the inside of your baking sheet or some of your cookies will curve up at the edges and won't fit together. mc5ulliWashington, DC12/21/2018Make sure you read the recipe all the way through- it requires more chilling than I anticipated. Nothing about this is overly complicated. Cookies came out a lil chewy, a lil crunchy which is exactly how I like them but have no idea if that's right or not. I liked them okay but I'm not really big on chocolate so these will never be my go-to cookie. I don't have cookie cutters and couldn't find anything at the store I liked, so I used the lid of a mason jar and the cap to my salt shaker to make these. I forgot to add salt to the chocolate-tahini mixture and I think that would provide a very much needed lift. Tahini is not overwhelming but adds a slight nuttiness and interesting, it's really good!madmaddyGreenville, SC12/14/2018Time consuming with all of the chilling of the dough, but sooooo delicious and pretty! Definitely get sanding sugar for this recipe or any recipe that requires decorative sugar. I also recommend using smaller cookie cut outs because once you layer the two cookies its a lot of cookie!Michigan12/5/2018Explore Bon AppétitCookieDessertChocolateOther IngredientsCocoaTahiniCondiments, Sauces & PastesBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}