{"id": "2e283f2dc1c4ef4fed3682d354d9b0e2", "url": "https://www.bonappetit.com/recipe/slow-roasted-cod-with-bell-peppers-and-capers", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Slow-Roasted Cod with Bell Peppers  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSlow-Roasted Cod with Bell PeppersBy Claire SaffitzFebruary 13, 20184.6(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFor this slow-roasted cod recipe, if you get a fillet that includes the thin, tapered tail end of the cod, fold it underneath so the fillet will cook evenly.Ingredients4 servings6medium red, orange, and/or yellow bell peppers6Tbsp. extra-virgin olive oil, divided4garlic cloves, smashed2Tbsp. sherry vinegar or red wine vinegar1tsp. crushed red pepper flakes11½-lb. skinless cod, halibut, or striped bass fillet½small red onion, thinly sliced¼cup coarsely chopped parsley2Tbsp. drained capersCountry-style bread (for serving)PreparationStep 1Place racks in center and top-most positions of oven; heat broiler. Cut bell peppers in half lengthwise and remove stems, ribs, and seeds; discard. Place bell peppers on a rimmed baking sheet and drizzle with 3 Tbsp. oil; season with salt and black pepper. Toss to coat, then turn cut side down and broil bell peppers on top rack, turning baking sheet front to back halfway through, until skins are blackened all over, 15–20 minutes.Step 2Transfer bell peppers along with oil and juices on baking sheet to a large bowl and cover tightly with plastic wrap. Let bell peppers sit 10 minutes to steam, which will loosen their skins. Reduce oven temperature to 300°.Step 3Uncover bell peppers and peel away charred skin from flesh (don’t worry about getting every last bit); discard. Tear flesh into ½\" strips and place in a shallow 3-qt. baking dish along with all the accumulated juices in the bowl. Add garlic, vinegar, and red pepper flakes and toss well to combine. Taste and season with more salt.Step 4Nestle cod into bell pepper mixture, drizzle with 2 Tbsp. oil, and season with salt and black pepper. Roast on center rack until flesh is opaque throughout and flakes easily when pressed, 25–30 minutes. Let rest 10 minutes.Step 5Meanwhile, toss onion, parsley, capers, and remaining 1 Tbsp. oil in a small bowl; season with salt.Step 6Top fish with onion mixture and serve with bread.Step 7Do Ahead: Bell peppers can be roasted 1 day ahead. Peel and let cool; cover and chill.How would you rate Slow-Roasted Cod with Bell Peppers ?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleSo delicious! Added juice of one lemon to the parsley, red onion, and caper mixture. All I needed was a glass of chilled white wine to go with the fish.whogoncheckmeb00Lafayette, CA8/19/2020Absolutely delicious! This is definitely going in the regular rotation. The roasted peppers and garlic made the house smell amazing. Used Blue Moki fish as that's what my partner had caught - SO GOOD.PippaJKWellington, New Zealand11/26/2019I love this dish! In Italy I can get really tasty peppers marbled with red and green, and I add wild mint (mentuccia) to the chopped parsley and capers. It is delicious without hot pepperoncino for those who perfer non spicy. Great for a summer lunch on the terrace as it can be served slightly warm. Make sure your wine is chilled though!amiletta3885Rome4/6/2019Wonderful preparation -  there was swooning at my table.  Roasted yellow and orange peppers tasted like candy.  Doing them a couple hours early made final assembly easy. Cut the pepper flakes in half (always do - wife's preference) and used the water bath for the re onions.   Tossed in some halved grape tomatoes that were in use it or lose it condition.  Served with coconut jasmine rice.  Pretty to look at , better to eat!AnonymousAvondale AZ3/22/2018Loved it! Incredibly easy and a real crowd pleaser. Great for a week night dinner with friends. Boston, MA3/21/2018I made this a few days ago for two of us, so halved the recipe. I used fresh Pacific gray cod (1 inch thick fillet). We thought it was delicious and will definitely make it again. I think a really good olive oil and Spanish sherry vinegar are key. Slice the red onion garnish very very thinly. If the onion is very strong try soaking the sliced onion in ice water for 5 minutes and blot dry before using.AnonymousVictoria, BC, Canada3/5/2018Followed the recipe exactly and this was not for us. Unless you are a huge fan of roasted peppers on their own, there's not nearly enough fish to balance out the surplus of soupy peppers at the end. We tossed a huge pile of those in the compost. And the onion/parsley topping didn't add anything but an overpowering raw onion flavor. The dish wasn't awful per se but I would not make this as is. At the very least, reduce the peppers by at least half and make something else for the topping. On second thought, you're probably better off finding a different recipe for cod. AnonymousSeattle, WA3/1/2018Explore Bon AppétitCodFishSeafoodBell PepperVegetableMainNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}