{"id": "2e2c9210cab9f60a0f3f46ab3527a75f", "url": "https://www.bonappetit.com/story/food-organizations-to-support", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "How We’re Thanking Food Businesses | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow We're Thanking Food BusinessesA donation in someone’s name is the perfect holiday (or anytime) gift.By Sonia ChopraDecember 23, 2020FacebookTwitterEmailNo Us Without You gathers groceries to give to undocumented restaurant workers in L.A. Photo by Mel CastroFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.It’s hard to believe that this never-ending year is finally coming to a close, but here we are, just a few days away from ringing in 2021. One of my goals for next year is to be more intentional with how and why I spend money by supporting more small businesses whose values I share and donating with more regularity to organizations and charities doing important work.With that in mind, I asked my coworkers if they had any favorite organizations supporting the people who make up the food and restaurant industries, and the answers are so good that I thought I’d share them with you all in case you have a similar New Year’s resolution and want to get a head start. (Donations, along with a heartfelt note, also make perfect last-minute gifts.)Want this letter before it hits the website? Sign up for our newsletter!No Us Without You provides food security for undocumented back-of-house staff and their families in L.A. (Recommended by Aliza Abarbanel)Heart of Dinner is a community relief organization ending hunger and isolation for low-income Asian American homebound elderly in New York. (Recommended by Christina Chaey)La Cocina’s mission is to cultivate low-income food entrepreneurs in the Bay Area as they formalize and grow their businesses. (Recommended by MacKenzie Chung Fegan)Drive Change NYC provides professional culinary training opportunities for formerly incarcerated people. (Recommended by Emily Schultz)The Okra Project seeks to address the global crisis faced by Black trans people by providing home cooked, healthy, and culturally specific meals and resources.The People’s Kitchen is a food security and employment survival project in Philly aiming to connect people, stimulate community dialogue, and build political power, all while serving up 200 free chef-cooked meals per day. (Recommended by Alex Delany)Alkimiah provides meals to Baltimore residents, offers consistent work and training to those in our kitchens that do not have access to benefits, and addresses the ongoing and now heightened issues of food insecurity in the city. (Recommended by Sarah Jampel)Seeding Sovereignty provides mutual aid to Indigenous relatives and community members through the Indigenous Impact Community Care Initiative. ⁣⁣The LEE Initiative aims to bring more equality and diversity in the restaurant industry through work programs and continuing education. (Recommended by MacKenzie Chung Fegan)Southern Smoke provides funding to individuals in the food and beverage industry who are in crisis. (Recommended by Alex Beggs)I know there are so many other important organizations out there, so please let me know which ones you’re supporting this year and why (I’m sonia@bonappetit.com). I also wanted to say thank you to all of you for welcoming me into your inbox every Wednesday—I am truly grateful for you, and for everyone who chooses to spend time with Bon Appétit each week. We are so excited for what’s to come in 2021 and wish you a very safe and very happy New Year.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-24", "author": ["Condé Nast", "Sonia Chopra"]}