{"id": "2e318dba2d606d0f1ead2012bc347ec9", "url": "https://www.bonappetit.com/story/microplane-cheese-grater-when-to-use", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "To Microplane Your Parm, or Not to Microplane Your Parm? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Microplane Your Parm, or Not to Microplane Your Parm?That is the question. And the answer is the difference between a great dish and a clumpy mess.By Alex DelanyMay 8, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailDo you have a Microplane grater? Have you laid your eyes on this tool? Have you seen one grate cheese? If you have, you know what the deal is. If you haven’t, well, let me paint a little picture for you. Grating a hard cheese like Parmesan on a Microplane—a rasp-style grater with tiny, super-sharp teeth—showers down delicate strands of cheesy goodness onto whatever landscape of pasta or vegetables or meat lies below. It’s a beautiful gesture, oozing confidence, finesse, and nonchalance. It is what Italian artists describe as sprezzatura—a studied carelessness. As if the Microplane were saying, “Oh, this cheese? Didn’t even notice it was there.” But in all that beauty, there lies a truth. Grating Parmesan—and other aged cheeses like pecorino or Grana Padano—on a Microplane grater isn’t always your best move. In fact, a lot of times, it isn’t.Here’s the real nugget of information you need to know about Microplaned cheese: It's great for cool or room temperature dishes. But it shouldn’t be grated over hot stuff. That’s the determining factor in the \"to Microplane or not to Microplane\" debate.Here's why. When Microplaned cheese gets warm, it loses the exact quality that makes it so enticing: that light, feathery texture. Putting Microplaned Parm on a mountain of hot pasta turns it into a gooey clump of mush, with all of those delicate little strands melting into one mass. We don’t want that.So we use Microplaned Parmesan for things like salads, toasts, cooled roasted vegetables, and the like. Stuff that isn’t ripping-hot or fresh off of the heat.Ribollita with Italian SausageView RecipeFor the hot stuff, we have two other options. For stab-able pasta shapes, hot roasted vegetables, and sandwiches, we like broad shards of cheese, the kinds you get by using a Y-peeler or the wide slots on your box grater. They cover a larger area and are fun to break apart with a fork or those beautiful teeth of yours.That's the stuff! Shaky-style cheese for the win.\nThe other option is a finely-grated, shaky-style cheese. You know, the stuff that looks like a powder and rains down on your dinner like a cheesy blizzard. While you can usually find it pre-grated at the grocery store, you can also make it using the side of your box grater with the weird tiny poky things on it, or by just putting a chunk of cheese in the food processor and buzzing it up. (Just don't buy the fake shelf-stable stuff in the green can, please.) We love this style of cheese for brothy soups, scoop-able dips, bowls of chili, and saucy pasta. It doesn't clump up like Microplaned cheese—those tiny grains stick to whatever they touch, but not each other.So is this a lesson about cheese? Or is this a lesson about life? Well, it’s definitely about cheese. Definitely. But if you think about it in a certain way, cheese, and the kinds of food that you grate cheese on top of, sort of...are life? In which case, this is definitely a lesson about life. Definitely.Shaky-style Parm is the move for vodka sauce...Rigatoni with Easy Vodka SauceIt's creamy. It's cheesy. It's tangy. And it's about to be your new favorite pantry pasta.View RecipeExplore Bon AppétitParmesanCheesePastaBasicallyToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Alex Delany"]}