{"id": "2e39f8730045096b456f2bdd5413cb20", "url": "https://www.bonappetit.com/recipe/okra-gumbo", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Okra Gumbo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueOkra GumboBy Toni Tipton-MartinNovember 6, 20193.6(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Toni Tipton-Martin’s Jubilee, our November 2019 Cookbook Club pick. The author describes her approach to this deeply flavorful stew as a diasporic gumbo influenced by recipes from West Africa, island, Lowcountry, and Louisiana. The result is a rich, warming broth punctuated by succulent shrimp, juicy hunks of beef, and crisp-tender okra you’ll want to cozy up with all winter long. Tipton-Martin recommends sautéing the okra over high heat to that the pods ooze less.Reprinted with permission from Jubilee: Recipes from Two Centuries of African American Cooking by Toni Tipton-Martin, copyright © 2019. Photographs by Jerrelle Guy. Published by Clarkson Potter, a division of Penguin Random House, Inc.Ingredients6 servings1Tbsp. paprika2tsp. kosher salt½tsp. freshly ground black pepper½tsp. cayenne pepper2lb. bone-in beef short ribs or shanks1lb. beef stew meat, cut into 1\" chunks2bay leaves2Tbsp. bacon drippings1lb. fresh okra, trimmed, cut into ¼\" slices1cup chopped onion⅔cup chopped green bell pepper⅓cup chopped celery1½cups diced canned tomatoes, undrained3garlic cloves, finely chopped1½tsp. finely chopped Scotch bonnet pepper½tsp. dried thyme½lb. crabmeat, picked over (optional)1lb. shrimp, peeled, deveined, tails on (optional)Cooked rice (for serving)PreparationStep 1Preheat oven to 375°. Combine paprika, salt, black pepper, and cayenne pepper in a small bowl. Season short ribs with 1½ tsp. spice mixture. Place in a shallow baking pan and roast until browned and fat has rendered, about 45 minutes.Step 2Transfer bones to a large Dutch oven or heavy pot. Discard fat. Add stew meat, bay leaves, and 2 qt. water. Bring to a boil, then reduce heat to low, cover, and simmer 2 hours (the broth develops stronger flavor the longer you let it simmer). Using tongs, remove bones. When cool enough to handle, trim any meat from bones and return meat to pot. Discard fat and bones.Step 3Heat bacon fat in a large skillet over medium-high. Add okra and cook, stirring occasionally, until lightly browned, 7–10 minutes. Add onion, bell pepper, and celery and cook, stirring frequently, until well softened, 10 minutes. Add tomatoes, garlic, chile pepper, thyme, and remaining spice mixture and cook 5 minutes more.Step 4Add okra mixture to Dutch oven and simmer, adding crab and/or shrimp during the last 5 minutes of cooking time (if using), until okra is tender and flavors have melded, 20–30 minutes. Discard bay leaves. Taste to adjust seasonings. Serve with rice alongside.How would you rate Okra Gumbo?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangle\"Chili\" in New Jersey with tomatoes and beans is a nice stew-like beef dish, but it is NOT even close to Chili.  In the same sense, \"Gumbo\" with beef (?) and no roux base is perhaps a nice stew-like beef soup, but it is NOT Gumbo.  I'm all for being creative and adding to the tapestry and diversity of traditional preparations, but please do not mistake this for Gumbo.DarylLouisiana5/16/2021Make no mistake this dish is delicious, but it is Gumbo in the same sense that Cincinnati Chili is Chili. Having said that it’s a keeper. Not sure I’d call it Gumbo if I fed it to my Louisiana relatives though.John D.Mobile, Al.3/31/2021You make a big deal out of frying the fresh okra in bacon fat “ so that the pods ooze less”.  Isn’t the “ooze” the basic thickening agent (along with Gumbo Fillet) used in ALL gumbo recipes - not to mention the roux as it has been beaten to death by others?  Why would you want to limit the okra’s natural white discharge?Jim HaasLos Angeles, Ca2/21/2021I enjoy your cooking videos and the recipes turn out well.  However, the professionalism of your well-done videos could be greatly enhanced by eliminating the regular use of crude, potty-mouthed language and comments by the cooks.  I am not a prude and I do use the same language at the appropriate times but it's totally unneeded, detracts from and is inappropriate during your otherwise excellent and educational cooking videos while diminishing the great name and reputation of bon appetit.davidr3306379267310/9/2020Some people on this thread need to consider something:  Gumbo is not just a Louisiana dish.  It is a dish of the West Africa and the African diaspora.  Gumbos from different places include different ingredients.  Some include beef and many do not include a roux.  I think that the unifying thing is that Okra is added to a protien laden stew.  Where my family comes from, Gumbo is made with beef, salted cod, shrimp, crab and of course, okra. And, the base liquid in the stew is water made black by soaking a black mushroom. And, yes, it is Gumbo.ludovicNew York9/5/2020Gumbo simply has to have okra in it to qualify as gumbo. There's are kinds of gumbo, some with tomatoes, some without. This is gumbo like this Louisiana native girl has never had before, and I've eaten plenty of seafood gumbo. My mother never used tomatoes and never beef, always always always a rich roux, but still this is a great gumbo. And simply delicious! I'm vegetarian, so omitted any animal parts, kept the shrimp part, tossed in some bay scallops at the end and man O man - a make again for sure!AnonymousLouisiana4/12/2020Absolutely delicious. Used frozen okra without an issue. I don't know anything about whether it is gumbo or not, but I do know I can't wait to eat it again. \nAnonymousLos Angeles3/30/2020Does it taste good to you all ? Isn't that all that matters ? Eat and enjoy. If you don't want to cook it again because you determine it is or is not gumbo , then don't.   All recipes around the world were built on someone else's creation from the beginning of time. Stop getting your panties in a twist because someone called it gumbo and someone called it stew. Anonymous3/25/2020Spent 25 years in NOLA, half that time married to a Creole with a family of amazing cooks. Never saw beef in any gumbo. Creole or Cajun!Woodbury, CT1/16/2020Yes, the reviews are correct. It’s delicious and it’s not gumbo. For the hand wingers who can’t find fresh okra, use a bag of frozen and skip the sautéing step, and add it with the shellfish. Do not consider the shellfish optional.AnonymousSeattle1/2/2020“Deeply flavored” it IS!!! I made this Sunday and have been eating and craving it since. The flavors are deep from layering the roasted ribs, long-simmering bones in the broth, and the use of bacon fat. I left out the shellfish. I didn’t think it needed it because the meat flavors are so rich. And the okra! Oh how I love the okra in this recipe - as recommended, sauté on high heat to limit the oozing. Two alterations: I used crushed tomatoes and habanero pepper instead of the Scotch Bonnet as the store I went to didn’t have the SB peppers.amazingly delicious!!!Chicago11/13/2019Lots of people complaining about the contents of the stew clearly didn't read the description, which says it was influenced by many places and OBVIOUSLY ISN'T GOING TO REFLECT YOUR LOCAL FARE. Yeesh. I get it, food is culture and all, but America is a melting pot and you should all really get used to ... putting a bunch of ish in a pot and shutting up and eating it, I don't know. Maybe punch down less on people who want to eat a stew? Can't we do this on Twitter instead? If your identity is a very specific niche recipe, then bud, take a vacation somewhere else and eat a food. Any food. And it probably won't be gumbo, and you will live through the experience.\n\nAnyway, if we can't find fresh Okra, I imagine using frozen wouldn't suffice, since it should be sauteed according to the recipe. Though, the thickening from frozen okra would probably replace the roux people seem to desperately want. So maybe it could be a win-win. AnonymousNOT LOUISIANA, OBVIOUSLY.11/12/2019Just saying... okra is now out of season. I don’t get this. Why didn’t you post this earlier? NYC11/11/2019And the roux is where?  Coming from a person raised in Louisiana.  Will always Bon Appetite thoux.  AnonymousLouisiana but living in Texas11/10/2019Lots of arguments exist around using tomato in gumbo, Anonymous. I think it tends to exist more in creole gumbos. But, I would agree about the lack of a roux. At the end of the day, throwing yummy stuff together in a pot is gumbo, no?Anonymous11/10/2019Explore Bon AppétitStewSoups and StewsLow Country CuisineAmericanCajun & CreoleBeefMeatOkraVegetableCrabShellfishSeafoodShrimpWinterMainDairy-FreeNut-FreeSimmerKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-06", "author": ["Condé Nast", "Toni Tipton-Martin"]}