{"id": "2e3e023dcf51a6aee2e4e35ab8113a1a", "url": "https://www.bonappetit.com/recipe/eggplant-biryani", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "Eggplant Biryani Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEggplant BiryaniBy Asha LoupyDecember 21, 20214.5(30)Read ReviewsTriangleEmailPinterestPrintPhotography by Isa Zapata. Food Styling by Cyd McDowell. Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintTotal Time6–8 servingsBiryani is a labor of love. From frying the onions and making the meat or vegetable masala to parboiling the rice and layering all the components, it may seem like a lot of work, but the oohs and aahs when you bring a big, beautiful, steaming pot of biryani to the table are well worth the hours of effort. If you’re preparing this as part of a holiday feast and are looking to break up the work, you can fry the onions and make the eggplant masala the day before and refrigerate them overnight (the onions will end up getting steamed, so retaining their crispiness isn’t important here). On the day of, reheat the eggplant masala, parboil the rice, and layer everything up!There are many types of biryani across India, each one varying in spices, flavorings, and preparation. This vegetarian version pulls flavors from some of my favorite regional biryani—plenty of rich red chile powder from Hyderabadi biryani, fennel from Lucknowi biryani, and warming spices such as mace and nutmeg from Kolkata biryani. It's assembled using the Pukka method, in which the meat—or, in this case, the eggplant—and rice are cooked separately, then layered and steamed together. Serve with plenty of chopped cilantro, plain yogurt (a must!), and lemon wedges. —Asha LoupyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSpice Grinder$45 At Kitchen AidMortar and Pestle$25 At AmazonWhisk$10 At AmazonIngredientsEggplant Masala and Fried Onions¾cup plain whole-milk yogurt2tsp. ground turmericFreshly ground black pepper2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided, plus more4medium Chinese or Japanese eggplants, halved lengthwise, sliced crosswise on a diagonal 2\" thick, or 1–2 medium globe eggplants, cut into 1½\" pieces (about 2 lb. total)1½tsp. coriander seeds2blades of mace or ¼ tsp. ground mace (optional)2tsp. cumin seeds, divided2tsp. Kashmiri chile powder½tsp. ground cinnamon¼tsp. freshly ground nutmeg1cup canola or vegetable oil3large white or yellow onions, 2 thinly sliced, 1 finely chopped½tsp. fennel seeds11\" piece ginger, peeled, finely chopped4garlic cloves, finely chopped2Tbsp. double-concentrated tomato paste114-oz. can crushed tomatoesRice and Assembly2cups basmati rice4green cardamom pods, lightly crushed6whole cloves2bay leaves2Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher saltLarge pinch of saffron threads (optional)1serrano chile, halved, thinly sliced, divided¾cup chopped cilantro leaves with tender stems, divided, plus more for servingPlain whole-milk yogurt and lemon wedges (for serving)Special EquipmentA spice mill or mortar and pestlePreparationEggplant Masala and Fried OnionsStep 1Whisk together yogurt, turmeric, a few grinds of pepper, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a large bowl. Add eggplant and toss with your hands until well coated. Let sit at room temperature 30 minutes.Step 2Meanwhile, grind coriander seeds, mace blades (if using), and 1½ tsp. cumin seeds in spice mill or with mortar and pestle to a fine powder. Transfer to a small bowl and mix in chile powder, cinnamon, and nutmeg (if you’re using ground mace, add it here).Step 3Heat oil in a large (6–7-qt.) Dutch oven or other heavy pot over medium-high. Stir in half of sliced onions and cook, stirring occasionally, until deep golden brown, 9–12 minutes. (Keep an eye on the onions during the last few minutes, as they will darken quickly.) Using a slotted spoon, transfer onions to a paper-towel-lined plate to drain. Repeat process with remaining sliced onions; set onions aside.Step 4Reduce heat to medium and add fennel seeds and remaining ½ tsp. cumin seeds to pot. Cook until seeds start to sputter and turn a shade darker, 30–60 seconds. Add chopped onion and ginger and cook, stirring occasionally, until onion is translucent and starting to turn golden, 7–9 minutes. Add garlic and tomato paste and cook, stirring, until tomato paste is brick red and garlic is fragrant, about 2 minutes. Add spice mixture; cook, stirring constantly, until very fragrant, about 1 minute.Step 5Add eggplant along with any marinade to pot. Cook, stirring constantly, 3 minutes. Using a wooden spoon, stir in crushed tomatoes, remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ cup water, scraping up any browned bits stuck to the bottom of pot. Reduce heat to low, cover pot, and cook, stirring occasionally, until eggplant is cooked through and easily pierced with a fork, 30–45 minutes.Step 6Uncover pot, increase heat to medium-low, and cook until sauce is reduced by a third and clings to eggplant (you don’t want the masala to be too wet or it will result in soggy rice), 8–10 minutes. Taste and season with more salt if needed. Remove from heat and cover pot to keep eggplant masala warm.Rice and AssemblyStep 7While the eggplant is cooking, place rice in a medium bowl and rinse in several changes of cold water, swishing rice with your fingers, until water runs almost clear. Fill bowl with cold water to cover rice by 2\" and let soak at room temperature 30 minutes; drain.Step 8Bring a large pot of water to a boil. Add cardamom, cloves, bay leaves, and salt; boil 2 minutes to infuse. Stir in rice and cook until barely al dente, about 4 minutes. Drain and set aside. Pick out and discard the whole spices if desired.Step 9Place a rack in middle of oven; preheat to 400°. Place saffron (if using) in a small bowl and cover with 2 Tbsp. hot water. Let sit at least 15 minutes.Step 10Transfer half of eggplant masala to a medium bowl and set aside. Spread remaining eggplant masala in an even layer in its pot. Top with half of rice (do not pack it down; you want to give the rice space to cook fully and become fluffy). Top with half of chile, half of cilantro, and half of reserved fried onions. Layer with reserved eggplant masala, then with remaining rice. Drizzle with saffron water (including saffron threads); scatter remaining chile, cilantro, and fried onions over top.Step 11Cover pot with a tight-fitting lid and bake 25 minutes. Let biryani sit, still covered (do not peek!), 15 minutes.Step 12Mound biryani on a platter or serve straight from pot. Top with lots of chopped cilantro; serve with yogurt and lemon wedges.How would you rate Eggplant Biryani?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleVery very good, but a lot of mistake on my side. I started the recipe without knowing I would need something to put in the oven (Don't have an oven safe casserole) The only thing I would say it takes more than 10 min to make fried onions. Other than this, delicious!JQuebec, Canada2/11/2022Great recipe! I think there is a typo in the recipe when it says “total time: 6-8 servings”. I will say that it takes several hours. Consider prepping your onions and frying them as a separate task, it takes about an hour alone. The description on how to fry the onions is perfect, make sure it gets deep golden brown, my second batch was a little under cooked and I had to improvise. I only put cilantro on the top after it was all cooked, I didn’t layer it. The flavors and the heat level were perfect for my taste! I ate this dish with someone native to India and they gave me high marks. One thing that was suggested to add was a hard boiled egg. I could also see adding some chopped nuts and currants or raisins. Amanda DDallas, TX1/3/2022This is one of the simpler biryani recipes I've come across -both in terms of actual ingredients + amount of pre-planning required (the marinade time is short!) - but the flavour payoff is big.  I thoroughly enjoyed this with some boiled eggs one night, Hedi Swanson's chana masala another, and a minty cucumbery yogurt sauce both days.\n\nThat being said, I think I did have unrealistic expectations about what this taste like - I was looking forward to the kind of broiled or fried eggplant that you come across in Middle Eastern recipes; the eggplant in this recipe is only stewed, so I'm not sure why I was expecting otherwise! The eggplant was good, but a little too large for my tastes, and I felt that that the eggplant to rice ratio was a little off (too much eggplant). Next time I may make the masala with potatoes or chickpeas, and add in fried eggplant at the layering stage.  \n\nThis might just by the style of biryani, or maybe I reduced my masala too much, but I found that the rice didn't fully mix with the masala, rather there was a lot of white rice interspersed with thicker bits of the marinade. They do eventually intermingle in your plate, but still not as homogeneous as I'd normally like.  \n\nAlso, since the onions aren't meant to stay crisp anyway, I just fried them all in one batch and saved a bit of time.\nRLibya12/28/2021This was absolutely amazing. So fragrant and so, so delicious. It's quite labor intensive and I recommend reading the recipe through several times before you start cooking.  I think it took me 3 hours start to finish.  I would definitely make it again and my family loved it.  Perfect post-holiday meal!AnonymousNYC12/28/2021Explore Bon AppétitDinnerMainVegetarianNut-FreeGluten-FreeIndianSouth AsianAsianRiceRice & GrainsEggplantVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-21", "author": ["Condé Nast", "Asha Loupy"]}