{"id": "2e5a39dc63f905c887a6744933ab95ba", "url": "https://www.bonappetit.com/recipe/one-pot-kimchi-and-squash-mac-and-cheese", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "One-Pot Kimchi and Squash Mac and Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOne-Pot Kimchi and Squash Mac and CheeseBy Hetty McKinnonNovember 8, 20204.2(119)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Emma FishmanEmailPinterestPrintEmailPinterestPrint“This is a ‘necessity is the mother of invention’ kind of recipe, borne from isolation, scant ingredients, an oversupply of kimchi, and sheer hunger,” writers recipe developer and cookbook author Hetty McKinnon. “Yet this unconventional one-pot approach also happens to be one of the simplest ways to prepare mac and cheese. Starchy pasta cooking water mingles with melted cheese to create a creamy, gooey sauce that still feels light. Kimchi and sharp cheese are a natural pairing (have you tried adding kimchi to your grilled cheese?) and combine harmoniously with butternut squash to deliver that irresistible triumvirate of flavors: spicy, savory, and sweet. You could use sweet potato instead of squash, or even add a bunch of spinach or kale leaves to bring some greenery to the dish. Keep this dish vegetarian by using a vegan kimchi, but if you don’t have dietary requirements, any type is fine.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonVegetable Peeler$10 At AmazonBox Grater$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWooden Spoon$6 At AmazonIngredients4 - 6 Servings½small butternut squash (about 1¼ lb.)1onion1garlic clove1cup Napa cabbage kimchi2Tbsp. extra-virgin olive oil1lb. elbow macaroni, shells, cavatappi, rigatoni, or other short pasta4cups vegetable broth or water1tsp. Diamond Crystal or ½ tsp. Morton kosher salt (optional)1lb. sharp cheddar4scallionsFreshly ground black pepperPreparationStep 1Peel ½ small butternut squash (about 1¼ lb.) and cut flesh into ½\" cubes. Peel and finely chop 1 onion. Using the flat side of your chef’s knife, crush 1 garlic clove, then peel and finely chop. Coarsely chop 1 cup kimchi (some kimchi juice is okay; no need to drain).Step 2Heat 2 Tbsp. extra-virgin olive oil in a large Dutch oven or other heavy pot over medium-high. Add onion and cook, stirring often, until softened slightly, about 2 minutes. Add garlic and kimchi and cook until kimchi is starting to brown and stick to bottom of pot, about 5 minutes.Step 3Add squash to pot and reduce heat to medium. Cover and cook, stirring halfway through, until squash is tender (a paring knife should pierce flesh easily), 6–8 minutes.Step 4Remove lid and stir in 1 lb. elbow macaroni, shells, cavatappi, rigatoni, or other short pasta, along with 4 cups vegetable stock or water. If using water, add 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt (if you broth isn't very flavorful, you may want to add a bit of salt too; start with 1/2 tsp. Diamond Crystal or 1/4 tsp. Morton kosher salt). Cover and bring to a simmer; cook until pasta is al dente and most of stock is absorbed (you want some starchy liquid left in pan), 6–8 minutes.Step 5Meanwhile, grate 1 lb. sharp cheddar on the large holes of a box grater. Trim and finely slice 4 scallions.Step 6Reduce heat to low and add cheese to pot; stir until cheese is melted and gooey, about 2 minutes. Season mac and cheese with a few grinds of freshly ground black pepper and scatter scallions over.How would you rate One-Pot Kimchi and Squash Mac and Cheese?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleWHY DOES THE RECIPE KEEP DISAPPEARING!?!  I have signed in 4 times and haven't even started cooking.\nJoan C2/21/2022One of my favorite recipes !!! We roast and blend the squash ahead of time for more consistent texture results and add korean bulgogi because we are not vegetarian + serve with siracha. Love this dish.Rebecca K.New London, CT2/16/2022Reallly enjoyed this recipe! I made it without reading the comments, so used the amounts as written. \nI had a lot of leftovers, so what I ended up doing the next day is chopping up some more kimchi and garlic, sauteeing it in a pan for a few minutes (like in step 2 of the recipe) then mixing that into the reheated mac and cheese. It was really good!! \nIn fact I think I might do something similar when I make this recipe again -- add the extra garlic/kimchi in at the very end when mixing in the cheese. SAC2/10/2022So great! ❤ double the kimchi. I like it cheesy so ended up with pretty much the same amount of cheese as the recipe. Best mac n cheese I've ever had!!! 🙌Sky C2/3/2022This is ridiculous. I'm so glad I only made half the recipe because I would have happily (and regrettably) sat down in front of a vat of it and eaten the entire thing. Would I make this again? Yes. Yes. 1,000 times: YES. Rachel RoszmannSan Francisco2/1/2022Yum!  Like most of the other comments, I reduced the cheese by 50% and it was still plenty cheesy.  I also increased the kimchi by ~50% because I wanted to finish off the open jar.  I had to use frozen butternut squash but it worked fine.Anonymous1/30/2022I love the combo of kimchi and cheese. It’s wonderful but this recipe needs way more salt and way more kimchi. You cook the kimchi so much you can’t even tell it’s in there. I honestly would even dbl the amount of kimchi. And season accordingly all the way through. Taylor GalindoLos Angeles 1/26/2022Kimchi and cheese, what a combo! Love this recipe, especially its one-pot attitude. I agree with other commenters that this recipe is very adaptable. In the end I doubt I used a pound of cheese, but certainly follow your own heart when it comes to that. I also added shallots, lots more garlic and kimchi than called for, I had some good looking mushrooms in the fridge so I chopped them up to come along for  the ride, and I chopped up and stirred in a bunch of spinach towards the very end. More veggies more texture! Ah and I got more spice by adding gochugaru before the noodles and broth.  Will be making again and adapting again based on whatever is in my fridge.SusPittsburgh, PA1/11/2022Honestly surprised me how well this worked and how easy it was. I meant to cut the cheese by half per other reviews and accidentally misread and cut it down to 1/4 and it was still good so I can only imagine a whole lb would be a little crazy. I’ll go for the half next time. Also plan to mash my squash before adding pasta to make that more of sauce than chunks (my squash took longer to cook than advertised but nothing crazy) and add in some green veggies for a little added nutrient boost. Might also increase the kimchi by half again but that’s just about how flavorful your kimchi is. I think the recommended additions from other reviewers of black bean paste or gochujang for a little extra umami would be lovely but didn’t have on hand. BananaMartiniElkins Park, PA 12/31/2021Incredibly easy to make.  Used a roast cauliflower instead - I'm sure the squash can be substituted with just about any vegetable/mushrooms you have in the fridge.Added gochujang. Used very little cheese, just enough to make the starchy liquid bind the pasta together.\nI think there was too much pasta though. Will adjust proportions next time so I get more vegetables. SamSingapore11/23/2021Followed this recipe exactly, with veg broth, except used half the cheese. It was perfect, so glad I used less cheese! Normally I’m all for super-duper cheesiness but this recipe does NOT need it. The kimchi gives it a lot of flavour. The full amt of cheese would completely overpower the kimchi flavours I think. The squash gives it a great consistency. Love the 1-pot convenience, would totally make this again!TrinaOntario, Canada10/15/2021Omg this is so good. I used 4 oz of cheese instead of the full pound and added one tablespoon of dou ban jiang (soybean paste). AnonymousNew York3/19/2021After reading the reviews I decided to treat like like the kimchi udon recipe. I halved the recipe as most suggested, and stared with butter and olive oil before adding my onions. Upped the garlic to three cloves, and added in gochujong with the squash. Cooked it in highly seasoned chicken broth and reduced the cheese. Results were super flavorful, and the consistency smooth and not gloopy. Upping the veggies next time for sure. BilliePittsburgh, PA3/12/2021This was delicious - like others I halved the recipe and it was perfect. \n\nI swapped some of the cheddar for a bit of mozzarella and added gochujang like someone recommended below.\n\nA good comforting dishKimmyKay2/9/2021This was delicious and was a great way to use up all the random leftover short pasta bags and kimchi I had. It made a LOT. \n\nI didn’t have clumping issues with the cheese like others mentioned—only thing I can think of that’d make it clump is not enough liquid or using pre-shredded. Shredding takes some time but is worth it to get a smooth cheese sauce.ElizabethDenver, CO1/2/2021Explore Bon AppétitPastaCheddarCheeseCavatappiPasta & NoodlesButternut SquashSquashVegetableMacaroniRigatoniPasta ShellsEasyOne-Pot MealsMainVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-08", "author": ["Condé Nast", "Hetty Mckinnon"]}