{"id": "2e5ba9b40fea089cb041ca015144753f", "url": "https://www.bonappetit.com/recipe/full-moon-cake", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Full Moon Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueFull Moon CakeBy Tara JensenFebruary 14, 20182.5(2)Read ReviewsTriangleEmailPinterestPrintA BAKER'S YEAR. Text and illustration credits (c) 2018 by Tara Jensen and reprinted by permission of St. Martin's Press.EmailPinterestPrintEmailPinterestPrintTara Jensen’s cookbook, A Baker’s Year, closes with an outline of the lunar cycle from new moon to waning crescent, followed by instructions for setting a new moon intention, and recipes for lofty, single layer “moon cakes” beginning with this full moon cake. “Incorporate all of the ingredients quickly and efficiently, and while it’s baking, sit next to your oven with a clock, a pen, and a notepad. Do not open the oven door for the first 20 minutes of baking. Make notes when the cake becomes golden brown and pulls away slightly from the edges, when the smells of the cake change, and to describe how it’s baking in your pan. Take the time to do some deep breathing and reflect on your recent days. Poke the center of the cake with a knife. When it comes out clean, make a note of the time and pull the cake from the oven. You may forgo the timer and the notepad once you learn the rhythm,” she writes, “but perhaps you will enjoy it, bringing the ritual of goal-setting and journal writing with you into your baking.” Read more about Jensen’s bakery here.Text and illustration credits (c) 2018 by Tara Jensen and reprinted by permission of St. Martin's Press.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At Amazon9\" Springform Pan$17 At AmazonGet It Right Spatula$13 At BA MarketWooden Spoon$6 At AmazonIngredientsMakes one 9\" cakeDry Ingredients2½cups cake ﬂour½cup unreﬁned sugar2teaspoons baking powder¾teaspoon sea saltZest of 1 lemonWet Ingredients5egg yolks, room temperature1teaspoon vanilla¾cup whole milk, room temperature¼cup olive oilEgg Whites9egg whites, room temperature¼teaspoon cream of tartarSpecial EquipmentA 9\" springform panPreparationStep 1Arrange a rack in center of oven; preheat to 325°. Cut a 9\" circle of parchment to cover bottom of springform pan. Grease pan with butter, dust with ﬂour, and set parchment inside. Step 2Sift sugar, baking powder, salt, and remaining 2½ cups flour into a medium bowl. Stir in lemon zest.Step 3Whisk egg yolks and vanilla in a medium bowl. Add milk and whisk to combine, then add oil and whisk again to combine.Step 4Pour yolk mixture into dry ingredients. Fold batter with a wooden spoon, scraping bottom and sides of bowl, until creamy, glossy, and fully combined (about 6–7 folds).Step 5Using an electric mixer on medium-high speed, beat egg whites in a large bowl until soft peaks form. Add cream of tartar and continue to beat until stiff peaks form (do not overbeat; it will dry out the egg whites).Step 6Using a large spatula, fold one-third of egg whites into batter to lighten. Fold in remaining egg whites in two additions until batter is bubbly, shiny, and loose.Step 7Pour batter into prepared pan and bake cake until a tester inserted into the center comes out clean, 45–50 minutes.Step 8Run a very sharp knife between edge of cake and pan. Let cool in pan until cool to the touch, about 1 hour.Step 9Carefully remove adjustable body of springform pan and invert cake onto a platter. Peel off parchment. Serve plain or top with whipped cream or icing, if using.Photo by Tara JensenPhoto by Tara JensenHow would you rate Full Moon Cake?Leave a ReviewTell us what you thinkExplore Bon AppétitCakeDessertBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Tara Jensen"]}