{"id": "2e696ec2fbceb850f153f31ddeab8f71", "url": "https://www.bonappetit.com/story/big-butternut-squash-soup", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "What to Do with a Really, Really, Really Big Squash | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat to Do with a Really, Really, Really Big SquashSenior staff writer Alex Beggs talks about soup season, her love of garlicky condiments, and more in this week's newsletter.By Alex BeggsOctober 15, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A squash as big as the RitzA butternut squash the size of a bowling pin showed up on my table last week. I cradled it in my arms and cooed to it the only lullaby I remember, the Oscar Mayer wiener commercial. Then I rolled it into a 400° oven (with a sheet of aluminum foil beneath to catch the ooze) and waited an hour, because there was no way I could cut that thing. I had dreams of butternut squash soup after a loud conversation at a bar with associate editor Christina Chaey about pureéd soups. While the squash slowly melted on the inside, I caramelized onions for the first time, a rewarding experience. Then I decided to wing it, inspired by Alex Delany’s rent week lazy squash soup. When the squash was so soft my tongs broke the surface, I cut it open and scooped the seeds outs, then plopped the rest into my precious, my Vitamix. I added a spoonful of those onions, some salt, Aleppo pepper, water, and half a can of coconut milk. Whir, whir, whir. IT WAS GREAT. Coconut-butternut squash soup! I microwaved it at work and served it with some chile crisp on top. Everyone was jealous.Want this letter before it hits the website? Sign up for our newsletter!The absolute unitI’m in awe at the size of this lad! Steve Geddes’s award-winning pumpkin is 2,528 pounds. THAT’S A LOT OF SOOP, BROTHER!Thin as spaghettiI have a personal obsession with the oldest people in the world, what they eat, drink, and do for fun. Then I try to replicate that in my own life. This story about Anthony Mancinelli, the world’s oldest barber (he’s 107!) didn’t let me down. Mancinelli is still on his feet cutting hair every day, and he eats and drinks (whiskey sours, please) in moderation. He told the Times: “I eat thin spaghetti, so I don’t get fat.” Nothing has ever made more sense.Pizza not-newsIn the viral food news that wasn’t, this week people were like, “Wow Little Caesars is serving DiGiorno frozen pizzas as Hot-N-Readys!” Based on a random person’s tweeted photograph (circumstantial evidence). It was funny and slightly scandalous and ultimately untrue. For some reason a K-Mart manager needed to store expired frozen pizzas in the in-store Little Caesars freezer so customers wouldn’t buy them and the whole thing has left me sort of deflated. I didn’t know K-Mart had in-store Little Caesars. I didn’t know frozen pizzas EXPIRED. I didn’t know any of this would ever matter.Breathe fireWe wrote about three new recipes for garlic condiments you should probably make this weekend and use for the months ahead—they can last a while. Creamy garlic confit (hello toast). Spicy garlic vinegar (on all the meats). Funky garlic honey (on pizza).Unnecessary food feud of the weekDo the flavors chocolate and orange ever belong together? We debated this over a box of Neuhaus chocolates this week that looked like smooth mini bowls of soup (sense a theme? Eh? eh?). I think they’re supposed to look like cups of coffee. Anyway. One had dark Colombian chocolate, samba tea (huh), and little bits of orange. When I asked everyone how they feel about chocolate + orange they SOUNDED OFF. “Um I can tell you NO NO NO NO” said Chris Morocco doing his closest N*SYNC impression. Close. “I think you start to appreciate it as you get older,” said David Tamarkin, adding: “Like WAY older.” Aliza Abarbanel skips ahead to out-of-context-ville: “Every episode of The Great British Bake Off, someone makes a Jaffa Cake inspired thing and Mary Berry eats. it. Up.” Emma Wartzman jumps in on the defense frontline: “Ina Garten’s Orange Chocolate Chunk Cake is HONESTLY the best cake.” Hilary Cadigan used to get a chocolate orange every year for Christmas and will not back down, she LOVES it. Sarah Jampel hates it. Amanda Shapiro will eat anything covered in chocolate. It really tore our family apart. But we always find our way back to common ground. Making fun of Alex Delany’s ripped jeans.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-15", "author": ["Condé Nast", "Alex Beggs"]}