{"id": "2e6e33986e2d506d75c1db43ce702350", "url": "https://www.bonappetit.com/story/shari-siadat-tood", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "Shari Siadat Wants You to Glitter From Head to Toe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleShari Siadat Wants You to Glitter From Head to ToeThe beauty founder talks about loving her unibrow, teaching kids about makeup, and her grandmother’s Persian cooking.By Kyle BeecheyJune 29, 2021FacebookTwitterEmailPhotography by Jocko GravesFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Shari Siadat, the founder of TooD, a beauty brand creating new categories of makeup.Shari Siadat has always been a busy woman. Before founding her industry-disrupting beauty brand, TooD, in 2019, she juggled life as a model, dancer, fitness instructor, and writer, all while caring for three young daughters. While working in the image-based industries of fashion, dance and fitness, Siadat, who is Iranian American, found herself uninspired and excluded by Eurocentric standards. She particularly grew tired of grooming her eyebrows to fit arbitrary American ideals. “Learning to embrace my unibrow, and taking pride in my own roots and heritage rather than feeling shame, has opened up a newfound freedom,” she says.While writing a children’s book in which, like her, the protagonist sported a unibrow, Siadat became inspired to launch TooD. She says she put the book on hold to work on a product that grew to become TooD’s signature Color Cream, a bright glitter used to highlight one’s features rather than hide them. The genderless makeup line also includes a TooDbrush for defining and fluffing eyebrows instead of tweezing them away. Siadat commits to sustainability by making the line nontoxic and reducing as much waste as possible in the production process. Packaging is made with recyclable tins, soy-based inks, solar energy, laser-printed wood, and Forest Stewardship Council certified paper.An added perk of TooD’s dedication to clean beauty standards: Its products are safe for everyone to play with, even Siadat’s daughters. The makeup brand helps her pass on the joyful ideals she’s cultivated around beauty to all three of them. “My hope is that they see me and my acceptance of who I am and it rubs off—that they realize they, too, can carve their own path,” she says.It is an act of resistance... to say I am enough. Every message from the top is telling us that we’re not good enough, even in small, subtle ways. You’re not skinny enough. You’re not pretty enough. You’re not making enough money. You need to grind yourself harder. You need to self-care harder. It is an act of resistance to wake up every day and choose joy. To see yourself as that magnetic life force and to know joy as your birthright.I chose glitter because... I wanted to create something clean and fun, so my daughters could wear it without worrying that they would be ingesting chemicals or toxins. On top of that, I wanted a product designed to celebrate features, not conceal or hide them. Something that would encourage the consumer to experiment. But glitter is a great example of a product we use without understanding its impact on ourselves and on the earth. While it might sparkle at first, the microplastics go from your body into the drain and into our water systems and ultimately harm our environment. I also wanted to bring a deep conscientiousness about what goes into the manufacturing process and make sure we had ethically sourced ingredients. TooD’s Bioglitter uses plant-based, biodegradable materials and natural dyes.The most surprising use of TooD has been... seeing glitter on a hand! I love how beautiful it looks there, or on an ear, or applied from your ankle to your shin. Like beautiful jewelry, it makes you look at the body in a different way. I also get a lot of feedback about how much the makeup line has allowed parents to facilitate conversations with their kids about makeup. Who is it for? Where should it be worn and how? The answers are really limitless. The products have served as educational and conversational tools between generations.To those who aren’t sure that my products could be for them, I say... that’s because the products really ask you to imagine that makeup could have a different purpose than we’ve been conditioned to expect. For example, I called my color creams “brow color creams” because I wanted to break people’s perception of where makeup can be worn and create a new product category. People sometimes say things like, “I love it, but I would never wear it on my brows.” But the product also works as the most beautiful eyeshadow, eyeliner, and lip liner. A name on a box can trick us into thinking we have to follow a product’s instructions. But these are products without instructions. With beauty, there are always new frontiers to explore.When we remove the restrictions around makeup… what can we create? Many beauty products are marketed very specifically to perform one function. With TooD, we want to encourage everyone to ask themselves, “Do I want to put color on my eyelids, or do I really want to just decorate the nape of my neck? What expresses me, if I had no one else’s opinions to worry about?”To feel beautiful… I am self-aware. The more I learn about myself and what I was put on this earth to do, the more I learn about how to nurture my own needs, and then extend that energy to those I care about. It’s ultimately about becoming a vessel for that connection. I feel this awareness of beauty the strongest when I move my body through dance, sports, or playing around with my daughters.For me, food is a source… of joy. It’s not only that the sensory experience and exploration of the flavors feeds my soul, but also that the ceremony of gathering and preparing the ingredients is just so much fun. All my favorite foods are from my mom and grandma’s Persian cooking. I can hardly resist a tahdig, fesenjan, or any stew with our traditional mix of mint, cilantro, parsley, and radish. And I love a good kebab moment.Explore Bon AppétitPerson of InterestHealthyishLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-29", "author": ["Condé Nast", "Kyle Beechey"]}