{"id": "2e84d7a1b19bb209727088fcbaac08b3", "url": "https://www.bonappetit.com/story/greens-eggs-and-ham-spring-brunch", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "For Easter Brunch or Any Spring Thing: Greens, Eggs, and Ham Casserole! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Easter Brunch or Any Spring Thing: Greens, Eggs, and Ham!It’s easier than it seems to make these nests of creamy, dreamy greens with an egg cracked right in the center.By Alex BeggsApril 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailWith apologies to Theodor Seuss Geisel, we took inspiration from his great work—as well as mother nature’s—for this spring greens, eggs, and ham casserole. It’s an Easter brunch recipe (hello, people from Google!), or anytime spring brunch recipe that you can prepare before hungry guests come over, and pop in the oven right when they do. Each serving is a bird’s nest of creamy greens, croutons, and pancetta that cradle a baked egg. Sound good? Yeah, because it is.The recipe is a Molly Baz creation that sought to achieve one goal: “Create a yum-delish spring-has-sprung brunch dish.” It’s got this green shakshuka thing going on, combined with steakhouse creamed spinach, combined with signature Molly Baz comfort food flavor. You can use spinach/chard/mustard greens, what have you—but it’s two pounds of green things, so we’re going to shamelessly confess right now to using that Costco size container of spinach and choosing to not wash it. (Pretty sure Molly told me that blanching counts as washing.) The nests are creamy, the eggs perfectly cooked and custard-like, and the croutons...are croutons. I feel I need to emphasize the fact that there are 10 garlic cloves in this recipe. 10.10!!!It comes together in three steps. I was going to say it’s sort of like you are the mama bird, building her temporary mansion, but then you eat the eggs, so that went to a dark place quickly. Forget the birds.First blanch all the greens in salty boiling water, then squeeze the water out and chop.Second, cook bacon, add scallions, chiles, garlic, and finally the greens.Third, mix in the heavy cream (oh yeah), Parmesan (mhm), and dill (whatever, not my thing).Assemble in a baking sheet over croutons, use a spoon to make indentations for eggs, crack yolks into each divot.Bake; eat.If you play your cards right, it can all happen in one Dutch oven + one 13 x 9” baking pan. Blanching in the pot first, then emptying the water and using it again for the pancetta, etc. You can even skip the “ham” part entirely if you desire, and cook the garlic, scallions, and greens in olive oil. Do NOT sub the heavy cream for anything less fatty though—Molly tried with half-and-half and it split.The recipe feeds six people, if everyone wants a whole egg. You could tack on more servings if you divide the eggs—there are plenty of greens to go around. (We did that during tastings.) What you can’t do is add more nests. (Molly tried to squeeze in eight; they didn’t fit.) Then take a spatula, and divide and conquer.Get the recipe:Greens Eggs and HamThis weekend brunch project is a springtime party showstopper.View RecipeExplore Bon AppétitEasterBrunchEggCasseroleSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Alex Beggs"]}