{"id": "2e8853ab925178ada2866329f0805146", "url": "https://www.bonappetit.com/story/tinkle-womens-facial-razor", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "This Face Razor for Women Does It All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Awkwardly Give This Face Razor to Everyone I KnowNo shame to anyone’s hair game, but if you’re shaping eyebrows or trimming peach fuzz, the Tinkle is for you.By Maggie HennessyMay 14, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!I’ve never been big on beauty products. I use cheap drugstore face wash and have a drawerful of unopened antiaging serums my mom impulse-bought me while waiting in TJ Maxx checkout lines over the years. Nor did I fancy myself an especially brand loyal sort—until recently, when it dawned on me that, actually, I’ve been unabashedly endorsing one beauty product for a solid decade: the Dorco Tinkle Eyebrow Razor affectionately known (to me) as the lady face-scaper.This pen-size face razor for women is travel-friendly and inexpensive (six pastel-hued sticks set you back $5, and each one stays sharp for about a half dozen uses). The Tinkle’s delicately notched edges work wonders on shaping eyebrows—less painfully and more accurately than plucking away with tweezers—and on fine hair like cheek fuzz. (I promise said fuzz won’t grow back coarser or nefariously multiply.) No shame to anyone's hair game(!), but over the years I’ve gifted Tinkles to countless women wanting to sculpt their brows or hedge trim upper lips, chins, and sideburns. It’s my version of taking a friendship “to the next level”; nothing fast-tracks intimacy like swapping tips on how to landscape rogue facial hair.Speaking of bonding, whenever someone in my life “gets” bangs (my own journey began at age four when Mom performed a fateful bowl cut), I like to slide a Tinkle across the table over cocktails. Like the pied piper of hair-scaping, I smugly empower the newly fringed to embrace self-trims. Be warned that trimming bangs dulls the Tinkle much faster than facial shaving (you might only get two uses out of each razor), but I’ve found it an excellent way to get fringe out of my eyes or snip face-framing layers between haircuts—without looking like I’ve hacked them crudely with kitchen shears after a glass and a half of Pinot.Lately, I’ve been Tinkling my whole face and neck for inexpensive, gentle exfoliation—husking dead skin off for what I’ve found to be a smoother complexion. (Known in wellness jargon as dermaplaning—face-shaving for exfoliation has swelled into its own lucrative market, full of high-end tools sporting advanced claims.) Still, any old single-edge razor will get closer to the skin than a multiblade one, removing dead surface skin cells while it shears fine hair.The act is almost therapeutic and easily as gratifying as peeling off a blackhead strip. However, I can’t say this face razor for women has done much for my hormonal mid-30s acne, which is now melding wonderfully with the slow creep of age lines. I suppose there are no silver bullets in beauty, are there? Still, nothing beats a good Tinkle.Dorco Tinkle Eyebrow Razor$5 at Amazon (6 razors)$5 at Tinkle USA (6 razors)Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-14", "author": ["Condé Nast", "Maggie Hennessy"]}