{"id": "2e8a4b735c726ce61d88bda7353d694f", "url": "https://www.bonappetit.com/story/how-to-make-flatbread", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "This Flatbread Recipe Will Forever Change Your Weeknight Dinners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make Flatbread, the Absolute Easiest Bread of AllYou don't have to be a domestic goddess to make flatbread on a weeknight.By Aliza AbarbanelJanuary 10, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailThe idea of baking bread for dinner feels like a fever dream, perhaps sparked by bingeing one too many reruns of The Barefoot Contessa. And while whipping up a loaf of sourdough on a Tuesday is wildly ambitious and, frankly, totally inadvisable, flatbread, on the other hand, is downright easy. You don’t even have to turn on your oven! It’s a low-commitment bread for busy and impatient people, and thus perfect for weeknights, impromptu dinner parties, and any other time you feel like eating it.Chris Morocco’s low-key whole wheat flatbread recipe (inspired by chef Josh McFadden’s yogurt flatbreads from Bon Appetit’s August 2015 issue), uses whole-milk yogurt to create a complex, tangy flavor similar to—but again, much easier than!—sourdough bread. It only needs five ingredients and twenty minutes of your time. Start by quickly whisking together whole wheat flour, salt, baking powder, and all-purpose flour, then add in the whole-milk yogurt. Resist the temptation to use Greek yogurt, which will throw off the ratio of dry to wet ingredients and keep the dough from hydrating properly.Once the yogurt is incorporated, knead the dough with your hands until it’s mostly smooth, which should take about a minute. Divide the dough into two places and wrap them in plastic, then set them aside for 15 minutes. (This is called “resting” the dough, and it will make it easier to roll.)Next comes the fun part: rolling out the flatbreads. Take a moment to dust your work surface with some all-purpose flour, which will prevent the dough from sticking to your countertop. Then, working one at a time, roll out the dough until it’s as thick as two stacked quarters (a.k.a. ⅛ inch). Use a clean wine bottle if a rolling pin hasn’t made its way into your kitchen arsenal, and don’t stress if the flatbreads aren’t perfectly round. Lopsided flatbreads are still very delicious!Once both flatbreads are rolled out, heat a medium cast-iron skillet over medium-high. Cook flatbread until underside is golden brown and puffy with a few charred spots, about two minutes, then turn and cook the other side until it’s golden brown, about a minute longer. Transfer to a plate, then repeat with remaining dough.It’s tempting to devour these flatbreads when they’re straight out of the skillet, but adding toppings will make them even more delicious. We love to pile on tender cauliflower and tofu, but they’re also a natural base for jammy eggs, peak-season tomatoes, and random leftovers. The power of flatbread transforms all—and with all the ingredients already tucked away in your pantry, a fresh batch is never far away.Make this flatbread recipe tonight:Easy Flatbread with Cauliflower and TofuChef Josh McFadden’s crazy-simple yogurt flatbreads from Bon Appetit’s August 2015 issue inspired this whole-grain version.View RecipeExplore Bon AppétitHealthyHealthyishFlatbreadFeel Good Food PlanRead MoreLifestyleBlack Lentils Are the Best Lentil for Meal Prep, PeriodBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-10", "author": ["Condé Nast", "Aliza Abarbanel"]}