{"id": "2eb44968f0a79133b465619c32714309", "url": "https://www.bonappetit.com/story/around-the-world-in-st-catharines", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Around the World in St. Catharines | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAround the World in St. CatharinesoddBird chefs Scott White and Justin Duc take us on a globally inspired tour of the Niagara Region’s largest city.By Destination Canada/Tourism Partnership of NiagaraOctober 5, 2018FacebookTwitterEmailPHOTOS BY SUECH + BECKFacebookTwitterEmailJust north of the U.S.-Canada border and a quick drive from Niagara Falls, the quaint enclave of St. Catharines, Ontario, is a not-so-hidden gem, world-famous for its abundance of winding vineyards, fruit orchards, and rich farmland. Though modestly sized with a population of just 133,000, St. Catharines boasts a mighty dining scene that punches far above its weight class. One of the brightest stars in its colorful constellation of restaurants is oddBird, the eclectic eatery from chef-partners Scott White and Justin Duc.  The duo’s menu changes often and on a whim, and  influences are far-flung and far-ranging: Here you’ll find anything from a blood-red horse heart tartare to sticky-sweet General Tso's duck breast to a massive côte de boeuf taco platter. But where do White and Duc eat when they’re not in their own kitchen? To find out, the pair took us on a flavor-filled tour of their city’s global gems.Ma Chinese CuisineFirst we stroll up to Ma, one of White and Duc’s favorite haunts for Chinese eats. Though ensconced in an impressive red brick building dating back to the turn of the last century, it’s the interior that’ll really make you gasp. “It’s just a gorgeous, wonderfully designed space,” Duc said, his eyes darting around the dramatically lit dining room decked out with a wood-beam ceiling, stone floors, and industrial accents. We sit down and scope the menu, which delivers flavors straight from Hong Kong, Shanghai, Chongqing, and beyond. “Not only is the lobster juicy, tender, and deeply fragrant, it’s one of the most spectacular looking things you can get here,” Duc said, pointing to the gargantuan crustacean at the center of the table. We’ve ordered it sauteed with flavor-packed peanuts and crispy fried garlic, but you can also get it with ginger and scallions, underneath mountains of diced garlic, or wok-baked with soy sauce. Other can’t-miss menu items? Anything on the dim-sum menu, which includes authentic nosh like delicate steamed-shrimp dumplings and golden-hued egg tarts, not to mention the elegantly plated Peking duck. “It’s refreshing to have real Chinese food in St. Catharines, and not just some Americanized version of Chinese food,” White said. “This place is the real deal.”Lang RestaurantJust three blocks away, our taste buds shift from China to Vietnam. Grilled meat and hot pot are the dual focuses of Lang BBQ, which White and Duc dig for its bang-on flavors and homey atmosphere. The duo make quick work of the menu, ordering up slivers of fatty pork belly, springy squid balls, and coins of lotus root to simmer in fragrant broth. While it bubbles away, we spark up the grill built right into the table and char slices of curried chicken and Vietnamese sausage over a crackling flame. “It’s a cool family-style thing, really interactive,” said White. “It reminds me of Christmas when I was a kid with my meat fondue!”Sahla Thai RestaurantLess than a 10-minute walk away is Sahla Thai Restaurant, White’s go-to Thai joint. “It’s kind of my family spot,” he said. “We all have our birthdays there.” Without hesitating, White orders a steaming plate of piled-high pad Thai—the classic rice noodle dish stir-fried with shrimp, chicken, eggs, bean sprouts, green onions, and finely chopped peanuts—and follows it up with a creamy bowl of Penang curry enriched with coconut milk, peanut curry sauce, and slivers of beef. “Their curry has just the right level of spice, the perfect consistency, and the flavors are just killer,” he said, spooning the rich sauce over a mound of fluffy white rice.La Scala RistoranteAfter a five-minute walk down St. Paul Street, St. Catharines’s bustling main artery lined with boutiques and restaurants, we hang a right down a relatively quiet side street to find Italian mainstay La Scala. White and Duc make a beeline for the charming outdoor terrace and snag a table. “It’s got one of the nicest patios in the whole downtown area, plus the food is really authentic Italian,” Duc said. We order a bevy of delights: the panini stuffed with thin slices of prosciutto, roasted red peppers, and creamy fiore di latte; a mound of juicy P.E.I. mussels draped in an anise-flavored black sambuca sauce; a hearty plate of penne classico smothered in a rich homemade sauce of San Marzano tomatoes; and herb-marinated calamari grilled to crispy perfection.Chile & AgaveNext up, we pile into the car and drive 10 minutes across town to Chile & Agave for a midday pick-me-up. “It’s probably some of the most authentic Mexican food you can get in St. Catharines,” White said of this colorful hangout jam-packed with vibrant, straight-from-Mexico decor. We opt for specialties including the tacos Yucatan, which come stuffed with jumbo grilled shrimp glazed with tequila-spiked honey, and a platter of flour quesadillas overflowing with tender slices of nopal cactus. Of course, Duc notes, we can’t leave without tossing back a shot or two. “The tequila tasting is always good,” he said.George's Greek VillageThough we’re nearly stuffed, we begin to feel hunger pangs as we drive the five minutes to George’s Greek Village. It’s a miracle! Before we even look at a menu, White puts in an order for the grilled octopus drizzled with ouzo. “It’s rare to find octopus on a menu here, and it’s even harder to find octopus that's done well,” he explained. “It’s a good indicator of a quality spot.” We round out the meal with the restaurant’s dramatic saganaki—a hearty slab of decadent kefalotiri cheese sauteed in olive oil and flambéed tableside—and a smattering of creamy dips from roe-infused taramasalata to garlicky skordalia.Our daylong eating tour concluded, it’s finally time for White and Duc to put away their appetites. Or is it? “We’re headed to oddBird,” White said with a laugh. “It’s time to cook dinner.”Still hungry for more Niagara eats? Visit Niagara has you covered with a rundown of delectable restaurants, wineries, farmer’s markets, and more.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-05", "author": ["Condé Nast", "Destination Canada Tourism Partnership Of Niagara"]}