{"id": "2ec622d22991e09afa14f4ad619d3737", "url": "https://www.bonappetit.com/story/thanksgiving-etiquette-2019", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Thanksgiving Etiquette: Is It Ever Okay To Reject a Relative’s Offer to Cook Something? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Reject a Relative’s Offer to Cook Something?Solicited, questionable advice for your Thanksgiving gathering. By Alex BeggsNovember 26, 2019FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.At what age does one officially graduate from the kids’ table (asking for a, um, 31-year-old friend)? —Elderly ElaineThe kids’ table is way more fun, and the conversation way more stimulating, than what’s going down at the adult table, which is an encyclopedic run-down of cousin Arnold’s last five podiatrist appointments. But I get it: You want some respect. Did you help prepare a dish, do Cinderella-level floor cleaning, or otherwise contribute labor to the dinner? Do you file your own taxes? ONLY THEN do you get permission to dine among the elders. Also, if there are enough chairs.Illustration by Cari Vander YachtMy well-meaning sibling insists on baking elaborate, Mary-Berry-Great-British-Baking-Show schlock every year. How do I politely decline? —Harold the HaterI don’t think the Mary Berry jab is necessary, but you have a common conundrum: guests who show up with random dishes that throw off your entire Thanksgiving tableau. When you send out the invites and the Google-doc-that-isn’t-Excel-but-is-Excel of contributions, make a locked column of specific dishes (e.g., Green Bean casserole, Cranberry Sauce, Seven-Layer Dip), and have people sign up to bring those. If someone asks if they can construct a 17-pound pumpkin-spice trifle, say, “That sounds lovely, but to maintain order in the universe, please consult the spreadsheet.”We do Thanksgiving potluck-style, but I don’t have time to cook anything. What can I bring (besides wine) to show that I am trying? — At-Least-She-Tried AdrianaHow about:Compostable platesScratch-off Lotto ticketsIcePepto-BismolBounty select-a-size paper towelsThat book you borrowed from me in 2012GrandmaGlad Lock deep dish storage containers for leftoversIllustration by Cari Vander YachtIs it ever okay to just...not help clean up? —Bitter BettyPeople DISAPPEAR when it’s time to clear the table, yet at no other time are they more exposed. We see you “Going to check on the baby/the game/Grandma.” If you didn’t bring something, or you’re a kid, you’re doin’ dishes! Relish the soapy solitude.SNACK BREAKThis Thanksgiving, consider shrimp cocktail! Here’s how to make it like your favorite steakhouse does.BA’s Best Shrimp CocktailShrimp cocktail is all about the shrimp: big, fat, perfectly cooked gorgeous shrimp. Here’s how to do it.View RecipeHow do you go about telling your friend who drinks too much that he might want to consider not drinking too much this year? —Good Luck, GaryThere’s too much nuance in this scenario—your relationship with this person, how bad the drinking is—for me to solve this complicated problem in one paragraph. (I’m also not a trained therapist!!!) But I’ve been saying this (loudly) at the start of meals: “Guys, I’ve discovered this new technique that people have been writing about in magazines for years! After every glass of wine, I chug a glass of water. And it works! I am vowing, in the presence of this turkey, not to get drunk at Thanksgiving.” Perhaps others will follow.Illustration by Cari Vander YachtWhat should I do if my mother-in-law and I are in disagreement about what temperature the turkey should be cooked to? —Freakout FeliciaThere are a lot of moments on Thanksgiving where you need to accept that you are powerless to the dubious decisions of others, and this is one. (Eating dinner at 4 p.m. is another.)When it’s your turn to “give thanks,” is it wrong to say, “I’m thankful Thanksgiving is only once a year”?  —Grateful GillianIt’s certainly not wrong…but does that make it right? Here are some ideas for things to be grateful for this year:Claire SaffitzYour healthLizzoThe Co-Star appThose straws made from hayMortadellaMy uncle’s new girlfriend picked the crispy skin off the turkey as we carved it while saying, “The skin is the best part.” Discuss. —Gossipy GailYou have some hostility toward this interloper, huh? If it were your goofy cousin Kyle instead would this be such a big deal? It’s Thanksgiving! Open your heart and your home. The golden brown crispy skin IS the best part. I always sneak a sample for quality control. At the very least you’ve gotta respect You’re Not My Real Aunt’s survivalist instincts. If she didn’t grab it now, who knows if her serving would have any skin on it?! (It wouldn’t, because she ate it all.)That’s all for now, but if you have petty etiquette questions, recipe requests, or just want to tell me you think I’m unfunny and WRONG, so wrong, about everything, please email staff.bonappetit@gmail.com.Love, AlexExplore Bon AppétitIs It Ever OkayEtiquetteThanksgivingRead Morecooking10 Tips To Help You Win ThanksgivingBy Adam RapoportrecipesBon Appétit’s Absolutely, Positively Perfect Thanksgiving MenuGallery8 SlidesBy The Bon Appétit Test KitchenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-26", "author": ["Condé Nast", "Alex Beggs"]}