{"id": "2eccc796ba416ce6d924059f1d294379", "url": "https://www.bonappetit.com/story/slippery-slimy-orzo", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "We Argued Over Orzo This Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Slippery, Slimy Pasta That We Argued Over This WeekAn unnecessary food feud, an inspiring love story from Kansas, and a field trip to David Chang’s new Peach Mart.By Alex BeggsMarch 23, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you’ll see it before everyone else.She orders the roadkillA friend tipped me off to this wonderfully quirky story by Denise Weil in The Wichita Eagle about a couple, The Watsons, who dine at Texas Roadhouse six days a week, their only meal of the day. If you’ve ever looked around the tables while you’re dining, wondering who’s on a blind date, who’s about to break up, who’s cutting a shrimp in half for the love of their life—this story provides that glimpse into not-so-ordinary, ordinary life. My favorite detail is that the couple bought a $200 gift certificate to the restaurant around the holidays because it came with a year of free shrimp appetizers. “We’re going to eat 1,560 shrimp this year,” Mr. Watson said.Photo by Chelsea Kyle, Food Styling by Michelle GattonIt’s a sandwichOur most popular recipe of the week was this kale reuben by Chris Morocco, a cheesy, sauerkraut-laden, healthier-than–corned beef sandwich that immediately entered the vegetarian sandwich hall of fame, alongside Turkey and the Wolf’s collard green melt and Rooster Soup Co.’s broccolini cheesesteak. Of course, it was not without controversy. Some readers felt that the sandwich was missing something—cured meat—but it turns out they were the ones missing something—the point.Get the recipe: Kale ReubenWant this letter before it hits the website? Sign up for our newsletter!I can’t stop thinking about thisAdd to queueEater reports that Chef’s Table creators are working on a new show, Street Food, which was great news to me, a person who can only take so much artful tweezing. Street Food will hit Netflix on April 26.When you catch up with a trend 3 months lateIt might look like this: a diligent Trader Joe’s reviewer finally tastes the novelty pancake bread that caused a viral shortage at the start of 2019. Is it still worth the hype? Or has it gone the way of wedge sneakers? [Find out here].(https://www.bonappetit.com/story/trader-joes-reviews-2019)Custard kidCarla Lalli Music’s son Cosmo handed out her coffee crème caramel at a party in the Bon Appétit Test Kitchen this week for her just-released cookbook Where Cooking Begins.Get the recipe: Coffee Crème CaramelField tripElyse Inamine and I took a quick jaunt to the new Hudson Yards, a mega mall in Manhattan, this week to check out Peach Mart, a David Chang spot inspired by Asian convenience stores, tucked in a corner on the fifth floor. Our favorite snacks were some Bugle-like corn chips, fried superdog bites (corn dog balls served with spicy mustard), and blue cans of Pocari Sweat, an electrolyte drink that tastes like human sweat with a little added sweetness. Mmmm.Unnecessary food meme of the weekUnnecessary food feud of the week“I’d never say it out loud,” Sarah Jampel said out loud (in a whisper), “but I like orzo.” Hey, me too! “I think of it as a small pasta. It cooks quickly, the shape is pleasing, and it’s spoonable.” Imagine a car coming to a shrieking stop. Christina Chaey shakes her head. “Why would you eat orzo when you could eat pasta or rice, which are both great?!” “It looks like slimy lice or something,” said Amanda Shapiro, who may have never had lice because, take it from me, they don’t look like that at all. “It’s very Silver Palate dinner party 1989,” mused Adam Rapoport. “Maybe there’s some dill and parsley in the orzo, you’re drinking an oaky bottle of Chardonnay, and afterward people go outside to smoke because parents still smoked back then.” Scenic! “I stan orzo,” enthused Molly Baz, “I like how slippery it is!” I sent Andy Baraghani a quick text that read “orzo?” His reply: “I’ll just say that I’m on a flight about to takeoff and the word orzo already ruined my flight.” Safe travels, Andy![EDITOR’S NOTE: WHAT IS WRONG WITH EVERYONE? ORZO IS AMAZING! TEAM JAMPEL!]Get the recipe though, it’s a good one:One-Skillet Chicken with Buttery OrzoWhy use a bunch of pots and pans when fennel, orzo, and chicken can be cooked in one?View RecipeExplore Bon AppétitBeggs NewsletterRead MorecultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-23", "author": ["Condé Nast", "Alex Beggs"]}