{"id": "2ed3d0cc36c66b1bcd97b210e1992adc", "url": "https://www.bonappetit.com/story/making-perfect-mashed-potatoes-gravy", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Perfect Thanksgiving Mashed Potatoes and Gravy Have Arrived | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perfect Thanksgiving Mashed Potatoes and Gravy Have ArrivedIt all comes down to Butterballs and MSG.By Alex BeggsOctober 23, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how the Mashed Potatoes With Crispety Cruncheties and Why-Is-It-So-Good Gravy came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamCarla Lalli Music and Molly BazThe ChallengeDevelop a creamy mashed potato recipe that brings something new to the table—and can be made ahead. The gravy should also be make-aheadable and shouldn’t rely on turkey drippings or a roux.The SolutionThe potato texture is a credit to the right guy for the job: the German Butterball. Plus, roasting the potatoes first concentrates the flavor. The gravy’s depth comes from roasted poultry bones and—surprise!—MSG.Watch Carla and Molly make the perfect mashed potatoes and gravy.\nRoast Your Potatoes Before MashingWant your mashed potatoes to taste like potatoes? Roasting them intensifies their earthy and malty qualities, and helps the flesh achieve a fluffy, moist texture. “You know, a Maillard reaction is happening in there,” said Molly, celebrated potato scientist. Maillard, as in the chemical jamboree that happens when sugars in foods rearrange in the oven, causing browning. Boiling, which yields tender but relatively bland potatoes, just doesn’t compare.Butterball or BustRick Bishop of Mountain Sweet Berry Farm led Carla and Molly in a taste test of 10 spud contenders. Then they boiled, roasted, and steamed the top three and mashed each of those. That’s nine pots of mashed potatoes! But the pale golden yellow German Butterball won by a landslide (sorry, Yukon Gold). “You think of butter when you look at it,” Carla said—and it tastes buttery too. Its fine cell structure (that’s right) means it gets fluffy when roasted and suuuper smooth when mashed.Isn’t she perfect?\nPhoto by Alex LauInfuse, Can’t LoseWe mash with a mixture of milk and butter infused with lemon, thyme, garlic, peppercorn, and salt, which adds more flavor but still lets the Butterballs shine.A Crispy Moment“Everything on the Thanksgiving table is soft and floppy,” Molly sighed. To bring some texture back to the meal, Carla and Molly added a crunchy topping inspired by patatas bravas: a mixture of breadcrumbs and potato chips spiced with garlic, paprika, lemon zest, thyme, and fresh parsley. We ate it like fiends during testing.Do It AheadThese are extra-velvety mashed potatoes with a light body (how would you describe your potato body?), so you might not need milk when you reheat them over medium-low. If you do, at it slowly and gradually.Get the recipe:Mashed Potatoes With Crispety CrunchetiesRidiculously, impossibly creamy mashed potatoes with a patatas bravas-inspired topping.View RecipeThe Great Gravy Technique: Beurre ManiéBeurre manié is a mixture of soft butter and all-purpose flour and memories of a French class taken long ago. It thickens the gravy without the whole get-another-pan-out roux-tine.Wait, MSG Is the Secret?Monosodium glutamate is a naturally occurring amino acid found in many tasty foods (like Parmesan), and though the store-bought version is engineered, it has the same umami-to-the-max effect. Despite exaggerated fearmongering reports in the ’70s, a sprinkle in your gravy is harmless, per the FDA.Flavor in a jar.\nPhoto by Alex LauTake StockHomemade turkey (or chicken) stock is necessary. You want flavor-packed gravy? You gotta earn it, so you gotta build it. Get the recipe for turkey stock here or Instant Pot chicken stock here.What’s Parsley Doing Here?Adding much-needed brightness. Things were getting intense.Get the recipe:Why-Is-It-So-Good GravyA make-ahead gravy gets a remarkable depth of flavor from roasted poultry bones and—surprise!—a sprinkle of MSG.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeExplore Bon AppétitThanksgivingPotatoMashed PotatoesGravyMaking Perfect: ThanksgivingRead MorecookingEverything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving TurkeyBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Alex Beggs"]}