{"id": "2ede43ded330a560e9a3fec62438db6d", "url": "https://www.bonappetit.com/recipe/chef-justin-sutherlands-pimento-cheese-juicy-lucy-with-tillamook", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Chef Justin Sutherland’s Pimento Cheese Juicy Lucy with Tillamook Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDChef Justin Sutherland’s Pimento Cheese Juicy Lucy with TillamookSponsored by TillamookFacebookPinterestTwitterEmailServes 4Not all pimento cheeses are created equal. Chef Justin Sutherland of Handsome Hog, and other popular restaurants across the Twin Cities, uses Tillamook Sharp Cheddar for maximum flavor in this southern staple made into a midwest mainstay.PrintIngredientsPimento Cheese2 cups (4 ½ oz.)  Tillamook Sharp Cheddar, grated on the large holes of a box grater1 ¼ cups pimentos, drained well and finely diced1 cup (8 oz.) cream cheese, softened1 cup mayonnaise2 ½ tsp.  bourbon smoked paprika (recommended); substitute with traditional smoked paprika if needed2 tsp. hot sauce2 tsp. kosher salt¼ tsp. sugar¼ tsp. white pepper⅛ tsp. cayenne pepperBurgers and assembly2 lbs ground beef8 soft burger bunsToppings of choiceRecipe PreparationMix pimento cheese ingredient together until well blended. Flatten 4 small 2-oz. (2 Tbsp.) disks of pimento cheese (about 2-inches wide) and freeze 20 minutes or longer. Refrigerate remaining pimento cheese.Form 8 burger patties each about 4 ½ -inches in diameter. Place a frozen round of cheese between two burger patties sealing edges very well to contain filling. Season burgers with salt and pepper and sear over moderately high heat in a cast iron skillet, about 6 minutes per side, until burgers are cooked through and cheese is melty.Serve on buns along with any desired toppings.Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}