{"id": "2ee426bf2d68a94a35f3cc1965e56f75", "url": "https://www.bonappetit.com/story/granny-cart", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "This Granny Cart Is My Saving Grace Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureThis Granny Cart Is My Saving Grace Right NowThey may not be cool, but they sure are useful.By Meryl RothsteinApril 30, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Back in 2018, a time that can now officially be referred to as “quaint,” I wrote about how much I love my granny cart. Everything I said then is still true today: It makes grocery shopping infinitely easier, because I can buy what I need, not just what I can comfortably carry. You shouldn’t have to be a powerlifter to be able to bring home a case of seltzer and a couple canned tomatoes.But now, a granny cart is even more invaluable. With most of us making grocery runs as infrequently as possible, a couple tote bags will barely get you through the bean aisle. My granny cart fits a serious weekly shop for my family: a few dozen eggs, the several tubs of yogurt we manage to go through, a few packages of meat and tofu, a modest collection of canned goods, plus plenty of produce including bulky bunches of kale. Definitely a frozen pizza. Plus, I don’t have to worry about sterilizing the germy communal handlebar of a grocery store shopping cart.I have this one, but if I were buying one right now, I’d go with a bigger model like this. You know, just in case I happened upon a 24-pack of toilet paper.Whitmor Deluxe Utility Cart$53 at AmazonExplore Bon AppétitShoppingCoronavirusHighly RecommendRead MoreCoronavirusWhat to Know About Shopping and Cooking During CoronavirusBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-30", "author": ["Condé Nast", "Meryl Rothstein"]}