{"id": "2ee49c22056aec7140d9c14ea10e8d6f", "url": "https://www.bonappetit.com/recipe/sea-bream-crudo-with-lemon-and-olives", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Sea Bream Crudo with Lemon and Olives Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueSea Bream Crudo with Lemon and OlivesBy Ignacio MattosApril 17, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintGrating tomato (especially bruised ones) acts as a simple sauce to dress this crudo. Sea bream, common in the Mediterranean, has lean flesh with a light, delicate flavor. If you can’t find it, porgy or snapper are suitable subs. For a long, lazy lunch menu serve this crudo alongside tomatoes and haricots verts, handmade malfatti, grilled turbot, and tiramisù with cookies.Ingredients8 servings2plum tomatoes, halved crosswiseKosher salt½lemon1½lb. highest-quality sea bream, skin, bones, and blood lines removed1½cups arugula⅓cup Niçoise olives½small red onion, very thinly sliced½cup fresh lemon juiceExtra-virgin olive oil (for drizzling)Flaky sea saltPreparationStep 1Grate tomatoes on a box grater until all the flesh is grated and there is just skin left; discard skin. Transfer tomato pulp to a small bowl and season lightly with kosher salt.Step 2Cut lemon half into quarters; remove seeds and white pith in the center. Thinly slice quarters.Step 3Place fish on a cutting board. Hold a long knife at a 45° angle and cut fish with the grain into ¼\"-thick slices (use a sharp blade and aim for one long, clean stroke). Cut each slice in half crosswise.Step 4Arrange sea bream on chilled plates. Spoon a bit of grated tomato around and scatter lemon pieces over. Top with arugula, olives, and onion. Pour lemon juice over, then drizzle with oil and sprinkle with sea salt.How would you rate Sea Bream Crudo with Lemon and Olives?Leave a ReviewTell us what you thinkExplore Bon AppétitMediterraneanFishSeafoodOliveOther IngredientsLemonCitrusFruitQuickEasyStarterRawDairy-FreeGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}