{"id": "2ee86f3781b6377f2f33c99c6e54b5d0", "url": "https://www.bonappetit.com/recipe/bibingka-waffles", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Bibingka Waffles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueBibingka WafflesBy Woldy ReyesSeptember 14, 20215.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintGrowing up, Woldy Reyes coveted the Eggo waffles that his peers ate for breakfast. “I’m first-generation Filipinx American, and Eggos were not something we had at home,” Reyes says. So when he was invited to pop up at his friend Eric See’s Brooklyn restaurant, Ursula, he knew he had to do a waffle. This recipe is inspired by bibingka, a Filipino cake generally made with glutinous rice flour that his mother would make for breakfast on special occasions. This rice flour is the secret to these waffles’ delightful chew. Top them with fresh fruit, toasted coconut flakes, and coconut yogurt to keep them vegan and gluten-free.Standard and Belgian waffle makers will work for this recipe. Read more about why the Presto FlipSide is our No. 1 pick. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBelgian Waffle Maker$50 At AmazonHeatproof Measuring Cup$18 At AmazonWhisk$10 At AmazonIngredients4 - 6 Servings1cup (135 g) rice flour1cup (165 g) glutinous rice flour½cup unsweetened coconut flakes½cup (100 g) sugar1Tbsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt113.5-oz. can unsweetened coconut milk½cup club soda1tsp. vanilla extractNonstick vegetable oil sprayCoconut yogurt, fresh fruit, and toasted unsweetened coconut flakes (for serving)PreparationStep 1Whisk together rice flour, glutinous rice flour, coconut flakes, sugar, baking powder, and salt in a large bowl. Whisk coconut milk, club soda, and vanilla in a medium bowl to combine. Pour into dry ingredients and whisk until combined.Step 2Heat a Belgian or standard waffle iron and lightly coat with nonstick vegetable oil spray. Pour ½–¾ cup batter per waffle onto iron. Cook waffles until crisp and light golden, 5–8 minutes. Repeat with remaining batter.Step 3Serve waffles warm, topped with coconut yogurt, fresh fruit, and toasted coconut flakes.How would you rate Bibingka Waffles?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMade these with dairy milk since that’s what I had, and was very skeptical because the batter was super thin. They barely rise so one side didn’t cook as well on my stovetop waffle iron, but they are delicious! I didn’t have problems with sticking.ChunkStyle 12/19/2021Chewy, crispy, delicious! I didn’t have club soda on hand, so used sparking water instead.  Also subbed in toasted sesame seeds for the coconut flakes.  I buttered the waffle iron, and waffles were crispy and golden!  No issues with releasing.  Will definitely make again! AnonymousSan Francisco11/27/2021I used a nonstick waffle iron (nothing has ever stuck to it) and greased with coconut oil anyhow.  The waffles stuck thoroughly.  I was able to salvage enough of the first batch, in pieces, for he two of us to eat.  It was delicious, with a wonderful texture.  I cleaned the waffle iron and greased it again, but the second batch was not even slightly salvageable.  Now I’m left  wondering how I’m going to get this mess out of my electric waffle maker.  I might make this again, but as pancakes.Jeanne Idaho10/24/2021Made these this morning. So yummy and easy! We will definitely make them again.Anonymous10/14/2021Just made these, the club soda is a game changer, creating a fluffy waffle! Delish.SWorks cooksCO Rockies10/12/2021Ingenious! Bibingka with a twist! Incredibly delicious!!!tessla 🌸Hawaii9/22/2021Explore Bon AppétitWaffleCoconut MilkOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Woldy Reyes"]}