{"id": "2ee9e334e9f1fd43242c6ae884a245d2", "url": "https://www.bonappetit.com/story/bokksu-box", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "My Bokksu Box Delivers the Best Japanese Snacks Right to My Door | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI’ll Never Run Out of Pocky AgainMy Bokksu subscription delivers the best Japanese snacks right to my door.By MacKenzie Chung FeganSeptember 30, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Tammy Cheng had the best snacks. Her dad owned a giant Asian market in the South Bay, which meant playdates at Tammy’s house were the highlight of the week. We’d cue up Speed on her family’s LaserDisc player—truly, the Chengs had it all—and help ourselves to a pantry stocked with sugary delights. The Chinese treats like milky White Rabbits and Haw Flakes were old familiar friends, but my favorites were the Japanese snacks: Pocky, fruit-flavored Kasugai gummy candies, Hi-Chews, those koalas and pandas with bloated bellies full of chocolate. I’d pack myself full of sugar until my pulse was speeding faster than a bomb-laden bus on an LA freeway.Twenty-five years later, I don’t have a standing invitation to Tammy’s house, but I do have my monthly Bokksu box. Bokksu is a snack subscription service that brings the best sweet and savory Japanese goodies straight to my door. My first box had a \"Seasons of Japan\" theme and arrived with sixteen different varieties of artisanal snacks. There was a \"white strawberry\" that, through some type of benevolent sorcery, combined the taste and appearance of a lush strawberry with the texture and creaminess of white chocolate; several different varieties of umami senbei, or rice crackers, including these Dondon Yaki flavored with sharp-sweet tonkatsu sauce; and moist matcha cake flecked with chocolate chips, perfect for pairing with a mellow afternoon cup of green tea (organic genmaicha sachets also included). I unboxed airy mochi puffs dusted with roasted soybean powder, yuzu sake hard candies, and doughnuts stuffed with red bean paste from Hokkaido like the lucky recipient of a care package curated by a thoughtful and snacky Japanese auntie.Photo by Emma FishmanBokksu Japanese Snack BoxShop Now at BokksuBoxes ship monthly (purchase them individually, or sign up for a twelve-, six-, or three-month Bokksu subscription), and each is composed around a different theme that aims to illuminate a different aspect of Japanese culture and cuisine. Your shipment also includes a slick 'zine that tells you about the family businesses and craft snack makers behind each item, like the 100-year-old Kyoto confectionery Daimonji Ame Honpo responsible for these gorgeous translucent candies that, yes, I crushed. If you can't get enough of something in your monthly subscription box, Bokksu also operates a marketplace where you can buy premium Japanese snacks (Alphonso mango Kit Kat!) as well as teas, pantry items, and housewares à la carte. If there's a child in your life, may I recommend this bamboo dining set shaped like the Catbus from Totoro?I’ll still house a pack of Pocky any day of the week, but thanks to my Bokksu box, I now feel that I’m a more sophisticated Japanese snacker, attuned to regional specialities and heritage bakeries. My tastes have matured, but my appetite is still voracious (sorry, Mrs. Cheng, for repeatedly ransacking your pantry), and Bokksu has me covered.Or you could always make your own Pocky:Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-30", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}