{"id": "2eec6b5dbdf275f311d941dbc1920b08", "url": "https://www.bonappetit.com/recipe/spiced-lamb-tagine", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Lamb Tagine Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSpiced Lamb TagineBy Andy BaraghaniFebruary 6, 20194.5(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintYou don’t need a tagine, a conical earthenware pot typically from Morocco, to make this warming, fragrant, tender lamb stew. A Dutch oven works great! This lamb tagine gets its vibrancy from spices like cinnamon, cumin, turmeric, and cardamom. If raisins aren’t your thing, swap them out for another dried fruit like apricots, tart cherries, or prunes—just chop them so they’re raisin-sized.Ingredients4 servings2lb. boneless lamb shoulder, excess fat trimmed, cut into 2\" piecesKosher salt3Tbsp. extra-virgin olive oil1large yellow onion, chopped11½\" piece fresh ginger, peeled, finely grated4garlic cloves, thinly sliced2bay leaves¼cup golden raisins⅓cup plus 2 Tbsp. slivered almonds2Tbsp. tomato paste1tsp. ground cinnamon1tsp. ground cumin½tsp. crushed red pepper flakes½tsp. ground turmeric¼tsp. ground cardamom½small red onion, very thinly sliced1cup mint leaves, torn if large½lemonPreparationStep 1Pat lamb dry with paper towels, then season on all sides with salt. Let sit at room temperature 1 hour, or chill, uncovered, up to 12 (longer is better; overnight works great).Step 2Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in batches, cook lamb, turning occasionally, until browned on all sides, 12–14 minutes total. Using a slotted spoon, transfer lamb to a plate. Add yellow onion and 2 Tbsp. water to pot and cook, stirring occasionally and scraping browned bits from bottom of pot, until onion is slightly softened, 8–10 minutes. Add ginger, garlic, bay leaves, raisins, and ⅓ cup almonds. Cook, stirring occasionally, until garlic is softened, about 3 minutes.Step 3Return lamb to pot and add tomato paste, cinnamon, cumin, red pepper flakes, turmeric, and cardamom. Cook, stirring occasionally, until mixture is fragrant and tomato paste has darkened and is beginning to stick to bottom of pot, about 3 minutes. Pour in 6 cups water and bring to a boil. Reduce heat to medium-low and bring to a bare simmer. Cover partially with lid (you want a little space for steam to escape) and cook, stirring occasionally, until lamb is tender and liquid has thickened, 60–75 minutes. Remove from heat; taste and adjust seasoning with salt.Step 4Meanwhile, toast remaining 2 Tbsp. almonds in a small dry skillet over medium heat, tossing often, until golden brown, 4–6 minutes. Transfer to a cutting board and let cool before coarsely chopping.Step 5Toss red onion and mint in a small bowl. Squeeze out juice from lemon over; season with salt. Toss again to coat.Step 6Ladle stew into bowls. Top with chopped almonds and onion salad.How would you rate Spiced Lamb Tagine?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis was so easy and insanely delicious. Highly recommend!Steph Gainesville, FL1/17/2022This is one of the best recipes I've made. Really impressed with this one.  The amount of flavor you get, and such a simple recipe. I skipped the onion salad because the grocery store was out of mint, and it was still delicious. Can't recommend this one enough. Wouldn't change anything(which is rare for me). This is going to be part of my regular rotation.HalSeattle, WA7/4/2021Andy knocks out delicious recipes every time. Looking for the book. Not too salty.Bill ZarsNear Chicago.6/19/2021Extremely tasty! The onion salad adds so much freshness to the warm spices it’s delicious. I added 3 carrots which amped the sweetness and were incredibly succulent in the broth. Indeed followed advice and used just 5 cups of water and it was plenty sufficient. Doesn’t take much time at all for a batch recipe, we are putting this guy in our regular rotations.Nicole HSeattle WA4/4/2021Like many reviews, I used less water and added a couple of splashes of apple cider vinegar and extra tomato paste to liven it up— without the vinegar, the red onion salad is indeed essential to counter-balance the richness of the lamb.\n\nAdditional changes: I added dried apricots and cranberries since I’m not fond of raisins and would rather have the other dried fruit on hand. I toasted the almonds and added it to herbed, garlic couscous I used to bed the tagine. Good recipe that is forgiving and easy to adapt.\n\nNote: the recipe has slivered almonds but it looks like sliced almonds in the picture. I used slivered which gave a good crunch. Nicole POakland, CA1/11/2021This was delicious - adapted for instant pot to be able to make it a weeknight meal. Sauteed in the instant pot as described in the recipe then added 2.5cups of water (rather than 6) and pressure cooked for 30mins with manual release.AnonymousNew York11/24/2019This was awesome!! I made it when my partners sister came over and everyone loved it!! We didnt have a tonne of time (luckily she was late) so we only put in 4 1/2 cups of water instead 6 as we didnt think it would simmer down in time. It took about 2 hours to cook but was sooo delicious. I couldn't find golden raisins so just opted for normie raisins and i added chopped dried apricots to the couscous and garnished the meal with crumbled feta. Yum!AnonymousNew Zealand9/7/2019I made this and adapted it for my electric pressure cooker since I didn't have a lot of time on my hands. I pretty much did everything as written in the recipe, except I reduced the liquid to 2 cups since no evaporation can happen in the pressure cooker. I also only put in 1 bay leaf instead of 2. I set it to pressure cook for 20 minutes, and it came out fantastic. So flavorful and rich. Served it with kale rice pilaf and a bottle of Shiraz...fantastic dinner! This will definitely go into the rotation. AmyOSti18Connecticut3/1/2019The is the perfect cold Sunday night recipe! AnonymousSeattle, WA2/18/2019But I would change it - I can't believe it calls for 6 cups of water; I only used 5 and had to thicken it at the end anyway.  Also, using the kosher salt at the beginning made it too salty I thought.  kkendall1917Vancouver2/16/2019Yet another amazing BA recipe. Ah you have transformed my cooking life. Happy belly and heart! I’ve made this tonight but I’m afraid thst you really should tweak the recipe to serve 6-8 because there’s no way between me and my other half (who is a chef) that this will make it through the night. And I so wish it would..!\n\nMy Tweaks:\n1) I bought the lamb shoulder still on the bone so trimmed the meat off of it and discarded excess fat, then threw the bone in to the tagine. \n2) For more even cooking, I cooked it low and slow in the oven until any remaining meat had completely fallen off the bone.\n\n3) Side dish suggestions: couscous - I sautéed onion and garlic and seasoned with salt cumin, cinnamon and some smokey paprika then added some diced dates to the pan. I set this aside whilst I cooked the cous cous in chicken stock, mixed everything together and just before serving I added fine chopped flat parsley and some toasted almonds to garnish.\n\n4) I also prepared some chickpeas with lemon juice, diced red onion, lemon zest, finely chopped parsley and mint, good quality olive oil, salt and created a yoghurt moat on a low setted bowl with a flat base, then piled the chickpea salad on top and drizzled high quality olive oil, lemon zest and finally salt and pepper to finish it off.\n\n5) Another thing I improvised on was an eggplant topping for the tagine- to be added at the end. I cubed and soaked eggplant in salt for 30 mins then rinsed and patted dry. Then tossed in olive oil salt and pepper and some panko crumbs. Put it in the oven on the lower shelf but on grill. It added a nice little crunch on top. Topped the tagine off with a few thinly sliced pieces of mint and ta-da!\n\nI’m going to go viciously defend leftovers now. Enjoy guys! And thank you BA.AnonymousLondon, UK2/12/2019My boyfriend loves lamb and begged me to make this recipe. I have trouble eating lamb but this recipe was delicious! The raisins plump up from the stew and bring a delightful sweetness. I'm usually too lazy to make garnishes but this one really complements the dish (and it looks great). mpham16Costa Mesa, CA2/11/2019Made exactly per the recipe and thought the flavor was excellent. It does need some extra salt when all done. Will make again!AnonymousLafayette, CA2/11/2019Fabulous and scrumptious!!  (I prefer diced dried apricots, instead of raisins.)pelipen3215Golden CO2/11/2019I would make it again but it has to be re worked. It needs a lot more flavour or everything. After it was all done it was still very flat. I ended up adding juice of a whole lemon and cooking it until it fell apart and boiled right down. Way better with that and more seasoning. Lamb shoulder is fatty regardless of how much you trim so i found it really needed some acid of some sort. Also the slivered almonds i found to be a bit too delicate. I would have used sliced ones and toasted them all before putting the 1/3 cup into the pot. They would have held up and given this dish a nice textured crunch.  \nAnonymousToronto2/10/2019Explore Bon AppétitStewSoups and StewsMoroccanNorth AfricanAfricanAlmondNutLamb ShoulderLambMeatTurmericHerbs & SpicesCardamomFallMainDairy-FreeGluten-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-06", "author": ["Condé Nast", "Andy Baraghani"]}