{"id": "2eff423ec31b5111896e8953d1155b2d", "url": "https://www.bonappetit.com/story/the-most-impressive-summer-galette", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "The Blueberry Galette Recipe That Makes People Think I Work at Bon Appétit or Something | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Galette That Makes People Think I Work at Bon Appétit or SomethingThis recipe's the reason I look like a fancy-pants pastry chef all summer long.By Alex BeggsJune 28, 2019FacebookTwitterEmailMichael Graydon & Nikole HerriottFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Every summer, I pack a big tote full of library books, wine, and my rolling pin into the trunk of our car and consider myself ready for vacation. I have simple needs. But I have ambitious dreams. I always intend to make postcard-worthy pies that cool on a windowsill while blue jays do my dishes, but usually that plan goes out that same window because I don’t have the stamina or patience for cooling pies. I make this galette instead.Maybe you’ve heard the sermon before, about how much easier it is to make galette than pie. It can be “rustic” (misshapen and oogly)! There’s no pie pan required! Forget whatever blind-baking is! Yes, all of that is true here. BUT!This recipe is better than the others, which are fine. This one, by Rachael Coyle of Coyle’s Bakeshop in Seattle, has a half-cup of pecans in the dough. They get toasted and ground into meal, giving the dough this nutty flavor, deeper color, and that good fat. After you grind the nuts in a food processor, you add in the rest of the dough ingredients—flour, sugar, salt, cinnamon, and cold butter—and give it a whir. Add ice water, slap it into a blob, and chill for an hour while the birds do the dishes.The filling is even easier—blueberries mixed with sugar, lemon juice, and cornstarch to thicken. The final galette, with bursting berries and tart lemon up against that nutty flaky dough, tastes sophisticated and restaurant-y. People are like, what, do you work at Bon Appétit? Did you go to culinary school? Did you make this yourself? (That’s two truths and a lie, people.)Yes!! I did!!! I gaze in proud mama glory at my galette, whose rustic shape looks like a deformed sand sculpture stepped on by a toddler. Which is to say, beautiful.And you can take it even easier on thyself if you buy almond meal ($$) or upgrade to hazelnut meal ($$$), which accomplish the same fancy goal. For alternative fruit options, I follow the recipe’s ratio for blueberries to cornstarch, 2 cups berries to 1 Tbsp. cornstarch. You gotta use lemon for that needed acidic moment (or to counteract possibly-blah blueberries), which you WILL notice. It brightens everything up like an iPhone screen in a movie theater. Something everyone loves!I don’t know anything about you or your life and nut allergies, but I hope you’ll make this galette this summer and feel the same joy, pride, and sugar high as it’s brought me, year after year. (And it’s pronounced pah-cahns, not pee-cans. Thanks.)Get the recipe:Blueberry-Pecan GaletteNovice bakers, this one’s for you.View RecipeExplore Bon AppétitNever FailGaletteBlueberryDessertSummer DessertsSummerRead MoreStrawberry–Graham GaletteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-28", "author": ["Condé Nast", "Alex Beggs"]}