{"id": "2f211272781b65901e9fe3bf01abc994", "url": "https://www.bonappetit.com/recipe/cauliflower-bolognese", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Cauliflower Bolognese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCauliflower BologneseBy Andy BaraghaniNovember 5, 20184.2(170)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Rebecca Jurkevich EmailPinterestPrintEmailPinterestPrintNo, this isn’t some kind of joke, and you don’t have to be a vegetarian to love what’s going on here. Chopped-up cauliflower and mushrooms provide comparable richness and texture to what you usually get from the classic long-cooked ground meat sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonMicroplane$16 At AmazonIngredients6 servings12oz. mushrooms, such as shiitake or crimini, stems removed1medium head of cauliflower (about 2¼ lb.), broken into florets¼cup plus 2 Tbsp. extra-virgin olive oil, plus more for drizzling4Tbsp. unsalted butter, divided1large onion, finely chopped6garlic cloves, thinly sliced1chile, such as serrano, Holland, or Fresno, thinly sliced, or ½ tsp. crushed red pepper flakes1Tbsp. finely chopped rosemary⅓cup double-concentrated tomato pasteKosher salt1lb. rigatoni2oz. finely grated Parmesan (about 1 cup), plus more for serving3Tbsp. finely chopped parsley½lemonPreparationStep 1Pulse mushrooms in a food processor until finely chopped. Transfer to a small bowl. Wipe out food processor bowl.Step 2Working in 3 batches, pulse cauliflower in food processor until pieces are about the size of a grain of rice (some smaller and some larger ones are fine), transferring to a medium bowl as you go.Step 3Heat ¼ cup oil and 2 Tbsp. butter in a Dutch oven or other large heavy pot over medium-high. Add mushrooms and cook, stirring occasionally, until golden brown, 4–6 minutes. Add onion and 2 Tbsp. oil to pot. Cook, stirring occasionally, until onion is very soft and golden brown, 6–8 minutes. Add garlic, chile, and rosemary and cook, stirring occasionally, until garlic is softened and mixture is very fragrant, about 3 minutes. Add tomato paste and cook, stirring constantly, until paste is slightly darkened, about 2 minutes. Add cauliflower and cook, yes, still stirring occasionally, until cauliflower is cooked down slightly and begins to stick to bottom of pot, 6–8 minutes. Season with salt, then keep warm over low heat.Step 4Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until almost al dente, about 1 minute less than package directions.Step 5Using a slotted spoon, transfer pasta to pot with sauce. Add 1 cup Parmesan, remaining 2 Tbsp. butter, and 1 cup pasta cooking liquid. Increase heat to medium and cook, stirring occasionally, until pasta is al dente and sauce is clinging to pasta, about 3 minutes. Remove from heat and stir in parsley. Taste and adjust seasoning with salt (it'll probably need another pinch or two). Finely zest lemon over pasta and toss once more.Step 6Divide pasta among bowls. Top with more Parmesan, then drizzle with oil.How would you rate Cauliflower Bolognese?Leave a ReviewTell us what you thinkReviews (110)Back to TopTriangleFollowed recipe exactly. A lot of effort with bland results.CaraCharlottesville, Va2/25/2022I DON'T understand people who leave a negative review after subbing out most of the recipe...I followed the recipe as written except used a mix of mushrooms, which was what was available in my grocery store.  I DO NOT like mushrooms, but I gave this a go since we are trying to eat some plant-based meals once in awhile.   It was really good.  It had the texture of bolgnese, and a good depth of flavor.  By chopping up the mushrooms I really couldn't tell they were in there.  I will make this again., and will also pass it along to friends who are vegetarian. LindaNew Jersey2/4/2022Great recipe.  Going to make it again this week.PWHaddon Heights, NJ1/9/2022Ignore the negative reviews left by those who went off-script!! This was so good and satisfying. You really don’t miss the meat just like Andy said. :)\n\nFollowed the recipe to a T, except I was a little short on cremini mushrooms and added mushroom powder to help make up the difference. Used the food processor to also chop the onion. Opted for the chili flakes rather than a fresh pepper.\n\nIf you follow the recipe as written, I can’t imagine how this comes out as poorly as others described. kkSeattle1/4/2022I made this with 'nomato' sauce, and it still turned out great!MeenakshiIndia12/28/2021Super surprised that people say it didn't turn out like the picture, as I felt like this was one of the easiest recipes I've ever made to get looking like the \"styled\" photo. I used fresh shiitakes and got them nice and browned before moving on, same deal with every ingredient, and followed the recipe exactly. I would imagine adding a bunch of extra veggies (like carrots/celery even though they're \"traditional\") would water down the sauce, as would using chanterelles instead of the recommended shiitakes (chanterelles are probably 2-3 times as \"wet\" as shiitakes), so that could be peoples' issue? Also, using \"double concentrated\" tomato paste (the kind that comes in a tube) per recipe instructions is essential: if you're just using the normal canned stuff you're skimping on a lot of potential umami. I'm not a vegetarian and have had \"real\" bolognese countless times, and while not an exact copy, this is a very good dish in its own right. \nA tip to help beef up the flavor and texture might be to use as little water and as much salt as possible when cooking your pasta to really up the starchy broth factor, and only add to the sauce a quarter cup at a time, stirring vigorously until it reaches a velvety consistency. I wonder to myself about people who start by changing a bunch about the recipe and then comment how it didn't work for them...AnonymousSeattle, WA10/28/2021This was such a painful dish to cook.  At every turn it was so far away from what it needed to be...  But I'm not a vegetarian and neither is anyone in my family.  I'm just on a mission to feed them more veggies.  I changed a lot about the recipe but I stayed true to it being vegetarian.  I started off with a basic assortment of carrots, onions, garlic to get the \"sauce going.\"  I used the food processor for my mushrooms (chanterelles and crimini) and cauliflower.  1 head of cauliflower was way too much.  I minced the rosemary and added some sage.  All the veg created an enormous amount of water - no bueno - and I spent the good part of an hour trying to \"cook it off.\"  I added an embarrassing amount of salt and pepper (not to mention red wine) just to give the whole thing color and an attempt towards flavor.  Against my better judgment I added in the cheese to the sauce (which I normally would never do) and it showed.  The sauce was stringy and goopy and just not bolognese.  Sad to say - my family ate it but I got nasty looks all through dinner.  I'm trying to figure out what neighborhood dog to feed the leftovers to since even our parrots looked at me like I was nuts.  If I had no idea what 'real' bolognese was supposed to taste like...maybe...just maybe...this could work.  Anyone who's eaten the real deal will eat this and cry themselves to sleep at night.AnonymousMill Valley, CA10/20/2021I’ve made this a million times, sometimes subbing with what I have on hand. It’s so good when omnivores have it, they don’t realize there’s no meat. Mushroom haters don’t know there’s mushrooms in it. It’s so savory and delicious!  It can be made vegan easily without compromising flavor. AlOhio10/18/2021Full disclosure - I subbed cauliflower with carrots. This recipe is awesome. The End. Not really....I did some research (I'm a researcher) after making the substitution thinking I'd chosen a more nutrient dense (and flavorful) veg with carrots. I was surprised. Moving forward I will absolutely make this recipe again, but I will use a 50/50 mix of carrots and cauliflower. They balance what the other lacks, like any good relationship. Look, I love meat. I'm not proud of it and I'm trying to inch towards vegetarian every day for ethical, health, and environmental reasons. However, I did not miss meat in this recipe one single bit. It is robust, so flavorful and satisfying that I didn't feel the need for parm. I'm one of those people who likes a lot of richness in my food. I have a high metabolism and my body craves fat, but this was perfect for me as is. With the following exceptions that were just regular items for me: I added thyme, a bay leaf, and a splash of red wine like many others here. This will be in regular rotation. Andy never disappoints. BA: Please make your recipes filterable by chef, please and thank you. Minnie's MomLos Angeles10/6/2021How could this turn out so bad? I did everything as written. It is Not Edible.\nI am thinking some of the steps need to be changed up - onions first, garlic next - hello? No way would the onions brown to golden after the sticky mushroom mush was \"done\", an throwing on the cauli-rice... I just wanted to cry.\n1/3 cup double concentrate tomato paste made not one dent in the non-de-script colour of the cauliflower- mushroom stuff. Who took that mouth-watering photo anyway?\nFinally, I decided life was too short to safe this.\nAnyone else had this experience or was I targeted by bad food energy?MarianneTerrace, BC Canada10/5/2021Why are stems removed?linstickCanada10/4/2021Haven't made it yet, but I will be adding carrot and celery as the traditional recipe calls for.  The mushroom and cauli are great subs for the meat.AnonymousCT9/24/2021This is delicious!  We are not vegetarians, but make regular Bolognese a lot.  Highly recommended!sharonSan Luis Obispo CA4/22/2021I have now made this five times, maybe six. This recipe is so very good. The key is using the amount of mushrooms called for in the recipe. Do not skimp, ask me how I know. It needs careful tending but you are rewarded at the end. I tried with the rigatoni but I just don't like that shape. So I have used spaghetti and pappardelle.  It is a wonderful sauce and makes a lot. Freezes well.Annie RamsaySan Diego, CA4/18/2021Delicious. Highly recommend. Easy. Layered flavors. Used a mix of shrooms including cultivated. Feared I didn't have earthy-enough shrooms so I rehydrated some shiitake in water and added that. Added white white wine (because that's what I had open but would have prob been even better with red) to deglaze the pan after the tomato paste. I was using pasta the kids had cooked earlier so I didn't have pasta water. Used water from rehydrating the shrooms instead. Even though it didn't have starch it worked to make it sauce-y with the butter. Used thyme instead of rosemary because that's what I had. Threw in a parmesan rind while everything cooked and so I didn't add grated parmesan. Loved the lemon zest at the end. I had way too much garlic but other than that I loved it. Def do again. The only reason it didn't get 5 stars is because I'm stingy with my stars. Def make again.DeniseDetroit, MI3/9/2021Explore Bon AppétitPastaCauliflowerVegetableMushroomRigatoniPasta & NoodlesMainVegetarianNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Andy Baraghani"]}