{"id": "2f23f8b9689aea57174095beeee4a123", "url": "https://www.bonappetit.com/story/march-horoscopes-eggs", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "March Horoscope Time: What's Your Egg Sign? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMarch Horoscope Time: What's Your Egg Sign?Are you a reliable hard-boiled egg or a fluffy, opulent soufflé?By Catherine UrbanMarch 2, 2018FacebookTwitterEmailIllustration by Oscar Bolton GreenFacebookTwitterEmailWelcome to March, hungry stargazers! Your horoscopes this month will have you seeing into the future (where things are warmer and brighter), but more importantly, into the frying pan. Because the theme is EGGS. Are you a crispy fried egg with a side of nearly burnt toast or a fluffy egg soufflé? Find out below.Illustration by Oscar Bolton GreenAriesThis month, you’ve got a great deal of focus on your side (for once), so you might find yourself passionately chipping away on a project at home, or even on your home itself. Take advantage of being in your own world while you can, Aries, and don’t feel bad if you aren’t your usual social butterfly self. Take this time for you and consolidate your energy. See where inspiration leads you, which might be to the kitchen, where you can finally hone your poached egg technique. The perfect poach requires a confident hand as you gently drop the egg into a swirling vortex of simmering water. We’re not saying it’s a metaphor, but gaze into the swirling vortex of water yourself and report back on any visions you may or may not have. Either way, you’ll end up with a beautiful, bouncy cloud-like egg—and a new trick up your sleeve. Eggs Benedict anyone?Illustration by Oscar Bolton GreenTaurusYou already have the wardrobe part down, but get ready to go out on the town this month. Everybody wants to make plans to connect with you. You’re going to feel popular—and loved—but most of all, you can find a sense of peace amidst your life in motion. Ignore the craziness at work for a hot second and focus on all of the wonderful people in your life who are there to affirm that you are freaking awesome. Also freaking awesome: Scotch eggs—hard-boiled eggs enveloped in sausage and breadcrumbs—a glamorous midnight snack that will make you feel special after a fun (okay, beer-soaked) evening out. For you, life is about good taste and little pleasures. Or at least that’s what you said when you bought everyone that last round of shots.Illustration by Oscar Bolton GreenGeminiYou’ve got a good stride going in your professional world, which gives you confidence to take the lead in other areas of life. You’ve been putting it off for a while, but you may have to have that difficult conversation with your partner or a close friend. Don’t let your nerve derail you from being compassionate or getting to the point, and you might be surprised how well things smooth out afterward. Sometimes a little friction is what’s needed to reinforce the bond. And for the part of you that does NOT wish to have kind words, dish up some deviled eggs for the devil on your shoulder—the classic finger food that you can customize to your liking, oh indecisive one, with enough fiery paprika to satisfy your mischievous side. Come on, you know you want to.Illustration by Oscar Bolton GreenCancerYou’re especially focused on your career this month, whether you’re pushing towards accomplishing a big dream you’ve envisioned, or alternatively, feeling bored and ready for something new. Either way, it’s time for some creative reinforcement. Renew your excitement for what you do by taking a class, signing up for a webinar, or listening to a motivational podcast. Get inspired! You love being prepared for anything, so set the mood for success by making a delicious quiche, layered with cheese and bacon in a flaky crust. Just slice and go, for breakfast, lunch, or dinner. One less thing to for you to worry about so you can continue your climb to success.Illustration by Oscar Bolton GreenLeoYou seem to be processing a lot this month, turning your usual radiance inward. This is all well and good, Leo, but avoid overcomplicating things by maintaining your focus on the important issues as they arise. This is a significant period for personal growth, but also for romance. Plan a nice evening at your nearest izakaya that involves yakitori, tons of sake, and chawanmushi—the smooth and (usually) savory  Japanese egg custard that’s as dreamy as you are this month. Like you, it stands out against the rest.Illustration by Oscar Bolton GreenVirgoYou’ve got a case of spring fever and you’ll go stir crazy if you don’t get out of the house this month. You’re a crafty one and know that sometimes you’ve got to make your own magic. Go to the movies or bundle up for a long walk in the woods. You’re feeling extra social this month, which is perfect, as your energy will be best spent enjoying the company of others. Do Sunday morning right by grabbing brunch with your friends and order soft-scrambled eggs—expertly fluffy and maybe even with crème fraîche, Gordon Ramsay-style—the ideal breakfast of champions. You can raise your mimosa glass to that!Illustration by Oscar Bolton GreenLibraYou love being lazy in these last weeks of winter, filling your online shopping cart with summer clothes as you wait for the temperatures to rise. This month is an excellent time to psyche yourself up about creating healthier habits, remembering all of those resolutions that faded in mid-February. Whatever it is you’re planning, get pumped about it and dive all the way in. Between spin class and yoga, you’ll without a doubt be enjoying some hard-boiled eggs—packed with protein and easy to meal prep. And meal prep means you’ve got more time in the week to maximize on the couch. See? Everything comes full circle this month.Illustration by Oscar Bolton GreenScorpioBy nature, you are a deep and private person, but this month, you might feel more willing to come out of your shell. You calendar is packed with playtime, so let loose and enjoy yourself more, as you rightfully should! The heat turns up in your romantic life, presenting yet even more opportunities for enjoyment and communication. You often assume your partner is a mind-reader like you, but not everyone has this gift, so go ahead and tell them what you’re thinking. This whole year is about growth, which means getting out of your comfort zone. You’ll want a custardy omelet with bacon, mushrooms, and ricotta—an epic rendition of your trusty standby that reminds you that good things happen when you are open to change.Illustration by Oscar Bolton GreenSagittariusExpect chill vibes this month, Sag. Everything seems well and good. You recognize that life is a journey and that everything smooths out in time. You’re in the middle of a year-long incubation period, perhaps working on a big project or just trying to figure out what’s next. Despite paralleled uncertainty and excitement, you realize that there is absolutely nothing to worry about, so go ahead, kick your feet up, and allow the creative gears of your imagination to churn. If you’ve never made shakshuka before, now is the time—his supremely flavorful tomato sauce with charred peppers and poached eggs comes together fast in your trusty cast iron skillet. It’s casual and refined at the same time (like you, of course), just don’t forget some crusty bread or pita to soak up the sauce.Illustration by Oscar Bolton GreenCapricornYou’ll be feeling the need to spread your wings and explore this month. We want you following your curious whims wherever possible. Go ahead and plan that weekend road trip or take that aerial silk class you’ve always wanted to try. While you usually don’t stray too far from your comfort zone, you’d be wise to try it this time—you could make some excellent connections that prove to be helpful later. And at the very least, your craving for new experiences will be satisfied. But before returning to business-as-usual, be sure to sub your usual breakfast bagel for an egg dosa, a crispy, savory Indian pancake packed with spice—something new and delicious for a go-getter like you.Illustration by Oscar Bolton GreenAquariusYou normally prefer to breeze through life, however this month is a rare period where you should take things seriously. You might be considering a big investment of some kind, like buying a house. Always trust your instincts, but you may have to loosen your grip on something you’ve been really stubborn about (clawfoot tubs aren’t as common as we wish). But lucky for you, you can always put your innovative spin on anything and call it a masterpiece. While your attention is focused on big matters, you’ll need some comforting crispy fried eggs—no drama, diner-style eggs with runny yolks and flaky salt. Not everything in life needs to be complicated.Illustration by Oscar Bolton GreenPiscesHappy birthday Pisces! You are invigorated by a sense of renewal (and buttercream frosted cake) this month! Confident, radiant, and optimistic, you’re feeling unusually excited to dive into the year ahead. Your right to be enthusiastic is affirmed by all your friends who are there to celebrate you. You are always putting others first (and we love you for it) but this time, it’s your turn. Spoil yourself, Pisces and don’t wait for someone else to do it for you. You are a precious gem deserving of those fancy linen bedsheets you’ve been eyeballing. Plan a getaway, preferably at the spa, where you can unwind and let yourself float. Top it all off with a cheesy egg soufflé—a divine breakfast that rises up like a cloud to meet you at your level of out-of-this world proportions. As you (and Mae West) always say, too much of a good thing can be wonderful.Catherine O’Neill is an astrologer and writer who is currently mastering poached eggs. You can check out more of Catherine’s work here.All signs of the zodiac deserve this fluffy French omelet:Explore Bon AppétitFood HoroscopesEggRead MorecultureRead Your February Doughnut Horoscopes and Then Make Them Come TrueBy Catherine UrbanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-02", "author": ["Condé Nast", "Catherine Urban"]}