{"id": "2f277836d41c614951afb23f06b1fb92", "url": "https://www.bonappetit.com/recipe/spiced-chickpeas-and-greens-frittata", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chickpeas and Greens Frittata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSpiced Chickpeas and Greens FrittataBy Molly BazNovember 20, 20184.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhen in doubt, frittata. This version turns greens and beans into a complete one-skillet supper.Ingredients4–6 servings12large eggs1½cups chopped tender herbs (such as basil, cilantro, and/or parsley)¾cup sour cream½tsp. crushed red pepper flakes1tsp. kosher salt, plus more4Tbsp. extra-virgin olive oil, divided215.5-oz. cans chickpeas, rinsed,patted dry2tsp. medium curry powder1medium onion, finely chopped6garlic cloves, 5 thinly sliced, 1 whole1small bunch hardy greens (such as mustard, kale, or Swiss chard), ribs and stems removed, leaves torn into 2\" pieces⅔cup mayonnaisePreparationStep 1Preheat oven to 350°. Whisk eggs, herbs, sour cream, red pepper flakes, and 1 tsp. salt in a bowl until no streaks remain.Step 2Heat 2 Tbsp. oil in a medium cast-iron or ovenproof nonstick skillet over medium-high. Add chickpeas and curry powder and season with salt. Cook, tossing occasionally, until golden brown, 6–8 minutes. Transfer 1 cup chickpeas to a bowl; set aside.Step 3Reduce heat to medium, add onion, sliced garlic, and remaining 2 Tbsp. oil to chickpeas in skillet and cook, stirring occasionally, until onion is softened and starting to brown, 7–9 minutes.Step 4Add a handful of greens and 2 Tbsp. water and cook until slightly wilted. Continue adding greens a handful at a time, letting them wilt slightly before adding more, until all greens are wilted, about 5 minutes total; season with salt. Let cool 3 minutes.Step 5Return pan to medium-low, pour in egg mixture, and cook, stirring eggs and swirling pan often, until edges are just set (texture should be like a very soft scramble), about 6 minutes. Transfer to oven and bake frittata until puffed slightly and center is barely set, 10–15 minutes. Let cool 5–10 minutes.Step 6Place mayonnaise in a small bowl and grate in remaining garlic clove; mix well. Season with salt.Step 7Serve frittata with garlic mayo and reserved chickpeas.How would you rate Spiced Chickpeas and Greens Frittata?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI loved this as a sautee but not as much as a frittata. I would serve it with an herby greek yogurt instead. Probably would make the greens & beans again but this one won't make it into my regular frittata recipe.AnonymousSeattle, WA9/17/2021Great recipe! I have a couple of issues, though. What is a “medium” skillet? I started with a 10”, then realized everything wasn’t going to fit, so transferred to a 12” and now we have two skillets to clean. Why not be specific? Also, what’s a “small” bunch of greens? I used a large bunch of chard and it was great. Only thing I might change would be to make garlic yogurt as a dressing, rather than garlic sour cream. Already looking forward to tomorrow’s leftovers!KMcWSeattle, WA9/15/2021Hi there. I love your recipe. I love frittata! Usually I do a quick and simple recipe like here: www.basilbunch.com/spring-onion-frittata-recipe/BasilBunchHamburg, Germany7/22/2020Yummy! This was sooo good.  As soon as I saw the photos and read the reviews, I knew I had to make this asap!  I used one cup of chopped herbs (Italian parsley & cilanto) and it seemed like enough.  Cooked up beautifully.  My best frittata I think ever. The garlic mayo is awesome and I'll be making that going forward for other things. AnonymousPalm Harbor, FL5/14/2020'hakuna frittata!' the best frittata i have made at home, by far. i used kale and parsley, which went very well with the curried chickpeas. depending on the size of pan you use / the size of your oven, the cooking time _may_ vary; but, i'd use a cake tester / toothpick to test the doneness. and best of all, it's very filling and oh so pretty :-) brooklynboyeatsBrooklyn, New York4/14/2020Eh.  Just eh.  This recipe needs a lot of love. If I had to make this again, I’d sub cream cheese for sour cream, add sage and roasted cherry tomatoes. And instead of mayo, I’d spread some crime fraiche with chives on top.  But I’m grateful for you sharing this with me.  I’m just hyper-critical. Philly4/4/2020This recipe is so great, everyone loved it. They garlic mayo is soooo goodAnonymousPortland, Maine3/27/2020Great recipe - unfortunately I overcooked it, but it still tasted good. The garlic mayo is not to be skipped!AnonymousNew York1/28/2020Quick, easy and delicious. I note one review that said it took too long and was fuzzy!! Took me half an hour with ten minutes of cooking time. Great recipe. Thank youjfcaswellCalifornia 1/5/2020This was honestly incredible. I never knew until now that when in doubt, I should frittata - and now I’ve seen the error of my ways. It came together perfectly, lasted several days/lunches, and perfectly filled everyone it was given to (although I didn’t gift much because it was far too good). The method hugely improved the outcome and my frittata skills, and this could easily be adapted for whatever bits are lurking in your fridge and cupboard. Smashing stuff. tallulahvivgraceHampstead, London, UK9/10/2019This was THE BEST use of a dozen eggs. Will absolutely be making again.AnonymousWashington, D.C. 9/8/2019This recipe is PHENOMENAL. We couldn't get enough of it. I added cilantro, basil, and parsley - it seems like a lot of herbs but they soften as they bake - and the flavour was off the charts. The garlic mayo is a must. I'm adding this to my routine on the regular. AnonymousToronto, Canada5/23/2019DELICIOUS!!! I didn't find this frittata difficult to make or take up too many pans at all. Healthy and SO yummy! The flavors are incredible. We omitted the mayo and used Sriracha instead. We'll be eating it all week for breakfast.  AnonymousPismo Beach, CA4/14/2019Hearty variation on a typical frittata -- I kind of wondered about the lack of cheese, but didn't notice its absence at all.  Will definitely make it again.yoshi99Washington, DC1/20/2019This recipe has me rethinking frittatas. Usually I make them and they are over-cooked on the sides and still raw in the middle. But the steps in this recipe are really helpful; having the soft-scramble texture on the stove made it cook more evenly in the oven. The curried chickpeas were really delicious with the egg. Also held up as deliciously leftover the next day.jayneoreWashington, D.C.1/12/2019Explore Bon AppétitFrittataEggMustard GreensLeafy GreensVegetableKaleSwiss ChardChickpeaBeanEasyOne-Pot MealsWeeknight MealsMainGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Molly Baz"]}