{"id": "2f2bfba34e947867dcf45b30afaae602", "url": "https://www.bonappetit.com/recipe/roast-chicken-legs-with-lots-of-garlic", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Roast Chicken Legs with Lots of Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueRoast Chicken Legs with Lots of GarlicBy Andy BaraghaniSeptember 18, 20184.5(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintFor this roast chicken recipe, if you have the time, season the chicken with salt the night before and chill uncovered so the skin will dry out a bit. Doing this helps the chicken take on a nice golden finish.Ingredients4 servings4chicken legs (thigh and drumstick; about 2½ lb. total)Kosher salt4heads of garlic, halved crosswise1lemon, thinly sliced into rounds, seeds removed1red chile (such as Fresno), quartered lengthwise, seeds removed if desired3bay leaves or 5 sprigs thymeFreshly ground black pepper½cup extra-virgin olive oilCountry-style bread, toasted (for serving)PreparationStep 1Preheat oven to 325°. Place chicken in an 13x9\" baking dish and season generously all over with salt. Add garlic, lemon, chile, bay leaves, and a few grinds of pepper. Pour in oil and toss everything to coat. Turn garlic heads cut side down so they are in contact with the baking dish (this will help them brown).Step 2Roast chicken, rotating pan once, until meat is almost falling off the bone, 75–90 minutes. Let chicken cool in pan 10 minutes, then serve with bread.How would you rate Roast Chicken Legs with Lots of Garlic?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleReally awful recipe. The temperature and timing made for flabby skin and gummy fat. Also the instructions are incredibly vague. Nicole Di NardoToronto, ON2/8/2021I used bone-in chicken thighs and this was fab. I added more oil than the recipe calls for, it went up about halfway to the top of the chicken, and created a bit of a confit result. After about 80 min, I added some butter to the skin and broiled for five minutes. Absolutely perfect. A fall/winter staple for sure. Do NOT forget good crusty bread and a simple green salad with a tangy vinaigrette... it brings it together! Chicago10/30/2020Delicious! I salted the chicken and air dried it in the fridge overnight so the skin would be crispy. I used 2 meyer lemons  and both bay leaves and thyme. Next time I would make mashed potatoes to go with all the beautiful roasted garlic. The skin was crispy and delicious.kdandieOntario, Canada3/22/2020AMAZING RECIPE!! I did put the oven slightly higher at 175 celsius for 80 mins, then set it on broil (190-200c) for 5 mins just to crisp up the skin a bit more. This works well for me and my oven. But the flavors here are awesome. Would make the whole thing just for the buttery garlic :) tyshKraków12/19/2019Followed the recipe exactly but my skin never crisped up and my garlic never browned also did'nt enjoy the flavor of the chicken all that much8/16/2019Can I make this in a slow cooker?  And how do I adapt the recipe? AnonymousTaiwan6/21/2019This chicken is amazing! Has become a regular dinner at my house because of how easy it is to make while also being delicious. AnonymousAtlanta, GA5/20/2019This is my go to chicken leg recipe. We cook it covered for 90 minutes and uncover it for an additional 20 minutes to crisp up- it's fabulous. Thanks Andy :) kenzitomasscahusetts3/2/2019Terrific, easy & few ingredients ... what is not to love? Perfect to increase or decrease the recipe depending on the number of diners.  Love this dish!AnonymousSouthern California 1/27/2019This recipe is really delicious and doesn't require a lot of prep.  This makes it a winner! I followed another commenter's advice and cooked uncovered on high heat for the last part of the recipe to get nice crispy skin on the chicken.  Served with a side of brussels sprouts.  Will definitely make this again.AnonymousBay Area, CA11/20/2018This recipe was super easy and delicious! Remember to let the chicken rest outside of the refrigerator (completely unthawed if frozen) until room temperature (about 30-60 minutes). Season well with salt (sea, kosher or pink Himalayan) and use plenty of garlic. I added rosemary alongside the thyme to the dish. I’ll make this again for my family!\nThanks Andy!!Richmond, Virginia 10/29/2018Delicious. Everyone favorite part was the roasted garlic. Definitely will make again with more garlic heads. ahteriSan Diego10/15/2018Amazing recipe.  So simple and delicious this will become a new favorite.  The garlic is amazingly mild and yummy as you spread it over grilled toastjacqueline.r.biesiadecki8864NJ10/15/2018THANKS, Andy, for this simple recipe!  It was a MAJOR hit and it is the best chicken dish I’ve ever made!  The whole lemon balanced out everything really well.  I used halal chicken, baked it covered for 90 mins, then uncovered for another 20 (dropped it down to 280 degrees).  This is now on my Sunday Gameday list!  mlv29Northen Virginia10/12/2018For such a simple prep, the result was just incredible.  My finicky family was quite impressed, with my son proclaiming it one of my top 3 chicken dishes ever.  Would not change a thing.lworkman0907Richmond, IN10/12/2018Explore Bon AppétitAmericanChicken LegChickenPoultryGarlicVegetableFresno ChileChileLemonCitrusFruitEasyMainDairy-FreeNut-FreeKetoRoastHanukkahPassoverRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}