{"id": "2f314169825d497efbc933ecac9c0470", "url": "https://www.bonappetit.com/story/what-is-shrimp-paste", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "What is Kapi, the Thai Shrimp Paste That Adds Loads of Umami to Any Dish It Touches? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShrimp Paste Is for Umami LoversThe deep, savory richness of kapi can’t be replicated.By Shayne ChammavanijakulMarch 8, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat BoytsovaFacebookTwitterEmailIf you’re someone who can’t seem to get enough umami in your cooking—as in, you’re constantly reaching for Asian pantry staples like miso, gochujang, and fish sauce—you might already be well-acquainted with shrimp paste, an indispensable ingredient in the cuisines of Southeast Asia and southern China. Shrimp paste goes by many names—like bagoong in the Philippines, terasi in Indonesia, and belacan in Malaysia and Singapore—and each is prepared differently, offering a diverse range of flavor profiles and varying salinity, texture, color, and pungency.What is kapi?In Thailand, shrimp paste goes by the name kapi (or gkapi). It’s a purple-brown condiment made by mixing krill (tiny shrimp-like crustaceans) with salt and leaving them to ferment. The resulting mixture is then dried and ground into a dense and sticky paste that’s the consistency of almond butter or coarse pâté. It’s salty, pungent, funky, and chock-full of umami with a deep, savory richness that can’t quite be replicated.A little kapi goes a long way. While it’s not something you’d dollop by the tablespoon into all of your dishes, you’ll notice the difference when you incorporate it into curry pastes, sambals, sauces, dips, and relishes. Without that little bit of kapi, they’re just not the same.How do I cook with kapi?Shrimp paste packs a salty and funky punch, so go easy with it and start off with just a little before tweaking to your taste. Sauté a spoonful in a hot wok with some oil until aromatic and you’ve got a great foundation for fried rice or noodles.Mix it into the marinade for grilled or roast chicken.If you’re feeling particularly ambitious, try making your own fresh Thai curry paste or sambal and add a spoonful of kapi to the party.Use it in lieu of anchovies as a base for Caesar salad dressing or tonnato sauce. Consider roasting your potatoes with shrimp paste, or mixing some into meatballs or meatloaf for a deeper, more robust flavor.Swirl it into your barbecue sauce, Bolognese sauce, pot roast, or even boeuf Bourguignon.I’ve recently discovered the joy of combining a bit of shrimp paste with olive oil, butter, and garlic (reminiscent of bagna cauda) and using it to coat spring vegetables before roasting.Where can I buy kapi?You can find kapi in the condiments aisle of your local Asian grocery store or through online grocers. Shrimp paste’s cross-continental reach makes it so that you might run into a variety of jars, tubs, and blocks of the stuff under a medley of different names. I recommend trying out a few types before deciding on your favorite. Next time you’re looking for that umami hit in your cooking (and have tired of—or run out of—the miso and fish sauce), reach for kapi. It’s time for shrimp paste, as mighty as it is versatile, to have its moment.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-08", "author": ["Condé Nast", "Shayne Chammavanijakul"]}