{"id": "2f342eb1903fa51bb04b567af79b3246", "url": "https://www.bonappetit.com/story/weeknight-beef-ginger-stir-fry", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "A New Weeknight Dinner In the Rotation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA New Weeknight Dinner In the RotationA beef and ginger stir fry with a secret ingredient.By Adam RapoportNovember 19, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“Velvety.”That’s the word that my friend Gabe used to describe Andy Baraghani’s Beef and Ginger Stir Fry and, with that, I knew what I was making for dinner Sunday night.Not that I needed Gabe to remind me of the allure of this quick-and-easy dish; I’ve been staring at a photo of it for more than two months now—all glossy and saucy and burnished looking. I mean, come on—how can you not want to make it!The stir fry is inspired by the Filipino dish bistek, a version of which Chris Morocco developed with chef Angela Dimayuga for our December 2017 issue of Bon Appétit.Want this letter before it hits the website? Sign up for our newsletter!Alex LauAndy’s version requires just a handful more ingredients, but most of them are pantry staples: ginger, soy sauce, sesame oil, and...butter.It’s that last ingredient that makes the dish “sexy,\" according to Andy, or velvety, according to Gabe. I just know that it’s delicious.It couldn’t have been easier to make, and my version looks almost as gorgeous as Marcus Nilsson’s photo, especially with a side of sautéed bok choy and jasmine rice. The only thing I’ll change next time (and there will definitely be a next time) is that I’ll stir fry the beef and onions in two batches, so as to not crowd the pan and to let the onions take on more color. Either way though, I’ve officially got a new weeknight dinner in my arsenal.Get the recipe:Beef and Ginger Stir-FryMake this glossy, buttery beef stir fry when you need dinner on the table in less time than it takes to listen to a podcast.View RecipeExplore Bon AppétitAdam NewsletterBeefStir-FryOnionRead MoreShrimp and Basil Stir-FryChicken and Green Bean Stir-FryOne-Skillet Hot Sausage and Cabbage Stir-Fry with ChivesStir-Fried Eggplant with Basil and ChilesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Adam Rapoport"]}