{"id": "2f3a95bbb823dbdc5831c9da40008b5e", "url": "https://www.bonappetit.com/story/food-pros-hbcu-alumni", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "8 Black Food Pros on How Their HBCU Prepped Them for Greatness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture8 Black Food Pros on How Their HBCU Prepped Them for GreatnessCollege pride runs deep for these chefs, food entrepreneurs, and cookbook writers.By Adrian MillerMarch 12, 2021FacebookTwitterEmailIllustration by Richard A. ChanceFacebookTwitterEmailOn January 20, 2021, hundreds of masked-up Howard University students and alumni milled excitedly across campus grounds to celebrate the inauguration of Vice President Kamala Harris (class of 1986). As both the first graduate of Historically Black Colleges and Universities (HBCUs) and the first woman ever to hold the office, the event represented a glass ceiling finally shattering. Later that same day, Harris swore in Morehouse College graduate Reverend Raphael Warnock (class of 1991)—the first Black Democrat to ever represent a Southern state in the U.S. Senate.These victories, along with some headline-worthy philanthropic donations, amplify how essential HBCUs have become in shaping African American leadership in this country—from fine art and politics to the food and beverage world. Though few schools offer culinary programs, alums have still made a meaningful impact. Here, eight Black culinary professionals share how HBCUs have inspired, and shaped, their careers.Photo by Celeste NocheBryant TerryAuthor and Chef-in-Residence, Museum of the African Diaspora, CaliforniaXavier University“Going to Xavier University, a private HBCU in New Orleans, gave me the confidence to believe I could be a successful, independent, creative person. Because the school is so small, I had the opportunity to intimately interact with a lot of prominent scholars, authors, fine artists, entrepreneurs, and other Black professionals who visited from around the globe. Early on, I had faith that I could do work I loved and be autonomous. In my final years as an undergrad, and later as a graduate student at New York University, I held a vision of being my own boss, and I haven’t worked a 9-to-5 since my mid-20s.”Buy It: Vegetable Kingdom: The Abundant World of Vegan Recipes.Nicole TaylorFood Writer, Cookbook Author, New YorkClark Atlanta University“I’m from Athens, Georgia, and going to an HBCU opened up a whole different world. The first thing I learned early on is that there’s more than one way to be Black. We’re not a monolith. I was around so many brilliant Black minds. Being in the Atlanta University Center Consortium (the world’s largest and oldest association of Black higher education institutions) also instilled in me that, no matter what the world tells me about my abilities, I come from greatness. I felt that every day on campus.”Buy It: The Up South Cookbook: Chasing Dixie in a Brooklyn Kitchen.Lezli Levene HarvellFounder, The Iconoclast Dinner Experience, New JerseySpelman College“There is an expectation that Spelman women do not wait to be asked for a seat at the table. We are taught to bring our chairs or, more importantly, make our own tables. The Iconoclast Dinner Experience (IDE) is my table.“IDE is a series of thoughtfully curated events that I host annually in Chicago, Martha’s Vineyard, and New York City. Each one has its own unique paradigm-shifting theme: Impolite Conversation focuses on amplifying cultural topics through a nontraditional lens; The King Is Dead celebrates young women of color (under 35 years old) who are U.S. based chefs; and The Iconoclast Dinner shines a spotlight on culinary and beverage trailblazers of color globally. At Spelman, I learned to unapologetically take up space, and IDE is a testament to that experience.”Photo by Sean O'neill PhotographyRichard IngrahamPrivate Chef for Dwyane Wade, Gabrielle Union-Wade, and family, FloridaFlorida A&M University“I was a tuba player in high school. I took it to another level in college, when I joined Florida A&M University’s prestigious band, the Marching 100. Every single day, I wanted to quit. But hard work got me there, so I just knew that if I persisted, I would be successful. Whenever I’m overwhelmed with something, I always go back to those feelings I had when I marched in the band, and how anything I’m dealing with now absolutely cannot compare to what I dealt with back then. That’s what pushes me forward, to persevere through each and every situation in my life.”Photo by John Black PhotographyDerek KirkFounder, soulPhoodie.com, FloridaNorth Carolina Central University“One of the traditional benefits of the HBCU experience is engaging with fellow students from diverse backgrounds. Besides various musical tastes, vocabulary, and clothing styles I was exposed to, I gravitated toward experiencing my cohort’s diverse culinary traditions. Growing up in East Tennessee, I was very familiar with American, Southern, and traditional soul food styles. However, my HBCU community introduced me to a flavorful new world. A few of my dormmates exposed me to the slow-smoked wonder of North Carolina BBQ paired with peppery vinegar sauce and hushpuppies, and the light, crispy goodness of Calabash-style fried seafood. I vividly remember the taste of spicy jerk chicken and my first Jamaican patty, washed down with a cold Red Stripe in a Jamaican friend’s backyard. These experiences were not just limited to classmates. A trip to a local Indian restaurant with a professor, for my first taste of chicken tikka masala, opened up a whole new frontier. These experiences, and many others, were the foundation of both my food passion and curiosity.”Photo by Tim Sanchez PhotographyTheodora Lee, a.k.a Theo-patra, Queen of the VineyardsCEO, Theopolis Vineyards, CaliforniaSpelman College“Spelman created a supportive village that has allowed me to thrive. Spelman also taught me perseverance and how to keep fighting, no matter how difficult the challenge. In starting Theopolis Vineyards in 2003, I understand that I am one of the trailblazers in being an African American female vintner, and only hope that I can serve as an inspiration for others to follow their dreams.”Courtesy Lila OwensLila OwensOwner, Cupcakin’ Bake Shop, CaliforniaHoward University“I developed my independence, grind, grit, and business acumen at Howard. The curriculum and network of support are designed to equip Black students with the knowledge, professional skills, and tenacity to start, run, and grow a business, even during a national economic crisis. I’ve learned how to effectively manage risks, lead a diverse team, and serve as a strategic asset, to foster the exponential growth of my business. I was embraced by professors, peers, and an administration committed to prepare students like me to show up as true forces in life beyond college. Howard prepared me to succeed against all odds.”Photo Courtesy Best Kept Secrets IntlJeffery S. Smith Jr.The Best Kept Secrets International, CaliforniaJackson State University“I’m an influencer, host, food blogger, and catering/culinary professional. My food blog and company Best Kept Secrets International focuses on my food experiences around the globe, as well as in my own kitchen. I learned my great alma mater’s motto, ‘Challenging minds, changing lives,’ the first day I stepped on campus—and it has stuck with me ever since. While I did not attend Jackson State University as a culinary professional, the lessons I learned while attending pushed me to always strive for greatness and to not be afraid of starting over.”Adrian Miller is a James Beard Award–winning author who lives in Denver, Colorado.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-12", "author": ["Condé Nast", "Adrian Miller"]}