{"id": "2f53c4893c295864d268e3515ad2b77e", "url": "https://www.bonappetit.com/recipe/carbonara-lasagna", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Carbonara Lasagna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCarbonara LasagnaBy Anna HezelOctober 3, 20194.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Lasagna: A Baked Pasta Cookbook, our October 2019 Cookbook Club pick. Part of the fun of spaghetti carbonara is that it combines all the best parts of breakfast (like eggs, ham, and cheese) with the best parts of dinner (like pasta, and having time to actually eat a sitdown meal). This lasagna version of carbonara includes mild Fontina, pancetta-studded ricotta, and eggs baked right in, toad-in-the-hole style. It’s as equally delicious served with a chilled bottle of Lambrusco on a Friday night, or for breakfast the next morning with cold brew.Reprinted with permission from Lasagna: A Baked Pasta Cookbook by Anna Hezel and the Editors of TASTE, copyright © 2019. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House.Ingredients6–8 servingsLasagna1Tbsp. unsalted butter, plus more for pan12oz. thick-sliced pancetta, cut into ¼\" pieces2medium shallots, halved, thinly sliced (about 1 cup)1lb. ricotta cheese4oz. Fontina cheese, shredded (about 1 cup)2oz. finely grated Parmesan cheese (about ½ cup)1Tbsp. thyme leaves1½cups heavy cream½tsp. coarse kosher salt¼tsp. freshly ground black pepper1lb. box dried lasagna noodles, cooked per box instructions and cooled, or 1 recipe (12 sheets) Fresh Pasta Sheets (recipe follows)4large eggsFresh Pasta Sheets (Optional)3large eggs, room temperature1Tbsp. extra-virgin olive oil2cups all-purpose flour, plus more for dusting1tsp. coarse kosher salt, plus morePreparationLasagnaStep 1Place a rack in lower third of oven; preheat to 375°. Lightly butter an 11x8\" (2-qt.) glass or ceramic baking dish. Melt 1 Tbsp. butter in a large skillet over medium-high heat. Add pancetta and cook, stirring occasionally, until most of the fat is rendered and pancetta is golden, 8–10 minutes. Reduce heat to medium, add shallots, and cook, stirring frequently, until softened, about 5 minutes. Using a slotted spoon, transfer shallots and pancetta to a large bowl. Let cool slightly, then stir in ricotta, Fontina, and Parmesan.Step 2Pour off fat and return skillet to medium-high heat. Add thyme, then pour in cream, scraping up browned bits stuck to bottom of pan. Bring to a simmer; season with salt and pepper. Remove from heat.Step 3If you're using fresh pasta, cut noodles to fit pan and arrange a layer of 2 sheets in the bottom, overlapping slightly. (The fresh pasta is bigger and wider than the grocery store dry kind, so 2 noodles constitutes a whole layer. If you’re using dry noodles, use enough noodles in each layer so they overlap slightly and cover bottom of pan.) Dollop with one-quarter of cheese mixture and top with another layer of noodles. Repeat three more times with the remaining filling and noodles, ending with a layer of noodles (you'll have several leftover). Pour cream mixture over. Shake pan gently to distribute and press with a spatula to compact slightly. Bake lasagna until golden, about 40 minutes.Step 4Crack eggs into individual bowls. Press a 2\" round cookie cutter into lasagna, going about halfway down. Carefully remove top layers of lasagna to create a well. Repeat to create 3 more. Gently drop 1 egg in each well. Cover with foil and continue to bake until egg whites are just set, 5–7 minutes longer. Let sit 15 minutes before serving.Fresh Pasta Sheets (Optional)Step 5Pulse eggs, oil, 2 cups flour, and 1 tsp. salt in a food processor in 1-second intervals until dough is moistened and comes together in small beads that resemble couscous. Don’t let dough form a ball.Step 6Turn dough out onto a work surface and knead (without adding flour) until smooth and elastic, 2–3 minutes (it will be almost too stiff to knead). Wrap dough in plastic and let sit at room temperature at least 30 minutes or up to 1 hour (the dough will soften and be easy to work with after sitting).Step 7Arrange several clean kitchen towels on a work surface and dust lightly with flour. Cut dough into quarters and cover 3 pieces with a damp towel. Flatten 1 piece of dough and dust lightly with flour. Roll dough through a pasta machine, starting on the lowest (widest) setting. Fold rolled dough into thirds like a letter, then roll it through again, feeding the open, less wide end (the side where you can see the fold) through the machine first. Repeat 3 times, then start to roll dough using thinner settings, folding it and putting it through the same setting 2 times before progressing to the next thinner setting, and flouring dough as needed to keep from sticking. Work your way through to the second to last setting (#6 on most machines, or the thickness of two playing cards). The completely rolled sheet should measure 4–5\" wide and 22–24\" long.Step 8Cut into three 8\" sheets and place on floured kitchen towels. Repeat with remaining 3 pieces of dough. Turn sheets on kitchen towels occasionally so they dry slightly. They should be pliable but a bit leathery.Step 9Bring a large pot of salted water to a boil. Working in 2 batches, cook pasta just until tender and color changes from deep yellow to pale yellow, about 1 minute. Drain and rinse briefly with cold water. Arrange lasagna sheets on clean kitchen towels, pressing them slightly to flatten. Use immediately or keep covered at room temperature up to 1 hour.How would you rate Carbonara Lasagna?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSuch a crowd pleaser for my family. A keeper. TiredandhungryColorado Springs, co1/3/2022This recipe needs some work.  Half of the given amount of noodles is probably closer to correct.  I used no-cook noodles but par-boiled them in advance and increased the cream by a third.  That worked out OK.  I just made dimples with a spoon and strained the eggs before as others have mentioned.  I did not cover them with foil.  Seven minutes was not enough and ten was a tad too much.  Eight or nine with a ten minute rest out of the oven should work.Chuck HillVancouver, BC1/8/2021JEEZ haters gonna hate.  This recipe is AMAZING! \n\nI use store bought noodles. I use bacon because pancetta is not generally available, but I love the smokey flavor so it works out. I also sub mozz for fontina because that stank. Matt is wrong, the eggs are the best part!  The yolk adds such a creaminess this meal needs.  I put 6 eggs, drain off most of the whites though because it is hard to get the eggs right.  No need to use the cookie cutter, I put them right on top.  Also I only do 3 layers of filling because mine turns out too think to put into 4ths with actual layers.  I pre made it this time for my birthday party in 1 hour, let's hope it turns out just as fabulous :) BAsBestReviewerNorth Carolina7/15/2020This is my second time making this recipe. If you'd like to save noodles, you only need to cook 13 sheets of pasta to make this in the correct pan. Not sure why the recipe tells you to cook an entire box and then tells you that you'll have several leftover noodles. The flavor of this is amazing but it is not very pretty. Maybe not something you should serve to a crowd. Re: the eggs, they don't add much flavor and are very difficult to cook correctly (so much depends on your specific oven's temp., etc.), so I often omit them. Matt CaudellAthens, GA4/13/2020This took a while to make and turned our nothing like the photo. The taste and flavor was for sure there, but I agree with the below that the eggs did not cook all the way even after trying to leave it in a few minutes longer based on that review. It was not as saucy and cheesy on the top as it looks on the end photo. AnonymousFlorida 3/16/2020this was tasty.  BUT  even tho my eggs were room temp when I put them on the lasagna, they took WAY longer than 5-7 minutes to set; more like 15 min.  And the yolks were overdone in most of them by then... I had put them in a strainer a la poached eggs to reduce the amount of whites too.... AnonymousNew Jersey12/5/2019Explore Bon AppétitPastaCasseroleItalianEuropeanLasagnaPasta & NoodlesPancettaCured MeatMeatRicottaCheeseEggMainNut-FreeBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-02", "author": ["Condé Nast", "Anna Hezel"]}