{"id": "2f7483747794a7d64fdd1828bb210581", "url": "https://www.bonappetit.com/story/cooking-rut", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "How to Get Out of a Cooking Rut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingI Fell Into a Deep Cooking Rut—Here’s How I Got OutMy cooking became mind-numbingly boring, so I turned to the experts for help. By Kelsey McKinneyApril 29, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Elizabeth Jaime FacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.I remember the feeling I used to have, after a weekend of eating out, when I would look at my pantry with longing. I’d satisfied my craving for the flavors of restaurant food, and, by Monday, all I wanted was to eat something that tasted like I made it. I would swing by the grocery store and grab ingredients, thrilled at the thought of cooking recipes I loved—chicken lettuce wraps, lemony pasta, roast chicken—but that I’d slowly adjusted over time to fit my tastes. The joy was in the comfort, the ease, the ability to follow my tongue and find exactly what I wanted.The first few weeks of self-isolation, I made those meals I knew and loved for stability and sustenance. I made macaroni and cheese. I made sourdough bread sliced thickly and dunked into tomato basil soup. I made the stuff I thought would fill the gap growing inside of me that used to be filled with restaurants and seeing my friends and living in a world larger than three square blocks. My weekly menu of convenience and consistency might have brought me joy if it had been broken up by eating out, but when strung together back-to-back forever, it left me bored and distressed.There’s a lot I miss about restaurants—being in a room full of people, the good lighting, the server at the place where I’m a regular pouring wine without asking because they want me to try it—but what I miss most is being surprised. I miss the joy of taking a bite and looking at the person I’m with, both of our eyes wide as if to say, “Can you believe it tastes like this?”I’d never really learned how to be creative in the kitchen because I’d never needed to be. And, now, I didn’t know where to start. But if I was going to survive an unknown number of weeks without restaurants, I was going to have to figure it out.I first turned to Deb Perelman, cookbook author and creator of the blog Smitten Kitchen, who told me that often, people who cook a lot have a staple flavor palate they reach for without thinking. It’s what your personal tongue likes best. “I remember having this conversation with my mom when I was a kid,” she says, “where I was upset because no one’s peanut butter and jelly tasted as good as hers to me, and she told me ‘I’m the one who sets your peanut butter and jelly for you.’”The first step of making your food taste different and new to you is figuring out what your base palate is. Perelman tells me to think of something simple like avocado toast. For her, she says she would season it with lemon, olive oil, pepper, and salt. When I thought about my own palate, I also would use lemon and salt, but would sub in an aioli, some cumin, and red pepper flakes. Those are the flavors of my palate. I realized that every recipe I adapted, every recipe I made, I was dressing the same way. I was hitting them all with a burst of lemon, a little parm, red pepper flakes. What had made me crave my own food before made me sick of it now that I was cooking three meals a day.But knowing that I had a signature was just an acknowledgement of the problem. To move beyond acceptance and onto action, I talked to Perelmen and chefs at some great restaurants across the country and found four cooking strategies to challenge my palate. .1. Follow a recipe to a TPerelman recommended following a recipe exactly—and preferably one that intimidates you. “Usually we cook on autopilot and do the things we know how to do, but if you follow a recipe absolutely exactly, you won’t make those natural subs that fit your palate,” Perelman says. “I think you’re going to have to follow an Ottolenghi recipe, or one from whatever restaurant you miss the cooking from. There’s going to be a recipe with three cups of herbs. Suspend your disbelief and try it.” Trying something from a cuisine you don’t usually make yourself or from a chef you don’t know well can help broaden the range of flavors you’re using.2. Mix up your methodsUsing a recipe exactly, though, only works if you have all of the ingredients, which may not happen depending on when you last made a grocery trip. That doesn’t mean that all hope for an exciting dinner is lost. Once you know what your natural tendencies are, thinking about how to sub those out becomes simpler. If your fat of choice is olive oil, try butter or coconut oil or ghee. If your typical acid is lemon, try lime or grapefruit or vinegar. “We don’t have to be purists in this day and age,” says Jocelyn Law-Yone, chef and co-owner of Thamee and Toi Moi in Washington, D.C. “If you can’t find something or don’t have it, who cares. Put whatever you have in! ”“I totally get why you’re bored with your own stuff,” Dan Jacobs, the chef and owner of DanDan in Milwaukee, WI, says. “I’ve been cooking professionally for 22 years. I don’t think I’ve ever cooked at home as much as I have in the last four weeks, ever.”“Even if you’re just going to make a roast chicken,” Jacobs says, “try using ginger and soy, just try something else even if you aren’t sure it will work.” Most people have something in their pantry that they haven’t used often. Maybe horseradish is hiding in your refrigerator, or a jar of olives in your bar cart. (I found both in my small apartment.)Kim Alter, chef and owner of Nightbird in San Francisco, suggests mixing up how you prepare ingredients as well. If you always sauté onions, for example, confit or pickle them. “It’s kind of hard right now because you have to deal with what you have in your pantry,” Alter says, “but can you change up the way you handle them?”3. Find some friendly competitionLaw-Yone says that she has become a kind of dinner hotline for the former staff members of Thamee. They text in a group about what they’re making or what they need help with. What can I do with this ingredient? How can I cook this in a new way?We don’t all have a Jocelyn to help us, but one thing she says she’s seen in the group text is a form of friendly competition. Even the staff members who didn’t cook or mainly baked have begun trying to plate their dishes and make more complicated things to show off in the group. “Being envious of what your friend made,” she says, “is a great way to inspire you and make you ask, ‘hey, how did you make that sauce?”4. Play a mini Chopped with yourselfThe real time to mix up your kitchen life, though, is when you make your rare grocery store visit.“Most people when they go shopping grab all the same things,” Alter says. “If I were at Whole Foods, I’d grab some kind of fermented chili or chili oil.” So push yourself to grab something you’ve never bought before and then put it right next to your cutting board so you have to use it.Researching recipes with that ingredient will lead you to new places. And while it always feels risky to buy something you’re not sure you’ll use—and, with fewer and fewer opportunities to buy groceries, now more than ever—it can also be a great way to pressure yourself out of a rut. Buy a spice that you don’t use regularly, and buy it without a plan. Be brave, Law-Yone says, and grab a whole fish. Grab a mango or a pomegranate or a big daikon radish.Since I figured out my go-to flavors, I’ve been trying my best to avoid them. I dug a jar of coconut oil out of the back of my pantry and used it in several dishes this week. I found caraway seeds and cardamom pods I bought for a specific recipe and never used again and tossed them in dishes. I gave myself license to play and to fail. I cooked an Ottolenghi salad without cheating at all—it used 2 whole cups of mint and tasted incredible. I picked a friend who continues to churn out absolutely beautiful plates of food on Instagram to be my new rival, and when I told him, he agreed to be in a battle to spur creativity. I immediately started brainstorming my weekend cooking plans.A couple of days ago, I was tired and stressed and frustrated. I returned to the chicken larb recipe I had adjusted with all of my favorite flavors, and I tried to tweak them just enough. I used coconut oil and gojuchang. I used pickled spring onions instead of red onions. I added eggplant. When it was done, I took one bite and was stunned. To my astonishment—and relief—it didn’t taste like anything I’d ever cooked before. I opened my eyes wide and said, to myself, “Can you believe it tastes like this?”Explore Bon AppétitHealthyish Guide to Being AloneHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-29", "author": ["Condé Nast", "Kelsey Mckinney"]}