{"id": "2f77d59d5b65dd11ee5d36ef6235a4ac", "url": "https://www.bonappetit.com/story/dried-limes", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Dried Limes Have a Musky, Sour Aroma That’s Not Like Anything Else | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere’s Nothing Quite Like the Musky, Sour Aroma of a Dried LimeSmoky, sultry, and without substitute.By Behzad JamshidiSeptember 28, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailPersians share an affinity for sourness that is uncanny and unmatched. Just as many dishes of India revel in the alluring heat of spice, the many cultures of the Persian Gulf call for the tart undertones of fresh citrus, sumac, pomegranate molasses, and, most unique of all, dried omani limes (also known as black limes).I remember returning from school to the sultry and smoky aroma of black limes perfuming our home, capturing the scent of sizzling herbs, such as pungent fenugreek and garlic chive. It was a musky, almost medicinal savor that found its way into stews, grilled dishes, salads, and rice. While my Iranian mother’s pantry contained an almost apothecary-like collection of spices, herbs, and fermented items, the dried omani lime was then, and still is, the most mysterious and unique jewel in her cupboard.Photo by Danny KimDried limes are said to have originated in Oman, hence their name limoo omani, from the polysemic Farsi word limoo for “limes” and “lemons.” In Iraq and other regions, they’re known as noomi basra, which references Basra, Iraq, as the origin of the citrus. Dried limes are the size of shelled walnuts with rough, leathery exteriors and a complex musky, sour, and bitter aroma. They’re grated on a Microplane into certain dishes, ground into spice blends, or carefully pierced in a few spots with a paring knife, then added to soups and stews, where they slowly infuse the broth with their flavor and acidity. Throughout the Persian Gulf, dried lime is used in chai noomi (black-lime tea), an ailment to indigestion and other gastrointestinal issues. It’s also a popular addition to the Arabian spice blend baharat (when dried omani lime is added, this blend is often locally referred to as kabsa or kebsa).In the search for more lime-related enlightenment, I reached out to Atef Boulaabi, the owner of SOS Chefs, which is an alchemist’s refuge hidden in New York’s East Village. Marked with nothing more than the letters S-O-S inscribed on the pavement out front, two unassuming doors open into a culinary haven that transports you to the precious markets of Tunisia and the Middle East. Even with the myriad of almost tangible aromas piercing through the air—rose, saffron, tonka, ras-el-hanout, anise, copper, jasmine—the collection of dried black limes are distinguishable and undisturbed.“Where I come from in Tunis, […] we cure [dried lime] only with salt. To dry them, some people [lay] them in the sun, and some people [dry them] in the oven to accomplish that smokiness and color,” Boulaabi tells me. The different hues of omani limes, from brown to black, is often related to the extent in which they are dried and oxidized; the darker the lime, the smokier and more bitter it will be. Lighter limes, on the other hand, have a softer acidity and are more fragrant.“The black lime is unlike any other lime,” Boulaabi explains. It comes from the Persian lime, which is closer in size to a key lime or a kumquat than to a conventional lime. Conventional limes, when dried whole, become so bitter as to be unpalatable (I’ve tried); Persian limes, on the other hand, are naturally sweeter and more acidic, yielding a dried product with a “flavor [that] is very, very deep, and the skin even more so,” Boulaabi exclaims. In cooking, “acidity is no different than salt and pepper—it makes our food feel alive!”I asked Atef where she uses the dried limes, as I’m often met with a new perspective or revelation every time she speaks. “I think it is amazing with chicken! I rub the meat with salt and [grated] black lime, and cook it over potatoes, tomatoes, and onions. It gets a very beautiful crust, and the smell is unbelievable! I also use it in rice with pine nuts and lots of butter! I also love it on tahini. Just grate a little bit of [black] lime over it and right away your tahini is completely different. It just depends on where you want to take your dish. [The dried lime] is not something you can replace with another ingredient.”Photo by Alex LauI couldn’t agree more with that notion. I’m often asked if black limes can be substituted with another ingredient. The answer is always “No, but if you must….” Preserved lemon and other preserved citrus, like oranges and clementines, are an adequate alternative, but since they lack the pungent and smokey nuances of the omani lime, they yield dishes with a completely different identity altogether. Instead, seek out any Middle Eastern grocery—I find that black limes are more widely available than most people assume. I personally shop for my black limes at SOS Chefs, but companies like Burlap & Barrel carry a ground version that is beautiful and can be ordered online.Many of the cuisines of the Middle East were, at one point, used almost exclusively for holistic purposes. We regard citrus, for example, as a detoxifier and promoter of healthy digestion. We also cook with preservation in mind. The brining and drying of Persian limes began as a preservation technique—it was not a modernist’s ploy to discover flavor, but rather a humble person’s approach to creating longevity from the spoils of their harvest. I think some of the greatest cuisine comes out of the resilience to preserve. It speaks to the human condition, that arguably some of the most delicious outcomes are often through resourcefulness and not abundance.I grew up with a mother who would re-create her best memories through the intoxicating aromas of black limes and simmering stews. Cooking is nostalgic for her, and by utilizing the ingredients of our distant home, my mother is able to release her emotions around her longing for Iran. It is that same nostalgia that certain ingredients foster that inspired me to love food so fiercely. I hope that by learning to use the dried Persian lime, you too can discover a piece of that same identity, and hopefully, a piece of that same love too.Chef Behzad Jamshidi is the Executive Director of Moosh NYC, where he works to create collaborative and community-focused ventures in food & hospitality. Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-28", "author": ["Condé Nast", "Behzad Jamshidi"]}