{"id": "2f7bca205f6b69f4cfb9e20d7539bb6d", "url": "https://www.bonappetit.com/story/new-restaurant-hiring-practices", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "When Restaurants Level the Playing Field, Everybody Wins | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen Restaurants Level the Playing Field, Everybody WinsWhat happens when refugee status, a criminal record, addiction, and homelessness aren‘t seen as barriers to employment?By Hilary CadiganAugust 16, 2018FacebookTwitterEmailPhotographs by (from left): Emma Fishman; Nick Hagen; Tropico Photo; Louis TinsleyFacebookTwitterEmailIt’s a Tuesday night in August and Emma’s Torch is buzzing. Middle Eastern pop music jangles softly through the speakers. Couples dressed for the heat sip glasses of rosé and swirl torn bits of warm Toufayan pita through creamy hummus made from black-eyed peas. The last of the day’s light glows tangerine behind a large sheet glass window etched with big block letters: “EMPOWERING REFUGEES THROUGH CULINARY EDUCATION.” That’s what this tiny Brooklyn eatery does, and what we, by dining here, are helping to do too.In the open kitchen, culinary director Alexander Harris leads a team of five chefs-in-training. There’s Caroline from the Democratic Republic of the Congo; Nadia from the Central African Republic; Kesnelfils, Nagela, and Redjie from Haiti. For most, it’s their first time cooking professionally, though many of Harris’ students bring years of cooking know-how, gathered in the home kitchens of their native countries, before they were forced to flee.“I love challenges, but coming to America was hard,” says Thu Pham, a recent graduate of the eight-week program. Back in Saigon, Pham worked with children in nonprofit organizations. When she arrived seeking asylum in New York City, she had to start her career all over again. “Language is really hard for me,” she says. “I have to translate everything in my mind, process it, and try to catch up with what people are talking about.”With limited resources, Pham struggled to find a job. She’d always loved cooking the food she grew up eating—her mom’s pickled mustard greens, steamy bowls of pho, crunchy-fresh green papaya salad like the kind an old woman used to serve from a small bamboo stand outside her house. Working in a kitchen seemed like a good chance at a fresh start. “But I needed training,” she says, “and culinary school is really expensive.”That’s when a counselor at a New York refugee organization told Pham about Emma’s Torch, a restaurant centered around training refugees in the culinary arts, then helping them find good jobs in commercial kitchens around the city. Pham applied and got accepted. She cites knife skills as one of her most important lessons; how to slice through the tender, gnarled skin of a ripe heirloom tomato without crushing it or chopping off her fingers; how to prepare lamb shank before rubbing it with shwarma spices and letting it cook low and slow. For family meals, she’d sometimes cook Vietnamese food for the whole staff: young jackfruit salad dusted with sesame seeds, tender grilled fish bright with turmeric. “I love the atmosphere because we’re like family,” she says of the program. “I get to work with and learn from other students from all over the world.”Thu Pham of Emma's Torch in Brooklyn\nPhoto by Emma FishmanImmediately after graduating, Pham snagged a job as a prep cook at Bricolage, an upscale Vietnamese restaurant in Brooklyn’s Park Slope neighborhood. Today, she runs a food blog called Pham Kitchen and is working with several friends on a plan to start a private catering company. “When people eat my food and feel happy, I’m happy,” she says. “Cooking is a meditation. It helps me relax.”Kerry Brodie, founder and executive director of Emma’s Torch, has had no problem securing jobs for her students post-graduation. “We’ve been welcomed by the industry with open arms,” she says. Of the 16 people who have gone through the training program to date, all who have sought culinary careers after graduating have been placed.“That’s not just a benefit for our students,” Brodie continues. “That’s a benefit for all of us. Think about it: Every major food trend, every culinary moment of creativity has been inspired by that which makes us different. When we open up the playing fields and bring in more voices, everyone wins.”Brodie credits diners, too, with a new understanding of how their dollars can affect change. Emma’s Torch has been embraced by the tight-knit Brooklyn neighborhood in which it sits; curious passersby have become regulars have become advocates and volunteers. “We’re seeing consumers care a lot more about what is going on in the kitchens,” she says. “The types of values that a restaurant supports are in some ways more important than what’s on their menu.”Emma’s Torch is not alone in its push to dissolve typical barriers to employment. And refugees are not the only group of people for whom the food industry can provide a second chance. Restaurants like DV8 Kitchen in Lexington, Kentucky, and Detroit Street Filling Station in Ann Arbor, Michigan, make a point to regularly hire people recovering from addiction or those who have been incarcerated.“We view our business as a community resource,” says Phillis Engelbert, co-owner of both the recently opened Detroit Street Filling Station and its older sister restaurant, The Lunch Room. “We help people find camaraderie, heal, and reach their full potential. Everyone needs a second chance.”Carlito Hurtado of Detroit Street Filling Station in Ann Arbor, Michigan\nPhoto by Nick HagenCarlito Hurtado, now a senior kitchen manager at Detroit Street, is one of the restaurant’s greatest success stories. After serving time for a DUI at a young age, he found it nearly impossible to get the kind of job he wanted in the restaurant industry, despite his passion and training as a chef. “People will always ask for a background check,” he says. “And then they don’t call back.” He took what he could get for a while, working behind the counter at low-end buffets and pizzerias. But then he met Engelbert, who saw his potential and encouraged him to apply for a job at The Lunch Room. He did, and got it.“At first I was skeptical because everybody was too nice!” Hurtado recalls with a laugh. “I had to adapt. But everybody was more than willing to teach me.” Quickly, he mastered the locally-sourced vegan dishes the restaurant had become known for: bibimbap with spicy tofu, burrito bowls with Cuban black beans, bahn mi on crusty rice flour baguettes. Engelbert hand-selected him to help open their fancier sit-down concept, Detroit Street Filling Station, in August of last year. Today, he’s the restaurant’s kitchen manager and helps lead a team of chefs, many of whom are also recovering from addiction or formerly incarcerated. “I’m seeing more and more restaurants hiring people who have criminal records or are newly sober, trying to get these individuals back to society,” Hurtado says. “Five years ago, I didn't see anything like that.”Both Engelbert and Rob Perez, founder of DV8 Kitchen, have nothing but positive things to say about their experience hiring “second-chance employees,” as Perez refers to his staff. “Most people in recovery are denied employment if they share recovery or incarceration to explain employment gaps during the interviewing process,” he says, “but we are proud to hire staff in early stages of recovery. While it does take more time and slightly more training expense, the benefits are immeasurable. Using your business to provide a livelihood and meaningful relationships for one person can make a huge social impact.”David Tobin of DV8 Kitchen in Lexington, Kentucky\nPhoto by Louis TinsleyDavid Tobin is a recovering opioid addict who spent years in and out of jail before going to rehab. “I was snorting pain pills during the day and Xanax at night to come down,” he recalls. “I would do whatever it took to get my dope.” Sober now for more than seven years, Tobin got a job at DV8 Kitchen soon after it opened. Working there not only helps him—it allows him to help others. “When I’m out there on the floor, I get to mingle with everybody,” he says. “They’ll ask about your story, and the next thing you know they’re telling you about a son who is going through the same thing. Working at DV8 Kitchen allows me to offer hope and show that change is possible to someone fresh into recovery.”Restaurants can also be a stop-gap against the very real problem of recidivism.  A recent study from the Bureau of Justice Statistics found that three-quarters of released prisoners are arrested again within just five years of their release. Much of this is due to the difficulty of finding legitimate employment once one has justice system involvement on his or her record.Geoffrey Golia, Director of GOSOWorks, the employment arm of post-prison reentry nonprofit Getting Out and Staying Out, says the restaurant industry is one of the largest sectors for placing formerly incarcerated young people in paid internships. “We find that in restaurants with strong team cultures, there is an openness to giving people this critical second chance,” he explains. “They are supportive of young people who want to work hard, learn skills, and contribute to what really can be a satisfying, collaborative effort every single day.”Restaurant owners can benefit from more open hiring practices as well. A nationwide dining-out boom (according to the United States Bureau of Labor Statistics, 15,145 new American restaurants opened between 2016 and 2017), coupled with widespread labor shortages, is making it very difficult for restaurants to properly staff their kitchens, particularly when it comes to low-skill but essential back-of-house jobs like dishwashing. And ICE raids and crackdowns at the border are targeting the often undocumented workers who have been quietly keeping commercial kitchens across the country running for decades.Being intentional about leveling the playing field is a win for restaurants, diners, and workers alike. “We have clients who, through GOSO training programs and restaurant partnerships, have gained confidence, discovered their own business acumen and culinary talents, and moved into management positions that allow them to stabilize their lives,” says Golia.Rose Colbert of Honeysuckle Gelato in Atlanta\nPhoto by Tropico PhotoProof of this potential comes in many forms. Just ask Rose Colbert, who, after a divorce several years ago, found herself unable to pay rent for herself and her two sons. “I went from two incomes to one really quickly,” she recalls, describing one of the lowest points in her life. She ended up having to move her family into City of Refuge, a homeless shelter. “I was really frightened,” she says. “I saw it as a failure.”But then she enrolled in a culinary training program offered by the shelter, where she learned the kinds of skills that elevated her from minimum wage worker to trained cook. Upon graduating, she nabbed a job at Honeysuckle Gelato, a small-scale ice cream manufacturer in Atlanta that makes a point of hiring people dealing with poverty and homelessness.Within two or three months, Colbert was out of the shelter and living with her sons in an apartment. Three years later, she’s still happily employed, making ice cream, learning about food production, and providing creative input on decisions about products and flavors. Eventually, she plans to open her own catering business—something she says would never have seemed possible without the opportunities provided by both the training program and Honeysuckle.“It has changed my life,” she says. “Sometimes you go through struggles to get to the good stuff. I got to the good stuff.”Explore Bon AppétitHot 10 2018The Hot 10Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Hilary Cadigan"]}