{"id": "2f818136e5943d991e10b7301b6e210e", "url": "https://www.bonappetit.com/story/hestan-nanobond-skillet", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "I Reach for This Hestan Pan More Than Anything Else in My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Reach for This Pan More Than Anything Else in My KitchenAnd it still looks great after all that use.By Chris MoroccoJanuary 26, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I break out in hives whenever I hear the word disrupt applied to cooking. I don’t want to hack my dinner, and I don’t want to disrupt my cookware. I just want to cook tasty food like everyone else, using cookware that works. But if someone comes along with a product that is genuinely better, well, I’m all ears.I hadn’t heard of Hestan when their marketing team dropped by the BA Test Kitchen a couple years ago, but I was intrigued when they presented the NanoBond skillet they had given to chef Corey Lee to use at Benu in San Francisco. The pan they showed me had gone through months of what every piece of professional cookware goes through: abuse. From getting slammed around on cooktops to the rigors of washing night after night, this little skillet had stories to tell. Yet it had few outward signs of anything more than a trip to New York (maybe even first class, judging from the lack of dents). It was clear that this pan was actually disrupting the cookware market. When it came to durability, it was different.Simply put, Hestan NanoBond cookware is the most durable stainless cookware that I have ever seen. It uses a molecular-bonded titanium coating on stainless steel to create an incredibly hard surface, which also conducts heat better than a regular stainless pan. And thanks to that coating, it’s even easier to clean, because things just don’t want to stick to it.No, it isn’t completely nonstick. No, it isn’t going to replace my well-seasoned black steel, nor will it knock my beloved Staubs off the counter. But for most cooking tasks—from searing and sautéing vegetables and proteins to simmering sauces and braises to everything in-between—I reach for it more than any other cookware in my kitchen.Photo by Emma Fishman3.5 Quart NanoBond Sauté Pan$300 at HestanExplore Bon AppétitHighly RecommendShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-26", "author": ["Condé Nast", "Chris Morocco"]}