{"id": "2f8dffad7c7dbb44922ae0e48b040cd3", "url": "https://www.bonappetit.com/story/why-arent-restaurant-workers-prioritized-for-covid-19-vaccine", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Restaurant Workers Should Be Prioritized for the COVID-19 Vaccine. Why Aren’t We? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRestaurant Workers Should Be Prioritized for the Vaccine. Why Aren’t We?We're considered nonessential because we cater to customers' wants not their needs. But that's not the whole story.By Miguel de LeonMarch 1, 2021FacebookTwitterEmailPHOTO BY DUSTIN CHAMBERSFacebookTwitterEmailI was getting ready to set up Pinch Chinese for our usual delivery and take-out service in early February when Gov. Andrew Cuomo announced that indoor dining was coming back to New York City. As the sommelier at the restaurant, I felt a bit of relief, thinking this might allow Pinch to survive past the spring, but at the same time I was filled with dread. At this point, restaurant workers like me were ineligible for the vaccine and therefore at risk of being infected with COVID-19. Cuomo’s decision prompted an outcry from industry coalitions like Restaurant Workers Community Foundation, food journalists, and everyone in between. Astoundingly, and perhaps due to backlash, the governor quickly expanded the Phase 1b group to include restaurant workers but passed the buck of doling out these vaccines to “local municipalities if they think it works within their prioritization locally,” a vaguely worded addition I understood as restaurant workers were permitted to receive the vaccine—only if there was enough left over.Since the beginning of the pandemic, we’ve been ostensibly classified as “essential.” But it’s become clearer to me that restaurant workers are considered a different kind of “essential”: laborers who do what others don’t want to do, not just making food and taking care of customers, but catering to their wants, not their needs. That’s not all we do.In the most Platonic ideal, restaurants serve communities. We encourage our neighbors to get to know each other. We provide business to a myriad of vendors and strengthen ties within the local economy. We celebrate all the happy occasions with our guests and commiserate with them when things are bleak. (Unfortunately, in trying to make everything look and feel good, the industry has perpetuated white supremacy by ignoring rampant problems of abuse, sexual harassment, racism, and xenophobia.) In the COVID era, every one of those acts of service is diminished, and that hospitality cannot be translated into something that is packaged and delivered. But even before the pandemic, restaurant work has been considered a transition job, something to make money while the career of our dreams sorts itself out.As restaurant employees, we’ve felt like afterthoughts. Cuomo is not the first to pass the buck. Instead of restaurant owners paying workers wages that can keep up with the cost of living, they are happy to foist that responsibility onto the customers under the guise of tipping and delivery fees. Instead of the government providing crucial legal aid and financial assistance to independent restaurants during the pandemic, their lack of action allows the free market to dictate who gets to survive at the whims of landlords and those who have all the resources, thanks to late-stage capitalism. Instead of a public that prioritizes the health and safety of others and values the efforts of its essential workers, American consumers have given into convenience and comfort at their expense. In every instance, restaurant workers have had to bear the brunt of these policy changes and customer entitlements and re-re-opening announcements by ourselves, constantly weighing the importance of our individual and collective economic solvency over the potential risk of contracting and spreading the virus.The vaccine is the carrot at the end of the stick. In late January a study out of UCSF found that prioritizing workers in food and agricultural sectors can significantly decrease COVID mortality rates. Those considered to be on the frontline—namely grocery workers, food processors, and farmers who are crucial to protecting the food supply chain—have received vaccine allowances fairly quickly after vulnerable populations and first responders. But vaccine availability for restaurant workers has only come after decisions have been made to reopen indoor dining, such as in New York City and Detroit, or where restaurants have remained open but with low indoor capacities, as in Los Angeles and Washington, D.C. The view, it seems, is that the financial health of a restaurant and the radiating effect on the national economy are prioritized over the humans who work in those restaurants.A restaurant job is by no means a death sentence, but it is, to say the least, much riskier than it was mere months before, as we face more transmissible and potentially more lethal variants of the virus and find that indoor dining can be a vector for its spread. We also cannot ignore the disproportionate effect of that risk on people of color as we weigh our colleagues’ need to work. Against all available data, despite contraction numbers and hospitalizations going up, the push to reopen indoor dining relegates the needs of the laborers last, after the owners, the landlords, the vendors, and the guests. We are “essential” yet disregarded. The vaccine looks like a silver bullet, a boon, a waypoint to what once was the “before times,” but it only reveals that “essential” workers are and have always been unseen and unheard.The moment Cuomo decided to add restaurant workers to the vaccine eligibility list, I searched three websites—a state site, an NYC site, and another organized by volunteers on Twitter (hooray bureaucracy!)—to book my first dose appointment as soon as I could. I can only imagine what it would be like if I didn’t speak English or didn’t have computer or internet access. I felt like I was in line for a Black Friday sale, searching for any open time slot, willing to travel anywhere, feeling manic.The next day I found myself at a high school in Queens, inside a gym with tables carefully distanced and lots of volunteers. The woman administering my vaccine was wearing her hijab, a face mask, a surgical shield, a disposable overcoat, and those same single-use blue gloves that I use in the restaurant. We struggled to meet each other’s eyes. Hers were tired after seeing so many people. Mine were anxious after seeing very few. But in them we noticed each of us trying to smile, the layers of the American experience distilled in a moment when we struggled to communicate because of the things on our bodies trying to protect us from each other.One cold injection and a sore arm later, I gathered what was left of my emotions and wept into my sleeve as I waited for another volunteer to help me make a second appointment. Relief, anger, comfort, and guilt washed over me as I sat by myself, meditating over my deed done for civic responsibility. The purpose of the vaccine was laid bare then. I didn’t get it so I could go back to work, but so I could plan for a future that’s better for my colleagues, hopefully with government support and a deeper understanding from guests of the skill our labor entails. Not so I can take care of myself, but so I can take care of others and cater to their needs because this is a calling, not a back-up gig. Restaurants are centers for the future, where minds and souls can be nourished, where timeless ingredients can interact in a way that is exciting and fresh, and where we can begin to consider what kind of work is truly essential.Restaurant workers understand this burden and this joy. Maybe just this once, consider us.Explore Bon AppétitRestaurantsCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-01", "author": ["Condé Nast", "Miguel De Leon"]}