{"id": "2f8ff54d1677904d4379d5e8cd283941", "url": "https://www.bonappetit.com/story/snack-oclock-in-ba-test-kitchen", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "This Is Snack O'clock in the BA Test Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is Snack O’clock in the BA Test KitchenYou try staying away.By Adam RapoportMay 7, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he’s been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I always tell people that the key to staying fit as a food editor is to avoid snacking.Lately, the Bon Appétit Test Kitchen has made this next to impossible for me.On a typical day at BA, right around 3:30 p.m.—you’re familiar with 3:30 p.m., yes? When that healthyish bowl/salad thing you got for lunch is no longer doing the trick and you’re starting to think about coffee and a cookie or maybe a bag of Cool Ranch Doritos which, of course, you would never actually get from the vending machine, but let’s not act like you never have.Anyway, this is about when the food editors set out their dishes for tastings. And this past month, even I—Mr. Willpower here at 1 World Trade Center—haven’t been able to resist.Want this letter before it hits the website? Sign up for our newsletter!We can start with Chris Morocco’s BA’s Best Chocolate Chip Cookies. You know how when you smell cookies in the oven, and then you see them come out and the chocolate chunks are all glossy and semi-melted? Don’t act like you can say no to that. I know I can’t. And Chris being the perfectionist that he is, spent two full months conceptualizing, developing, and testing this recipe. My mid-afternoon espresso never tasted so good.Photo by Chelsie Craig, Food Styling by Pearl JonesWhile Chris was in the CookieZone, Molly Baz was working on two spring-centric dishes, each of which I kept going back for again and again. The first, Crispy Green Rice Pilaf, stopped me in my tracks. How could any dish be so...green? Turns out Molly blitzed a mountain of herbs with lime juice and miso and then tossed the purée with crispy leftover rice, slivered snap peas, toasted pistachios, and golden raisins. Yes, this is a rice salad that is genuinely mind-blowing.Photo by Chelsie Craig, Food Styling by Pearl JonesMolly insists her Upside-Down Caramelized Leek Tart isn’t a dessert, but I’m not buying it. Buttery, flaky crust, a rich, creamy base, and caramelized leek planks. I found myself cutting sliver after sliver, like you do at Thanksgiving, until I realized I had eaten a quarter of the pie.Photo by Alex Lau, Food Styling by Sue LiAndy Baraghani, who is truly fit—seriously, the guy does Cross Fit five days a week—came to the rescue with his Spring Minestrone, a brothy, herbaceous soup with serrano chile for bite and white miso (a BA Test Kitchen fave) for backbone. It’s the kind of satisfying mid-afternoon snack that doesn’t immediately make you need to take a nap.Photo by Chelsie Craig, Food Styling by Kate BuckensFinally, Carla Music—the boss woman in the test kitchen—had to have the last word and tempted me with her White Pesto Pasta, a lush mixture of ricotta, parm, walnuts, and more.It’s exactly the kind of dish that makes me see a trainer twice a week and why I try my best (but usually fail) to steer clear of the BA Test Kitchen at Snack O’clock.Explore Bon AppétitAdam NewsletterRead MorecookingChris Morocco Just Made the Best Chocolate Chip Cookie EverBy Alex BeggscookingWhite Pesto Is The Easiest Dinner You Will Make This WeekBy Emma WartzmanLifestyleGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeBy Aliza AbarbanelcookingThis Caramelized Leek Tart Is the Easiest, Most Stunning Dish You Will Make This SpringBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-07", "author": ["Condé Nast", "Adam Rapoport"]}