{"id": "2fa9acd4c488f95f0ac04f7aa604f84c", "url": "https://www.bonappetit.com/recipe/quick-pickled-vegetables", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Quick-Pickled Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueQuick-Pickled VegetablesBy Molly BazFebruary 13, 20184.1(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYou can use any thinly shaved or sliced vegetable you like for this recipe. We love quick pickles on sandwiches because they add acidity and crunch. And you don't have to be someone who's \"into canning\" to make your own. Keep them in the fridge for days and put them on everything.IngredientsMakes about 1 cup½cup unseasoned rice vinegar1Tbsp. sugar2tsp. kosher salt1cup thinly sliced vegetables (such as carrot, red onion, and/or cucumber)PreparationStep 1Whisk vinegar, sugar, and salt in a small bowl until sugar and salt are dissolved. Add vegetables and let sit, squeezing gently with your hands occasionally to help them pickle more quickly, 10 minutes.Step 2Do Ahead: Vegetables can be pickled 3 days ahead. Cover and chill.How would you rate Quick-Pickled Vegetables?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglePickling/Sterilizing/Canning - the Process\nThis can be a chore when you have to get out a large container and go through the hassle of a water bath for 20 to 30 minutes, especially if you have only a few jars to do......Easy solution!\n Mix the water and vinegar and salt and bring to a low boil. While boiling, sterilize your jars and lids for a couple of minutes in a separate pot. Prepare contents as you would for pickling anything  Put in jars.  Now for the easy part. One jar at a time, ladle the boiling brine mixture into the jar until it is at the bottom of the threads on the jar. Put flat sealer lid only on the jar and place in the microwave oven. Microwave on high until bubbles appear going up the sides of the jar: 500 ml jar takes about 70-80 seconds, 1 litre jar takes about 140-160 seconds. Watch it carefully as you do not want it to 'volcano' out of the top. When you see the tiny bubbles for about 3 - 5 seconds, stop the microwave and put the ring on the jar and tighten (if you get good, you can do this while inside the microwave oven). Then carefully lift out (it is hot so use gloves) and place on a wooden/plastic cutting board to cool. After about 1-3 minutes you will hear that lovely 'ping'....sealed. Take ring off, and wipe threads with a clean damp cloth; after 20 minutes you can test if you wish, by trying with your fingers to remove the flat sealer lid (if done properly, it will not come off). Either replace ring or just store with the sealer lid only. Note: the sweeter the mix, the faster it will heat up so for instance if canning tomato puree, watch out as it may start to bubble after 50 seconds for a 500 mil jar, and the thicker the mix, the more it is likely to 'volcano' so experiment with it like I did and always keep your finger ready on the microwave stop button. Good canning!!\nOne last thing...if at first you fail and the flat sealer lid comes off, no problem. Simply repeat the microwave process again making sure you see enough little bubbles to indicate the mixture is superheated. Some things to look for: 1) your lid may be bad, the rubber may be cracked or have a small piece missing, so if that is the case, throw it and get another. 2) sometimes depending what you are pickling, the bubbling process may push a particle of spice or such up onto the jar rim and prevent the seal, so you may need to wipe the top of the jar carefully with a clean paper towel and replace flat seal lid and try again 3) sometimes the mixture is so 'unfriendly' that it always seems to put something around the jar rim, so just heat without the flat seal lid and when the mixture starts to bubble, remove jar to counter directly in front of open door and wipe rim with clean paper towel and place the flat seal lid and ring on and tighten (can be done in about 6 seconds max) and the lid will still seal (always test these ones by trying to remove seal lid with fingers after 20 minutes; may have to redo if not done properly) Hope that helps.TurrenWhiterock, B.C. Canada6/20/2020Explore Bon AppétitPickleCondimentCarrotVegetableRed OnionOnionCucumberQuickEasySideSnackDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Molly Baz"]}