{"id": "2fadb59ad582880ddeae57e04d0d1fa3", "url": "https://www.bonappetit.com/story/gentle-food", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Calming Foods Are Here for Me When I’m Feeling Chaotic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen I’m Feeling Chaotic, Gentle Food is There for MeCooking helps me hang up my swirling thoughts at the door and instead focus on small tasks.By Christina ChaeyMarch 14, 2020FacebookTwitterEmailPhoto by Christina ChaeyFacebookTwitterEmailEvery other week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish readers,It’s been a weird and unsettling couple of weeks in New York. The subways are emptying out while the streets are clogged with Amazon and FreshDirect delivery trucks. Our restaurant friends in the city are reporting that business is way, way down. On top of all that, I’ve been sick with a cold that’s left me stir-crazy at home—plus our whole office is working remotely for the next few weeks...at least.And so I’ve been on a completely chaotic cooking spree, much of which I’ve documented on my Instagram stories, prompting a couple of friends to DM me, “uh, u ok?” (Short answer: No, but is anyone okay right now?) Here’s what I’ve been cooking, eating, and buying this week.When Life Gives You PorkAt present, my fridge is so full there isn’t a spare cranny to fit a lemon, which tbh is the kind of chaos I’m here for. I’ve been gravitating toward what I call “gentle foods,” which for me include warm things of the brothy/runny/creamy/velvety nature. My friend Caroline sent me home from dinner the other night with two pounds of ground pork (the perks of being friends with cookbook recipe testers!), which I split between a batch of Chris Morocco’s sublime Weeknight Mapo Tofu and this oldie-but-goodie Garlic-Chile Ground Pork to eat with rice and cukes or beans and greens, etc., for the rest of the week.The Ramen That Keeps On GivingThe highlight of my cooking last week was Andy Baraghani’s new vegetarian ramen recipe, a good reminder to stockpile packages of Sun Noodle fresh ramen noodles, which freeze amazingly well. It’s the kind of recipe that keeps on giving, with leftover buttery, mushroom-y broth to freeze for another day plus extra crispy chile-garlic oil to drizzle on things like mashed-bean tacos and steam-basted eggs (which so many of you are recreating at home and it’s making me happy!)Photo by Christina ChaeyWhat I’m Buying Right NowIn the middle of trying to practice social distancing, it feels more important than ever for me to eat, cook, buy, and generally support things that come from humans I respect and admire, like Rancho Gordo beans or Burlap & Barrel spices. A few nights ago I made the most comforting kare raisu, the savory Japanese curry rice that was a weekly staple in my house growing up. I used a very special homemade Japanese curry brick I’ve been saving, made by cookbook author and soba maker Sonoko Sakai who gave it to me as a gift. I sent her a photo of my bowl and felt a lot of gratitude for the meal she enabled me to share with people I love in the middle of a dystopian week.Every day feels like an exercise in finding a new normal, especially now that we’re working from home. Cooking helps me hang up my swirling thoughts at the door and instead focus on small tasks: washing the grit out of the kale leaves, frying the eggs, siphoning the scum off the chicken stock burbling away on the stove. And, to the best extent I can, I’ve been prioritizing all the things I normally would: riding my bike around town. Finding laughter in memes. Filling my house with the sounds of what my roommate Emma calls “bleep-blorp,” the blissfully ambient chill music service we’ve been working to every day. I’m currently group-texting with friends to plan a virtual “birthday party” for our other friend tonight because, yep—that’s where we’re at now. And, yes, someone baked a cake, even though the birthday girl won’t be able to eat it.Be good to each other,Christina ChaeyAssociate EditorExplore Bon AppétitWhat's Chaey Cooking?HealthyishRead MoreLifestyleA Giant Pancake, Vietnamese Soup, and More From Christina Chaey's KitchenBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-14", "author": ["Condé Nast", "Christina Chaey"]}