{"id": "2fc09e78ce3a88af890ef93fd82806ca", "url": "https://www.bonappetit.com/story/tacos-pregnancy", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Tacos Were Always My Greatest Comfort—But I Had to Give Them Up to Get Pregnant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureTacos Were Always My Greatest Comfort—But I Had to Give Them Up to Get PregnantSometimes, your salve becomes your kryptonite.By Katie GutierrezFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel ShepardFacebookTwitterEmailAt the flour-dusted kitchen counter, Ñaña hands us each a smooth ball of tortilla masa. The rest are stacked in a mixing bowl, tucked beneath a frayed dish towel. A film of cling wrap seals the bowl itself, which Ñaña pushes to the corner where it will wait for two hours until the masa is ready to be rolled.In the den my younger brother, sister, and I play with our masa. We squeeze the little balls into new shapes, flatten them so they memorize the grooves of our palms. We lift the masa to our noses and inhale. We pinch off tiny bits and place them on our tongues.Ñaña’s real name was Josefina. Everyone called her Fina, but when I was a toddler, Ñaña was the closest I could get, and the nickname stuck. She stood below five feet and had a military sternness and steel-gray hair she permed into tight ringlets once a year. She had been a part of our family since my mother was born, caring for my mom and her five siblings until they were all out of the house. She’d lived with my grandparents in Laredo, Texas, during the week and crossed the bridge back home to Nuevo Laredo, Mexico, on weekends. For most of my life, the border was fluid this way, people on both sides crossing daily for work, family, and recreation.By the time I was born, Ñaña was 71 and a widow, and had been robbed twice, once dragged down the street by the purse strap she refused to relinquish. When my parents asked her to move in with us, she resisted, not wanting to be a burden or charity case. Eventually, though, she agreed. She became the anchor of our home, its fiercely pulsing heart.The kitchen, in particular, was Ñaña’s domain. Though we all urged her to rest, she woke at five each morning, drinking her Folgers instant coffee at the kitchen table in quiet darkness. Then she stood, the Velcro straps of her high-top Reeboks secured across her thin ankles. She was ready to make breakfast for us.Most days we had some form of mariachi—or what people north of Laredo refer to as a breakfast taco. Weekdays were chorizo con huevo if we were eating at the table. If we were in a rush, she’d fold her flour tortillas around slices of baloney or hot dog—wíne (pronounced WEE-neh), we called it, a word I always thought was Spanish but now suspect was Nanny’s attempt to say “wiener.” She would slip the warm foil tubes into our hands as we ran out the door. We ate tortilla con baloney and tortilla con wíne so often we got sick of them, but we couldn’t tell her. Instead, we gave the tacos to friends or dropped them into our backpacks, where we’d find them weeks later, fossilized; even then, it was painful to throw them away.Ñaña made fresh tortillas once or twice a week, but definitely on Sunday mornings. Sunday mornings were for chorizo con frijoles—“Que ricos los frijolitos!” she would trill—each of us traipsing into the kitchen at the smell. She always made a special giant tortilla for my dad, and he always reacted with exuberant delight, as if it were a great surprise. We kissed her before ducking away to eat our tacos in bed, that weekend luxury.We reacted to Nanny’s aging, her increasing fragility, with cheerful denial. When I turned 15 and she cried, saying she could go in peace having seen this milestone, I told her brightly that she’d help me with my kids one day. We both laughed, though I could feel my own throat closing with tears.Nanny had been gone for nine years when I was diagnosed with polycystic ovarian syndrome (PCOS). PCOS, the most common endocrine disorder among women, is also the leading cause of female infertility. At 32, I had a less than 2 percent chance of conceiving naturally.The cut of disbelief was raw and throbbing. My husband, Adrian, knew what I needed: bean and cheese tacos from a local taquería. In bed, I unwrapped one foil package after another, waiting for the cozy sense of well-being I’d always felt on Sunday mornings.Most women with PCOS—including me—have some level of insulin resistance. Insulin is a hormone that allows cells to use glucose, or blood sugar, for energy. When you are insulin resistant, blood sugar rises; it’s the strike of a match whose flames can lead to diabetes, heart disease, stroke, and a number of cancers. It can also up the production of testosterone, leading to symptoms like mine: acne, irregular periods, cystic ovaries, and infertility.After a week’s worth of research into PCOS, I consulted a functional medicine doctor I trusted. He recommended I start a ketogenic diet, which he said could help sharpen my insulin sensitivity. I would need to cut my carbohydrate intake from 250–350 grams a day to below 20 grams a day. Decreasing the amount of sugar in my body could essentially reboot my system, correcting the hormonal imbalances that had made me infertile.I expected the diet to be physically challenging—an apple alone has 20 grams of carbs—but I didn’t count on the grief that accompanied it. Being unable to eat the food I loved disconnected me from my culture, my childhood, in a way that was just as jarring as my infertility. I felt cut off from both my past and future, living in some stranger’s joyless present. The best I could do when I needed comfort was make chorizo con huevo (keto!) and tuck it inside a low-carb tortilla, a bland facsimile of the real thing.Five months into the diet, though, my skin had cleared, my cycle had regulated, and I felt energetic throughout the day. Then, for the first time in months, I missed my period.The home pregnancy tests were negative, so my reproductive endocrinologist drew blood to see what might be wrong. After the appointment, Adrian and I went to lunch, where I ordered a steak sandwich without the bun and a salad instead of fries.“What’s the point?” My voice broke as I gestured to the pink curls of meat, the soulless greens doused in ranch dressing. What I wanted was a bean and cheese taco, in a real tortilla. I wanted Nanny to sit on the edge of my bed the way she had when I was sick as a child. I wanted to ask her why she’d never had children, whether losing that version of her future had hurt, and whether loving us had helped and had it been enough?We went home and I cried myself into a deep, disorienting nap. I woke up to my nurse calling.I was pregnant.Last September was the 11th anniversary of Ñaña’s death. Our daughter, Josefine, was 17 months old. At my parents’ house, I sat at the kitchen table with a mug of coffee, sorting through a steel bowl of uncooked pinto beans. I saw Nanny do this so many times, victoriously plucking out tiny black pebbles. I asked her once about the secret to living a long life. She held up her bean taco and said, with a twinkle in her gray eyes, “Tortillitas y frijolitos, mámi.”I made beans and rice and picadillo. Then my sister came over to help make tortillas. Somehow she inherited the alchemy Nanny tried to pass on: the little hole she drilled into the masa to hold the warm water; the salt measured only in the dip of her palm; the way she rolled the balls smooth by pinching two edges to create a seam. My sister and I worked the masa together, pressing and kneading until a familiar lost scent rose.As we worked we talked about Nanny. We are both mothers, and we’ve come to appreciate our own mother in new and profound ways. Ñaña, too—a woman who loved us as if that love were hardwired, and who showed it in a million tiny ways, not least of which was rolling tortillas until they were nearly translucent, one after another, year after year.That night we sat Josefine in her high chair and watched as her small fingers scooped up rice, beans, and picadillo. I gave her a piece of my tortilla, which she waved at us, laughing. She crumpled it into a tiny ball, like the masa Ñaña used to give us, and ate it. Then her mouth rounded to say, “More!”Katie Gutierrez is a writer and editor living in San Antonio, TX. She can be found working on her debut novel while her toddler naps.Want More Stories From Taco Nation? Right This Way...Why Korean Tacos Are Margaret Cho’s American DreamIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoIt’s Time We Give the Mexican Combo Platter the Credit It DeservesCooking in the Midst of a Border Crisis Is About More Than SurvivalHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.And so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Katie Gutierrez"]}