{"id": "2fca1745e2f2be4f3120b95447a73f4d", "url": "https://www.bonappetit.com/story/pickapeppa-sauce", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "Pickapeppa Sauce Is the Jamaican Condiment That Makes Everything Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingPickapeppa Sauce Is the Jamaican Condiment That Makes Everything BetterIt's known as the Jamaican A1, and I was raised on it.By Kelly DawsonJuly 31, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailMost of the childhood memories I have of my father have to do with him in the kitchen. He’s not a celebrated chef (outside of his social circle anyway), he’s never written down a single recipe (“They’re all in my head,” he says), and he doesn’t care all that much about the latest cooking gadgets (he’s been using the same stuff since my childhood). But I can picture how he moves around the kitchen, throwing a towel over his shoulder and reaching into the spice cabinet for what he calls “a little of this and a little of that.” And for as long as I can remember, he always reaches for a bottle of Pickapeppa sauce.My dad is from Kingston, Jamaica, which is not too far from where Pickapeppa was invented in an area called Shooter’s Hill. As the story goes, a teenager named Norman Nash developed it in his own family’s kitchen as a hobby in 1921 and used a formula that’s now so coveted that the details are hidden away in a bank vault. Cane vinegar made in-house, West Indian red peppers, sugar, onions, raisins, and mango concentrate are just a few of the known ingredients, which are simmered down together in copper pots then aged in oak barrels in the same place where Norman first got the big idea.Although there are copycats out there, and the company has expanded to include more flavors, the traditional Pickapeppa is the only one that really matters to my dad. It has the thickness of ketchup, the color of rich soil, and the sort of mild tang that helped his three American kids develop a palette beyond chicken nuggets and French fries. To open a bottle is to get an immediate perfume of cane vinegar and cloves, followed by a bit of onion and a hint of thyme. Its acidity comes through first, like a gentle burn at the back of the throat, then the spices kick in for a layered finish without any heat. It’s tough to determine the sea salt from the garlic or the mango concentrate from the tomato paste. But together, they make something that’s casual yet complex. Kinda like my dad.My family stirs it into soups—especially a turkey-based one my dad makes with sausage, thick noodles, and flour dumplings for the day after Thanksgiving—and plops it on top of meats like a familiar condiment. It makes regular appearances in marinades for steaks, barbecue sauces for ribs, and as a topping for burgers (Pickapeppa is known as the Jamaican A1, of course). “I put Pickapeppa sauce on everything,” my dad told me. “Everything! Well, okay, not on fish.”I’ve often wondered why Pickapeppa can be so ubiquitous but still remain relatively under the radar. Its flavor is much more mild than the island’s famed jerk chicken, it can be bought in bulk on Amazon, and it’s in markets from North America to Australia. Sometimes I hope it’ll rise to the popularity of Sriracha or be given the permanent respect of Worcestershire, and that restaurant chefs and home cooks alike will make just a little more room for it in their kitchens. But, for now, as I pour Pickapeppa onto my sandwich for lunch and see its green and orange label with the parrot in the center and Jamaican flag on the side, it’s a proud emblem of my heritage, the open secret to why my dad’s food tastes so good.Buy Pickapeppa sauce for $8 on AmazonAll products featured on Bonappetit.com and Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHot SauceSauceJamaicaJamaicanCondiment/SpreadShoppingRead MorecookingMake This Chile Crisp at Home Then Pour It on EverythingBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Kelly Dawson"]}