{"id": "2fd4315214e128264ed04d90295e1e80", "url": "https://www.bonappetit.com/story/maryiza-tasting-set", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "This Raw Unfiltered Honey Tastes So Much Better Than the Bear | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Honey Bear Is Cute, but These Unfiltered Versions Taste So Much BetterMaryiza sells Ethiopian honey that promotes biodiversity and deliciousness alike.By Sarah JampelNovember 13, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!If pressed, I could name the country of origin of my coffee beans, my olive oil, and the last bottle of wine I opened. But the honey I drizzle onto my yogurt and stir into my tea? It comes in the shape of a bear, which is definitely the reason I bought that particular bottle. It’s very sweet, and that’s about all I can tell you.Honey is one of the most commoditized food products in the world, according to Ariana Day Yuen, whose company Maryiza made me think twice about where I source my honey (with a strong assist from the documentary Honeyland, of course). The market is dominated by blends mixed together from different hives, regions, and even countries. This process washes away much of the nuance produced by the various nectar sources into a sea of sugary, unidimensional syrup.The honey from Maryiza, on the other hand, is produced from bees who pollinate indigenous trees in southwestern Ethiopia’s Afromontane region. Maryiza works with local farmers to produce raw, minimally filtered honey based on the flowering seasons of the trees, and the distinctions between the resulting honeys—abalo, bissana, grawa, and geteme, all named after the plant source—will hit you over the head. “The difference in terms of taste, smell, color, and texture is so much more obvious than the differences between single-origin sets of coffee,” says Day Yuen.With the set of four small jars, it’s easy to taste for yourself. I’m not the kind of person who spouts off “tasting notes” at the drop of a hat, and even I was shook and, dare I say, inspired: The abalo is smoky and rich (it would be great incorporated into a glaze for tempeh or chicken); the bissana, citrusy and tart like the skin of a plum, begs to be brushed over an apple galette (or spun into stuffed challah!); I like to smear the delicate geteme, floral and thick, on bread and top it with goat cheese.Day Yuen’s ultimate goal, however, is not only to highlight the distinct qualities of native tree honey, but also to combat deforestation by increasing the value of products that wouldn’t exist without these old-growth forests. In the region of Ethiopia where Maryiza works, ancient forests are often cleared by small coffee growers looking to expand their farms in order to make more money (logging is a smaller, but also present, threat). By providing these farmers with an additional source of income that supports biodiversity, Maryiza has created a financial incentive for conserving the forest. Those areas are vital to the health of our planet and to the livelihood of many—and they’re also, as you’ll definitely taste, the source of extremely delicious honey.Photo courtesy for MaryizaMaryiza Tasting Set$32 at MaryizaExplore Bon AppétitHealthyishHealthyish Loves ItShoppinghoneyRead MoreshoppingCondiments Come and Go, But NY Shuk Harissa is ForeverBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-13", "author": ["Condé Nast", "Sarah Jampel"]}