{"id": "2fd512d998733e79aa152599a4a84a88", "url": "https://www.bonappetit.com/story/bas-best-matzo-ball-soup", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "The Most Opinionated Editors Came Together to Make BA’s Best Matzo Ball Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Most Opinionated Editors Came Together to Make BA’s Best Matzo Ball SoupIt’s brothy, chickeny, herby—and definitely has two matzo balls.By Emily SchultzApril 8, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailIf you read Bon Appétit, you know we’re a very opinionated bunch of people. Probably the most opinionated group of people I know, and I was voted “most opinionated” in high school. So when it came down to developing BA’s Best Matzo Ball Soup—a dish that’s loaded with lots of family history, emotional connection, and personal experience, and not just for us Jewish-identifying editors—I knew there’d be lots of opinions. But I also knew that no matter what, mine would be right.I grew up with my dad’s killer matzo ball soup, a perfectly salted broth with chunks of chicken, two fluffy, palm-sized matzo balls, a smattering of carrot coins, a dusting of parsley and dill, and a crack of freshly ground black pepper on top. It slays every Passover dinner my family hosts, but I crave it (and eat it) all year round. IMHO, that’s all the qualification I needed to develop the perfect recipe with senior food editor Molly Baz, who married into a Jewish family and knows how to handle these kinds of opinions with ease and confidence. But because this is a democracy and we’re all about collaboration at BA, I decided to play nice and go through the motions of taking other people’s views into account anyway. Here’s how development went down.Day 1: “Are you consulting on a construction site? Why do you have a clipboard?” I ask Molly as she goes desk by desk, asking each editor about their must haves. “One big ball or two small balls? Chicken in the soup? How does the cloudiness of the soup affect your time eating it? What about veggies in there? And what shape are the veggies?” Associate editor Alex Delany and food director Carla Lalli Music (neither of whom identify as Jewish) are big fans of one big ball. “But that’s Jewish deli–style, not home cooking! Two balls FOR SURE,” I interrupt. Editorial assistant Emma Wartzman wants them between tennis and golf ball size. Senior editor Sasha Levine wants the whole thing loaded with herbs. I look over Molly’s shoulder and see notes (“wet noise”—excuse me, what?) scrawled all across her page. No one seems to agree. Molly looks stressed.I tell her everything’s going to be ok, and that there will be two balls in the soup, thank you very much.Day 2: “Come taste my matzo ballz!!!!” Is the excited Slack message I receive from Molly at 3:29 p.m. on a Tuesday. Her station in the Test Kitchen is set up like a matzo ball lab. She’s testing every variable: Simmer them in salt water or broth? Mix ‘em with schmaltz or oil? Add fresh herbs? Use seltzer? What about baking powder? Shape with your hands, or a cookie scoop? Can they be over handled? (Spoiler: NO! We tried everything and discovered over handling is a myth! Read that story here.) We try SO. MANY. MATZO. BALLS.In the end, we decide on an herby-schmaltz mixture in a salt water simmer. They’re small enough that you can have two to a bowl, but substantial enough that they don’t disappear. I feel satisfied.Day 3: Legs dangling from the Test Kitchen’s marble countertop, Molly doles out bowls of golden broth. What I think is going to be a 10-minute tasting turns into an hour long discussion about what to do with the chicken. “This isn’t the meal. It’s the pre-meal. You don’t want people to fill up,” Basically editor Amiel Stanek argues. I tell Amiel that I make matzo ball soup more than once a year, and sometimes it is my entire meal. Therefore, I’d like some chicken in there. Molly’s concerns are more technical: If you simmer a whole chicken to make the broth, the breast and the legs cook at different times, resulting in an overcooked breast or undercooked leg—neither of which you really want to eat. More questions come up: Should the broth be blonde or a deeper, darker brown? What do we do with the stock vegetables? Should we roast them first, give ‘em a quick sauté, add ‘em in raw? It’s 12:30 p.m. Molly needs a drink.Instead, she makes a few more options, we taste through them, and make our decision: A broth made from roasted chicken wings, for color and body (thanks, collagen!), that get milked (umm, simmered) for all they’re worth, then tossed. Then we add in chicken legs for some extra flavor and heft, without any dried-out, overcooked nonsense. That’s three points for me, if you’re keeping score.Day 4: If you’ve seen Molly’s rotisserie chicken pot pie, you know she is not a fan of carrots. Which is why I feel exceptionally excited to let you know that there ARE carrot coins in this soup. “Who actually gets pleasure out of eating a soggy carrot coin?” Molly and Carla ask the staff. “WE DO!!!” we all over-enthusiastically proclaim. (Except for digital director Carey Polis, whose chunks are so large, they never get too mushy.) Molly compromises and decides to discard the carrots used in the stock, and add fresh coins to the pot 3 to 4 minutes before serving. “You know what?” she whispers. “I like them more than I expected to.” Another win.The Final Result: The soup checks all the boxes. There’s a delicately herby, very chicken-y broth; two-inch, dill-packed matzo balls; tender, shreddy chicken leg meat; and not-too-soggy carrot coins. It’s flavorful without going over the top; satisfying without being overwhelming. It reminds me a lot like my dad’s soup. Remember what I said about my opinions?Get the recipe:BA's Best Matzo Ball SoupThis recipe serves eight people generously (with two balls each) but could easily stretch to serve 16 smaller appetizer-sized portions.View RecipeExplore Bon AppétitPassoverSpringSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Emily Schultz"]}