{"id": "2fddfd1b36c52a3a960fc149c5ed4df5", "url": "https://www.bonappetit.com/story/whats-at-stake-for-the-restaurant-industry-this-election", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at Stake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseI’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeWhat needs to change, according to chef-owner Francesca Hong.By Francesca Hong October 8, 2020FacebookTwitterEmailIllustration by Julia DufosseFacebookTwitterEmailMy partner and I opened Morris Ramen in December of 2016. We had a newborn son and a 21-person staff, full of people at different junctures in their lives yet all committed to helping us nourish the community with soup. For two people about to open their first restaurant, we were surprisingly optimistic in the months leading up to it, but the 2016 election made us re-evaluate our identity and purpose. It wasn’t enough to just nourish the community; the election of Donald Trump was an attack on marginalized, working people, many of them part of the restaurant industry. We were traumatized, but we put on our aprons and went to work, trying to make our space a safe, stable, and inclusive place for our employees and customers. We raised money for Planned Parenthood. We helped form a group for women and non-binary industry professionals to support one another. We were still hopeful.But when the pandemic hit earlier this year, we couldn’t just keep working. With the health of our workers and guests at stake, my husband and I felt we had no choice but to close our dining room indefinitely. We clumsily helped our staff retain some sense of temporary financial security as we tried to navigate the broken Wisconsin unemployment insurance system. We paid staff in full for as long as we could and pushed gift cards and merchandise sales to try to ease some financial burdens. We were adapting every way we knew how, while leadership at local, state, and federal levels failed to provide adequate safety nets for their constituencies. Meanwhile, leaders in the Madison food community pooled resources, time, and efforts to reach out to officials to state our case for saving small, independently owned restaurants in the food and beverage community. The responses we got were timid. Small independent restaurants were left out of traditional grants and loans made available by financial institutions. I was fielding calls left and right from servers, cooks, managers, and restaurant owners, trying to figure out the next step. We received messages from folks who were afraid of losing their homes and who said their calls to unemployment offices were being ignored—and we received overwhelming gratitude when we offered free meals to service industry workers. We were all asking for help, and we were all terrified.By Mother’s Day this year, amid the reckoning over the deaths of George Floyd, Breonna Taylor, and Ahmaud Arbery, and still figuring out our role as restaurants in the growing social justice revolution, I declared my run for office as a Democrat in Wisconsin’s 76th State Assembly District. The pandemic was a call to action and a call to wake the fuck up. Despite the crises of systemic racism, of the pandemic, and a global climate crisis—I saw that our industry came together to feed the vulnerable, to share resources, to invest in mutual aid and show solidarity in struggle and in care. So why couldn’t our elected officials take on that same leadership? They asked the restaurant communities with limited resources to pivot, adapt, and change, yet refused to see that they themselves must adjust the rules and recognize that the game is rigged for the working person. I’m in a position to bring an intersectional perspective to our state government being a service industry worker, a mom and an organizer. I know that strengthening the restaurant community through holistic policies that empower our workers with better housing, wages, and food systems will make our industry become more equitable, inclusive, and continue to strengthen our local economies.Our industry as a whole is in desperate need of restructuring, but guess what? So is our government. The ability of the restaurant business to meaningfully change depends heavily on politics—and on the outcome of this next election. The inequities across every sector of the hospitality industry—and our deep roots in white supremacy—have been exposed, but none of the structural changes we need to make will be sustainable without shifts in economic and social policy. From immigrant rights and protecting farm workers to minimum wage laws, health care, and small business subsidies, it all comes back to the policies that shaped restaurants and how normalized they have become.Photo by Nick HwangLet’s stop having the conversation about going back to normal. Normal is no longer relevant. Normal was not okay. Normal was not good enough. Normal was 17-hour days of line-cooking so I could barely make rent. Normal was employees relying on a tip from a customer to make a decent living wage. Normal was substance abuse, anxiety, and other mental health illnesses pervading our workers.We need loud-ass information campaigns about the realities of where our food comes from, how it’s priced, and about how farm-to-table is more of a marketing tool than a practice. We need to fight for living wages and comprehensive immigration reform—the restaurant industry literally depends on immigrants for survival, and they need to be recognized and treated as human beings in our policy making. Our industry can restructure to the benefit of its workers, its owners, and the greater community it serves—but that won’t be possible without constant communication and collaboration on government policies. This is why I’m running for office. I want to help redefine what the relationship between elected government officials and the restaurant community can look like.If we don’t call it like it is and don’t address it now, we’ll only have Applebee’s and Chili’s in a few years, because the small independent brick-and-mortar restaurants won’t be able to afford rent. All those who’ve tested positive for COVID-19 will now have pre-existing conditions that raise the cost of their health insurance, and there may not be a public safety net. If you want our food systems to stay intact, the urgent need for a system where everyone, regardless of ability to pay, receives comprehensive health care coverage through a government funded program, cannot be overstated.If we are to truly break down barriers to change, the first, most vital step is to vote and work to bring active representation at every level. We are responsible for cleaning up this smog of the crises we are breathing in.The structural changes needed in the restaurant industry directly reflect the changes needed in our society to build a better-functioning democracy. The time for incrementalism is over. I want restaurants to come back stronger, to emerge as pillars of opportunity and hope. Restaurants should be places of unwavering collaboration and creativity, where principles of inclusivity and diversity actually are put into practice and are not just lip service. We in the service industry get shit done, but it isn't just about us. There needs to be a collective commitment to systemic change. So let’s vote, and then let’s get to work.Here’s how you can participate in preserving our democracy today:Call your senators and demand they pass The Heroes Act, which now includes the Restaurants Act and will help support over 11 million workers employed by independent restaurants.All of us in the service industry have the opportunity to share our customer service talents at the polls this November—masked up and distanced, of course. Become an official poll worker and take part in ensuring a fair and accurate voting process. Oh yeah, and you get paid!Engagement is the first step to organizing and you can start by signing up to work the voter assistance hotline, which helps folks vote from the convenience of home, and sharing how they can save our industry.Every vote matters. Every vote is critical. Every vote should be counted, but there are leaders in Wisconsin trying to suppress the vote, especially in BIPOC and immigrant communities. They’re crucial players in the restaurant industry, and it’s important to make sure their voices are heard and keep lawmakers focused on helping independent restaurants build back stronger. Join the state voter protection team and make sure our voices are heard.Explore Bon AppétitRestaurantsFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-07", "author": ["Condé Nast", "Francesca Hong"]}