{"id": "2fec9da046626a27168a57db5e6f0d01", "url": "https://www.bonappetit.com/recipe/tropi-cobb-salad", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Tropical Cobb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTropi-Cobb SaladBy Chris MoroccoJuly 25, 20184.2(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintTo make this fruity, healthyish twist on a traditional Cobb salad vegetarian, substitute chickpeas for the chicken.Ingredients4 servings7Tbsp. extra-virgin olive oil, divided6garlic cloves, lightly crushed4skinless, boneless chicken thighs, cut into ¾\" piecesKosher salt1Tbsp. vadouvan or curry powder2Tbsp. fresh lime juice6cups torn Little Gem or green lettuce2ripe avocados, sliced2small ripe mangos, sliced¼red onion, thinly sliced1cup cherry tomatoes, halvedFlaky sea salt, mild red pepper flakes, and basil and/or mint (for serving)PreparationStep 1Heat 2 Tbsp. oil in a large nonstick skillet over medium. Add garlic and cook, tossing occasionally, until golden brown all over, about 5 minutes. Increase heat to medium-high. Season chicken with kosher salt and add to skillet. Cook, tossing occasionally, until chicken is golden brown and nearly cooked through, about 3 minutes. Remove from heat and add vadouvan. Toss several times and let chicken sit in skillet until cooked through, about 1 minute longer. Transfer to a plate and let cool slightly.Step 2Whisk lime juice and remaining 5 Tbsp. oil in a small bowl; season with kosher salt. Arrange lettuce, chicken, avocado, mango, onion, and tomatoes on a platter. Drizzle with dressing. Top with sea salt, red pepper flakes, and herbs.How would you rate Tropi-Cobb Salad?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleIt's beyond delicious!!!!  For those of you taking the \"Cobb Salad\" part literally: you missed the word TROPICAL & you didn't look at the photo!  The only comparison meant by this was that it is laid out like a Cobb Salad ... Just breathe Peep's lolLov2LivWest Coast6/27/2021Love this--it's fresh, tangy, and simple, even if it requires some chopping. Anonymous950373/19/2021When leaving a review, it automatically selected five stars and I couldn't change it. \nI would rate it 3,5 stars instead...\nIt was just OK. The combination of the creamy mango and red onion was excellent. However, I felt like there was something missing in the end.Wammie22113/4/2021So easy to throw together pretty quickly for a weeknight. The spice of the chicken and red onion combined with the creamy sweetness of the mango, and freshness of the herbs and greens is SO good. Def not a Cobb salad, by any means, but delicious in its own right. AnonymousLos Angeles10/12/2020Love this recipe! I make it with cauliflower (the way the chicken is prepared) and it is so good! Everyone should try this outAnonymousBloomington, Indiana11/27/2018Great for a quick lunch, I didn't know mango went so well with red onion! thank you so muchMonCoastColombia8/28/2018There is nothing \"Cobb\" about this salad. It's mediocre tropical salad, at best! The description really sold it for me, and I was very underwhelmed (even taking away the comparison to Cobb salad)! New York, NY8/6/2018yep\nAnonymousSomewhere7/30/2018Explore Bon AppétitSaladCalifornia CuisineAmericanMangoStone FruitFruitAvocadoVegetableCherry TomatoTomatoLettuceLeafy GreensEasyQuickWeeknight MealsMainSideDairy-FreeGluten-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Chris Morocco"]}