{"id": "2ffe156dbdff6652fcc521b8fbb7f320", "url": "https://www.bonappetit.com/story/what-are-dates", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "What Are Dates, and Why Are They So Awesome? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are Dates, and Why Are They So Awesome?Date night means something completely different when we're talking fruit.By Alex DelanyApril 24, 2018FacebookTwitterEmailFacebookTwitterEmailWhat are dates? Dates are sweet. Dates make seemingly mundane Tuesday exciting. Dates take a little courage to explore. Dates offer something new and something familiar. Dates are good for strangers or couples. Dates are great with dinner or dessert. Dates are fun. And you know what else is fun? The fact that I could be talking about a romantic outing with another human being or a small fruit that grows on a tree. IT DOESN’T MATTER WHICH! ALL OF THESE CLAIMS ARE ACCURATE EITHER WAY! HOW GREAT IS THAT?! But this is a cooking website, so as much as we want to hear about how dinner with that person you’re into went, we’ll stick to the fruit for now.Let's get to it then. Dates grow on trees. Great big trees called \"date palms,\" actually. They’re native to the Middle East and have been a part of the region’s cuisine for thousands of years(!!!). Dates grow in large clusters, kind of like bunches of grapes, which hang higher than fifty feet off the ground. Isn't it nice that we can just buy them at the store without having to climb up there and grab them?? Life is good.So what do dates taste like? At a very base level, they’re sweet. The sugar content in dates is extremely high, and that sugar gets more and more intense as dates dry and moisture leaves the fruit. But dates aren’t dried or dehydrated completely, even though the wrinkled appearance might lead you to believe they are. They can be eaten anywhere from fresh to partially dehydrated. If you had to compare a date to another fruit, it would essentially be comparable to a bigger, jammier, more caramel-y raisin. (Date sugar, which is derived from dates, is actually used as a natural sweetener in trendy smoothie shops and \"healthy\" bakeries.)When you’re at the store, standing in front of a bunch of dates, thinking, Whattttttttttt...theeee...hellllll? just take a breath. You want to make sure you buy dates that aren’t overly dried. The date skin should be a little translucent, with minimal rips and tears. The dates should be intact and separate, not mashed into a clump, and they should have a nice shine. There are a few different varieties of dates. Some may just be labeled “Dates,” while other have names like Dayri, Barhi, or Medjool. Here at Basically, we’re big fans of Medjool dates, which are bigger and softer than your average date.Mmmmmmmm...date milkshake.\nAlex LauOnce your dates are out on the counter, there’s a ton of ways to use them—but first, you should get rid of the pits. Slicing a date lengthwise will allow you to just pop the small pit out. You can cut them completely in half if you want, or just leave them with a cute little hole in them. Your call. Dates are great as quick toppings to things like yogurt or ice cream, as well as more savory applications, like salads or marinated ricotta cheese (also great on a meat and cheese board). You can chop them and add them to slaws, or throw them into your blender and add the paste to braises, marinades, and glazes can provide sweetness to balance heat and acid.Oh yeah, you can also find them baked into date bread, wrapped in bacon for Devils on Horseback, or jarred as jellies or preserves. Dates are everywhere. They’re an amazing source of natural sweetness, not some scary shriveled rock. Ok. The fruit talk is over. Now you can tell us about your date. The romantic one. How did you two meet?Now, dates and cheese, because we like you:Ricotta and Clementines with Date VinaigretteThis is actually just a way to serve people a big old pile of seasoned cheese and pretend like it's a salad or something.View RecipeExplore Bon AppétitBasicallyDateDessertSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Alex Delany"]}