{"id": "30061e4ad51a8ad2740ea8b898223403", "url": "https://www.bonappetit.com/story/whole-30-diet", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "How Whole30 Made Me Think LESS About What I Ate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Whole30 Made Me Think LESS About What I AteWhole 30 is basically the Navy Seal training of diets, but it freed me from counting every little thing I ate.By Emily CappielloJanuary 16, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailIt struck me one day while I was in a public bathroom. Three women were huddled up, while one was regaling the other two about her new diet and how much she had lost.“But what if you don’t like sweet potatoes?” asked one of them with an urgency in her voice that seemed almost irrational.“How much have you lost already?” asked the other, wide-eyed and in awe.I washed my hands, walked out, and thought, “I’m glad I will never be like that again.”That’s when I realized that, for the first time in my life, I truly felt “food freedom.” And I have Whole30 to thank for it.As far back as I can remember, I loved food. Even when I was a baby, according to my mother, I would eat everything that was put in front of me. As I grew older, that love for food continued to grow. However, so did the realization that I was bigger than the other girls. I was conscious of this from a young age: I went on my first diet at the age of 11 and had a heavy workout regime by 12.I spent years counting things: calories, fat, carbs, sugar. I used to sit at meals with my friends and not understand how they could just eat everything in sight and be so thin while I was picking like a bird and never losing weight. I often felt shame for eating what I wanted, and disappointment in myself for not sticking to salads with grilled chicken. I got used to feeling constantly not good enough.Then I met someone who made me feel more than good enough. And I wanted to match how I felt on the inside to how I looked on the outside. So I decided to try a round of Whole30. I’ve heard some people call it “the Navy Seal training of diets,” and they aren’t wrong. Whole30 does require a lot of focus and strength because of all the restrictions—no white or wheat flour, no sugar, grains, dairy, alcohol (this almost killed me), or legumes. No cheat days, no days off and no replacement goodies (creating versions of your favorite treats using Whole30-approved ingredients).Some people get obsessed when they jump on Whole30. My cousin was one of those people, and she leveled with me about it before I started. She found herself completely consumed with everything she was eating and not eating. But my experience was completely different. For the first time in my life, I felt more free than I had...ever. I wasn’t counting anything. I stuck to the shopping list and was making delicious meals at home. I didn’t feel bad about saying no to wine, even though all I wanted was a glass of good rosé most nights. I ate out a few times (I did try to minimize this, but life happens) and did not feel a bit of guilt about demanding a custom-built meal.I’m not saying this was easy. Once I had a craving that was so intense I almost grabbed an ice cream cone from a random stranger. But watching the weight fall off faster than it ever had without logging every bite into an app was like actually living the end of the movie “Aladdin” when Genie is set free. No more cuffs. I did two more months of Whole30 quick succession.Almost two years later, and I will tell anyone truthfully that I don’t think about diets. My weight doesn’t consume me. While I do stay compliant for most meals, there are nights when I eat tacos with my sister. There are also times that I eat cookies that I baked with my niece. And I don’t feel a bit of guilt, shame, or remorse when I do. Instead of an every-morning ritual, I step on the scale maybe once a month.Whole30 completely rewired my brain. I am not only healthier physically, but emotionally and mentally. I pay attention to how my body feels because now, I can tell when it’s not in its best shape. I know I need to reign it in by the way my jeans fit. I know I need to add more vegetables back into my diet by how hard I can go when I work out. And I know when another round needs to happen because my body is asking for a refresh.Yes, Whole30 is hard. But those 30 days just may change your life. They definitely changed mine.Explore Bon AppétitHealthyishHealthyTrendsessayRead MorecultureThe Keto Diet Crushed My Soul But Taught Me One Good ThingBy Molly Guinn BradleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Emily Cappiello"]}