{"id": "300d45649f282587710439be9bef4228", "url": "https://www.bonappetit.com/recipe/tie-dye-butter-cookies", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Tie-Dye Butter Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueTie-Dye Butter CookiesBy Rick MartinezNovember 19, 20194.6(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle Gatton, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintDid you hear? Tie-dye is back. But now it’s not just that grimy T-shirt your friend who still follows Phish will never wash. It’s couture. And thanks to Rick Martinez’s so-very-2020 natural-dye Swirl-n-Dip method, it’s also edible. Best of all? The butter cookie that acts as your canvas is extremely simple to make (like, six ingredients simple), so you can spend most of your time on the fun part: unleashing your inner artiste. When you’re decorating, no need to panic if your first attempts don’t work out. Simply wipe off the failed glaze, let the cookie dry for about five minutes, and try again.IngredientsMakes about 24Cookies14Tbsp. unsalted butter, room temperature½cup (100 g) granulated sugar1¼tsp. kosher salt2large egg yolks2tsp. vanilla extract or vanilla bean paste2cups (256 g) all-purpose flour, plus more for dustingGlaze2cups (240 g) powdered sugar, divided6Tbsp. (or more) whole milk, divided2tsp. (or more) any color plant-based food-coloring powder*2tsp. (or more) second color plant-based food-coloring powder*¼tsp. kosher salt, dividedSpecial EquipmentAssorted 2\" cookie cuttersPreparationCookiesStep 1Using an electric mixer on high speed, beat butter, sugar, and salt in a large bowl, scraping down sides and bottom of bowl as needed, until light and creamy, about 3 minutes. Add egg yolks and vanilla and beat until incorporated, about 1 minute. Reduce speed to low, add 2 cups flour, and mix until incorporated. Dough will be semifirm but can be rolled out without chilling. If your kitchen is very warm and/or dough is sticky, pat it into a 1\"-thick disk, wrap in plastic, and chill 15 minutes to let firm up before rolling out.Step 2Place a rack in middle of oven; preheat to 350°. Roll out dough on a lightly floured sheet of parchment paper, dusting with more flour as needed to keep dough from sticking, to about ¼\" thick. Punch out shapes as desired with lightly floured cookie cutters and transfer to 2 parchment-lined baking sheets, spacing 1½\" apart. Pat scraps into a 1\"-thick disk, wrap with plastic, and chill 10 minutes if soft.Step 3Bake 1 sheet of cookies, rotating halfway through, until edges are golden brown, 10–15 minutes. Let cookies cool 10 minutes on baking sheet, then transfer to a wire rack and let cool completely. Bake remaining sheet of cookies, then repeat process with remaining dough.Step 4Do Ahead: Dough can be made 1 month ahead; wrap tightly and freeze. Cookies can be baked 2 days ahead; store airtight at room temperature.GlazeStep 5Whisk 1 cup powdered sugar, 3 Tbsp. milk, 2 tsp. food-coloring powder, and half of salt in a small bowl until no lumps remain. Glaze should be the consistency of heavy cream; add more milk if needed. For a deeper color, whisk in more powder 1 tsp. at a time until desired color is achieved; adjust with milk if needed. Repeat with second food-coloring powder, remaining salt, remaining 1 cup powdered sugar, and remaining 3 Tbsp. milk, adjusting intensity of color as desired.Step 6Spoon 1 tsp. first glaze in the center of a small plate. Drizzle 1 tsp. second glaze over the first and use a toothpick to slightly swirl colors together; don’t go overboard. (If you want to decorate larger cookies, add 1 tsp. glaze to plate for each additional inch.)Step 7Gently press the top of a cookie into glaze, then lift up and allow excess glaze to drip back onto the plate. Using a toothpick, pop any air bubbles and swirl colors more if desired. Transfer to a wire rack set inside a rimmed baking sheet. Repeat with 2 more cookies, adding ½ tsp. of each color of glaze to plate before each cookie is dipped. The glaze will lose its swirly effect at this point. Clean plate and repeat process, decorating cookies in batches of 3 until all cookies have been glazed. Let sit until glaze is set, at least 2 hours.Step 8Do Ahead: Cookies can be glazed 1 day ahead. Store tightly wrapped on a rimmed baking sheet at room temperature.Step 9*Cooks Note: If you want to use regular liquid food coloring, whisk 1 cup powdered sugar, 2 Tbsp. milk, and a pinch of salt in a small bowl until no lumps remain. Add food coloring drop by drop, stirring to incorporate, then thin glaze if needed with 1 tsp. milk at a time until it reaches the consistency of heavy cream.How would you rate Tie-Dye Butter Cookies?Leave a ReviewTell us what you thinkReviews (29)Back to TopTrianglethese are my go-to christmas decorating cookies. i finally ditched the always-too-sweet, never-that-enjoyable sugar cookie recipe that everyone wants to ice and have been making these each christmas. the icing is easy to pipe or dip, and the flavor balance is perfect. i add a dash of cinnamon and cardamom to the dough and it really puts these cookies over the top. could not recommend more!Jack A. Wheaton, IL12/24/2021@ Anonymous from N Carolina: I had the same question as you about the white icing. But then I watched the video linked to below and saw that Rick used multiple colors for his, and left some glaze without food coloring for the white. Watch the video— I think it will help. And have fun! Bon cookie!Audra B.Seattle, WA1/23/2021I made these with my 4 year old for 4th of July using red, white and blue glaze. Turned out delicious. Loved the no chill dough! She loved making the tie dye design with the glaze. Will definitely put this one in the cook book! Thanks!dlblackwell87Everett,WA7/1/2020I baked these cookies all Memorial Day weekend. The first time I made these they turned out beautiful and delicious! Decorating the cookies was so much fun and since I didn't plan ahead and only had gel food coloring on hand, that's what I used. The second time, I baked these cookies I made the mistake of using the flour I was storing in my freezer. It was a huge oops and resulted in my cookie dough never forming. Made a great cookie dough snack but felt a dumb for not realizing sooner about my flour mistake. This third time I attempted to make these cookies, I was at a loss for why my dough wouldn't form. Any help would be greatly appreciated. Thanks for the recipe Rick!  Leslie MarianaOlathe, KS5/28/2020This is a question rather than a review. From the pictures it looks like there is also some white glaze in the background, but I don't see this in the directions. Did those of you who tried this recipe just use 2 bright colors or did you also use white? Thanks\nAnonymousNorth Carolina4/19/2020I had dreams of moving to a small mountain town and opening my own bakery. Then I tried to bake these cookies. Other reviews described them as \"fun and easy\" which reminded me of myself in my early twenties. I just had to give them a go. \n\nI'm not sure where I went wrong. I'm really not. But my cookies were crumbly, the glaze was runny, and ultimately, my best friend's birthday was ruined. If you want to upset your friends and dash your dreams then I'd recommend trying to bake these cookies. \n\nI'm giving these three stars since the other reviews are glowing and apparently I'm the only moron here, so this was obviously user error.\n\n\ncarlythebestbakerToronto4/8/2020So fun to do with kids!! Maddie BergeronConnecticut 4/7/2020Question: Can you substitute heavy cream for the whole milk?InfoBabeTexas1/15/2020These cookies are nothing short of phenomenal — the perfect combination of buttery goodness with the right touch of savory thanks to the salt in the recipe. When you bite in, you get the satisfaction of the initial 'snap' with all the chewy goodness waiting inside. Loved the glaze (with and without food coloring), it adds just the right amount of creaminess. I would recommend letting the dough chill for a bit in the fridge, I found it to be way more manageable. AnonymousNew York City12/31/2019Made this for our cookie day and it was fabulous!\n- Rebecca AndersonAnonymousFredericksburg, VA12/30/2019I have to give credit where credit is due - these cookies are so fun.  I made a batch of the glaze and made my own sugar cookies and choc. sugar cookies, but the decorating idea was fantastic.  We had a holiday party at our office and I set it up like a kids birthday party, and the team had so much fun making tie dye cookies and being kids again.  Thanks Bon Appetit!AnonymousStaten Island, NY12/30/2019Had trouble getting the dough to a workable temperature - too hard after chilling but swiftly became too soft as it came to room temperature, leading to imperfect cookies that stuck to the cutters. Next time I'll just use this decoration method on my regular sugar cookie recipe. I will note that I used regular gel food coloring rather than spending all that money on food-based food coloring, and it worked perfectly. AnonymousNew Orleans12/29/2019Ridiculously delicious sugar cookies. Good snap with cracking in half or a bite and a delicious sweet, salty buttery flavor. Tie dye decoration is easy as can be. I used the “neon” mccormick food coloring very easily. 10/10 will be my go to sugar cookie recipe and the tie dye decoration just makes it 10000% easy and beautiful!AnonymousBirmingham, AL12/25/2019Super easy and quick, and flavor + texture is perfect -- great if you want/need yummy cookies ASAP. Instead of doing tie-dye icing (I'm not a fan of vanilla-iced cookies), I dipped the cookies in melted semisweet chocolate once they were cooled, and they turned out awesome!youvebeeneatonDC12/25/2019Honestly, I’m not great at baking, and my cookies ALWAYS spread, no matter how much I chill them. But these (which I only chilled for about five minutes after cutting out shapes) turned out perfectly. Perfect shape, perfect color, and perfect taste. I’m still in awe just a little, and I’ve even convinced my family to use this recipe for Christmas cookies instead of Ye Olde Betty Crocker sugar cookie mix... a pretty big deal!abigailgr3Raleigh12/24/2019Explore Bon AppétitCookieDessertAmericanNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}