{"id": "300e40f3f4c1eef91aa7ce5ea031595b", "url": "https://www.bonappetit.com/recipe/mushroom-farro-soup", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Mushroom-Farro Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueMushroom-Farro SoupBy Ali Slagle March 16, 20214.7(53)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintHere’s a soup for nights when you feel like lighting candles and even washing your face—but won’t change out of sweatpants. It’ll remind you of mushroom-barley soup, albeit a tangy, salty, bright, bewilderingly rich version that comes together in under an hour. Multiple umami-heavy ingredients (browned mushrooms, soy sauce, and a Parmesan rind) work together to create a deep, savory backdrop that might otherwise take lots of simmering time (or meat) to develop. Parmesan rinds are always good to have around: Freeze the waxy rind of spent wedges for unleashing salty-cheesy oomph to broths—or just cut the rind off the wedge you’re currently working through. Nutty farro and still-crunchy celery add good bites of texture to the soup, while lemon keeps it from being snoozy. For a creamier soup, stir an additional ¼ cup finely grated Parmesan into the pot, or top bowls with a poached egg.Ingredients4 Servings3garlic cloves, coarsely chopped3Tbsp. extra-virgin olive oil, plus more for drizzling1large shallot, coarsely chopped1lb. mixed mushrooms (such as crimini, shiitake, oyster, and/or maitake), cut into bite-size piecesKosher salt, freshly ground pepper1oz. Parmesan, finely grated (about 1 cup), plus rind⅔cup semi-pearled farro3Tbsp. (or more) low-sodium soy sauce4celery stalks, thinly sliced, plus any leaves coarsely chopped1Tbsp. fresh lemon juiceCrusty bread (for serving)PreparationStep 1Heat garlic and 3 Tbsp. oil in a large Dutch oven or other heavy pot over medium until oil around garlic is sizzling, about 1 minute. Add shallot and mushrooms, season with salt and pepper, and cook, stirring occasionally, until mushrooms are browned, 10–15 minutes. (Initially, pot will look dry, then very wet before mushrooms start to brown.)Step 2Add Parmesan rind, farro, soy sauce, and 6 cups water to pot. Scrape up any browned bits stuck to bottom of pot, season with salt and pepper, and bring to a boil over medium-high. Reduce heat and simmer until farro is al dente, 15–20 minutes.Step 3Add sliced celery to pot and simmer until slightly softened and bright green, about 3 minutes. Remove pot from heat; add lemon juice. Taste and season with salt and/or more soy sauce if needed.Step 4Divide soup among bowls and top with finely grated Parmesan and celery leaves. Season with more pepper and drizzle with oil. Serve with bread alongside.How would you rate Mushroom-Farro Soup?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis was wonderful!  I've made it twice now and it was good both times, just as the recipe says except I didn't care for the parmesan cheese on top (however, the rind is important!).  The celery leaves on top make it very fresh and crunchy.  MarySt. Paul, MN2/21/2022This was good, not great.  I added some extra spices and swapped in some chicken broth but just meh.  ErinLos Angeles, CA2/16/2022This soup is incredible! I also swapped out water for veggie broth. Super hearty & perfect for a cold winter night AnonymousChicago1/31/2022Used vegetable broth instead of water, otherwise made as is. Such a good vegetarian comfort soup. 5/5 stars! AnonymousColumbus, OH1/20/2022All I can say is OMG!  This soup was amazing!  Aromatic and the chewy texture was so pleasing.  It keep me full for hours!MariaBethpage, NY12/10/2021This is such a satisfying soup. I used pearled barley instead of farro, and it took a few more minutes to cook than the time listed for farro. I used a mix of shiitake and oyster mushrooms and diced them finely. I totally forgot to add the lemon but we didn't miss it. I can't wait to make this again!Rachel Richland, WA10/19/2021Made this on the very first day there was a chill in the air. SO good and had big French onion soup vibes. Agree with other reviewers: the parmesan rind is the key to the incredible depth of flavor! AnonymousChicago9/4/2021A flavorful, one-pot, meatless meal. I used a quart of low-sodium veggie broth plus ~2.5 cups water and added just a little bit more farro. Otherwise prepared it according to the recipe. Would easily serve six. The parmesan rind is the key to the whole thing. KaraTexas6/2/2021So warm and hearty! Used shitake and crimini mushrooms, but would have been nice to cut them into smaller pieces. Also substituted in some leftover beef broth with the water (although I would NOT recommend boxed broths).\n\nSince this was a meal prep I did for the week (this made about 8 servings) I would store the liquid separately from the toppings since the farro continued to soak up water well after it had finished cooking.KarinaBROOKLYN, NY5/3/2021Wow! I was really impressed with the depth of flavor from this soup. I used a mixture of Portobello, oyster and shiitake mushrooms and used chicken stock I already had instead of plain water. I thought it was amazing! I did adjust the salt to taste, otherwise it would have been too salty with the chicken stock. It also held up nicely throughout the next two days as well. Mariam A.Texas4/26/2021Delicious and better IMO without the lemon at the end. Maybe serve with a wedge instead so people can choose it with or without. When I made it a second time a did twice the amount of farro and I did 1.5lbs of mushrooms to make it less watery, and more stew like. AnonymousVermont4/26/2021Wow, I am shocked at the depth of flavor and textures of this beauty. Absolutely lovely!Kate YNederland, CO4/19/2021I've made this soup twice since coming across the recipe. Not only does it all come together very quickly, the flavor is phenomenal and complex. Adding the parm rind takes this soup to a whole other level. I plan on adding it to my recipes I keep on hand! 10/10!   Natalie Cruz Springfield, MO 4/1/2021This is delicious, quick & easy to make. The soy and mushrooms give such an earthy flavor lightened by the lemon juice and celery. Definitely a keeper!Nancy MNarragansett, RI3/30/2021First I followed the recipe exactly..very good. Then I reconstituted dried porcini as one of the mushrooms, and used that water plus veggie stock instead of plain water. Bundled 4 sprigs thyme with 1 sprig rosemary, threw in a couple bay leaves and 1/4 tsp cumin seed..out of this world!!JonGloucester, MA3/28/2021Explore Bon AppétitSoupSoups and StewsMushroomVegetableFarroRice & GrainsWeeknight MealsEasyMainVegetarianNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Ali Slagle"]}