{"id": "30229f032884c8b22d3580674b6636c4", "url": "https://www.bonappetit.com/story/its-that-simple-rice-porridge", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "The 4-Ingredient Rice Porridge I Make When I'm Too Sick to Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe 4-Ingredient Rice Porridge I Make When I'm Too Sick to CookThat's the maximum number of ingredients I'm willing to deal with when sick.By Carey PolisMay 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.I'm always impressed with some of the culinary creations my colleagues manage to cook when they're sick. Garlic broth is practically a religion in these parts, and while it's not a difficult dish to make by any means, it always feels beyond my capacity when I'm laid up—plus, I never seem to have fresh herbs on hand when I'm moping around with a box of tissues glued to my left hand. So when sickness saps all will and ambition, I rely on something even easier when I muster the energy to drag myself to the stove: a congee-like rice porridge that is soothing, nourishing, and requires the absolute minimum of physical exertion.First, I combine about 1 cup of whatever white rice I have in my pantry with around 5 cups of water (or stock if you've got it!) and a star anise pod. (I always have a stash of star anise handy for this purpose, but if you don't, no big deal—the porridge will still be delicious without it.) You're using way more liquid here than you would if you were making a fluffy pot of rice. I bring the whole thing to a boil, drop it to a simmer, and cook, stirring every once in a while, until the rice is essentially mush—I want the grains of rice to almost dissolve to create a thick, starchy porridge. The end product should be soupy. When I taste a few grains and the consistency reminds me of thin oatmeal, I know it's ready. This usually takes anywhere from 20 to 40 minutes, depending on the type of rice I used, and whether I was paying attention to the heat under the pot, and whether or not I have any real sense of time in my compromised state.Then I spoon the porridge into a bowl and add about a teaspoon each of fish sauce and soy sauce, then taste and add more of either until the rice reaches my desired level of salt and umami; I find that I sometimes need to add a lot if my nose is stuffed and my palate is shot. I usually just stop there—I'm sick after all!—but a pile of sliced scallions mixed in is a welcome addition, as is some chile oil if I need to sweat it out a bit. This porridge is a blank canvas, soothing on its own but open to whatever embellishment I have strength for.Pairs best with a cool side of Nyquil, an old, extra-soft sweatshirt, and eight episodes of 30 Rock. Get well soon!If you're feeling slightly more ambitious, this soup should do the trick:Chicken and Rice Soup with Garlicky Chile OilThis comforting, fried garlic-topped chicken soup tastes like it took hours to make but comes together in a flash.View RecipeExplore Bon AppétitIt's That SimpleBasicallyRicePorridgeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-16", "author": ["Condé Nast", "Carey Polis"]}