{"id": "302f5485c977061e284c809cae751906", "url": "https://www.bonappetit.com/story/andy-baraghani-cooking-rules", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Your Yogurt Better Be Full Fat—and More Essential Cooking Rules From Andy Baraghani | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour Yogurt Better Be Full Fat—and More Essential Cooking Rules From Andy BaraghaniOur senior food editor wants you to stay away from the 2-percent stuff.By Andy BaraghaniSeptember 25, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis month, we're doing a mini series on our podcast. Each of the Bon Appétit Test Kitchen editors will be sharing their top 10 cooking rules: the techniques they swear by, the ingredients they can’t live without, and the mindsets that keep them going. This week: the senior food editor who sprinkles a ton of herbs across all of his dishes, Andy Baraghani.1. Group like tasksThis is all about organization and getting you set up properly in the kitchen. If you are making an apple pie, peel all the apples first, then slice them. Don’t peel and slice each one before moving on to the next. Doing it by task will make you become a faster, more efficient cook.2. When it comes to dairy, go full fat. Period.There’s a reason we always say this to our readers and viewers, but I still feel like a lot of people are buying the 1 percent, 2 percent, or non-fat versions of things like yogurt, milk, and cottage cheese. There is just no replacement for full-fat dairy, as the versions with a lower amount will lack flavor and have a chalky texture.3. Skip boxed or canned stock when making soups, braises, or stewsAt this point, I’ve actually stopped calling for stock in any of my recipes. If you’re not making it yourself (or buying a really, really good version from somewhere you trust, like a butcher shop), it just doesn’t taste good. Water that you’ve doctored up yourself does the trick perfectly.4. Know your oilsExtra virgin olive oil can be robust and peppery, other times fruity and smooth. Nut and seed oils are generally quite forward and usually are best to finish foods with. Neutral oils, like canola, vegetable, sunflower, and peanut have little to no flavor.You better believe those green beans were blanched in heavily salted water.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen Kaminski5. Blanch or boil vegetables in heavily salted waterI do ¼ cup Diamond Crystal kosher salt to 2 quarts water. You’ll not only bring out the the flavor of the vegetable, but you’ll enhance the color, too.6. Please grate all cheese yourselfYes, pre-shredded cheeses are convenient, but they often lack flavor. Plus, stabilizers are often added to keep the cheese from clumping together. But there is one exception: grated Parm from a good-quality market, since it was probably grated that day!7. Two acids are better than oneVinegar on its own can be abrasive, but combine it with some citrus juice or zest, and they balance each other out. What’s more, you shouldn’t be thinking of acid as only those two things. Yogurt, buttermilk, and tamarind all will add acid to your dressing, your braise—anything! Get those in the mix, too.8. Add hard herbs early; save tender herbs for the endUsing harder herbs (bay leaves, thyme, rosemary, sage) early in the cooking process will infuse the dish with the help of the heat. Softer, tender herbs (parsley, cilantro, basil) should be added toward the very end so that they stay raw and bright. While there are sometimes exceptions, that’s pretty much the rule.This miso pesto ramen is not your classic Italian version, but it’s just as addictive.\nPhoto by Alex Lau9. Have a secret weaponReally what I mean is a signature that you can refine and refine. For example, people can recognize my food because it’s acidic and there are always a lot of herbs. I also like variations of savory toppings and sprinkles, riffs on classic sauces, like miso pesto and tahini ranch. I think of those things as my secret weapons.10. When in doubt, use a white plateI’ll admit, I get very weird about the way I think food should be plated. It’s the last thoughtful thing you do before you sit down and eat, or send the dish out to your guests. Make it look good. That means put it on a round (white) plate with little to no lip.Listen to the full discussion on the BA Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitTest KitchenRead MorecultureIt’s Time to Stop Using Old Spices—and More Essential Cooking Rules From Brad LeoneBy Brad LeonecultureOver-Salt Your Cookies—and More Essential Cooking Rules From Molly BazBy Molly BazcultureChopsticks Are the One Tool You Actually Need Around—and More Essential Cooking Rules From Chris MoroccoBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-25", "author": ["Condé Nast", "Andy Baraghani"]}