{"id": "302fc9b5ba35944b4d9fe75f5b07c6b7", "url": "https://www.bonappetit.com/story/2020-year-that-changed-restaurants", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Coronavirus Nearly Killed the Restaurant Industry. Can It Be Restored? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020The Year That Changed Restaurants—and What Happens NextThe restaurant world reflects on the year that turned everything upside down, and how to turn it around.By Ashlea HalpernDecember 1, 2020FacebookTwitterEmailPhoto by Peden + MunkFacebookTwitterEmailThe numbers are astounding. The food and beverage industry accounted for one in four jobs lost during the pandemic—more than any other sector of the economy. Without additional assistance, tens of thousands of bars and restaurants could shutter, taking up to 7 million jobs with them. That’s the barista who knows our order before we’re awake enough to ask for it, the busser whose smile improves a lousy day, and so many others behind the scenes. And yet, there’s hope. Restaurants have shown creativity and resilience, becoming movie theaters, drive-throughs, grocers. The industry banded together to push the Restaurants Act through Congress, which, if passed, would offer a $120 billion life preserver. Chefs are doing backflips to feed communities in need while also looking to the future. What the industry will look like on the other side is unknown. But if these folks have their way—and if we, the diners, support them—it’ll be smarter, more nimble, and a heck of a lot more egalitarian. We’ve been following how the restaurant industry has been coping with the Coronavirus throughout the year. For more reflections from the people on the inside, read our Restaurant Diaries series. Illustration by Joana Partyka“We are an army of millions, and people need to go back to work to feed America.” José Andrés, chef and World Central Kitchen founder: “I closed two of my restaurants. Why? Because it was the smart thing to do. I don’t feel defeated; it’s part of life. There’s an old saying, ‘Success is going from failure to failure without losing enthusiasm.’ We are in for a big fight in the months ahead. Let’s hope the government gives us an injection of capital. We are an army of millions, and those people need to go back to work to feed America. Restaurants have always been a place to break bread, a place to come together. Sometimes it’s not even about the food. It’s about restoring our bodies and our faith in each other and the idea that together we can get through this.”How World Central Kitchen Helps: WCK’s Restaurants for the People program pays local restaurants to cook for vulnerable communities, which in turn helps keep them afloat in a crisis. WCK has partnered with more than 2,400 establishments during the pandemic to serve those in need.“You have to adapt or die.”  Eric Vernon, The Bar-B-Q Shop, Memphis: “We’re an old-school restaurant. We didn’t ‘do’ online. I know half of my customers by name. Now you’re telling us we can’t get near ’em?! I said, If we don’t go online quickly, we’re going to die. There were nights I’d stay up till 2 a.m. on this computer, trying to figure out everything. It took 30 days, but now people can order food through our website. They don’t understand how much DoorDash and Grubhub charge a restaurant, but those orders helped us stay in business. You have to adapt or die.”“This is the end of the independent restaurant era.”Edward Lee, 610 Magnolia, Louisville, KY: “This is the end of the independent restaurant era, and I don’t know any chef in their right mind who feels hopeful right now. We have meal kits; we’re getting heaters. But at the end of the day, I’m on the Titanic, trying to throw out buckets of water to stay afloat. It’s the fluctuations that really hurt us. We rely on predictability for staffing, for inventory. Now we don’t have a clue. Some of it is COVID-related; some of it is protest-related; and some of it related to fears about eating out. Sometimes it’s a viral article on Facebook that affects consumer confidence.”Read more of Edward Lee’s reflections on the future of the industry here »“Regardless of what’s going on in the world, it doesn’t change my circumstance. I’m a line cook. I still have to make money and provide for my family. I don’t have the luxury of being scared or staying inside and complaining. Fear is a rich man’s game.” —Courtney Poitras, Red Rooster, NYC“There is pride and honor in this work. To not be able to do it is very difficult.”Louise Palmer, Send Chinatown Love, NYC: “Chinese New Year in February is when a lot of Chinatown restaurants started closing due to anti-Asian sentiment from the whole ‘Kung Flu’ notion. By the time stay-at-home orders went into place, many businesses were already operating at a loss. A lot of them didn’t qualify for the Payroll Protection Program because they’re very analog; it’s hard to quantify things. Or there were language barriers to accessing it. And because they are cash-only, they can’t use systems like Seamless. These mom-and-pop shops keep prices super low to support the affordable housing units and elderly people in the area. They’re feeding the community. For them to close, it’s one less option for someone who doesn’t have a lot of money to eat. For a lot of our merchants there is pride and honor in this work; they want to earn a living. To not be able to do that is very difficult.”“We’re seeing resourcefulness and resilience, and letting go of things we’ve been holding to.”Cristina Martinez and Ben Miller, South Philly Barbacoa, Casa Mexico, and People’s Kitchen, Philadelphia: “Our business has really thrived under these circumstances. We’re not like a boutique restaurant with a catered ambience. We’ve always had a good takeout model, and we’ve been able to use our creativity to adapt.Through World Central Kitchen and community partners, our People’s Kitchen has served more than 33,000 meals since March. We’re growing vegetables on 70 plots in South Philly; the produce goes into the free meals. It’s a way for us to engage in local movement building and progressive politics. We’re seeing positive change. We’re seeing unity, resourcefulness, and resilience, and letting go of some of the superfluous things we’ve been holding onto as a society. But the industry is in shambles. Now it’s a question of rebuilding it. We’re fighting for acknowledgment of undocumented workers in ours and connected industries like farming and fishing. We’re hopeful for change but also skeptical. There’s a long way to go.”Illustration by Joana Partyka“There’s a young energy out there, going ‘We need to change this.’”Food writer Ruth Reichl: “The virus exposed all of the underlying problems with the business model, with the way people are employed, with rents, and the whole way that restaurants have been operating in this country for the past five years. The idea that really successful restaurants didn’t have more than a week of wiggle room once the pandemic hit is really damning.We’re going to see an awful lot of independent restaurants close. There’s going to be hand-wringing, followed by a burst of creativity in two or three years, when the rents are cheaper. There’s a young energy out there, looking at the whole landscape, going ‘We need to change this.’ It’s time, you know? It’s time for the kind of abuse that happened in restaurants to end, including the disparity between what the front and back of the house make. That will all be reconsidered and we will come up with a new American model of how to run a restaurant in an equitable way. That can only be a good thing.”“This’ll give the industry an edge—like the phoenix that bursts into flames and comes back stronger.”Lena Sareini, formerly of Selden Standard, Detroit: “You know that flaming Elmo GIF? That’s 2020. I was furloughed for three months during the shutdown. When I went back to work, I was running the entire pastry department by myself. I felt so burnt out, I didn’t have time to be creative. So I resigned to give myself a mental health break and focus on what I actually want to do with my career. The unknown is terrifying, but things will go back to normal. This’ll give the industry an edge—like the phoenix that bursts into flames and comes back stronger.”“No one has given up. There’s a will to win.”Chris Kajioka, Senia and Miro Kaimuki, Honolulu: “Tourism is a huge, huge thing for Hawaii’s restaurant industry. The state’s reopening date was pushed back three times; 40 percent of people were unemployed. When we finally opened Miro Kaimuki in June, [my customers were] 100 percent local. We started making takeaway bentos inspired by longtime mom-and-pop shops—and selling 1,000 boxes a week. Though we weren’t doing the food we’d originally planned, we’re exposing our food to a wider range of people. You do what you have to do, right?What gives me hope is that no one has given up. Everyone has stayed very positive. There’s a will to win. This is as rock bottom as you can get, but if we can withstand it, I’m hopeful for the future. Restaurants are probably the most resilient industry in the nation.”“The government said we can only operate at 25 percent capacity. That’s not viable unless you charge four times what you charged before. Maybe the rents, taxes, or price structure need to change. I don’t know, but it ain’t working right now.” —Jonathan Waxman, Barbuto, NYC“We’re over trying to guess what’s going to happen. We’re putting our heads down and working.”Ann Redding and Matt Danzer, Uncle Boons, Uncle Boons Sister, and Thai Diner, NYC: “The future was bright. Uncle Boon’s was doing great and we were three weeks into opening our third restaurant, Thai Diner, when we were forced to shut down. Nobody saw it coming. We tried to negotiate with the landlord, because we can’t pay for real estate on a restaurant that isn’t open. But he wanted full rent, plus interest and late fees, and that was that. It also didn’t make sense to do delivery out of three places, so we hunkered down and did it out of one spot. We went from more than 100 employees to, like, eight overnight. That was our worst day ever. Nobody knew what was happening or how long the pandemic would last. Yet here we are now, and uncertainty continues to plague us. We’ve been focusing all of our energy on Thai Diner. We finally got into the rhythm of outdoor dining, but now that winter is approaching, the anxiety is creeping up again. Will people come? Twenty-five percent of our indoor capacity is 18.75 people. It’s not enough to survive. But we’re emotionally over trying to guess what’s going to happen. We’re just putting our heads down and working.”Illustration by Joana Partyka“I’m on Team Burn It Down and Create Something New.” Chef Irene Li, Mei Mei, Boston: “Restaurant people are used to throwing themselves at a problem until the problem goes away, but the situation we’re in is not one that can be solved with more hours or work.We were hoping to make 2020 all about employee and guest education. On March 9 we hosted a public event where we shared our profit-and-loss statement from 2019. The bottom line: It’s really hard to run a restaurant. And then it got a lot harder, like, one week later.We voluntarily closed Mei Mei a couple days before the state ordered it. In April we furloughed a number of employees and started doing takeout, groceries, and prepared foods. We launched a donor-funded initiative that delivered 40,000 pounds of groceries to immigrants and undocumented workers, and we started a GoFundMe to raise money for immigrant-owned restaurants.At the end of June, we laid off 60 percent of our staff, knowing that the ‘normal’ we were hoping to go back to was still pretty far off. It was one of the worst things I’ve ever had to do.Since then we’ve been focusing on virtual classes, takeout, and prepared foods. We’re also looking into creating consumer packaged goods like dumplings.But these are just Band-Aids. Before the pandemic, 30 percent of our revenue was catering—weddings, conferences, offices—and now that’s mostly gone. Even if we were crushing it with takeout, we wouldn’t be near our normal revenue.We’ve been fortunate to access PPP money and to have an Economic Injury Disaster Loan. We’ve received some grants. But we’re only doing about 20 percent of our pre-pandemic revenue. I’m like, ‘If we’re getting this help and we’re still screwed, what’s happening to people who aren’t able to access these resources?’Some people want to save restaurants and some want to burn down the system. The movement for Black Lives Matter highlighted many of the industry’s structural inequities. I’m on Team Burn It Down and Create Something New. Recently we started selling other companies’ products, like vegan baked goods from Karen Clarke. Sure, I could bake banana bread, but I’d rather support an Afro-Latina-owned business.Many pivots later, it is time for a leap. Whether it’s a grocery, a distributor, or an incubator, I’m letting go of the restaurant incarnation of Mei Mei so the essence of Mei Mei—our values, our commitment to community—can survive.”“Accept that life will throw things at you that aren’t fair.”Gregory Gourdet, Kann, Portland, OR: “Acceptance and gratitude are big words for 2020. Accept that life will throw things at you that aren’t fair—but be grateful for what you do have, and keep pushing. I plan on opening my own restaurant next year. It’ll tell the story of my culture—the Haitian-American diaspora—and offer a safe space for all. I want to do my part to help rebuild.”Illustration by Joana Partyka“Let’s talk through ways to use that anger toward something beneficial.”Gerard Klass, Soul Bowl, Minneapolis: “The year started on a high. Our hip-hop brunch launched; we were doing Black History Month events; and we hit sales records in early March. The downward turn happened quickly. Kobe Bryant passed away, then COVID-19 hit. All the restaurants in our food hall closed or furloughed staff within the first 36 hours. We told our amazing all-Black staff we’re going to stick it out and fight with them to stay open.A friend told me to start feeding first responders. But being African American, we already have a large urban community living at or below poverty level. There wasn’t anyone helping them. So we started the Food for Your Soul campaign to sponsor individually packaged meals for the elderly and families with kids. The phones were ringing off the hook. For every dollar we got in, 20 cents went to our staff and 80 cents went toward making meals. Soul food is medicine. And in an intense time like this, it was able to bring healing and comfort.Then George Floyd was murdered.It’s difficult to work in hospitality when you’re grieving. It’s hard to be a leader when all of your staff could be George Floyd. We had the resilience to stay open through COVID but closed after George to let our staff protest and grieve.I told them, it’s okay to be angry. Let’s talk through ways to use that anger toward something beneficial. I reminded my staff that there are still families in this city who need meals. So let’s own that. Not everybody can be on the front lines, marching and picketing. But those workers still need to eat.I’m more protective of my staff now. If there’s any kind of police interaction, I step in because I don’t want anything to get taken out of context. And I lean heavy into faith to give me peace. It’s challenging, but the mission is bigger than me. I’m just doing my length of the journey.”“The Latinos from the neighborhood have always been behind me. But when the foodies come—that’s when I think, Dang, I’m doing something good. They come in droves, bring their own tables and chairs, and finish everything. If it wasn’t for the influencers, we probably would have folded.” —Walter Soto, El Ruso, Los Angeles“We’re walking into a buzzsaw, but we have to keep moving.”BJ Lieberman, Chapman’s Eat Market, Columbus, OH: “I definitely have times where I’m like, ‘What the hell are we doing?’ We’re walking into a buzzsaw, but we have to keep moving. My chefs and managers moved here from out of state; they signed leases. I can’t just be like, ‘Hey, guys, remember that whole thing we were doing? We’re not doing it anymore.’ If it wasn’t for my staff, I would have delayed our opening. But people need a paycheck. Some staff moved here from out of state; they signed leases. I couldn’t pull the plug. And we’re not gonna survive doing to-go; we have to open indoor dining. How do we keep people safe and stay afloat? We decided a tasting menu was the best way to limit guest-server interaction. We’re at about 20 percent capacity, but still, I’m looking at the tables, thinking they’re too close, even though they’re more than six feet apart.”“We cannot wait for landlords or politicians. America has to do better.”Sarah Kirnon, Miss Ollie’s, Oakland, California: “We’re serving food again, but we’re not going back to being a regular restaurant. We’re hoping to launch a nonprofit to teach kids in the community about the food industry, foraging, and sustainability. What gives me hope are the conversations I’m having with peers who are like, ‘We have to do something.’ We cannot wait for landlords or politicians. America has to do better.”Explore Bon AppétitHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Ashlea Halpern"]}