{"id": "3038bbf2d99666aa8e6ecda5ff771559", "url": "https://www.bonappetit.com/recipe/salted-caramel-chocolate-tart", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Salted Caramel–Chocolate Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSalted Caramel–Chocolate TartBy Claire SaffitzFebruary 13, 20184.5(56)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintYou can use a 9\" or 10\" tart pan, but the layers will be thinner in the larger pan. We also found that Morton kosher salt won’t dissolve completely in the caramel filling, so use Diamond Crystal for the best results for this tart recipe. Then, a generous sprinkling of flaky sea salt before serving brings out the flavor of the chocolate and tempers the sweetness of the caramel. This is part of BA's Best, a collection of our essential recipes.Ingredients8 servingsCrust⅓cup unsweetened cocoa powder (we like Guittard’s Cocoa Rouge Cocoa Powder Unsweetened)2Tbsp. sugar½tsp. Diamond Crystal kosher salt1⅔cups all-purpose flour, plus more for surface¾cup (1½ sticks) chilled unsalted butter, cut into pieces1large egg yolk3Tbsp. chilled milk or waterFilling1½cups sugar⅛tsp. cream of tartar6Tbsp. chilled unsalted butter, cut into pieces⅓cup heavy cream1tsp. Diamond Crystal kosher saltGanache4oz. semisweet chocolate (do not go above 70% cacao), finely chopped½cup heavy cream2Tbsp. unsalted butter, cut into small piecesFlaky sea saltSpecial EquipmentA 9\" or 10\" tart pan with removable bottomPreparationCrustStep 1Whisk cocoa, sugar, salt, and 1⅔ cups flour in a medium bowl. Add butter and toss to coat. Using your fingers, smash butter into dry ingredients until it nearly disappears (you shouldn’t see any large bits) and mixture holds together when squeezed—you’re working it more than you would pie dough. Make a well in the center and add yolk and milk. Using a fork, gradually incorporate flour mixture until you’ve got a shaggy dough. Knead a couple of times in bowl until no dry spots remain and dough is smooth. Flatten into a ¾\"-thick disk, wrap tightly in plastic, and chill until firm, about 2 hours. (You can make the caramel filling during this time.)Step 2Preheat oven to 350°. Let dough sit 5 minutes to soften slightly. Roll out on a lightly floured surface to a 14\" round about ⅛\" thick, dusting with more flour as needed to prevent sticking. Lift dough on one edge and throw a pinch of flour on surface. Then we’ve got a trick from the School of Mary Berry to prevent cracks and tears in the dough: Slide the removable bottom of tart pan under dough, positioning it roughly in the center, like below. (Pro tip: Use a bench scraper in the first step for easier lifting.)Bruce HutchisonStep 3Fold the edges of the rolled dough inward toward the center, working all the way around so it rests on top of the tart pan bottom. Then lower the bottom into the tart pan.Bruce HutchisonStep 4Unfold the edges so they gently slump against the sides of the tart pan and the excess dough is hanging over the edges. Press dough firmly into bottom of pan with floured hands, then use a straight-sided measuring cup to firmly press sides of dough into grooves and up sides of pan. Use a rolling pin over top edge of pan to shear off excess dough:Bruce HutchisonReserve dough scraps for patching any potential cracks later. Prick bottom of dough all over with a fork and chill in freezer until very firm, 10–15 minutes.Step 5Place tart pan on a rimmed baking sheet and line with a sheet of parchment paper or foil. Fill with pie weights or dried beans and bake until edges of crust are set and starting to look dry, 12–15 minutes. Carefully lift parchment with weights. Patch any visible cracks with reserved dough. Return crust to oven and bake until firm and dry all over, 18–22 minutes. Transfer to a wire rack and let cool.Step 6Do Ahead: Dough can be made 2 days ahead; keep chilled. Crust can be baked 1 day ahead. Store tightly wrapped at room temperature.FillingStep 7Bring sugar, cream of tartar, and ⅓ cup water to a boil in a large saucepan over medium-low, stirring with a heatproof spatula until dissolved. Cook, swirling pot often but not stirring, until mixture turns deep amber and wisps of smoke rise from the surface, 8–10 minutes. Remove caramel from heat and immediately stir in butter a piece at a time until smooth (be careful; mixture will sputter). Gradually stir in cream, then add salt. Transfer caramel to a heatproof measuring glass (you should have about 1½ cups). Let cool until warm.Step 8Pour caramel into cooled tart shell. Chill until caramel is set, at least 1 hour.Step 9Do Ahead: Caramel filling can be made 3 days ahead; cover and chill. Microwave in 20-second intervals, stirring in between, just until pourable. Caramel-filled tart can be made 1 day ahead; once it’s set, cover and keep chilled.GanacheStep 10Place chocolate, cream, and butter in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water). Stir with a heatproof spatula until ganache is smooth, about 5 minutes. Let cool until thickened enough to hold an indentation from a spoon—if it’s too warm, it won’t hold its swirls.Step 11Remove tart from refrigerator and scrape ganache over caramel. Using a spoon, gently work ganache over surface, creating decorative swooshes and swirls. Sprinkle with sea salt; let sit until ganache has lost its sheen, 10–15 minutes.Alex LauStep 12Do Ahead: Tart can be assembled 1 day ahead. Chill until ganache is set, then cover loosely. Let sit at room temperature 15 minutes before slicing.How would you rate Salted Caramel–Chocolate Tart?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleThis is such a keeper and worth every calorie! I made this for Christmas Eve, following the make ahead notes which made it super easy for entertaining! I did use coarse kosher salt for the inside but I simply ground it well with a mortar and pestle first so it dissolves rather than buying a different salt. SUCH a keeper my sister and mom both needed the recipe!Jenna LeighFort Lauderdale 1/2/2022I made this last Thanksgiving and received high praise from everyone. It's a restaurant-level dessert! There are enough resources from Bon Appetit (recipe, videos, helpful reviews) that make it doable, even for the non-experts out there. I hope to make it again this year! JillianChicago, IL10/19/2021Fantastic tart! Well received by my taste testers. I've been keeping it in the fridge to store. Will definitely make again. Only part that was tough was making the caramel. The video doesn't show the color of the caramel when she takes it off the heat. Mine was a minute or two overdone because I kept looking for wisps of smoke and couldn't see any. Don't rely on that as your benchmark. Take it off when its a medium golden brown.BeccaCleveland, OH12/2/2020This tart is awesome!!! \nI didn’t have any difficulty making it and was quite easy to follow. \nThe pastry added a nice bitterness to cut through the sweet filling. Definitely be careful with it tho cause it might need a bit of patching up after the blind bake but it held up pretty well\nThe caramel was beautiful and I personally added a bit more salt than the recipe stated cause I love the sweet n’ salty combo. And next time I might caramelise it a bit longer so it has a deeper flavour.\nThe ganache adds a nice topping, however if it’s a hot-ish day, I’d probably recommend not using the entire 1/2C of cream so you could probably get away with using 1/4-1/3C since I added a bit more chocolate to make it set better. \n\nI definitely recommend chilling the tart in the fridge to make everything set a bit better. The caramel had a nice oozing and chewy texture which wasn’t rock solid or stuck to my teeth, same goes for the ganache.\nChilling it also helps the caramel not ooze out too much when cutting into it since that happened when I got the first slice.\nHowever I also put some baking paper on the cut sides to prevent it from oozing out even more. \n\nIt’s a very decedent dessert but it didn’t kill me with sweetness so I would definitely make this again! Everything was balanced perfectly.Aleana AKL, New Zealand12/1/2020I've made this tart twice. The first time was years ago. I had never made caramel before and i definitely didn't cook it long enough so it never quite set up. It oozed out everywhere, but I brought it to work and it was gone before lunch. haha This year I made it again, but for my dad's birthday. It was a huge hit. Very delicious. I didn't have Diamond Crystal salt so I used celtic sea salt. I would like to try everything again with DC salt to see if it disperses better in the caramel. All in all, a very delicious and rich desert with wonderful candy bar textures. Will make again! Baking & BarbellsOverland Park, Kansas11/23/2020for those who have made this. Could you freeze it?AnonymousNY11/7/2020This tart is next level.  I made this for a friend's birthday and it was a hit, even with kids (who asked for extra slices).  The video was incredibly helpful and the only change I made was using dark chocolate chips (50%) instead of semi sweet chocolate (was still perfect). It's decadent and the perfect showstopper. PanickedPotatoNew Brunswick9/11/2020What a decadent dessert! I recommend mixing the dry ingredients with the butter in a food processor and then dumping it into a bowl before adding the yolk + milk. This makes the dough worlds easier! Also, beware the dessert is VERY (and I mean EXTREMELY) rich so serve in smaller portions than you'd think; this easily serves 10 people I'd say. riceanyoneWichita, KS8/10/2020Ever since I saw Carla’s video, I have wanted to make this, and I finally did - to rave reviews!!  My first round of dough was a failure - I know it is a drier dough but mine was way to dry. I added another tablespoon of water for round 2 and t worked out great.  Will make again for Christmas - truly decadent and delicious!Toronto7/19/2020can i use an 11 inch tart panraerfgfort mcmurray7/14/2020Everyone loved it but I’ll bill it as a candy bar next time!!  Definitely needs to be served in tiny slices with coffee and maybe some whipped cream to cut the sweet. I ended up using a pastry blender on the crust. Blending by hand was taking too long and hurt my hands. Next time I’m using the food processor.  I too had to google caramel making to reassure myself I was doing it right. It took the sugar a long, long time to melt then caramelize.  When left out during the party, the cut edges of the finished tort oozed so I’ll try putting it back in the fridge more quickly and packing the cut edges with foil Like the other reviewer suggestedAnonymousNew Orleans 6/27/2020WOW! Perfection! New family favorite! Watch the video - I had to repeat the caramel twice because the sugar wasn't melting and Carla's tip on the video were helpful. \nI also double the chocolate ganache. I used less caramel and more chocolate. \nLastly - the crust looked intimidating, but it wasn't. You can use your fingers to fill in any gaps and it looks fine. Thank you BA - you are truly the best!!!AnonymousSacramento6/23/2020Decadent tart, everyone loved it! I found it quite straightforward to make and assemble, particularly by making the crust and caramel a day ahead of time. The crust came together well and wasn't too sweet, which is a nice contrast to the filling. To store the tart, after we ate a couple slices, I pressed wax paper against the cut edges to prevent the caramel from oozing out too much  - worked like a charm!AnonymousCanada5/15/2020The caramel is delicious, but serving it in tart form is a bit much. Basically a wall of sweet that the ganache can’t really cut through. The crust was disappointing and a little flavourless (I’ll chalk that up to the quality of cocoa I had available). I ended up scraping the filling out of the tart and whipping it as an icing for a cake. I’ll make the caramel again to serve over ice cream though! Anonymous5/8/2020I had 2 issues: \n- After refrigerating for a day, I let sit it out at room temp, cut out 1 piece, and then put it back in the fridge. The caramel oozed out of the tarte while in the fridge!\n- The crust edges shrunk a lot in the oven, so they weren't as tall and I was concerned that the filling wouldn't fit.  I had to top-up the sides mid-bake.Anonymous4/14/2020Explore Bon AppétitTartDessertChocolateOther IngredientsBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}