{"id": "30426705647acb7727dd751e1586ef9f", "url": "https://www.bonappetit.com/story/amirah-kassem", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "How Amirah Kassem Went From Fashion to Sprinkle Explosion Cakes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFrom Fashion to Sprinkle Explosion Cakes: How Amirah Kassem Built Her Baking EmpireAnd why she makes dreams and not goals.By Ali FrancisMay 31, 2019FacebookTwitterEmailPhotograph by Ali MittonFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Amirah Kassem, owner and founder of Flour Shop bakery in New York.“I remember just standing there all day, creating this pattern with M&M’s,” Amirah Kassem tells me, laughing. “It might not have been the prettiest cake, but he was obsessed with M&M’s and when I saw his face light up I knew he loved it.”Kassem is the founder of New York City’s beloved Flour Shop—a rainbow-hued Instagram-sensation turned real life bakery in SoHo. Standing in the store’s basement kitchen, Kassem is recalling over the phone the first cake she can remember making. She was eight or nine, at her family home in Juárez, Mexico, determined to nail her brother’s birthday extravaganza.She’s nailed a lot more cakes since then. Along with running the physical bakery space, Kassem just released her first cookbook—The Power of Sprinkles: A Cake Book by the Founder of Flour Shop—alongside a full range of adjacent bakeware in collaboration with Williams Sonoma. The colorful collection includes everything you need to make her signature Rainbow Explosion Cake; a six-layer monster that spills piles of confetti-like candy and sprinkles when sliced.Kassem moved to New York in 2011 to work at Interview Magazine before accepting a position alongside fashion designer Johan Lindeberg to launch the denim and leather label BLK DNM (where she became the brand’s general manager). But as her career in fashion grew, so too did her early morning side-hustle. “While I was working in fashion, I was waking up early and baking for friends and family,” she says. “I never had a plan, it was just something I loved doing.”So much so that, in 2012, Kassem left her full-time to bake cakes out of her Williamsburg apartment. She didn’t have the money for a proper website, so she put all of her energy into marketing her creations through Instagram. Soon, Flour Shop had custom orders from the likes of Philip Lim, Valentino, Chanel, Stella McCartney, and Versace.Here, we chat to Kassem about changing career paths, doing one thing at a time, and the reason she’d rather set dreams than goals.Did you have any indicators in the early days, that this could take off?While I was working in fashion, I was baking for friends and also selling little cake balls and things like that a friend's coffee shop. So I knew there was some demand before I jumped onto it full time.Do you remember, the first real sale you had?I actually do, because I called my mom and I was like, \"Oh my god, I have enough money to buy an electric mixer and a pan!” Every cake that I sold in the beginning literally funded something else.What is it about cake, specifically, that enamored you enough to entirely change your career?It comes from those moments of celebrating with the people I love, whether it was my friends or family. I just love surprising them with things that they like. And with cake, I get to feel like I'm part of so many New Yorkers’ big life moments celebrations. I think there's something really special to that.What was it like building a physical bakery without any formal training?It was very scary and everything was new. There's industry knowledge that a classically trained pastry chef or someone who grew up working in a kitchen has that I definitely didn't. I remember the first day that we were training. We weren't even open yet, and a lot of my staff were asking, \"Where's this?\", and \"Where's that?\" And I was like, \"Oh right, I have to go buy that!”What has it been like for you to build a team?At first it was hard, because it’s essentially a loss of control. All of a sudden it went from me to like 30 people, and I was no longer the only one maintaining the brand vision. But I have learned so much from my team. And I’ve also been able to spend more time on what I’m good at, and what I love to do. It’s good for growth to let go and hand off the things that you're not the strongest at to someone who is.How has your role changed since the early days baking alone in your apartment?My husband, Ross Harrow, now runs the business side of the company. There's just no way that I would be able to sit there, go through our taxes, and also come up with our next treat.  But I still feel like I do it all, right from having a say in what's being made, what's being posted, events we're having, our collaborations—everything. I just have people working with me now.How would you describe your business model?So there are more straightforward parts of our business that make up the primary company revenue; the actual sales of the shop, and the sales from our online store. I see that as one thing. And then there are things like our partnerships, which are really extensions of our brand aimed at growth. The success of one doesn't necessarily mean a success of the other, but they all tie together.How do you manage your time when you’re working on so much?I think that you're able to do different things, but you can't move from one thing to the next until your first one is done. Each milestone needs to have its own time to shine. For example, I’d always dreamed of a store, and a cookbook, and our Williams Sonoma collection. But I also knew there was a sequence to it, and I couldn’t do it all at once. I think that understanding what comes first, and what comes next, is really important.You use the word “dreams,” over “goals.” Is that intentional?Yes! I think things that are scary goals make for fantastic dreams. I think a lot of people set goals that they know they can reach, because a goal that is not realistic can turn into something scary that could fail. Verses when you're young and imaginative, and you dream of things, nothing can stop you.How do you tackle stress during the day?Literally the minute I wake up, I blast music throughout my entire apartment. I just love getting ready with a loud, fun vibe happening. Same goes at work. Everyone knows that when I come into the office, the first thing I’ll say is, \"Where's the music? Why is it boring in here?\" I’m definitely more affected when my environment is stressful, so making sure it’s fun is super important.Why did now feel like a good time for a cake book?When I first started out, I got a few offers to do a cookbook. Everyone was like, \"This is what your cake book should be!” “No, this is what your cake book should be!\" But I didn't feel like I had the right vision of what I wanted it to be. I don't like to come up with ideas because there is an opportunity; I prefer to come up with an opportunity because there's an idea.The base cake in the book, Bonilla Vanilla, is a shout out to your mom. What is the significance there?In terms of role models, I always looked up to my mom. She was basically a Pinterest mom before Pinterest existed. I loved her creativity, and just how she was able to have fun with everything that we did. So we chose that recipe because it’s inspired by the main birthday cake she made us growing up. I eat a lot of cake. And despite all the new flavors I try, I still just love birthday cake the most.What does success mean to you, if anything? And, how do you measure it?My end goal is to create something—whether it's a product, an environment, a celebration, a cake—that makes someone else happy. Being able to do that, and keep myself happy along the way, is how I measure success. I think that it’s the same when you're working in any job. It's very important that you're happy because when you're not, that's when you stop trying.Have you ever received any life-changing advice?Yes, definitely. Peter Pan told me to “never grow up.” I think part of being an adult is having the ability to choose not to be one.How do you keep your days balanced when you’re surrounded by cake all the time?I definitely have a routine, just because it helps keep my day flowing. I eat Sweetgreen for lunch every day. I like to do Pilates, and I'm very active. Our kitchen is on the basement floor; then we have the retail level, the main floor; and then upstairs is the office. So I'm constantly running up and down. I also walk to work and home every day.How do you spend your off hours?I think that's when the dreaming comes in. I love doing things that are inspiring, whether it's going to a museum or watching animated movies or comedy. I think that laughter is really important for me. I also love hosting friends at my apartment and putting together themed dinners and brunches.What are some foods we could always find in your fridge or pantry?I always have jalapeños, popcorn, and lemons or limes. I love Mike's Hot Honey and Valentina Hot Sauce. And Tajin, that's my number one thing. We grew up in Mexico putting it on mango, so mom sends me bottles of it.Do you have a favorite non-cake food?Pizza! I'm obsessed with pizza. For anyone reading this, pizza is always welcome at the store!Explore Bon AppétitHealthyishEntrepreneurs Run the WorldNew YorkInterviewsRead MoreLifestyleOutdoor Voices Founder Ty Haney on the Stress-Busting Rituals That Keep Her on TopBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-31", "author": ["Condé Nast", "Ali Francis"]}