{"id": "30484ed2b63bf05925ee70e5dfeac88e", "url": "https://www.bonappetit.com/recipe/seedy-arepas-with-black-beans-and-avocado", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Arepas With Black Beans and Avocado Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeedy Arepas With Black Beans and AvocadoBy Sarah JampelOctober 15, 20194.1(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThere are countless variations of arepas all over Colombia and Venezuela, but whether they’re stuffed with cheese, chicken, or pork, the dough starts in the same way: with arepa flour (precooked corn flour) and water. Yes, you will need to seek out arepa flour (Goya and PAN are widely available). Both white and yellow will work, but keep in mind that yellow typically requires a bit more water to become properly hydrated.IngredientsMakes 4¾cup raw sunflower and/or pumpkin seeds (pepitas)1½cups arepa flour2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more4Tbsp. extra-virgin olive oil, divided1serrano chile1avocado1cup cilantro leaves with tender stems, divided1lime¼tsp. chili powder115.5-oz. can black beans, drained, rinsed½cup crumbled queso fresco (optional)PreparationStep 1Preheat oven to 325°. Toast seeds on a parchment paper–lined rimmed baking sheet, tossing once, until darkened and fragrant, 8–10 minutes. Transfer to a small bowl; reserve baking sheet and parchment.Step 2Meanwhile, combine flour and 2 tsp. Diamond Crystal or 1 tsp. Morton salt in a large bowl. Add 2 tsp. oil and 1 cup warm water and mix with a sturdy spatula or your hands to combine. If dough feels dry, add more water 1 tablespoonful at a time until it holds together. Smash and knead dough until smooth and no small clumps or dry bits remain (be patient and really knead it—it will hydrate and come together); it shouldn’t crack when you squeeze it. Cover bowl with a damp kitchen towel and set aside to let dough hydrate, 15 minutes.Step 3Halve chile lengthwise, removing seeds and membranes if less heat is desired. Place one half in a food processor. Finely chop remaining chile and set aside. Add avocado, ½ cup cilantro, and juice from 1 lime to food processor and pulse until mostly smooth. With the motor running, drizzle in 2 Tbsp. oil until a smooth sauce forms. Taste and season with salt.Step 4Add all but 2 Tbsp. toasted seeds to hydrated dough. Knead in bowl until seeds are incorporated and dough is firm and homogenous, 1–2 minutes. Turn out dough onto reserved parchment and divide into 4 pieces. Press and pat into disks that are 5\"–5½\" in diameter and ⅛\"–¼\" thick. Return disks with parchment to baking sheet.Step 5Heat 1 tsp. oil in a large cast-iron or nonstick skillet over medium-high until shimmering. Working in batches, add arepas and cook, turning once with a spatula and reducing heat to medium if they’re browning too quickly, until a crisp, slightly charred crust forms, 3–5 minutes per side. Transfer arepas to same baking sheet and bake until slightly puffed and springy, 10–12 minutes.Step 6While arepas bake, wipe out skillet, then pour in remaining 1 Tbsp. oil and heat over medium. Add chili powder and cook, stirring, until fragrant, about 20 seconds. Add beans and cook, stirring frequently, until warmed through, 3–4 minutes. Add reserved chopped chile and cook, stirring, until fragrant, about 1 more minute. Remove from heat and add remaining ½ cup cilantro. Season with salt.Step 7Spread arepas with avocado sauce. Top with bean mixture, cheese (if using), and reserved seeds.How would you rate Seedy Arepas With Black Beans and Avocado?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleSo I just showed my grandma the photo without telling her what this was and she thought this was a Mexican tortilla, which was also my initial thought. And given the way the ingredients were used this looks far more like a tortilla. I don't want to preach about the purity of arepas, but I feel like the flavor profile and cooking method is so far off that to call this an arepa would be a disservice to the meal. \nI even saw a comment saying that it wasn't a weekday meal when in reality an arepa is literally the definition of weekday pantry meal in Venezuela.\nNext time just check with a venezuelan or a colombian, as you'll see in the comments we're all happy to tell you how to make them. mbelenVenezuela6/9/2020Made these this morning and even threw a fried egg on top (blasphemy?!) Anyway, they were super tasty. And the arepas were easy too... just followed the directions on the package. Thanks for this one! I will take photos and brag to all my friends and say it was super complexLos Angeles3/24/2020This was tasty, but it is not, in my view, a weekday meal. It thought it was very time-consuminAnonymousDenver3/14/2020The arepas turned out like flat hockey pucks, no puff in the oven.  Even steaming them didn’t help.  Maybe my flour was too old.  The black beans would have been boring if I hadn’t added onions, peppers and greens.  The avocado sauce was great.  AnonymousAK12/4/2019Great recipe, nice mix of flavors and textures. My first time to work with arepa flour. Working it by hand is definitely recommended, and I think if you treat it like a pie crust (to get the water balance right) that will help. Adding pepitas to the flour makes it hard to get them thin.  Still, not hard to do and really tasty.Bjc01Texas11/19/2019My friend and I made a dinner night out of making these arepas, and let me tell you, they were so amazing, balanced, and satisfying! The dough needs more water than what the recipe states, even when using white corn flour. The arepas will crack if there is not enough hydration so be careful with that! I also found myself wanting a salsa to top the hearty dish off with. Overall, a great recipe that didn't make me feel heavy, break the bank, or wear me out. This recipe is also one I will be playing around with in the future. Thinking of making some minis for a Thanksgiving potluck appetizer! samilynnsal5288Austin, TX11/18/2019Hello Everyone, \nI am from Venezuela and YESSSS! this is one of the most delicious staples of our culture. The variations are endless. Also, in keeping my eating habits clean and healthy you can mix in to the dough, spinach, quinoa, kale, beets, vegan cheese, sweet potato and the list goes on and on! I try to make mine with less dough and more of the veggie portion. And, as they say... practice makes perfect. It really is not an initial easy task to conquer the perfect texture of the dough/arepa, but it can me mastered. Good luck and enjoy them. Buen Provecho!!!!Venezuela 11/6/2019I'll reduce the amount of salt next time. Otherwise really tasty and easy to prepare New York 11/3/2019I’m very happy reading that arepas are between us, I love it. Arepas are more easy to cook. Pour 1/3 cup arepa flour , 1/4 teaspoon of  salt in a bowl and add 1 cup water  (doesn’t have to be warm) Mix with a spoon until you fill some resistance  when you mix, maybe you’ll need more water, them allow the mix to get hydrate for a few minutes until you can handle it. Put over the hot pan on a medium fire, cook and enjoy it. aura guevaraVenezuela10/21/2019tasty! arepas need a lot more water to make the dough an accurate consistency - otherwise end up hardened in the often instead of springy! Anonymous10/21/2019Looks tasty! Where is the plate from??Anonymousdetroit10/20/2019Really tasty! But I ended up adding almost 2 cups of water. Anonymous10/17/2019Explore Bon AppétitSouth AmericanLatin AmericanSunflower SeedSeedAvocadoVegetableBlack BeanBeanQueso FrescoCheeseMainVegetarianGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Sarah Jampel"]}