{"id": "3053abbb31206ffe9cb753b1e808f02c", "url": "https://www.bonappetit.com/recipe/peach-mustard-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Peach-Mustard Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssuePeach-Mustard Barbecue SauceMay 22, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThe riper the peaches, the more delicious and nuanced the sauce will be. Serve this alongside any grilled meat or fish, but it was developed to go with this Pork Tenderloin. This recipe is from B’s Cracklin’ BBQ in Savannah, GA. Read more about pitmaster Bryan Furman here.IngredientsMakes 1 cup2large ripe peaches, peeled, cut into small pieces¼cup ketchup3Tbsp. Dijon mustard1tsp. light brown sugar½tsp. freshly ground black pepper½tsp. (or more) kosher saltPreparationStep 1Purée peaches, ketchup, mustard, brown sugar, pepper, and ½ tsp. salt in a blender until mixture is smooth and creamy. Taste sauce and season with more salt if needed.Step 2Do Ahead: Sauce can be made 1 day ahead. Cover and chill.How would you rate Peach-Mustard Barbecue Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleOur peaches weren't at peak-flavor yet, leaving my sauce a bit flavorless. I threw in a couple tablespoons of strawberry preserves to add some fruity sweetness as well as half cup of bourbon and then put it on the stove for a couple minutes to cook off the strong alcohol taste. Very good! Would definitely make again!Chicago6/29/2020Peach BBQ sauces are fantastic, everyone should try one. Highly recommended. jsharpe13DC5/27/2018Explore Bon AppétitSauceCondimentSouthernAmericanPeachStone FruitFruitSummerQuickEasyDairy-FreeGluten-FreeVeganVegetarianFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast"]}