{"id": "30579005b94beb06d6ad79446634e058", "url": "https://www.bonappetit.com/story/zero-waste-stores", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "Could Zero-Waste Stores Be the Future of Retail? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCould Zero-Waste Stores Be the Future of Retail?Living low waste is starting to sound less utopian and more familiar.By Aliza AbarbanelMarch 29, 2019FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailA group of teens clutching Supreme bags huddle inside the entrance to Package Free Shop, mapping their next shopping destination. At first glance, they could be in any Brooklyn lifestyle store: there’s Fleetwood Mac on the speakers and $7 bundles of sage on the shelves. But trash— actually, a lack of trash—sets Package Free Shop apart. The Williamsburg retail store is dedicated to zero-waste products, and those iconic logoed Supreme bags are the only plastic in sight.Lauren Singer, the founder of Package Free Shop, is famous for being able to keep all of her waste in a single mason jar. Like, four years of trash. In 2015, the average American generated 4.5 pounds of waste per day.Our reliance on online shopping and prepacked food isn’t helping matters, but Singer is part of a burgeoning movement that aims to break the status quo and eliminate non-compostable trash. You may recall the Great Plastic Straw Debate of 2018, an Instagram-led charge to eliminate plastic straws at local coffee shops and major chains alike. Metal straws became an accessory, and the zero-waste movement was in the spotlight. Then came a larger conversation about accessibility.“I got really concerned when the straw movement was happening because my granddad has Parkinsons and he can’t use a metal or glass straw,” says Jolene Dobson, who runs Public Goods and Services, a low-waste lifestyle shop in Seattle. “And now that you have everybody walking around with a Hydroflask and a glass straw, you’re not done. There are bigger things, like corporate responsibility for plastic packaging and overpackaging of goods in grocery stores.”Even shopping for groceries is an exercise in avoiding single-use plastic, from cherry tomatoes encased in clamshells to pre-packaged chips. Customers have a choice: Find an alternative or take the hit and hope that yogurt tub gets recycled. (The chances don’t look good.) Breaking the status quo takes work, and modern consumerism is built on convenience. Big box stores like Walmart and Target built empires by providing an exhaustive array of products in one place, from groceries to office supplies. Low-waste stores are considerably less comprehensive, plus locations are largely concentrated in urban areas. And even if you live close, you may have to visit three or four places to get everything you need.“Zero waste, in my opinion, is a full time job,” says Dobson.”I see these conversations online where families feel shame for using paper towels or plastic baggies, and I don’t want them to feel shame.” She chats with customers to assess where they can start swapping out single-use products, trading paper towels for antimicrobial cloth and plastic wrap for beeswax. “Every little step counts,” she says. “You don’t have to collect your garbage in a mason jar.”But living low waste is starting to sound less utopian and more familiar. We’re in a time where Brooklyners can pick up silk dental floss and a bamboo toothbrush while filling up their Mason jars with laundry detergent at Precycle, then hop on the L train to pick up eco-friendly vibrators and biodegradable glitter at Package Free Shop. Soon, a new initiative called Loop will deliver Haagen Dazs, Tide, and other bold-name brands in reusable containers to doorstops across the country. The business is billed as a return to the milkman, but its practices look like an eco challenge to Amazon.But you don’t need to get another subscription to start reducing waste. Health food stores have offered up lentils and other dried goods by-the-pound for decades, as do modern chains like Whole Foods. When it comes to produce, farmers’ markets are about as zero-waste as you can get.  Find for a zero-waste store near you, or revamp your current shopping routine to buy loose produce and use bulk-bins when available. Make your own granola bars. Make your own yogurt! A journey of a thousand saved plastic bags begins with a single tote bag...or something like that.Explore Bon AppétitHealthyishBrooklynGroceryTrendsRead MoreLifestyle5 Stores That Make It Easy to Go Plastic-FreeBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Aliza Abarbanel"]}