{"id": "305890869396ef7c22f536a155692688", "url": "https://www.bonappetit.com/recipe/spice-drawer-chicken-wings", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Spiced Chicken Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSpice-Drawer Chicken WingsBy Carla Lalli MusicJune 1, 20194.3(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintThis dry rub is great on any cut of chicken, including whole birds for roasting (make a double batch). This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients4–6 servings1tsp. dried oregano1tsp. granulated garlic1tsp. smoked paprika1tsp. sugar4tsp. kosher salt, plus more½tsp. MSG, plus more for serving4lb. chicken wings2Tbsp. vegetable oil1cup mint and/or basil leavesLimes and small Persian cucumbers, cut into wedges (for serving)PreparationStep 1Mix oregano, granulated garlic, paprika, sugar, 4 tsp. salt, and ½ tsp. MSG in a small bowl. Arrange chicken wings on a foil-lined rimmed baking sheet. Season all over with spice mix. Let sit at room temperature 30 minutes, or cover and chill up to 2 days.Step 2Place racks in center and upper third of oven; preheat to 375°. Drizzle wings with oil and toss to coat. Bake on center rack, turning with tongs halfway through, until cooked through and skin is golden brown, 30–35 minutes.Step 3Remove from oven. Heat broiler. Broil wings on upper rack, turning every 2–3 minutes, until skin is deeply browned and starting to char at the edges, 5–7 minutes (watch them closely).Step 4Transfer wings to a platter, season with salt and a little more MSG. Top with herbs and lime and cucumber wedges.How would you rate Spice-Drawer Chicken Wings?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleMSG ?  It does make everything taste better.  I used to live in Hong Kong and the locals told me only cheap restaurants use MSG as it's a shortcut to make food taste great without the more expensive option of using good ingredients.  But, no thanks!  I prefer to avoid the headache, dry mouth, and diarrhea.  As for anti-MSG being racist:  That's crazy.  All the local people in my office (Hong Kong Chinese) also avoided MSG as much as possible.  RickWMontana3/22/2022the people hating on msg are so dumb and racist. this recipe makes to die for wings and without the MSG it just isn't the same.AnonymousChicago, IL1/26/2022Great recipe for wings - used MSG as suggested. Love it ! RtSingapore 8/12/2021Recipe is incredible. Don’t believe these lies against MSG that are rooted in racism. Anonymous2/7/2021Why would you suggest to use MSG ?? If you cannot create a recipe to be great on it’s own, then do not create it at all !! THINK before you add MSG to any recipe. Do you know how many people are allergic to MSG ?? Do not even to begin to tell me that MSG doesn’t make people ill, because I become very ill, if I unknowingly  happen to eat food with MSG in it. I am very disappointed that you would print a recipe and then tell the public to use MSG to enhance the flavor. DO NOT make or print a recipe, if you cannot make it taste really good, UNLESS you have to use MSG !!!!!!!!AnonymousBuena Park, CA2/3/2021Made these with some hefty full size bone-in-skin-on wings from the farmers market and they turned out perfectly! Didn’t use the MSG (does anyone else get bad dreams when they eat msg?!) and it Seemed a little under seasoned but overall very very good. Didn’t use any fresh herbs or the cukes either and we still raved about them. Definitely the longer ahead of time you spice them the better! AnonymousSpokane , WA6/19/2020these are amazing - i made them two nights in a row!!! i followed the recipe exactly (except for the MSG) and thought they were so perfectly flavorful. The broiling at the end made the skin so nice and crispy. 5 minutes for me was perfect, flipping halfway through. Careful not to burn them!AnonymousChicago6/1/2020can the spice rub be made without the MSG?AnonymousArizona3/10/2020These are TO DIE for! I cannot recommend these enough. They're so easy, but packed with salty and umami goodness. The hit of acid with the lime at the end brings the dish home. 10/10 - will make again in a heartbeat. I'd even proudly serve these at a party. Great job, Carla!AnonymousMichigan9/3/2019Explore Bon AppétitChicken WingChickenPoultryPaprikaHerbs & SpicesEasyWeeknight MealsMainStarterDairy-FreeGluten-FreeNut-FreeBroilSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}