{"id": "3060c38bf5acd4045abf0995f475b7c8", "url": "https://www.bonappetit.com/story/i-use-fennel-pollen-when-i-want-to-show-off", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "What Is Fennel Pollen, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Use Fennel Pollen When I Want to Show OffIt’s complex, beautiful, and worth the splurgeBy Kyle BeecheySeptember 16, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.A sprinkle of Maldon salt, a crack of fresh pepper, a shower of raw sugar over baked treats—all fail-safe ways to give your cooking a final bit of oomph and sparkle. This works most of the time. But then there are those moments, those dinner parties or special meals, when you want a showstopper, a dish that has everyone asking, “What’s going on with those green beans?” Meet fennel pollen. What is fennel pollen? Not the familiar bulb or seed that you might have in your fridge or spice rack, but the pollen collected from the plant’s flowers. It’s magical, and in my humble opinion, the world’s best dish finisher that manages to be vegetal, bright, and zesty all at once.So what is fennel pollen?Fennel pollen is extracted from the same plant that brings you the bulb for your salad and the seeds for your spice rub. It’s harvested from the tiny blossoms at the end of the stalk of the plant. It’s native to the Mediterranean, but in the States you’ll often find fennel pollen that comes from California. It isn’t farmed per se—the plants germinate naturally and then pollen can be foraged. After it’s harvested by hand, it’s dried and sold in little jars. It’s the most potent form of the plant and definitely a splurge (an ounce can run you anywhere from about $10 to almost $30), but so worth it for when you’re trying to impress with a head-turning dish.But what does it taste like?Fennel pollen is complex, and that’s what makes it so great. At first taste, it’s reminiscent of the fennel seed: anisey and earthy. But then it transforms into a citrusy, sweet finish. This duality is what makes it so appealing—familiar yet totally new and what can transform a ho-hum plate of veggies or piece of fish to a memorable meal. If you’re new to the ingredient, use it sparingly at first to prevent it from becoming too perfumy. A good rule of thumb is a ½ teaspoon per recipe to start and then add it pinch by pinch if it doesn’t come through. I generally like to use it right at the end as a finishing sprinkle after the ingredients have been cooked, to preserve maximum potency.How do you put it to use?Admittedly, I’m a little unconventional and use it in savory and sweet dishes alike. Fennel pollen is great in just about everything, and I’ve been known to be a bit reckless with what is a pretty expensive ingredient. I was introduced to it at a too-lavish-for-my-budget restaurant in California, where it was simply sprinkled on top of roasted carrots. Life-changing. The pollen managed to highlight the earthiness of the carrots while acting as a brightening agent that cut through the olive oil’s richness. Roasted roots were fennel pollen’s gateway into my kitchen, and I ended up not only finishing carrots with it, but parsnips and sweet potatoes too. I’ve been experimenting with the flavor-packed spice ever since: baked in a pear spice cake, dusted over blanched lemony snap peas, and sprinkled on vanilla ice cream. I went so far as the fennel trifecta of shaved fennel bulb with toasted fennel seed granola and sprinkled fennel pollen on top. I’m vegan, but I’ve been told it’s killer rubbed onto pork chops or scattered over a soft, mild chèvre spread on crusty sourdough. But really, once I get going, I can’t stop. I’ve tried it in brownies, shortbreads, bulgur pilafs, and if I feel like really gilding the lily, I’ll top a smoothie bowl with it for a luxurious breakfast. No matter the application, fennel pollen never lets me down.Go ahead, see for yourself:Wild Foraged Fennel Pollen$30 at Bona FortunaFennel Pollen$11 at Spice HouseExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-16", "author": ["Condé Nast", "Kyle Beechey"]}