{"id": "3068efc5c05197d1f36c467581af5639", "url": "https://www.bonappetit.com/story/discover-the-cuisine-of-vancouver-and-western-canada", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Discover the Cuisine of Western Canada and Vancouver with Chef Jefferson Alvarez | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredDiscover the Cuisine of Vancouver and Western Canada with Chef Jefferson AlvarezBy Rocky MountaineerFebruary 21, 2019FacebookTwitterEmailChef Jefferson AlvarezGrant HarderFacebookTwitterEmailThe two most western provinces of Canada––British Columbia and Alberta––are an epicurean dream simply by virtue of the variety and abundance of local ingredients. Access to fresh fish from the Pacific Ocean, meat, produce and wines that are nurtured by British Columbia’s fertile microclimates, plus a thriving beef industry in Alberta, all give this part of the country its culinary edge. And as the largest city in British Columbia, Vancouver is privy to all of it.So it’s no surprise that Jefferson Alvarez, who was most recently chef at a local pan-Latin American restaurant, Cacao, chose the city as his home. Originally from Venezuela, Alvarez studied at Le Cordon Bleu Ottawa Culinary Arts Institute and worked in kitchens all over the world before settling in Vancouver nine years ago. “Vancouver is a young city with a lot of potential,” he says. The booming metropolis is home to beaches, mountains, rainforests, and nearby islands, but best of all, it’s a melting pot of cultures and cuisines. “I’m always looking for the restaurants that are doing something new and unique,” he says.But Alvarez is just one of the many noteworthy chefs who’ve flocked to the city in recent years. Today he has a community of chefs and cuisines he’s proud to support. From Joël Watanabe’s innovative hybrid of Japanese and Italian cuisine at the impeccably decorated Kissa Tanto, to Masayoshi Baba’s pristine and precise Japanese omakase (which roughly translates to “I’ll leave it up to you”) creations, Vancouver’s food scene is not to be missed when in British Columbia. Here, Alvarez takes us to some of his favorite restaurants in the city for a look at Vancouver’s exceptional and diverse food scene.Photo by Grant Harder | Slow-cooked organic chuck flat, chickpea tofu, cipollini, enoki, salted napa cabbage in a sukiyaki broth at Kissa TantoKISSA TANTOIn the heart of Chinatown, one block away from chef Joël Watanabe’s other restaurant, Bao Bei Chinese Brasserie, is the cross-cultural wonderland known as Kissa Tanto. Inside reveals pink leather booths and barstools, brass accents, dark wood, and lush, jewel-toned velvet curtains. While the decor is enough to marvel at, the fusion of Japanese Italian cuisine is what keeps this popular, award-winning spot booked up nearly every night.“We needed a defined food concept to help with the design process,” adds Watanabe. “I picked two cuisines that are similar in many ways, but also offer immense breadth so that we may spend many years exploring.”Photo by Grant Harder | Chef Jefferson Alvarez and chef Joël Watanabe at Kissa TantoMenu items typical of the style of cuisine are dishes like the gnocco fritto with olive oil crackers, kombu dashi, braised onion, ricotta salata and greens, or the spaghettini served with white ragu of thyme pork sausage, soy pickled garlic, almond parsley pesto, and a ginger crumb. But Watanabe says the whole fried fish, served with daikon-soy dipping sauce, is something people specifically come back for. “They’ll request it with their reservation, as we only have limited amounts every night.”Photo by Grant Harder | Clams in vermut, jamon serrano gran reserva 24 months, stuffed olives and gildas, tortilla con jamon, malaca G&T, galician octopus at Cómo TaperiaCÓMO TAPERIAOver in the Mount Pleasant neighborhood, don’t be alarmed if you hear the cries and cheers of soccer fans ringing from inside Cómo Taperia. “We wanted to capture the madness of a Barcelona- or Madrid-style tapas bar,” says partner Shaun Layton. “Butting elbows while standing at the bar watching bartenders pour vermouth and cava while plating tapas and dealing with a crowd of people. It’s kind of like dining in the middle of a hurricane, but in a good way.”This casual bar with a soccer motif and a killer gin-and-tonic list is the first of its kind in Vancouver. Chef Justin Witcher sources as much produce, meat, and fish from local suppliers as  possible, but admits that some things are better from Spain, like olive oils, jamon, olives, conservas, and even octopus. “We’d be foolish to try and get the same result and flavor with a lower-end product.”Try the croquetas de jamon: a thick béchamel sauce is made from jamón, milk, and a bay leaf, then cooled, crumbed in panko, and deep fried to a golden brown. Other standouts are clams in vermouth, and chicken livers sautéed and deglazed with sherry butter. As for drinks, vermouth and sherry are on tap, while a rotating list of gin and tonics––with at least eight different tonic options––keeps the party going. Layton adds, “When people come to join us, they are leaving their comfort zones and embracing Spain.”Photo by Grant Harder | Chef Masayoshi Baba preparing sushi at MasayoshiMASAYOSHITo visit Masayoshi in the Fraserhood area, you’ll be taken about 15 minutes out of Vancouver’s downtown core to a tidy restaurant that is roughly 400 square feet and home to just six tables and bar seating. But for a night of omakase with chef Masayoshi Baba, a detour is well worth it. “He is a legend here,” says Alvarez. “There is so much integrity and love for the work he does. It’s incredibly hard to find a place like this.”Baba doesn’t speak much English, but his food speaks for him. His omakase-only menu uses seasonal ingredients, is artfully plated, and specially prepared by Baba himself. Each morning, he procures only enough ingredients for that day. He makes his own soy sauce and freshly prepares his own wasabi. “He gets all his equipment from Japan,” Alvarez says, “right down to the bamboo tray where he keeps fish so it is not exposed to cold air.”Becoming a sushi chef is to undertake a career built on foundations of precision, patience, and passion. At Masayoshi, making sushi is an art form. To sit at the bar and watch Baba thoughtfully slice fish and assemble each dish is to take part in a kind of exhibit. “It’s a once-in-a-lifetime experience,” Alvarez says.Photo by Grant Harder | Bar manager Satoshi Yonemori at Grapes & SodaGRAPES & SODAIn 2015, Grapes & Soda opened adjacent to its sister restaurant, Farmer's Apprentice, to accommodate overflow. Now, nearly three-and-a-half years later, the South Granville spot has evolved into much more than additional seating. “It’s cozy and soulful, lively but laid-back,” says bar manager Satoshi Yonemori, an acclaimed bartender in his own right, but who also honed his kitchen skills in other noteworthy restaurants.Yonemori explains that specific items don’t stick around for very long because the menu evolves seasonally, and is dependent on what’s available from the local farmers. “Chef Zachary Somjen is very talented and has been creating fun and delicious dishes,” he says. “His daily specials are always hits and the seasonal mille-feuille is a must-try.”However, the bar is one of the main draws, which is easy to believe when you witness Yonemori’s expertly crafted Old Fashioned cocktail. “It’s made of turbinado sugar, Angostura bitters, and overproof bourbon,” he says. “First we muddle sugar with bitters and slowly add bourbon over hand-chipped ice just out of the freezer. It takes time and patience, and we stir for a long, long time. The end product is a perfectly diluted, chilled cocktail in a frosted glass.” He notes that while all the seasonal cocktails are popular, this particular one has lots of fans. “Whether you stop in for a drink before dinner, or make a night of it, it’s one of those spots you can’t miss,” says Alvarez.Photo by Rocky Mountaineer | Rocky Mountaineer’s salmon with shaved-fennel ‘slaw, local-market vegetables and mustard vinaigretteEXPLORE BEYOND VANCOUVERWhile this primer of must-try spots in Vancouver is a great way to discover a taste of Western Canada, it’s just scratching the surface. After a day or two exploring Vancouver, discover more of what British Columbia and Alberta have to offer. One of the best ways to see and eat it all, is on a luxury train journey with Rocky Mountaineer.With four unique routes traveling between Vancouver and the iconic mountain towns of Banff, Lake Louise or Jasper, Alberta, which each have their own booming food scene, Rocky Mountaineer is essentially a wholly unique restaurant on the rails. Take in Western Canada’s most remarkable terrain through oversized or glass-dome windows and pass rushing rivers, semi-arid, desert-like canyons, waterfalls, glacier-fed lakes, and some of the most majestic mountains ranges in the world. All the while, sip British Columbia wine and beer, enjoy fresh-baked scones and snacks, and dine on delectable meals from a menu created by two award-winning chefs: Jean Pierre Guerin, who honed his culinary skills at five-star hotels and fine-dining establishments all over the world, and Frédéric Couton, who trained at Michelin-starred restaurants in Paris and Geneva. Whatever you have a taste for, it’s all there––and with a view you won’t forget.Ready to book? Create a memorable and exciting culinary journey through the wild landscapes of British Columbia, Alberta, and the Canadian Rockies, and be sure to explore chef Jefferson Alvarez’s recommendations in Vancouver.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Rocky Mountaineer"]}