{"id": "306ea260b6b49965fba835d461630c7c", "url": "https://www.bonappetit.com/story/potli-cbd-honey", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Potli’s CBD Honey Melts Daytime Stress and Eases Me Into Restful Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingOne Teaspoon of This CBD Honey and It’s Lights OutPotli’s thick, earthy honey melts my daytime stress and eases me into restful sleep.By Jean TrinhDecember 9, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling Micah Morton.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are eating, drinking, and buying right now. Next up, contributing writer Jean Trinh makes a very relaxing case for CBD honey.I’ve struggled with anxiety forever. It comes in waves, and at its worst manifests as constant worrying, nervousness, and poor sleep. When the pandemic came along, all of those issues went through the roof. Like many others I was on high alert all the time, trying to navigate how to exist with a deadly virus running rampant while also getting regular life stuff done (in my case, juggling work with taking care of my toddler 24/7). My usual outlets for relieving stress, like going to the gym and grabbing lunches with friends, weren’t as easy to do in this new reality—and I needed help falling and staying asleep throughout the night.That’s where Potli—an Asian American–founded company making CBD (cannabidiol) honey—comes in. I first noticed the brand mentioned in a marketing email. As a writer my inbox is often drowning in pitches about products that I mostly archive straightaway, but I found this one particularly intriguing. I seemed to be the exact target audience for Potli’s Feel Good Premium Hemp Raw Honey, which the website claimed would “promote soothing, calm feelings.” Plus, I’m a sucker for a good story, and Potli CEO Felicity Chen had one that resonated with me.Photograph by Isa Zapata.  Prop Styling by Paige HicksPotli Feel Good Hemp-Infused Raw Honey$32 at Direct CBD$42 at Potli ShopWhen I was growing up in a Chinese household, my family often turned to Eastern medicine to treat ailments—which is exactly what it seemed like Chen’s family was doing. She and her college roommate came up with the idea for the Feel Good honey—Potli’s first product—when she moved back home from college in 2015 and noticed that her mother, who has asthma, had been experiencing terrible coughing spells due to her allergies. Chen’s father had begun beekeeping to produce hyper-local wildflower honey he hoped would help her mother. And that’s when Chen had her light bulb moment: “I knew with all the inflammation that was going on in her lungs, CBD would absolutely help and also calm her down,” she says.If Chen was able to convince her conservative Chinese mother to try anything cannabis-related, I had a feeling the honey had to be good. Upon opening my jar one night, the smell was fragrant and earthy, like I had just ventured into a botanical garden. I scooped out a golden teaspoon of the thick honey (which has 10 mg of CBD) and stirred it into a cup of Sleepytime Tea. After adding a squeeze of lemon, I cozied up under some blankets and surrendered myself to The Great British Bake Off. The first sip was floral, lightly sweet, and truly delightful. After downing the mug, I noticed I did feel calmer. After repeating this routine a few nights in a row, I found myself drifting off while Kim-Joy was shaping dozens of choux pastries into adorable turtles.While there still needs to be more scientific research done on CBD—a non-intoxicating phytocannabinoid derived from the hemp plant—what’s out there so far seems promising. CBD doesn’t give you the high that THC (tetrahydrocannabinol), the main psychoactive component in marijuana, does, but it is supposedly targeted at reducing inflammation, relieving anxiety, and improving sleep quality. There's a lot of misinformation out there about CBD, but Chen likens the experience to taking a daily vitamin: \"You don’t really know it's working until a few weeks in.\"Of course, it’s possible that my newfound feelings of calm were a result of the placebo effect in action, but I’m not sure it matters. Because what I most enjoyed about this whole experience was creating a ritual out of it. As I started looking forward to my cuppa, I dreaded bedtime less. Brewing tea with CBD honey became a signal to myself at the end of the day that it was time to stop doomscrolling and start relaxing—something I could never seem to manage without a transitional moment to demarcate evening rest from daytime stress.You should probably talk to a doctor before deciding whether CBD is right for you, but it’s been a game-changer in getting me to relax and sleep more deeply. While my favorite application is in tea, you could spread this honey on toast, stir it into oatmeal, or drizzle it over yogurt. It’s versatile and chill. And now that I’ve experimented with Potli’s Feel Good honey, I have my eyes set on the Dream Honey, which, as the name suggests, is designed for even deeeeeeeper sleep. (Then again, I don’t want to miss too much of the GBBO.)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-09", "author": ["Condé Nast", "Jean Trinh"]}