{"id": "3091213349d9b74b4f07b0f0c1ffb34b", "url": "https://www.bonappetit.com/story/salted-watermelon-juice-is-life", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Make This Salted Watermelon Juice and Then Turn It into a Margarita | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Salted Watermelon Juice and Then Turn It into a Margarita, You Wizard YouAlso known as Woju. This is the most refreshing drink you’ll have this summer. Just add tequila.By Molly BazJune 26, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailIt wasn’t until my first summer living under the wrath of oppressive New York City heat that I understood the life-altering power of Salted Watermelon Juice, or as I now prefer to call it, Woju. (Trademark pending.) The air in New York gets so thick you struggle to breathe, the humidity index hits 8 trillion percent, and a distressing sweat drips down your thighs on jam-packed subway rides sans air conditioning. If there is one thing in this world that can restore your emotional and physical equilibrium after a day like that, it is Salted Woju.What is Salted Woju you ask? Oh, it’s just a perfectly cold glass of blended, then strained PEAK season watermelon, salted so that the fruit flavor shines brighter than you ever thought possible, served on ice. It’s the kind of drink that makes a textbook case for the argument that simple is always better. If you or anyone you know has ever had a more delicious, more refreshing two-ingredient beverage in their lifetime, please make yourself known. I for one have not, which is why I will blending up and batching out this perfect salty-sweet refresher ALL SUMMER LONG.Whipping up a batch of it is a thousand times easier than pie. Cut up a bunch of watermelon, throw it in the blender with some kosher salt, remind yourself to place the lid on that blender (might sound obvious to some but trust me it has happened), and blend away for about one minute. Next, strain it over a large pitcher, pressing on the solids with a rubber spatula to extract as much juice as possible, and discarding any stringy bits. And Voila! Two ingredients, three minutes.There’s nothing like a cold glass of Salted Woju for breakfast when the predicted high for the day is “Actual Hell.” And later that evening, if you’re feeling sassy, it’s obviously begging for a shot of tequila, in a rocks glass with a salted rim and a wedge of lime, as in this Salted Watermelon Margarita recipe. So basically what I am trying to say here is this is a beverage that is there for you no matter the time of day, no matter your physical state, no matter your lifestyle choices. Salted Woju knows no bounds. Now if you’ll please excuse me, I have worked up quite the craving myself.Get the recipes:Salted Watermelon JuiceIt’s two ingredients and the most refreshing thing you’ll drink this summer.View RecipeSalted Watermelon MargaritaIt’s refreshing, naturally sweet without added sugar, and just look at that PINK!View RecipeAnother great Molly Baz recipe:Explore Bon AppétitWatermelonSummer DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Molly Baz"]}