{"id": "3092a14a097988ca09b486476ced3c3f", "url": "https://www.bonappetit.com/recipe/crispy-pita-with-chickpeas-and-yogurt-fattet-hummus", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Crispy Pita with Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueCrispy Pita with Chickpeas and Yogurt (Fattet Hummus)By Kamal MouzawakApril 16, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPHOTO BY ALEX LAU, FOOD STYLING BY ANDY BARAGHANIEmailPinterestPrintEmailPinterestPrintTypically eaten for breakfast, this creamy, crunchy dish also pairs well with savory dishes come dinnertime. We took a shortcut by using canned chickpeas, which pick up some flavor from a quick simmer with garlic. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe.Ingredients4 servings2garlic cloves, divided115.5-oz. can chickpeas, rinsed2Tbsp. plus ⅓ cup extra-virgin olive oilKosher salt38\"-diameter pitas, split in half, torn into 1\" pieces2cups plain whole-milk yogurt (not Greek)2tsp. fresh lemon juice6Tbsp. unsalted butter½cup chopped cashewsSumac (for serving; optional)Ingredient InfoSumac, a tart, citrusy spice generally sold in ground form, can be found at Middle Eastern markets, specialty food stores, and online.PreparationStep 1Preheat oven to 350°. Smash 1 garlic clove with the side of a chef’s knife and combine in a medium saucepan with chickpeas and 2 Tbsp. oil. Pour in cold water to cover chickpeas. Season with salt and bring just barely to a simmer. As soon as you see bubbles, remove pan from heat and set aside.Step 2Spread out pita pieces on a rimmed baking sheet. Drizzle with remaining ⅓ cup oil and toss to coat; season with salt. Bake, tossing halfway through, until golden brown and crisp, 8–10 minutes. Remove pita chips from oven and set aside.Step 3Finely grate remaining garlic into a small bowl. Add yogurt and lemon juice and mix well to combine; season with salt.Step 4Melt butter in a small skillet over medium heat. Add cashews and cook, stirring, until nuts and butter are golden brown, about 5 minutes.Step 5Divide pita chips among bowls and scoop some lemon yogurt over. Drain chickpeas and divide evenly among bowls, then spoon over some of the toasted cashews and brown butter. Sprinkle with sumac just before serving if desired.How would you rate Crispy Pita with Chickpeas and Yogurt (Fattet Hummus)?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWow, I’m really glad my husband hates chickpeas so I can have all 4 servings to myself! This is delicious.ACSan Francisco8/27/2021This was delicious! Already went back for seconds. Was thinking maybe the pita chips or chickpeas would need additional seasoning, but glad I followed the recipe exactly. Sumac was great. Will definitely keep this in the light lunch rotation.AnonymousBrooklyn6/16/2021Explore Bon AppétitHummusDipLebaneseMiddle EasternChickpeaBeanVegetableCashewNutYogurtOther IngredientsStarterSideVegetarianHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}