{"id": "30c51fef882a251dc95dbb2d5e00a8c2", "url": "https://www.bonappetit.com/story/toast-your-starch", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "The Pilaf Method Yields Grains That Are Nutty, Flavorful, and Clump-Free | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Nutty, Toasty Grains That Don’t Clump or Glom, Toast Them FirstThis one little step yields big improvements.By Jae ThomasJanuary 27, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailIf you’ve ever eaten a meal at a Mexican restaurant that came with a side of fluffy orange rice, you have realized that arroz rojo is a perfect food. The iconic Mexican side dish is tangy, spicy, and nutty, with garlic, onions, and tomato sauce bringing brightness. What really sets arroz rojo apart from simple steamed rice, however, is its consistency: never sticky or clumpy, the firm grains remain distinct. Both the flavor and magical texture of this Mexican staple are thanks to a simple technique: dorar en aceite, or “to make golden in oil.” Also referred to as the pilaf method, this is the process of toasting dry uncooked grains in oil until they begin to turn golden brown before adding liquid.Growing up in a Mexican American household, I frequently watched my mom and my grandmother brown rice and pasta before cooking them. Without fail, every pot of arroz and sopa de fideo (Mexican noodle soup) was cooked to perfection and, even without many ingredients, bursting with flavor. Just as blooming spices in oil releases their natural flavors, toasting grains in oil brings out their savory nuttiness while also presenting an opportunity to infuse rice, noodles, farro, couscous, wheat berries, and similar starches with spices and aromatics. Toasting also reduces total boiling time and, for rice, ensures it won’t get clumpy. All these perks are seen in a perfect pot of arroz rojo: When made with care (and proper toasting), each individual grain of rice is completely coated with fat, tomato sauce, and spices, as though someone painstakingly hand-painted every piece with flavor and color.In this recipe for Spanish-style fideos, thin spaghetti gets toasted in chicken fat.\nToasting your grains in oil also lets you build flavor in one step—you’re blooming spices and aromatics at the same time you’re browning the grains. My mom and grandma toast their rice in oil, mixing thoroughly until the grains are translucent and just beginning to turn golden brown, and then they add garlic, onions, and spices. This ensures that all of the rice is coated in oil, which keeps the grains distinct and less likely to clump up.Toasting also allows both the rice and the pot to come up to a higher temperature before you add water, which reduces cooking time. Cooking the rice in oil until the grains are translucent and some are just beginning to turn golden brown firms up the starches on the outside of the rice, allowing the grains to absorb water slowly, further contributing to intact, well-defined grains.Of course, this technique is not only used for Mexican fideos or arroz rojo. Browning dry grains in oil is seen in traditional cuisines around the world, from Spanish-style fideos to Palestinian maqluba to pilafs made in Armenian, Syrian, and Lebanese communities. The origin of the method is disputed: Some scholars believe it originated in India, while some argue it came about in Iran around the 10th century. Either way the technique is beloved in numerous cultures for creating distinct, nonsticky grains, so you can and should toast grains and pastas outside of these iconic cultural recipes too. Toast whole grains like farro, or apply the technique to any one-pot pasta recipe where the dry pasta cooks in a liquid sauce. (If a recipe calls for long noodles, just break them in half so they can lay flat across the bottom of your pan.) For extra depth of flavor and a fantastic al dente texture, try toasting the pasta for homemade hamburger helper or noodle soups like this Brothy Pasta with Chickpeas before adding any liquid ingredients.If you want to try toasting rice, this basic arroz rojo recipe is a good place to start: Begin with 2 Tbsp. neutral oil, heated until shimmering over medium-high. Once the oil is hot, add 2 cups jasmine rice, stirring almost constantly, until the grains have turned translucent and some of them have begun to take on a light golden brown color, about 5–6 minutes. Don’t be tempted to turn up the heat or skimp on the browning—you want your starches to be browned but not burnt to get that deep nutty flavor.Add in finely chopped onion, garlic, or other vegetables (uncooked peas, finely diced carrots, or corn kernels work well) and sauté for an additional 2 minutes, until the vegetables just begin to soften. Next, add ½–¾ cup tomato sauce, diced tomatoes, or El Pato sauce (Mexican spicy tomato sauce) and stir to combine. Add 2 cups chicken broth or 2 cups water plus chicken bouillon, and stir, allowing the liquid to come to a boil. Cover your pot with a lid, turn heat to low, then just let your rice simmer for 15–18 minutes, until fully cooked, to absorb all the flavor of the liquid.This recipe works for both arroz rojo and fideo (just sub rice for cut spaghetti or small shells), but you can absolutely riff on the sauces and aromatics to create something completely different. From browning couscous and adding harissa, onions, and garlic to cooking toasted rice with sambal and soy sauce, the flavor combinations are endless, and the extra step of toasting your grains will add a depth of flavor you didn’t know was missing.Or try pilaf!Pilaf With VermicelliDry vermicelli is toasted in lots of butter to create extra nutty flavor and richness, a method used in pilaf traditions across communities.View RecipeJae Taurina Thomas is a Mexican and Thai food and culture writer based in NYC. You’ll find her cooking beans and waiting patiently for a Tapatío sponsorship.Explore Bon AppétitGrainsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-27", "author": ["Condé Nast", "Jae Thomas"]}