{"id": "30d92093743cc37ab72e21f371e3d32d", "url": "https://www.bonappetit.com/recipe/shaved-cauliflower", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Shaved Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueShaved CauliflowerBy Claire SaffitzMarch 20, 20182.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintYou can slice the cauliflower any direction you like, just be watchful of your fingertips on the mandoline and work over a bowl to catch all the bits of flying florets.Ingredients4 servings 1small or ½ large head of cauliflower, core removed3Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepperCoconut-Turmeric Relish (for serving; optional)PreparationStep 1Very thinly slice cauliflower on a mandoline into a medium bowl. Drizzle with oil and toss to coat; season with salt and pepper.Step 2If using relish, add to cauliflower and toss to coat. Season with more salt and pepper.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Shaved Cauliflower?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleServed this--doubled-- at a recent family dinner. \nRAVE REVIEWSAnonymousDetroit, MI7/9/2021Explore Bon AppétitCauliflowerVegetableQuickEasySideDairy-FreeGluten-FreeVeganVegetarianRawKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}