{"id": "30dfb5e25c7c854b4059af38985f2a7c", "url": "https://www.bonappetit.com/story/3-starter-recipes-to-sharpen-your-at-home-cooking-skills", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "3 Starter Recipes to Sharpen Your At-Home Cooking Skills | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Starter Recipes to Sharpen Your At-Home Cooking SkillsBy Campbell'sJanuary 31, 2020FacebookTwitterEmailFacebookTwitterEmailCooking doesn’t have to be complicated. Whether you’re new to this whole recipe-following thing or just like to keep it simple in the kitchen, these three recipes are a quick, tasty, and simple way to shake things up at home. All you need are a few easy-to-find ingredients, Campbell’s® soup and Swanson® broth, and an appetite. Chop, chop!Carbonara FrittataCarbonara for breakfast? Frittata for dinner? Yes to both, please. This delightfully savory dish marries two worlds with salty pancetta, Parmesan, and a creamy base of eggs, whole milk, and Campbell’s® Condensed Cream of Chicken Soup. (The perfect mixture for getting those crispy, cheesy edges.) This one-skillet masterpiece is simple, savory, and sure to make it into your weekly recipe arsenal.Red Curry & Ground Pork SoupYou don’t have to be a pro to whip up restaurant-worthy noodle bowls. The All Star of this Southeast Asian-inspired soup is its flavorful broth, made with Swanson® Chicken Broth and creamy coconut milk. It complements the cooling vegetables, herbs, and mild-flavored rice noodles while fried shallots add a touch of sweetness. The browned pork ups the umami factor and a toppings of lemon, mint, and veggies balance out this meal that’s as tasty as it is impressive.Red Chilaquiles Egg BakeSoft scrambled eggs topped with hot sauce is great and all, but sometimes breakfast calls for a little more creativity. Try this colorful chilaquile egg bake on a weekend to mix things up. Garlic and jalapenos bring a hint of heat, tortilla chips give it texture, and creamy Campbell’s® Condensed Tomato Soup gives it its rich flavor––with a sprinkling of avocado and queso fresco to finish.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-31", "author": ["Condé Nast"]}