{"id": "30e9dee32afb39ad37a3fd65c25b16c5", "url": "https://www.bonappetit.com/story/8-non-cookbook-food-books-to-read-this-summer", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "8 Food Books to Read This Summer 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture8 Non-Cookbook Food Books to Read This SummerBeach reads, train reads, plane reads—they’re all here.By Elaheh NozariJune 11, 2018FacebookTwitterEmailFacebookTwitterEmailOne of the underrated things about being an adult is that there’s no such thing as required summer reading—no Beowulf, no The Catcher in the Rye, and no Great Gatsby to read and be ready to discuss in September. You can read whatever you want, it’s crazy! Since we all love food here, we combed through this year’s latest book releases and found the non-cookbook but still food-focused reading material for you to dive into on the beach, by the lake, or wherever these long days and warm weather bring you. Whether you skew towards nonfiction deep dives, historical fiction, novels, or memoirs, here are eight food books to read this summer.Paris à Table: 1846 by Eugène BriffaultHistory buffs and Francophiles get to nerd out in Paris à Table by Parisian writer/theater critic Eugène Briffault. The book was published in 1846 and re-released for the first time in English this year. Briffault chronicles 19th century French society through the lens of culinary culture, and translator J. Weintraub does an excellent job of relaying Briffault’s illustrative descriptions for the 21st century reader. Briffault has (very funny) strong opinions about how his countrymen dine, especially those who take part in the “impudent custom” of déjeuner dînatoire, now known as brunch. Even in the 1800s, brunch was dismissed as an excuse for men to start drinking champagne before noon (proper women did not brunch). He would have loved BrunchCon.Buy it: Paris à Table, $12 on Amazon (out now)Edna Lewis: At the Table With an American Original edited by Sara B. FranklinIn the culinary world, Edna Lewis, born in rural Virginia in 1916, is widely considered to be on the same playing field as Julia Child, but her life and cookbooks, including The Taste of Country Cooking and In Pursuit of Flavor, have never received the same level of publicity. Sara B. Franklin is changing that with her sharply edited collection of essays written by chefs, food writers, and scholars about the southern cook, who died in 2006 at the age of 89. (Read an excerpt by chef Mashama Bailey here.)Buy it: Edna Lewis, $20 on Amazon (out now)Milk! A 10,000-Year Food Fracas by Mark KurlanskyJournalist Mark Kurlansky is known for popularizing a niche genre of general interest historical non-fiction. (See: Cod, Salt, and Oysters). From the the first page of this book, you’ll be fascinated by how much milk, and its relatives like cheese, whey, and ice cream, have infiltrated our lives over thousands of years. If you’ve ever found yourself in a debate about what milk is the best milk—goat, cow, human?!—this book will equip you with all the random tidbits to strengthen your rebuttal.Buy it: Milk!, $22 on AmazonComing to My Senses: The Making of a Countercultural Cook by Alice WatersAlice Waters’ long-awaited memoir, Coming to My Senses, was first published in September 2017 but is now getting a second wind thanks to its May paperback release. Waters chronicles her life up through the opening Chez Panisse, from her early childhood in suburban New Jersey and first year of college at UC Santa Barbara to falling in love with France and finding her restaurant’s home on Berkeley’s Shattuck Avenue. The narrative is complemented by photographs, letters, and recipes, but it’s Waters’ stark confessions that demystify the aura surrounding her.Buy it: Coming to My Senses, $16 on Amazon (out now)Number One Chinese Restaurant by Lillian LiWe’re happy to report that this is a case where you can and should judge a book by its fantastic cover. Lillian Li’s debut novel, about a family-owned Chinese restaurant in the DC suburbs, has an enthralling plot line reminiscent of a prime time drama that you can’t stop watching. The story begins on a busy night of service at the Beijing Duck House in Rockland, Maryland, where all the main characters, in varying capacities, work. Tragedy strikes in the first few chapters, and the rest of the book has a Law & Order-like spin (arson, extra-marital affairs, blackmail, etc) that we couldn’t put down.Buy it: Number One Chinese Restaurant, $24 on Amazon (out June 19)The Lost Vintage by Ann MahFans of World War II historical fiction have a new title to add to their book club reading list this summer: The Lost Vintage. The novel centers around Kate, a sommelier in San Francisco who comes from a wine-making family in Burgundy. When Kate returns to the family vineyard to help her cousin with the annual grape harvest, she discovers a secret room in the vineyard’s basement, full of French Resistance pamphlets and items belonging to an unknown aunt who grew up in Vichy France. You’ll easily start and finish the entire book in the span of a long weekend.Buy it: The Lost Vintage, $22 on Amazon (out June 19)Seeds of Science: Why We Got It So Wrong On GMOs by Mark LynasIn the 1990s, Mark Lynas was radical environmental activist who’d break into GMO trial plots and destroy the crops. It turns out he didn’t know as much as his plant-hacking activity suggested, and in 2013, he publicly apologized for his behavior. In his new book, he explains why he got it all wrong—and why genetically modified crops aren’t as evil as many believe them to be. It’s science-heavy, for sure, but like Milk!, the book is full of factoids that’ll make you rethink a highly debated subject, and also what’s really going on with those giant apples that don’t bruise or brown.Buy it: Seeds of Science, $27 on Amazon (out June 26)Killing It: An Education by Camas DavisMagazine editor Camas Davis moved from New York to Portland for love and a new job, and when neither of those panned out, she went back to school—for butchery. In her memoir Killing It, she writes of her time studying whole animal butchery and charcuterie in southwestern France and her subsequent move back to Portland, where she founded the meat school Portland Meat Collective. Even if you don’t have meat-butchering ambitions (or care for beef all that much), you’ll enjoy going along with Camas on her journey into a totally new world.Buy it: Killing It, $24 on Amazon (out July 24)Speaking of meat, have you made this steak with charred scallion sauce yet?Hanger Steak with Charred Scallion SauceFirst you get excited because: hanger steak. And then you taste that scallion sauce...View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitShoppingBooksSummerRead MorecultureWatching Wild, Wild Country? Then You Need to See The Rajneesh CookbookBy Melissa Lockerculture17 New Spring Cookbooks We Can’t Wait to StainBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast", "Elaheh Nozari"]}