{"id": "30f228be0712075ae35e21fb02b06961", "url": "https://www.bonappetit.com/recipe/brussels-sprout-tacos-with-spicy-peanut-butter", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Brussels Sprout Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueBrussels Sprout Tacos with Spicy Peanut ButterBy Daniela Soto-InnesJanuary 8, 20194.5(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintCooked and raw brussels sprouts are matched with a rich umami dressing and a spicy nutty sauce in this surprising but winning taco.Ingredients4 servings Salty-Sour Vinaigrette3Tbsp. fish sauce1cup unseasoned rice vinegar¼cup sliced scallions1½\" piece ginger, peeled, finely gratedKosher saltTacos2Tbsp. Aleppo-style pepper or 1 Tbsp. crushed red pepper flakes¾cup unsalted, roasted peanuts plus ¼ cup crushedKosher salt1lb. brussels sprouts, preferably small ones, trimmed, divided1cup vegetable oil86\" corn tortillas¼cup finely chopped white onionSliced avocado, sliced serrano chiles, cilantro leaves with tender stems, flaky sea salt, and lime wedges (for serving)PreparationSalty-Sour VinaigretteStep 1Heat a small saucepan over medium. When hot, pour in 1 Tbsp. fish sauce. It should bubble up vigorously and then get thicker and slightly darker, about 30 seconds. Repeat with remaining fish sauce, incorporating 1 Tbsp. at a time. Carefully add vinegar (it may spatter), then transfer mixture to a small bowl; let cool. Stir in scallions and ginger. Taste and season with salt.Step 2Do Ahead: Vinaigrette can be made 1 week ahead. Cover and chill.TacosStep 3Purée red pepper and ¾ cup whole peanuts in a food processor until a smooth butter forms, about 2 minutes. Season with kosher salt and scrape into a small bowl.Step 4Very thinly slice one-fourth of brussels sprouts; transfer to a medium bowl. Cut remaining brussels sprouts in half. Heat oil in a medium skillet over medium-high. Shallow-fry halved brussels sprouts in batches, being careful not to overcrowd the pan, until browned and crisp, about 5 minutes per batch. Transfer to paper towels to drain, then add to sliced brussels sprouts. Drizzle with ¼ cup Salty-Sour Vinaigrette and toss to coat; season with kosher salt.Step 5To serve, heat a medium skillet over medium-high. Working one at a time, cook tortillas just until warmed through; transfer to plates. Spread tortillas with some spicy peanut butter; spoon brussels sprouts over. Top with onion, avocado, chiles, cilantro, and ¼ cup crushed peanuts; sprinkle with sea salt. Serve with lime wedges.How would you rate Brussels Sprout Tacos with Spicy Peanut Butter?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleThis was sooooo yummy, I've been recommending it to all my friends! I discovered I didn't have any peppers once I started cooking, but threw some Sriracha in with the roasted peanuts and it worked out perfectly! *Insert chef's kiss here*\nIn the rotation, for sure.AngieToronto12/17/2021This recipe has earned a spot in my regular rotation. Quick, tasty, mostly pantry staples. A+Kat4/2/2021I will start this review by saying that I am not a vegetarian. I love me some carnitas. But something caught my attention about this recipe, so I gave it a shot. I'm glad I did. What I really liked about this recipe was I was able to prep everything in the afternoon, then when it was time to eat, all I needed to do was fry the brussel sprouts, slice the avocado and warm the tortillas.\nI grew up with Jif and Skippy, so making my own peanut butter seamed a little too complicated, but I did it and it was great. The freshness of the peanuts really shone through. I did not have the aleppo pepper so used red pepper flakes. I will have aleppo on hand for next time, though just to see the difference. Be careful, this PB is spicy. It might be a little less so with the aleppo.\nI made two tiny tweaks to the Southeast Asian vinaigrette, adding a pinch of sugar and a squeeze of lime. They made a big difference in the vinaigrette for me.\nI shallow fried the brussel sprouts, as per the recipe, but next time I will bake them on a sheet tray in a very hot oven or broil them quicly to get the char. Apartments in NYC don't have great ventilation so even today, the day after, I can smell the vegetable oil. Be careful if you fry them, I made sure my brussel sprouts were very dry, but there was still a good amount of splattering oil. Hitting them with some good quality sea salt as they came out the pan made them taste fantastic.\nI warmed up a can of black beans with onion, red bell pepper, garlic and finely chopped cilantro stems that I sweated then added cumin, salt and a couple dashed of Cholula. Didn't have any cojita, but topped them with a little feta. This I made to eat on the side, but I just added this right in the tacos with the serranos, white onion, avocado, cilantro, quarted cherry tomotoes, chopped peanuts and another nice squeeze of lime.\nI will make these again.Jerry from the blockNYC2/5/2021Good lord, these are SOOOO delicious! I messed up the vinaigrette (like another commenter below) by just throwing all the ingredients together, no thickening slowly...but it didn't matter. I also subbed soy sauce for fish sauce because I'm vegetarian. Otherwise made just as written, and--wow! I don't even understand how these can be so good--will have to make and eat at least 100 more times to make sense of it.KCCambridge, ma12/4/2020absolutely amazing, added toasted pine nuts instead of crushed peanuts and used pure peanut butter mixed with sriracha and oil for. Was skeptical about the fish sauce, but the vinaigrette turned out incredible and made me like the Brussel sprouts, which I am normally not a fan of. Will definitely make this again. AnonymousNetherlands 9/28/2020Wee have made this twice now and while we would never have them as tacos   - this is not a taco combo! we have had them over rice to rave reviews.  My son keeps asking if we can have them again.  I would completely recommend I don't even like brussell sprouts. Anonymous5/4/2020Thought this recipe was pretty good! We used cashew butter from our pantry instead of grinding whole peanuts. Having the spicy nut spread definitely made the whole thing more filling and I loved it as an alternative to beans — I hate beans! I misread (didn't bother to read...) the directions and just threw all the sauce ingredients together THEN realized it should be cooked to thicken, so I added a tbsp of corn starch and heated it over medium and it worked out just fine! MY fiance loved the flavor of the vinaigrette and said that for (nearly) vegan tacos, these taste more like meat than any other recipe we've tried (mostly cauliflower and jackfruit variations.) We also did our halved sprouts in a sheet pan instead of on the stovetop, but I thought it still turned out tasty despite what another reviewer said!!Long Beach, CA4/3/2020I made this twice, the first time shortcutting the Brussels by roasting them.  It was forgettable.   The second time I followed the procedures except for short cutting the peanut sauce by subbing almond butter.   The Brussels turned out better using the fry method and the recipe was tastier.  Still, it was a lot of work for a so so   result.   AnonymousALASKA 1/10/2020These tacos were spectacular, and surprising. We loved them so much we're making them two weeks in a row. We poured some of the vinaigrette on to the onions to mellow the sharp, onion-breath-inducing flavor and we did not regret it. The recipe was followed in all other respects. britgoldenBaltimore, MD6/2/2019This recipe is really quite spectacular. I have made a lot of tacos in my life, and I must say, these made my husband and I very quiet and focused throughout dinner last night. They’re really a home run. The only cheat I made was jar PB mixed with the peppers. I’m sure recipe as written is better, but we were still pretty blown away by these with said tweak. I will say that (although fairly easy) this recipe required some real prep beyond my typical weeknight dinner but no more than 45 min total, Bravo BA! AnonymousAustin TX5/5/2019We loved these. I don't understand why the recipe has you make so much vinaigrette and hate when recipes do this and don't make it clear that you will end up with extra. But whatever, we liked the recipe so it's fine. I made them twice last week. First time I fried the brussels, second time I roasted them. I liked fried better. I didn't make the peanut butter because I already had a jar of spicy peanut butter (Big Spoon Roasters Hot Peanut Butter - soo good). AnonymousNC5/5/2019Suggestion for Anonymous: Try Tamari sauce.  Fish sauce is not my favorite, so I substitute with Tamari.jkcooksEast Coast4/27/2019Can't wait to make these but they are not Vegetarian with the fish sauce!  Any suggestions for a substitute?AnonymousLas Vegas4/26/2019YES. These are amazing. Sure, you could hack the peanut sauce with jarred PB, but it seemed like it really infused better during the process of blending with chiles, which was so easy and took 2 minutes. I had a lot of extra vinaigrette, so I'm going to make the tacos later this week with broccoli. LOVE. It would be great on anything—chicken thighs, quinoa bowl, roasted veg. alexbeggsBon Appétit 4/1/2019I'd been waiting to make this recipe until I got a food processor to make the peanut butter with and I finaly got one a couple weeks back. I'd say this was... Ok. I made my own peanut butter, followed one of the tips and roasted the Brussels sprouts in a preheated pan so they we're brown and crispy on the bottom and still crunchy and raw on top. I imagine they wouldn't be too different if I'd fried them. I'd quarter the vinaigrette... Why make a whole cup worth if you only put a quarter cup on the sprouts?? Makes no sense. The fish sauce is def a smell bomb but it dissipates quickly imo. The taste of the tacos was good but I don't think it's a recipe I'd add to the weekly rotation if that makes sense. AnonymousOakland CA3/26/2019Explore Bon AppétitTacoBrussels SproutVegetablePeanutNutAleppo-Style PepperHerbs & SpicesMainDairy-FreeHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}