{"id": "310c1ff93fcbeace87c7c64a924dfd22", "url": "https://www.bonappetit.com/story/conimex-sambal-sauce", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "This Sambal Sauce Unlocked My Love Of Indonesian Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Sambal Sauce Unlocked My Love of Indonesian CookingFind me dolloping a smoky-sweet spoonful on everything from plain rice to ramen.By Elisabeth ShermanApril 29, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I watched my dad heap chile-flecked sambal into bowls of pho and steamed rice throughout my childhood. Being a young and inexperienced eater, I always preferred watery supermarket hot sauce to the pungent aroma and earthy heat of this Southeast Asian staple. That is, until a box containing two jars of Conimex sambal badjak showed up on my doorstep earlier this year.My dad is Dutch Indonesian and was born in Jakarta, and he brings the flavors of his home to every meal we share. So when I recently expressed my desire to start cooking Indonesian food at home, he was so thrilled he immediately sent me two of his favorite cookbooks—The Food of Indonesia and The Complete Indonesian Cookbook—along with his trusty chile paste. Since the Conimex care package arrived, I’ve been adding a deep red viscous spoonful to just about everything. And let me say that, in my months of experimentation, I’ve never met a savory dish that sambal didn’t improve.Sambal, which originated in Indonesia but now features heavily in the cuisines of Malaysia and Singapore, is made from a combination of shallots, garlic, red chilies, and terasi (shrimp paste). It’s the tongue-tingling backbone in many traditional dishes, like nasi goreng (fried rice), mie goreng (fried noodles), and ikan bakar (fish grilled in banana leaves). Conimex is produced in the Netherlands, and its spot in my pantry is a subtle nod to my family heritage. There are several Dutch brands that specialize in Indonesian ingredients like sambal and ketjap medja (Indonesian soy sauce) that were imported to the Netherlands during its 300-year colonization of the archipelago. The flavor is slightly sweet and layered with tang, but the spice of sambal isn’t fiery or stinging; it’s a deeper, smokier heat that evolves the longer it sits on your tongue. And unlike most other hot sauces, the texture is typically chunky and packed with chili pepper seeds.The versatility of sambal badjak (the spicy version) or sambal manis (which is labeled as mild but still carries a hint of heat) is what earned it a permanent place next to my soy sauce, chili crisp, and gochujang. It adds a peppy punch to a bowl of roasted broccoli and carrots, serves as a marinade for steak and chicken (alongside brown sugar and fish sauce), makes for the perfect crudités dipping sauce, and amps up the heat in ramen.Looking back, I can’t believe it’s taken me a lifetime to get onboard with my dad’s favorite chile paste. But now that I’m devoted to its power, there’s no going back to the vinegary sauces of my youth. Next up on my Indonesian cooking list? Ayam penyet, an East Javanese fried chicken recipe which uses sambal as a dressing or dipping sauce. It’s a somewhat complicated (for me!) combination of chicken thighs, cornflour, buttermilk, and spices, but as long as I’ve got my Conimex handy, I know I’ll do my dad proud.Photo by Emma FishmanConimex Sambal Badjak$6 at Yummy Bazaar$9 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-29", "author": ["Condé Nast", "Elisabeth Sherman"]}