{"id": "310ebeda99089620350d40c914d1e6e3", "url": "https://www.bonappetit.com/story/prepare-home-coronavirus", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "How To Prepare Your Home For Coronavirus  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureSay You’re Stuck at Home for Two Weeks…How to prepare so you’ll feel more prepared.By Carla Lalli MusicMarch 2, 2020FacebookTwitterEmailFacebookTwitterEmailThanks to coronavirus, I had the opportunity to define the word sputum for my 16-year-old child last week. We were in the middle of a conversation about how the disease is transmitted: He kept insisting it was airborne, and I kept saying that was only true if actual particles were flying through the air in the form of, you know—sputum. His retort, “Well I don’t know what that is, so whatever,” was delivered as a conversation killer. But our talk led me to finally sit down and research what I need to know about preparing for COVID-19, the disease that feels a lot less remote now that cases are showing up in the United States. I was right about the particles—you can get sick by inhaling (or touching) an infected person’s coughs or sneezes. Aside from that, I realized I know almost nothing about how to get ready for a potentially major disruption if our city government restricts transit or access to workplaces and schools.I’ve lived in New York City for most of my life, and have gotten through the blizzard of ‘96, the aftermath of the 9/11 terrorist attacks, a couple of random multi-day blackouts, the Ebola scare, and Hurricane Sandy without doing much in the way of preparation. Not a point of pride; just a fact. But, as the possibility that my family of four could be stuck at home together for many days on end has started to gel as a potential reality, I figured it was time to get organized, at least with respect to our kitchen and meal plan. Here are a few basic, good practices that I picked up from the CDC, the Red Cross, and through some well-intentioned online sleuthing. My big advice: If you’re making a financial investment in these precautions, don’t waste your money on items you wouldn’t ordinarily eat, or couldn’t set aside for future emergencies.Fermented foods are always great to have in the fridge.\nEva KolenkoGroceries: It makes sense to stock up on non-perishables, like pasta, grains, seeds, dried and canned beans, canned or jarred fish, coconut milk, canned tomatoes, nuts and nut butter, dried fruit, and frozen vegetables. Again, we’re talking about a couple of weeks, not months. I would add powdered milk, bouillon cubes, coffee, tea, flour, sugar, honey, and protein powder to that list. Butter freezes well; so does bread. I like the idea of some comfort foods, too—a few bars of snacking chocolate, a jar of Nutella, ingredients for baking. If we’re stuck at home, there should be some joy and sweetness while we ride it out. I’d want at least two liters of olive oil and a liter of canola or peanut oil in the house. Cellar vegetables like potatoes, onions, and other root vegetables can be kept in a cool, dark place so they don’t sprout. If you have a grill, pick up extra charcoal or propane; it could come in handy if there’s no electricity.Refrigerated items: If you do a big grocery haul, use perishable things like leafy greens, herbs, and soft fruits (berries, mangos, tomatoes) first. Fermented foods like yogurt, pickles, kimchi, and miso will store longest and add a lot of flavor to whatever you’re making on repeat. Condiments like mustard, horseradish, hot sauce, and jam will also hold up more or less indefinitely. Eggs, buttermilk, and hard cheeses like parm and aged gouda can be refrigerated for weeks. Hard salami and/or jerky is a great thing to have around.Big batches: Poultry, meat, or vegetable stock, beans, and grains can all be made ahead and frozen. (So can all of these recipes.) I do not have a chest freezer, so there’s a limit to how far I’m going to go with this. The thing I love about having chicken stock on hand is that it’s a concentrated and highly digestible form of protein that you can consume plain and use to cook other things.Water: The general rule of thumb is one gallon a day per person for two weeks. For my family of four, that means 56 gallons of water. (I have not bought any water. I should buy water.)Pets: They need a two-week supply of food, too.Some produce can last two weeks in the fridge.\nDoes this make you nervous? It makes me nervous. Writing a list—any list—makes me realize how little I’ve done, aside from gathering information and getting organized. Staring at the unfinished tasks is the most paralyzing phase. I know I’ll feel better if I do something, and it makes the most sense to start with the things that are useful to stock at home whether this virus upends normal life or not. Today I’ll defrost the chicken thighs I already had in the freezer so tomorrow I can make stock. I’ll do an inventory of what we have in the house and start to fill in with small market trips every day this week. Personally, I am not going to order a giant online shipment; the stores around me have plenty of food and I want to support my local vendors. So far, trucks are moving; the boys are at school; the power is on; everything is fine.Since the night we discussed sputum at the dinner table, my husband donned a mask and boarded a plane for a two-week work trip to Argentina. My parents canceled a long-planned, three-month stay in Rome, a city they’ve dreamt of living in for decades. I’ve had more conversations with my kids about risks. The older one thinks the whole thing is being exaggerated, and he was visibly surprised when I told him that by the time this is over, he’d probably know someone who got it. I hope that’s not true. We’ll see. If we’re better prepared and stay healthy, we can be there for our neighbors as well. I keep doing the one thing everyone agrees will keep us healthy: I’m washing my hands constantly, which means they’re very, very dry. I should probably add hand lotion to the list.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-02", "author": ["Condé Nast", "Carla Lalli Music"]}