{"id": "3113a5831d80dd58144490097cd61fb8", "url": "https://www.bonappetit.com/story/the-secret-to-superior-brownies", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Cocoa Powder is the Secret to Superior Brownies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCocoa Powder is the Secret to Superior BrowniesWe picked apart every element of these brownies—but the cocoa powder was never in question.By Sarah JampelMarch 10, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.This past summer, I went on a multi-day hike that involved, among other ridiculous routes, a near-vertical uphill where I had to get on my hands and knees to “scramble” up the side of a mountain.The path to these brownies was more intense.I tried what amounted to roughly ten million iterations—brownies with a meringue top, amaro-spiked brownies with a crackly top, coffee-spiked brownies with a raw sugar crust, brownies with malted streusel, brownies with a crème fraîche swirl, it goes on—before we came to the final recipe. A great brownie is a near perfect thing—how were we to improve on it without adding unnecessary accoutrements?But one thing that was always certain, even in the early stages when I was flailing wildly: This would be an all-cocoa brownie, built on cocoa powder rather than melted chocolate. And the reason wasn’t just because we figured more people keep a container of cocoa powder than a stack of chocolate bars on hand.As compared to those made with just chocolate or a combination of the two, cocoa brownies are reliably superior in terms of texture and flavor.First up, texture: Cocoa brownies stay softer than chocolate brownies—they won’t feel dry or crumbly, even if you prefer, like me, to eat them straight from the fridge—because they get their fat from butter as opposed to cocoa butter. Why? Cocoa powder contains very little cocoa butter (it’s low in fat compared to chocolate bars), which means that additional butter must be added to cocoa brownies to compensate. And because butter is much softer than cocoa butter at room temperature (just think of the texture of a chocolate bar versus the texture of a stick of butter), this means that cocoa brownies stay tender and velvety. Brownies based in melted chocolate, on the other hand, become sturdier and less yielding as they cool and age.Next comes taste. Cocoa powder is the straightest path to intense chocolate flavor because it’s 100 percent cocoa—there’s nothing else getting in the way. Chocolate bars, on the other hand, contain sugar, additional fat (as we’ve mentioned), vanilla, and sometimes emulsifiers and stabilizers. And even two different chocolate bars at the same percentage (say, 72%) will vary in sweetness, mouthfeel, and taste. Unsweetened cocoa powder simply provides more control. WE. LOVE. CONTROL.And where melted chocolate introduces more moisture to the brownie and, consequently, requires additional flour to balance it out, cocoa powder can stand in for a portion of the flour. With less flour, the brownies taste barely bound, with no risk of cakiness or toughness.That’s not to say that you should use the dusty canister of cocoa that was in your apartment when you moved in—cocoa powders also vary in quality (we love Guittard Cocoa Rouge Dutch Processed Cocoa Powder). But cocoa powder is generally more reliable because there are fewer variables at play.So stick with the cocoa powder and save your chocolate bars for chopping up and adding to cookie dough. Both your brownies and your cookies will thank you.Get the recipe:Camouflage Chocolate Fudge BrowniesThe secret to the fudgiest, most chocolaty brownies is cocoa powder—not melted chocolate. We borrowed chocolate expert Alice Medrich’s technique, then added a cream cheese topping for tangy balance. Don’t overthink your camo design; the brownies will look even better when sliced.View RecipeExplore Bon AppétitBasically BakingBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-10", "author": ["Condé Nast", "Sarah Jampel"]}