{"id": "311462316ef50701f8ed97eac8918786", "url": "https://www.bonappetit.com/recipe/mashed-potatoes-with-crispety-cruncheties", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Mashed Potatoes  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueMashed Potatoes With Crispety CrunchetiesBy Molly Baz and Carla Lalli MusicOctober 15, 20194.5(92)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThe impossibly creamy texture of these mashed potatoes is a credit to choosing the right guy for the job: the German Butterball. (We tested 10 contenders—it was the butteriest in flavor, and fluffiest when mashed.) Plus, roasting them first helps concentrate their flavor. On the continuum from slightly textured to exquisitely satiny spuds, use a potato masher (rustic, but fine!), ricer (nicer!), or food mill fitted with the finest disk (woooow!). A smoky breadcrumb and-potato-chip topping, inspired by the flavors of patatas bravas, brings something new to the table. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8–10 servingsPotatoes4lb. German Butterball or Yukon Gold potatoes, scrubbed1head of garlic, divided5sprigs thyme2tsp. black peppercorns, lightly crushed1¼cups (2½ sticks) unsalted butter4cups (or more) whole milk1Tbsp. (or more) kosher salt1lemonAssembly2½\"-thick slices country-style bread, torn into 1\" pieces2cups kettle-style potato chips (such as Cape Cod)4Tbsp. unsalted butterKosher salt, freshly ground pepper3sprigs thyme, leaves picked1tsp. hot smoked Spanish paprika⅓cup chopped parsleyPreparationPotatoesStep 1Preheat oven to 400°. If using German Butterballs, place potatoes on a rimmed baking sheet or in a cast-iron skillet and roast, turning halfway through, until very tender (a paring knife inserted into the center should meet with no resistance), 45–50 minutes.Step 2If using Yukon Golds, place on a rimmed baking sheet or in a large baking dish and cover tightly with foil. Roast until very tender, 80–95 minutes. Step 3Meanwhile, remove 4 garlic cloves from garlic head and set aside for the topping. Cut remaining head of garlic in half crosswise and place in a medium saucepan with thyme, peppercorns, butter, 4 cups milk, and 1 Tbsp. salt.Step 4Using a vegetable peeler, remove wide strips of zest from half of lemon and add to pot; set lemon aside for the topping. Bring mixture to a simmer over medium-high heat, stirring occasionally. Immediately remove from heat, cover, and let sit at least 30 minutes.Step 5When potatoes are done, use a paring knife to remove skins (it’s important to do this while they are very hot; hold them in a kitchen towel to protect your hands), then pass them through a ricer or food mill fitted with the fine disk into a large pot (or simply mash them in the pot with a potato masher).Step 6Return garlic mixture to a simmer, then pour through a fine-mesh sieve into pot with potatoes; discard solids. Set potato mixture over medium heat and whisk until liquid is incorporated and potatoes are very smooth and bubbling. Taste and season with more salt if needed. Cover and keep warm until ready to serve.Step 7Do Ahead: Potatoes can be made 2 days ahead. Transfer to an airtight container and let cool. Cover and chill. Reheat over medium, whisking constantly and loosening with more milk if needed.AssemblyStep 8Pulse reserved 4 garlic cloves in a food processor until finely chopped, about 15 seconds. Add bread and potato chips and process in long pulses until coarse crumbs form, about 1 minute.Step 9Heat butter in a large ovenproof skillet over medium until foaming. Add breadcrumb mixture and season with salt and pepper. Cook, stirring, until mixture is coated in butter and fragrant, about 1 minute. Transfer skillet to oven; bake, tossing every 5 minutes, until crumbs and chips are evenly dark golden brown, 15–20 minutes.Step 10Meanwhile, finely grate remaining lemon zest from reserved lemon into a small bowl. Add thyme leaves and paprika and toss to combine.Step 11Remove crumb mixture from oven and immediately toss in thyme mixture. Taste and season with more salt if needed. Let topping cool in pan, then add parsley.Step 12To serve, transfer mashed potatoes to a large bowl and sprinkle topping over.Step 13Do Ahead: Topping (without parsley) can be made 2 days ahead. Store airtight at room temperature.How would you rate Mashed Potatoes With Crispety Cruncheties?Leave a ReviewTell us what you thinkReviews (54)Back to TopTriangleOverall, great! Worth the time and effort, especially for the topping. I baked my potatoes (Yukon gold-ish, they weren’t labeled) for about an hour until fork tender, halved them and then scooped out the insides. Felt like that was faster than peeling with a knife as suggested. Made and steeped the milk/butter mixture as instructed but threw in a Parmesan rind for an added bit of oomph. My only critique is that even using less lemon zest than suggested in the milk mixture almost made the potatoes too lemony. Now with the topping and a gravy I made (simple roux - equal parts butter and flour whisked frequently until desired color (remember: lighter means it thickens more, darker means it adds more flavor but thickens less) and then whisked in homemade stock and reduced until desired thickness), it was great. I’d halve the lemon in the milk next time. Used a potato ricer and texture was awesome. Fluffy, not gluey at all. Lauren MMandeville, LA11/26/2021These potatoes are amazing! Definitely worth the time they take if you want to go above and beyond with your meal. I was a bit scared once I'd added all the liquid because the potatoes seemed quite soupy but I stirred them a lot and let them cool off a bit before reheating to serve and they were the perfect consistency. Don't skip out on the crispety cruncheties either! They're super easy to make and add a great texture. AnonymousVancouver, BC2/2/2021OKAY, I normally don't write reviews EVER, but I'm writing this in case there is someone like me who is reading through the comments to see if they messed up their mashed potatoes. I followed the recipe to the T... But I didn't read ANY reviews before starting. So, naturally, when I added the DELICIOUS infused milk mixture I panicked. I started reading through the comments and saw that a lot of people modified the liquid ratio for the same reason... However I knew that the recipe called for WHISKING WHILE THE POTATOES ARE BUBBLY for a reason. I think the mistake in the recipe is that they do not emphasize enough just HOW MUCH whisking is needed - a LOT. I whisked and whisked while the potato mixture was on medium heat and then, like magic, it started to thicken. I have transferred it to a bowl to let it cool and let me tell ya: the consistency is AMAZING. So, whoever is reading the comments in despair: You're not doing it wrong, just keep whisking. SteffDallas, TX12/24/2020The very best mashed potatoes I’ve ever had. I made with just regular ‘ole russet potatoes using the old school peel-then-boil method and still came out absolutely divine. I’m sure following the exact recipe would yield an ever better result, but for the typical home chef looking to step it up a bit, evolving your typical mashed potatoes method with the flavoring of the milk and butter, as well as the addition of the “Crispety Cruncheties”, this recipe is the bomb.AnonymousIndianapolis, IN11/27/2020I make mashed potatoes allllll the time and this is my first time having a fluke.  I used 4 lbs  of yukon gold baked in oven & covered as followed, as well as using a potato Ricer. I only used 3 cups of milk due to comments & still was able to have about a cup & a half left. Potatoes were perfect, fluffy, super light & not too thick or loose. Delicious.\nThen when it was time for everyone to eat about 3-4 hrs later, After the fact of the household already sharing I see how odd/ grainy & watery potatoes were. Felt like I was in the twilight Zone. They were nothing like when I made/tasted them. Not sure what it was but I’ve definitely used warm milk/heavy cream many many times, but not with potatoes baked in oven. I do normally boil my potatoes. Not sure if that is where things went left. Kind of embarrassing knowing how great they were when I made them lol. I did ask my sister were they like how they looked when she shared but said no. Not sure what happened either way. GabzFort Lauderdale, FL11/26/2020The original recipe recommended adding MSG for umami flavor. If you're skittish about that (or you run out of regular butter like I did) you can sub in 50% truffle butter. It's fairly cheap from Costco and it really takes the recipe to the next level.Chris LloydOakland, CA11/24/2020Mark, if you see this, I made these last year. I mashed the potatoes, added the milk mixture, then let it cool and refrigerated. I believe I used all of the milk then, and just used a little bit of plain milk during the reheat. It turned out amazing. AnonymousPhiladelphia, PA11/18/2020I am planning on making these this year but I have a question I'm wondering if anyone has experience with. My oven is only large enough to handle the turkey, so I want to roast these the day before. When it says potatoes can be made a head of time, did you rice/mash them then cool after that? Or, did you mash them, add the milk or mash them, add the milk mixture and then cool? If the second option, did you add all the milk or reserve some for loosening up again the next day? Greatly appreciated!MarkColumbus, OH11/16/2020Fantastic mashed potatoes for a special occasion. Would definitely recommend making these the day before. Not a difficult recipe but time consuming. Go slow with adding the milk mixture, the potatoes will absorb all of it. Best mashed potatoes I've ever made. AnonymousOttawa Canada4/13/2020This dish, while scrumptious, is a crime against humanity. My partner and I burned ourselves no less than five times. Bad cooks, you say? Maybe. But two whole hours we fought on. The stats were against us from the start.\n\nOh my god. The fancypants strainer name? Really u guys? This is pretentious beyond forgiveness. Also don't use these catch-all terms. Wtf were we supposed to do with the black pepper??? What does Crush mean?? You didn't really ~CRUSH~ the instructions (nailed it). We still don't know.\n\nFor all u real playerz out there, Betty Crocker makes a delicious microwave mashed potato dish for 3.95 at most groceries. I'm serious, I'm talking, thanksgiving-grade. Grandmom lost her mind last year. \n\nTwo starz cause the topping is baller. Can't knock you guys there. That shniz is straight up deloicious.\n\nAnd yeah, it looked amazing and we instagrammed the hell out of it. Sue us. But next time I'm ordering out. AnonymousCharleston, WV3/31/2020These were outstanding!  Made exactly as written in recipe and they were the star of our Thanksgiving table!!  I have made these again and used as a topping for Shepherd's Pie and they were a huge hit!  Definitely a keeper in our house!\nAnonymousTucson, Arizona12/29/2019These were the STAR of the thanksgiving table, and I'm making them again for Christmas dinner. The potatoes are silky smooth with a hint of thyme, lemon, garlic - and the topping makes them so much fun. I don't really think these are that hard to make (as in - all mashed potatoes take time, smashing, and flavoring!) and they are a show-stopper. Totally worth it - make exactly as recipe suggests but reserve some liquid in case you'd like firmer potatoes.AnonymousCalifornia12/25/2019Best mashed potatoes ever!! Honestly I was skeptical at first, but the soupy mashed potatoes are soooo good. It's insanely creamy and the flavor is delicious. Be open minded y'all!!! AnonymousTexas12/18/2019Delicious, and so worth it. Agreed with the comments that say the liquid should not all be added at once. Take it slow and add as needed, saving leftover liquid for reheating. \n\nAlso, if you don't want to worry about baking the potatoes and peeling while hot you cover the potatoes in cold water, bring to a boil, and then drop to a simmer until tender. You can then use a ricer without peeling. The ricer will catch the peel and you can remove it between potatoes. Cuts down on time and is easier!AnonymousNYC12/9/2019Not worth it at alllllll. For all the work you have to put in, these aren't even on the list of best mashed potatoes I've ever had. The crispety cruncheties were just meh and the overall recipe was too lemony for my liking. When eaten with the rest of the Thanksgiving dinner, the lemon flavor is scaled back, but I bring you back to point #1: this is way too much work. Would not make again. Love Molly and Carla, but this ain't it.ohmystarsNew York, NY12/9/2019Explore Bon AppétitAmericanPotatoVegetableYukon Gold PotatoSideVegetarianNut-FreeThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Molly Baz", "Carla Lalli Music"]}