{"id": "31163048b6fb862f41a4843269697012", "url": "https://www.bonappetit.com/recipe/crispy-rice-with-ginger-citrus-celery-salad", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Crispy Rice With Ginger-Citrus Celery Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueCrispy Rice With Ginger-Citrus Celery SaladBy Devonn FrancisJanuary 1, 20214.4(70)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintLeftover rice is ideal for this dish (and a great way to use up any takeout that’s hanging around), since fully chilled rice tends to be drier and will become crispier and browner in the skillet. To get the best texture, evenly distribute the rice in your pan and gently press down to flatten it out like a pancake. Don’t touch until you hear it crackle! Finish with a sunny-side-up egg—or poach it if you don't mind the stovetop fuss. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servingsDressing12\" piece ginger, peeled, finely grated1small garlic clove, finely gratedJuice of 1 orange2tbsp. vegetable oil1Tbsp. coconut aminos or low-sodium soy sauce1Tbsp. fresh lemon juice¼tsp. toasted sesame oilKosher saltFried Rice and assembly1medium head of broccoli6Tbsp. (or more) vegetable oil, dividedKosher salt2cups chilled cooked brown rice4large eggs3celery stalks, thinly sliced on a steep diagonal½cup cilantro leaves with tender stems½cup mint leavesCrushed red pepper flakes (for serving)PreparationDressingStep 1Whisk ginger, garlic, orange juice, vegetable oil, coconut aminos, lemon juice, and sesame oil in a small bowl; season with salt and set aside.Fried Rice and assemblyStep 2Trim about ½\" from woody end of broccoli stem. Peel tough outer layer from stem. Cut florets from stems and thinly slice stems about ½\" thick. Break florets apart with your hands into 1\"–1½\" pieces.Step 3Heat 2 Tbsp. oil in a large nonstick skillet over medium. Working in 2 batches if needed, arrange broccoli in a single layer and cook, tossing occasionally, until broccoli is bright green and lightly charred around the edges, about 3 minutes. Transfer to a large plate.Step 4Pour 2 Tbsp. oil into same pan and heat over medium-high. Once you see the first wisp of smoke, add rice and season lightly with salt. Using a spatula or spoon, press rice evenly into pan like a pancake. Rice will begin to crackle, but don’t fuss with it. When the crackling has died down almost completely, about 3 minutes, break rice into large pieces and turn over.Step 5Add broccoli back to pan and give everything a toss to combine. Cook, tossing occasionally and adding another 1 Tbsp. oil if pan looks dry, until broccoli is tender and rice is warmed through and very crisp, about 5 minutes. Transfer mixture to a platter or divide among plates and set aside.Step 6Wipe out skillet; heat remaining 2 Tbsp. oil over medium-high. Crack eggs into skillet; season with salt. Oil should bubble around eggs right away. Cook, rotating skillet occasionally, until whites are golden brown and crisp at the edges and set around the yolk (which should be runny), about 2 minutes.Step 7Toss celery, cilantro, and mint with 3 Tbsp. reserved dressing and a pinch of salt in a medium bowl to combine.Step 8Scatter celery salad over fried rice; top with fried eggs and sprinkle with red pepper flakes. Serve extra dressing alongside.How would you rate Crispy Rice With Ginger-Citrus Celery Salad?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleVery delicious. Seems like a lot of steps but after you make it once, it's a breeze.  Excellent as a main dish for brunch/lunch or a side dish with asian meats. Victoria P.Novato, CA11/14/2021I have made this dish at least four times now, for myself and for guests. It is a winner!\nDenicePA6/4/2021Surprisingly amazing! The mix of citrus and salt and savory flavors is perfect, plus the crispy and crunchy textures! Can't wait to make it again.SarahIN3/15/2021This recipe was so good and full of flavor! The fresh herbs make a big difference. Anything that gets me excited about brown rice and broccoli is a win. DianaPittsburgh, PA2/4/2021This is a tasty and simple addition to our lighter fare. I doubled the dressing and had some left-over. Good! It tasted great the next day. We are so pleased with so much of this healthy menu. AnonymousSan Francisco, CA1/30/2021 Amazing! We doubled the dressing recipe because it was so yummy. Easy and delicious!Emma RNashville, TN1/23/2021Recipe times are trash. Fatboy_antWashington, D.C.1/14/2021So, so very delicious. I’m saving this one!AnonymousSanta Maria, CA1/13/2021Wow - what an epic, simple recipe for a healthy weeknight meal! Super easy to riff on too. I used red cabbage and carrot because I didn’t have broccoli. I simply added it in at the end and it heated through with the heat of the rice. Super zingy and bright making you feel satisfied.AnonymousNew Zealand1/11/2021Hands down the BEST BA recipe I have made. Incredibly easy. I ended up making a few substitutions out of laziness to avoid going to the store (added the juice from 1.5 lemons rather than an orange, used some leftover cauliflower in addition to the broccoli). I can't wait to make this again. AnonymousTulsa, OK1/10/2021This was really yummy! The citrus dressing was the best part - I added another clove of garlic because I'm a garlic-head but any more would have been too strong. I made it with fresh rice (did not plan ahead enough to have it be chilled) and it still turned out great.Anonymous1/10/2021Really liked this! I scrambled the eggs instead of frying bc i was craving a more “classic” fried rice texture.Anonymous1/9/2021I was surprised that I liked the celery salad here (although I did soak it in the dressing before starting any other part of the recipe). That said, this was way better as leftovers. Fresh, the rice was way TOO crispy (imagine eating popcorn with a fork), despite taking it off the heat way before it stopped crackling. I can't help but wonder if it would've been better cooked like traditional fried rice (with more sauce), rather than adding it after cooking.Anonymous1/8/2021Nice & fresh tasting. I can't help but feel that it might have been easier to use a second pan? Lots of removing food from pan only to put it back again. I dirtied an extra plate rather than an extra pan. Terri Victoria, BC Canada 1/8/2021Loved it! Not a celery fan, but I have to admit that it was awesome here. The celery, herb, and dressing topper might have even been the very best part! AnonymousOxford, MS1/8/2021Explore Bon AppétitFried RiceBroccoliVegetableRiceRice & GrainsEasyWeeknight MealsOne-Pot MealsMainDairy-FreeVegetarianGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}