{"id": "311759ccdcbb9890a1006dc17cfc42ee", "url": "https://www.bonappetit.com/story/sugar-snap-peas-with-creamy-dressing", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Easiest No-Cook Side You’ll Make All Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Easiest No-Cook Side You’ll Make All SeasonSugar snap peas are so tender and fresh this time of the year, we like ‘em raw with a tangy, creamy dressing.By Carla Lalli MusicMay 1, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The whole point of cooking is to transform an ingredient into a better, more delicious version of itself. That is true if you slice, season, and sauté an eggplant before eating it, because it is inedible raw, and it is also true if you put a little salt on a fresh cucumber, which even a child knows will make it taste better.Sure, I suppose you could do nothing to the season’s first sugar snap peas, aside from pulling off their wispy strings before crunching them up. I’ve even skipped that detail out of necessity when snacking on them while driving, and I didn’t mind the extra fiber. But you could also honor the sugar snap peas by dressing them up a little, just like the half-assed application of bronzer I subject myself to before leaving the house on the weekend. Like “barely there makeup,” the best kind of cooking is when you do very little but feel like you’ve done something brilliant and magical, which is exactly what’s going on in this sugar snap pea salad.Want this letter before it hits the website? Sign up for our newsletter!To be clear, there’s no cooking involved. The first step is to buy great sugar snap peas, which should have smooth, shiny pods, perky stems, and no signs of shriveling or browning anywhere. Run your finger over them—the pod should be taut and unblemished and the peas should feel like they’re fitting snugly inside—you know, snug as a bug in a rug. Sort around in the bin before buying, if you must, but don’t be annoying about it. String them by pulling up from the tail end and unzipping the thin floss that runs along their top side (straight side) to the stem end. Then cut the stringless sugar snaps on an angle into thin slices, and accept that some of their tender inner peas will fall out as you go. The more textures and shapes, the better. Scoop them into a little bowl and season with olive oil, lemon, and salt.Then you make a creamy, tangy dressing with buttermilk, yogurt, a little garlic, and lemon juice. If you happen to have yogurt but no buttermilk, you could thin it with regular milk or even water. If you don’t have a lemon, use rice vinegar or white wine vinegar. If, on the other hand, you have buttermilk but no yogurt, amp up the buttermilk with some olive oil for richness and body. Omit the garlic and use a sliced scallion. There are no reasons not to make the dressing—that’s all I’m trying to say. The goal is something cooling and zippy to go with the sweet and crunchy peas. Pile the peas on top of the dressing and season everything together with a little more salt and a few cranks of black pepper. Were the peas beautiful before you took these extra steps? Sure. Are they a bewitching, beguiling, more captivating version of themselves now? Yes. But if anyone asks, I’m telling them it’s a natural glow.Explore Bon AppétitCarla NewsletterSpring SidesSugar Snap PeaRead MorecookingGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeBy Aliza AbarbanelcookingThis Recipe Wants You to Know That Meatballs Are Totally Appropriate for SpringBy Amanda ShapirocookingThis Turmeric Yogurt Dip Is a Great Excuse to Load Up on Spring ProduceBy Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-01", "author": ["Condé Nast", "Carla Lalli Music"]}