{"id": "311909e6c6c5c3ee264c0fc33de6a908", "url": "https://www.bonappetit.com/story/prioritizing-joy", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "I’m Prioritizing Black Joy in Our Fight for Justice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I’m Prioritizing Black Joy in Our Fight for JusticeThese are some of the people and things that bring me joy, from a month-long walking meditation to vegan chef Tabitha Brown.By Devyn BeswickJuly 23, 2020FacebookTwitterEmailPhoto by Tierney GearonFacebookTwitterEmailAfter weeks of grieving the lives of Ahmaud Arbery, Breonna Taylor, Tony McDade, and George Floyd, and taking to the streets to protest amidst COVID-19, I was losing momentum. As a writer, a social worker, and a Black woman, I have been given countless gifts to contribute to this world and yet, I felt stuck.I struggled to find my purpose, not because I didn’t know what to do, but because something was missing: I knew that before I could bring peace to the world, I had to find peace within. Black women are often the first on the frontlines, the first to offer their time and hearts to every person and cause; I was riddled with guilt when I decided that I would allow myself time for healing, but I knew that my ability to show up for my community was dependent on my ability to show up for myself. I had to find ways to give myself space—to grieve, but also to nourish both my mind and body. If that meant silent meditative walks in the backyard, baking a couple loaves of banana bread, and journaling profusely over a cup of Moroccan mint tea, then so be it.Black joy itself is a revolutionary act, essential—not counter—to my activism and to the liberation of my community. It may feel unattainable, or like a distant memory, but as Dr. Angela Davis has taught us, joy is what allows us “to bring our entire selves into the movement.” It must be prioritized.These are some of the people and things that bring me joy, and remind me to live my life fully for all those who no longer can:Walking in the Footsteps of GirlTrek’s Black History BootcampFor 21 days, GirlTrek’s walking meditation led 650,000 women in the footsteps of 21 powerful Black women. Each day, participants received an email centering a Black woman who has shaped our history in some way, from Shirley Chisholm to Marsha P. Johnson, with speeches, videos, playlists and questions to consider during a meditative walk. This bootcamp reinforced my belief in the importance of radical self care and empowered me to keep on keepin’ on. The fire that drove these women to continuously fight for justice now burns in each of us—and while the 21 days are over, all the resources can still be accessed on their site.Tabitha Brown’s Contagious EnergyTabitha Brown is a Black woman, mother, wife, vegan blogger, and the light we didn’t know we were missing! She has used her platform to not only talk about Black wellness as it pertains to food but also to spark conversation about social justice, family, marriage, beauty, and all that brings her joy these days. From her “Very Good Mondays” where she reviews various products from Black-owned businesses with her daughter, to her quick cooking videos, she brings excitement to all things wellness related. Her positive energy is infectious.Finding Liberation in PoetryWhile I’m usually not one for audiobooks, listening to Nikki Giovanni and Sonia Sanchez recite their poetry on their respective albums immediately soothes my soul. Both poets have used their artistry to speak on Black love, challenges, triumphs and above all, how to move forward. Their poetry has been a true symbol of love for me—love of self and love of another in all our glory. Hearing their tender, yet powerful, voices over gospel music and blues is the very thing we could all use right now.Playing ‘We Are Not Really Strangers’The purpose of this game is to empower meaningful connections, deepening your existing relationships and creating new ones. Players work their way through three levels of questions that focus on perception, connection, and reflection. Questions such as “What would your younger self not believe about your life today?” encourage you to reflect on your life and all that you have become. The game challenges us to be vulnerable for the sake of genuine connection—and a free additional PDF goes a step further with a few questions to guide conversations around race and privilege. I’ve played with my family and friends on separate occasions and we laughed, cried, and felt more compassion and understanding for one another. The vulnerability is worth it!The Healing Power of Nina SimoneWhen I can’t find the words to explain my grief, my anger, my triumphs and my love, I know I can turn to music. These days, Nina Simone is the only one who is getting it right. Her music is the essence of Black life—the struggle, beauty, and strength that we possess. My day begins with her voice because her energy is unmatched. She awakens every part of my body, as nobody can possibly listen to Feeling Good without at least swaying their hips. Her music serves as a constant reminder to rise again and cherish the day.Explore Bon AppétitHealthyishSelf CareessayRead MoreLifestyleThere Is No Wellness Without Anti-RacismBy Courtney Robinson and Uzma ChowdhuryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-23", "author": ["Condé Nast", "Devyn Beswick"]}