{"id": "311d471bb7a0e658ff8569906fd2e902", "url": "https://www.bonappetit.com/story/rent-week-matrimony-beans-fava-chickpeas", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Matrimony Beans Are Keeping Me Afloat This Rent Week (and Wedding Season) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMatrimony Beans Are Keeping Me Afloat This Rent Week (and Wedding Season)Wedding season is here, and it turns out that love is pretty expensive. Beans, on the other hand, are not.By Alex DelanyJuly 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’m not sure when I’ll get married. Or if I ever will, for that matter. But my friends? They know when they’re getting married. They’re getting married now. Why? Well, do you hear that? That’s not a mosquito. It’s the buzzing energy of eternal love. And that smell? No. It’s not the smoldering charcoal beneath your sizzling burgers. It’s the beautiful, burning flame of passion. Oh yes, my friends: It’s wedding season. And guess what! Wedding season is expensive as shit! Especially when someone asks you to be in their wedding.Let me make something quite clear before we go any further. If you are my friend and ask me to be in your wedding, I will absolutely be in your wedding. I consider that a true honor, a testament to friendship and a sacred brotherly bond. But it’s an...expensive honor. There’s a lot of stuff you have to do when you’re in a wedding party. I’m currently going through this process, and I’d like to take a minute to publicly apologize to my credit card. Flights and hotels and dinners and drinks and bachelor parties and more flights and Air BnB’s and wedding gifts. Deep down, I knew what I was signing up for. I just didn’t really think about it.So, as is tradition, this comes back to offsetting my financial mismanagement with affordable meals. And I’m pretty stoked on this month’s Rent Week recipe, because it is both flavorful and made from beans. Beans, as some of you may know, are a Rent Week workhorse. So throw on this Bean Season playlist (good for all seasons and completely free of charge) and get ready to get down with some legumes. We’re going to be making some garlicky, lemony fava beans that’ll get scooped up with pita or naan or whatever bread you have on hand.Wait. Before you go thinking, I don’t know. This dish sounds kind of familiar, let me say this: I didn’t invent it! It’s a riff off of a classic Middle Eastern dish called ful mudammas, which could also be foul moudamas or ful medames, depending on which country you happen to be eating it in. There are many interpretations of this dish, from Egypt to Lebanon to Armenia, but the common threads are a fava bean base, a simple set of flavors, and a cost-effectiveness that makes for a perfect Rent Week meal.Here, have some Matrimony Beans.\nPhoto by Chelsie CraigWe’ll start with the beans. We need 2 cans of fava beans and 1 can of chickpeas. Strain and rinse 1 can of fava beans and 1 can of chickpeas. Yes, we are using canned beans. If you want to make and use dried beans, that totally works too. But for the sake of weeknight exhaustion, canned beans will do just fine. We’re going to mash some of them up anyway, so texture isn’t our number one priority. Mash the rinsed fava beans lightly with a potato masher or the back of a wooden spoon, so they split open and the interior spreads around. Keep the chickpeas whole.Add the mashed fava beans, the chickpeas, and the other can of fava beans, liquid and all, into a skillet. Turn the heat to medium-high, and add 6 cloves of grated garlic. Use a Microplane for that! Drizzle a glug of olive oil over the whole thing and stir, until the oil and garlic become one with the beans and the bean liquid. The liquid should start to simmer.Tomatoes make this whole thing feel a little more special.\nPhoto by Chelsie CraigSeason the beans with kosher salt, some chile flakes (I like using Aleppo pepper, maras biber, or urfa biber, but a bit of regular crushed red pepper will work fine) and a pinch of toasted coriander and cumin. I like to toast whole coriander and cumin seeds and then grind them with a mortar and pestle for the most intense flavor, but if you don’t have a mortar and pestle, whole spice seeds, or the drive to grind spices, you don’t have to. It’s fine. I won’t be disappointed. Let this bean mixture go for 5-10 minutes in the skillet, stirring occasionally. Remove them from the heat, and mix in the juice of 1½ lemons.You can go all-in with the beans and just the beans. The garlic and the lemon provide enough flavor to carry the dish. But I like a little somethin’-somethin’ on top of everyone’s bowl, just to make things feel special. Slice some cherry tomatoes in half, dress them with a bit of olive oil and kosher salt, then toss them with a handful of fresh parsley leaves and the juice from the remaining ½ lemon.Now, some bread. Griddle some pita, naan, or whatever carb-y vehicle that happens to be hanging around in a skillet with a bit of olive oil. You want a warm, crispy piece of bread to dip into the beans.Beans, meet bread. Bread, meet beans.\nPhoto by Chelsie CraigWhat you have right there is a bright, filling dish that you can probably make with stuff that’s already in your pantry. Go ahead and eat this for dinner (I do!), but it’s also eaten for breakfast in many places. And I have to say: It’s phenomenally tasty when it’s cold, straight out of the fridge the following morning. (Or just later that night, as it were.) So tasty you could...give it as a gift...at a wedding.No. I will not be giving bowls of ful mudammas as wedding gifts. But I will be eating a whole lot of this up until the moment I’m sweating my ass off in a suit, watching two friends say \"I do.\" These beans are going to keep my confidence in holy matrimony (and my checking account) at an all-time high. Plus, I hear it’s an open bar all night at the wedding. So that’s nice too.Want something that isn't beans? How about chicken wings? Or Stromboli?Chicken Wing Dinner: A Rent Week WinnerThis is me giving you permission to eat chicken wings—and only chicken wings—for dinner tonight.View StoryThis Tax Season Stromboli Recipe Is My Only DependentIt's basically just a pizza rolled up into a giant log. And when you're paying rent AND taxes in the same month, it's here for you.View StoryExplore Bon AppétitBasicallyRent WeekFava BeanChickpeaGarlicLemon JuiceCherry TomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-02", "author": ["Condé Nast", "Alex Delany"]}