{"id": "3121d7186304936c68f75d42432fa071", "url": "https://www.bonappetit.com/story/thanksgiving-issue-2020-editors-letter", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "This Thanksgiving May Be Different, But There Will Be Good Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Thanksgiving May Be Different, But There Will Be Good FoodExecutive editor Sonia Chopra doesn’t know exactly how she’ll be celebrating, but she’s counting on a full table.By Sonia ChopraNovember 18, 2020FacebookTwitterEmailPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.My family has our Thanksgiving system down to a T. Or, I should say, down to the manila folder in which we keep a decade’s worth of menus marked up with quantities and guest lists, keeping tabs on the first dish to go (mac and cheese) and the biggest hits (Dad’s chicken-and-waffles appetizer, Mom’s perfect squash soup). Every year I perform a sleight of hand, making sure we end up with an extra tray of cornbread dressing, my favorite, that I can eat for days afterward, sometimes straight from the fridge like a teenager, until it’s gone. My brother mixes cocktails, his girlfriend roasts the turkey, and a family friend always brings the most beautiful carved glass platter decorated artfully with half-moons of winter fruit.Want this letter before it hits the website? Sign up for our newsletter!I must have you, tater tot casserole.\nInevitably someone turns on a football game and someone else puts on a kettle for chai, and my grandmother promises that next year she’ll make pumpkin halwa, a pudding-like treat I love, one that would look right at home next to both silver-leaf kaju katli and a tall sweet potato cake. We never make pies because we know someone will bring an extra, and I think that about sums up what the holiday has always meant to me: good food. The love and support of our community. And familiarity too.You know the drill from here: This year will be different. Like so many of you, I don’t know where I’ll be, or whom I’ll be with, or what I’ll be eating. I’ve found comfort in reading through this issue’s very 2020, new-to-everyone Thanksgiving menu plans (hello, tater tot casserole), learning new-to-me techniques from the recipes (hello, tiny pies), and remembering that I’m not alone, that I am not the only one trying my best to figure things out.I don’t know how you plan to celebrate this month, if at all. But I hope you have plenty of good food and good people around you, two things we know can always help us through.Explore Bon AppétitThanksgivingLetters From the EditorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-19", "author": ["Condé Nast", "Sonia Chopra"]}