{"id": "31298ab9350f3d631e3bd6e09275c060", "url": "https://www.bonappetit.com/recipe/raspberry-jam-with-bitters", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Raspberry Jam  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueRaspberry Jam with BittersBy Claire SaffitzApril 17, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintIf you’re not going to eat raspberries fresh out of hand by the fistful, making jam is the next best thing. A healthy shot of cocktail bitters at the end does wonders. The flavors of the herbs and botanicals in the bitters complement the natural floral sweetness of ripe fruit.IngredientsMakes about 1 pint18oz. fresh raspberries (about 5 cups)1¼cups sugar1Tbsp. finely grated orange zest2Tbsp. fresh orange juice2Tbsp. fresh lemon juice1Tbsp. Angostura bittersSpecial EquipmentA 1-pint jarPreparationStep 1Place a small plate in the freezer. Bring raspberries, sugar, orange zest, orange juice, and lemon juice to a simmer in a large saucepan, stirring gently to dissolve sugar. Once sugar is dissolved, increase heat and boil, skimming foam from surface often, until mixture is reduced by a little more than a third and bottom of pot is visible when stirring, 15–20 minutes.Step 2Dab a tablespoonful of jam onto frozen plate and freeze 1 minute. Drag a finger through jam to see if it wrinkles. If it does, remove saucepan from heat and stir in bitters. If jam doesn’t wrinkle, keep cooking, testing again every minute until it is does. Transfer jam to jar, cover, and let cool. Chill until ready to use.Step 3Do Ahead: Jam can be made 2 months ahead. Keep chilled.Photo by Alex Lau, food styling by Rebecca JurkevichHow would you rate Raspberry Jam with Bitters?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentSpreadsJamRaspberryBerryFruitSummerEasyDairy-FreeGluten-FreeNut-FreeVeganVegetarianPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Claire Saffitz"]}