{"id": "31434510a64bae92ddf3c5cda44981fa", "url": "https://www.bonappetit.com/story/jose-andres-dinner-party", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "José Andrés Would Serve Oysters, Gazpacho, and Fried Eggs at His Dream Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJosé Andrés Would Serve Oysters, Gazpacho, and Fried Eggs at His Dream Dinner PartyThe chef-turned-humanitarian's guest list includes three of history's most powerhouse women. By Dawn DavisSeptember 21, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.For our annual Restaurant Issue, we’re focusing on the people working to improve their industry and their communities (meet our 2021 Heads of the Table here!). How could we not, then, turn the lens on chef José Andrés, whose organization World Central Kitchen provides meals in times of crisis. But if you want to know who Andrés would invite to his Dream Dinner Party, you’re in the right place.You’ve traveled the world and met so many people. Which three would be at your dream dinner party?Dolores Huerta. She’s a fighter for workers’ rights, for farmers, for food. When we talk about hunger and food production, we often miss the most important part, which is the people. Huerta fights for the people. I’d also invite Harriet Tubman, who brought many slaves to freedom. While others were giving speeches, she had boots on the ground. She kept going back into danger because she didn’t want to have freedom while others didn’t. And Clara Barton, founder of the American Red Cross. Her office was in D.C., where I opened my first restaurant. She did amazing work, caring for wounded soldiers and bringing relief to their families through the Missing Soldiers Office.Tubman’s on my list too. What would you ask this group of powerhouse women?Women carry the world forward. Yet it seems men dictate how we move humanity forward. Why? What can we do to bring more women into leadership? How do we ensure armies of women are in every corner of society, running companies, running hospitals? This is not about equality. It’s about pragmatism.What’s on the menu? I’d start with gazpacho. I was amazed to discover the recipe for gazpacho—the quintessential summertime soup in Spain, where I come from—in a 19th-century cookbook from Virginia, in the United States…the country where I belong. When you’re an immigrant, you have a heart in both places. So you can build bridges, and show how many things two cultures share, versus how different they are.Women who change the world need more than soup!Oysters. I am crazy for oysters. I’m becoming briny like the Chesapeake Bay, and I’ve got a lot of stories—from the history of oyster ketchup, a forgotten condiment made from oysters, vinegar, and black pepper [it’s older than tomato ketchup, made as far back as the 1700s] to the tales I’ve heard from generations of oyster farmers.Cold soup and oysters sound lovely but I need more. My mom, a nurse, used to roast peppers until the skin turned brown; then she would peel them and separate the skin from the seeds. They were sweet, delicious, and had a nice touch of viscosity. She’d put them in oil with garlic, then add water and cook them slowly until an emulsified sauce formed. Then a few drops of sherry vinegar for acidity. Those red peppers alone, they deserve a round of applause.With what do you serve this stew of peppers? Fried eggs. When people ask me why eggs are so big in Spanish culture, I show them a painting by Diego Velázquez, with a woman frying an egg in a terra-cotta bowl over a fire. Show me another culture that has such an amazing painting portraying a woman frying an egg. And eggs with peppers? Believe me: life-changing.Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRead MorecultureBillie Jean King’s Dream Dinner Party Has an Open Door PolicyBy Dawn DaviscultureDirector Barry Jenkins Would Pair Vintage Wine and Soul Food at His Dream Dinner PartyBy Dawn DaviscultureMindy Kaling Would Only Have One Guest at Her Dream Dinner PartyBy Dawn DaviscultureStacey Abrams on the Secret Ingredient to Great CheesecakeBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-21", "author": ["Condé Nast", "Dawn Davis"]}