{"id": "31535365d38f41a948436c989616a258", "url": "https://www.bonappetit.com/story/carla-lalli-music-cooking-rules", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Fat Is Good, Headphones Are Bad—And More Essential Cooking Rules From Carla Lalli Music | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFat Is Good, Headphones Are Bad—And More Essential Cooking Rules From Carla Lalli MusicOur food director has a few key pieces of advice to share with you.By Carla Lalli MusicOctober 3, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis month, we're doing a mini series on our podcast. Each of the Bon Appétit Test Kitchen editors will be sharing their top 10 cooking rules: the techniques they swear by, the ingredients they can’t live without, and the mindsets that keep them going. This week: our one and only food director, queen of the Test Kitchen, and lover of all things saucy glossy, Carla Lalli Music.1. Embrace fat.Fat is integral to any dish, and not just because it adds flavor. Fat is also a cooking medium—think about the olive oil you swirl into a pan before sautéing, or the deep bath of peanut oil you’d add to a cast-iron skillet to fry some chicken. Heat moves through fat into the ingredient you’re cooking, connecting the cooking equipment to the food itself, and if you don’t have enough of it, your food may char instead of sizzling and browning.2. Zone out your fridge.Messy bed, messy head—but for the kitchen. I am a big believer in zoning out my fridge in the same way I organize my closet. You can’t just shove everything in there and expect to be able to find what you’re looking for. I learned this rule in restaurants, where it’s super important to be able to locate what you need quickly. Keep dairy in one area, condiments in another. I have a half shelf dedicated to leftovers, and another spot that is for cheese, deli meats, and charcuterie only. I even keep fruit in one crisper drawer (citrus, apples, grapes), and vegetables in the other (lettuces, cucumbers, herbs, etc.). That way, if you can’t find something in the area where it belongs, you don’t have to rummage all around. You probably don’t have it.3. Set your oven up for success.I wrote this one for myself, since I need to be reminded. Rick Martinez taught me these rules, and I think about them everytime I behold my kinda-crusty oven interior: A clean oven conducts heat much more evenly and efficiently than a dirty one. My oven isn’t clean. Maybe that’s why it runs 50 degrees cooler than the temperature on the dial.4. Buy a black steel pan.Black carbon steel pans are as effective as conducting and retaining heat as cast-iron, but without the bulk and weight. They’re often sold as “crepe pans,” but come in lots of diameters. I use a 9 ½-inch one made by Matfer Bourgeat—affordable and indestructible. It’s my go-to for searing scallops or steaks, making grilled cheese, and yes, crepes!Buy it: Matfer Bourgeat 9 1/2-inch Black Carbon Steel Frying Pan, $36 on AmazonToo much fun in the bulk bin.\n5. Have a favorite dish? Cook it forever.Think of this like your favorite jeans. Why buy other jeans when those ones are the best? If something is working, work it.6. Shop first, decide what to make second.I talk about this rule a lot in my book, Where Cooking Begins. If you go to the market with a very specific recipe and list of ingredients in mind, you can set yourself up for disappointment. What if they don’t have what you needed? What if the salmon you thought you were making doesn’t look so hot? Instead, stock your kitchen with basics (and I’d argue you should order those online), such as oils, vinegars, nuts, dairy, condiments, grains, pasta, canned beans, and tomatoes. When you shop in person, go rogue! Look for peak-season produce, the clear-eyed fishes, and the most marbled meats. You’ll end up coming home with the best ingredients the store had to offer, and can search for the right recipe once your purchase is in hand.7. Shop the bulk bin, but don’t do big-batch cooking.I love love LOVE the bulk bin, where I buy dried beans, grains, seeds, and dried fruit for less per pound than the pre-packaged brands. But I don’t cook in big batches anymore, preferring to spend my weekend actually hanging out with the people I love instead of making meals for the freezer.Knives are extensions of your hands in the kitchen. So find the right one for you.\nPhoto by Alex Lau8. Always buy knives in person.You can buy a lot of things online to no ill effect, but a knife is something you should hold in your hand before you throw down your credit card. The weight of the handle, the length of the blade, the shape and style of the knife itself—you need to touch it to know if it feels right for you. I have small hands, and I love my 5-inch utility knife. But a person with big paws might feel like they were playing around with a nail file.9. Don’t cook with headphones on (but definitely get into podcasts).Cooking is a full-sensory experience. I have a galley kitchen, and when I’m at my cutting board or sink, my back is often turned to the stove. If you can’t hear, you’ll miss the rattle when a pot of water comes to a boil, or when the juicy sounds of an onion softening in butter turns into the rough scratchy sound of that same onion burning to a crisp. The time to put the earpods in? When you’re washing up.10. Stop relying on recipes.Recipes are great and everything, don’t get me wrong. But all the looking back and forth between the recipe and the stove, the precise measurements of this and that when a little pinch or a palmful will do… That specificity and exactness can sometimes get in the way of paying attention to what’s happening in the pan and tasting your food while you go. Cooking is a creative act. Be free!Listen to the full discussion on the BA Foodcast:ContentThis content can also be viewed on the site it originates from.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Read MorecultureIt’s Time to Stop Using Old Spices—and More Essential Cooking Rules From Brad LeoneBy Brad LeonecultureYour Yogurt Better Be Full Fat—and More Essential Cooking Rules From Andy BaraghaniBy Andy BaraghanicultureOver-Salt Your Cookies—and More Essential Cooking Rules From Molly BazBy Molly BazcultureChopsticks Are the One Tool You Actually Need Around—and More Essential Cooking Rules From Chris MoroccoBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-03", "author": ["Condé Nast", "Carla Lalli Music"]}