{"id": "315a4ac6167e7e8e7ff6980839443f3e", "url": "https://www.bonappetit.com/story/wellness-shots", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Wellness Shot Review—I Drank Them For a Week and It Was a Wild Ride | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Drank Wellness Shots for a Week and It Was a WILD RIDEIcarus flew too close to the sun; I had too many juice shots.By Jesse SparksJuly 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI’m sitting on one of the wooden benches in front of my gym on a steamy summer night. My lungs burn and my legs are ready to call it quits. While wondering if I’m really cut out for this fitness thing, I see it: A plastic bottle filled with a deep, ruby-hued fluid sitting in a tub full of ice with a sign advertising a free wellness shot. Spurred on by free things, as I often am, I hobble over to the tin ice bucket, plunge a hand into the icy depths, and fish one out.The liquid shimmers just right in the light creating a kaleidoscope effect on the sidewalk. I chug it and…. It tastes like gritty, cold mud. It did get me thinking, “Do these weird little things actually make people feel better? Who would I be if I actually took wellness shots consistently?” So, I decided to investigate.Because I am a Responsible Adult™, I turned to registered dietitian Mia Syn, MS, RDN, and Tracye McQuirter, MPH, author of Ageless Vegan, for their takes on the seemingly everlasting trend and what it actually means for those trying to ~live well~.“With wellness shots, you may be getting a higher amount of vitamins, minerals and antioxidants than you otherwise would,” says Syn. “They’re often marketed as cures for ailments because of their concentrated nutrition. Right now there is not enough evidence to support their therapeutic use.”McQuirter agreed, encouraging everyone to think more about how the shots would complement a well-rounded and balanced diet, rather than make up for a severely skewed diet. “Wellness shots have a really broad definition, but they’re about making up for or supplementing the RDAs or recommended dietary allowances for the nutritious foods people may not get,” she says. “I’ve been traveling, so I made myself a shot because I haven’t been able to eat enough dark leafy greens. That is an example of a good application for a juice shot.”Armed with these professional opinions, I called up Project Juice, a company known for an array of juice cleanses and shots, and got a batch to try for myself. How would they make me feel, even if the science wasn’t there? The answer was… alarming.On the first day of Shot-mas, I started with the Turmeric Tonic, a vibrant, glowy orange blend of turmeric, pineapple, chamomile, aloe, ginger, and chamomile extract. The promises of relieving joint pain, reducing skin irritations, and boosting beauty didn’t hurt either. A generally sweet and inoffensive, albeit acidic, swig later, I had yet to become a slightly shorter Kofi Siriboe. But I did fight through the post-work haze to get a run in, so I guess that’s one point for the shots.These wellness shots are the real deal.\nPhoto by Alex LauThe next day, I was riding on a high and ready to consider a career as a juice shop mogul. I tried the Energy Elixir, a greenish-brown potion advertising to up your mental clarity and alertness for day two of Shotsgiving. Seeing as stressed and tired can sometimes be my defaults, it felt like a fitting remedy. It was an herbal little mix, pleasantly grassy in a way that felt like rolling down a hill in the middle of spring. It didn't have that mouthful-of-lawn aftertaste like some shots I'd tried. And I actually did feel more alert afterwards. In all fairness, that energy boost could have been the gaggle of people swarming the mini fridge near my desk to try a juice. Either way, another point for juice.I’d gotten bold with two successes in the bag, so on the third day I got careless. It wasn’t until after chugging it that I looked at the back of the bottle and realized my mistake. The ingredients? Orange, lemon, and ginger accompanied by a hearty dose of cayenne, echinacea, and reishi mushrooms. For a tonic that boasted antioxidants and anti-inflammatories, all it did was antagonize my throat. This one would be better mixed into a smoothie or some other vessel prime for diluting its hot intensity.On the fourth day, the Temple Turmeric Pure Prana Fire Shot with raw cider vinegar called to me. Because I am a fool, I answered it. It was a powerful splash of fire and acid and tang that felt like it was clawing its way down my throat with each glug. A few hours later, the shot returned to remind me and my bowels that it was still as fiery as ever.According to McQuirter, my body's response was not uncommon. “Sometimes, when people first start, they may need to use the bathroom immediately,” she says. “When I first started making my own shots, I threw up because it was too intense for me at the time.”The comment gave me peace. But, after a day off, I had a similar response to the Project Juice Liver Flush. I had to avoid contact with people who sit along my path to the bathroom (because yes, I am going to the bathroom again. And yes, I did just go. And yes, I will be back.) Frankly, I only had myself to blame. Juice: 3, Me: Yikes.I took a couple of days off because, contrary to popular belief, I am not a masochist. And I could feel McQuirter’s advice replaying in my head. “You really have to listen to your body,” she told me over the phone. And even though I was ready to wave a white flag, I actually did feel better. I didn’t feel as bloated or experience the foggy mental patches I sometimes get when I'm under-rested and over-caffeinated.On my final day of the juice shot experiment, I took a tepid sip of the Immune Boost and was pleasantly surprised by the refreshing, dare I say enjoyable taste of orange, lemon, ginger, and cayenne. I braced for the stomach fits, but instead I spent the rest of the day on an energetic high. I craved greener things in an effort to preserve the high, and I ate more intentionally rather than getting caught up and forgetting to eat as I often do.And, for me, that was the secret to wellness shots overall. They made me listen to my body in ways I often forget to. I re-assessed my diet with precision, thought about what the stomach rumbles were trying to convey, and got (a little too) acquainted with my digestive system.Wellness shots may not have much science backing them, but I have a...gut feeling they’ll make more appearances in my future.Explore Bon AppétitHealthyishJuiceTurmericLifestyleTrendsRead MoreLifestyleWhy Are People So Obsessed With Fitness Bread?By Maggie LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Jesse Sparks"]}