{"id": "315f98768381f37f224cded627e4b89b", "url": "https://www.bonappetit.com/story/elizabeth-acevedo", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Elizabeth Acevedo Fights Writer's Block With Curry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestylePoet and Novelist Elizabeth Acevedo Fights Writer's Block With CurryThe YA writer queues up some Lizzo and sings into a wooden spoon. By Leigh-Ann JacksonOctober 9, 2019FacebookTwitterEmailPhotograph by Rhonisha FranklinFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is poet and author Elizabeth Acevedo, who celebrates Latinx culture with her award-winning young adult novels.“The thought of cooking helps me let go of the mixed-up feelings inside.” These are the reflections of Emoni Santiago, the pensive teenage protagonist of With the Fire on High, Elizabeth Acevedo’s latest bestselling YA novel. As Emoni juggles high school, part-time fast food shifts, and raising her two-year-old daughter, she finds peace in her grandmother’s North Philly kitchen, cooking inventive dishes like fried green tomato Caprese with queso frito that reflect her African-American and Puerto Rican roots. When she whips up meals “so good they’d make you twerk something,” she’s trying to prove to the world (and to herself) that she can transform her daydreams into a delicious reality.Acevedo’s first novel, The Poet X, won a National Book Award and the Carnegie Medal after its 2018 debut. Her next HarperTeen book, Clap When You Land, is set to drop in May 2020.The 31-year-old slam poet-turned-novelist gravitated toward writing at an early age, and competed in her first poetry slam at age 14. She went on to become a National Slam Champion in 2016 and has performed on stages around the globe, including Madison Square Garden and the Kennedy Center. Acevedo recalls writing the first draft of With the Fire on High as part of a National Novel Writing Month exercise in 2013. Back then, the poet saw the project as little more than a prose-writing experiment. Fast-forward to the present and she’s adapting the coming-of-age novel into a screenplay for Picturestart.Food plays a key role in Acevedo’s work, but growing up in Morningside Heights, she shied away from the kitchen, not wanting to compete with her Dominican mother’s formidable cooking skills. “My ability to really start discerning flavors and different types of cuisine really started to happen because of moving [to D.C.],” she says.These days, Acevedo’s got the culinary skills to make anything from moro (the Dominican rice and beans dish) to a Thai curry, and does so whenever she needs a brain break. “I love that it’s a different kind of creativity than writing,” she says of cooking. “There’s not as much a ‘brain’ thing happening, as there is a ‘hands, tastes, and colors’ thing.”We spoke with the author about her favorite decompression dishes, her global palate, and her commitment to writing for teen audiences.When I was a teenager … I was already writing and sensed it was something that I loved and was good at, and that helped me to connect to other people in a way that was powerful. So, I think my dream then was to create a writer’s life.I choose to focus on YA fiction because … I was an eighth grade English teacher and I just think it’s a really exciting age group to write for. There’s still some hope left in that age. Having been a teacher at a school that was predominantly Latinx, seeing what it does for young people to realize that a narrative can be lovingly told about them, that’s really important to me.My favorite comfort food is …  sancocho, this amazing stew that has all these root vegetables and cilantro and different kinds of meat in it. It’s usually done as a Dominican stew of welcome. Also,  my mother makes really good fried eggs and sweet plantains. To this day, when I go home, that’s the request I put in.I most enjoy cooking for …  my husband. At this point, I think he’s scared because I’ll cook something and watch him eat it like, ‘You better say it’s great!’ But he’s one of my favorite audiences because he’s seen the growth of a lot of my dishes.When I cook, I like to listen to …  salsa and bachata. A lot of Marc Anthony, Aventura, Romeo Santos, La India, and all the things I grew up listening to. And these days, I’m really enjoying Lizzo — joyous music that’s going to make me stop and sing into a spoon.My go-to food spots in D.C. are … Nooshi and Soi 38, because I love a lot of Thai; Los Hermanos, this cafeteria-style Dominican spot that’s no-frills; and Ambar, which is this Balkan small plates restaurant. Also, The Spice Suite is this fragrant shop where you can buy all these unique flavors imported from all over the world. Even though it’s not a restaurant, it’s my favorite “food” place in the city.The last book I read was … Dominicana__ by Angie Cruz. It’s a beautiful generational love story about a woman who leaves the Dominican Republic, moves to New York, and it just doesn’t turn out how she imagined.My next book focuses on … two sisters who don’t know about each other until after their father dies in a plane crash. It’s a dual narrative. One sister’s in the Dominican Republic and one’s in New York City. It’s all about what happens when you’re grieving someone and you’re also having to deal with the consequences of the life they lived.Besides cooking, I like to unwind by … spin cycling. It’s just somebody telling me how fast to move, when to get up, when to pretend I’m jumping. It’s so comforting to hand over all my thoughts and just do.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyleGlory Edim on How Eggs Fuel Her Mornings and How Stories Change the WorldBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-09", "author": ["Condé Nast", "Leigh-Ann Jackson"]}