{"id": "316a92eef7fd26e7d14eb790fbf733dc", "url": "https://www.bonappetit.com/recipe/creamy-pasta-with-crispy-mushrooms", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Creamy Pasta with Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueCreamy Pasta with Crispy MushroomsBy Andy BaraghaniAugust 13, 20194.4(282)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintSupermarkets would have you believe it’s always mushroom season. It is—for white buttons, maybe. But the first cool fall days bring feathery maitakes, meaty oysters, and other flavorful varieties worth seeking out at the farmers’ market. Whichever one you pick, all they’ll need is a quick sear in a hot pan before being tossed into a creamy pasta sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane$16 At AmazonSlotted Spoon$13 $10 At AmazonLarge Pot$55 At AmazonHeatproof Measuring Cup$18 At AmazonTongs$13 At AmazonIngredients4 servings4Tbsp. extra-virgin olive oil1lb. mixed mushrooms (such as maitake, oyster, crimini, and/or shiitake), torn into bite-size piecesKosher salt2medium shallots, finely chopped1lb. spaghetti or bucatini½cup heavy cream⅓cup finely chopped parsleyZest and juice of ½ lemon2Tbsp. unsalted butter, cut into pieces½oz. Parmesan, finely grated (about ½ cup), plus more for servingFreshly ground black pepperPreparationStep 1Heat 2 Tbsp. oil in a Dutch oven or other large pot over medium-high. Cook half of mushrooms in a single layer, undisturbed, until edges are brown and starting to crisp, about 3 minutes. Give mushrooms a toss and continue to cook, tossing occasionally, until all sides are brown and crisp, about 5 minutes more. Using a slotted spoon, transfer mushrooms to a plate; season with salt. Repeat with remaining 2 Tbsp. oil and mushrooms and more salt.Step 2Reduce heat to medium-low and return all of the mushrooms to the pot. Add shallots and cook, stirring often, until shallots are translucent and softened, about 2 minutes.Step 3Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.Step 4Using tongs, transfer pasta to pot with mushrooms and add cream and 1 cup pasta cooking liquid. Increase heat to medium, bring to a simmer, and cook, tossing constantly, until pasta is al dente and liquid is slightly thickened, about 3 minutes.Step 5Remove pot from heat. Add lemon zest and juice, parsley, butter, ½ oz. Parmesan, and lots of pepper and toss to combine. Taste and season with more salt if needed.Step 6Divide pasta among bowls and top with more Parmesan.How would you rate Creamy Pasta with Crispy Mushrooms?Leave a ReviewTell us what you thinkReviews (112)Back to TopTriangleMaking it for the second time tonight. Using linguine tonight.  Last time I used bow ties.  It's a great recipe and quite easy. Enjoy!SandieAttleboro MA11/29/2021This is delicious. I made it exactly as written, except I used fiorelli in place of the spaghetti/bucatini. It was rich, but not heavy. There’s just enough cream to feel luxurious but not enough to be overwhelming. The lemon added a nice brightness. I was very happy as is, but I feel it could also be changed up easily with simple additions, such as thyme or pancetta. AnonymousHalifax, NS10/25/2021How do you save recipes on Bon Appetit?  Do I have to go to Epicurious to save?AnonymousSanta Fe, NM10/2/20213 minutes to make the sauce thicken is just no enough. Be really mindful of the pasta water that you add, for me ended up being... pasta soup. Anonymous9/28/2021Oh my!  I ordered mixed wild mushrooms (lobster, king trumpet, etc.) and spent a day cleaning them the day before making the pasta dish.  It was my birthday dinner (I love to make dinner for the family whether it’s my birthday or not!) and everyone loved this dish!     My daughter, her husband, their daughter, my man and I just ate every single bite.  Not a morsel left in the pan or on a plate.  Susan Jeffries (Kitchen Queen)Carlsbad, CA9/14/2021I absolutely love this recipe. I did like what other reviews says by using half of the pasta and double everything else. It came out so delicious. I don’t even like cheese that much and this was exceptional for me. I would make it again since this is easy to make. AnonymousOhio8/25/2021Simple and delicious.   I halved the bucatini pasta but kept the rest of the proportions and it still served four.SusanMount Vernon, WA8/17/2021I was questioning if this was going to be the right recipe as some comments were not the most positive. I decided to look past the comments and make it last night. I sure am glad I did as it's now in my favourites. I would like to highly recommend this recipe as it was very tasty and was not too heavy. I doubled the mushrooms and the cheese but everything else was exactly as the recipe said. \nI highly suggest you make this if your looking for a well balanced very taste meal.SeanBritish Columbia, Canada8/16/2021This is a very nice base recipe. I made it once with the recipe before tweaking it a bit to suit my tastes.\n\nSince mushrooms love fresh thyme I added a good tablespoon of the roughly chopped herb along with generous coarse grinds of black pepper while they were being sauteed. The Dutch oven had a wonderful fond after two batches of mushrooms so I added a splash of Marsala to deglaze and further enhance the flavors (white wine, dry sherry or even chicken stock could work as well). Adding a tablespoon of porcini powder to the cup of cooking water before it was stirred into the pot with cream was another big flavor booster. Randy GLahaina, HI8/12/2021I agree that it is bland as written. I added lots more mushrooms plus crispy pancetta (or crisped and crumbled bacon) and more parmesan (the real reggiano parm). Used the parsley just as a garnish. MarleeAtlanta8/12/2021It was incredibly bland despite me adding a generous amount of chili flakes, black pepper, and minced fried garlic. Athena bucatini I got also seemed too big for this recipe. If I were to make this again, though I probably wouldn’t, I would double the mushrooms and halve the amount of pasta, and also add more garlic and shallots. The parsley didn’t seem to work either. The one great addition was the lemon juice which gave the pasta the intended effect of being lighter than the ingredients would suggest. I am compelled to brainstorm my own recipes and use lemon juice next time to add that bright touch to the sauce.LavanyaWashington, DC8/11/2021I made this yesterday because I was craving a creamy pasta with mushrooms, and thankfully google gave me this recipe! They were out of shallots at the market so I had to substitute a yellow onion. I used rigatoni instead because I also wanted a thicker pasta with it. The prep was fun, lots of chopping ( I chopped my mushrooms into really small pieces and used cremini- anyone else love chopping mushrooms? So satisfying!) anyway, it is definitely a process to make but I thoroughly enjoyed challenging myself with a harder recipe (for me). It turned out SO LOVELY. I could have added a bit more salt, but other than that- it was incredible. The lemon zest really added that little pop of tart and freshness but wasn’t at all overwhelming to the dish. This is a go-to and all my friends want the recipe after I posted on my IG story. Oh- I had 3 cloves of freshly chopped garlic as well just since I love a little garlic… but I know it would have been delicious without it too, that’s how great this recipe is. The sauce was velvety and not too much or too little- I’m not a fan of when pasta is submerged in too much sauce, just like I dislike an over frosted cake. A must try for anyone, even kids would be big fans of this recipe! I think next time I may boil my noodles in half mushroom stock, half water to see how that tastes since I think it’s fun to try new things with already yummy recipes. Andrea GragliaSan Diego, CA8/8/2021Just made this! While it seems like an earthy fall dish, it’s late Spring so I added fresh green peas to the recipe. Soul satisfying, especially when accompanied by a good Soave Classico. EtonicRiver Ridge Louisiana 6/6/2021I’m utterly speechless. (Because my mouth is still full!).\nThis is SO AMAZINGLY TASTY!! Seriously, one of the absolute easiest, tastiest main dishes I’ve made in awhile. So happy I googled “mushroom main dishes”.\nOnly changes I made were that I used half and half instead of whipping cream, added a generous dose of minced garlic and also used 8 ounces of button mushrooms along with 1.5 ounces of dried mixed mushrooms that I soaked in lukewarm (NOT HOT) water for an hour, then blotted dry. You can use the leftover mushroom stock for another dish. \nAt first I was a little worried they wouldn’t fry up as crispy as the fresh, but they most certainly did😊 \nI have found a fantastic new favorite, so has my “meat and potatoes” hubby!TracieTennessee 6/4/2021I've made this recipe a few times and keep coming back to it. It is amazing!! I personally add more garlic and shallots but this is the only recipe i will use and have added it to my personal recipe book. I've made it for dinner parties and it is a fam favourite. \nThank you for the great dish! AmVancouver, Canada5/13/2021Explore Bon AppétitPastaItalianEuropeanSpaghettiPasta & NoodlesMaitake MushroomMushroomVegetableOyster MushroomCrimini MushroomShiitake MushroomQuickEasyWeeknight MealsMainVegetarianNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Andy Baraghani"]}