{"id": "316b68a1461bb3728e3ed5e8226cc593", "url": "https://www.bonappetit.com/story/how-to-turn-a-vegetable-into-a-meal", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "How to Turn a Vegetable Into a Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Turn a Vegetable Into a MealWhat's wilting in your fridge today?By Amanda ShapiroFebruary 6, 2020FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.First off, an apology. Last week’s letter had the same subject line as the awards for good boys newsletter, which I’d received and placed in my “NLs to Read” folder a few days before writing my own. (An aside: My “NLs to Read” folder has outpaced my stack of unread New Yorkers, and that seems like an important turning point in this digital age). Anyway, when Healthyish assistant editor Aliza and I were batting around subject lines at the 11th hour, I thought my suggestion was, well, mine, but clearly my subconscious pulled it from someone else. Shelby: forgive my mistake. You’re very funny on the internet, and I love what you do.Since we’re talking newsletters, I also recommend subscribing to Edith Zimmerman’s, which is called Drawing Links and features her hand-drawn comics and, yes, related links. It’s charmingly meta—often the comics are about her figuring out how to make a good newsletter—and it sends me to places I don’t otherwise find myself, like the Harvard Business Review.Other things I’ve been charmed by recently:The Chinatown Collection, an NYC pop-up and online shop from Care of Chan, Sue Chan’s branding and talent agency, that pays homage to NYC’s Chinatown. I’m obsessed with this dessert plate and bemused by this $900 ceramic representation of Mission Chinese Food’s chicken wings.This article on vaping hysteria by Amanda Chicago Lewis, which is very long but very fascinating, plus the dinner party scene at the end is a perfect portrait of the LA wellness set. The lead singer of Phantom Planet makes an appearance, and that’s all I’m going to tell you.This indigo jumpsuit from Tilit, which appeared at a time when I thought I was done buying jumpsuits as if to say, “Not so fast.” It’s sturdy and stretchy and, unlike other, more fashion-minded jumpsuits, feels made for both working and playing hard.Start Simple, Lukas Volger’s forthcoming cookbook and one of the ones I’ve been looking forward to since a galley crossed my desk last fall. I love the idea of building recipes around one basic ingredient—“a few sweet potatoes,” “a carton of eggs,” or “a pile of mushrooms,” for example—because so often that’s how I think about cooking: What’s one thing I have in the fridge or pantry that I want to eat, and how do I make it into a meal? I recommend pre-ordering the book, which is out Feb. 18th, because everyone I know who’s ever published a book says that’s a helpful thing to do.Our newest Healthyish recipe, Andy Baraghani’s Fall-Apart Caramelized Cabbage, which, like Chris Morocco’s Big-Flavor Broccoli before it, has given me a foolproof way to eat an entire skillet of vegetables for dinner. Don’t skimp on the water before you put this baby in the oven because you need the steam to fully soften the cabbage’s core. The texture you’re going for here is ~ melted ~, like my heart after watching this dog who does not want to be brushed—oh wait, he definitely wants to be brushed.I also have fond feelings toward Carla Lalli Music’s new Healthyish turkey chili recipe. I have yet to make it myself, but I ate bowls upon bowls of it while it was in the test kitchen, and, yes, chili is a delicious thing to cook even when there is not some kind of massive sporting event on TV.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleHating Goop Is Not a PersonalityBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-06", "author": ["Condé Nast", "Amanda Shapiro"]}