{"id": "31708cc06923fddd42770982f572b648", "url": "https://www.bonappetit.com/story/salad-ramen", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Ramen Noodle Salad Is the Only Dinner We Want When the Temp Gets Above 80 Degrees | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSalad Ramen Is the Only Dinner We Want When the Temp Gets Above 80 DegreesWhen you’re craving cool, crunchy veggies but still love noodles, salad ramen is here for you.By Aliza AbarbanelJuly 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailWe’ve arrived. The heat of the summer has sunk into the concrete, sparking a deep urge for soft serve and a strong aversion to turning on the oven. The best time to eat raw vegetables is right now, but nobody can survive on crudité alone. Enter: salad ramen, a.k.a. the only thing we want to eat until October.In a very 2019 twist, senior food editor Chris Morocco found inspiration for this recipe via Instagram. More specifically, an impeccably lit photo from Brunette Wine Bar in Kingston, New York depicting a color wheel of shaved radishes, cucumbers, and carrots atop a tangle of noodles. The caption read: “This ramen is basically a salad.” The dish, called hiyashi chuka, is a delicious, cooling mainstay at Japanese ramen shops in the summertime. \"Ramen noodles are a staple of my diet, and I wanted to add a dish that was satisfying without being too heavy,\" says Brunette chef Tracy Kennard.Chris got hooked on the notion of chilled noodles as a vehicle for all the precious produce filling the farmers’ market. Yes, this is a great idea, we said, dreaming of several days of salad-ramen tastings while the recipe was perfected.High summer is not a time for lengthy recipes, which is why this one uses a simple dressing of seasoned rice vinegar, lime juice, soy sauce, red pepper flakes, and sesame oil to coat both vegetables and noodles in a bright, nutty sauce. Use whatever crunchy veggies you have around, from summer squash and scallions to carrots and cucumbers. Just make sure to shave or shred them for a bowl of perfect, saucy bites.While this recipe will work fine with dried ramen noodles, we prefer fresh ramen for its wonderfully springy texture and light eggy flavor. (You can find fresh ramen noodles at Asian grocery stores and some Whole Foods—we like the Sun Noodle brand best.) If fresh ramen isn't available, frozen cooked udon and soba noodles will do the trick too. Whatever you do, try to avoid the ultra-processed instant ramen soup stuff.Cook the noodles until just al dente, drain and rinse under cold water to stop the cooking, then toss with half the dressing in a medium bowl. Then divide the noodles between bowls, arrange your veggies on top, and drizzle on the remaining dressing. There's no chef-y technique or niche ingredient setting this recipe apart, which is exactly why we love it. In fact, we even developed a (totally unscientific) hypothesis after several rounds of slurpable chilled noodles and tangy shaved vegetables: Even the sweatiest commute is redeemed by a bowl of salad ramen. That’s what we call summer science.Chill out with some noodles:Salad RamenThis is our idea of what a cold noodle salad dish should be.View RecipeExplore Bon AppétitHealthyishRamenNoodleSummerRead MoreLifestyleThis Shakshuka Is the Most Satisfying Way to Eat Two Pounds of GreensBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Aliza Abarbanel"]}