{"id": "317acf8f8077f108ae16cec23e6ebc4c", "url": "https://www.bonappetit.com/recipe/sach-ko-ang", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Sach Ko Ang Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSach Ko AngBy Lara LeeJune 14, 20214.2(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintThe distinct fragrance of sach ko ang (សាច់គោអាំង) fills the air at most street food markets and community gatherings in Cambodia. I learned to recognize the smell of these sizzling barbecued beef skewers, a traditional Khmer food, during a visit to Cambodia more than a decade ago (sach ko translates to “beef” and ang to “barbecue”). It became a mission to seek it out wherever I traveled there, sampling its many variations in a country not widely recognized for its incredible cuisine. At the heart of the dish is kroeung (គ្រឿង), one of five signature spice pastes used in Khmer cookery. Galangal, lemongrass, and makrut lime leaves form the aromatic flavor base of each kroeung, which branches into different styles depending on what else is added. Sach ko ang uses yellow kroeung, owed to the fresh turmeric that gives it its golden hue. You’ll most commonly find sach ko ang at bustling street food stalls where vendors grill them upon clay braziers (charcoal burners). Passersby can purchase a single skewer or two to be eaten on the go as an afternoon snack, but at lunchtime they’re eaten as a complete meal with a side of sweet crunchy green papaya and carrot pickle (chruak l’hong or ជ្រក់ល្ហុង), served inside a crusty baguette or with steamed rice. In addition to the kroeung marinade, the beef is seasoned with oyster sauce and palm sugar along with a multitude of added variations ranging from toasted ground star anise, MSG, chili paste, or fish sauce. My version is inspired by a recipe taught to me by Pek Sarann, a Khmer cook from Phnom Penh and owner of Bok it Ihe (បុកឥតល្ហែ) restaurant in Koh Kong, who learned the recipe from her mother. While other Khmer cooks prefer a longer marinade for more developed flavors, Sarann cooks her skewers after a short 30-minute marinade, amplifying the freshness of the ingredients in the kroeung. When preparing kroeung, it’s best to wear gloves, as fresh turmeric stains fingers. The quick-pickle is ready to eat after just 30 minutes. To make a more substantial meal, add steamed rice or serve inside a buttered baguette with the pickle, and drink with an ice-cold beer, just as the Khmer people do. —Lara LeeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonCast Iron Skillet$30 At AmazonStainless Steel Skewer$5.89 At AmazonMedium Bowl$17 At AmazonLarge Bowl$18 At AmazonIngredients6 appetizer servings or 4 main course servings Pickled Vegetables1shallot, thinly sliced2garlic cloves, thinly sliced11\" piece ginger, peeled, finely chopped3cups shredded crunchy vegetables and/or fruit (such as carrots, cucumbers, and/or young green papaya)1cup unseasoned rice vinegar or white wine vinegar1cup grated palm sugar, coconut sugar, or (packed) light brown sugar2Tbsp Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher saltMarinade and Assembly9lemongrass stalks, tough outer layers removed, thinly sliced3long red chiles (such as cayenne or serrano), thinly sliced2medium shallots, thinly sliced, divided3garlic cloves, thinly sliced, divided5makrut (Thai) lime leaves, thinly sliced, or zest of 2 limes12\" piece galangal or ginger, peeled, thinly sliced, or 1 Tbsp. plus 1½ tsp. very finely chopped galangal paste11 ½” piece fresh turmeric, thinly sliced (or 1 tsp ground turmeric)3Tbsp. oyster sauce1Tbsp. plus 1½ tsp. grated palm sugar, coconut sugar, or light brown sugar1Tbsp. fish sauce1Tbsp. garlic powder2Tbsp. vegetable oil, plus more for grill1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, plus more2lb. trimmed boneless sirloin or rib-eye steaks, cut into 1\" piecesSpecial EquipmentSixteen 8\"–10\" metal or bamboo skewers, soaked 30 minutesPreparationPickled VegetablesStep 1Toss shallot, garlic, ginger, and vegetables in a medium bowl to combine, then add vinegar, palm sugar, and salt. Cover and let sit at room temperature at least 30 minutes for a quick-pickle, or chill up to 12 hours..Marinade and AssemblyStep 2Pulse lemongrass, chiles, shallots, garlic, lime leaves, galangal, turmeric, oyster sauce, palm sugar, fish sauce, garlic powder, 2 Tbsp. oil, and 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt in a food processor to a finely textured paste.Step 3Transfer paste to a large bowl and add beef. Using your hands, massage paste into meat until completely coated. Cover and let sit at room temperature at least 30 minutes, or chill up to 12 hours. If chilling, let beef sit out at room temperature 1 hour before grilling.Step 4Prepare a grill for medium-high heat; oil grate. Thread beef onto skewers. (Alternatively, you can cook these in a cast-iron skillet lightly coated with oil.) Grill, turning about every minute or so, until browned and lightly charred in spots, 6–8 minutes for medium, or done to your liking. (The beef should be firm to the touch with a little bounce when pressed and slightly pink in the center.)Step 5Transfer skewers to plates and very lightly season with salt. Drain pickles and serve on the side.How would you rate Sach Ko Ang?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleIncredible. So much flavor. I used lime zest and ground turmeric and it turned out great. The pickled veggies are a perfectly refreshing complement to the meat. The ribeye melts in your mouth, but I'd also be interested in trying out different cuts. Definitely a keeper! DanaSacramento, CA7/14/2021This is one of the most delicious recipes I’ve made in a LONG time! Yes, the ingredients list fails to list turmeric but just throw some in and don’t let that deter you. I think I said “oh my god” at least 5 times while eating. The marinade is incredible by itself but I think the use of ribeye really sends this recipe into another dimension. We ate it over rice and tried leftovers in a baguette - both amazing! Cannot wait to make this again.DanielleChicago6/26/2021This was delicious!  I served the pickles and meat on a warm, buttered, crunchy roll.  The sirloin was so tender and flavorful. The sweet quick pickles nicely balancing it out.  I like that I can do it on short notice or prep ahead of time.  Definitely will make again.\n\nNotes:\nI didn't find galangal at the store and used fresh ginger. \nAlso added 1 tsp. turmeric based on looking at other recipes, as it seemed to be an important ingredient though not listed on the ingredients.  Jodi (again)CA6/23/2021The recipe preparation steps and the summary both mention turmeric yet there is no turmeric in the ingredients list. Please update!Jodi6/23/2021Explore Bon AppétitSkewerCambodianSoutheast AsianAsianRib Eye SteakSteakBeefMeatTurmericHerbs & SpicesGalangalLemongrassMainDairy-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-14", "author": ["Condé Nast", "Lara Lee"]}