{"id": "317d3ec81421ff8ba3b05ff1f4aa8a30", "url": "https://www.bonappetit.com/recipe/chocolate-ganache-tart", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Chocolate Ganache Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueChocolate Ganache TartBy Janice TiefenbachNovember 19, 20194.4(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis deceptively simple chocolate tart features a press-in nut crust that requires zero dough-making skills and also happens to be gluten-free. (You can also swap in any nut you want, it’s versatile.) This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8 servingsCrust4Tbsp. unsalted butter, melted, plus more room temperature for pan2½cups mixed raw nuts (such as walnuts, blanched hazelnuts, pistachios, and/or almonds)6Tbsp. sugar¾tsp. kosher saltGanache and Assembly12oz. bittersweet chocolate, chopped2cups heavy cream6Tbsp. unsalted butter, room temperature, cut into 1\" piecesFlaky sea saltSpecial EquipmentA 12\"-diameter tart pan with removable bottomPreparationCrustStep 1Place a rack in middle of oven; preheat to 350°. Lightly butter pan; line with a round of parchment paper cut to fit just inside pan. Pulse nuts in a food processor until finely chopped. Add sugar and salt and pulse again to combine. Drizzle in melted butter and pulse until nuts begin to clump together and mixture looks sandy. Using your hands, firmly and evenly press mixture into bottom and up sides of pan (it doesn’t need to come all the way up the sides). Bake crust until golden brown, 20–25 minutes. Let cool.Ganache and AssemblyStep 2Place chocolate in a medium bowl. Heat cream in a small saucepan until just beginning to simmer; immediately pour over chocolate. Let sit, undisturbed, 5 minutes. Add butter and mix with a heatproof rubber spatula until smooth and glossy. Scrape ganache into crust and smooth out any bubbles. Chill, uncovered, until set, at least 1 hour.Step 3Remove tart from pan; sprinkle sea salt over. Slice into wedges with a hot knife.Step 4Do Ahead: Tart can be made 1 day ahead. Cover and keep chilled.How would you rate Chocolate Ganache Tart?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleThe recipe worked well and was a hit for our Valentine's dinner! Very easy and delicious. The one detail I missed was when to add the sea salt. I added it after it was cooled but not right before serving and ended up with ugly splotches of salt that melted into the chocolate. My fault, not the recipe. The salty bits still tasted great.\nThe ganache set up perfectly. I used 35% cream (maybe some out there are using 10% and having problems??) and 70% Lindt chocolate. Crust was a mix of pistachio/almond/walnut/pecan. Great!\nI will definitely keep this recipe for the future and am looking forward to visiting the restaurant, Elena, which, coincidentally, is just minutes from where I live. MikeMontreal, QC2/14/2022Impressive presentation and super simple to make! I followed it exact and it came out perfect. For the crust, I used a mixture of almonds, pistachio and walnuts. For the topping, I sprinkled salt flakes over the cooled ganache and a dollop of homemade whipped cream.  I used dark chocolate 72% dark chocolate chips about 1 TBSP less cream the recipe called for.  If using chocolate with a lower percentage of cocoa, I can see how the ganache would not solidify. Lysa PDENVER12/26/2021Absolute decadence!  I used half pistachios and half pecans for the crust.  Had no problem with it setting up, even after adding two tablespoons of bourbon to the ganache.  Have already made it twice.  So wonderfully good, and very simple.  This is a rockstar of a recipe.AnonymousEast Tennessee12/2/2021This will not set with the measurements given!\nNeeds half the amount of cream as listed.\nToo bad I ruined 40 tart shells with this recipe.\nTerrible recipe all the way around.BrenttHilton Head, SC8/21/2021I’ve made this recipe multiple times and it always turns out bomb. I’d recommend using a chocolate that’s at minimum 70% for the ganache to set properly(Guittard and Scharffenberger baking bars are both solid options for this), as well as mostly using nuts that impart a lot of flavor(hazelnuts, pistachios, and almonds are my fave combo) This is a minimalist recipe so using the best ingredients you can find will make a noticeable difference. On another note, I’m down to try making a dairy free version of this using coconut, but I’m unsure as to wether canned coconut milk or coconut cream would make a better sub for the heavy cream. Any advice would be much appreciated! Cheers!RaeAlbany, NY7/1/2021I made this sugar free and it was excellent. It could be done with coconut milk for a vegan version.  I would make it again many times. I did reduce the cream with 1/2 cup as suggested by other commenters. Also added some sweetener in the ganache. The crust was too dark at 19 min so try 15 min first. I tried freezing it. The crust became soft. But still tastes great.  Anonymous3/6/2021Impressive presentation and super simple to make!  I brought this to work for a birthday celebration and the tart raving reviews. Even those at work who had started their new year diets made an exception to take one bite because the tart looked so tempting. \n\nFor the crust, I used finely ground Biscoff biscuits and a mixture of hazelnuts and walnuts.  The color and texture companion Ed the smooth chocolate ganache well.\n\nFor the topping, I sprinkled salt flakes over the cooled ganache, drizzled homemade salted caramel and then added pomegranate seeds. \n\nConcerned about the comments about the ganache not solidifying enough, I decided to use coarsely cut high quality dark chocolate with a mixture of 72% dark chocolate chips by Guittard and also used about 1/4 cup less of the heavy cream the recipe called for.  I was certain to mix the chocolate and the cream  very thoroughly.  Dark chocolate seems to absorb or require more liquids to ensure the ganache is smooth consistency for pouring yet doesn’t dry too hard. Hence, the greater percentage of cocoa, the greater amount of liquid ito achieve the right consistency. If using chocolate with a lower percentage of cocoa, I can see how the ganache would not solidify enough to achieve consistency suitable for being cut with a knife.  \n\n\n\nAnonymousAustin, Texas1/7/2021The reviews noting that the ganache never set had me worried - so I ended up using 1 1/2 cups of heavy cream and 4 Tbsp of butter instead. I had no problems with it setting and will definitely try what the recipes calls for next time. You really need to stir the ganache for a while (silky and glossy is key!) to ensure a proper mixture. I also used a 9in springform pie pan, as it was all I had on-hand.\n\nIt was a big hit! And the sea salt sprinkled on top was *chef's kiss*. It's quite rich, so I'd advise cutting it into smaller portions than this recipes calls for.AnonymousMinneapolis, MN12/28/2020This is so great. I had total success even tho I ran low on heavy cream and had to sub a tiny bit of whole milk. I used high quality chocolate and did just as the recipe said. My crust was 75% almond and 25% walnut. I topped it with pistachio shavings and pomegranate seeds for some seasonal flair. \n\nThe people who didn’t like the recipe were likely victims of operator error. I will try this is all sorts of variations... candied orange peel for topping next!AliciaKansas City, MO12/26/2020The crust is excellent but the proportions for the ganache are way off. - too much cream to chocolate. As I poured the liquid filling into the crust I felt sure it would never firm up. I was correct, it remained so loose that the only way I could serve it was as a frozen dessert. The flavor was delicious but I would never make the recipe again as it’s written.AnonymousCharleston 12/18/2020I made this yesterday. It was easy and turned out great. I used half pistachios and half almonds. I was worried the ganache was too loose, but it set up fine. I had quite a bit left over though. Maybe my pan is a little on the small side. Aunt LouCanada11/15/2020Absolutely delicious! I would totally recommend :DfoodorFrance6/16/2020Very nice! It’s so rich, I say it serves twice as many as written. I increased the chopped chocolate amount by ~15% and the ganache turned out just fine. Ohioan6/15/2020I have made this recipe 4 times now, and it consistently comes out great.  I follow the instructions as outlined here, and it creates a decadent dessert that people really love.  Not sure why people are having trouble with the ganache; I make it per the recipe and it comes out perfectly every time.RolltideNorth Carolina6/13/2020I had the same problem as Anonymous—the recipe calls for too much cream.  The chocolate  mixture was runny.  The recipe calls for you to “scrape the ganache into crust”, but mine was so runny that it was just a pour, not a scrape.  I tried to save it by adding more chocolate and refrigerating it overnight, but it is still the consistency of a runny pudding. It tastes fine, if a bit grainy, but not a good recipe to serve to guests. The crust is great, however. AnonymousOak Park Illinois5/28/2020Explore Bon AppétitTartDessertChocolateOther IngredientsWalnutNutHazelnutPistachioAlmondEasyGluten-FreeBakingPassoverRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}