{"id": "31a4cf2046b8cb2c10486abb1e6b58f7", "url": "https://www.bonappetit.com/story/cook-with-chris-chicken-green-bean-stir-fry", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Cook Along LIVE With Chris Morocco! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCook Along LIVE With Chris Morocco!He’s making his Chicken and Green Bean Stir-Fry on Thursday, June 10, at 7 p.m. ET.By The Bon Appétit StaffJune 3, 2021FacebookTwitterEmail\nFacebookTwitterEmailCatch Bon Appétit’s Test Kitchen Director Chris Morocco hosting a virtual cooking class from 7 to 8 p.m. ET on Thursday, June 10. He’ll be making his Chicken and Green Bean Stir-Fry live as he discusses how to make boneless skinless chicken breasts stay juicy, how to use up so many beans and peas (in season now!), and how to make a DIY stir-fry base that barely requires a knife and can work with any protein or vegetable.Come prepared with these ingredients and be sure to bring Chris all of your cooking questions. The class is free, and can be streamed on this very page or over on talkshoplive. Click the “notify me” button on the video player to get an alert when Chris gets started.Get the Recipe: Chicken and Green Bean Stir-FryThis fast miso-curry paste and handfuls of charred green beans and peas transform skinless, boneless chicken breasts into a highly craveable dinner.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-03", "author": ["Condé Nast", "The Bon Appétit Staff"]}