{"id": "31b06b0c3ab2babe62f0077dea0dd3ed", "url": "https://www.bonappetit.com/story/jason-genao", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "On My Block’s Jason Genao on Searching for Adobo and Loving Julia Child | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOn My Block’s Jason Genao on Searching for Adobo and Loving Julia ChildThe Dominican-American Netflix star is finding joy right now in cooking and family domino games.By Martine ThompsonOctober 14, 2020FacebookTwitterEmailNicolas BatesFacebookTwitterEmailIn Here We Are, artist Martine Thompson explores what it means to care for oneself in a world that doesn’t make it so easy. Up next, a conversation with actor and cooking enthusiast Jason Genao.Jason Genao is the kind of person you’d be happy to slip into random conversation with at a party. Our conversation ebbs and flows, touching on the emotional toll of being an actor and starring on Netflix’s hit show On My Block, the special place his Dominican heritage holds in his heart, and his passion for food.When it comes to the Jersey City native’s love for cooking, part of the magic, he says, is being there and getting to see the satisfaction wash over someone’s face as they enjoy a dish he’s put together with care. It’s a reprieve from the uncertainty of pouring your heart out, releasing it, and never quite knowing how the people consuming it are feeling that accompanies acting. “I think all actors are super insecure, and the insecurity lies there, in not knowing. So when it comes to cooking, it kind of calms your nerves—when a person takes that first bite, you can see their reaction right there. It’s very different.”If one thing’s for certain after talking with Jason, it’s that he’s just getting started. Like many artists, there’s a heap of skills and interests waiting to be explored that I imagine will be harnessed across a range of mediums in the coming years. He’s growing, living life, and tapping more into his gifts and confidence each day. The sky’s the limit.Below, I caught up with Jason about tender moments centered around family and Dominican food, what self-care looks like when being vulnerable is an essential part of your job, and what it’s been like for the East Coast native to find a Caribbean community in Los Angeles.Hey Jason! How has life in quarantine been treating you?Jason: You know what, I have such a big family so I’ve been doing pretty well during quarantine. I currently live in L.A., but I went back to Jersey. We’re just holding each other down, you know? Playing dominoes and doing what Spanish people do.My mom’s been asking me to play dominoes and I’m like, Uhhhhh…Jason: Do it with her, I’m telling you.(Laughs) It seems so boring…Jason: What? No. Are you crazy?! Our domino games would last for hours and it would turn into these pots of hundreds of dollars where the winner would get the money in the middle.Are you guys sharing stories in between or is everyone just focused on the game?Jason: Oh, my god. They shared so many stories. My father has 14 brothers and sisters and they all grew up in the Dominican Republic. I don’t know much about my dad—we’re not that close because he worked so much. So, I was like tell me about my dad, to my aunts and stuff, and they started telling me the craziest stories. So now I have this idea in my head that I should write a book about the Genao family history.That would be amazing—and then maybe it would be adapted. We need more Dominican stories.Jason: One hundred percent.I was checking out your Instagram which is very low-key. What does a real glimpse into your life look like?Jason: I get so much flack for not being active on Instagram. It’s this crazy thing where people feel like if you don’t post, you’re not doing much. And I’m like, doing everything and anything possible, but because I don’t post, people love to ask me, “Why don’t you go do this and do that?” I’m there, trust me, I’m just like, “No pictures, please.”Ha, I did not doubt you! I did not doubt that you were booked and busy, and living life. Let’s talk food! Before your focus was on acting, you were on the path to pursuing cooking as a career. Why was that a fit for you?Jason: Cooking was something that was tangible. When I lived in an apartment building, I lived in 1L and my aunt lived in 1R. She was this amazing cook. Every day I’d go over and she’d tell me to help her, even if it was just like peeling a cucumber or something like that. I became so infatuated with cooking.What was one of your favorite things to eat together?Jason: Locrio de longaniza. My mom, god bless her, isn’t the best cook—Mmm, I saw that interview where you threw her under the bus...Jason: I didn’t throw her under the bus. She knows I’m not the biggest fan, and I prewarned her that it might come up one day. She also didn’t cook that many things. In my whole 20 years living at home, there’s like five things she cooked: rice and beans, or rice mixed with beans, and then either chicken, pork, or steak all seasoned the same way. That’s what I was used to, then my aunt made this thing called locrio de longaniza, which is rice with Dominican sausage in it. It was the craziest moment. I remember tasting it and being like, Can I have more? And then when her husband came home and he ate, and there was still food left over, I asked, “Tía, can I have more now that everybody ate?” It was the craziest thing I ever tasted. I was really young and it was the first thing that was so different. After that I was like, let’s do this.Do you mostly make a certain type of food?Jason: I started out with Dominican food because that’s all the ingredients we had in the house. But I remember I saw the movie Julie & Julia, with Meryl Streep and Amy Adams, and I became obsessed. My brother bought me the whole collection of Mastering the Art of French Cooking and I got really into French cooking. I was around 12 years old, so I’d call my dad, like, “Could you bring this or could you bring that?” Or I’d tell my brother that I’d cook if he could just take me to the grocery store. I was experiencing new herbs that weren’t typically Hispanic—such as sage and basil—and ingredients that I’d only ever heard of, like curry powder and gochujang. And then I started going to a fancy market and would buy things like foie gras and truffle oil, and make truffle mac ’n’ cheese and pan-seared foie gras. And now I’ve sort of fallen into this realm where I mix French and Dominican cuisines.That kind of reminds me of Kelis and how she’s explored different areas of her interests with singing and going to culinary school, and starting a sauce line. Maybe exploring food will be one of your next chapters down the road…Jason: I have 100 chapters to go through. Right now I’m in the process of writing, so my next chapter is writing. But I mean I’m never not cooking, whether it’s at the house or through other things. I’ve been looking into food trucks just because I want to venture out small and see what happens, and eventually maybe have a restaurant. If I could, I would be like one of those ladies who cooks from their house and then brings a little cart with premade plates to the barber shop. That’s how much I love cooking.How do you deal with coming from the East Coast, where there’s such a big Caribbean community and Dominican presence, to Los Angeles, where it’s sort of the polar opposite?Jason: Oh, my god, it’s crazy. I remember when I came here, I couldn’t even find adobo. [The supermarket chain] Ralphs didn’t have it; all these places didn’t have it. I had to go to this Hispanic place that my friend put me onto called Vallarta. That’s where I found it, and I remember I bought like five, and mojos. I was like let me get this shit, L.A. does not know at all. My first year in L.A., I became so homesick that I went through this whole journey one day of trying to find Dominican food on UberEats and it just wasn’t happening for me. I’ve learned to become the Caribbean culture for myself and the people around me. I know that I’m not going to find it too much out here. I have Dominican and Caribbean friends, but when it comes to cooking, I’m like, “Come over and I’ll cook.” And we’ll have really Hispanic food for the day because we just had a bunch of sushi and stuff the day before. Like, let’s Dominican this night up.Those are some of the best times. Just being in a comfortable space you create with your loved ones—enjoying good food and good company.Jason: Exactly.Let’s talk acting. I love On My Block. Acting as a profession seems so vulnerable, from the auditioning process to oftentimes portraying heavy emotions in front of, and alongside, strangers. What does self-care look like for you when putting yourself out there emotionally is such a regular part of your job?Jason: For me, it’s really important to learn how to balance out the negative thoughts. That’s been my biggest issue and has taken the most self-care work. It is vulnerable being out there every day, going through a million nos just for the one yes. Whether it’s through therapy or learning how to do it on your own, I think it’s important to maintain this sense of clarity that you’re here for certain purposes or you want certain things, and that there’s processes to get through all of it.It’s sort of impossible to not sulk in the negativity of life. What I try to do is give myself a limited sulking period. You take everything that you did wrong and you learn from it. I write it down in my notes sometimes, so I can revisit it and see what I can do better. But after two or three days, or maybe a week, then you have to start thinking of all the positivity in your life. And then you go into that mentality where it’s a new day, there’s a new challenge, you have more opportunities coming, blah blah blah. You speak to yourself on a positive note. I think that’s the important thing, giving a grace period for how long you can sulk and how long you can think negative thoughts.What’s something that’s brought you joy this year? Even if it’s like, I had a really good sandwich the other day.Jason: When I first went back to the East Coast, instead of staying at my parents’ house, I went to Pennsylvania to quarantine with my cousins who I grew up with. We’ve always been super close. Every single day that I was there brought so much joy, whether it was doing nothing, or playing dominoes and then bingo, or cooking. Other than that, I really find joy in every day now, even the little things. That’s also now a part of self-care, finding the joy in everything. Or just creating joy. Whenever it feels like you’re not having any joy, you can go out and take a walk or go get some good food or hit up some people. Or work or write. I started this thing where I read two books a month, and I just read Selenis Leyva’s memoir with her sister Marizol Leyva, My Sister: How One Sibling’s Transition Changed Us Both, that’s also brought me joy. I’m tryna find joy in every day now.Explore Bon AppétitLos AngelesHealthyishHere We AreInterviewsRead MorecultureHealthy Hyna Founder Lorena Ramirez On Going Vegan and Visualizing the FutureBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-14", "author": ["Condé Nast", "Martine Thompson"]}