{"id": "31b35c27324a11548ff55dd4f0cbe71a", "url": "https://www.bonappetit.com/recipe/brothy-coconut-mustard-fish", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Brothy Coconut-Mustard Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBrothy Coconut-Mustard FishBy Shilpa UskokovicMarch 16, 20214.5(72)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintCanned coconut milk and bottled yellow mustard transform into a lush, speedy, luxurious sauce for firm whitefish fillets. This recipe is inspired by the flavors of Bengali ilish bhapa, an exquisitely simple dish that celebrates hilsa, a prized fish in West Bengal and Bangladesh. The fish is eminently swappable. Sub with an equal quantity of roasted shrimp, scallops, chicken, tofu, cauliflower, or sweet potato. Instead of the snappy green vegetables, use tiny creamy potatoes, canned chickpeas, or ruffles of torn kale and adjust the cook time accordingly.Ingredients4 Servings46–8-oz. skinless, boneless whitefish fillets (such as cod, halibut, or haddock)2Tbsp. melted virgin coconut oilKosher salt1serrano chile, thinly sliced213.5-oz. cans unsweetened coconut milk2Tbsp. honey2Tbsp. yellow mustard1tsp. ground turmeric4oz. green beans, asparagus, or sugar snap peas, cut into 1\" pieces½cup cherry tomatoes, halved2tsp. fresh lime juiceCilantro leaves, steamed rice, and lime wedges (for serving)PreparationStep 1Preheat oven to 325°. Line a rimmed baking sheet with parchment paper and arrange fish on top. Drizzle oil over fish and season both sides with salt. Roast until flesh flakes when top is pressed with a spoon, 15–20 minutes, depending on the thickness of your pieces.Step 2Meanwhile, combine chile, coconut milk, honey, mustard, and turmeric in a high-sided skillet or wide saucepan. Season generously with salt and bring to a simmer over medium heat. Cook, whisking occasionally, until sauce is reduced by a third and thickly coats a spoon, 12–15 minutes. Add green beans and cook until tender, about 3 minutes. Remove from heat and add tomatoes and lime juice. Taste and season with more salt if needed.Step 3Slip roast fish into sauce and top with cilantro. Serve with rice and lots of lime wedges for squeezing over.How would you rate Brothy Coconut-Mustard Fish?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI made this dish as written.  Outstanding!  I had all the ingredients in my pantry or freezer.MargoPortland Oregon11/13/2021We loved this!  I used only 2.5 tablespoons of mustard and a tiny amount of seranno because my husband does not like spicy.  I added chopped kale and chard and cooked for about 5 minutes in the broth. served with Cod and roasted acorn squash - the sauce was delicious on the squash also.  .  Jennifer10/10/2021I made this with fish and then I made it with firm tofu. I sliced and seasoned the tofu, marinated it for a bit in the seasonings and then baked it for about 25 minutes at 400. It was better with the tofu!joyceonhollysan francisco6/25/2021I have made this dish twice now. Once with full fat coconut milk and this last time with lite. Both times came out delicious. The only thing I changed was I added more tumeric and the zest of the lime. Easy recipe to follow. You can basically use any protein or veggie of your choice.AnonymousCarmichael, Ca6/17/2021I made this with tofu just because and YUM.CristinaSan Diego, CA4/21/2021Was looking for something to do with leftover grilled chicken and saw this recipe.  I only had one can of coconut milk and no chiles so I subbed  in a cup of homemade chicken broth and a lot of cracked red pepper.  The flavor profile is plenty strong enough to handle the substations and  we loved it.  We had leftovers so the next night we stretched it out with some more chicken broth, sautéed mushrooms and some leftover roasted broccoli.  Still delicious!AnonymousChapel Hill, NC4/20/2021Since there is virtually no fish in the world safe to eat anymore,  I would use this broth for roasted butternut squash or other bulky veggies--maybe cabbage/carrots/onion chunks, etc.  Sounds very good.tamarqueUlster County, NY4/20/2021Love this recipe.\nAnonymous4/17/20214/21  Easy and good. Made 1/2 recipe for one dinner for 2. Did substitute a scant T light of brown sugar for the honey-wasn't too sweet or at all once sauce cooked-well balanced. Went the Thai direction instead of honey mustard direction. Served over rice. Used CodAnonymousNYC4/16/2021I'M ENAMORED! This is so tasty. I made it with a few different fish to see what I'd like best so I used speckled trout and sheepshead. Both worked great! I'd add more turmeric for earthiness and another Serano but otherwise, I'm a huge fan. I could also see this broth being very flexible for other proteins and veg. DaisyWilmington, NC4/13/2021This is a good recipe, but only with adaptations. The coconut milk \"broth\" was so overly sweet that I could have used it as an ice cream base. I ended up adding some chicken broth and some white miso paste to give it a little more umami and to balance the overt sweetness. I did double check my coconut milk to make sure it was unsweetened as well, and it was. If i were to make this again i would omit the honey entirely, do one can of coconut milk and an equal amount of chicken or veg broth from the get go. EdieOakland, CA4/13/2021This was so good! I roasted the fish a few minutes less than needed and then put it in the simmering sauce to finish cooking through. It was excellent, and as the recipe suggests, it's good to put on anything. I think this would be a nice vegan dish with 2 cans of chickpeas. Also, this would be good with the fish and just one can of white beans. I used asparagus and kale instead of snap peas, plus one can of regular full fat coconut milk and one can lite. Loved it. RachaelAnnapolis, MD4/12/2021As far a seasoning are concerned, this dish definitely requires the salt! I also started the whole dish off by sauting a couple of minced garlic cloves and red pepper flakes in 1 T coconut oil before adding the coconut milk, etc. After reading the reviews I thought perhaps simmering the fish in the sauce, rather than roasting it beforehand in a separate dish, might improve the flavor. I also took one reviewers advice to use 1 can coconut milk and 1 can milk, which I reduced for 12 minutes. Then I added the fresh haddock fillet, which I had cut into large chunks, and simmered for an addition 12 minutes. I added the veggies (blanched green beans and potatoes) for the last three minutes, along with the juice of 1/2 lime. Overall it turned out delicious and I will make it again!DerianPortland, ME4/9/2021Such an easy weeknight dinner! Loved the combo of spicy, coconut, mustard, green beans and cherry tomatoes.CatSeattle, Wa4/4/2021I made this last night with sous vide chilean sea bass which was cooked in the morning and added to the broth before serving to warm through. I used dijon mustard instead of  yellow mustard.\nIt was a HUGE hit. A keeper for our household.L. SmithLos Angeles4/3/2021Explore Bon AppétitCodFishSeafoodHaddockHalibutCoconut MilkOther IngredientsQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Shilpa Uskokovic"]}