{"id": "31b883c21110cbfc68ce61c754063775", "url": "https://www.bonappetit.com/recipe/nicoise-toast", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Niçoise Toast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueNiçoise ToastBy Molly BazMay 22, 20184.6(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintFried bread is our contribution to the classic niçoise. And this recipe is the moment to splurge on the best-quality tuna you can afford. (We love the meaty, sustainably caught Spanish tuna packed in buttery olive oil from Ortiz.) It makes all the difference in a simple preparation like this. Ingredients4 servings 4large eggsJuice from 1 lemon1lb. tomatoes, cut into bite-size pieces1medium shallot, thinly slicedA pinch of sugarKosher salt½cup mayonnaise1small garlic clove, finely grated1½tsp. sherry vinegar or red wine vinegar½tsp. hot smoked Spanish paprika4Tbsp. extra-virgin olive oil, plus more for drizzling4slices sourdough bread26–7-oz. jars oil-packed tuna, drainedFlaky sea saltFreshly ground black pepper½cup torn mixed tender herbs (such as dill, parsley, basil, and/or tarragon)¼cup oil-cured black olives, pitted, flesh tornPreparationStep 1Bring a medium saucepan of water to a boil. Gently lower eggs into pot with a slotted spoon and cook 8 minutes. Transfer to a bowl of ice water and let cool. Peel eggs; set aside.Step 2Toss lemon juice, tomatoes, shallot, sugar, and a pinch of kosher salt in a medium bowl.Step 3Whisk mayonnaise, garlic, vinegar, and paprika in a small bowl; season with kosher salt.Step 4Heat 2 Tbsp. oil in a large skillet over medium until shimmering. Add 2 slices of bread and cook, adjusting heat as needed, until bottoms are deeply browned, about 3 minutes. Transfer to a platter and sprinkle fried side with kosher salt. Repeat with another 2 Tbsp. oil and remaining slices of bread.Step 5Spread mayonnaise mixture over toasted side of bread. Top with tuna and tomato mixture; spoon some of the juices over. Tear each egg into 3 or 4 pieces and arrange on top; season with sea salt and pepper. Scatter herbs and olives over; drizzle with oil.Step 6Do Ahead: Paprika mayonnaise can be made 2 days ahead. Cover and chill.How would you rate Niçoise Toast?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis was delicious, but way too messy for a toast. I might mix it all into a salad and serve over greens, or eat with a knife and fork, but I had to wash my hands with soap and water after eating this. Very good, though. nelsonsBoston, MA3/2/2022Delicious with late summer tomatoes and some oil-packed mackerel (I didn't have any oil-packed tuna). The toppings were too numerous and unwieldy for just a single slice of toast per person so I split it out into two each and that was more manageable. My only critique is that there are a lot of moving parts for a quick toast meal but I'm already thinking of ways to simplify it. AnonymousOakland, CA9/19/2021This recipe is delicious! It is definitely a keeper. We used trefin tuna that we received as a Christmas gift and it put this recipe over the top. We had this for dinner on the first day of February 2021, in snowy Ohio and we feel like we are in the Mediterranean. Sue LanphierConcord Ohio2/2/2021its soooooo delicious. be sure to get a bread large enough to hold all the toppings or it will get too crowded. Lots of ingredients but totally worth it.Anonymous6/1/2020Wow! So easy and delicious. Glad I accidentally picked up the recommended tuna and stumbled across this recipe. Adding it to the regular rotation. AnonymousColumbus, Oh5/14/2020This is so delicious!! I splurged for the \"good\" tuna and, while it is lovely, don't think it is really worth it. Even with winter cherry tomatoes this was great.AnonymousNew York3/11/2020This quickly became my \"go to\" recipe over the summer.  I couldn't get enough!   I have been a tomato hater my whole life, but this simple trick of marinating them in lemon juice was a game changer.   All of the flavors in this recipe come together so nicely.   It just tastes like summer! AnonymousLos Angeles, CA9/26/2018Sounds and looks delicious but do we really need a recipe to boil an egg???AnonymousCalifornia9/6/2018Wouldn't change a thing.  Wish I could eat like this every night.  Can someone please put out a cookbook of \"toast\" dinner recipes?Los Angeles, CA8/16/2018OMG! That's what we said at the first bite. You need good summer garden tomatoes, good sourdough. We used TJ's albacore in olive oil, and drizzled the leftover oil over the top. So easy, and perfect for a hot summer evening with a nice rose.fraupSocorro NM6/25/2018It was even better than it looks.  And easy, too. I am looking forward to making it again!Cokiebee6/3/2018I was totally impressed by this.  I played fast and loose with measurements — don’t be shy with the garlic or acids. After finishing I daydreamed about the next time I would be able to prepare this dish.AnonymousHouston 5/24/2018Explore Bon AppétitToastFrenchEuropeanTunaFishSeafoodOliveOther IngredientsEggTomatoVegetableEasyQuickWeeknight MealsSnackStarterMainDairy-FreeNut-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}