{"id": "31bd7e85f22108e1729195994fbeca65", "url": "https://www.bonappetit.com/story/going-to-bed-with-tara-thomas", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Chef Tara Thomas Falls Asleep with Alter Rituals and No Pajamas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGinger Tea and Intention-Setting Get Brooklyn Chef Tara Thomas to SleepThe executive chef of Che in Brooklyn has a personal altar and a commitment to natural products. By Irina GroushevaiaDecember 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Tara Thomas is shaping the vegan landscape of Brooklyn. The 21-year-old Oregon native is the executive chef of Che, an upcoming plant-based all-day café on the ground floor of Bed-Stuy’s first small-scale boutique hostel: Sincerely, Tommy’s Eat & Stay. Scheduled to open in early 2020, it will be the second project from Sincerely, Tommy, a Brooklyn-based lifestyle store and coffee bar by Kai Avent-deLeon. (Sincerely, Tommy Well, a wellness retreat space focused on women of color attached to Sankofa Sanctuary in Grenada, is slated for later in 2020.)Thomas began using cooking as a creative outlet while attending engineering school in Portland, but quickly realized she felt more passionate about cooking than studying civil and environmental engineering. When a friend introduced her to vegan cuisine, she fell in love with the simplicity and beauty of plant-based cooking—and how good eating vegan made her feel. She began working in restaurants, plus as a private chef and event caterer, but felt out of place in Portland’s vegan community.“It wasn’t very diverse, and that environment wasn’t supporting me for me,” she says. “It felt like the [vegan] community was using [chefs of color] as tokens and all my clientele was white.”Seeking a more diverse community, Thomas moved to NYC over a year ago planning to enroll into PlantLab, a vegan cooking school. When it closed before she started classes, Thomas started producing private dinners and events without missing a beat. A mutual friend connected her with Avent-deLeon, who invited the chef to produce a private dinner called Mothers Who Create. Soon, Sincerely, Tommy offered her a full-time position conceptualizing the food for their upcoming restaurant.“I have had restaurant experience, but it didn’t sustain me well due to the negative and male-focused environment,” she says. “Now, my clientele are people of color, members of the LGBTQ+ community, and women. I feel that the food industry here has just been the opposite [of Portland]. Living in Brooklyn, I’ve felt so inspired by people like me making change simply by opening up shop in their neighborhood.”While shifting from chaotic freelance life into a staff position, Tara looks forward to working with a team and exploring intuitive cooking with a minimalist mindset and maximalist experience. For the end of the year, she’s focusing Che’s menu on root vegetables and warm spices, like autumn rolls stuffed with mulato peppers and cumin-glazed eggplant, served with plum chutney and roasted peanut-ginger dipping sauce. After work, Thomas carries her culinary inspirations into her nightly routine, using a mindful dinner experience and all-natural shower products to wind down amidst the city frenzy in her Bushwick apartment.Photo by Alex LauLounging with ginger root teaI love lounging and just hanging out, drinking tea (right now I’m really into making ginger root tea), and intentionally ignoring reality. I like to have time to imagine and dream, and lounging is a great excuse for that. I love being cozy and comfortable—being present with myself. It’s giving the luxury of time to yourself.Photo by Alex LauCooking dinner (and saving room for dessert)Dinner is sacred because that’s when I put an end to the day. I used to eat while doing something on a regular basis, and it made me so stressed. First, I like to set my workspace: I clean off all the counters so I can throw all my vegetables on it, pull out my cutting board, choose the knives I want to work with and a pile of bowls to use, then take out my oils, spices, and cast iron.I never plan my meals; I just go to the farmers markets on the weekend and pick out what looks good that’s in season. A grain and a green is the bare minimum meal and I have fun with that. My go to comfort dinner is Thai curry. The veggies and protein are different every time, but it always has coconut milk, coriander seeds, fresh ginger, fresh turmeric, onion, and garlic. I’ll finish dinner with tea and dark chocolate. Cacao is good for energy, mood, and stress—the chemical in it, theobromine, helps your brain and tastes amazing. I’m addicted, but it has to be raw, organic, ethical, and sustainable. I love Fine & Raw chocolate, which is made in Brooklyn.Giving time to othersI’ll spend an hour sitting down and chatting with my roommates, or I’ll call a friend or my sister, mom, and dad. I give love by listening to them about their lives. It’s a way to give time without being physically present. Sometimes I feel like I’m not doing enough, but giving your time is the most important thing you can give.Photo by Alex LauCleansing off the dayI need to get into the shower by 9.30 p.m. because I can just stay up and have conversations with people for a long time. The shower makes me sleepy and ready for bed. Everything I use is natural. I used to like having a lot of products, but now I just use a nice bar of soap (I love anything plastic-free, versatile, and made with intention, like Redoux) and moisturize with shea butter.  After I moisturize my body, I’m ready to lay down.Every two days, I rinse my hair with apple cider vinegar and scrub my scalp, and then after rinsing I’ll put castor oil and shea butter throughout my hair, strand by strand, and braid it in a protective style. I keep my hair moisturized, especially in the winter. I don’t like using a lot of chemicals—your body is a natural biotic system (living ecosystem) and will adapt to your environment, so when you use more natural products, your body isn’t as dependent on additives. That’s how I feel beautiful daily.Photo by Alex LauSetting intentionsI have an altar in my room, and I put my intentions in before bed, to know what I want to be abundant with and what I want to be thankful for.  There are so many things going on that could slip through the cracks, so constantly meditating on it or manifesting it is important, because then you sleep on it. My altar has several elements:An element of gold in the form of a deity: A gold Buddha that my mother picked up in Bali when she was traveling in the ‘80s. That's where she was inspired to name me Tara after the Hindu goddess.An element of life: A palm plant, vases of propagated plants, sentimental dried flowers.An element of fire: Candles, dried sage, and Palo Santo.An element of nature: Crystals, stones, and shells. I’ve been collecting them since I was a small child. I love when an element from a natural environment comes home with me, because I am able to connect to my experience and the energy of that place.It also has a bag of money that I add to as a manifestation for abundance.“The bed is my outfit”I don’t wear pajamas; the bed is my outfit for the night. I don’t like any synthetic material, so my bed is 100% cotton and my comforter and pillows are bamboo.  Bamboo is antibacterial, and I spray Thieves essential oil all over my bed, which is also antibacterial and has a really cozy smell.  I live on a busy street, and it can be really chaotic, so I close the blinds in my room to close out the day.Explore Bon AppétitGoing to Bed withHealthyishInterviewsRead MoreLifestyleArtist Nadia Gohar Calms Her “Studio Brain” with Fennel Tea and Soft PJsBy Kyle BeecheyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Irina Groushevaia"]}