{"id": "31da6836b2faf11d79d6855b82952595", "url": "https://www.bonappetit.com/story/comfort-minnesota-cossetta", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Looking for Comfort in Minnesota, I Found Cossetta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsLooking for Comfort in Minnesota, I Found CossettaThis mostaccioli haven was not just my introduction to Italian-American food. It was my introduction to restaurants, period.By Bao OngApril 16, 2019FacebookTwitterEmailPhoto by Eliesa JohnsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I never considered myself an emotional eater until I saw a dead body floating in the Mississippi River. Nearly a decade ago, as a junior reporter at what was then the St. Paul Pioneer Press, I watched as rescuers pulled up a missing sewer worker from the murky river that divides St. Paul and Minneapolis. There was no time to process the shock—I was on the Saturday shift covering breaking news, and I had just a few hours to write a story about the tragedy for the next day’s paper.So, naturally, I made a beeline for Cossetta, a local family-owned red sauce joint, and ordered the mostaccioli pasta, a hefty serving of penne oozing with cheese and marinara. It was the perfect dish and place for a reporter on deadline. The food was pure comfort. You weren’t rushed out like you were at a deli, but you also didn’t come to linger over a glass of Barolo. It felt like a homey cafeteria.But Cossetta (commonly referred to as Cossetta’s, but as the fourth-generation owner Dave Cossetta once told me: “It’s like Gucci, not Gucci’s”) was about so much more than the food for me. It was not only my introduction to Italian-American food, but also in a lot of ways my introduction to restaurants in general. Growing up in a family of six with first-generation immigrant parents, dining out was an extravagance, and the closest thing we got to Italian food was the occasional Totino’s frozen pizza. I could only fantasize about some of the foods my friends ate with their families. Chef Boyardee. Pizza Hut. Hot Pockets. (The Italian-American culinary canon, as I understood it.)All homey cafeteria vibes here.\nPhoto by Eliesa JohnsonBut all that changed when, as a 15-year-old high school freshman, I stepped past the green awning into Cossetta. I went there with my English class after seeing a production of Rent. I’ll never forget my first order of that mostaccioli, a plastic plate piled high with pasta tossed in a ricotta cream sauce and topped with a sausage-laced tomato sauce. I may have grown up eating rice with every home-cooked meal, but from that moment on, my pasta obsession never waned. I was hooked.For as long as I lived in St. Paul, Cossetta was where I commemorated milestone after milestone: signing the lease for my first apartment, turning in my senior thesis, breaking up with a boyfriend. After landing my job at the paper, where the newsroom was within walking distance, I ordered the mostaccioli at least once a week.My idea of Italian food is more expansive these days. I went to culinary school, I’ve dined at all the hip “regional Italian” spots in New York over the past 10 years, and I’ll happily throw down for the cacio e pepe of the moment. But I still find myself gravitating toward the iconic red sauce restaurants in Manhattan’s Little Italy, places where I can pronounce Chianti “chee-ANT-ee” and scarf down a simple plate of carbs. Turns out, I’m still craving the comfort and familiarity that Cossetta offered, after all these years.Bao Ong is the Food and Drink Editor of Time Out New York. Before that, he was a member of the Bon Appétit research department.Explore Bon AppétitRed SauceItalian AmericanRestaurantsSt. PaulRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Bao Ong"]}