{"id": "31da02efa56923744633481e235e4a03", "url": "https://www.bonappetit.com/story/nina-compton", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "New Orleans Chef Nina Compton Isn't Afraid of the Dish Pit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNew Orleans Chef Nina Compton Isn't Afraid of the Dish PitBut the Bywater American Bistro and Compère Lapin chef also knows how to unwind with a glass of Côtes du Rhône.By Kristin BraswellJune 7, 2019FacebookTwitterEmailPhoto by Wes FrazerFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Nina Compton, chef-owner of Compère Lapin and Bywater American Bistro.Nina Compton faced her first kitchen nightmare apprenticing at the Michelin-starred restaurant Daniel: Chef Boulud’s wife had come in for lunch and sent back the gougères. As luck would have it, Compton had made them.“I remember everyone in the kitchen stopped what they were doing—separating eggs, weighing flour—and started cursing in French. I prayed the floor would open up so I could disappear,” she recalls. “It was a crazy moment of failure, but working in a kitchen of that caliber, it was perfection or nothing. Now I just look back and laugh.”As the James Beard Award-winning chef behind Compère Lapin and Bywater American Bistro in New Orleans, Compton has come a long way from her days of apprenticeship.The 40-year-old St. Lucia native (she’s the daughter of the island’s late Prime Minister Sir John George Melvin Compton) discovered her passion for Caribbean cooking watching her mom and granny at home. She studied at The Culinary Institute of America, apprenticed with Daniel Boulud in New York City, then joined the kitchen crew at Norman’s and Palme d’Or before becoming chef du cuisine at Scott Conant’s Scarpetta in Miami. In 2013, she won second place and fan favorite on Bravo’s Top Chef: New Orleans. “I really think participating in Top Chef changed everything for me,” she says. “I had the opportunity to cook what I wanted, and I really wanted the world to see what Caribbean food is about.”Compère Lapin—named after a mischievous rabbit in Caribbean folklore—lures crowds to the industrial space on the ground floor of the Warehouse District’s Old No. 77 Hotel & Chandlery with food celebrating Compton’s Caribbean heritage and French/Italian training. Think snapper escovitch with carrot beurre blanc and the star of the show: tender curried goat with pillowy sweet potato gnocchi buried underneath. Her second restaurant, Bywater American Bistro, is Compton’s take on casual neighborhood dining with comfort food like pickled shrimp with buttermilk and a half chicken with dijon vinaigrette.We talked to Compton about her guilty pleasures, music must-haves, and favorite flavors to play with.The best meal I ever had was… at Manresa. I really felt a connection with David Kinch through the food. I had abalone and poblano chowder—the layers of flavor were incredible and the addition of abalone dashi was really special.When I want to zone out I… Play reggae. Whether I’m stressed out and want to zone out or I’m feeling excited and want to go for a walk or bike ride, reggae suits every one of my moods. I love anything by Steel Pulse, Bob Marley, or even Sublime. But when I hear Your House by Steel Pulse, my stress level drops to zero instantly.Growing up in St. Lucia taught me… how to be humble. It taught me to appreciate where I come from and understand that it’s the little things in life that are so important, like having a mango or avocado tree in your backyard.If I could cook for anyone in the world it would be... My dad and granny who passed away. They were both so instrumental in my love for food and life, and I would love to cook for them one last time. I would make flying fish in parsley sauce, which was my granny’s favorite dish to make when I was growing up, and a one pot stew. My dad would throw everything he could find in a pot and make this delicious stew that we would have for lunch when we went sailing. Both bring back fond memories.My favorite guilty pleasure is… Forensic Files and a glass Côtes du Rhône Saint-Cosme at the end of a day.I’m currently listening to… Oasis, Nightmares on Wax, Kendrick Lamar, Santigold.Food is… life and happiness.My favorite flavors to cook with are... Indian and African. It’s a history lesson for me and teaches me how things evolved on the islands. There is such a strong influence from India and Africa, not to mention the spices and ingredients are so unique and flavorful.I want people to remember me for… trying to let people know that Caribbean food is so exciting and you can experience it in such a fun fashionI can’t live without... music, it sets the tone for my day.The biggest challenge of running restaurants is… consistency. The expectations are high and to deliver each day is very hard and demanding.The most rewarding part of running restaurants is… seeing my staff that have been with me from day one grow each day. It makes me feel like I did something right.After I won a James Beard award I… was in the dish pit the very next day!Explore Bon AppétitHealthyishNew OrleansPerson of InterestInterviewsRead MoreLifestyleAdrienne Maree Brown on Why Joy Is a Form of ResistanceBy Maggie LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-07", "author": ["Condé Nast", "Kristin Braswell"]}