{"id": "31e0b4ec6e3c0af4a142332ab47d2238", "url": "https://www.bonappetit.com/story/path-to-inclusivity", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "The Path to a More Inclusive Bon Appétit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Path to a More Inclusive Bon AppétitWe're learning, and evolving, as we go.By Adam RapoportFebruary 4, 2020FacebookTwitterEmailIllustrations by Kristin EddingtonFacebookTwitterEmailOnce a week, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.One of the questions we get a lot at Bon Appétit—both from our readers and from our own editors—is how can we be more inclusive? How can our staff and the chefs we cover and the talented folks we collaborate with better represent the fabric of this country and its remarkably dynamic food scene?It’s a subject we’ve committed more and more time to, not just in a conversational way but by integrating it into our clearly stated objectives as a brand. We have instituted a series of department-by-department meetings focusing on diversity. We set measurable goals, both in terms of hiring and editorial pursuits, that we assess quarterly and hold ourselves accountable to.Some of the changes we have been making have yielded immediate results, some have been nuanced, and some will be more slow-going. All of them need to be part of an ongoing conversation and not just a one-time discussion.One byproduct of confronting an issue head on is that there are going to be missteps along the way. Just this past weekend, we published a neighborhood guide and produced an Instagram story on Brooklyn’s Bed-Stuy and Crown Heights neighborhoods. The piece was written by Ryan Walker-Hartshorn and Jesse Sparks, two Black editors on staff. They wanted to write an article featuring Black-owned businesses in the historically Black neighborhoods that, like many areas in Brooklyn, have undergone a tremendous amount of change in the past decade-plus.The piece is everything a Bon App piece should be—spirited, opinionated, informative, and visually stimulating. But it sparked a Twitterstorm of criticism, and not surprisingly so. The title of the piece, “My Big Black Weekend in Bed-Stuy and Crown Heights,” is a riff on a recurring BA travel column called “My Big Fat Weekend in…”, which itself is a riff on that movie from 2002, and is a tired pun and one that we were in the midst of recasting.The problem is that when a brand like Bon Appétit tweets a piece titled “My Big Black Weekend...” it not only sounds tone deaf, but as if a corporate-owned food brand is trying to capitalize on and profit from a community that has been underrepresented by our brand. Countless stories on Black-owned restaurants have been left out of publications like ours for decades. As an editor, it’s on me to work to change this and to cultivate a more inclusive environment—both for our editors and the audiences we hope to reach.Ultimately, as Bon Appétit grows and evolves, we are going to make mistakes. And when we do, we expect to hear from you and learn from you. After all, we can’t connect with a broader spectrum of communities if we’re not communicating with them.Explore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-05", "author": ["Condé Nast", "Adam Rapoport"]}