{"id": "31ec6a7e7f33145d6f33e7364881e550", "url": "https://www.bonappetit.com/story/bread-making-tools", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "The 14 Breadmaking Tools You Need to Make Better Homemade Loaves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Are the Tools You Need to Make Better BreadWe polled a panel of experts on their favorite flours, lames, and Dutch ovens.By MacKenzie Chung FeganOctober 28, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Unlike glassblowing or dressage, making bread is a hobby that requires little in terms of initial investment. You need flour, you need packaged yeast or a sourdough starter (which you can order, get from a friend, or cultivate on your own), and you need an oven. All other tools are negotiable.But if you’re several loaves in and have decided baking might be more than just a passing COVID-era distraction, it might be time to level up your breadmaking tools. We turned again to our panel of experts—Josey Baker, author of Josey Baker Bread; Amanda Turner, former baker at Odd Duck in Austin; Joy Huang, home baker of Instagram renown; and Claire Saffitz, who needs no further introduction—to find out what equipment, from digital scales to bread knives, they rely on at home.Starter Storage“I feel strongly about our sourdough home: a translucent plastic deli quart container, nothing fancy or special about it. It’s round, which makes stirring easy (no corners), it’s the right depth (a butter knife or chopstick will reach all the way to the bottom for thorough mixing), it’s tapered (no having to reach under a ledge like in a jar), and it’s super accessible and affordable!” —Josey BakerPlastic Quart Containers, 24 Pack$25 at AmazonArtisan Flour“I didn't know how interesting different wheats and grains could be until I worked with our local artisan flour gurus at Barton Springs Mill. I especially recommend their Rouge de Bordeaux flour, which has such a unique flavor and a good amount of protein. When baked it has notes of cinnamon and baking spice, but it works well in savory applications too. They’ve just started shipping straight to consumers, so it’s an awesome opportunity for home cooks to get their hands on flour that typically you would have to buy at a farmers market or specialty purveyor.” —Amanda TurnerRouge de Bordeaux Flour$10 at Barton Springs Mill“I love locally grown, fresh milled whole grain flour the most, but Central Milling is a good mail order option.” —J.B.Organic High Mountain Bread Flour, 5 lb. bag$11 at Central MillingScale“This scale has a high capacity—up to 20 pounds—and is extremely precise.” —J.B.AvaWeigh 20 lb. Scale$40 at Webstaurant StoreBanneton“An 8.5-inch banneton is the perfect size for my loaves, which are 985 grams before baking. I recommend getting one with a liner. Without one, you will get those rings of flour on your loaf—which is pretty, but if you’re scoring detailed patterns, a smooth floured surface is preferable.” —Joy HuangForsun 8.5\" Round Banneton$14 $10 at AmazonDusting Wand“The one unexpected bread making tool I find myself using throughout the process is this little dusting wand from Oxo. It offers a ton of control, so I don’t have flour flying everywhere when I’m dusting a work surface, dough, or banneton.” —Claire SaffitzOxo Baker’s Dusting Wand$10 at OXO$15 at AmazonBench Scraper“I personally like a bench scraper that is on the larger side because it makes cutting through large amounts of dough easier. Some bakers I know even sharpen the edges like you would a knife to make cutting easier.” —A.T.6\" Dough Scraper$6 at AmazonBowl Cover“I use a plastic shower cap—the kind you get from hotels—to cover my bowls and bannetons. It’s easy to slip on and off, and unlike plastic wrap, reusable.” —J.H.Plastic Shower Caps$9 at AmazonLame“I like to score intricate designs into my bread, and I don’t like traditional lames because I feel like I have less control. But I love these UFO lames because it’s like holding the razor blade in your hand—but without danger of cutting yourself.” —J.H.Wire Monkey UFO Lame$28 at Wire Monkey$28 at EtsyRazor Blade“This is a good brand of double-edged razor blade. At the bakery, we use them on lames/handles, but if you don’t have one at home, I suggest eating a Popsicle, then carving the Popsicle stick to fit the razor.” —J.B.Personna Double Edge Razor Blades$18 $11 at AmazonDecorating Turntable“For scoring, I use a cake decorating turntable to make it easy to rotate the dough, dental floss to help plot out the center of the loaf and its axis of symmetry, and a wooden skewer to draw with.” —J.H. (See Joy’s technique here.)Wilton Decorating Turntable$9 at TargetCombo Cooker“A combo cooker is sort of like an upside-down Dutch oven—you place your loaf on the preheated skillet and cover it with the domed lid. Lodge’s Cast Iron Combo Cooker is a great and not super expensive option.” —J.B.Lodge Cast Iron Combo Cooker$79 $45 at Amazon$60 at LodgeDutch Oven“This is the Dutch oven that I use for home baking. It’s hard to beat this quality for the price, and cast iron not only retains heat really well, but will last forever. You could buy a combo cooker especially for bread baking, but if you use parchment to lower your loaf into the pan, any good Dutch oven will do. This is a good one.” —A.T.Lodge 5-Quart Cast Iron Dutch Oven$45 at Amazon$55 at LodgeBaking Steel“Instead of worrying about burning myself by getting my loaf into a Dutch oven, I just slide my dough on parchment paper right onto my Baking Steel and then invert a stockpot over the bread.” —J.H.Baking Steel$119 at Baking SteelBread Knife“This is the bread knife that I use. I’ve had a lot of different bread knives in my career, but this one was given to me as a gift from a friend about five or six years ago and it’s still razor-sharp! Also, the quality for the price is really great, so I highly recommend it.” —A.T.KORIN Japanese Trading, Corp.Korin Suisin Inox Bread Knife$59 at KorinExplore Bon AppétitShoppingBreadToolsRead MorecultureSo You’ve Started Making Sourdough...By MacKenzie Chung FegancookingA Preferment Is Your Ticket to Baking Better BreadBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-28", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}