{"id": "31ec4332e24a6cea731a908068546b0d", "url": "https://www.bonappetit.com/recipe/winter-spiced-margarita", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Winter Spiced Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredWinter Spiced MargaritaUsing sweet blood oranges and warming spices like vanilla and cinnamon, Amanda Shapiro’s Winter Spiced Margarita makes us feel super cozy right now. Produced in partnership with Patrón Tequila.By Amanda ShapiroFebruary 22, 20214.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintIngredientsCocktail:1½oz. Patrón Reposado Tequila1tsp. agave nectar½oz. lime juice½oz. blood orange juice½tsp. vanilla extractRim/Garnish:½tsp. flaky salt½tsp. sugar¼tsp. cinnamon¼tsp. chileOPTIONAL: cinnamon stick, star anise pods, and/or blood orange slice (for garnish)PreparationPreparationStep 1Combine the sugar, salt, chile, and cinnamon on a small plate. Rub rim of an old-fashioned or rocks glass with lime half; dip in spice mixture. Fill with ice and set aside.Step 2Combine 1½ oz. of Patrón Reposado Tequila, lime juice, blood orange juice, vanilla extract, and agave nectar in a cocktail shaker. Fill shaker with ice, cover, and shake vigorously for about 20 seconds.Step 3Strain margarita through a strainer or a mesh sieve into reserved glass. Garnish with cinnamon stick, star anise pod, and/or blood orange slice.How would you rate Winter Spiced Margarita?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-22", "author": ["Condé Nast", "Amanda Shapiro"]}