{"id": "31ec74964d9fcf07a4cd3b6dcadac191", "url": "https://www.bonappetit.com/recipe/perfect-baked-potato", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Perfect Baked Potato Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2014 IssuePerfect Baked PotatoBy Andrew KnowltonPhotography by Christopher BakerApril 27, 20213.7(825)Read ReviewsTriangleEmailPinterestPrintPhoto by Christopher BakerEmailPinterestPrintEmailPinterestPrintIn our book, learning to make a perfect baked potato is a key life skill—and an easy one to master. Start by picking firm, unbruised starchy potatoes labelled russet or Idaho and give them a nice scrub down so you don’t end up with a mouthful of dirt later on. Pricking them all over with a fork allows steam to escape from the spud (no potato explosions, please!), and a little olive oil, salt, and pepper is all the accompaniment they need before heading into the oven.This result is as blank-slate as it gets—and that’s on purpose. Our ideal baked potato is crisp on the outside, has a pillowy interior, and is up for dancing with almost any savory flavor in your fridge or pantry. To serve, slice lengthwise down each potato, and finish with whatever toppings you crave, such as labneh, olive oil, and za’atar, or top it with Brooklyn Delhi's Tomato Achaar. For a finish worthy of a steakhouse, add a pat of the best butter you can find and a sprinkling of chives while it’s still piping hot.Editor’s note: This recipe was originally published January 14, 2014.Ingredients4  Servings4russet potatoes (about 2½ pounds), scrubbedOlive oil (for rubbing)Flaky sea saltFreshly ground black pepperUnsalted butter, finely grated Parmesan (or your favorite cheese), and/or chopped fresh chives (for serving)PreparationStep 1Preheat oven to 350°. Prick potatoes all over with a fork and rub with oil; season generously with salt and pepper.Step 2Place potatoes directly on an oven rack and roast until very soft when squeezed and skin is crisp, 60–75 minutes.Step 3Cut open each potato; season with salt and pepper and top with butter, Parmesan, and/or chives.Nutrition Per ServingCalories (kcal) 230 Fat (g) 1.5 Saturated Fat (g) 0 Cholesterol (mg) 0 Carbohydrates (g) 51 Dietary Fiber (g) 4 Total Sugars (g) 2 Protein (g) 6 Sodium (mg) 135How would you rate Perfect Baked Potato?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleI have to say, I feel pretty amateurish, I have never baked a potato without covering it in foil. I have to try this now. I have baked as many as 40+ in my oven at one time for a fund raiser at 400 degrees for an hour and 20 minutes and they would come out thoroughly cooked, but I have got to try for this crispy skin. Thank you!Cynthia LayneDenver, Colorado1/19/2022450 for ~45 minutes, until temperature at the center is about 205. Remove and coat with olive and salt, bake for 10 more minutes to crisp up the skin. \n@anonymous in Norway this is a US mag on a US site on a US internet. If you're salty about that then go to a Norwegian site, pretty simple. Jane DoeFlorida11/7/2021Please, please, please allow recipes to be printed without a giant picture and  dialog before the ingredients.  It takes up a whole page or more with sooo much wasted ink too.tc4tuna9675310/25/2021202 degrees is the magic number to know when it is cooked then Butter and oil or just one or the other, put it back into the oven @450 for 15 minutes to crisp it up.Harry HuntGlen Cove, New York12/4/2020Not a very precise recipe.  I have a truly perfect baked potato recipe from America's Test Kitchen.  You should read it. It will give you some useful tips, like the right temperature for the finished potato.AnonymousSan Diego 12/4/2020No more microwaved potatoes for me. This is the way my mom made them as it should be. A world of difference! 😋AnonymousBedford, NY12/4/2020I've made these several times now.  I follow the recipe exactly, baking at 350 F for 75 minutes.  The potatoes come out perfectly, as the name implies.  Soft, creamy interior and crispy skin.  Low and slow is the way to go for my potato!DaveSPalm Coast, FL11/29/2020Baked Potato\n\nBaked Potatoes are a little difficult to get just right. I'm working on my third try recently based on this recipe. (Actually, Olive Oil & Kosher Salt is pretty much the standard.)\n\nThe first, I cooked a pretty large potato @ 400° for at least an hour and a half, perhaps a little longer. Unfortunately, though the center was well cooked, the outside was to crisp to cut with a fork.\n\nThe second, I tried a much smaller potato @ 350° for an hour. It was cooked but not to the point of being soft on the inside. The outside was softer.\n\nOne of the comments spoke of cooking at low temperature for a long time, there is likely something to that.\n\nI'm now trying a medium to large potato @ 360° for an hour-and-a-half.\n\nHopefully, it will be lightly crisp but still soft enough to cut with a fork on the outside and nicely cooked on the inside.\n\nUpdate:\n\n360° @ 90 minutes worked well. {100 minutes is likely just fine.}\n\n[That's 180° for those at the center of the Universe; AKA Denmark.]\n\nMy presumption is that the larger the potato the longer it takes to heat through, then cook. Multiple potatoes might add to the oven time, but the size of the potatoes is most likely the key determining factor. It might be prudent to reduce heat for very large potatoes, say 340° [170° in Denmark]; however, you would then have to add time, likely around 2 hours.\n\nOlive Oil & Kosher Salt are all that is needed to season the skin, though a little Coarse Ground Pepper and/or Granulated Garlic would also add good flavor.\n\n[400° = 200° {or 205°}]P58Puget Sound6/28/2020Baked Potatoes are a little difficult to get just right. I'm working on my third try recently based on this recipe. (Actually, Olive Oil & Kosher Salt is pretty much the standard.)\n\nThe first, I cooked a pretty large potato @ 400° for at least an hour and a half, perhaps a little longer. Unfortunately, though the center was well cooked, the outside was to crisps to cut with a fork.\n\nThe second, I tried a much smaller potato @ 350° for an hour. It was cooked but not to the point of being soft on the inside. The outside was softer.\n\nOne of the comments spoke of cooking at low temperature for a long time, there is likely something to that.\n\nI'm now trying a medium to large potato @ 360° for an hour-and-a-half.\n\nHopefully, it will be lightly crisp but still soft enough to cut with a fork on the outside and nicely cooked on the inside.P58Puget Sound6/28/2020350 degree? My eurpeean oven does not even reach this far. Oh, are just beenig world excetrict and think the center of the universe is the US?AnonymousDenmark5/17/2020Followed this to a T but added some seasoning salt blend. Cooked for about an hour at 400. They were great! HalieransomLawton,Oklahoma 1/15/2020I followed the recipe and cooked at 425. The skin was like a potato chip. Definitely the best baked potato I’ve ever had!AnonymousPA5/2/2019It says 400 degrees on the original post and 375 here.  which is better?AnonymousWest Hills, CA4/19/2019To Anonymous from Pittsburgh: I like your method, but would add a step: use your oven mitts and brush the salt off immediately before serving. Otherwise that crispy skin is too salty to eat, even for a salt lover like me, and everything else on the plate will pick up too much salt, too.AnonymousSan Francisco4/18/2019...the perfect food.AnonymousRedington Beach, Fl4/16/2019Explore Bon AppétitPotatoVegetableRusset PotatoEasyWeeknight Meals5 Ingredients or FewerSideGluten-FreeNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-01-14", "author": ["Condé Nast", "Andrew Knowlton", "Christopher Baker"]}