{"id": "31ed28e6a06e1feed5773b2ea8769930", "url": "https://www.bonappetit.com/recipe/salmon-coconut-soup", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Salmon Coconut Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalmon Coconut SoupAdjust the heat in this riff on Thai tom kha gai to your liking—use one chile for mild heat, two for medium, and three if you want sweat beading on your brow.By Diana YenMarch 21, 20214.3(154)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintPacked with clear-your-sinuses heat, this comforting and spicy coconut soup will warm you up on cold nights. Inspired by the classic Thai soup tom kha gai, this version has pieces of salmon instead of chicken and uses easy-to-find ginger instead of traditional galangal root. (If you have access to galangal, though, by all means use it!) Fresh lime juice adds a bright, tangy finish that balances out the richness of the coconut broth. Try serving it with vermicelli noodles for a heartier meal. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At Amazon8-Inch Chef's Knife$47 At AmazonDutch Oven$80 At AmazonMeasuring Spoons$10 At Bon Appétit MarketCutting Board$10 At IKEALarge Bowl$18 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonIngredients4–6 servings1½lb. skinless salmon fillet2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided8oz. mixed mushrooms (such as shiitake, oyster, maitake, and/or nameko)½medium onion3garlic cloves13\" piece ginger1–3red or green Thai chiles or serrano chiles2lemongrass stalks1Tbsp. virgin coconut oil8makrut (Thai) lime leaves or zest of 2 limes213.5-oz. cans unsweetened coconut milk2Tbsp. fish sauce1tsp. sugar2limes, dividedCilantro leaves with tender stems (for serving)PreparationStep 1Cut 1½ lb. skinless salmon fillet into 1\" pieces. Place in a large bowl and season with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt.Step 2Trim tough stems off 8 oz. mixed mushrooms (such as shiitake, oyster, maitake, and/or nameko). Slice shiitake mushrooms ¼\" thick. Tear oyster, maitake, and/or nameko mushrooms into small clusters. Add to bowl with salmon.Step 3Trim root end from ½ medium onion; peel and discard skin. Coarsely chop onion and transfer to a medium bowl. Smash, peel, and coarsely chop 3 garlic cloves. Transfer to bowl with onion.Step 4Using a spoon or vegetable peeler, remove skin from one 3\" piece ginger. (A spoon works well to reach all the nooks and crannies.) Thinly slice into rounds and add to bowl with onion.Step 5Cut 1–3 red or green Thai or serrano chiles in half lengthwise (use 1 for mildly spicy, 2 for medium, or 3 if you want sweat beading on your forehead) and place in a small bowl.Step 6Remove tough outer layers from 2 lemongrass stalks, revealing the softer, pale yellow stalk. Trim off top two thirds of stalk and discard (or save to use for tea). Slice lemongrass into thin rings, then finely chop; add to bowl with chiles.Step 7Heat 1 Tbsp. virgin coconut oil in a large Dutch oven or other heavy pot over medium heat. Add onion, garlic, and ginger and cook, stirring occasionally, until softened and fragrant, about 3 minutes. Add chiles and lemongrass, 8 makrut (Thai) lime leaves or zest of 2 limes, two 13.5-oz. cans unsweetened coconut milk, remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 3 cups water. Bring to a boil over medium-high heat, then reduce heat until soup is barely bubbling (medium-low heat or lower) and gently simmer, stirring occasionally, until flavors come together, 8–10 minutes.Step 8Add salmon and mushrooms to pot, increase heat to medium-high, and return to a boil. Reduce heat to medium-low and simmer, until salmon is just cooked through and starting to flake and mushrooms are softened, 8–10 minutes. Gently stir in 2 Tbsp. fish sauce and 1 tsp. sugar. Slice 1 lime in half and squeeze in juice.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Ladle soup into bowls. Cut remaining lime into wedges. Tear or coarsely chop cilantro leaves with tender stems. Serve soup with lime wedges and cilantro on the side.How would you rate Salmon Coconut Soup?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleLove this soup! made it few times this winter and its a family hit!\nI add Thai rice noodle at serving, to make it more substation for growing teens.\n 5 starts !SharonNew York City1/30/2022Reviews also made me nervous but this turned out fantastic with some minor modifications.  One serrano chili gave little heat, so I'll use two next time.  I used 2T of Gourmet Garden lemongrass paste for ease of preparation.  Added 3 carrots to the onion and garlic.  2 cups chicken broth was a bit too thick so I'll use 3 cups next time.  ~3 oz. spinach at the end.  My wife loved it - this recipe is definitely a keeper.Go4JugularLake Oswego, OR1/23/2022This is a great soup!  I increased the ginger, lemon grass and lime juice.  I think the water is a must for this recipe.   I also added chicken and galangal root along with the salmon……yummy Stacy  Escondido California 1/23/2022this one should be revised to either be clearer about how finely to cut the lemongrass or perhaps to grate it instead.  I tried to cut it like the picture shows and I'm stuck with a lot of very woody bits.\n\nadditionally, I think reducing the stock a little more or replacing some of the water with stock would go a long way to make it much more flavorful.maxbrooklyn1/19/2022Outstanding recipe, very true to Thai original, lots of chopping, slicing and dicing, but well worth the effort.  Delicious use of a lot of expensive salmon, the only waste being the skin.  Husband loved it, will be making this one again.LaTigressePortland, OR1/17/2022My whole family (except for my tremendously picky brother, who didn't try it) loved this recipe. I substituted the mixed mushrooms for dried white fungus because that was all I had, the fish sauce for soy sauce, and added some thinly sliced radishes and celery to the garlic and onion. It turned out delicious!AnonymousLondon, UK1/10/2022After reading the reviews I was a little nervous it wouldn’t taste good, but made some modifications and it came out great! I basically halved the salmon (I’m 1 person) and the amount of liquid, 1 1/2 cup bone broth, 1/2 cup water and 1 can coconut milk, and pretty much kept the same amount for all other ingredients. Then added a tbsp of homemade yellow curry  paste and tsp of yellow curry powder, added great flavor! Makes for a bit of a thicker soup but came out delicious! Kalli K.Darby, Montana 1/5/2022I make this same soup but only with chicken -- we don't care for salmon.  A couple of tips -- instead of using plain water, use Better Than Bouillon chicken stock to make broth.  Also, to make it a more complete meal, I peel and slice a few carrots and add along with the onion and ginger.   A couple of minutes before serving, I add a couple of handfuls of fresh spinach and let it simmer just until spinach is winter.  Everybody loves it and wants the recipe.Nancy SDenver, CO1/5/2022Don’t believe the number of stars… this is a dud! Completely tasteless! What a waste of my time! Horrible - walk away… AnonymousSonoma, CA10/5/2021Absolutely delicious. I've shared this recipe with friends and family, Universally loved. \nWinner of there is nutritional info such as calories. Suzanne Levin Pleasant Ridge, MI 9/22/2021LOVED THIS. I made some adjustments based on the reviews - I did NOT use water (why would you even suggest that?) I was going to use fish stock, but local wegmans had “Thai stock” so I used 1 cup + the 2 cans of coconut milk and after reducing it was thick and delicious. I also added 2 tbs of red curry paste, crisped up the mushrooms first & doubled the lime juice. Served over cilantro lime rice and it’s absolutely delicious! xtristatex Lancaster pa 8/22/2021Bad bad bad… this is not what they tell you it is… not remotely like Tom Kai Ga - made it as instructed but did reduce water by half, thank fully. If full water called for this would have been the biggest waste of $24/lb salmon. This is a bad recipe!PegmatSonoma CA7/31/2021I didn't read the reviews until I was ¾ done with the recipe (wish I had) but it turned out really really delicious, nonetheless. I instinctively cooked the broth (coconut milk, water and aromatics) a lot longer than the recipe called for to get the right texture and flavor. The mushrooms do cook faster than the salmon, I will toss them in a little earlier next time I make this. I was very liberal with cilantro and lime juice to finish. Overall, it was a pretty addictive soup. Probably won't use habanero peppers next time (!) but they were all I had. Maybe because I had a heavy hand with lemongrass and other flavors, this soup was FAR from bland for me. honeybee130667/23/2021i have a big dilemma :) I would like to cook this soup for my husband but i have no idea which kind of second plate and dessert are passed beside it.\n\nAre there any suggestion from somebody? :)OrsheBarcelona, Spain7/5/2021I made this exactly as directed and it was DELICIOUS!! Thank you.  I also want to suggest that the star rating does correctly record the number each person chooses, it is just that there are so many high ratings, that factoring in each choice keeps the equation at 5.keep tryingCalifornia5/15/2021Explore Bon AppétitSoupSoups and StewsThaiSoutheast AsianAsianCoconut MilkOther IngredientsSalmonFishSeafoodMushroomVegetableLemongrassHerbs & SpicesOne-Pot MealsMainGluten-FreeDairy-FreeKetoSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-21", "author": ["Condé Nast", "Diana Yen"]}