{"id": "3209cf6c89d3f0eccaeafa7c0141b07c", "url": "https://www.bonappetit.com/story/breakfast-in-bed-feud", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Hidden Inside This Brisket Recipe Is an Incredible Scallion-Peanut Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHidden Inside This Brisket Recipe Is an Incredible Scallion-Peanut SauceYou can spoon it on chicken, steak, or a platter of Saltines. YUM!By Alex BeggsMay 9, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Smash the tatersWearing a souvenir apron of Michaelangelo’s David’s...frontside...a man named Bill manned the grill last weekend when we made a minor feast of Chris Morocco recipes, followed by one of Molly Baz recipes. Both were fabulous and I’d highly recommend recreating them:Night 1: Chris’s brisket with peanut-scallion salsa is a sleeper hit. The salsa is the star, though, and it works with anything you’re grilling because it’s crunchy, nutty, garlicky—not very controversial qualities, unlike that apron. So we grilled steaks we got on sale, shout out to Hollywood Market in Troy, Michigan. Then on the side we had Chris’s Big-Flavor Broccoli, which lived up to its name. At first you’re like, soooo it’s roasted broccoli? But the red onions you cook down first give it this low-key sweetness, anchovies dissolve into mysterious explosive umami, and you top it with CHEESE. I stood alone at the stove and watched the cheese melt onto the broccoli and thought, This is the best thing that’s happened to me in a long time. Because it WAS.The recipes:Grilled Brisket with Scallion-Peanut SalsaBig-Flavor BroccoliPhoto by Chelsie Craig, Styling by Molly BazNight 2: Bless that salt goddess Molly Baz for her spicy (not thaaat spicy) coconut grilled chicken thighs and smashed potatoes. We made three pounds of potatoes and they disappeared immediately. Even if you mess them up, slightly overcooking them in the boiling water, which the recipe explicitly warns not to do—it’s fine. Because the smushy bits still got crispy in the hot oven and the walnut topping covers all sins. The chicken’s marinade is made up of stuff that’s usually in my pantry: coconut milk, anchovies, sambal, ginger, sugar, and lime juice. So I’ll be making that again this summer, maybe with SHRIMP!? Imagine!The recipes:Spicy Coconut Grilled Chicken ThighsCrispy Smashed Potatoes with Walnut DressingWant this letter before it hits the website? Sign up for our newsletter!In cereal newsThe latest bored-in-the-house-in-the-house-bored food trend is COOKIE CEREAL and PANCAKE CEREAL and I’m not even going to look further into those because I can guess what it means. All cereals are tiny cookies anyway; this seems like a natural progression. But may I remind you that Cheerios are still great? I’ll even take HONEY NUT SCOOTERS, the bagged generic brand my mom bought spitefully, to be served with a nice bowl of 2 percent watermilk. Whatever gets ya going.Sweaty meats“Do you like puffy bread and sweaty meats?” I’ve been listening to the hilarious “Oh, Hello” p’dcast (which investigates, uh, Princess Diana’s death) and the fake commercials for Subway (pronounced “S’bwayyy”) and other brands make me laugh-cry. The p’dcast starts out deranged and only gets weirder from there. There’s a specific Venn diagram of people this might appeal to, but I’m hoping you’re out there reading this.Photo by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonSpeaking ofSweaty meats! For a special occasion, we surprised someone with a box of pork chops from Heritage Foods, which is on Bon Appétit’s list of places to buy meat online. Now, with the Big Meat shortage and all that, this might be a good time to consider FISH and LENTILS, but if it’s within your budget, Heritage works with farmers who take good care of their pigs, and we like that. (Also! Here’s our online fish faves.)And those those chops, make: Sweet-and-Saucy Pork ChopsPhoto by Frank Heuer/laifHere’s to JimmyThere was very sad news this week that Jimmy Glenn, owner of the perfect bar Jimmy’s Corner, died due to Covid-19. Glenn, who was once a boxing trainer for Muhammed Ali and other legendary fighters, covered the bar’s walls and tables with photos and memorabilia. I used to frequent that bar frequently when Condé Nast’s offices were in Times Square (it’s in our tourist guide to NYC too), and recently caught a glimpse of it during a scene in Raging Bull I never noticed before. I’ll be raising an ice cold bottle of Budweiser to Jimmy this weekend.So that’s a no on the vinegar?Unnecessary TikTok of the weekAccurate.Unnecessary food meme of the weekUnnecessary food feud of the weekThis weekend is the holiday where people thank their mom for all her lovin’ with a mess of toast crumbs on the comforter and spilled coffee on bedsheets she’ll have to wash now. I like to start every morning with coffee and a book in bed, but a full-on breakfast? Are you crazy? I’m not hungry yet! Who has the proper tray technology? I posed the question to the class:“Personally I’m not interested in breakfast in bed,” said Actual Mother Meryl Rothstein, “but tea in bed in silence is 👌.” “Breakfast in bed is a scam!” said man of many opinions Alex Delany. “There’s a reason restaurants don’t have beds next to the tables!” Makes ya think. The takes rolled in. “It’s because it’s so against the rules that it feels like a little treat,” said Jesse Sparks, whose family brings out an iconic wooden tray for these occasions. “I ate seaweed in my bed last night. It was not a good idea,” contributed Hilary Cadigan. Anna Stockwell has a tray “that’s great for eating in bed AND for using as a computer stand for working or watching movies on my laptop.” Joseph Hernandez popped in and dropped his own tweet on the subject matter: “I have never understood ‘breakfast in bed.’ I don't wear shoes inside, why would I eat and drink in bed?”But Carla Lalli Music has the last word: “The thing my husband does for me is just unparalleled. He leaves the zoji of tea + cup on the bathroom sink. I wake up, I go to bathroom, I do what I have to do, take my tea and cup, and go straight back to bed. Contactless delivery. Keep your scones to yourself.”P.S. I need your etiquette questions on the theme of family dinners for the Questionable Etiquette page. For example: Is it ever okay to use the same napkin five meals in a row? Send yours to staff.bonappetit@gmail.com, please and thanks!Explore Bon AppétitBeggs NewsletterRead MorecookingYou Might Have Everything in Your Pantry to Make Tahini Brownies This WeekendBy Alex BeggscultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggscultureSing Alongs and Tagalongs: What Goes Down on the Set of Gourmet MakesBy Alex Beggsculture17 New Hard Drinks the World Isn’t Ready ForBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-09", "author": ["Condé Nast", "Alex Beggs"]}