{"id": "321a1cc52cd54f627629728deadf6437", "url": "https://www.bonappetit.com/story/one-pot-spinach-artichoke-dip", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "This Spinach-Artichoke Dip Is All-Stovetop, No Sweat  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Spinach Artichoke Dip We Ever Had Came Out of a College Dorm RoomSome people switch majors five times before they find the dip they’re going to dedicate their life to.By Alex BeggsJanuary 28, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailThe scene was our shmoozy Hot 10 pre-party, a casual (but not) burger and snacky cocktail party we throw in the Bon Appétit Test Kitchen for the chefs on our Hot 10 list. Extremely niche. I think we wore name tags because everyone was too awkward to introduce themselves to near-strangers. One thing that brought everyone together this year, however, was Molly Baz’s artichoke dip, made at the very last minute when we realized we needed more food for these food people. The dip, made from Molly’s memory, was spinachy, cream cheesy, garlicky. Unstoppable. “What is this RECIPE?” we asked her, over and over. And it turned out to be something she started making in college, in a “scummy house on campus,” plucked from one of her seven roommate’s bro bible cookbooks. “It was called the Bachelor Pad cookbook or something,” she said.From the sound of that, you can tell Molly’s college experience was culture-rich, fun, and exploratory. Some people search their whole life for the right spinach artichoke dip, but Molly found it right then and there, at a kegger in upstate New York, made by a kid named Pfeif.It turns out Pfeif’s one and only cookbook was in fact called Two Dudes, One Pan, which, wow, uh, wow. Is the pan a metaphor? What else do they share? Toothbrushes?! But it doesn’t matter, because Molly memorized the recipe and then adapted it to her liking. “There’s a whole bachelor cookbook world out there,” she informed me. “Well, did it open your eyes to a new way of cooking?” I asked. “It opened my eyes to nothing. If I saw this cookbook now, I’d never open it. So I was lucky Pfeif made this dip that day.” As are we!These are the components, in Mollyspeak: sweat a bunch of garlic in a shitton of butter, then add quartered canned artichoke hearts, sizzle those in butter, throw in a lot of fresh baby spinach and wilt that, a couple sticks of cream cheese, melt that into the pot, then add a lot of parm, black pep, salt. She adds to that more greens, garlic, pep, and then thins it all out with water. One woman, one pot.Unlike other artichoke dips, cough, ahem, mine, this doesn’t go in the oven or require pimientos or nearly an entire tub of mayo. There’s room in the world for both! Two women, two dips! I’m not competing or anything. Molly’s is all stovetop, probably healthier until she decided to serve it in a bread bowl, and I respect that. I ate half of the batch, and I’m here to endorse it to the moon and back.Get the recipe:Stovetop Spinach-Artichoke DipServing this creamy, delicious dip in a bread bowl is not mandatory, but we highly recommended going for it.View RecipeExplore Bon AppétitDipSpinachArtichokeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-28", "author": ["Condé Nast", "Alex Beggs"]}