{"id": "321d06074df41cadd8678b438b41de8c", "url": "https://www.bonappetit.com/recipe/sesame-arctic-char-donabe", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Sesame Arctic Char Donabe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSesame Arctic Char DonabeBy Claire SaffitzFebruary 13, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintMichael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintThe base for this recipe is dashi, a type of stock used in Japanese cooking made from kombu and bonito flakes (you can find them online, at Asian markets, and in the Asian foods section of some grocery stores). Think of it as a faster, simpler, and cleaner-tasting fish stock.Ingredients4 servingsDashi and Noodles25x4\" pieces kombu6oz. dried soba noodles2tsp. toasted sesame oil1oz. bonito flakes (about 4 cups)Fish and Assembly1bunch scallions⅓cup mirin (sweet Japanese rice wine)2Tbsp. soy sauceKosher salt11-lb. skinless arctic char fillet2small turnips, trimmed, scrubbed, thinly sliced1small daikon, peeled, thinly sliced6oz. enoki mushrooms, trimmedToasted sesame seeds (for serving)Toasted sesame oil (for drizzling)PreparationDashi and NoodlesStep 1Combine kombu and 4½ cups cold water in a medium saucepan. Let sit until kombu is pliable, 25–30 minutes.Step 2Meanwhile, cook noodles according to package directions. Drain and rinse under cold water. Shake off excess water and toss noodles in a medium bowl with oil. Divide among serving bowls and set aside.Step 3Bring kombu mixture to a boil over medium heat, then immediately remove pan from heat. Lift out kombu from broth with tongs and discard. Add bonito flakes to broth and stir once to moisten. Bring mixture to a simmer over medium, then reduce heat and simmer very gently 5 minutes. Let sit off heat 15 minutes. Strain dashi through a fine-mesh sieve into a large heatproof measuring glass or a medium bowl; discard solids. (You should have about 4 cups.)Step 4Do Ahead: Dashi can be made 1 day ahead. Cover and chill.Fish and AssemblyStep 5While dashi is infusing, remove the dark green tops of the scallions from the white bulbs. Thinly slice tops and set aside for serving. Slice bulbs on a diagonal into ½\" pieces; set aside.Step 6Pour dashi into a large donabe or skillet and add mirin and soy sauce; season with salt. Place fish in the center of the skillet and arrange turnips, daikon, mushrooms, and reserved scallion bulbs around fish. Heat over low until liquid is steaming but not bubbling (simmering will make the liquid cloudy; reduce the heat if needed). Cook until fish looks opaque all across the surface, 10–15 minutes. Remove donabe from heat and let rest 5 minutes.Step 7To serve, sprinkle sesame seeds and reserved scallion tops over fish and vegetables and drizzle with more oil. Break fish into smaller pieces and divide among reserved noodle bowls. Ladle vegetables and dashi over.How would you rate Sesame Arctic Char Donabe?Leave a ReviewTell us what you thinkExplore Bon AppétitSoupSoups and StewsJapaneseEast AsianAsianSoba NoodleNoodlePasta & NoodlesKombuSeaweedOther IngredientsArctic CharFishSeafoodOne-Pot MealsMainDairy-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}