{"id": "3231714bd17ccda01263c7890f320ddb", "url": "https://www.bonappetit.com/story/molino-el-pujol-tortilleria-mexico-city", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Enrique Olvera’s New Tortilleria, Molino el Pujol, Is Doing It Old School | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIn a Land of Tortilla Factories, Enrique Olvera’s New Tortilleria Is Doing It Old SchoolAt Molino el Pujol, the freshly made tortillas are out of this world. But they’re also carrying on an important Mexican tradition.By Hilary CadiganJune 20, 2018FacebookTwitterEmailCourtesy of Grupo OlveraFacebookTwitterEmailFrom the outside, Molino el Pujol looks like something out of a Wes Anderson movie: a tiny white building, its name neatly hand-painted in black beneath a single Edison bulb, fronted by a large three-pronged cactus. Here in the heart of Mexico City’s trendy, tree-lined Condesa neighborhood, locals in pastel button-downs sit at sidewalk tables eating fluffy tamales and elote dressed in a creamy, earthy sauce made from chicatana ants, a Oaxacan delicacy.Molino el Pujol, which opened in April, is the latest brainchild of Mexico’s most famous chef, Enrique Olvera, known for his fine dining restaurants Pujol in Mexico City and Cosme and Atla in New York. But despite its sleek design and international pedigree, Molino el Pujol is one of the most traditional expressions of Mexican food there is: a humble tortilleria.Inside, customers line up at the counter to place their orders. Staffers in crisp white uniforms and white pointed chef’s caps dart to and fro. The walls are lined with handmade white tiles meant to resemble corn kernels and a black letter board lists the shop’s offerings: taco, tamal, elote, frijoles de olla, salsa miltomate. Nearly everything contains corn, drinks included; there’s atole, a traditional corn-based beverage served hot and creamy, and agua de maiz, which translates to “corn water” and tastes like the milk at the bottom of your cornflakes bowl (in a good way). Even the beer they stock is made with corn.The tacos are simple: sliced avocado on a blue corn tortilla pressed with hoja santa, a large herby leaf considered sacred in Mesoamerican mythology. Plain tortillas wrapped in newspaper are sold by the kilo for customers to take home. Molino el Pujol also supplies all the masa for its namesake restaurant, Pujol (molino means mill in Spanish). “We called it Molino el Pujol so that people can understand they’re at the same level,” Olvera says. “The fact that one is a fine dining restaurant and one is a tortilleria shouldn’t matter that much.”By instilling such a high level of care into something as simple as a tortilleria, Olvera hopes to honor his community and highlight the backbone of Mexican cuisine. He’s also addressing one of Mexico City’s more contemporary problems: Traditional tortillerias are disappearing.Courtesy of Grupo OlveraThe problem traces back to the late 1990s, when the Mexican government cut longtime subsidies and price controls on tortillas. Affordability became an issue for both producers and consumers, and many independently-owned tortillerias were forced to close. Today, large-scale industrial farming has become the norm, along with maseca, a powdered corn flour mix that provides a quicker, easier, but nutritionally-deficient alternative to the locally-milled masas of the past. As a result, once-strong connections between farmers, markets, and consumers are dissolving. “Most people, when they buy corn, they don’t know where it came from,” Olvera explains, “and it’s probably some industrialized farm far away.”Olvera is determined to help staunch the bleed. For Molino el Pujol, he’s partnered with Amado Ramírez, an agricultural engineer in Oaxaca dedicated to improving the lives and livelihoods of small-scale Mexican corn farmers. “We buy the surplus from the communities because we don’t want to deprive them of their own corn,” Olvera explains. “We buy whatever they want to sell.”Courtesy of Grupo OlveraThe temperature inside Molino el Pujol’s tiny open kitchen has reached sweltering levels. It’s the hottest day in Mexico City since 1919, and a confluence of electric machines compounds the heat. But the staffers are unperturbed. They’re elbow-deep in an ancient process called nixtamalization, which involves boiling corn kernels with water and calcium in a giant metal pot, then letting them steep for up to ten hours. The process not only softens the corn, making it easier to mill, but unlocks niacin and other key nutrients inside. Though many tortillerias have begun skipping this step in the name of thrift and expediency, it’s crucial to the health of those eating tortillas as a dietary staple, as most Mexicans still do.I watch as the nixtamalized corn is sent through a large mill that grinds it into thick masa dough. A few feet away, an electric tortilla maker presses and shapes the dough into flat circles, bakes them hot and bubbly as they ride through its belly on a wire mesh conveyor belt, and spits out fresh tortillas in a neat stack. Two or three different varieties of corn are shucked, nixtamalized, milled, and baked into tortillas every day. The entire process happens right here, in a space smaller than your average studio apartment.“We’re not creating anything new,” says Olvera. “We’re just working the exact same way that a normal tortilleria would work.” Yet it’s easy to taste the difference between Molino el Pujol’s tortillas and those you’ll find on grocery store shelves. There’s an unmistakable creaminess despite the fact that they contain nothing but corn, calcium, and water. One of my dining companions asks with sincerity if there’s lard in the dough and gets a laugh from the kitchen staff.Courtesy of Grupo OlveraThe desire to refocus on tortillas’ importance is already spreading far beyond Mexico. Jorge Gaviria, a Miami-born chef and entrepreneur who once worked under Dan Barber at Blue Hill at Stone Barns, was recently described on NPR as “the Johnny Appleseed of Mexican corn.” Gaviria has been traveling the country peddling high-quality heirloom varieties through his company Masienda since 2014. Today, he counts more than a hundred chefs—and Whole Foods—as clients and fans, including Olvera, Alexis Samayoa, Gabriela Cámara, and Sean Brock.“We are finding the solutions to sustainability and food identity in ancient cultures,” says Olvera. “It’s out of trying to contextualize our work that we’re finding this inspiration.”Olvera’s next project, a yet-to-be-named restaurant in Los Angeles, will mill its own masa onsite, and eventually supply tortillas to his New York City restaurants in the same way Molino el Pujol supplies Pujol in Mexico City. Small-scale sourcing, he believes, is becoming the new normal for chefs and consumers with conscience. And the key to moving forward is looking back.“We’re realizing that some of the questions have already been answered,” he says. “We just forgot about them.”Sounds like you need to book a flight and eat your way through Mexico City alreadyExplore Bon AppétitMexico CityTortillasMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Hilary Cadigan"]}