{"id": "323ac7ac1825468601096aaa0680e242", "url": "https://www.bonappetit.com/story/the-luxury-resort-that-has-it-all-included", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Come for the Serenity, Stay for the Food: the Majestic Resort That Has It All Included | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredCome for the Serenity, Stay for the Food: the Luxury Resort That Has It All IncludedParadise has been found: It’s all-inclusive, it’s adults only, and it features a roster of restaurants so remarkable, you might never leave.By Excellence ResortsJanuary 25, 2019FacebookTwitterEmailFacebookTwitterEmailImagine for a moment that you’ve just set foot on a pristine vacation property. The sun is warm as you step outside to find a cerulean pool surrounded by lounge chairs and wide-brim straw umbrellas. Hammocks sway in rhythm with the palm trees. Cabana beds line the shore of powdery white sand where guests are sipping cocktails and sharing fresh tapas.You pinch yourself. Is this paradise? You could call it that. Excellence Playa Mujeres, situated just 25 minutes north of Cancun, is an all-inclusive, adults-only luxury resort. It features seven swimming pools and a variety of spacious rooms and suites, including Swim-Up Suites, which boast a private terrace and direct access to the pool, or a Two-Story Rooftop Terrace Suite, which has its own plunge pool and breathtaking views over the resort. The main stage theater presents nightly entertainment, and sea kayaks, paddle boards, and snorkeling gear are sure to keep guests busy by day.And then there’s the food. There are 10 gourmet restaurants, a snack grill just steps from the ocean, and 11 premium-stocked bars with pool- and beach-side locations. No matter your culinary preference, there are premium options for everyone. From inventive Indian food at Basmati to fresh sashimi at Spice, decadent French cuisine at Chez Isabelle to modern Mexican at Agave, the dining options at Excellence Playa Mujeres offer international flavors by innovative chefs in a space that is, simply put, pristine. Oh, and 24-hour room service is included; you could tour the globe without leaving the property––or your suite.At Agave, take advantage of your location and relish the authentic Mexican dishes like Alambre, made of pork leg strips prepared with onions, poblano chili pepper, bacon, light beer, lemon juice, and Oaxaca cheese. Though Tex-Mex favorites like burritos and fajitas are just as memorable. Dine under the moonlight in an hacienda-style courtyard if you choose, where the sound of tableside mariachis will carry down along the shore.There are multiple restaurants at which to dine al fresco, including Las Olas, where you can grab an easy bite by the beach, or The Grill, crafters of fine American cuisine. For a casual à la carte lunch, enjoy a freshly prepared salad, like the seared tuna salad tossed with arugula, green tomatoes, and coriander. For something more decadent (because who said lunch couldn’t be as opulent as dinner?), try a burger like the Oscar, a beef and crab burger with asparagus au gratin on buttered French-toasted brioche. Come dinner, enjoy these and more with a menu full of fresh fish, hearty steak, and unique pasta favorites like mushroom agnolotti in ham broth.If your heart sings for seafood––you’ve come to the right place––don’t miss a meal at The Lobster House, situated in an open-air thatch-roof palapa that bridges the main pool. Unlike most all-inclusive resorts, Excellence Playa Mujeres offers lobster within its included benefits. Whether you prefer the lobster and jicama salad with orange vinaigrette and garden herbs, lobster risotto marinated with white wine and Parmesan cheese, or a traditional grilled or steamed lobster with your selection of sauce, this is an optimal destination for fresh fish and your favorite crustaceans.Excellence Playa Mujeres has a world-class team of chefs with experience throughout the Caribbean, but they also know their way around all types of cuisines, as evidenced by the global fare that delights guests throughout their stay.At Toscana, be transported to Tuscany with dishes like tagliatelle with tomato, broccoli, capers, olives, lemon, and basil; saltimbocca; or salmon with grappa sauce and truffle oil, all made with fresh ingredients and artfully prepared to five-star standards. Try Barcelona for Spanish and Mediterranean fare featuring everything from gazpacho to paella, thoughtfully crafted tapas to indulgent lobster cannelloni. Or you might find yourself wandering Le Marais in Paris when you visit Chez Isabelle. From the escargot to the grilled beef medallions served with red wine, black pepper, and Bearnaise, this French bistro is proud to live up to its culinary heritage. The live music performed nightly further enhances the Parisian sensibility, as well as the romance.Crossing continents, Spice elevates Asian flavors from Japan, China, Vietnam, and Thailand with exotic favorites made fresh, like Thai green curry or nigiri. The elegant atmosphere is perfect for date night before or after a show at The Main Stage Theater. Coming in with a group of friends? Try the full Teppanyaki menu. Over at Basmati, it won’t be difficult to shift your focus to the delights of north-west Indian flavors when you smell the fragrant aroma of spices from the tandoor oven that fills the room. Here, chefs serve artful iterations of paneer, daal, and vindaloo dishes with a variety of rice and naan, too.For something a little smaller––maybe a glass of wine and tapas before dinner––stop into Flavor Market. The in-house sommelier can help create a memorable pairing that might have you stopping back in at the end of the night. And on the days you can’t stand to miss the big game, because vacation is the prime place to watch a championship series, head to Sports Bar to enjoy elevated pub favorites while you follow along on the big screen.No matter what flavors your taste buds prefer, which kind of cocktails you like best, or what mood you’re in, there is an option for every kind of food lover at Excellence Playa Mujeres. And the best part—it’s all included. From the moment you arrive, your most difficult decision will be whether to dine at the beach or the pool. But let’s be honest––you can do it all.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-25", "author": ["Condé Nast", "Excellence Resorts"]}