{"id": "323c127afaee476bd420e2e6a8205707", "url": "https://www.bonappetit.com/story/emerald-city-bagels-atlanta", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Emerald City Bagels Doesn’t Need New York Water to Make a Really Freaking Good Bagel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAtlanta Doesn’t Need New York Water to Make a Really Freaking Good BagelThe mother-daughter duo behind Emerald City Bagels is doing just fine, thank you very much.By Elyse InamineJanuary 21, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailYou can’t find a decent bagel outside of New York City, they said.It’s in the water, they said.Well, guess what. Times have changed. You can actually find great bagels outside of the Big Apple. And that’s because chefs and self-taught bagel obsessives wanted better options in their hometowns and, after intense R&D, they’ve created just that.Case in point: Deanna and Jackie Halcrow of Emerald City Bagels, a new bagel and appetizing shop in Atlanta. After moving around the country, the mother-daughter team landed in Georgia a few years ago. Neither could shake their obsession with the bagels they grew up loving in New York, so they started making their own.Now they’re turning biscuit-loving Atlanta into a bagel destination, and showing the rest of the country that bagels aren’t just a New York thing anymore. Here the Halcrows explain how they got into the bagel business—and why they think more shops are popping up beyond the Big Apple.The bagel dream team at Emerald City Bagels: Jackie (left) and Deanna Halcrow\nPhoto by Emma FishmanWe’re seeing bagels everywhere. Why do you think they’re having a such a moment right now?Jackie: “I didn’t realize it’s become a trend! My mom Deanna started making bagels at home—out of necessity. We couldn’t find bagel shops in Atlanta like we had living in New York. But personally, I think it’s catching on because people are returning to naturally handcrafted food items, like doughnuts. They like to know where their food is coming from.”So how did Emerald City Bagels start?Deanna: “I made them at home—it took 12 hours for Jackie and me to make a hundred!—and started offering them to my neighbors. I got a lot of feedback, and I realized that bagels were something people [who moved here] missed. That convinced us that something like this was needed, so we started wholesale baking.Did the water question come up?JH: “This is a passionate subject for us! We get told you can’t make a good bagel without water shipped from New York. First, that’s absurd, but it’s also insulting to us and our bagels that we can’t do what we do well without this one detail. If you’re passionate, you’ll make it really well no matter where your water is from.”How do you make your bagels?JH: “We get hard wheat from Michigan, which is milled in Massachusetts, then mixed it with sugar, salt, yeast, malt syrup, starter, and Atlanta tap water. They’re rolled then sit overnight, before they’re boiled in malted water and baked.”I read that your favorite bagels are Absolute Bagels on Manhattan’s Upper West Side. What makes a great bagel in your opinion?JH: “It should be dense and chewy with a crusty exterior.”DH: “Not too big—about four ounces. My brother still lives in New York and he sent me an article about how big bagels are getting. Six ounces!”How’d you end up opening a shop?JH: “That was the dream. We envisioned the bagel shop of my childhood, with people in t-shirts and more of a deli atmosphere. The idea adapted over the countless hours we spent standing at our table rolling out bagels. It’s taken three years for us to design the shop. It’s weird to put it this way, but we wanted to be Russ & Daughters when we ‘grew up.’”What’s the response been like?DH: “Just the other day, a young guy told us he was so happy to find a bagel shop because he’s from New York. We get that a lot.”JH: “Sometimes we get customers who question your New York–ness or want to prove their own. But to have people appreciate your bagels is the best compliment.”Explore Bon AppétitAtlantaRestaurants + TravelRead MorerestaurantsTechnicolor Croissants and More Glimpses Into the Future of PastriesBy Leah MenniescookingMy Biggest Accomplishment of 2018 Was Making My Own GravlaxBy Elaheh NozarirestaurantsThe Best Bagel We Ate in 2017By Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Elyse Inamine"]}