{"id": "326b851942915b2217fa7b2b652012f1", "url": "https://www.bonappetit.com/story/crispy-tofu-recipe", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "A Saucy, Crispy Tofu Recipe for People Who THINK They Hate the Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Saucy, Crispy Tofu Recipe for People Who THINK They Hate the StuffThis crispy tofu recipe delivers takeout-joint satisfaction.By Chris MoroccoFebruary 7, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailI’ll be honest. There was a time, long before I developed this crispy tofu recipe, I didn’t really understand tofu, or soybeans in general. My sister brought some tempeh home from a particularly crunchy camp in Vermont one summer and my dad hid it in the back of the cold cut drawer until he could surreptitiously throw it away. I thought my early attempts at cooking tofu went well, but, in hindsight, I realize that's because I was cooking for hungry, vegetarian college students. For a while I abandoned all tofu except for one kind: The glazed, fried version was always an exception. Crispy, chewy, and slightly custard-y inside, it's delicious enough to make anyone forget that they don't like tofu.Making this kind of tofu doesn’t take a deep-fryer or require much technique. Pressing the tofu gently between kitchen towels removes some of the excess liquid, and a shallow fry in neutral oil takes it all the way to crispy edged gold. Maple syrup makes a star appearance in a glossy soy glaze that provides takeout-joint craveability without a grease hangover.You want to start with a 12-oz. block of firm tofu and drain it very well. Firmly press a dry towel into it (but not so hard that it cracks) and cut it into blocks. In a small bowl, combine your ginger, soy sauce or tamari, maple syrup, rice vinegar, and mild chile flakes. Set that glaze aside.All it takes is ½ a cup of neutral oil like grapeseed or vegetable in a medium non-stick skillet to get the crispy skin you want here. Heat the oil until it's rippling across the surface. Carefully add the tofu, one piece at a time and watching out for spattering hot oil. Cook it until it's very crispy and brown underneath, three or four minutes. Carefully turn and cook on the second side.Then, here's the fun part: Holding back the tofu with a spatula or slotted spoon, pour out all the oil into a heatproof bowl, leaving the tofu in the skillet. Pour in the glaze and reduce the heat to medium. Cook until the glaze has started to thicken, then begin to baste the tofu with it with a spoon, reducing the glaze until it clings to the spoon, about four minutes.You'll want to eat this with some cooked rice, maybe some kimchi or shaved crunchy veg like daikon or carrots. Sliced scallions for sure. Crispy, glaze-y, bright, and crunchy. Not liking it just isn’t an option.Get your glaze on:Crispy Tofu With Maple-Soy GlazeWhenever you’re cooking tofu, here’s one of our no-fail techniques: Draining the tofu, then squeezing out as much water as possible (without smashing it), is the key to the crispiest cubes.View RecipeExplore Bon AppétitHealthyishTofuVegetarianMaple SyrupRead Morerecipes51 Tofu Recipes for Stir-Fries, Stews, Dips, and MoreGallery51 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Chris Morocco"]}