{"id": "326c1422a4f71d4be28676e8d611285c", "url": "https://www.bonappetit.com/story/cleaning-with-vinegar-in-kitchen", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "18 Places You Should Be Cleaning with Vinegar in Your Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture18 Places You Should Be Cleaning with Vinegar in Your KitchenDisinfect cutting boards, make stainless steel pans sparkle again, and more.By Alyse WhitneyJanuary 18, 2018FacebookTwitterEmailHeinzFacebookTwitterEmailThe best all-purpose cleaner is probably in your cupboard right now. News flash: You should be cleaning everything in your kitchen with white vinegar. When diluted with water, it is a \"miracle cleaner\" that our test kitchen uses for almost everything. Vinegar is made of acetic acid, which is a natural disinfectant for killing some common germs like salmonella and E. coli, but is best when used in tandem with antibacterial soap and water to guarantee all germs are killed.A huge gallon jug of distilled white vinegar from our favorite brand, Heinz, will run you $13 on Amazon, and the vinegar smell will evaporate more quickly than you think. But if you're worried about it, you can always add some citrus peels or essential oils. Most applications call for a 1:1 ratio of water to vinegar so the strength of the acid isn't too intense or damaging, and it can be stored in a jar or a spray bottle for easy access. Here's how we use white vinegar to clean 18 things in our kitchens.1. Kitchen SinkUse a 1:1 ratio of diluted vinegar and water and store it in a spray bottle. Then you can spritz and disinfect your kitchen sink, counters, or any other spots that you'd normally use bleach but want to be food-safe. To counteract the vinegar smell, you can use soapy water to rinse the sink afterward.2. FloorsDon't use expensive cleaners—mix 1:1 vinegar to water and mop the floor with it! This will protect your floor from too strong a concentration of acidic vinegar, and will help lift off any grease or dirt.3. Greasy StovetopVinegar's acidity helps cut through grease easily. Spray some vinegar and water mix onto a splattered stovetop, let it sit for 10 minutes, and then scrub down with soapy water. It should wipe right off. If not, leave it to sit a bit longer.4. Sheet PansClean your dirty sheet pans by mixing ½ cup baking soda and ½ cup white vinegar with hot water in the sink. It will bubble up like a school science project, but that reaction is what helps loosen the residue. Make sure your sink is plugged so they stay submerged, and let it soak for 30 minutes to an hour before scrubbing away with a scouring pad, the scrubby side of your sponge, or steel wool.5. Stainless Steel Pots and PansIf you have a particularly gnarly-looking stainless steel pan that won't get clean, boil together water and vinegar for a few minutes. It will dissolve grease and get rid of any weird stains or water spots. If it's really dirty, you can go longer. The more vinegar you use here, the more quickly the cleaning happens. Then dump the vinegar mixture and wash as normal with soap and water!6. Enamel Pots and PansThe same works for enamel or enamed cast iron (like your Dutch oven): boil water and vinegar together to help dissolve stains, and scrub off any remaining spots with soap and water.7. MicrowaveWe tried using a vinegar and water mixture in Angry Mama, a funny-looking microwave cleaner, but you could get the same results by combining equal parts water and vinegar in a large microwave-safe bowl. Microwave it for about five minutes to loosen any gunk with the steam, then wipe clean. Make sure to put a chopstick or toothpick inside the bowl—if not, the water can superheat and make the bowl explode! (Something proven by the Mythbusters.)8. Coffee Makers and Tea KettlesWhether you use an electric tea kettle, standard coffee maker, or Keurig, they can all be cleaned in the same way to get rid of mineral build-up. (This process is also known as descaling.) Pour a 1:1 ratio of water to vinegar into the water reservoir or directly into the kettle. Run it through the coffee maker or simply boil the water in the kettle, then rinse thoroughly with water. For automatic coffee makers (including those that use pods), you may have to run plain water through a few times to get the smell and taste of vinegar out. You can also use vinegar and water to clean stained tea or coffee cups.9. Blender or Food ProcessorStuck on food, stains, or weird smells? Again, 1:1 water to vinegar and blitz it in the blender or food processor, then wash as normal.10. Instant Pot (or Pressure Cooker) Sealing RingIf your Instant Pot sealing ring smells or is stained, soak it in with a mixture of vinegar and water in your sink, a sheet pan, or any other vessel in your kitchen. Let it soak for as long as you want (an hour is great if you can spare the time), wash it with dish soap, and leave it out to dry and air out. You can also fill the whole pot with white vinegar, water, and lemon rind, then run the steam cycle for a few minutes.11. Cloudy Wine GlassesIf minerals in hard water are causing your wine or drinking glasses to get cloudy, soak them in the sink with some non-diluted vinegar for a few minutes and wash as normal. The vinegar should dissolve the minerals.12. Plastic Cutting BoardAfter cutting raw meat, it's good to not only wash your cutting board, but also disinfect it with a mixture of water and vinegar. Wipe it down thoroughly with a mixture of vinegar and water—this is a great time to store the 1:1 mixture in a spray bottle for easy cleaning. It's always best to use plastic cutting boards with meat, but if you use wood, make sure to follow these wooden cutting board cleaning rules.This spice grinder could use a vinegar cleansing.\nClay Williams13. Spice GrinderTo get the cumin scent out of your spice grinder, try wiping it with white vinegar and then drying thoroughly. It should do the trick immediately, and works particularly well with spices that stain, like turmeric. You can also clean jars that you store spices in with a vinegar and water mixture.14. DishwasherBecky Rapinchuk (founder of blog Clean Mama) told us to pour a cup of vinegar on the floor of the dishwasher (inside, beneath where the racks slide in—not on the door), and run one cycle empty, without dishes. The vinegar works to loosen up any mineral deposits that may have built up.15. Refrigerator and FreezerUse that trusty 1:1 ratio of water to vinegar to scrub the inside of your fridge and freezer, including those often neglected crisper drawers!Clean every nook and cranny of your fridge with vinegar.\nAlex Lau16. Fridge Water DispenserAnother tip from Rapinchuk: Grab a small brush (like a straw cleaner), dip it in vinegar, and clean the inside and outside of the water spigot. You can also use a clean, new toothbrush to scrub, removing any mold, yeast, calcification, and mineral deposits. After you clean, run the dispenser once to make sure any vinegar is flushed out.17. Knife BlockClean Mama warns that the inside of your knife block could be hiding some gunk. To clean, put some white vinegar on a paper towel, wrap it around a table knife, and slide it into each knife slot to clean them thoroughly.18. Garbage CanNow that you've cleaned your entire kitchen with vinegar, you're probably ready to take out the trash. Before you add a new bag, cleaning expert Toni Hammersley (of blog A Bowl Full of Lemons)  suggests spritzing the can and inside the lid with that 1:1 ratio of vinegar to water and wipe it out. Repeat every time you take out the trash, and your garbage will never stink again. Now, go pour yourself a glass of wine. They're...in the same family of liquids.Here's a DIY vinegar citrus cleaner to try:Explore Bon AppétitCleaningVinegarRead MorecultureAre You Cleaning Your Kitchen Sink Often Enough?By Alyse WhitneyshoppingHow to Clean Baking Sheets So They Shine Like the Top of the Chrysler BuildingBy Alyse Whitney and Tiffany HopkinscultureHow to Clean the 6 Most Neglected Places in Your KitchenBy Alyse WhitneycultureHow to Clean Your Smelly Instant Pot Sealing RingBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Alyse Whitney", "Tiffany Hopkins"]}