{"id": "327b83f9101e1302d4ab755675083ef5", "url": "https://www.bonappetit.com/story/full-fat-dairy", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Whole Fat Yogurt and Other Dairy Is Healthy, So Why Are We Still Eating Low-Fat? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFor the Love of All That is Dairy, Why Are We Still Eating Low-Fat?Science has come around on full-fat dairy. Why haven't we listened?By Mari UyeharaAugust 24, 2018FacebookTwitterEmailFacebookTwitterEmailA few months ago, when I peeked into my parents’ refrigerator, I was a bit surprised to find what I thought was a health-food anachronism: low-fat yogurt. There was not one but two different kinds, as my mother prefers Greek and my father plain. I thought everyone had heard that the whole low-fat thing was bunk and whole fat was the way to go. But the ups and downs of health news can be confusing; my busy parents, who both have graduate degrees, read widely, and cook copiously, didn’t know. And they’re not alone.Later that week, I visited Whole Foods, looking to swap out their low-fat tubs for the good stuff, but when I stooped down to scan the bottom row of the refrigerated case, I found slim pickings. While there were all sorts of brands and flavors of low-fat yogurt, there were only a few measly tubs of the whole fat. At coffeeshops, too, I noticed plenty of patrons ordering their cappuccinos and lattes with low-fat. As it turns out, the low-fat mantra was no anachronism, even though the science on dairy has pretty much turned it on its head.Just recently, a study in the American Journal of Clinical Nutrition, found that there is no link between higher fat dairy intake and mortality—and, in fact, higher whole-fat dairy intake may guard against strokes. But beyond that, other studies have established that whole-fat dairy is actually better for you than its skimpier brethren. A study found that it lowered the risk of being overweight or obese by 8 percent. That may be because the fat keeps you satisfied for longer or it may be that the milk fats contain some magical substances that help us burn calories more quickly. Another study of 3,333 (!) adults for Circulation found that the full-fat dairy eaters had a 46 percent lower risk of getting diabetes. And on top of that, one of the strongest links between diet and acne is skim milk, which may increase blood sugar levels and therefore trigger hormones, according to the American Academy of Dermatology. In short, low-fat dairy may increase the risk of diabetes, weight gain, strokes, and acne.So, what led us to this state of confusion?Dr. Marcia Otto, assistant professor at The University of Texas Health Science Center at Houston and one of the researchers on the American Journal of Clinical Nutrition study, told me that a few studies in the 1970s found a positive correlation between intake of saturated fat (the type of fat in dairy products) and heart disease: a hypothesis. But later, better designed studies found that saturated fat increased both good and bad cholesterol. Because it raises bad cholesterol, the perception set in that it was bad for cholesterol. But what matters with cholesterol is the ratio, not the individual cholesterol numbers, and when both were raised, the net effect is zero. In other words, when it comes to fatty dairy and your HDL/LDL levels, it’s all good.“Dairy has important benefits to health,” says Dr. Otto. “Nutrients like calcium, potassium, and vitamins A, B-12, and D.” And fat helps you better absorb those nutrients.The other thing about whole-fat dairy is that, well, it’s just more delicious. Only luscious whole milk—you know, the small-farm, pasture-grazed sort—can give you those bright, grassy notes that change along with the seasonal feed; they just don’t come through with skim, whether it’s from a factory farm or a farm around the way. Nothing beats the full-bodied richness of whole milk in an espresso-based drink, where it tempers the coffee’s bitter notes. Yogurt, too, is its best self in full-fat, full-flavor form: Its tang is rounded out and the texture more plush, whether you’re mixing it in a chia pudding for breakfast, folding it into a tangy chicken salad, or adding a dollop to roasted meats.I remember way back in the ’80s when epidemiologists called the French diet, rich in saturated fats and buttery cheeses, “the French paradox” for the perplexingly low rates of associated heart disease. The French had it right. Taking your cafe au lait with full-fat milk or packing an extra creamy cheese on a picnic is a-okay if you’re already eating a diet full of fish, vegetables, and nutrient-dense grains. More and more, our nutrition science is just catching up with the wisdom of some old foodways. Now, if only we could catch up on that  35-hour work week too.Cook with whole-fat yogurt:Hot-Smoked Salmon with Salted Yogurt and FennelThis is entrée you want to serve to guests when you have no time to cook and have no desire to turn on the oven.View RecipeExplore Bon AppétitDairyYogurtGreek YogurtHealthyishTrendsRead MoreLifestyleHow Mayonnaise Got Its Groove BackBy Flora TsapovskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-24", "author": ["Condé Nast", "Mari Uyehara"]}