{"id": "328fbff694561ed0b5a4a0f3d1b4f248", "url": "https://www.bonappetit.com/recipe/grapefruit-orange-crostatas", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Grapefruit-Orange Crostatas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueGrapefruit-Orange CrostatasBy Che Fico, San Francisco, CAAugust 14, 20183.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintWhile these mixed citrus tarts bake, the semolina flour in the frangipane absorbs the juices and turns into a slightly puffed, airy layer surrounded by flaky pastry. This recipe is from Che Fico in San Francisco, CA, our No. 7 Best New Restaurant 2018.IngredientsMakes 4Dough¾cup (1½ sticks) unsalted butter, cut into pieces, frozen 10 minutes1¾cups all-purpose flour2tsp. sugar1tsp. kosher salt¼tsp. distilled white vinegarFrangipane and Assembly½cup semolina flour1tsp. kosher salt7Tbsp. sugar, divided4½tsp. all-purpose flour, plus more for dusting1grapefruit1orange¾tsp. vanilla paste or extract4Tbsp. unsalted butter, room temperature, plus 2 Tbsp. melted1large egg1large egg yolkPreparationDoughStep 1Beat butter, flour, sugar, and salt in the bowl of a stand mixer fitted with the paddle attachment on low speed until butter is in flat pieces the size of a nickel or smaller (mixture should look slightly sandy). Combine vinegar and ¼ cup ice water in a small bowl and, with motor on low speed, stream into mixture. Beat, adding another 1–2 tsp. ice water if needed, until no dry spots remain. Continue to beat until dough begins to clump together, but stop before it starts to form a ball.Step 2Transfer dough to a surface; squeeze and flatten a couple times to bring together. Divide into 4 pieces. Flatten into ½\"-thick disks; wrap tightly in plastic. Chill at least 1 hour and up to 2 days.Frangipane and AssemblyStep 3Place a rack in middle of oven and preheat to 400°. Whisk semolina flour, salt, 5 Tbsp. sugar, and 1 Tbsp. plus 1½ tsp. all-purpose flour in a medium bowl. Finely grate zest from grapefruit and orange into another medium bowl; set fruit aside. Add vanilla paste and 4 Tbsp. room-temperature butter to bowl with zest and mix until smooth. Add egg and egg yolk and mix vigorously to combine. Add dry ingredients; mix just until incorporated.Step 4Cut remaining peel and pith away from reserved citrus; discard. Slice fruit into ½\"-thick rounds; wriggle out seeds.Step 5Working one at a time, roll out dough disks on a lightly floured surface to 8\" rounds. Place on a parchment-lined baking sheet and spread ¼ cup frangipane in the center of each, leaving a 1½\" border. Arrange citrus rounds over frangipane to cover, then fold edges of dough up and over fruit. Chill 30 minutes.Step 6Brush fruit and crust with melted butter and sprinkle with remaining 2 Tbsp. sugar (avoid getting it on the baking sheet). Bake crostatas, rotating once, until crusts are golden brown with a few darker spots, 40–45 minutes. Let cool at least 10 minutes before serving.How would you rate Grapefruit-Orange Crostatas?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleCitrus and perfect frangipane aside, I just love this dough recipe; I use it for every pie/tart/crostata. It's pretty much no-fail with cold ingredients and a gentle hand. (Have a stand mixer but prefer to mix with hands, comes out fire every time.)AnonymousBrooklyn, NY10/16/2019Explore Bon AppétitFruit DessertDessertGaletteItalianEuropeanGrapefruitCitrusFruitOrangeSemolina FlourFlourWinterBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Che Fico", "San Francisco"]}