{"id": "3290536d69f5b73dbdc70a642ee8589a", "url": "https://www.bonappetit.com/story/graza-olive-oil", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "If the Olive Oil Aisle Gives You Anxiety, Graza Is for You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIf the Olive Oil Aisle Gives You Anxiety, Graza Is for YouMeet your new main squeeze.By Ali FrancisFebruary 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There was a time in my life—a simpler time—when I bought bottles of olive oil much the same way I bought wine: big ’n’ cheap. I spent my weekends surfing and smoking spliffs. I zoned out in university lectures. My idea of a good breakfast was a few spoonfuls of peanut butter. Then I grew up, graduated, took a job as an agricultural reporter, and food went from a meaningless afterthought to, well, most of my thoughts.Still, the more I’ve learned about olive oil over the years, the less I seem to know. (Like life, I guess.) According to the 2011 book Extra Virginity by investigative reporter Tom Mueller, up to 80% of EVOOs in the U.S. market are probably fraudulent—a.k.a., cut with lower-grade oils like canola or soybean and then colored with industrial chlorophyll. Some articles warn against cooking with olive oil while others endorse it. And, if I am being totally honest, I cannot tell from the outside why some bottles cost $32 (too much?) and others cost $7 (too little?). Despite my best efforts, buying olive oil is still an incredibly confusing undertaking.Luckily, Graza, a new, direct-to-consumer olive oil company, has come to my rescue. They sell just two products—Drizzle ($20 for 500 ml), which is a finishing oil that’s intended to be used after cooking to enhance flavor and texture, and Sizzle ($15 for 750 ml), which is for high-heat cooking and everyday use—at prices that won’t break the bank. (They’re also available as a package deal.) As their extremely chic website suggests, you can think of Drizzle for dressings and Sizzle for schnitzel. Cute!Graza Olive Oil$20 at Graza (Drizzle)$15 at Graza (Sizzle)$35 at Graza (Combo Pack)Both are extra-virgin olive oils (EVOOs) and both are made from Picual olives sourced from a single farm in Jaen, Spain. The variety, which isn’t available at scale in the U.S., was chosen because “it has the highest smoke point” and “the longest shelf stability,” says cofounder and CEO Andrew Benin. And given that Graza is grown, manufactured, and bottled in the same region of Spain before being shipped to my door in the U.S., I can trust that no funny business is going down. What you’ll get with Graza is “real” olive oil with a transparent supply chain, pure and simple.Of course, none of this would matter if the olive oil weren’t delicious. Unlike so many bottles of mild EVOO I’ve lugged home from the supermarket, Graza is no wallflower. The olives used in Drizzle are harvested during the first week of October before they’re fully ripe, which produces a seriously punchy, grassy oil that’s vibrant green and, like the Midas of flavor, makes everything it touches infinitely more powerful. The Sizzle harvest happens a couple months later, in December and January, when the olives are plump with the good juice, which results in a robust but less bitter oil that “performs best in high levels of heat,” says Benin.Another perk: Graza comes in fun, beautifully branded squeeze bottles that are inspired by chefs, most of whom transfer their large-format olive oils into smaller, easier-to-use vessels. We recommend it for the home cook as well. It feels good to channel my anxiety into a fierce clench, and there’s no greasy cap to contend with every time I need to add another glug to my roasting vegetables.Speaking of, lately I’ve been drowning everything I eat in olive oil (while daydreaming I live on a farm in rural Spain). Drizzle (“Driz,” as I call her) is my go-to for marinating beans, dressing salads, and zig-zagging glossy spirals over my winter soups. “Siz” is the workhorse of my kitchen, starring in everything from slow roasted cherry tomatoes to lemony olive oil cake and the most luxe confit chicken with spongy potatoes.I may be Fully Adult now, but I’ve still been known to do extreme sports under the influence, and I don’t pretend to understand the intricacies of olive oil production. But what little wisdom has come with age did lead me to Graza.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Ali Francis"]}