{"id": "3295f8eba8220efe3d6d74797c984a55", "url": "https://www.bonappetit.com/story/trader-joes-reviews-february-2022", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "New Trader Joe's Products: The Mood Is Cheeseburger Burrito | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Mood at Trader Joe’s This Month Is Cheeseburger BurritoAlso new: cute little mousse cakes, springy pasta, and Incredisauce.By Alex BeggsFebruary 28, 2022FacebookTwitterEmailFacebookTwitterEmailHow I’m feeling about this month’s new Trader Joe’s products is: shrug. Shoulders to the ear lobes, sigh. There’s some new dried pasta, and it’s better than the old dried pasta. Some snacks are coated in chocolate simply because they can be. Incredisauce joins the overconfident condiment club—see last year’s Magnifisauce for reference. A bag of frozen beet and parsnip “fries”? Shrug-a-shrug-shrug. It’s a weird and dreary time of year. The time of year when a microwaved cheeseburger burrito comforts your deep winter malaise and sends you into a nap that carries you to spring. Hopefully. Now, let’s see what else is new this month.Wow, New PastaOrganic Fusilli Corti Bucati PastaTight and springy little Slinkies.Organic Pappardelle Pasta NestsLoose and silky flowing ribbons.Chocolate-Coated Things (Because They Can)Dark Chocolate Almond Butter Filled Pretzel NuggetsThe chocolate layer is so thick you barely get any pretzel crunch, let alone salt. I’m here for both of those! Well, not anymore.Peanut Butter Cocoa MarshmallowsWhy did I taste sesame? Something’s afoot. A dense marshmallow is a thing a marshmallow should never be. That, or a lawyer. Marshmallows should stick to what they know, though they stick to everything, so my argument is moot. This one just didn’t work out, okay?Bamba Puffed Peanut & Corn SnacksDelicate, airy corn Bamba dipped in thick dark chocolate. The corn dissolves and you’re left eating a slab of bitter dark chocolate. Didn’t like these, but my toddler nieces did. Leah’s review: “They’re yummy ’cause they have chocolate on the bottom.” Okay, kiddo.Dark Chocolate Strawberry BarThis is a beautiful thin bar of dark chocolate with strawberry speckles that I’d wear on a tube top for Mardi Gras. When you crack off a section, a strawberry syrup oozes out. It’s a sticky situation, but then again, so is getting out of a tube top, and that’s always worth it, isn’t it?A Single Frozen ItemRoot Vegetable FriesIf you’re craving french fries and buy these out of self-hatred or guilt, they’re never going to satisfy. They air-fry up nice but get soggy quickly, especially the watery beets. I liked them with the honey-mustard newcomer “Incredisauce,” while my partner ate one and refused another bite. Up to you!Condiments and SalsaIncredisauceI prefer this to the runny Magnifisauce, which is burger special sauce missing something, uh, special. Incredisauce is honey mustard, and it’s just great. Tune in next month for my review of Wonderfsauce, which is a tube of mayonnaise.Organic Date SyrupA molasses-deep syrup you can do whatever you usually do with sweet syrups, like add it to overnight oats or forget it in the back of the pantry. I’ll tell you what I do with it: I keep making smoothies with spinach but I’ll put in too much spinach—you know it’s too much if you taste it—so I squeeze in some date syrup to restore balance. Also good for: the glaze on these brussels!Guajillo SalsaGuajillo has a rich, smoky and near-chocolaty flavor—yum. This salsa was a bit one-note for me, though you should never trust anyone who declares a food “a bit one-note.” What I mean is, it’s good as a salsa on tacos or on a rice-and-beans bowl, but it’s not dynamic enough to star in the chips ’n’ salsa show.Those Artichokes in a PouchMarinated Artichokes on the GoI loved these. They make every salad feel like it came from a fast-casual salad chain backed by venture capital. The marinade is mild, which I like because that means it doesn’t clash with my ranch. But does anything?Cheese and Not-CheeseBoursin Vegan Cream CheeseYES. Vegan cream cheese, mostly coconut oil and other emulsifiers, can have a problem being spreadable and dippable. Here, it’s both. And best of all, the Boursin flavor comes through—garlic, chives, an allium bite. I ate the whole tub with Mary’s Gone Crackers, the superior cracker (not sold at Trader Joe’s), and considered buying a beret. Eating Boursin always makes me feel that way.Spicy Buffalo CheddarSpicy! This cheese was made for nachos. Buffalo is good branding, but I’m not sure what’s so Buffalo ’bout it, other than the red color and generic heat. Buffalo = Frank’s Red Hot to me; maybe chicken is involved. But whatever, that’s semantics! Enjoy the cheese. Chase it with some Pepto, show your body who’s boss.Neufchatel Soft-Ripened CheeseA Valentine’s Day–timed, heart-shaped creamy cheese with some farmhouse funk and lactic tang and in need of honey. Rind as chewy as jerky. Doubt this’ll be on shelves year-round. You didn’t miss much.Meaty ThingsCheeseburger BurritoBeefy, cheesy, a little dried out at the edges of the tortilla from the nuclear power of the microwave. But it’s still a cheeseburger burrito! Let it soothe you.Teriyaki Marinated Skirt SteakThis was like $21, which is $$$ at Trader Joe’s. The marinade was safe. A little sweet, mostly soy, and barely noticeable. A squeeze of lime helps. I doused my tacos in Sriracha. (A promotional side note: Sometimes when I want an easy sweet soy sauce glaze for grilled fish/meats, I make the one from Chris Morocco’s sushi rice and salmon recipe—it goes well on everything and comes together in seconds.) Next time I’ll make my own marinade.Seasonal Mousse Cakes!Raspberry Mousse CakesThese petits fours make me feel like a pretty, pretty princess, and I eat them in two scarfing bites. They’re so pink and cute. They’re reminiscent of my first favorite body wash, sun-ripened raspberry, a product I used to the point of revulsion—the scent of it would make me dry-heave today. But not these! They’re vanilla cake topped with fluffy mousse, contained by thin sturdy frosting. The loopy little green leaves are a reminder that before they were cooked into jam, enhanced with sugar, extracted into a flavor, and preserved with citric acid, some ingredients in this treat came from nature.Vegetal MomentsCold Pressed Cucumber Avocado SmoothieThick and viscous, like drinking gloopy green goddess dressing. Specks of hairy ginger swim between my teeth. Spinach flecks tickle the throat. Couldn’t finish.Ready VeggieA grab bag of snow peas, broccoli, dried-out carrot coins, and brussels sprout shreds ready for sautéing, although the brussels shavings will brown and burn before anything else is cooked. But you wanted variety! I loved this mix for changing up my dinner routine.Cauliflower of Many ColorsPrechopped and ready to roast, easy. Don’t let them linger in the fridge for too many days or the sulfuric aroma compounds will unleash the moment you open the bag. PHEW!Kohlrabi Vegetable PastaKohlrabi has a nice crisp texture, I don’t need it to be anything other than itself. Don’t make this into pasta—fry it up with rice, other veg for texture, or ground meat. Also a great source of vitamin C, in case you were looking for one. Try it in this recipe, in which you cook it with bacon and scallions.Winter Frost PineberriesThese are spooky Nightwalker strawberries that are supposed to taste like pineapple and blind naivete, maybe. They tasted mostly like strawberries and water with a subtle tropical note. I do love a status fruit though! Try it!Another Muffin MixBlueberry Muffin MixYou rehydrate a bag of blueberries to make these, which was like a little science experiment or the closest I’ll get to eating bunker food. I doctored the mix by adding toasted slivered almonds and sour cream, but they’re still not as good as these spelt blueberry muffins, my end-all, be-all blueberry muffin. The nutty whole wheat flour (and buttery crumble!) is such a great match with the sweet berries. Try those instead!Explore Bon AppétitTrader Joe'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-28", "author": ["Condé Nast", "Alex Beggs"]}