{"id": "32a4ef01c22c64e8d82207a017799b0f", "url": "https://www.bonappetit.com/story/fantasy-prime-day-shopping-cart", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "7 Things in My Fantasy Amazon Prime Day Shopping Cart  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Things in My Fantasy Prime Day Shopping Cart of Sweet Deal DreamsIt’s PRIME DAY, PEOPLE. Gird your loins! Alexa, increase my credit limit! Click click buy!By Alex BeggsJuly 17, 2018FacebookTwitterEmailBeautiful artwork by Annalee SoskinFacebookTwitterEmailIf you’ve spent any time online recently you might have heard Amazon Prime Day is TODAY. Before, we called it “Tuesday.” But not this year. This year we made cookies shaped like little brown boxes, and waited for Jeff Bezos to shimmy down the chimney with a brand new Instant Pot. Because it’s PRIME DAY, PEOPLE. Gird your loins! Alexa, increase my credit limit! Click click buy!HOWEVER. This is all slightly lost on me because, uhhhh, I don’t have an Amazon Prime account. While others seem to wear glowing halos of orange check marks above their bald spots, I live in the shadows. If the apocalypse strikes, everyone around me is going to shoot up to heaven in two days while I linger around the burnt up planet at least a week. And on Amazon Prime Day, I feel like I’m missing out on MANY THINGS.So in the consumerist spirit of Prime Day, I went on a fantasy shopping spree, filling my cart with deals deals deals (in this fantasy I am also rich). Follow along below! Maybe even click on some stuff! What’s the worst that could happen?* (*We will make money).CoravinWas: $285Now: $179OMG CORAVIN, I WANT ONE. A needle injects argan gas into the cork to keep the wine from oxidizing (going stale, essentially), so you can open a bottle of wine, have a single glass like your doctor recommended—and save the rest for later. Like two months later, even. Speaking of irrational patience, this would be a great present to buy now, and then come Christmas when it’s full price again, tell your brother to go in halfsies with you for a Coravin for mom, and then charge him $150 on Venmo even though you paid $180. Amazing. Brilliant. He owes you from that one thing anyway!A “Margaritaville” Brand “Frozen Concoction Maker”Was: $477Now: $324Remember the smash hit musical Escape to Margaritaville? I believe the New York Times said it was “pitched so low it will temporarily extinguish your I.Q.” And you know what else would help do that? A ton of freshly blended frozen concoctions. I love frozen concoctions! This gigantic, ugly, and expensive machine will produce 72 ounces of frozen concoction a cycle. That’s more prolific than any other blender on sale today, so therefore it is on my wish list. One reviewer notes: “it’s a little loud ~ so don’t take it to a funeral.” Which I’ll keep in mind, whether I buy it or not.Philips Pasta MakerWas: $260Now: $207I saw this on Queer Eye, even though it didn’t work and the guy had to make regular dried pasta instead, and yet I STILL WANT ONE. You make pasta dough, shove it in a machine, and then it poops noodles out (the front) in multiple shape options. Fresh robot pasta!!CORNHOLEWas: $100Now: $75You can argue with me on this and I will close my ears and stick my tongue out and disregard you like most fights on the internet—but cornhole is the greatest yard game. Bocce sucks! Badminton is for substitute gym teachers! Croquet is for British people! Cornhole is for the people. People drinking beer, on a lawn somewhere, with sun in their hair and ARMY-grade mosquito repellent on their shins. I might not have a yard or an Amazon Prime account, but IF I DID, you BET I’d take advantage of this sweet, sweet deal.P-Touch Label MakerWas: $57Now: $40P-Touch is a classic label maker. We use it every day in the BA Test Kitchen, so if that isn’t a seal—get it? eh?—of approval, I don’t know what is. How else will you know that’s brown sugar and not a quart of dirty playground sand? YOU NEVER KNOW. LABEL EVERYTHING. Except each other, that’s not called for. Ever.Zojirushi Rice CookerWas: $135Now: $95*Not to brag, but I’ve finally learned how to make perfect brown rice (the pasta method, listen to our rice podcast all about it here). However, I still grumble about it. Ugh, having to wait for water to boil, then wait another 40 minutes for the rice? Whyyyy? What I’d love to do is press a button and let a machine do all of the work for me while I shop for even more stuff online. The Zoji here also keeps the rice warm while I inevitably take too long making dinner. In the hypothetical world where I have a Prime account, I also have a huge kitchen with a walk-in pantry full of extra appliances, and this rice cooker would fit right in there, next to the Snoopy Sno-Cone Machine (not on sale today, SORRY.)Some deals are reappearing throughout the day. This was $95 yesterday but I have no idea what is happening.INFLATABLE HOT TUBWas: $415 (lol)Now: $330WOWWOWOW. Can you imagine living so large you splurge on an inflatable hot tub? I CAN. Even if it only reaches 105 degrees, which is 5 short my usual bath temp (I’ve measured.) All I want is the financial security in life to blend up a frozen concoction, play some cornhole on the lawn, label my own left arm, and take a dip in a lukewarm adult kiddie pool. This glowing, possibly planted Amazon review word-for-word aligns with what I’ve planned to publish on my gravestone: “I was skeptical about purchasing an inflatable hot tub, call me a hot tub snob if you will, but let me tell you, this is my little slice of heaven.”All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitAmazon Prime DayShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Alex Beggs"]}