{"id": "32a57670db37fcf0a4787410669e5a0d", "url": "https://www.bonappetit.com/story/la-kalbi-at-home", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Make L.A. Kalbi the Sweet-Salty Star of Your Next BBQ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake L.A. Kalbi the Sweet-Salty Star of Your Next BBQThis uniquely Korean American marinated-and-grilled short rib dish couldn’t be easier to make at home.By Irene YooAugust 27, 2021FacebookTwitterEmailPhotos by Isa Zapata , Food Styling Kat Boystova, Prop Styling Allie Wist FacebookTwitterEmailAt the height of summer, I’ll walk by my local park and spot multigenerational families gathered around the community grills having a celebration—maybe it’s someone’s birthday, or a graduation party—and get a twang of nostalgia for the picnics my own family used to attend when I was a kid growing up in Southern California. In the land of perpetual summer we’d have picnics year-round, whether it was a welcome respite from the weekly Korean Saturday school I used to attend, or with the Korean church community during an outdoor activities day. In between tugs-of-war and pickup soccer games, the parents would alternate preparing and grilling food for everyone. Roles were divvied up in advance—one family would bring and cut up a giant watermelon, another would be responsible for salads—and ours would often be tasked with bringing the L.A. kalbi. And to this day, it’s the smell of that marinated grilled meat that brings me straight back to these picnics, to running around with my friends with a still piping-hot piece of short rib into my hand, a square of paper towel tucked around the little bone.L.A. kalbi is a uniquely Korean American dish. While kalbi, also known as marinated short rib, existed back in Korea, the meat was usually butchered into an English cut, where a thick piece of meat sits atop one piece of bone, which was then butterflied open so it unfolded like a book on the grill. By contrast, the flanken cut used in L.A. kalbi is cut thin, sliced across the bone so that each piece has three nubs of rib attached. Korean immigrants in Los Angeles found the flanken cut to be more prevalent at their local butchers, often the Mexican markets that are common in Southern California. It’s no surprise that people fell in love with this version: The thinner pieces of short rib were cheap, quick cooking, and marinated much more quickly than the traditional English cut. L.A. kalbi became a signature dish in L.A.’s Koreatown, especially at restaurants like BCD Tofu House and the now closed Beverly Soondubu, where it acted as a perfect foil to spicy stews. Eventually, the dish became so popular it made its way back to South Korea, and ingrained itself into the motherland’s food culture.How to Marinate ItL.A. kalbi is, at its core, a very simple dish with a classic Korean flavor profile, and can be made with ingredients that are easily found at American supermarkets. The marinade combines soy sauce, sesame oil, garlic, ginger, and usually a sweetener like sugar or honey. From there, however, the variations are endless. Adding a fruit like Korean pear, apple, or even kiwi helps to add a light sweetness and tenderize the meat, while adding a bit of rice vinegar can bring tartness and acidity. Every restaurant (and Korean mom) has their own secret sauce, though you might be surprised at how often lemon-lime soda will come into play. (It’s a sneaky pantry substitute for fruit!)This is all to say that how you marinate your own L.A. kalbi is up to you—it’s all about flexibility. If you don’t have a certain ingredient, you can easily swap it out for something similar, like apple cider vinegar for rice vinegar, or add in other flavors to taste. Just make sure to grate or blend your marinade ingredients well, as chunks of aromatics like garlic and ginger can burn easily on the grill.The One Tool You NeedWhile tongs for grilling and flipping your L.A. kalbi are a no-brainer, one tool that is absolutely necessary when serving the dish is a good pair of scissors. Kitchen scissors are a workhorse in Korean cooking, and are used for everything from snipping scallions to trimming meat to cutting noodles. In the case of L.A. kalbi, scissors are used to cut the three-boned slices of short rib into individual one-bone pieces, or to cut the meat off the bone for children or easy ssam wrapping. Grab yourself a pair and you’ll be surprised at how often you find yourself reaching for them.How to Grill (or Not Grill) ItL.A. kalbi is made for outdoor grilling. High, direct heat quickly caramelizes the outsides of the marinated short rib slices while keeping the inside moist and juicy, and whatever smoke is produced disappears into the summer air. It’s even better when grilled over charcoal, which adds an additional layer of smoky flavor. You do, however, have to be careful of drips—fat from the ribs or the sugar from the marinade can fall onto the coals and produce flare-ups, so have those tongs ready to move things around.Don’t have access to an outdoor grill? Even if all the park grills are snatched up, a portable gas burner and a grill pan are a good option, too, allowing you to cook from the comfort of your picnic blanket. And if the weather isn’t cooperating, you can still make great L.A. kalbi on the stove! I highly recommend using a cast-iron grill pan if you have one—the grooves give you the right amount of contact with the meat while allowing extra marinade to easily drain.What to Serve It WithThe best thing about L.A. kalbi is that it plays nice with so many other foods and situations. You can serve it right alongside your hot dogs and hamburgers at your Sunday grill-out, or throw it on top of rice with a bit of kimchi for a simple weeknight dinner.Photos by Isa Zapata, Food Styling Kat Boystova, Prop Styling Allie Wist But when L.A. kalbi is the star of your spread, you’ve got to bring out the works! I serve it with freshly torn lettuce leaves (I like red leaf or Bibb) and/or kkaenip (perilla leaves) for wrapping, along with banchan like kimchi, pickled cucumbers or radish, or lightly sautéed and seasoned vegetables like spinach or bean sprouts. I especially like to pair my L.A. kalbi with pa muchim, a riff on the curly scallion salad commonly served at Korean BBQ restaurants. Freshly sliced scallions are soaked in cold water to remove just enough of the bite, then tossed in gochugaru and vinegar to make a super refreshing palate cleanser for the sweet-salty caramelized ribs.Get the Recipe:L.A. KalbiPrepare a Korean barbecue feast at home with these sweet-and-salty grilled short ribs, plus all the fixings you'll need to eat them in ssam, or lettuce wraps.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-27", "author": ["Condé Nast", "Irene Yoo"]}