{"id": "32b6a2240cbf3afc6ee45f691d5a5185", "url": "https://www.bonappetit.com/story/how-to-tell-if-a-pineapple-is-ripe", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "How to Tell if a Pineapple Is Ripe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Tell if a Pineapple Is RipeBecause people in grocery stores get mad when you just cut off a piece and try it. Here's how to tell if a pineapple is ripe before you buy it.By Alex DelanyFebruary 28, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailPineapples don’t want to help you. They’re covered in spikes. Their leaves are kind of sharp. Their skin is thick. You could say that pineapples are...aggressively introverted. Knowing anything about the fruit, let alone how to tell if a pineapple is ripe, seems like a doomed endeavor from the start. But inside, it’s a different scene entirely. Ripe pineapple is perfectly sweet, slightly tangy, and somehow packed with warm, sunny energy. (Sorry for sounding like a hippie or someone who believes in crystals, but it’s true.) But how can you tell what's going on with all that other stuff in the way?Knowing how to tell if a pineapple is ripe is actually pretty simple—you just need to follow a simple three-step process. If it sounds like we’re trying to sell you on a weight-loss product or a new credit card, we’re not. We’re trying to find you a perfect pineapple. Here’s what to pay attention to.The ColorWhen you think of pineapples, you probably think about a greenish-yellow fruit. But the exterior of a pineapple changes from a green-gray to yellow as it ripens, so as a general rule, the more yellow a pineapple’s exterior is, the riper the fruit will be. You want a pineapple that is consistently golden-yellow from top to bottom, but not getting into dark orange territory—that's gone too far. One interesting thing about pineapple is that it actually doesn't ripen much after it's been plucked from the tree, which means that the greener, less-ripe ones you see at the grocery store, well, they ain't getting any riper.The FeelEven when pineapples are perfectly yellow, they still have spikes. Sorry. We can’t do anything about that, but touching them still helps figure out if they’re ripe or not. The difference in texture won’t be as drastic as a ripe vs. unripe avocado, but a ripe pineapple will feel very slightly soft when you squeeze it. A rock-hard pineapple isn’t the one you want.The SmellYeah, this is probably the one you already know. If the color and feel are to your liking, give the base of the pineapple a sniff. If the bottom of it smells ripe, fruity, sweet, and bright, that thing is probably good to go. But take warning: if it starts to smell funky and fermented, like vinegar, the pineapple has gone a bit too far. (Not that fermented pineapple is a bad thing per se; we just want it to happen on purpose, not by accident.)Grab a ripe pineapple and put it on top of these short ribs, why dontcha?Braised Short Ribs with a Pretty Great Bacon-Pineapple Situation on TopWe're topping all of our braises with bacon from now on.View RecipeExplore Bon AppétitBasicallyPineappleFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-28", "author": ["Condé Nast", "Alex Delany"]}