{"id": "32b8a8d656ec4c82029a01de98f98328", "url": "https://www.bonappetit.com/story/future-of-brunch", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Like the Soufflé Pancake, the Future of Brunch Is in Asia | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Future of Brunch Is in AsiaIt may have started out as a Western copycat, but it’s becoming its own cuisine.By Clarissa WeiOctober 22, 2021FacebookTwitterEmailBrunch outside of Ooh Cha Cha in TaipeiPhoto by Mai BachFacebookTwitterEmailWhen Mai Bach opened her restaurant in Taiwan in 2013, she noticed a peculiar pattern among her guests. “We started having people come in and order a bunch of food and take photos, but they didn’t eat any of it,” says Bach, who co-owns Ooh Cha Cha, a vegan eatery in Taipei. Bach eventually had to speak with some of her customers about the massive food waste their habits were generating, but their insistence on taking photographs of their food and posting it on Instagram stuck with her. When designing her second location in 2017, she kept aesthetics top of mind, not only for the space but for the menu.“We put unique things on the walls and used the best lights. We even launched a brunch plate,” she says. On the walls: a neon sign, vegetation hanging from the lights, and tropical foliage wallpaper. And on the plate: a collection of baked home fries, roasted cherry tomatoes, baby greens, tofu scramble, and tempeh bacon—topped with a beautiful fan of thinly sliced avocados. It worked; the brunch plate is now one of the best sellers on the Ooh Cha Cha menu.While the brunch scene in Asia may have started off as an aspirational copy of brunch culture in the West, it is also slowly but surely easing into its own identity.It’s not just Ooh Cha Cha, and it’s not just Taiwan. The cult of brunch is now reaching high octane all throughout Asia—a combination of Instagram culture and good old-fashioned gentrification. Globalization has been homogenizing dining scenes around the world for decades: In the late 20th century, fast-food chains like McDonald’s were the hallmark of an international city. Today, “brunch is a cultural signifier for yuppies around the globe,” as Bach puts it.Like their metropolitan counterparts around the world, many young people in Asia are now spending their weekends in pursuit of a robust cup of pour-over coffee or sunny-side up eggs with thin pieces of smoked salmon arranged in the shape of a rose. The vibes in their favorite restaurants are all more or less the same: bright, airy places with minimalist decor, serving bowls of carbs with pretty accouterments on top, avo toasts, and different permutations of eggs. But while the brunch scene in Asia may have started off as an aspirational copy of brunch culture in the West, it is also slowly but surely easing into its own identity.Instagram contentThis content can also be viewed on the site it originates from.“Nowadays, we’re seeing a lot of Australian brunch cafés in Taipei,” notes Leslie Liu, a food influencer behind the popular Instagram account Taipei Foodie. Australian-style brunch can be found in almost all metropolitan hubs in Asia. In Taipei, there is Woolloomooloo, a brunch café named after a suburb in Sydney and known for its flat white lattes. Tokyo has an eatery called Working Holiday Connections, which celebrates Australia by branding koala designs on its soft pancakes. Seoul has a restaurant named Summer Lane, with Australian classics like smashed avocado. There’s a distinct sameness to all of these restaurants, with massive floor-to-ceiling windows, perfect heart rosettas on every cup of coffee, and minimalistic decor—all by-products of a phenomenon partly jump-started by liberal visa policies.Australia opened up its working holiday visa scheme to Japan and South Korea in the 1980s and ’90s, respectively, and China, Indonesia, Malaysia, Singapore, Taiwan, and Hong Kong in the 2000s, with no caps on arrivals from the latter two regions. And returnees brought back their fondness for Australia in the form of brunch cafés. “There are two influences for brunch culture in Indonesia,” says Indonesian food writer Kevindra Prianto Soemantri, who cites 2011 as the year when brunch culture really began to take off on the archipelago. “One is the students coming back from the U.S. and Australia to Indonesia, and the second is Bali. Everything brunch is in Bali.”Brunch at Ooh Cha ChaPhoto courtesy Ooh Cha ChaPlaces like Bali or Bangkok are ideal outposts for the brunch scene because of their heavy Western tourism. And in former colonial places with a history of Western cuisine—like Hong Kong or Singapore—brunch may be a natural step to take. Western cuisine in Asia has also long been seen as a status symbol, associated, though falsely and problematically, with cleanliness and higher standards of service. Take the 1990s, when Starbucks began their Asia expansion. ‘‘Coffeehouses are a sign that Singaporeans have achieved the status of a developed nation and we are breaking new ground in the area of becoming a cultured society,” one Singaporean social commentator said in a Starbucks case study from the time.Alongside coffee, bread has also been a part of Asian culinary repertoires for decades, albeit brought in under neocolonial pretenses. “Bread was introduced after World War II,” explains Yu-Jen Chen, an associate professor at National Taiwan University who specializes in food anthropology. In 1954, in the midst of the Cold War, the Eisenhower administration started up the Food for Peace program, in which American aid to developing countries arrived in the form of wheat. Countries like Taiwan, Japan, and Indonesia received large shipments of wheat and flour, relieving the United States of its grain surpluses in exchange for diplomatic leverage. Bread especially took off in Japan after propaganda by both Japanese and American governments convinced locals that a rice-based diet caused brain damage, and housewives were taught how to prepare meals using imported flour. “So before brunch came, there was already a habit of eating bread for breakfast,” Chen says.Sugar Pea cafePhoto courtesy Sugar PeaBut restaurateurs now have to strike a delicate balance between serving something novel and catering toward local taste buds. Trends like sourdough are an easier sell in places like Hong Kong, where people are more familiar with European-style baked goods. But it is a harder sell in Taiwan because people are more used to soft, pillowy milk breads. “I had tried sourdough out on my staff and they told me that it [was] so hard, that it made their mouth hurt, and that it was sour,” says Bach, who ended up going back to a softer multigrain sandwich bread on the menu. And unlike in America, where diners might enjoy giant stacks of pancakes, many people in Taiwan prefer mini pancakes. “My best-selling dish is pancake tacos,” says Sandy Yoon, the chef-owner behind the glitzy brunch restaurant Sugar Pea in Taipei. The dish is composed of small buttermilk pancakes folded with bacon, scrambled eggs, and cheddar. “People really like bite-size food that you can pick up and eat. It’s very American to want a huge, heaping stack of pancakes. That’s not going to drive cravings here.”Local ingredients—like sambal—are slowly but surely being used in brunch restaurants across Indonesia.While brunch culture may have begun in Asia as a way to emulate the West, this bespoke attention to regional preferences has generated a collection of brunch items unique to Asia. “You start to see a really Japanese take on brunch foods, but not necessarily brunch as we know it in the States,” says Melinda Joe, a food writer based in Tokyo. She cites Japan’s soufflé pancake as a prime example. The soufflé pancake is now popular in the West, an example of how global trends can come full circle.Another item that has taken on a life of its own is the humble hamburger, which has actually become a staple breakfast item in Taiwan. “A lot of traditional breakfast restaurants sell bread and hamburgers,” Chen says. In 1981, a local entrepreneur opened a fast-casual breakfast chain called Mei Er Mei—inspired by American fast-food joints. But the hamburgers of Mei Er Mei, sold exclusively in the morning, deviate greatly from their original inspirations. They feature a thin meat patty with iceberg lettuce and very sweet ketchup sandwiched between small sweet buns.Brunch in Asia will continue to evolve until it becomes a cuisine unto itself, similar to how American Chinese food has little resemblance to the food that’s eaten in China today. Soemantri, for example, admits that he has never understood the appeal of avocado toast. But he lights up when he talks about how local ingredients—like sambal—are slowly but surely being used in brunch restaurants across Indonesia. “At Beau Bakery, they have this waffle with fried chicken with sambal on top of it,” he says of a restaurant in Jakarta. “I quite like it. You can capture the feeling of eating brunch with your friends, but it also pleases the local cravings.”Explore Bon AppétitLifestyleTravelCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-22", "author": ["Condé Nast", "Clarissa Wei"]}