{"id": "32bae9fdd013cbe1c50a6fe9b8d0935d", "url": "https://www.bonappetit.com/story/spicy-pomodoro", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "I Retired My Go-To Tomato Sauce for This Spicy Pomodoro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Retired My Go-To Tomato Sauce for This Spicy PomodoroTomatoes and basil, meet Fresno chiles and chewy, tender rice noodles.By Elyse InamineAugust 29, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailCome red sauce season (this is a real season, I swear), there’s a batch of Marcella Hazan’s tomato sauce bubbling on my stovetop at least once a week. It’s too easy not to make: Take a can of tomatoes (whole! peeled! no weird bits of basil!), throw in a heavy-bottomed pot with two onions and a lot of butter (it’s a legendary recipe for a reason), and after about 40 minutes of simmering, you’ve got one very luxurious pasta sauce. I love it. So much. As I type this I can imagine my second-grade self sneering at me and asking, “Well, why don’t you marry it then?”Well, second-grade me, that’s because Marcella’s sauce and I are actually on a bit of a break. (Didn’t you read the “almost always” part?) Sometimes, that’s what grown women and tomato sauces just need to do. You’ll get it when you’re older. As late summer brings in gleaming bauble-like tomatoes and 85-degree weather with 90 percent humidity, I’ve moved on to this fresh tomato pomodoro recipe from Chris Morocco that’s lighter (no butter!) and sort of surprising (in a good way). It’s unlike any tomato sauce I’ve made before—and I’ve made a lot of tomato sauce.Here’s why. You cook down garlic and big cherry tomatoes until the skins blister and break open. Adding in a few sprigs of bittersweet basil remind you it’s still a pomodoro. But some slivers of fiery Fresno chiles in the sauce and a grand garnish of inky chile oil (I like this fried garlic one) and sesame seeds nudge you into an Asian-ish direction.And here comes the boom: tender, chewy rice noodles turn this pomodoro full-on AZN. Chris says to get “wide rice noodles,” but I went ahead and got the widest ones I could find, nearly two-inch-wide big boys after multiple trips to Asian supermarkets throughout New York City. Because they’re so bouncy and textural, rice noodles make sweet pad thai, mediocre chow fun, and beefy pho just more fun to eat. They also cook in a few minutes, making them a perfect summer dinner, see more recipes here. Plus, rice noodles basically become whatever sauce or soup they’re in (ever make the mistake of not separating the noodles from the broth in leftover pho?).Here in Chris’s rice noodles al pomodoro with chili oil, it’s the perfect pillowy thing for absorbing the smoky, spicy, tomatoey sauce, much like how a young mind grabs soaks up adult sarcasm. And that, child-version of me, is why this particular tomato sauce is my new main squeeze.Get the recipe:Rice Noodles al Pomodoro with Chili OilWe’ve got bursting, jammy cherry tomatoes that make their own sauce, and chili oil that upends the typical Italian flavor profile.View RecipeExplore Bon AppétitPastaTomato SauceTomatoRead MorecookingTHE Tomato Toast Recipe of Summer 2018By Amanda ShapirocookingWhat Are Heirloom Tomatoes, Anyway?By Alex DelanycookingThese Greens in Tomato-Bacon Broth Are an Unexpected Superstar Summer SideBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-29", "author": ["Condé Nast", "Elyse Inamine"]}