{"id": "32c005abea156649df969081d3fea7d6", "url": "https://www.bonappetit.com/story/chickpea-and-greens-dinner-frittata", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "This Chickpea and Greens Frittata is All You Need for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chickpea and Greens Frittata is All You Need for DinnerWho says one pan of eggs ‘n stuff can’t have it all?By Sarah JampelJanuary 8, 2019FacebookTwitterEmailFacebookTwitterEmail“Will it fit?” is a personal game of my own invention that I play in the kitchen, and it goes a little something like this: Whenever I’m transferring leftovers into a container or decanting a pantry item (lentils, quinoa, sugar) into a jar, I seek out the vessel that will be as perfect a fit as Cinderella’s glass slipper. If you are a fan of the Tumblr—RIP!—account “Things Fitting Perfectly into Other Things,” you understand.I take great pleasure in succeeding (and, can I just say, my track record is pretty remarkable), but I also live for the risks: Stakes are high when pearl couscous might overflow, rolling into that crevice between the counter and the oven, or a tomato-y, turmeric-y soup might exceed the capacity of the “airtight” container by just a couple tablespoons and dribble all over the sides.And I’m telling you this, uh, why exactly? Because I had one of my greatest “will it fit?” victories when I made senior associate food editor Molly Baz’s chickpeas and greens frittata. The frittata fit perfectly into the cast-iron skillet that I had selected—if I had added one more egg or one more leaf of kale, the levies would’ve broken and I would’ve had a big ol’ mess. But alas, this dinner was my destiny: I ended up with a thick, fluffy-yet-creamy frittata full of all of the good stuff.As Adam Rapoport writes, better a thick frittata than a thin one. Whereas my past experiments have been sad, flimsy things, yielding pancake-thin egg slices that needed to be sandwiched between focaccia to pass for a meal, this 12-egg behemoth is packed with all of the foods that make up a fully fledged, very adult dinner: an unbelievable amount of greens (don't worry, they will wilt) and plenty of spiced chickpeas (a good, cheap, and readily available source of protein). There are also herbs galore (whatever you’ve got—I had basil and chives), red pepper flakes, lots o’ dairy (Molly suggests sour cream, but I used Greek yogurt), and a garlic mayo garnish to make you feel like you’re eating Spanish tortilla.The key to this frittata is starting the eggs on the stove before moving them to the oven. Once you’ve cooked the beans and greens, you pour the egg-dairy mixture on top and gently scramble over low heat to achieve soft curds (this was difficult on account of my near-bursting pan, but I persevered): By jumpstarting the cooking process, you ensure that the frittata cooks evenly when it goes into the oven (otherwise, the interior will remain liquidy long after the edges have set). When you’re finished on the stove, transfer the pan to the oven for ten-ish minutes to finish the cooking process: It can still be a little wobbly in the middle, as the hot pan will continue to transfer heat to the eggs once it’s out of the oven, but you don’t want any of that slimy raw egg nonsense (I broiled the frittata for a couple of minutes to banish it).My finished frittata, crispy on the top but still soft in the middle, puffed up in the oven’s heat: It came out hugging the skillet’s curves so snugly, like this kitten in its kitten-sized hole, that I shrieked with joy. Champion! The only remaining “will it fit?” challenge: How I was to get as many slices into my stomach as possible. But don’t you worry—I found room.Get the recipe:Spiced Chickpeas and Greens FrittataWhen in doubt, frittata.View RecipeExplore Bon AppétitWeeknightFrittataDinnerRead MoreEgg and Merguez WrapsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Sarah Jampel"]}