{"id": "32c4967d6b8cfe91856ae37fc880f3a4", "url": "https://www.bonappetit.com/story/never-fail-lemon-ginger-brew", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "This Lemon-Ginger Brew Will Save You from the Clutches of Cold Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Lemon-Ginger Brew Will Save You from the Clutches of Cold SeasonWhen your co-workers begin to fall to flu season, make a double batch ASAP.By Aliza AbarbanelOctober 19, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Flu season hit the BA office this week in a tidal wave of tissues, Emergen-C packets, and out-of-office messages. Which is why, after scheduling my annual flu shot and dousing everything on my desk with hand sanitizer, I headed home to make a double batch of lemon-ginger brew.Forget green juice. Forget echinacea tea. When it comes to restorative liquids, this lemon-ginger brew is the real MVP. It’s a high-octane concoction from food director Carla Lalli Music, who has two kids and knows a thing or two about soothing sore throats.The three-ingredient recipe is minimal, which is good, because no sick person wants to do a lot of chopping and stirring anyway. All you need to do to get things going is toss some peeled ginger knobs (about a half pound) in a food processor and pulse them into a coarse paste. (If you don’t have a food processor, use the larger holes of a box grater or give those knobs a fine chop. It’s a bit more work, but the chopped up ginger will do just fine.)Add the ginger to a medium saucepan with 6 cups of water, bring it to a boil, and then reduce the heat and simmer for 30–40 minutes. Use this time for a steamy shower, or even a power nap. (Just don’t forget to set an alarm!) Strain the ginger chunks out with a fine mesh sieve, then squeeze two or three lemons worth of juice into the pot and add agave syrup (or honey, or pure maple syrup) to taste. Just like that, the brew is done.Once made, this brew can hang out in the fridge for up to two weeks—plenty of time to soothe a sore throat while your white blood cells do their healing work. I prefer to heat it up before serving, so the fiery ginger is extra pungent. It’s the kind of burn that makes you really feel like something is working, and I need that. Plus: It’s delicious.This is the time where I should probably acknowledge that, no, this drink isn’t magical. It won’t cure you of whatever ails you, and you should definitely still get a flu shot. Still, there’s something about the holy trinity of honey, ginger, and lemon that soothes your body and your soul. And it pairs excellently with non-sick days too, making rainy mornings and quiet nights at home feel infinitely cozier with minimal effort. So make ginger, lemons, and honey part of your pantry (and fridge) staples, and you’ll never be far from a mug of this cozy and restorative brew. Think of it as insurance against the next time flu season hits .It's time to brew:Lemon-Ginger BrewNo it's not green juice. It's Lemon-Ginger Brew, a creation of food director Carla Lalli Music.View RecipeExplore Bon AppétitBasicallyGingerLemonNever FailRead MorecookingThis Tomato Tart Is So Easy, I Can Tell You How to Make It Over the PhoneBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-19", "author": ["Condé Nast", "Aliza Abarbanel"]}