{"id": "32d0523fcec011747046ce7381b74abc", "url": "https://www.bonappetit.com/story/leah-chase-no-choice-but-to-succeed", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Leah Chase Told Me I Had No Choice But to Succeed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLeah Chase Told Me I Had No Choice But to SucceedChef Nina Compton remembers her mentor and friend, who died this week at 96.By Nina ComptonJune 4, 2019FacebookTwitterEmailPhoto by Paul NatkinFacebookTwitterEmailI consider myself very fortunate to have had Leah Chase in my life. There was a light that glowed around her every time she entered a room. While filming Top Chef in New Orleans, I had the honor of meeting and cooking for Leah. On one occasion we were told to make gumbo. At the time, I had never had a proper gumbo before and tried my best. I remember Leah saying, “My dear, nice try, but that is not gumbo.” We laughed about that day often. I’d rather eat her gumbo anyway!She reminded me of my granny who taught me to cook. Leah had the same attributes she had: a very strong work ethic, driven and opinionated yet very caring and gentle, always passing along wisdom. Every time I saw Ms. Leah I would tell her that she needed to take a break. She’d scrunch up her face and tell me that she loved being in the kitchen, and that is exactly where she was until the very end. It’s what kept her alive each day, feeding people and making them happy.Leah would often tell me how proud she was of me. She told me I had no choice but to succeed. When I first moved to New Orleans, she made it clear that as a black female chef I have the power to change the playing field. Smiling but serious, she would say, “I am counting on you to make it” or “You need to show those boys a thing or two.” No pressure, right?! But she wasn’t sour on men at all. She would occasionally phone my husband to make sure I was treating him nicely. Ms. Leah was coming at me from all sides, but I wouldn’t have it any other way!Leah Chase was inspiring, and I hope to continue to make her proud. She touched so many people through her food, her energy, and her charisma. Her restaurant, Dooky Chase’s, is an institution, cherished as much for its food as for its history and legacy. It is a gift she has left us.How many of us will make it to 96 years old doing what we love and smiling all the time? Leah is and always will be Le Grande Dame to me. I love you and miss you, Leah. May you rest in peace.Nina Compton is the chef behind Compère Lapin and Bywater American Bistro in New Orleans.Explore Bon AppétitChefsFirst PersonRead MorecultureMeet the Incredible, 93-Year-Old Chef of Dooky Chase's Restaurant in New OrleansBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Nina Compton"]}