{"id": "32d7bb2ebf7ceeca5743d71c03d01af1", "url": "https://www.bonappetit.com/story/chris-morocco-pantry-pasta", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "How Chris Morocco Makes Pantry Pasta in the Time It Takes the Noodles to Boil | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWithout My Pantry Pasta Formula, I'd Be Lost (Or At Least Hangry)Every one needs a 20-minute pasta in their back pocket—and this is mine.By Chris MoroccoApril 16, 2020FacebookTwitterEmailPhoto and Food Styling by Chris Morocco FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.The deliciousness of a bowl of pasta isn’t proportional to the time it takes to make it: A three-hour ragù doesn’t necessarily taste 15 times better than a 10-minute butter-and-Parm weeknight affair. (Don’t check my math—it’s never been my thing.)My pantry pastas fall somewhere in the middle of the time spectrum. They’re simple, streamlined, and flexible, with unfussy yet massively flavorful sauces that come together in the time it takes to boil water and cook pasta.The key is to use ingredients that are already loaded with tons of depth: garlic, chile flakes, black pepper, cured pork products like bacon or guanciale, anchovies, capers, olives, mushrooms, tomato paste, butter and/or cream, eggs, parm or another hard aged cheese. Using three ingredients from this list guarantees a coach seat to Flavortown. Pick four or five and you may find yourself in First Class.Assuming you're cooking for four people, start by bringing a big pot of salted water to a boil. Cook 12 oz. rigatoni or other pasta until very al dente. Drain, reserving 2 cups pasta cooking liquid.Meanwhile—and this is a BIG meanwhile since presumably everything below will have happened while the pasta cooks—work on the base of your sauce. During this time, you’ll coax as much flavor as possible from your ingredients. Cured meats need to render their fat (they’ll usually go in first). Garlic and onions need to gently soften and reach the edge of pale golden, and chile flakes and pepper want to bloom and amplify. Same goes for anchovies and tomato paste, both of which need to actively simmer to reach a deep flavor and release all they have to give.A lot of my pantry pastas start like this:The base:Warm several glugs of olive oil in a large skillet over medium heat. Cook 6 sliced garlic cloves until soft and just beginning to lightly brown around the edges, about 3 minutes. Add between 4–8 anchovies (I encourage anchovy skeptics to trust us and use 4 for lots of depth of flavor; fans can obviously add more), and 1 tsp. Aleppo-style chile flakes (or ½ tsp. if using crushed red pepper flakes). Cook, breaking up with a spoon, until anchovies have melted into the oil. Add 2 Tbsp. double-concentrated tomato paste, stirring into the hot oil. Cook, stirring constantly, until paste darkens and sizzles in the oil.The veg:From there you can throw in handfuls of greens, defrosted baby peas (if you throw them in frozen they will get wrinkly, but a quick soak in hot water will make them stay plump), asparagus, sugar snaps, snow peas...the list is almost endless. Cook them just until they turn bright green, since they will continue to cook once the pasta goes in. Harder veg like cauliflower, broccoli, or Brussels sprouts should be roasted or sautéed first.The mixy-mix:Add pasta and about 1 cup pasta cooking liquid to the skillet. Increase heat to medium-high. This is where the pasta and sauce go from being two distinct elements, to one cohesive dish. Add 2 Tbsp. (or frankly more) cold unsalted butter, chopped into pieces, along with 1 oz. grated Parmesan. Cook, tossing often, until the sauce coats the pasta, adding a splash or two more water as needed to loosen. Motion is key, whether that is working the skillet back and forth to knock the pasta around so everything gets evenly coated, or just stirring vigorously while keeping the pan in place. The butter works to create a nicely emulsified sauce that looks and tastes almost creamy. Keep the sauce slightly loose since the pasta will continue to absorb water as it sits, and tighten up when it hits the plate. That’s it. Serve topped with more Parmesan, chile flakes, and fresh herbs if you have them, like basil, mint, or chives.So how many times more delicious is this pantry pasta than mac and cheese from a box? I already told you I'm not a math guy—but I'd guess that number is upwards of a hundred.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-16", "author": ["Condé Nast", "Chris Morocco"]}