{"id": "32f53a9bb6a831039bc9e7711edc52af", "url": "https://www.bonappetit.com/recipe/turmeric-rice-salad-with-roasted-brussels-sprouts", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Turmeric Rice Salad with Roasted Brussels Sprouts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueTurmeric Rice Salad with Roasted Brussels SproutsBy Yewande KomolafeNovember 15, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintPack the various components—sautéed rice, dressing, and cranberry-herb mixture—separately if transporting for a potluck. Dress and assemble just before serving. This recipe is presented to you by Samsung.Ingredients8–10 servings¾cup unsweetened coconut flakes½cup sliced almonds4cups brussels sprouts, trimmed6Tbsp. grapeseed or canola oil, dividedKosher salt11\" piece ginger, peeled, grated½cup coconut cream (from a 5.4-oz. can, or spooned from surface of a 15-oz. can of unsweetened coconut milk)1Tbsp. honeyFreshly ground black pepper2Tbsp. unseasoned rice vinegar1tsp. ground turmeric8cups cooked rice (from 2 cups uncooked)½cup cilantro leaves with tender stems½cup dried unsweetened cranberries½cup mint leaves¼cup thinly sliced scallionsPreparationStep 1Preheat oven to 375°. Spread coconut on a small rimmed baking sheet and toast until golden brown, about 3 minutes. Transfer to a medium bowl.Step 2Spread almonds in an even layer on same baking sheet and toast until golden brown, 3–5 minutes. Add to bowl with coconut. Let cool and set aside.Step 3Quarter brussels sprouts, reserving any leaves that fall off. Transfer sprouts and leaves to a large rimmed baking sheet and toss with 2 Tbsp. oil. Season with salt and toss again. Roast brussels sprouts until deep golden brown, tender in the center, and crisp around the edges, about 25 minutes.Step 4Meanwhile, whisk ginger, coconut cream, and honey in a small bowl. Season with salt and pepper, then whisk in vinegar and 2 Tbsp. oil until dressing is emulsified. Taste and season with salt if needed; set dressing aside.Step 5Heat turmeric and remaining 2 Tbsp. oil in a large nonstick or cast-iron skillet over medium-high. Add rice and cook, tossing, until warmed through, 3–4 minutes. Transfer to a large bowl. Add brussels sprouts to rice and toss to combine.Step 6Add cilantro, cranberries, mint, and scallions to bowl with reserved coconut and almonds. Pour in 3 Tbsp. reserved dressing and toss to coat. Top rice salad with cranberry-herb mixture. Serve with remaining dressing alongside.How would you rate Turmeric Rice Salad with Roasted Brussels Sprouts?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleA delicious recipie, just like most of the recipies from BA. Have made it plenty of times and will continue to do so.RisehNetherlands12/28/2019Absolutely love this salad, even if you're not a brussel sprout lover you should definitely try it. Its crunchy, wholesome and has a touch of sweetness.AnonymousAustralia2/6/2019Explore Bon AppétitSaladRiceRice & GrainsBrussels SproutVegetableTurmericHerbs & SpicesAlmondNutCoconutFruitFallMainSideDairy-FreeVegetarianGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Yewande Komolafe"]}