{"id": "32f9c8cb5087bf3c0f12197b2e808db7", "url": "https://www.bonappetit.com/story/ban-celery-juice", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "On Banning Celery Juice and Getting to Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOn Banning Celery Juice and Getting to SleepReading recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroMarch 28, 2019FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,There are good weeks, there are bad weeks, and there are weeks that make you feel like you’ve been suctioned off the planet and left to hang out in space like Sandra Bullock in Gravity. It’s been one of those latter weeks for me (Houston, we have problems. Many problems). And whenever I’m feeling this ungrounded, my old friend insomnia likes to get back in touch. (After all these years, he really can’t take a hint.)I’ve talked before about my love for Headspace, the meditation app, and we’ve written about how it can help you stay sober and eat more mindfully. But I’d never tried their “Sleepcasts” until last week when, in a 3 a.m. tizzy of anxious, swirling thoughts, I dove in. Sleepcasts are basically podcasts made to bore you into unconsciousness. Each one has a narrator, who walks you through a scene. “Narrator” and “scene” are loosely defined here because there is no plot to speak of on Sleepcasts. The one I tried, “Night Town,” is narrated by a woman with a soothing British accent. “Welcome to Night Town,” she says with an ASMR-y whisper, the sound of a lone car passing in the distance. “It’s a very sleepy town.” Aaaand cue snoring. I’ve listened to “Night Town” three times in the last week, though I’m considering trying “Midnight Launderette” and am curious about “Cat Marina” (subtitle: “These cats know how to relax”).Inside the bubble.\nPhoto by Jenny PeñasWhat I’m ReadingThe weird world of injectables and how, at some point, “getting work done” became something to brag about instead of something to hide. Why aren’t there more Indonesian restaurants in the U.S.? So sorry for you, arugula. More and more of us are coming out as sober-curious. Also, Alex Ronan’s adventure in a tropical paradise outside Berlin (with unreal photos from Jenny Peñas).What I’m WritingEverybody loves Samin Nosrat, including me, despite my best attempts at unbiased journalism. On the flip side, did you know I make my own butter? (Don’t be too impressed: All it takes is a blender.)And, no, I don’t actually think we should ban celery juice. If you want to puree massive quantities of the world’s most underwhelming vegetable and chug it, you do you. I’ll be over here with my cucumber slushy.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleLet Them Eat Reubens!By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-28", "author": ["Condé Nast", "Amanda Shapiro"]}