{"id": "330402f404e31dae8731c8a1eab524db", "url": "https://www.bonappetit.com/story/anzac-biscuits", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Anzac Biscuits, Explained | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Are Anzac Biscuits, Anyway?Rule one: Never call them cookies.By Lara LeeApril 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When most people are asked to name iconic Australian and New Zealand foods, they head straight for the Tim Tams, Vegemite, pavlova, or meat pie with tomato sauce. But the food that these nations most proudly boast is one that you may have never heard of: the Anzac biscuit. Of all the “bikkies” in Australia and New Zealand, Anzac biscuits are perhaps the most beloved, perfect for storing in decorative tins and dunking into a hot cup of tea.While made with simple ingredients, Anzac biscuits are a symbol of national pride and great cultural significance—each bite embodies more than 100 years of history and connects many Australians and New Zealanders to their childhood and the past. There are endless variations of the original recipe, dating back to their creation during World War I. Whether they are chewy or crunchy, thick or thin, baked with or without coconut, they all share the deep golden color and distinct (and quite frankly, irresistible) caramelized flavor of golden syrup, a viscous, sticky amber-colored syrup that holds the Guinness World Record for having the oldest branding and packaging in the world. (And yes, Lyle’s is still the way to go!)Today, they are an everyday sweet for Aussies and Kiwis. Multiple Anzac biscuit brands line supermarket aisles in ready-to-eat packets, and artisan variations are proudly displayed on café counters across both countries. Making the biscuit is a common childhood activity—butter and golden syrup are melted and mixed with oats, coconut, flour, baking soda, and sugar, and then rolled into balls and baked. The process totals 20 minutes and is perfect for the average child’s attention span. (Get my Anzac biscuit recipe right here!)A short history of the Anzac biscuitFor more than 100 years, the Anzac biscuit has been a taste of home for many Antipodeans, a recipe born from the spirit and sacrifice the ANZACs (Australian and New Zealand Army Corps) made during WW I. Basic army rations included rice, tinned corned beef, and an unpalatable hardtack biscuit so difficult to eat they were described as “one of the most durable materials used in the war, reputed to be bulletproof!” In an effort to boost morale, wives and women’s groups sent troops care packages containing Anzac biscuits. Although the original recipe evolved over time, the biscuits were made of essential pantry ingredients. And because they were bound by golden syrup, rather than eggs (which were scarce, as poultry farmers left to fight overseas), they were hardy enough to survive the two- to three-month journey to soldiers.Wait, is a biscuit a cookie?In Australia, when we say biscuits, we’re not referring to flaky, buttermilk scones. Instead, we’re talking about what North Americans would probably call cookies. The word biscuit, which is derived from the Latin words bis (“twice”) and coctus (past participle of coquere, “to cook”), meaning twice-cooked, describes baked goods, both sweet or savory, that are crisp and firm (a chewy Anzac biscuit is somewhat of an outlier!). The sweet versions can be served plain, topped with decorations, or used to sandwich a cream or jam filling. For Antipodeans, the word cookie, on the other hand, refers to a chunkier and softer baked treat, often incorporating smaller chopped ingredients like chocolate chips, nuts, or raisins.Can I call an Anzac biscuit a cookie?While Anzac biscuits do incorporate ingredients like oats and (optionally) coconut and can be soft and chewy or crunchy with a pronounced snap, the Department of Veteran Affairs (DVA), part of the Australian federal government, has declared that calling an Anzac biscuit a cookie is un-Australian. Those who market the biscuit as a cookie or stray too far from the official recipe can incur a large fine or possible jail time. You are allowed to call it an Anzac slice when it is cooked as a traybake, however, but for biscuits, the shape must always be round and you must never get creative with cookie cutters.Hold up, a biscuit that gives you jail time? Are there any variations?Anzac biscuits are protected due to their proud association with Anzac soldiers. While desiccated coconut is an officially approved addition, other variations fall into a gray area. Many bakers put their own spin on the recipe, adding lemon zest, dried rosemary and burnt butter, native spices like wattleseed, raisins, nuts, or a dip in chocolate. Those who can’t source golden syrup can substitute with one part dark treacle to three parts honey for a fairly good approximation, and some people even use solely honey, believing it adds complexity. Flour and oats are changed out for gluten-free flour and quinoa for a more wholesome, gluten-free version, and plant-based butter or coconut oil can make the biscuits vegan. But despite the various iterations, the most common difference between recipes is the ratio of traditional ingredients, with varying amounts of oats, coconut, sugar, and golden syrup. A pinch of salt is also often added to balance the biscuit’s sweetness.Photo by Heami LeeLyle’s Golden Syrup$14 at AmazonShould they be chewy or crunchy? (And can I decide?)Australians and New Zealanders have argued for decades over whether Anzac biscuits should be chewy or crunchy. Golden syrup gives the biscuit its famous chew, but there are additional ways to alter the texture. Some bakers use caster sugar for a thinner and crispier biscuit, whereas brown sugar adds extra moisture for a chewier bite. Changing the baking time also affects the consistency—the longer they stay in the oven, the crunchier they’ll become.What should I do with extra Anzac biscuits?The biscuits last for two weeks in an airtight container, and the dough and baked biscuits last in the freezer for up to three months. Any extras can be blitzed into a topping for a crumble, crushed and mixed with melted butter to form the base of a cheesecake, sprinkled over ice cream or yogurt, or used to make an ice cream sandwich.The importance of Anzac DayEvery year on Anzac Day on April 25, Australians and New Zealanders commemorate and honor the Anzacs and all service people who served and died in wars, conflicts, or peacekeeping operations. It holds special meaning in my own family—my great-grandfather Lieutenant Augustus Francis “Biff” White commanded a platoon during WW I and was awarded the Military Medal at the Battle of Messines in Flanders. Although a day of remembrance, both countries also celebrate the camaraderie of the Anzacs. Stories of their bravery, humor, ingenuity, and endurance left a powerful legacy, and Anzac biscuits—a small token of gratitude sent from home—became a national symbol of their courageous “Anzac spirit.” Lest we forget.Get the Recipe:Anzac BiscuitsPacked with oats, coconut, and rich golden syrup, this recipe for the beloved Australian “bikkies” lets you choose your own adventure: chewy or crunchy.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-19", "author": ["Condé Nast", "Lara Lee"]}