{"id": "3307497f1fdf030b99f96ee283b51f1c", "url": "https://www.bonappetit.com/story/sweet-potatoes-steamed", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "This Steamed Sweet Potato Recipe Is the Best Way to Serve Sweet Potatoes   | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Best Sweet Potatoes are Steamed, and I Don’t Want to Hear About ItFluffy, pudding-like sweet potatoes are even better topped with tahini butter and a generous shake of sesame seeds.By Carla Lalli MusicMarch 4, 2019FacebookTwitterEmailPhoto by Gentl & Hyers, Food Styling by Susie Theodorou, Prop Styling by Nina LalliFacebookTwitterEmailI’ve always had a bit of a bias against steaming, and I think it’s because it’s the one cooking technique that doesn’t rely on fat to get things going. I like foods that sizzle and crisp up, that get brown and roasty-toasty, and that’s not what steaming does. Steaming is a fat-free affair, and if we’re being honest, I don’t care for fat-free anything. Unless I had a hankering for a lobster, a dozen ears of corn, some dumplings, or a personal spa day, I didn’t think about hot water vapor very much, and my cooking didn’t suffer.The one exception to this rule was my complete and total faith in steamed sweet potatoes. I discovered the copacetic relationship between the method and this particular ingredient by accident, when my firstborn was a wee-babe and I started making baby food for him. Steaming was efficient and hands-off and didn’t create a lot of messy pots and pans, and sweet potatoes cooked that way became moist and fluffy and could be easily pureed. (Roasted sweet potatoes might be great as an alt-fry, but they can also become dry and fibrous.) It was a great technique, and I steamed a lot of sweet potatoes as a result. There were many times, as an underfed, sleep-deprived new mother, that I would lift the hot spuds right out of the steamer when they were done and peel back a wide strip of their skins before smearing some softened butter onto the flesh. For this magic snack, I’d add lots of salt and pepper and gobble them up straight away. Maybe they weren’t cooked with fat, but there was nothing stopping me from adding fat—and plenty of other seasoning—after the fact. I gained solid appreciation for steaming, which combined high-heat (for speed) with moisture, giving the sweet potatoes a pudding-like, spoonable texture. Good for mother and baby alike!All of my sweet potatoes were steamed from that point forward, even when everyone was big enough to sit at the table with a knife and fork. I steam purple sweet potatoes, garnet yams, and my favorites—the thin, pale-fleshed, and delectable Japanese sweet potatoes. I bring sweet potatoes onto airplanes to eat every time I fly, and I serve steamed sweet potatoes with butter and salt as a side dish at home. When I was working on the recipes for my book, Where Cooking Begins, I revisited the original butter-salt-and-pepper treatment and came up with a sesame-and-lime version that melts on contact and becomes a sauce. I love the way that the lime juice cuts through some of the starchy sweetness of the potatoes, and also the way the tahini teams up with the butter to create a richness that’s a little more interesting than the sweet cream flavor you’d get from butter alone. I top these with sesame seeds and many cranks of black pepper and squeeze more lime juice over them at the end. This preparation is a little more glamorous than the sweet potato snacks I used to eat standing at the kitchen counter, but they’re equally delicious if you eat them with your hands.Break out your steamer basketSweet Potatoes with Tahini ButterSteaming offers extreme speed and high hydration, which means that whatever you cook—from seasonal vegetables to proteins—will be done quickly and always moist.View RecipeExplore Bon AppétitHealthyishSweet PotatoTahiniWeeknightRead Morerecipes46 Best Sweet Potato Recipes to Cook This FallGallery46 SlidesBy Mehreen KarimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-04", "author": ["Condé Nast", "Carla Lalli Music"]}