{"id": "331090adc25f79bb5a89768fc9704bb5", "url": "https://www.bonappetit.com/story/kare-kare-sauce", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "I Eat This Peanut-y Kare-Kare Sauce With Every Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Eat This Peanut-y Kare-Kare Sauce With Every MealThis sauce by Fila Manila makes great kare-kare—and pasta and grilled cheese.By Harold Villarosa as told to Tiffany HopkinsAugust 17, 2021FacebookTwitterEmailPHOTO BY JULIAN COUSINSFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Kare-kare reminds me of home. Whenever I’d come back from college, the rich, savory stew would be there waiting for me, prepared by my dad or my grandmother. It was a special occasion meal, reserved for holidays and birthdays. These days it’s the thing I order most at Filipinx restaurants, and I would eat it every day if I could. And it’s the reason I always keep Fila Manila kare-kare sauce in my kitchen.Kare-kare is a hearty, funky Southeast Asian curry situation traditionally made with peanuts and braised beef or oxtail. I love eating it with bok choy, string beans, and eggplant. Kare-kare is all about the sauce, which gets its flavor and reddish-bronze color from a dose of annatto seeds and bagoong, or fermented shrimp paste. Every Filipinx family has their own take on it—some make their sauce thinner, others make it stickier and thicker, I make mine spicy by adding some bird’s eye chili—but you can also buy pre-made jarred kare-kare sauce. Fila Manila is the best I’ve tried.Fila Manila Kare-Kare Peanut Sauce$8 at Umami Cart$13 at AmazonCompared to other brands, Fila Manila is nuttier and sweeter thanks to the addition of date nectar and coconut vinegar. It has all the baseline kare-kare flavors you expect, but it’s not too assertive or abrasive, which I like because it means I can play with other ingredients depending on what I’m making. It’s versatile and flexible, making it a great entry-level sauce if you’re just learning about Filipino cuisine.Fila Manila kare-kare sauce is perfect for kare-kare, obviously, but recently I’ve been using it in just about everything. Coat some large prawns for shrimp and grits. Or go the Pad Thai route by adding a hit of tamarind juice, brown sugar, and chiles to the peanut-y sauce. I’ve really been loving it with pasta. I blanch some bucatini, then add some Fila Manila to a beurre blanc sauce, which makes it really aromatic and unctuous. I’ve also been playing around with adding it to my grilled cheese. I slather it on the slices of bread before toasting them in the pan. It gives the bread a lot of color and flavor, and it pairs well with Muenster and smoked gouda. I really don’t understand how it’s so good—all I know is Fila Manila’s got it down to a science.Get the Recipe:Seared Shrimp With Kare-Kare ButterChef Harold Villarosa turns the Filipino staple kare-kare into a peanutty-buttery condiment perfect for spooning over any shellfish.View RecipeExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-17", "author": ["Condé Nast", "Harold Villarosa As Told To Tiffany Hopkins"]}