{"id": "3310c0e480322cd8c873384314e5d8ef", "url": "https://www.bonappetit.com/story/leftover-panettone", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Make Panettone Bread Pudding Out of Leftover Panettone  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere's One Great Panettone. With All the Rest, Make Bread PuddingStop staring down your staling loaf and do something about it.By Molly BazDecember 23, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAt this time of year, the front display of so many grocery stores across the United States is piled high with beautifully wrapped boxes of supremely disappointing panettone. It’s the holiday season’s biggest culinary let-down. Dry, cottony, overly orange-scented, packed with dried fruit. Such promise! Such failure!If you’ve never encountered one, panettone is a large, sweet, cylindrical loaf of bread-like cake (or cake-like bread) that originated in Milan and is consumed almost exclusively during the holiday season.There is one—and only one—panettone in this world for which I have love in my heart. It is expertly crafted in San Francisco by a man named Roy and it is utterly perfect: moist and rich, but not overly sweet, with a soft, webby crumb, and a smattering of dried fruit, just as it should be. It’s best consumed by ripping off a large chunk of tender bread and eating it on its own.The only panettone that matters IMO.\nPhoto by Ted CavanaughIn the absence of Roy’s, however, the only right decision is to turn panettone into panettone bread pudding and to eat it for breakfast. Soaking sub-par panettone in a rich custard turns what is often a dry bread into a creamy pudding. And since the the loaf itself is overloaded with dried fruit and citrus zest, you don’t even have to fuss over flavorings. Instead, the custard is just a simple mixture of eggs, sugar, and half-and-half.Panettone bread pudding is a cozy Christmas morning breakfast and the perfect solution to the annual “what should we do with all the rest of this panettone?” conundrum. And now that we’ve solved what is surely your most pressing holiday dilemma, we wish you a very happy, stress-free holiday.Get the recipe:Panettone Bread PuddingSo you just ate a a delicious slice of panettone. Congratulations! Now you need to figure out what to do with the rest of it. View RecipeExplore Bon AppétitChristmasBreakfastBread PuddingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-23", "author": ["Condé Nast", "Molly Baz"]}