{"id": "331c3948ab1bda5f9737f410384b6ccc", "url": "https://www.bonappetit.com/recipe/spiced-chicken-and-dates-with-endive", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Spiced Chicken and Dates With Endive Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueSpiced Chicken and Dates With EndiveBy Kendra VaculinFebruary 8, 20224.6(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Kendra VaculinEmailPinterestPrintEmailPinterestPrintThis fresh, crunchy dish walks the line between lettuce cup dinner and big salad. Jarred red curry paste is the star of the show, lending the ground chicken mixture all the complexity of aromatics like lemongrass, garlic, coriander root, and shallot without a whole lot of chopping.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketWooden Spoon$6 At AmazonLarge Skillet$84 At AmazonStainless Steel Mixing Bowls$26 At AmazonIngredients4 servings⅓cup raw almonds4oz. Medjool dates, pitted, coarsely chopped (about ½ cup)3Tbsp. vegetable oil1lb. ground chicken4scallions, white and dark green parts separated, thinly sliced on a diagonal11\" piece ginger, peeled, finely grated2garlic cloves, finely grated½tsp. crushed red pepper flakes1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more2Tbsp. plus 1½ tsp. red curry paste2large or 3 medium endive, leaves separated½cup mint leaves, torn if largePreparationStep 1Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 8–10 minutes. Let cool; coarsely chop.Step 2Place dates in a small bowl and pour in ½ cup hot water to cover; set aside.Step 3Heat oil in a large skillet over medium-high. Arrange chicken in skillet in an even layer and cook, undisturbed, until golden brown underneath, about 5 minutes. Add white parts of scallions, ginger, garlic, red pepper flakes, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and cook, stirring constantly and breaking chicken apart with a wooden spoon, until combined and chicken is no longer pink, about 1 minute. Add curry paste and cook, stirring constantly, until chicken is evenly coated, about 1 minute. Add reserved dates and soaking water and cook, stirring often, until liquid is evaporated, about 1 minute. Remove from heat and stir in almonds and dark green parts of scallions. Taste and season with more salt if needed.Step 4To serve, arrange endive on a large platter. Spoon chicken mixture over and top with mint.How would you rate Spiced Chicken and Dates With Endive?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleClassic BA fusion dish! The curry-spiced chicken worked well with the dates. I also cooked up some sticky rice to temper the spice heat and add a bit of bulk. I used the endive leaves to scoop and eat the mix. For slight modifications, I used torn basil leaves rather than mint and slivered almonds. Note that every Thai curry paste is a bit different. Add the paste, pepper flakes, and salt to taste. As a small matter, I found the phrase 'arrange the chicken' somewhat strange for ground meat (as opposed to chicken pieces). Spread, right?Eric W.Durham, NC3/16/2022This recipe is so quick and so delicious.  I am making it again tonight for dinner....only adding more endive and a little more heat.PauletteVirginia3/9/2022Delicious. I added chili crunch for more spice.Anonymoussanibel, fl3/7/2022This is our new favorite recipe. Sweet and savory, fast and easy to make, and the endives make it fun to eat! Made it twice in one week.. anticipate making it on the regular going forward! Abigail N. Oregon3/4/2022Delicious combination of flavours and very quick.Valerie Victoria BC2/27/2022Loved this and the flavors.  One of the best recipes I’ve made in a long time ErinLong Beach ca2/20/2022So flavorful and delicious! Wasn’t able to find endive at the store so swapped for butter lettuce. They were a bit flimsy and messy but oh so good, lettuce cups!susan bentsenSeattle, wa2/19/2022Explore Bon AppétitDinnerWeeknightEasyGluten-FreeDairy-FreeSaladStir-FryGround ChickenChickenPoultryEndiveChicoryLeafy GreensVegetableDateDried FruitFruitMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}