{"id": "332f5bfdaa7686f549233ded61983ef0", "url": "https://www.bonappetit.com/story/track-your-trash", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Low Waste Living: Here's Where to Start | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWant to Reduce Your Waste? Do This First. Before you stock up on a bunch of reusable products, figure out what waste you're replacing. By Aliza AbarbanelOctober 24, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn It’s Getting Hot in Here, Healthyish assistant editor (and aspiring low-waste disciple) Aliza Abarbanel walks us through one thing we can do each month to adapt our lifestyles and pantries for a pre-apocalyptic world. Up first: Taking a trip through our trash cans to gain a new perspective on what low-waste looks like.The ProblemI don’t have to tell you why we’re here. With all the bleak environmental studies, ominous breaking news updates, and Greta Thunburg memes, we’ve got climate change on the brain...pretty much all the time. Sweeping reform lies in the hands of corporations and countries, but cutting down on trash is one way to enact change as individuals. So here we are carrying carrying our reusable totes and wondering what to do next. There’s a seemingly endless parade of so-called eco-friendly products on the market, from shampoo bars to silicon bags, but before we start spending on all those chic, well-branded alternatives, we have to think about what waste problems we actually need to solve. There’s no point in hoarding stainless steel straws if you never used the plastic ones in the first place.So how do you figure out which habits are worth changing—and what products are worth buying? For the first installment of It's Getting Hot in Here, I'm challenging you to take a trip through your trash can (I promise, it’s not as gross as it sounds). Once you know what you’re throwing out, you’ll know where to spend your money on sustainable replacements.The ChallengeTrack everything you’re tossing and recycling for one week. (Yep, we’re also aiming to reduce our recycling, which I will explain more below.) If you’re already composting, that’s great! No need to include those onion peels, but if your food scraps end up in the trash can, add them to the list.Know right now that you’re probably not going to eliminate all trash from your life, and that’s okay. This challenge is like setting up a budget for waste instead of money—you’re still going to spend (a.k.a. throw out) something, but you can choose when to take the hit.Step 1: Make a list.Sure, you could grab some gloves and actually dig through your bin at the end of the week, but avoid the mess (and probably the single-use plastic gloves) by writing things down as you go. Put this list somewhere you won’t forget about it, like on the fridge or right above the trash can, so tracking can become a seamless part of your routine. Use a note on your phone to tally up anything you toss while away from home, then update your tracker before bed to leave no disposable coffee cup behind.Step 2: Sort your waste.Divide up your list into three categories: Trash, recycling, and would-be compost (if you don’t use a compost bin).Obviously, straight-up trash is the biggest problem to focus on here, but plenty of stuff we usually toss in the bin can actually be composted or recycled. Compostable material varies depending on the capacity of your compost site, but organic materials like coffee grounds, produce scraps, and non-greasy foods are almost always fair game. If your compost gets picked up curbside and processed at major plants, things like bones and cooked leftovers are okay to include too. If these rules seem complicated, don’t fear: We’ll get into this more in a future column.Recycling may feel like the responsible move, but it’s important to track that too because most of it ends up in the trash due to contaminated shipments and recycling plant restrictions. A particularly bleak 2017 study found that only 9% of plastic actually gets recycled. Also, a lot of our recycling is aspirational: Plastic shopping bags and lined to-go cups aren’t just unrecyclable—they contaminate shipments and risk the whole bundle getting rejected. So while it’s possible your stuff will get recycled, reducing and reusing should come first.Step 3: Make a game plan.Circle any items appearing on your list more than once, then tally up the repeat offenders to figure out which changes will have the biggest impact. Start by seeing if you can repurpose what you already own, like reaching for absorbent kitchen towels instead of paper towels. Then think about which reusable products you’ll actually use the most, like opting for a travel thermos to take to your usual coffee shop or ditching plastic wrap for bee’s wrap. Finally, examine store bought items you might want to make at home to cut down on packaging, like nut butter granola bars or cashew yogurt.Why It WorksCutting down on your trash means there’s less waste going into landfills, which are the third-largest source of human-related methane emissions in the U.S. after natural gas and petroleum systems and agriculture. (Methane, a potent greenhouse gas, traps heat in our atmosphere at 34 times the rate of CO2.)But the real point of this challenge is to learn about our habits, because we have to understand our waste problem in order to fix it. In future columns, we’ll explore topics like turning food scraps into delicious dishes, cleaning without a million paper towels or clunky plastic spray bottles, and composting for people who think they can’t compost (yes, even you with the cramped apartment and no outdoor space). Come for the occasional existential crisis about the environmental impact of quesadillas, stay for actionable advice that’s sustainable for your life and the planet. We’re gonna get through this together, and nobody’s going to have to give up cheese forever.Explore Bon AppétitHealthyishIt's Getting Hot in HereessayRead MoreLifestyleCould Zero-Waste Stores Be the Future of Retail?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-24", "author": ["Condé Nast", "Aliza Abarbanel"]}