{"id": "3340c27b6bb28c84d2f54484c55fd8bc", "url": "https://www.bonappetit.com/story/hot-sauce-expo-2019-joy-pain-puke", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Joy, Pain, and Puke at the 2019 Hot Sauce Expo | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJoy, Pain, and Puke at the 2019 Hot Sauce ExpoThe most fun—and hardcore—food convention I’ve ever been to.By Alex BeggsPhotography by Amy LombardApril 16, 2019FacebookTwitterEmailPhoto by Amy LombardFacebookTwitterEmailThis story contains some explicit language. It’s not that big of a deal. I’m not going to censor it behind &?$!, so shield your eyes now.Welcome to HellllllllllllllImagine taping over the second half of your Clockwork Orange VHS with Mad Max. That’s John Dilley’s outfit. Knee-high leather motorcycle boots covered in straps, leather pants, fingerless leather gloves, and a black derby hat. John makes Defcon hot sauces to douse your chicken wings in. At his booth at the 2019 Hot Sauce Expo, I bravely try the Defense Condition #3: Mild Wing Sauce, which is tangy and mostly buttery. He tells me, his gray wiry eyebrows curling up at the edges, that his drunken friends are his “test dummies” because there’s no one more honest than a drunk. His second hottest sauce, Cluckwing Orange, comes in a bottle with John’s face Photoshopped into the Clockwork Orange poster. The scorpion pepper catches me in the throat and I cough like it’s my first hit of weed. I’m ready for more.Contrary to appearances, John is a sweetheart.\nPhoto by Amy LombardThe last time I was in the Brooklyn Expo Center I took home cutely packaged 100 percent date syrup and walked around with a mango probiotic popsicle. No one was puking. The Hot Sauce Expo has more in common with a Thrasher concert. Gigantic speakers are blasting rock and metal. Tattoos take up more skin than clothing. I lose count of all the beards I see that are also braided. Everyone is sweating and carrying cartons of Farmland Fresh whole milk. I’m fucking psyched, and I don’t even care that deeply about hot sauce. Don’t get me wrong—I love heat. But I love people more. I love obsession. And I love Metallica.I think most people here know that hot sauce pain doesn’t compare to real pain. Hot sauce pain is cute. Hot sauce pain is pleasure. It might linger for 15 minutes or come back to haunt you in the middle of the night, but it won’t last. This is the thinking that led me to try 47 hot sauces in the six hours I spent at the Expo. I didn’t touch the milk, like some kind of pussy! I packed coconut cookies! I am a PRO. Here are the moments I’ll treasure forever.Everyone is sweating here.\nPhoto by Amy LombardProprietors of Doom.\nPhoto by Amy LombardThe Right Hand of DoomHellfire Hot Sauce’s booth is where I find the largest gathering of braided beards. Everything is branded by Satan. “What’s the best sauce?” I ask a man with long, bushy brown hair and kind eyes.“You mean the hottest?”“No, the best.”“Well the hottest, you don’t want that one, it’s bad. It’s just terrible.”So I try Blueberry Hell, which he tells me is “good on ice cream and pancakes.” It’s spiked with Carolina Reaper (the hottest chile pepper in the world), so no, it’s not sweet. Then I try the tropical Devil’s Gold, which combines four brutally hot peppers with cheerful pineapple and papaya. My tongue burns for ten minutes after, the skin under my eyeglasses sweats (a new place for sweat and me)—this is only a 5/10 from Hellfire.I spoke to two friends who tasted Doom, immediately puked, and loved every minute.\nPhoto by Amy LombardThe hottest Hellfire sauce, Right Hand of Doom, is, according to word of fiery mouth, the hottest sauce here today. Released in March, it has a 6.66 million Scoville rating. “A DEMON SLEEPS INSIDE THIS BOTTLE.” It is officially licensed by the movie Hellboy. It costs $17.98. The horned hero appears on the label, his pec veins bulging. The Hellfire guys admit it doesn’t taste good. “People throw up, pass out—but they love it,” says my brown-haired friend. People make pilgrimages to taste it. When I see a man in a billowy blue windbreaker buying some, I ask how he feels. Darren takes off his ball cap and shows me his bald head, which is covered in beads of sweat like a can of condensating Coke at the beach. “I came from Coney Island for this!” he tells me proudly, his eyes bugging out of their sockets.Tahiti Joe came all the way from Florida (obviously).\nPhoto by Amy LombardThe Man from West Palm BeachTahiti Joe is here, in the flesh. By which I mean, he is shirtless, unless you count a black-and-red pepper-printed vest as a shirt. It frames his white chest hair, his tanned skin, and his shell necklace. Joe reminds me of my first boss, the manager of an indoor pool, because they both have yellow ponytails and hate Hillary Clinton. Joe has some delicious, sweet glaze-like sauces, and I sample Mango Meltdown and Apple Ass with veggie straws. His best-selling sauce, TropiGarlic, is already sold out (it’s fantastic, extremely garlicky). I take a moment to appreciate Joe’s alternative labeling for some sauces, like Camel Toe, featuring a busty cartoon woman modeled after Joe’s sister-in-law, and Shart, because it’s named Shart. He sells one called Trumped Up for America, and another called hilLIARy Not for President sauce, both of which have a stale taste.Literally.\nPhoto by Amy LombardDrink from the Fountain of Hot SauceAt the Peppers.com booth I meet the famous Chip Hearn, who is wearing a chicken hat that’s seen better days, its legs dangling over the side of his head. Chip is wearing a Hawaiian-print shirt and a gold chicken wing necklace. There are droplets at his feet, and I can’t tell if it’s sweat or spit that spouts from his mouth when he speaks (passionately). “I look at spicy as flavorful,” he tells me.Chip, pontificating.\nPhoto by Amy LombardChip sells his own Georgia peach sauce, but he is a curator of other peoples’ sauces too. He hands me a bottle of a favorite, Guava Gator, which I need to sample on turkey meatballs. He knows it’s a good one when he experiences a phenomenon he calls “mouth surfing”—when the flavor of a sauce transforms on the tongue.Later that afternoon, Chip had changed shirts. Please note the wing bling.\nPhoto by Amy LombardThe Mack Daddy“If I’m the godfather,” says Chip, “then Sean is the Mack Daddy.” He’s talking about Sean Evans, the host of First We Feast’s Hot Ones, in which celebrities are interviewed while eating wings dressed in increasingly hotter sauces. When Sean drops into the Expo, crowds swarm him for selfies and hot sauce makers shower him with sauce offerings. “This is Satan’s blood! You have to try it, it’s ten million Scoville!” “It’s actually killed a person in Wales, you’ve got to try it!” The maker of Clark and Hopkins tells me that when his Assam sauce was featured on Hot Ones, he sold 800 cases in six weeks. Booths tape handwritten signs next to bottles, “As seen on Hot Ones Season 2!”Sean Evans and fans.\nPhoto by Amy LombardI catch Sean for a few minutes outside, near the Jack Daniels cornhole setup, and he says the Expo gets younger and younger every year. He points out that his show has made hot sauce more mainstream, sure, but so has the rise in spicy snack foods (this year Doritos launched a Flamin’ Hot flavor). The people who are into hot sauce are drawn to “extreme things,” he notes. “If you just walk around here you can see, it’s kind of like a Slayer concert.” He points to a guy nearby with Megadeth-long hair. “You know how sometimes dogs look like their owners? These hot sauce makers look like their hot sauces.”Queen Majesty’s Charcoal Ghost and my weird wrists.\nPhoto by Amy LombardSauces, ReviewedOne of Sean’s favorites at the show is Queen Majesty’s Scotch Bonnet and Ginger, a delicious sauce that brings fire from chile pepper and warmth from ginger (and sweetness from onions). But my favorite was their new Charcoal Ghost, which has this deep plum backbone and then chocolatey heat from pasilla negra and chipotle chiles. Erika Diehl, the maker, knows what she’s doing.Char Man, from Ojai, California, makes only three sauces and they make them well.\nPhoto by Amy LombardMore of my faves: Char Man’s verde (tangy jalapeño, minimal ingredient list, makes my upper lip glisten); Hank Sauce’s cilanktro (super vinegary and garlicky); Clark and Hopkins’ Laos (heavy lemongrass, funky dried shrimp, ginger, and apple cider vinegar); Big Red’s God’s Wrath (the Scorpion pepper strikes again); Ghost Scream’s chile garlic jam (sweet heat); and High River’s Cheeba Gold (peaches and...mustard?).By this point, I was really starting to identify with the ‘Dirty’ bin.\nPhoto by Amy LombardThunder JuiceAt High River Hot Sauces, I meet Chris Caffery, whose straightened blond hair pokes out his trucker hat like a badass scarecrow. This man is a rockstar. If you had to guess which rock band also makes hot sauce, what would you guess? I’ll give you a hint. DA DA DA DAAA DA DA DA DAAA DA DA DA DAAA. That’s me wailing “Carol of the Bells” by TRANS-SIBERIAN ORCHESTRA, friends! That’s right. I met a seasonal rockstar! I swear, this Expo is the BEST.Milk, everywhere.\nPhoto by Amy LombardHigh River makes Thunder Juice, which I heard a man in the crowd describe earlier as “still sweating my ass off from.” I taste a tiny drop on a plastic spoon and immediately break out in face water. I don’t remember what it tasted like, other than straight heat. Fifteen minutes pass and then I feel a fire within. Above my stomach, below my esophagus. I feel BAD. I zoom to the restroom and take some deep breaths in an honestly very clean toilet stall; this is the only place at the Expo where you can sit down. I remember the smashed and spotted banana at the bottom of my bag and yes, I eat it while sitting on the toilet. Immediately I feel better.Reaper madness.\nPhoto by Amy LombardA Face Full of Carolina ReapersA ponytailed hot sauce maker in a patch-covered denim vest is standing in front of me in the crowd waiting for the Carolina Reaper–eating contest to begin, the grand finale. He sees a friend and tells her, “I can’t wait for this to be done.” Five minutes later, he’s on stage screaming: “ARE YOU MOTHERFUCKING READYYYY!” We are! The crowd goes wild. The peppers are glowing cherry red, like Snow White’s apple and just as poisonous. Man was not meant to eat this.Yvonne!!!!\nPhoto by Amy LombardThe winner—whoever eats the most peppers (in weight) in 60 seconds—receives a giant check for $1,000. But the real winner is Yvonne Tortorelli, 32, who comes in third with 71 grams (the winner, Wayne Algenio, ate 95). She was the only woman in the competition, and when Yvonne is on stage, there is a deafening cheer. YVONNE IS OUR HERO. Chugging a half gallon of milk, her eyeliner smudged to hell, covered in a wetness I can’t identify, Yvonne deserves that damn check. Offstage, she follows her girlfriend’s advice and pukes her guts out. In the backroom for the competitors. Outside. Everywhere. Yvonne marked her territory with bright red barf. “As long as you throw up,” she tells me, “your ass won’t burn.”The crowd clears out before the winner is crowned, the final grams announced. They aren’t here to see the flame-covered trophies dispersed. They’re here to witness pain, and to feel it, for just a little bit.I...forgot to mention the Chihuahua beauty contest.\nPhoto by Amy LombardExplore Bon AppétitHot SauceEventsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Beggs", "Amy Lombard"]}