{"id": "33691f47696229e40594a31d704c1b5b", "url": "https://www.bonappetit.com/story/sunday-speed-cleaning-projects", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "5 Sunday Speed-Cleaning Projects for Messy People | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Sunday Speed-Cleaning Projects for Messy People (Like Me)Easy-to-follow steps for tackling the messiest areas of your house quickly—and for good!By Hilary CadiganNovember 5, 2018FacebookTwitterEmailIllustrations by Igor BastidasFacebookTwitterEmailThis story is part of the Healthyish Guide to Sunday, a compilation of recipes, suggestions, and obsessions to make the first day of the week your favorite.Sunday is for waking up late, looking at the ravaged interior of my home, and sinking into deep, dark despair. Sunday is the day I have the least to do and, consequently, the most guilt: I can’t pretend I’m too busy to vacuum around the litter box or tackle that weird pile of t-shirts and orphan socks and hairballs that’s been building up in the corner of my closet since June. Sunday is feeling overwhelmed, giving up, and retreating to the couch to rewatch the tempura episode of Japanese Style Originator. I am Hilary, and I am a Messy Person. Cleaning, for me, is a struggle and never a pleasure, and the hardest part of all is knowing where to start when literally everything needs to be done.“A messy house can be indicative of a messy mind,” says Joanna Teplin, strumming my pain with her fingers. As a certified Clean Person and cofounder of The Home Edit, a home organization company based in Nashville, she and her business partner, Clea Shearer, live in clutter-free houses with exactly zero weird junk piles. But they say they understand my struggle—and even how to solve it. “The key is to start very small,” says Teplin. “That way, you’ll reap the benefits quickly, build up your confidence and stamina, and feel encouraged to keep going.”In that spirit, I identified the five most anxiety-inducing areas of my house and asked Teplin and Shearer for key steps that even the messiest-minded person can use to tidy them up.  These steps are simple but impactful, and unlike vacuuming or dusting, they actually last. Best of all? Each one takes less time than it takes to mess it all up again. And you only need to tackle one each Sunday, which means the rest of the day is all yours, despair not included.Illustrations by Igor BastidasThe container drawerWhere ne’er a lid and a container shall meetCompletely empty out the cupboard. Match each lid to a container. Find uses for topless containers (maybe they can hold random granola bars or your loose tea bags), then eliminate the rest of the unmoored vessels and tops, along with any that are irreparably stained, stinky, or broken. As for the remaining collection, it’s important to ask yourself: Do I really need all of these? If not, donate.Store the lids and containers in separate areas to avoid overcrowding. A few options:Prop up lids using a plate rack or sectioned divider then arrange containers alongside.Get an under-shelf basket that can create another level to your cabinet. Categorize the containers by size on the original shelf, then store the corresponding lids in the basket.Store lids in shallow bins with labeled categories, then stack the corresponding containers next door.If you have lots of space to spare, go with the easiest solution: Store your containers as matching sets and stack ‘em up neatly, but know that you’ll always have to return them to this position, lest you risk once again descending into total chaos.Illustrations by Igor BastidasThe bottom of the closetWhere all clothes, shoes, and scarves go to die heavenIf you tend to throw your clothes on the floor instead of folding them neatly and returning them to their place (🙋🏻), designate a certain hamper as purgatory for clean-ish clothes. This acts as a tidy-looking storage space until you’re ready to return them to their intended home while preventing them from piling up on the floor or some random chair.Store shoes, too often strewn about, vertically. String a shoe organizer over the inside of closet door or, if you have lots of shelving, stack them in their shoe boxes (or, if you've recycled those, space-saving acrylic boxes).Sick of looking at that scarf in July or your bathing suit in February? Create seasonal bins for summer and winter, stow them somewhere out of the way (like under the bed or on that too-high shelf at the top of your closet), then swap them when the weather changes.The fridgeWhere something might very well be rottingTake everything out of the fridge and toss anything that’s no longer edible or identifiable. Then remove the shelves and wipe them down with cleaning solution (try this one if you’re the DIY type!). Tuck an open container of baking soda towards the back while you’re at it—this will absorb unwanted odors.Designate a spot for leftovers (and check it often) so you won’t forget about them until the entire house smells like week-old takeout.To cut down on the clutter, invest in several acrylic containers for your fridge staples (like yogurts, grapes, kale, bags of nuts, jams, etc.) and give them permanent homes (and labels!) in your fridge. Not only does it keep your fridge clean and uncluttered, but these defined spaces will help you easily take stock of your items before heading to the grocery store. Want to get really fancy? Snag a turntable for your condiments: The spinning motion will help you assess your stock and avoid reaching into the back of the fridge for the harissa.Illustrations by Igor BastidasThe pantryWhere there may or may not be something that can become dinnerFeeling ambitious? Transfer your dry goods (grains, lentils, beans, the like) into tall, skinny containers. You can pack more items onto a shelf and spot exactly what you’re looking for more quickly.But if you don’t want to come home from the grocery store and funnel everything into canisters (...can’t blame you), opt for open bins to group your bags and jars by category, like pastas, canned beans, canned tomatoes, snacks, etc .A three-tiered riser will help you take advantage of vertical space without the precarious tower of cans and spice jars.Illustrations by Igor BastidasThe bathroomWhere there are three nearly-empty bottles of the same conditionerRepurpose a hanging spice rack to display all of your everyday items instead of squeezing them onto the counter.Divide your toiletries by purpose (hair, teeth, skin care), then store them in separate stackable bins under the sink. Small items can even go into a divided turntable.Create extra space by sticking self-adhesive pods inside your cabinet door or medicine cabinet. They’re the perfect size for holding upright items, like combs, toothbrushes, and nail polish, that take up too much room otherwise.Teplin and Shearer’s first book, The Home Edit: A Guide to Organizing and Realizing Your House Goals comes out in March but is available for preorder now.Read MorecultureStop Being Gross and Learn How to Clean Your KitchenBy Jolie KerrRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Hilary Cadigan"]}