{"id": "336f270326afa365ed57890ae3c5cf8c", "url": "https://www.bonappetit.com/recipe/broccoli-and-date-salad", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "Broccoli Spoon Salad With Warm Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBroccoli Spoon Salad With Warm VinaigretteBy Beverly KimMarch 30, 20204.8(115)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis salad puts all the best textures on a spoon: crisp, raw broccoli; chewy, sticky dates; and crunchy toasted pistachios. The ras-el-hanout, a Moroccan spice blend featuring aromatic and warm spices, adds a smoky depth to the bright citrusy dressing, which soaks into the broccoli as it sits. Don’t have ras-el-hanout? Garam masala, baharat, or curry powder will also work. And if you’re a meal prepper, this is a great make-ahead salad—it only gets better with a little time.Ingredients4 servings6Tbsp. grapeseed or other neutral oil2tsp. ras-el-hanout1garlic clove, finely grated2Tbsp. fresh lemon juice2Tbsp. white balsamic vinegar or white wine vinegar1Tbsp. honeyKosher salt, freshly ground pepper¼cup raw pistachios1small shallot, finely chopped1medium jalapeño, finely chopped6cups finely chopped broccoli florets and peeled stems (from about 1 bunch)1cup finely chopped cilantro⅓cup finely chopped pitted datesPreparationStep 1Heat oil, ras-el-hanout, and garlic in a small saucepan over medium-high until fragrant, about 2 minutes. Remove from heat and whisk in lemon juice, vinegar, and honey. Season vinaigrette with salt and pepper; set aside.Step 2Toast pistachios in a small skillet over medium-low heat until golden brown, about 4 minutes. Transfer to a cutting board and let cool; finely chop.Step 3Toss pistachios, shallot, jalapeño, broccoli, cilantro, and dates in a medium bowl. Drizzle dressing over and toss to coat. Taste and season with more salt and pepper if needed.Step 4Do ahead: Salad can be made 1 day ahead. Cover and chill.How would you rate Broccoli Spoon Salad With Warm Vinaigrette?Leave a ReviewTell us what you thinkReviews (56)Back to TopTriangleYour new website has an ad over the actual recipe so you can't see it on this recipe or any of the recipes any longer.  Poor IT design flaw.LJ AmeriAsianDenver, CO3/9/2022I freaking love this recipe. Have now made it many many times over the last few years, and it never disappoints. It also led me to make my own Ras El Hanout spice mix as I couldn’t find it easily, and turns out I had all the necessary ingredients on hand (you might, too!). A great side for Thanksgiving, great side for a potluck, and I’m planning to make it with some chewy grains like farro or Jamir to make a more filling lunch salad thing. Madison L. Austin, TX2/3/2022This recipe lends itself well to substitutions. I was trying to not add more to my already packed pantry/fridge, so I used curry powder for ras-el-hanout, pecans for pistachios, green onions for shallot, thai chilis for jalapeño, basil for cilantro, and raisins for dates. A different flavor profile than the original recipe, but it is a great base to play around with. I really loved the finely chopped broccoli versus the larger pieces usually found in broccoli salad. Looking forward to making this again as written. AnonymousTallahassee, FL1/24/2022What is the nutrition information?SabrinaSanta Barbara1/11/2022Very tasty.MikeNew York1/9/2022I am not usually a fan of raw broccoli, but the vinaigrette (mainly the strong ras-el-hanout) went along really well with the broccoli. Although quite spicy, the taste was phenomal. I had to make an extra serving of the vinaigrette (repeating step 1) to go along with the large amount of broccoli. Would definitely recommend this recipe, super simple to put together!CocoPhoenix, AZ1/2/2022Is this supposed to be enjoyed chilled or heated? It looks like a cold salad but the title suggests warm vinaigrette. AnonymousDelaware, Ohio11/20/2021Scrumptious!! Used curry powder, added 2 sliced radishes, and sautéed sliced scallions (in lieu of shallot).Anonymous9/6/2021Delicious!  I had to slap hubby’s hand to keep him from finishing the whole thing! Used garam masala and raisins since that’s what I had. Will make it again and again. Jill NiellTampa,FL8/12/2021This salad is delicious. Made my own seasoning mix for the taste el hanout. Didn’t have dates so used raisins. Have made it several times and adjusted to ingredients I had!AnonymousKansas 6/17/2021DELICIOUS! I didn't have a shallot or a jalapeño or ras el hanout (why the hyphens, copy desk?). I substituted jerk seasoning and agave because my honey has crystalized. Also did not feel like chopping a cup of cilantro and I had walnuts instead of pistachios, and it is amazing. If it were not so late, I would make some quinoa or barley or farrow to add. Will try that next time or with any leftovers.sfveggieSan Francisco6/9/2021THE RAS EL HANOUT IS AMAZING IN THIS!! such a great flavor!Anonymous2/14/2021I thought it was good but I wasn’t sure how fine to chop the broccoli and left the chunks too big. The picture is a little deceiving, but after making realized it needs to be chopped finer . So will make it again but flavors were good. MariaSacramento 2/4/2021gotta say I have been cooking new recipes every day of this ding dang pandemic and this is an immediate 5/5 - minimal effort, maximum flavor, healthy, simple goodness. the texture is great & it makes me happy. thank you ! alyssaLos Angeles, CA1/25/2021This is one of those recipes that you know is going to be seriously good the second you start making it. YUM! I used graham masala because that’s what we had on hand and I’m excited to try with other spices especially baharat which I think will be so delicious. I made it for dinner with simply baked flounder and rice and it made the most satisfying dinner bowl I’m so excited to make it again!RCNYC1/6/2021Explore Bon AppétitSaladBroccoliVegetableDateDried FruitFruitPistachioNutQuickEasyWeeknight MealsSideVegetarianDairy-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-30", "author": ["Condé Nast", "Beverly Kim"]}