{"id": "3373c5c2e39996077119bea69b248e6a", "url": "https://www.bonappetit.com/recipe/date-and-pink-peppercorn-pasta", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Date and Pink Peppercorn Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueDate and Pink Peppercorn PastaBy Mehreen KarimMarch 15, 20225.0(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintThis recipe, inspired by the pink peppercorn mafaldini at Brooklyn’s Lilia, celebrates the harmonious pairing of fruity pink peppercorn and sharp cheese. The chopped dates might make you think twice, but their nutty sweetness and chew balance the pasta sauce’s sharper, savory flavors.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidLarge Skillet$84 At AmazonMicroplane$16 At AmazonCitrus Juicer$7 At AmazonTongs$13 At AmazonColander$11 At AmazonHeatproof Measuring Cup$18 At AmazonIngredients4–6 servings12oz. mafaldine or tagliatelle pastaKosher salt1½tsp. freshly ground black pepper3Tbsp. freshly ground pink pepper, divided4Tbsp. unsalted butter, divided4oz. Pecorino Romano, finely grated, plus more for serving10Medjool dates, pitted, finely chopped1Tbsp. finely grated lemon zest1Tbsp. fresh lemon juiceFlaky sea saltPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 2 cups pasta cooking liquid.Step 2Toast black pepper and 2 Tbsp. pink pepper in a dry large skillet over medium, shaking often, until fragrant, about 30 seconds. Add 3 Tbsp. butter; cook, swirling pan, until butter foams, then begins to brown, about 2 minutes. Stir in 4 oz. Pecorino and 1 cup pasta cooking liquid until combined. Add pasta, dates, and ½ cup pasta cooking liquid; cook, tossing often and adding more cooking liquid if needed, until sauce is glossy and coats pasta, about 2 minutes. Add lemon juice and remaining 1 Tbsp. butter; toss to combine.Step 3Divide pasta among plates or shallow bowls and top with lemon zest, more Pecorino, and remaining 1 Tbsp. pink pepper. Season with sea salt.How would you rate Date and Pink Peppercorn Pasta?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerMainEasyQuickWeeknight MealsVegetarianNut-FreeSautéPastaPasta & NoodlesTagliatelleCheesePecorinoDateDried FruitFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Mehreen Karim"]}