{"id": "33771900689935c0094f8f93ce7bd976", "url": "https://www.bonappetit.com/story/how-to-talk-about-the-way-wine-tastes", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "How to Talk About the Way Wine Tastes Without Sounding Like a Jerk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Talk About the Way Wine Tastes Without Sounding Like a JerkYou can talk about wine without annoying yourself and the people around you. We'll show you the way.By Alex DelanyMarch 12, 2019FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailIt’s easy to sound pretentious when you’re talking about wine. As a person who works in the food and booze world, I'm always nervous about crossing a line when I'm describing whatever is in my glass. Despite my best intentions, I sometimes hear wine words coming out of my mouth and have an out-of-body experience. “Hey, uh, you’re sounding a little insufferable, dude,” I say to myself. I don't want to be that guy. And neither do you.And while there's really no need to forth in lofty and obtuse terms about the wine you're drinking to everyone in earshot, learning to talk about the way that wine tastes is still really important. Why? Because being able to describe the qualities you like in wine is the only way that a restaurant server or an employee at your local wine store is going to be able to steer you in the right direction. I'm not going to end up with a high-acid, light-bodied red wine in my glass if I just ask for “red wine.\" Mind reading technology hasn’t been invented yet. That’s the unfortunate truth.The fortunate truth, however, is that you don’t have to sound like a snob to talk about wine. You don’t have to possess an abstract, sommelier-level vocabulary or encyclopedic knowledge of vineyard names. You just have to be able to tell someone what it is that you like to drink. And while that may seem like a daunting task at the moment, it’s actually way easier than you think. All you need to know are a few terms and your own preferences. You won’t sound annoying, and you might even sound like you know what you’re talking about—and you're 100 percent more likely to find yourself drinking something that's right up your alley. Here’s some basic wine terms that'll help you get the grape juice you really want.BodyWe have to use one of the worst words ever to talk about body: mouthfeel. Yuck! But mouthfeel—or how wine feels in your mouth—is what we’re talking about when we talk about body. Some wines have a light body, which feels thinner and more like water in your mouth. These are probably the type of wines you want to drink with super-spicy food, or when you're sitting on a picnic blanket, or when you just want to throw back a few glasses at a party. Other wines have a heavier body, which will feel richer, heavier, and almost silky in your mouth. These are the type of wines that you want to sip on slowly, maybe next to a fire and maybe while stroking your chin and pondering life's more serious questions.Acidity/SweetnessAs is the case with food, acidity and sweetness are always playing off of one another in wine. Most wines will have some degree of both, but how a particular wine tastes will have everything to do with the balance between the two. A wine can have quite a bit of sugar left in the bottle after fermentation, but it might not taste \"sweet\" because it has a ton of lemon-lime tartness that edges out that sugar on your palate; likewise, a wine can have the tiniest bit of sugar that is very prominent because there isn't any acid to balance it out. Regardless, wines that have a lot of acidity tend to taste lively and bright, and have a mouthwatering quality that begs for another sip, while less acidic wines tend to be smoother, denser, and more round.FruitWine is made from grapes. I’m sure you already knew that. But through some miracle of fermentation, wine tastes not just like grapes, but cherries, apples, watermelon, raspberries, peaches, and just about every other kind of fruit imaginable as well. While zeroing in on specific fruit flavors can be a challenge, it's a lot easier to talk about fruit on a spectrum between \"fresh\" and \"jammy.\" The former is going to describe things like summer berries, citrus, tropical fruits, and pretty much anything you're going to want to eat just as nature intended—bright, alive, vibrant. The latter describes fruit that tastes deeper, darker, and more concentrated, almost as though it has been cooked or dried—hence \"jammy.\" Think about the difference between just-picked grapes and raisins, and you'll get what we mean.TanninsThis feels like one of the most obscure and confusing qualities that people describe in wine, but it's actually really easy to understand. Tannins are naturally-occurring molecules in wine that make your mouth feel kind of dried out immediately after you take a sip—if you've ever slurped over-steeped tea, you know what tannins taste like. As a general rule, the longer a wine sits with its stems, skins, and leaves, the more tannic it will be. (That’s why red wines usually exhibit more tannin than white wines.) Tannins tend to give you some pause when you're drinking, where tannin-less wines tend to be more gulpable.You don't need to remember what parcel a wine came from or what kind of barrel it was aged in—you just need to remember what it tasted like.\nPhoto by Alex LauAnd Now, You Talk About WineNow that you've got a little bit of vocabulary to work with, you can start thinking about the wines you drink and what you like (or dislike!) about them. You can build a list of few key terms that describe your dream wine and practice deploying them with abandon. Maybe you start to notice that you like drinking different things in difference circumstances—a fruity, light-bodied red wine with steak, say, but a tannic, full-bodied red with braised beef. Cool! That's great! This will get you a whole lot further than remembering countries or types of grapes, because wines made from the exact same grapes and in the exact same place can taste completely different. But as communicating about wine becomes easier, remember this rule: Talking about wine should be about service, not about showing off. And as long as that's always in the back of your head, you're in the clear.More wine knowledge, right this way:This One Thing Makes Buying Wine WAY Less OverwhelmingI used to be an anxious, freaked-out wine shopper. And then everything changed.View StoryExplore Bon AppétitBasicallyWineAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Alex Delany"]}