{"id": "33a167e4b448203a3380d28f579a304f", "url": "https://www.bonappetit.com/recipe/obe-ata-stew-with-chicken-and-spinach", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Obe Ata Stew With Chicken and Spinach Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesObe Ata Stew With Chicken and SpinachBy Yemisi AwosanOctober 31, 20194.6(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWe've crushed on Egunsi Foods' over-the-top flavorful, West African soups for years, especially the Obe Ata Soup, a bright tomato stew that incorporates floral habanero chiles and bell peppers. Founder ’Yemisi Awosan developed this version, which includes chicken and sweet potatoes and is streamlined for the home cook. Ingredients4–6 servings¼cup canola or extra-virgin olive oil4chicken legs (thigh and drumstick; about 3 lb. total)Kosher salt2red bell peppers, seeds and ribs removed, coarsely chopped1large onion, coarsely chopped2beefsteak tomatoes, seeds removed, coarsely chopped2habanero chiles, stemmed, halved, seeds removed1tsp. freshly ground black pepper2cups low-sodium chicken broth2small Japanese sweet potatoes or yams, sliced into ½\" rounds (or 2 medium Yukon Gold potatoes, cut into 1\" pieces)1small bunch of spinach, stems trimmedCooked rice and sliced chives (for serving)PreparationStep 1Heat oil in a large Dutch oven over medium-high heat. Season chicken with salt and cook (skin side down), undisturbed, until skin is browned and crisp, 8–10 minutes. Turn and cook just until lightly browned, about 3 minutes longer. Using tongs, transfer chicken to a plate (it will not be cooked through).Step 2Cook bell peppers and onion in same pot, stirring often, until onion is golden brown and vegetables are softened, 6–8 minutes. Add tomatoes, chiles, and pepper and cook, stirring often, until tomatoes are broken down and softened, about 6 minutes longer. Transfer to a blender (reserve pot) and pour in broth. Purée until very smooth.Step 3Return purée to pot along with chicken and potatoes. Bring to a simmer over medium-high heat, partially cover pot, and reduce heat to maintain a simmer. Cook until chicken and potatoes are very tender, 45–50 minutes. Season with salt to taste and stir in spinach. Cook, stirring, until spinach is wilted, about 1 minute.Step 4Divide stew among bowls. Spoon rice into soup alongside chicken and chives.How would you rate Obe Ata Stew With Chicken and Spinach?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleThis was a fantastic dish, definitely a keeper. The only thing I changed was adding less than a third of a cup of broth so that it would produce a sauce rather than a soup. The chicken and vegetables emit liquids. \nServed over pasta , it's the perfect cool weather dish. Great flavors of the red pepper, the chili, sweet potato and the chicken. MaraJerusalem, Israel10/18/2021This came out so good!  BUT you have to take your time to develop the flavors.  This recipe is missing a lot of important spices.  I added Garlic, Madras Curry Powder, Smoked Paprika, Cumin, and Cayenne Pepper and a lot more salt and pepper.  In total, I let it simmer on super low heat for about 4 hours to braise the chicken and get that 'fall off the bone\" goodness. Also added some Thai Basil for some sweetness. The end goal is Spicy, Smokey, and Sweet.  Would make it again.Bobby FlayBoston10/15/2021I absolutely LOVE this recipe. Was a hit amongst spice enthusiasts as well as those with a more sensitive palate. However, I wasn't able to achieve that robust, sexy red color so i added some tomato paste and it worked great. Also, I did end up adding 5 cloves of garlic, 1 1/2 tsp of cumin, 1 1/2 tsp of curry powder, a little basil and parsley. I didnt have any chicken broth on hand so i used a can of cream of chicken soup which gave it a more rich creamy stew like consistency. Once it was finished, I topped mine with some greek yogurt, chives, cilantro and lime and scooped it up with some garlic bread. I know i modified this recipe a bit here and there, but holy moly it was amazing and such a hit. Thank you for sharing the recipe and inspiring more African cuisine! SamOlympia, WA2/10/2021I've seen people in other reviews saying this is bland. Not so! If you take your time with it, you end up with a beautiful, subtle dish. AnonymousMontreal, QC2/3/2021A little too spicy for my liking. Ended up adding some honey to the simmer and mixed in some yogurt when serving to help offset it. Might only use 1 habanero and some offsetting seasonings the next time. FWIW, I'm generally a heat wimp, so maybe it was dumb of me to make this. \n\nAnonymous11/9/2020Sadly I have to agree with some other reviews- it just wasn't really flavorful at all. It was spicy but still somehow bland and I followed the recipe to a T. The chicken is also just kind of cumbersome with the bones. I ended up adding in some curry powder and cumin which helped. All and all, it was good and feels healthy and hearty, but I probably wouldn't make it again unless I borrowed a spice mixture from a different recipe.AnonymousPittsburgh, PA10/8/2020The complete and total absence of any spices other than salt and pepper was a little alarming. The stew came out quite bland. When comparing with other Obe Ata recipes, they use loads spices and herbs, ranging from cilantro and thyme to garlic, ginger, and curry powder. Was this an intentional omission? I have no clue. But if you're gonna make this recipe, I'd encourage you to find another and use their ratios for spices and herbs.AnonymousDenton, TX8/11/2020made this about 800 times, it's so wonderful, ultimate go-tobaiebirdHamilton8/9/2020really really goodAnonymous8/3/2020Made this recipe for my family, followed the recipe to a \"T\" it was so delicious, will definitely be making it again and following this chef, delicious Yemisi Awosan😊AnonymousNew Jersey7/9/2020Made this recipe for dinner tonight with a few alterations due to not having all the right veggies, but it was sooo delicious!! Definitely will be making this again in the futureAnonymousNew Zealand6/29/2020Love this! Have yet to figure out the right timings to make sure that the chicken cooks while the sweet potatoes stay intact, but I think that depends on your dutch oven. I make it in my Le Creuset so it will take a little time getting used to. Also, Habanero is KEY! Second time I made it, I couldn't find Habaneros in any of the stores around me and ended up using two Serranos instead and it wasn't spicy enough. Great recipe!yelenamoveBrooklyn, NY5/24/2020It's a good recipe but the cooking times are way off.  The chicken needs triple the browning time as does the simmering sauce as the 1/2\" yam rounds are nowhere near done after one hour simmering; nor is the chicken.  Add more habanero than is specified.  Kale is a nice substitute for the spinach and holds its texture better.smc5164texas5/18/2020Delicious! I used fried tofu instead of chicken, for a vegetarian protein. The sweet potatoes are what really put this dish over the top!AnonymousToronto4/6/2020This was very Delicious!!!  I had almost 4 lbs of leg quarters & had 4 medium sweet potatoes.  So I also added an extra tomato, bell pepper, and cup of chicken broth to the sauce/blender.\n\nI added 2 bunches of asparagus(because I wasn’t planning to use rice and wanted more volume from veggies) the last 10 min and then spinach at the end.\n\nWorked out GREAT!AnonymousDallas, TX4/2/2020Explore Bon AppétitStewSoups and StewsWest AfricanAfricanChickenPoultryBell PepperVegetableTomatoChileSweet PotatoPotatoSpinachLeafy GreensHabanero ChileWinterFallOne-Pot MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishBraiseKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-31", "author": ["Condé Nast", "Yemisi Awosan"]}