{"id": "33abb39db3396888ad8fd1553cf0a023", "url": "https://www.bonappetit.com/story/vintage-travel-wine-cooler", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "This Vintage Wine Cooler Is My Ultimate Summer Accessory | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Vintage Wine Cooler Is My Ultimate Summer AccessoryIt’s cheerful, chic, and chills pét-nat like a pro. Can your woven beach tote do that?By Aliza AbarbanelJune 10, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Ice-cold rosé is a picnic staple, essential as baguettes or bug spray, which is why as soon as the first warm spring day arrived, I headed to the park with one of these vintage-designed Mondrian-esque plastic coolers.Designed by Richard Carlson in 1980, this vintage travel cooler is equally functional and adorable. (There’s even one in the MoMA’s permanent collection, so you know it’s chic.) The functional bit comes down to a teensy bit of planning: I fill the removable frozen insert with water and freeze it overnight. By picnic time, it’s ready to keep two wine bottles chilled and chuggable all afternoon, which is ideal because my friends and I aren’t going to drink just one bottle of rosé.The math is simple: more coolers = more wine = more fun.\nPhoto by Alex LauI ask everyone else (read: my most responsible friends) to bring the rest of the goodies—strawberries, a jar of Castelvetranos—and we’ll be set for hours, ‘cause I’m not budging for a while. I don’t know about you, but I have two bottles of rosé to sip, and I definitely didn’t battle a bunch of teenage couples to leave before sunset. Now if only I could remember the corkscrew...Buy it: Vintage Travel Wine Cooler, $180 at Coming SoonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingWineRead MorecultureMy Favorite Wine Glasses Are Actually Water GlassesBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-10", "author": ["Condé Nast", "Aliza Abarbanel"]}