{"id": "33b523b5561bced18c12dcd37384c0b7", "url": "https://www.bonappetit.com/recipe/garam-masala-short-rib-roast-with-pistachio-crust", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Garam Masala Short Rib Roast With Pistachio Crust Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 0220 IssueGaram Masala Short Rib Roast With Pistachio CrustBy Sohla El-WayllyOctober 20, 20205.0(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis roast is cooked in the style of American barbecue and has a serious spice-coated crust, like bark on a brisket. Scale this dish to suit your needs by roasting one big bone for an intimate dinner for two or go full Flintstone with a five-bone plate, which will generously serve six to eight. The cooking time and method will remain the same. Call your butcher in advance to reserve this cut and ask for the thickest short ribs they have. This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.Ingredients4 - 8 Servings¼cup garam masala¼cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt3Tbsp. light brown sugar1tsp. MSG (optional)13–5-bone beef short rib plate roast (3–5 lb.)3Tbsp. vegetable oil, divided¼cup reserved Citrus-Ginger Raita¼cup finely chopped raw pistachiosFlaky sea saltPreparationStep 1Line a rimmed baking sheet with foil; set a wire rack inside. Whisk garam masala, salt, brown sugar, and MSG (if using) in a small bowl. Trim any silver skin and excess fat from short ribs and pat dry with paper towels. Rub all over with 1 Tbsp. oil, then generously coat with dry rub, pressing to adhere (you may not need all of it). Place on prepared baking sheet. Chill, uncovered, at least 12 hours and up to 2 days (the longer the better).Step 2Let short ribs sit at room temperature 1 hour before baking.Step 3Preheat oven to 250°. Drizzle 1 Tbsp. oil over meat. Pour 1 cup water into prepared baking sheet and cover tightly with foil. Bake until meat is tender (when you tug at a bone, it should feel like it will slip right out), 4–5½ hours (grass-fed beef will cook faster than grain-fed).Step 4Remove short ribs from oven; increase oven temperature to 325°. Uncover meat. Spread top with raita, then sprinkle with pistachios, gently pressing to adhere. Drizzle with remaining 1 Tbsp. oil; season with sea salt. Roast until nuts are golden brown, 30–35 minutes. Remove from oven; let rest 15 minutes before serving.Step 5Do ahead: Roast (without crust) can be baked 2 days ahead. Let cool (keep covered), then chill. To reheat, add ½ cup water to baking sheet, wrap tightly, and bake at 325° until warmed through, 30–40 minutes.How would you rate Garam Masala Short Rib Roast With Pistachio Crust?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleMade these for Christmas Dinner.  They were delicious, super easy to do and a real show stopper!  Looked exactly like they did in the photos.   How awesome is that?  BrandyHouston, TX12/27/2020These were SO easy, truly delicious and made for a very impressive presentation. The left over Raita was fabulous with naan as well. I used boneless short ribs instead of bone in, same cooking instructions and came out perfect. Anonymous10/30/2020Explore Bon AppétitRibsShort RibBeefMeatMainGluten-FreeRoastThanksgivingChristmasDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}