{"id": "33bf0f52f236e1c2efe7baa61e051496", "url": "https://www.bonappetit.com/story/weighted-blanket", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "This Weighted Blanket Eased My Anxiety and Helped Me Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Weighted Blanket Eased My Anxiety and Helped Me SleepHow I crushed the stress of modern life with a 25-pound blanket.By Catherine CivginDecember 12, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEarlier this year, I started wearing a Fitbit after I got one as a gift, and I learned a few things about myself right away. Like: I don’t burn as many calories in my favorite workout class as I thought. (Sigh.) I’m far too competitive when it comes to step challenges. (Sorry, not sorry.) And I am a very restless sleeper.I’ve always kind of known this was true. I often struggle to fall asleep, I toss, I turn, and, according to my Fitbit, I wake up between six and seven times each night. I was already always searching for sleep-positive products, but, after seeing my Fitbit data, my quest intensified. Whether it be a meditation app on my iPhone or an essential oil diffuser on my nightstand, I probably own it. But of all my sleep-related purchases, my weighted blanket stands alone.For those who have never heard of this cozy commodity, weighted blankets are exactly what they sound like—blankets with additional, evenly distributed weight. This extra weight (which typically ranges between 5 and 25 pounds) provides a firm but gentle squeeze to those snuggled underneath and subsequently calms the nervous system and eases body tension. Because of these therapeutic effects, weighted blankets have long been used by people with autism, but they’ve been gaining popularity with adults with sleep problems like me.I started using a weighted blanket three months ago and since then, my overall sleep has significantly improved. I’m an overthinker, and my thoughts tend to speed up before bed. But after a few minutes underneath my blanket, my heart rate slows, my body relaxes, and I feel literally grounded. I definitely fall asleep faster than I would without it...as evidenced by the fact that I’ve watched significantly less Friends on Netflix in the past three months.Using my weighted blanket also stops me from moving around in my sleep. While in the past I’ve been a chronic side-flipper, it’s now common for me to wake up in the same position that I fell asleep in. Of course, the immobilizing aspect of sleeping underneath an additional 15 pounds plays a role here, but I also don’t feel the need to move as much when I’m swaddled (and relaxed) underneath my blanket.I bought my first weighted blanket on Amazon, but I was quickly converted to the Gravity Blanket, the brand my boyfriend bought. The Gravity Blanket is the holy grail of weighted blankets. It provides all the same benefits of an average blanket, but it’s softer, it stays cooler throughout the night, and its weight remains more evenly distributed. While the Gravity Blanket is more expensive than others, it’s my favorite of the weighted blankets that I’ve tried.For the past three months, I have slept with the weighted blanket almost every night. I have also convinced three friends, three coworkers, and one family member to buy one for themselves. While the idea of being crushed by a 15-pound weight while you sleep does seem a bit counterintuitive at first, I can’t imagine going to bed without my weighted blanket. Now if only I could get one in a travel size…Buy it: Baloo Soft 15lb Weighted Blanket, $170All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishTrendsSelf CareRead MoreLifestyle6 Stress-Relieving Products Getting Me Through Thanksgiving ChaosBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Catherine Civgin"]}