{"id": "33c910f0afa00e26eb12504549ae166b", "url": "https://www.bonappetit.com/story/atrium-los-angeles", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "This Restaurant Nearly Convinced Me to Move to Los Angeles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Restaurant Nearly Convinced Me to Move to Los AngelesAtrium is where it’s at.By Emma FishmanAugust 21, 2019FacebookTwitterEmailPhoto by Jakob LaymanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The last time I was in Los Angeles, my friend suggested we meet for an afternoon cocktail at Atrium, a breezy new bar and restaurant in Los Feliz. She knows me too well.First there was a succulent-filled alleyway leading to the big brick building. Then there were the pastel ceramic planters brimming with tropical leaves, the plush velvet booths, the funky graphic wallpaper, the giant horseshoe-shaped bar with brass accents, and all that California sunlight streaming in. Oh, and a real live tree growing in the middle of everything.Though those BBQ- dusted potatoes with onion dip called me, the vibes alone had me. Two drinks in, the place had me questioning why I haven’t made the move from New York City to that L.A. lyfe.Go there: AtriumExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRead MorerestaurantsMy Favorite Spot for Toast in Toast Town Is Actually a Pizza PlaceBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-21", "author": ["Condé Nast", "Emma Fishman"]}