{"id": "33cc0bfb63ccaf9a5eb5a971c02a330a", "url": "https://www.bonappetit.com/story/vejibags-review", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "These Vejibags Are Keeping My Greens So Fresh It's Scary | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Vejibags Are Keeping My Greens So Fresh It's AlarmingThere's nothing sadder than a slimy bunch of cilantro.By Oset BaburOctober 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailStocking my fridge with greens sounds like a great idea when I’m at the grocery store on a Sunday afternoon, but, by the time Wednesday rolls around, there are deadlines to meet, emails to follow up on, and 154 episodes of The West Wing to rewatch. On Wednesday night, I’ll start guilt-tripping myself: If I don’t use up the veggies in my fridge, they’ll quickly wilt and expire, especially that daunting tub of arugula and those beautiful sprigs of fresh thyme and rosemary.Vejibags are like pillowcases for your herbs.\nPhoto by Chelsie CraigWhen I first came across Vejibags at my favorite homewares store in Boston, I was skeptical that storing my veggies in a wet cloth bag was somehow going to make them last longer. Basically, you run a thick cotton pillowcase (which comes in standard, long, and extra-large), under the tap and wring it out until just damp. Then, you throw in your veggies and place the bag in the crisper drawer in your fridge; when the bag eventually dries out, you wet it again with the veggies still inside. It sounds bizarre, but, according to Sarah Erickson, Director of Marketing at Vejibags, preserving vegetables is all about getting the airflow, moisture, and temperature exactly right. “Think about how fresh produce is displayed at the grocery store—in open coolers, then misted periodically throughout the day,” says Erickson, whose mom invented the bags while running an organic greenhouse in Maine.  “Vejibag creates a similar environment in a crisper drawer. By keeping the bag damp, the you get both a humid environment that also wicks moisture away from the surface of the vegetables.”I first experimented with a standard sized bag and a droopy bunch of cilantro. The leaves weren’t slimy just yet, but I sensed that I had two, maybe three days before a critical ingredient in my guacamole became unusable. Four days and seven episodes of The West Wing later, it magically looked perkier and crisper than it did at the start of the week. Intrigued, I did the same for a massive bag of spring mix, which made it an unprecedented eight days before starting to brown, and a bunch of carrots, which actually survived past two weeks, which is the maximum freshness period Vejibags claims on its website. My only gripe? Machine washing the bags has been only so effective––a few unappealing gray stains remain on the cloth, lettuce bloodstains if you will,  though the bags still work just as well.As a person who often cooks for one, Vejibags have given me something I crave more than a really good bowl of spaghetti carbonara after a long day: the freedom to be indecisive, lazy, and impulsive about what I cook at home, without the unwelcome serving of guilt about wasting good Whole Foods kale. That said, it’s been dangerous for my grocery budget.  More than once, I’ve felt empowered to grab a particularly beautiful bunch of broccoli rabe, promising myself I’ll cook it—if not this week, then definitely the next.Buy Vejibags, $18.99All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Use those fresh greens in a salad:Tropi-Cobb SaladA refreshingly fruity twist on a traditional Cobb salad.View RecipeExplore Bon AppétitHealthyishStoringherbTrendsRead MoreLifestyleHow to Store Vegetables in the Fridge So They Stay Super FreshBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Oset Babur"]}