{"id": "33d48166c779c7764caabd253be8f647", "url": "https://www.bonappetit.com/story/jessica-wang", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Jessica Wang Is ‘Freestyle Fermentation’ Chef Who Dreams of Her Own Pickle Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe ‘Freestyle Fermentation’ Chef Who Dreams of Her Own Pickle Shop Until then, she's slinging butter mochi and teaching earthquake-preparedness cooking classes. By Emma OrlowJanuary 9, 2020FacebookTwitterEmailPhotograph by Jonathan ChuFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is a pastry chef and fermentation specialist Jessica Wang, who sells healthful desserts to help fund her dream pickle shop.Jessica Wang has her hands full with dynamic food projects. One day she’s slinging handmade butter mochi under the name Pique-Nique in Los Angeles’ Far East Plaza, the next she’s teaching pop-up workshops on freestyle fermentation at hot spots such as Honey Hi. Eventually, she hopes to use these various side hustles to fund her own brick-and-mortar pickle shop. She’s also been a recipe tester for Lucky Peach (R.I.P.), a buyer for the beloved pantry shop and grocer Cookbook Market, and a vintage cookware seller.Checking out Wang’s varied creative projects, it may come as no surprise that she attended the Maryland Institute College of Art in Baltimore for fine arts. It was here that Wang—who was born in Texas but moved to L.A. when she was five—began working with food. Though Wang is not classically trained in the kitchen (beyond hovering over her mom while she made soy-braised chicken legs, gumbo, or casserole), she started cooking the food she grew up with as a cure for homesickness and eventually found her way into restaurant kitchens.Since going fully freelance this October, Wang taps into her creative college experience through events that use food as a practical and poetic medium. The Los Angeles Department of Cultural Affairs asked her to teach a pickling workshop focused on techniques for storing food in case of an earthquake, and she even had an opportunity to help design fermentation vessels—sculptures that are meant to evolve as the active bacteria grows— currently on display at the MAK Center for Art and Architecture.Recently, Wang’s main passions of pastry and pickles have been redefined by a new focus:  her own well-being. After the now-35-year-old moved to San Francisco for a dream job on the pastry team of State Bird Provisions in 2014, doctors diagnosed her with prediabetes. Shocked and worried about what this would mean for her career, she returned home to decompress and heal.“I can’t imagine not using that [pastry] skill set; it would be so sad if I stopped doing it completely,” she says. “When it comes down to how I feel I can contribute, I would really like to be useful and helpful [to others].” Since her diagnosis, she’s not only been reevaluating her relationship with sweets by finding creative swaps—using ingredients like protein-rich chickpea flour instead of all-purpose flour and sweet potato fillings instead of refined sugar—but using pickling workshops to help her peers learn about the benefits of probiotics in their diets.We talked to Wang about the pastry trend that annoys her most, her obsession with obscure corn varieties, and the easiest way to get into fermentation.I started taking pastry seriously… when I was working at LASA, a Filipino restaurant in Los Angeles’ Chinatown. I had done a pop-up with my friend where I made pastries with cornmeal and fillings like key lime, and I brought the leftovers into work. LASA didn’t have any dessert on their lunchtime menu at the time, so I reworked the recipes to fit more with Filipino flavors like coconut.The name Pique-Nique comes from...  when I was trying to be a good sport about the winters in college.  It was quite an adjustment. In response to the gross winter, I created a roaming picnic in a gallery (and even once as a pop-up in the school elevator), with a curtain screen-printed with grass as an imaginary field of flowers.The pastry trend that I find infuriating is… honeycomb—not the kind that actually comes from bees, but the caramelized sugar. It’s named after something natural and beautiful and yet it’s literally just sugar. But, maybe, I also don’t like it because the person who taught me how to make it wasn’t that nice.My favorite way to spend a day is… thrifting. Going to thrift stores is like my television. I used to buy a lot of mid-century wares, Depression-era glasses, and cool cheese boards, and I would piece them together as collections. I especially loved collecting snack sets—you know, those sectioned-off plates where there’s a hole for cups. But, ultimately, the selling wasn’t smart for my hoarder tendencies.My favorite product I discovered while working at Cookbook Market was… Dandelion Chocolate bars. Unlike other chocolate brands, Dandelion’s really only have two ingredients: cacao beans and organic cane sugar. It’s amazing that they can create so much flavor with so few components.Lately, my favorite snacks are… peanuts coated with sea moss from my friends’ restaurant, Woon. I also enjoy fruit that’s not too sweet, and right now there’s a good amount of persimmon and guava. If I have it around I’ll put fish floss on half an avocado, too.The easiest fermentation project to get started with is... suan cai, Chinese-style salted mustard or Napa cabbage leaves. It’s literally made from two ingredients that create an environment for a third ingredient already present—Lactobacillus bacteria—to thrive and transform the greens into pickles!I get giddy about… corn, not that it’s a new thing. But there are so many kinds of corn! I used a red cornmeal that’s called “Bloody Butcher” corn that was really fun to play with. I like exploring anything that’s a variation of something I know.My current fermentation experiment is... pickling flowers. I was at my friend’s house and she had cherry blossoms packed in salt! I was surprised by how the petals were still intact.Right now I'm really into…treating my house like an installation. I’ve been using a chair as a fruit basket.Explore Bon AppétitHealthyishLos AngelesPerson of InterestInterviewsRead MoreLifestyleThis Artist Is Making Psychedelic Jelly Worlds to Explore Disability By Adrienne MateiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-09", "author": ["Condé Nast", "Emma Orlow"]}