{"id": "33e7462fd961e2945084f767de7e4a8c", "url": "https://www.bonappetit.com/story/my-vegetarian-thanksgiving-survival-strategy", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Vegetarian Thanksgiving Is Possible With This Simple Strategy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make Your Vegetarian Loved Ones Happy on ThanksgivingRule #1: No fake turkeys.By Sarah JampelNovember 14, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.Whether you’re having a vegetarian Thanksgiving or inviting a vegetarian to your Thanksgiving, you have my permission—my blessing!—to skip the fake turkey and even the savory tart, galette, vegetarian shepherd’s pie, roasted vegetable lasagna, mushroom cassoulet, or cheese-stuffed pumpkin. Your table is, after all, already loaded with so many potentially vegetarian sides. But if you’re going to rest on the laurels of sides alone, you have to strategize right.My vegetarian Thanksgiving strategy uses this matrix: orange, green, raw, wild card.Oh, come on: Don’t feel bad for carby casseroles! They’re vestiges of Thanksgivings past, made by default rather than desire, clinging on just because they can. I’ve got nothing against stuffing, mashed potatoes, even green bean casserole as individual entities, but when they’re all piled on my plate, butting heads, the meal is that awkward combination of unsatisfying and nap-inducing.Instead, I try to pick something orange (starchy and on the sweeter end), something green (savory, vegetal, takes well to garlic), something raw (for crunch and hydration), and something a tad mysterious (you have to keep the people guessing!).This year, it’ll be Andy Baraghani’s Charred Sweet Potatoes With Hot Honey Butter and Lime (orange), Broccolini With Sesame Sauce and Lemon (green), Chicory Salad with Honey Mustard Vinaigrette (raw), and Glazed Leeks with Pine Nut Salsa Verde (wildcard).When I’m picking the recipes, I’ll read them carefully, making sure there are make-ahead components for each (in this case, the sesame sauce, the honey-mustard vinaigrette, and the salsa verde), and that, for the most part, they’re cool to hang out at room temperature. I don’t want to be stressing out about how to put my side dish in the oven when my M.I.L. is monopolizing it with her turkey.With these constraints, the possibilities are plentiful! Let’s say you don’t want sweet potatoes for your something-orange: Go with Slow-Cooked Winter Squash with Sage and Thyme or Honeynut Squash with Radicchio and Miso or Harissa-and-Maple-Roasted Carrots. The greens could be green beans (obvious but beloved), kale, spinach, collard greens, or brussels sprouts. Chicories make for a festive, beautiful-by-default salad, but you could also use tender greens or even shaved root veg (this Ice Water Salad is perfect for making ahead) or fennel. The wildcard slot is there so you can try something fun, like Parsnip Confit With Pickled Currants or Cheesy Cabbage Gratin or Glazed Shallots with Chile and Thyme.The goal is for my plate to end up looking like it would on any exceptionally good cooking day of the year—tons of vegetables of various preparations, some for bulk and some for freshness, with lots of flavorful sauces and accompaniments. Turkey’s welcome here, but definitely not necessary. And while my family can make stuffing if they really want to, they won’t miss it once they taste the new crew.But let’s say you’re not hosting. Or that your family won’t budge from the trio of carbs (mashed potatoes, sweet potatoes, stuffing) passing as vegetarian sides. Offer to make or bring just one recipe that will offer some contrast, substantive enough that a big bowl of it will keep you satiated: Maybe that’s a crunchy radicchio salad with squash and pecan vinaigrette or wild rice with mushrooms and leeks.When all else fails, what helps me is to remind myself that this is one meal of the year. So what if my plate is full of stuffing and I need to lie down before dessert? There’s always dinner tomorrow.Explore Bon AppétitThe Not Depressing VegetarianThanksgivingVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Sarah Jampel"]}