{"id": "33fa26cb71295bfe6ceaa3558abcbdab", "url": "https://www.bonappetit.com/recipe/a-capella-cocktail", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "A Capella Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueA Capella CocktailBy Gavin PierceMay 21, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Gavin Pierce, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintRich, creamy coconut milk balances the tart flavors of vinegar and hibiscus in this low-proof cocktail from Gavin Pierce of Room 11 in Washington, D.C.IngredientsMakes 8Shrub1cup sugar⅔cup Champagne vinegar or white wine vinegar1cup dried hibiscus flowersAssembly2cups Capitoline Rosé Vermouth, Lillet Rosé, or Cocchi Rosa1cup unsweetened coconut milk8dried hibiscus flowersPreparationShrubStep 1Bring sugar, vinegar, and 1¼ cups water to a boil in a small saucepan. Reduce heat so liquid is at a simmer and add hibiscus flowers. Simmer until liquid is a very deep reddish-purple, about 5 minutes. Remove from heat and cover. Let sit 20 minutes to infuse.Step 2Strain shrub through a fine-mesh sieve into a heatproof container. Cover and chill until cold, at least 1 hour.Step 3Do Ahead: Shrub can be made 2 weeks ahead. Keep chilled.AssemblyStep 4For each drink, combine 2 oz. vermouth and 1½ oz. shrub in a tall glass. Fill with ice and stir for several seconds. Carefully pour in 1 oz. coconut milk as close to surface of drink as possible to keep it from sinking; you want it to float on top. Garnish with a hibiscus flower.How would you rate A Capella Cocktail?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllCoconut MilkOther IngredientsVermouthAlcohol & Other DrinksHibiscusHerbs & SpicesLilletDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Gavin Pierce"]}