{"id": "33fe29359918406f7b49935b8c6aee29", "url": "https://www.bonappetit.com/story/australia-bake-sale", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "As the Australian Bushfires Raged, An Ex-Pat Bake Sale Raised $24K | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow an Ex-Pat Bake Sale Raised $24K For AustraliaWatching as fires burned across her home country, Hetty McKinnon felt a crushing sense of helplessness. So she started cooking.By Hetty McKinnonJanuary 26, 2020FacebookTwitterEmailIllustration by Celia JacobsFacebookTwitterEmailI never felt fully Australian until I moved away. Growing up as the child of Chinese immigrants in Sydney, I never quite fit the mold of the blonde, blue-eyed Aussie girl.  Since then, I’ve moved around the world and travelled enough to consider myself a global citizen. But in the past few weeks, as I watched the devastating, apocalyptic fires burn across Australia from the sanctity of my Brooklyn home, I felt a relatively unfamiliar emotion: a fervent love for the country where I was born and raised. I also felt a crushing sense of helplessness.As I texted with my fellow New York-based Australian friends about the devastation, I sensed that others also felt this helplessness—and wanted to channel it into action to help the animals and communities back home. Australia has a long and hallowed tradition of fundraising with food, so my first thought was a bake sale, or “cake stall” as we call them in Australia. I have organized plenty of these at my kid’s school in Sydney and these fundraisers have always fostered a humble sense of kinship by gathering the community together in a simple way. This felt like a practical place to start.I put out a distress call to Jessica Grynberg, co-owner of Bourke Street Bakery, a chain of bakeries based in Sydney with an outpost in New York’s NoMad. Jessica and I are Brooklyn neighbors but before I moved to New York five years ago, her bakery in my old neighborhood, Surry Hills, provided my daily bread. Rarely a day went by when I didn’t pop into that bustling corner shop for a loaf of sourdough, or to meet a friend there for coffee and carrot cake.As we watched Australia burn from the other side of the globe, coming together as a community allowed us all to feel more powerful.Jessica told me that a member of her team had lost her family home in the Mount Tomah region of the Blue Mountains just before Christmas, and that she wanted to do something to help too. We hatched a plan for an event on a slightly larger scale than a bake sale: a “food and friends” fundraising night at her bakery. Paul Allam, her husband and star baker at Bourke Street Bakery, would make sourdough pizzas and tarts, and I would bring some of the salads that I served at Arthur Street Kitchen, my community-based salad delivery business in Sydney. I made chargrilled broccoli and chickpeas with mint, roast sweet potato and lentils with green olive-pistachio relish, and roast cauliflower and pearl barley with pickled raisins, pomegranate seeds, and lemon tahini. Years before, I had forged an unexpected food career cooking salads for my community in Sydney, so making salads to support my country felt like the most powerful, impactful thing I could do at that moment.During the early stages of planning, several expat friends reached out to help with the fundraiser, including fellow cookbook author Amy Chaplin and her sister Bonnie, artist Edwina White, and my friends Audrey Payne and Emma Neath. Over the course of five days, our motley crew formed a tight-knit team, using countless emails and a few frenzied phone calls to create a sold-out event, raffle, online auction, and donation page. It soon became clear that our event was important to all New Yorkers, not just the Australian community here. Our friends from the food world generously donated cakes and drinks, brands donated products for our raffle, and friends and strangers alike donated money. As an all-Australian playlist boomed through the night, Australian expats and local New Yorkers gathered around a long table overflowing with pizza, sweets, and platters of salad. Over 200 people attended the event, which combined with the raffle and online auction, raised over $24,000.Throughout the night, and in the days following, people thanked us for giving them a place to gather, grieve, and be together. The Australian bushfires had shocked the world, graphically illustrating the bleak reality of climate change. As we watched Australia burn from the other side of the globe, coming together as a community allowed us all to feel more powerful, easing our sense of despair and, most importantly, giving us hope.Back in Sydney, cooking salads for locals showed me that eating is a communal experience that brings together friends, fortifies families, unites neighbors, and acquaints strangers. It was this spirit of friendship and belonging that inspired me to write my first cookbook, Community. Since moving to New York, a much larger and more diverse city, this sense of community has not always been easy to find. But at a table brimming with salads, I found a renewed sense of home.To donate, head to the Australian Red Cross or the Country Fire Authority.Explore Bon AppétitHealthyishAustraliaNew YorkessayRead MorerestaurantsThe Bake Sale Is Now RadicalBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-26", "author": ["Condé Nast", "Hetty Mckinnon"]}