{"id": "3413f267e176a53ebcc2d472a1d4ae55", "url": "https://www.bonappetit.com/story/fried-mozzarella-billy-joel", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I Fell in Love Over Fried Mozzarella and Billy Joel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Fell in Love Over Fried Mozzarella and Billy JoelThere’s nothing quite like that “muzzadelle” feeling.By Emma StraubApril 16, 2019FacebookTwitterEmailPhoto by Cole WilsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Mike and I had been dating for a couple of months when his friend Brian got engaged. Brian and his fiancée, Karen, came up to New York from Orlando to celebrate, and Mike got us four tickets to the Billy Joel/Twyla Tharp dance musical, Movin’ Out, as something of an enjoyable evening of ridiculousness—like dance karaoke. I myself possessed a Billy Joel T-shirt, purchased along the same line of love and irony, and wore it. The first photograph of Mike and me was taken that night, the two of us standing on a subway platform in faded Billy Joel gear. I laughed so hard during the show that I got mean looks from several burly men with mustaches. Before the show, though, we had dinner. And where to have dinner before a celebration of Billy Joel’s oeuvre? Little Italy, of course—someplace where you can order “a bottle of red, a bottle of white,” and not have to specify too much further.Mike was born in Mamaroneck, New York, Italian-American on both sides. He’d grown up coming into the city and going to La Mela, on Mulberry Street, and so that’s where we went. Immediately upon entering the restaurant, Mike lost all control of the space between his vowels and consonants and began saying “muzzadelle” instead of “mozzarella.” The food was ample, mediocre, and satisfying, not unlike the Billy Joel musical still to come. The only food I remember ordering was the mozzarella in carrozza, because I was amazed to realize there was a way to fry cheese that I hadn’t tried yet. Mike said that the food reminded him of Sundays at his Cookie Grandma’s and then at his aunt Toni’s. (When I finally went to visit that aunt’s house some time later, I took a single piece of paper from his Uncle Junior’s notepad, because, as a fiction writer and appreciator of names, having something that said “from the desk of Nunzio Sciciliano” was too great to resist.)I grew up some 80 blocks north of La Mela on the Upper West Side. My family went to several Italian restaurants in the neighborhood, including my favorite, a place called Panarella, where I liked to go on my birthday, and where I always ordered the rigatoni quattro formaggi (it closed approximately 20 years ago). My childhood was spent hopping from one restaurant to another eating penne alla vodka and fettuccine Alfredo and rigatoni Bolognese and lasagna. But I’d never been to Little Italy.We didn’t frequent family-style places, maybe because that seemed to circumvent the purpose of going to a restaurant, where everyone could order what they liked. I was a terrible eater (in variety, not quantity), and maybe my parents liked to go out because then they could order themselves oysters or mushrooms or oyster mushrooms, all things that I would recoil at seeing on our dining room table at home.Maybe because of that, no matter how much I cook, I will always love restaurants the most. It’s part of my dowry, the same way that red sauce is part of Mike’s. Just as his favorite childhood memories involve warming dishes and a sea of homemade buttery cookies, mine involve sitting with my parents and brother around a table and picking the cheesiest, creamiest thing on the menu. Because the food—as delicious as it is—is never really the point, is it? Feeding people you love, whether it’s by simmering a sauce for six hours or by letting them choose the restaurant and listening to them babble about New Kids on the Block for an entire meal, that’s love.Mozzarella isn’t a bad place to start, for a romance. I liked that Mike came from a specific place of origin, a place with its own foodstuffs and rituals and glossy photographs of actors from The Sopranos and Goodfellas. I liked that Mike called his grandmother Cookie Grandma because she made enough cookies to cover her entire bed with them. A bed full of cookies! What could be better? I liked that, as a couple, and then as parents, those red-checked tablecloths and enormous plates of pasta also belonged to me.This past weekend, Mike and I took our two rambunctious sons to the aquarium in Coney Island, and after we’d had our fill of shark encounters, went to L & B Spumoni Gardens for dinner. Unlike the silent Brooklyn Heights diner where I’d last taken my children out to eat, where a dapper patron in his mid-60s told me that I should keep my children at home because the restaurant wasn’t a playground, the decibel level at L & B was such that no one could even hear their delighted screams and yelps. The children-size portions of pasta were each big enough to last for days, and both my picky children ate hungrily and happily, even though they both turned up their noses at mozzarella sticks, the American take on mozzarella in carrozza, without which I wouldn’t have survived childhood.Mike started slurring his words again, that old muzzadelle feeling. “I’m so happy,” he said, over and over again. “I love this. Do you love this?” At that point, I’d eaten enough eggplant Parmesan to feed an army, plus the Sicilian slice of pizza we’d ordered because we had to, plus the garlicky broccoli that came on the side, plus the mozzarella sticks my children had thumbed their noses at, plus some rice balls, just because. “I do,” I said.Emma Straub is the New York Times bestselling author of Modern Lovers, The Vacationers, and Laura Lamont’s Life in Pictures. She owns Books Are Magic, an independent bookstore in Cobble Hill, Brooklyn, and she eats pasta five days a week.Explore Bon AppétitRestaurantsItalian AmericanRed SauceNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Emma Straub"]}