{"id": "3423431c79fd1a5e01c4b8f3267593f6", "url": "https://www.bonappetit.com/story/roast-chicken-season", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Attention: It’s Finally Roast Chicken Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAttention: It’s Finally Roast Chicken SeasonEditor in chief Adam Rapoport shares how he makes the perfect roast chicken in his weekly newsletter.By Adam RapoportSeptember 26, 2018FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.It’s finally roast chicken seasonAnd just like that, it was fall.First, my wife texted me on Saturday, asking if we should roast a chicken. Then she wanted to know if she should build a fire. Definitely, to the former; we’re not quite there yet, to the latter.So, around 6pm, I unwrapped a plump, 3 ½-pound bird, and I rained kosher salt all over it.I had decided to make BA’s Cast-Iron Roast Chicken. It’s a dead-simple, genius recipe, the kind you literally can’t screw up. It’s so good, in fact, that it served as the centerpiece to an eight-page service package that earned Bon Appétit a 2018 National Magazine Award nomination.Want this letter before it hits the website? Sign up for our newsletter!The premise is as basic as can be:Season the bird well.Pat down the skin to get it as dry as possible (it crisps up much better this way).High heat.Set the chicken directly into a pre-heated cast-iron skillet.And then, here’s where the flair comes in: flank the bird with any manner of vegetables, which luxuriate and roast in all that generous fat.Inspired by the lead image for the recipe, I opted to partner the chicken with fingerling potatoes. I sliced them into coins, about a third of an inch thick, and then tossed them with a bit of melted butter, salt and pepper, and chopped, fresh rosemary from our garden. I nestled the coins all around the chicken, popped it in a 450° oven, and set the timer for just under an hour.This is basically what the recipes prescribes, but not exactly. Chris Morocco, who developed the technique, slices his potatoes a bit thinner, and shingles the entire base of the pan like an edible mosaic tiled floor. Either way, what emerges from the oven is a beautifully burnished bird with crackling, crisp skin, and a pan full of nicely browned potatoes, all glossy with chicken fat.At this point, I like to do two things.First, I let the bird rest, a good half hour. When a roast chicken hits the cutting board, it is steaming hot. Give it time to mellow. Just make sure your board or platter is able to collect all the flavorful juices pooling about the chicken.And then I like to put the potatoes, or whatever root vegetables I’ve opted for, back in the oven. Sometimes, I set them under a broiler for a quick blast. On Saturday, I cranked my oven to 550° and gave the potatoes a few minutes to get all sizzley and evenly browned. I made a basic green salad, which is all a nicely roasted chicken needs. And we opened a bottle of gamay, the perfect match.Finally, because this is the modern world, I photographed all these steps in portrait mode with my new phone. To which our associate social media manager Emily Schultz immediately made fun of me on Instagram, calling me out for being all fancy.Whatevs!All I know is that my wife said it was the best roast chicken and potatoes she has ever had. And that is a fact.Get the recipe:Cast-Iron Roast Chicken with Crispy PotatoesExplore Bon Appétitroast chickenAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Adam Rapoport"]}