{"id": "3426ec400ac8a7ef7ee1bd0cfc366f32", "url": "https://www.bonappetit.com/story/czech-coffee-cake", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "This Czech Coffee Cake Puts Summer Fruit Front and Center | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Simple Czech Coffee Cake Puts Summer Fruit Front and CenterBublanina (“bubble cake”!) is a cushy home for the season’s finest.By Samantha TatroAugust 25, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl Jones FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Whenever we had an abundance of fresh fruit in the fridge growing up, I knew there was a good chance I’d wake up the next morning to find one of my favorite dishes in the world sitting on the counter: a Czech bublanina, or “bubble cake.” My mother has always been a busy person, but she was never too busy to whip up this simple vanilla coffee cake with berries or stone fruit sunken into its top.My sister and I were raised in the U.S. and abroad, many miles from my mother’s childhood home just south of Prague. She had bravely fled the Czech communist regime before the Iron Curtain fell but wanted to keep a taste of the home she knew no matter where we lived. We may not have always had the exact Czech ingredients (traditional recipes use a specific milled flour and vanilla sugar), but she made sure to adapt what she’d learned from her mother so we would know what traditional Czech baked goods tasted like, from kolac to bublanina and beyond.For many Czechs, bublanina is the perfect way to highlight the fruit of the season. It’s simple, delicious, and versatile. You can eat it at practically any time of day, but it’s especially good with coffee. When my fiancé and I moved back to the Czech Republic, both of our new neighbors brought us their version of bublanina: one with cherries and the other with strawberries. It made it feel like home.Many Czech recipes are never written down exactly as they are made, but are instead improvised and improved with age and constantly changing over time. This recipe uses a standard-size coffee mug (8 to 10 oz.) to measure out ingredients. (Don’t be scared! It’s impossible to mess up.) Most summer fruits will work for this cake, which is usually made with blueberries, raspberries, strawberries, gooseberries, or cherries. My mom loved using plums or apricots for their tartness.Photo by Chelsie Craig, Food Styling by Pearl JonesTo start, preheat your oven to 350°. Pick a medium-size baking pan that has a wide surface area, like a cake pan or a rectangular pan, which is 2\"–3\" deep, keeping in mind that the batter will double in size as it bakes. Line the baking pan with parchment paper for easier removal, or butter the pan.Crack 2 eggs into a medium-size bowl and add half a mug of sugar, 2 tsp. vanilla extract, and some lemon zest or orange zest to taste. If zest isn’t your thing, you can do without. Whisk the ingredients together by hand until combined.Add one mug of milk and half a mug of neutral oil, like grapeseed oil, to the bowl and whisk until combined.To finish the batter, add 2 mugs of all-purpose flour, 2 tsp. baking powder, and a pinch of salt. Mix it all together until smooth.Pour the batter into your pan and top with the fruit, halved or chopped into bite-size pieces depending on what you’re using. Bake until a toothpick inserted in the center comes out clean and the top is golden brown, anywhere from 20 to 40 minutes, depending on the pan and your oven. Eat it immediately, or save it for your next cup of coffee. It will keep in a sealed container for a few days.If you’re looking for a little extra sweetness, you can also make a drobenka, or “quick crumble,” to top the cake before putting it in the oven. Combine 4 Tbsp. sugar, 4 Tbsp. room temperature butter, and 5 Tbsp. flour. Use your hands to work the mixture into a crumble, chill it for a few minutes, and then add it on top of your fruit.Even when it feels like you’re too busy to do anything, let alone bake, you have time to pull together a bublanina. Better yet—make two, and take one to your neighbor.Samantha Tatro is a journalist and social media manager based in Prague. She covers third culture identity, current events, and culture in the U.S. and Europe. Her work has been featured in NBC 7 San Diego, NBC News, the Boston Herald, and more.Explore Bon AppétitIt's That SimpleCakeCoffee CakeFlourRead MorecookingListen Up, Bakers: You Could Be Saving Lots of Money With DIY Vanilla ExtractBy Courtney SprewerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-25", "author": ["Condé Nast", "Samantha Tatro"]}