{"id": "342cfd67e4693a5a8138434955331a83", "url": "https://www.bonappetit.com/story/types-of-onions-what-theyre-best-for", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "All the Types of Onions, and What They're Best For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Types of Onions and What They're Best ForWhite? Sweet? Spanish? Which type of onion is the right one to use for what? Allow us to explain.By Alex Delany and Sarah JampelMay 17, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailOnions are members of the allium family, a genus of pungent plants that also includes garlic, leeks, chives, ramps, and hundreds of other species. Even among onions there are many, many different types, each with its own special qualities—a distinct onion personality, if you will. But since we can’t possibly cover all alliums (all-iums?) in one article, we’ve divided just a fraction of those we reach for frequently into the three unofficial categories:Storage OnionsSoftiesLittle GuysSo what do we like about the different types of onions? And in what situation do we prefer one over the others? These are the great questions of our time...or at least of your most recent Google search. Here's what you need to know about the different types of onions:(1) Storage OnionsBecause they’re cured (i.e., laid out to dry) after they’re harvested, usually in late summer, they’ll keep in your kitchen for months if stored properly. At the grocery store they’re likely labeled by color (white, yellow, and red), but at a farmers market, you may see proper names, like Australian Browns or Red Zeppelins. In terms of pungency, white are generally the mildest, red the sharpest, and yellow somewhere in between. And while we prefer yellow for cooking, white for garnishing, and red for pickling, grilling, and everything in between, they’re generally interchangeable: Switching between them won’t ruin a dish, even if it slightly alters its flavor or appearance.Yellow Onions\"Old yeller.\"\nIf a recipe doesn’t specify, chances are it’s calling for one of these old faithfuls (also called brown onions). In fact, nearly 90 percent of all storage onions grown in the U.S. are yellow. They’re severe when raw but mellow when sautéed, roasted, or caramelized. Because they have a relatively high starch content, they won’t dissolve to mush even after long cook-times, which makes them a great all-purpose cooking onion. Spanish onions, BTW, are a larger, milder relative that can be yellow or white—don’t stress about finding one when a recipe says so.Red OnionsSharper and spicier than yellow onions, you’ll often see them raw, whether in salads, like Greek salad or kachumber, or alongside long-cooking braises. Soak them in ice water as you prep your other ingredients to make them extra crisp and rid them of some fierceness. The obvious draw to a red onion is its color, with a deep red hue that provides a nice contrast. In some cases, though, they may discolor and turn light ingredients, like eggs, potatoes, and beans, a blueish-gray. Hello, red onion.\nWhen it comes to grilling, red onions are our first choice. Cut into wedges, they char nicely on the grill, and their interior texture goes jammy, instead of mushy, like white and yellow onions tend to do. They're also our first choice for pickling, which we love to do when tacos, pizza, or fried rice are involved.White OnionsSofter and milder than yellows and reds, these have thin, papery skins and, while still sharp, less of a lingering aftertaste. We prefer them cooked quickly or served raw, like in pico de gallo or atop huevos rancheros (they’re particularly popular in Latin and Central American cuisine), or whenever you need one in the dish and as a garnish (think chili).A white onion sheds its skin.\nYou can further tame their flame by slicing one thinly and giving it an hour-long soak in cold water—they'll be so sweet, you can practically eat them like a salad. (Okay, maybe that's a little dramatic, but the flavor will mellow dramatically, and you can probably eat a lot more of them.)(2) SoftiesMore delicate than storage onions, these should all be stowed in the refrigerator to extend their lifespan.Sweet Onions Hi sweetie.\nBecause they contain less sulfur and more water than yellows, reds, and whites, they’re mild, crisp, and good for eating raw, frying into onion rings, and stuffing like you would a mushroom or tomato. Defined by the particular region where they’re grown—Washington’s Walla Wallas, Georgia’s Vidalias, and Hawaii’s Mauis, for example—they’re often only available seasonally.Green OnionsAlso called scallions (on BA, we call these scallions exclusively!), bunching onions, and, confusingly, spring onions (wrong!), they’re milder, softer, and more herbaceous than any of the storage bulbs. They’re as good raw, like scattered over braised tofu or fried eggs, as they are slowly cooked, like infused into oil for Cantonese-style scallion sauce.Spring OnionsJuicy, sweet newbies! These are just storage onions that are harvested prematurely to give the other bulbs room to grow. As the name implies, they’re super seasonal. When you get your hands on them, make them the star: Grill, roast, or braise them whole or halved, tops and all, then cover with lemony breadcrumbs, punchy mustard dressing, or—as an homage to Catalonian calçots (a scallion-esque onion relative)—romesco.When you've got spring onions, flaunt 'em.\nPhoto by Chelsie Craig, Food Styling by Kat Boytsova(3) Little GuysGood things come in small packages! Pro tip: If you need to peel a whole bunch at once (ugh), try blanching them first.ShallotsUse these wherever you’d use a storage onion. They have an onion-y flavor without being too aggressive and are beloved for their versatility. They’re at home finely chopped and stirred into a lemon vinaigrette, halved and roasted alongside a chicken, pickled whole, as in the Vietnamese dish dua hanh, or fried in thin slices for a crunchy topper for laksa, korma, and gado gado. FWIW, we consider one bulb to equal one shallot, even if it contains two lobes.Cipolline (a.k.a. Cipollini) OnionsOnion or UFO?\nPhoto by Emma FishmanThese Italian cuties are naturally, rather than forcibly, petite and squat like saucers. They’re more sugary than big onions, which makes them ideal for roasting whole until caramelized. For an easier time peeling their thin skins, try boiling them for about 30 seconds first.Pearl OnionsA co-star of coq au vin and boeuf bourguignon, they’re sweet and small (they’re grown in close quarters and harvested early) and come in red, white, and yellow. Halved or left whole, they can be roasted, braised, pickled, creamed, glazed, confited, or used to crown a stunning tarte tatin. Look for pre-peeled bags in the freezer aisle.Pickled pink pearl onions are almost too beautiful.\nPhoto by Alex LauGo all in on alliums:Bean Confit With Lemon, Saffron, and All the AlliumsBeans cozy up with spring alliums and plenty of olive oil.View RecipeEditor’s note: This article was originally published June 28, 2018.Explore Bon AppétitBasicallyRed OnionOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Alex Delany", "Sarah Jampel"]}