{"id": "343d755602064bebc23761f48df71869", "url": "https://www.bonappetit.com/story/the-summer-drink-im-bringing-into-fall", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Iced Barley Tea Is The Summer Drink I’m Bringing Into Fall | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Summer Drink I’m Bringing Into FallBonus: You can make it while you sleep.By Christina ChaeySeptember 12, 2020FacebookTwitterEmailPhoto by Christopher Testani FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Every week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,The most exciting news I have to report this week is that I bought a lot of plums the other day and am now having plum paralysis trying to decide what to make with them (debating between jam, the famous Marian Burros torte, or this cake with plum caramel).Other than that, there’s not a whole lot to report around here. As the summer of beverages draws to a close (goodbye, cold brew, hello, chai), I realize I have yet to write about the one warm-weather drink I’m bringing into the fall, winter, and beyond: roasted-barley iced tea.When I was growing up, we always kept a big bag of store bought roasted barley kernels in the pantry. (You can buy these at H-Mart and other well-stocked Asian grocery stores.) My parents would make a giant kettle’s worth of tea by steeping the barley kernels in hot water, straining the resulting brew, then refrigerating pitchers of it for us to drink all week. This nutty, slightly smoky tea is known by various names—boricha in Korean, mugicha in Japanese—and is packed with all the antioxidants, vitamins, and minerals of barley (plus it’s naturally caffeine-free). It’s what we had with dinner instead of water or milk most nights of the week.All it needs is an overnight steep. \nCopyright 2020. All rights reserved.As an adult, I hadn’t gotten into the habit of making barley tea for myself until this summer for various reasons: my Brooklyn apartment doesn’t have space for a giant kettle, nor a big pitcher to house in my tiny shared fridge. Also, I’m lazy.Luckily, my friend Sue recently told me about her barley tea workaround as another self-identified lazy person who enjoys cold tea beverages: These little individual sachets, which you drop into a quart of water and refrigerate until it’s cold, fragrant, and deep brown. (I also want to try these from Umami Mart).All summer, I’ve gotten into the habit of making cold barley tea before I go to bed. I add a sachet to a one-quart glass Ball jar that I keep in the door of the fridge at all times, then let it steep overnight so it’s ready for me in the morning. I drink it over ice over the course of the following day, and, when I finish, I top off the jar with more water to get a less potent but still serviceable second steep. Because sometimes...it really is too much work to walk to the pantry to grab another tea bag.Keep it lazy,Christina ChaeyAssociate editorPhoto by Laura MurrayHouse Foods Mugicha Tea$11 at Amazon$7 at Umami MartExplore Bon AppétitHealthyishWhat's Chaey Cooking?Summer DrinksRead MoreLifestyleMake Yourself an Elaborate SandwichBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-12", "author": ["Condé Nast", "Christina Chaey"]}