{"id": "343d14fdd0a67df5de49db8c3b4f63e3", "url": "https://www.bonappetit.com/story/virgo-season", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "The Healthyish Newsletter Is Back and so is Virgo Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Newsletter Is Back and So Is Virgo SeasonReading recommendations and other opinions from Healthyish editor Amanda ShapiroBy Amanda ShapiroSeptember 6, 2018FacebookTwitterEmailIllustration by Jay Daniel WrightFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Whoa, it's been a minute.We devoted August's newsletters to cooking through the Farmers' Market Challenge, and while it was all awesome, from squash pasta to berries and cream, I have to admit...I missed talking about the other stuff. Ya know, that all-meat diet, my crush on Rachel Comey, the pillows I just bought that I'm obsessed with.But it's Virgo season, and I'm back, baby, I'm back. To celebrate and to recap, here's what I loved on Healthyish and beyond last month.How Zumba can save us all from the #fitspo trap.What white fragility actually looks like, from a professional diversity trainer.It's okay not to talk at the dinner table.Crying in H Mart = me crying in the 3 train.How to find quality CBD products on the internet. (It's trickier than you think.)The bodega-owning, yoga-teaching, non-profit directing, event-planning mogul that is Simone Jacobson. She's also our Superpowered DC honoree!An honest account of working at a sex-positive sex toy shop: It's not all sunshine and rainbow-colored condoms.Ashtin Berry is doing that good work. Caviar potato chips on the side.I tore through Succession and Sharp Objects back to back and couldn't tell you which scared me more. Family dynamics, man. Insecure is back and I'm thrilled about it. The new season of Up and Vanished has me hooked. The Incendiaries has me haunted.Willa Fitzgerald took us to work for our new series Office Crush. Now I have a friend crush too.See you next week,Amanda ShapiroHealthyish EditorP.S. As always, I love hearing from you. Email us at healthyish@condenast.com and let us know what healthyish thoughts are on your mind.Explore Bon AppétitHealthyishHealthyish NewsletterRead MorecultureIf you're not putting food in your hair, are you really LIVING?By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Amanda Shapiro"]}