{"id": "343e6b76e589e0aa26dd97829504936c", "url": "https://www.bonappetit.com/story/party-tricks-deviled-eggs-are-a-waste-of-time", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Deviled Eggs Are a Waste of Time. There, I Said It! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDeviled Eggs Are a Waste of Time. There, I Said It!So much work! The good news? There's a much easier way to make fancy-seeming, company-worthy eggs.By Alison RomanApril 11, 2019FacebookTwitterEmailTed CavanaughFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.I have certain opinions about eggs that I will defend at all costs: Soft-scrambled eggs are actually better when cooked hot and fast; fried eggs aren’t crispy enough unless the edges are nearly burnt. And I'm here with my egg take of the month (ETOTM): Deviled Eggs Are Dumb. This is not to say I wouldn’t eat a half dozen if left alone with a tray of them—it's not like they taste bad or anything. But, just maybe, going through the trouble of making them is a complete waste of your precious time.Think about it: boiling eggs, then peeling them, then halving them, then chopping up pickles and herbs to mix with the yolks and mayo, then putting the filling into a pastry bag, then piping that filling back into the egg halves—I mean, I’m already exhausted! There’s a better way to achieve the satisfaction of creamy, highly-seasoned eggs without all those annoying steps. It involves a bunch of soft-boiled eggs—you want just-runny, almost-jammy six-and-a-half-minute yolks—and a very fun spread of crunchy, creamy, tangy, and salty things for people to pile on top. In this scenario there is no fancy homemade filling to worry about, because those perfect yolks are your filling. Nature provides!The scene.\nPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Amy WilsonAs for the toppings: They are your paint. The eggs are your canvas, and you are the greatest egg artist the world has ever known. I like mayo, cornichons or sliced pickles, shallots (fried or pickled), nice anchovies, tender herbs, paper-thin slices of smoked fish, and even salmon or trout roe because eggs on eggs is peak fun. Your guests will DIY their way to yolky springtime bliss, and nobody is going to think twice about all of the time you saved by not putting anything into a pastry bag.The best part of this whole thing is that while it looks fancy and carefully planned, it's really just a bunch of boiled eggs surrounded by some odds and ends you probably already had in your fridge. It's all in the branding. Call them...“egg-y tapas” rather than \"lazy deviled eggs.\" That’s right: Deviled eggs are out and tapas are back, baby! Ah, 2019, what a time to be alive!More Party Tricks, right this way:Bad Wine Is Just a Great Cocktail Waiting to HappenIn Alison Roman’s new column, Party Tricks, the ‘Dining In’ author defends the wine spritzer.View StoryExplore Bon AppétitBasicallyParty TricksHard-Boiled EggsEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-11", "author": ["Condé Nast", "Alison Roman"]}