{"id": "3457c33bbb4a432737359392e4b47f53", "url": "https://www.bonappetit.com/story/salt-feud", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "What the BA Staff Is Cooking on Memorial Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat the BA Staff Is Cooking on Memorial DayKimchi slaw! Ribs! Cobbler! WaJu!By Alex BeggsMay 25, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Sweet talkThis week we had our May cookbook club tea party featuring recipes from Stella Parks’ BraveTart. Not to toot my own toot machine, but my homemade Nutter Butters were pretty amazing. (Cut to me, squeezing leftover peanut butter creme from a piping bag directly into my mouth while watching Game of Thrones Sunday night.) Rachel Karten brought in her cinnamony, perfectly chewy snickerdoodles; Emma Wartzman had us dunking pecan sandies in our jasmine tea; Emily Schultz used a candy thermometer for the first time for her picture-perfect fudge; Sarah Jampel made sky-high biscuits we ate warm, one of life’s greatest pleasures; and Christina Chaey’s homemade Fig Newtons coulda fooled me. Find the cookbook here to make those Nutter Butters yourself.Photo by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiA spritz is a good drinkI feel bad for Rebekah Peppler, who was just trying to tell the world to use slightly better ingredients in their summer spritzes. The headline to her New York Times article, “The Aperol Spritz Is Not a Good Drink” got the world is freaking out in defense of a dang refreshment, an unnecessary food feud for us all! (Don’t even try to pry my rosé Aperol spritz out of my pink manicured fingers.) HOWEVER. At the end of the story, Peppler recommends a drink that’s going to go on vacation with me this summer, the Amaro Spritz. Amaro, prosecco, club soda, squeeze of lime. I use Averna, a liquor made of fermented roots and other witchy business, which has this deep sweet and root beer-ish flavor, and obviously that’s going to be good with decent bubbly wine and maybe a few dashes of bitters.Want this letter before it hits the website? Sign up for our newsletter!What’s everybody making for Memorial Day?I’m making Molly Baz’s grilled chicken sandwiches for a crowd. Emily Schultz is making our best-ever ribs. Carla Lalli Music AND Sarah Jampel are making Claire Saffitz’s new recipe for cherry biscuit cobbler. Jampel’s adding on this easy onion dip, which I hard co-sign. Kate Fenoglio is making this crunchy and refreshing cucumber salad. “Skewers! A lot of skewers!” was all I got from Emma Wartzman. Aliza Abarbanel is bringing spicy kimchi slaw to a picnic. “I’m spending mem’ day in Baja Mexico so you best believe I’ll twisting up pitchers of WAJU,” said abbrev-queen Molly Baz. Julia Kramer sent me a screenshot of her entire weekend menu, which included the green goddess crunch sandwich, salmon niçoise salad, and BA’s best buttermilk pancakes. Christina Chaey shook her head, “I’m not cooking a damn thing! It’s vacation!”A trip to Wine CountryI watched half of Netflix’s Wine Country before I admitted it wasn’t doing much for me. It just...wasn’t funny? Maybe I wasn’t the target audience. The movie, about a group of friends celebrating a 50th birthday, did portray the Napa winery scene as a caricature that rings too real: The wine people who want wine to be accessible to all, yet can’t let go of their grape dogma. There are no wrong answers, a winery “barista” says before shutting down someone who says she tastes “canned peaches.” At an organic winery, a barista calls the sediment at the bottom of unfiltered wines “wine diamonds.” Another exchange: “This one’s good, what’s it called again?” “White wine.” “I love it.”JamperoncinoContributing editor Sarah Jampel, a quiet, hardworking, wonderful human being, has become the victim of nickname hazing in the Test Kitchen. In the past week, she told me, she’s been called “Jamperoncino,” “Jampers,” “Jampy McJamperson,” “Jampy Jamporini,” and had an upcoming strawberry cake recipe of hers declared “Jampelissimo!”Unnecessary food meme of the weekUnnecessary food feud of the week“These snickerdoodles are SALTY,” said Molly when she tasted our entire cookbook club buffet and gave her ((unsolicited)) critiques. That’s when we found out that Rachel Karten, snickerdoodle queen, doesn’t cook with the Bon Appétit Test Kitchen’s zealously preferred Diamond Crystal Kosher salt, but Baleine kosher salt instead. “That’s what they sell at my grocery store, okay?!” she defended herself. “I’m going to give you Diamond Crystal as a housewarming present,” replied a horrified Molly. That’s when we found out that Alex Delany doesn’t use D-C either, but Jacobsen kosher salt, ain’t he fancy. “Anyone wanna come clean on the iodized?!” demanded Molly. “I deff used iodized before working at BA,” wrote Emily Schultz in a Slack confessional. “It’s getting awkward in here,” someone said, pulling at her shirt’s collar. “I use sea salt when I bake,” noted Anna Stockwell. “Whose using black lava salt? OUT WITH IT!” screamed Carla Lalli Music. Amiel Stanek, who is known to lick any pink salt lamp he’s ever encountered, chimed in: “I only use Himalayan pink salt in large crystals that I grind in my salt grinder right before consuming. Freshly cracked is always better, you really get the flavor. All the...aromatic oils.” I’m pretty sure he was joking, but with Amiel, you never know.Explore Bon AppétitBeggs NewsletterMemorial DayRead MorecookingChris Morocco Just Made the Best Chocolate Chip Cookie EverBy Alex BeggscultureCalamari Feuds, a Dog Treat Tasting, and a Really Good Asparagus RecipeBy Alex BeggscultureHow Really, Really Type A People Plan Their Weekend CookingBy Alex BeggscultureThe Slippery, Slimy Pasta That We Argued Over This WeekBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-25", "author": ["Condé Nast", "Alex Beggs"]}