{"id": "345865ba300e9ab73f315a5bcf141a58", "url": "https://www.bonappetit.com/story/restaurant-food-products", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Support Restaurants By Buying These Delicious Food Products | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureSupport Restaurants By Buying These Delicious Food Products Restaurants need help. You need a new sauce for your can of chickpeas.By MacKenzie Chung FeganMarch 27, 2020FacebookTwitterEmailFacebookTwitterEmailIf you’ve been keeping up with us, then you already know how devastating the coronavirus have been for restaurants and their workers. Staff laid off. Owners unable to pay rent. Farmers and suppliers losing the bulk of their business. We’ve rounded up a whole list of ways you can help the industry and its workers—from donating to a relief fund to calling your elected officials (these steps are important, please get involved!)—but perhaps the tastiest way is by buying pre-packaged food products from the restaurants you love. If you’re cooking three meals a day now like many of us are, you could do a lot worse than filling your pantry with flavor-packed condiments, spice rubs, and mixes from purveyors we admire and trust. After all, you’re probably missing the flavors you get from dining out—here’s one simple way to bring them home.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.SAUCES, JAMS, & CONDIMENTSNong’s Khao Man Gai Sauce, $17 on AmazonNong Poonsukwattana started selling her Hainanese chicken rice from a street cart in Portland, Oregon, and quickly became a local cult favorite. Make your own at home with this garlicky, gingery sauce.Papalote Salsa, $7 at PapaloteThis Mexican spot in San Francisco’s Mission District turns out excellent burritos and quesadillas, but the real reason to visit is its famous house salsa—creamy and vibrant orange.No 7 Subs Hot Sauce, $9 at No. 7 SubThis hot sauce, from New York sandwich mad scientist (and sometimes Bon Appétit contributor) Tyler Kord, gets its kick from habañeros and black vinegar.Cochon Abita Whole Grain Mustard, $9 at Link Restaurant GroupNew Orleans mustard made with New Orleans beer. Try it on fried boudin or a simple grilled cheese.Photo by Sera Petras PhotographyThe Shack Sorghum Hot Sauce, $14 at AmazonEven in the best of times, Central Virginia’s The Shack is a trek to get to. Thankfully they sell their sorghum sauces (good on just about everything) online.Konbi Houjicha Milk Jam, $13 at KonbiWe’d kill for a chocolate croissant from our best new restaurant of 2019 right about now, but we’ll settle for this creamy milk jam, made with roasted green tea.Willa Jean Hot Sauce, $10 from Willa JeanBon Appétit named this brunch hotspot to its 2016 best new restaurants list. Pair their hot sauce with buttery biscuits, and pretend you’re in New Orleans.Photo by Andrew CebulkaButcher & Bee Bangin’ Relish, $13 at Butcher & BeeTry this peppery, pickley condiment from Charleston favorite Butcher & Bee on sandwiches and eggs, or use it to cut through fried foods.Edward Lee’s Sambal Hot Sauce, $10 at Bourbon Barrel FoodsLouisville chef Ed Lee has emerged as a restaurant industry leader in the wake of coronavirus, transforming shuttered restaurants into relief centers for unemployed workers. Stock up on his hot sauce, which mashes up Southeast Asian flavors with the American South.Sqirl Jams, $14 at SqirlRicotta jam toast, home edition. Each flavor from the OG L.A. all-day-cafe is better than the last.Málà Project Sauces, $12 at Málà ProjectNew York’s Málà Project offers sauces in four flavors—Five Spice Tofu, Spicy Mushroom, Soy Pork, and Spicy Beef—to punch up your noodles, stir frys, or anything really.Campo Green Chile Jam, $14 at Los Poblanos Farm ShopFire-roasted New Mexico green chile jam from this lovely Albuquerque lavender farm, hotel, and restaurant.Fat Rice Fatracha, $20 at Fat RiceA fresh take on sriracha from Chicago’s Fat Rice, one of Bon Appétit’s 10 best new restaurants of 2013.BAKED GOODS & TREATSBurrow’s Gateau Basque, $21 at BurrowYou need cake right now. This tiny Japanese bakery hidden away in an office building in Brooklyn makes very good cake.Hell’s Backbone Grill Granola, $12 at Hell’s Backbone GrillThis seasonal restaurant and farm is in a corner of Utah so remote that it wasn’t mapped until 1871. Try their granola with organic oats, coconut, and almonds.Jon & Vinny’s Nutella Chocolate Bar, $10 at Helen’s WinesIf you can’t have the Nutella-filled bomboloni at Jon & Vinny’s in Los Angeles—one of our favorite new restaurants of 2015—this is the next best thing.Russ & Daughters Rugelach, $18 per pound at GoldbellyFor over a century, New York’s Russ & Daughters—the first business in the United States to have “& Daughters” in its name—has been selling smoked fish, bagels, and other Jewish deli favorites. Their rugelach come in traditional raspberry, apricot, and chocolate flavors.Rose’s Fine Food Pączki, $59 for six at GoldbellyDetroit’s Rose’s Fine Food is a former BA best new restaurant honoree. Their pączki, or Polish doughnuts, come filled with custard or jelly.Mekelburg’s Babka Poppers, $17 for six at Mekelburg’sThis Brooklyn deli ships bite-sized versions of its classic chocolate babka.Flour Bakery’s Addictive Spicy Pecans, $9 at Flour BakeryEverything at Boston’s Flour Bakery is good. These sweet and spicy nuts are no exception.Molly Moon’s Sprinkles, $10 at Molly Moon’sThese sprinkles from Seattle scoop shop Molly Moon’s are an excuse to throw an ice cream social via Zoom.Milk Bar Cake Truffles, $24 for a dozen at Milk BarDo you know someone who has a spring birthday? Send them these birthday cake truffles from New York’s Milk Bar to cheer them up.Little Tart Bakeshop Sablé Sampler, $25 at Little Tart Bake ShopIn 2019, we loved the custard and Cara Cara orange brioche tarts from Little Tart Bakeshop in Atlanta. In 2020, we’re all about their buttery, crispy sablés.SALTS & SEASONINGSIl Buco Fiore de Sale, $15 at Il Buco AlimentariArtisan Sicilian sea salt from New York favorite Il Buco.Midwood Smokehouse Matt’s Original Barbecue Rub, $9 at Midwood SmokehouseFire up the grill and grab a shaker of this dry rub to approximate Carolina barbecue in your backyard.Gibson’s Steakhouse Seasoning Salt, $9 at AmazonSprinkle this seasoning mix from the classic Chicago steakhouse on meat, fish, or veggies.EVERYTHING ELSEBrodo Chicken Bone Broth, $13 at BrodoYou should be staying far away from your grandma right now, but thankfully this roasted chicken bone broth from New York's Brodo is \"like grandma’s but even better.\"Honey Butter Fried Chicken Corn Muffin Mix, $9 at Honey ButterNow you can have the corn muffins from Chicago’s Honey Butter Fried Chicken hot out the oven. They even sell a honeycomb muffin pan so you can make ‘em just like at the restaurant.Sea Creatures Smoked Herring, $10 at Sea CreaturesIt’s a great time to stock up on quality tinned fish—like this smoked wild Alaska herring from Sea Creatures, the Seattle restaurant group headed by chef Renee Erickson.Hell’s Kitchen Peanut Butter, $9 at Hell’s KitchenSmall-batch peanut butter from an employee-owned Minneapolis favorite.The Grey Pickles, $29 on GoldbellySpruce up your sandwiches with three jars of seasonal pickles from Savannah’s The Grey, one of BA’s best new restaurants of 2015.Manny’s Deli Potato Pancake Mix, $9 at Manny’s DeliEach bag of mix from Chicago’s venerable cafeteria makes eight potato latkes. BYO corned beef.Explore Bon AppétitCoronavirusShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-27", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}