{"id": "34741b5090b3541f49cf9d3ade9047ef", "url": "https://www.bonappetit.com/story/all-time-los-angeles", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "All Time's Focaccia With Burrata Is The Reason I Stay in Los Feliz | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Book an Airbnb in Los Feliz Just So I Can Eat This Focaccia With BurrataThere’s nothing more important about my trips to L.A. than my proximity to All Time.By Amanda ShapiroMay 15, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When you go to L.A., your Airbnb location matters. Like, really matters. Staying in Venice? Good luck getting to Silver Lake. Shacking up in the Arts District? You won’t see Malibu. So when I go to L.A., I stay in Los Feliz, and I do it because of the focaccia. Specifically the focaccia with burrata and cherry tomatoes at All Time, the Los Feliz breakfast destination that turns into a ridiculously romantic dinner spot at night. The focaccia is always at the top of the menu so you have no excuse not to order it. The bread, made by L.A. bread institution Bub and Grandma’s, bends under the weight of the burrata while the generous pour of olive oil will drip onto your fingers and the halved cherry tomatoes will fall off the sides. You won’t care because you’re in focaccia heaven. With a crisp glass of pét-nat, it’s the perfect meal for one.Go there: All TimeExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Amanda Shapiro"]}