{"id": "347eefab8f8a37e7103ca37f4a0743e9", "url": "https://www.bonappetit.com/recipe/weeknight-skillet-lasagna", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Weeknight Skillet Lasagna Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesWeeknight Skillet LasagnaFacebookPinterestTwitterEmailFor the cook who’s short on time, but big on appetite.PrintIngredientsWeeknight Skillet LasagnaKosher saltFreshly Ground Pepper12 oz. lasagna noodles20 oz. frozen chopped spinach, thawed2 cups Ricotta (16 ounces)1/2 cup Parmesan cheese (1 1/2 ounces), plus more for serving1 tablespoon extra-virgin olive oil1 pound ground beefTwo 24 oz. jar Rao’s Homemade Marinara sauce8 ounces low-moisture mozzarella, gratedRecipe PreparationInstructionsPreheat the oven to 425 with a rack in the top third. In a large pot of boiling salted water, cook the noodles, stirring a few times to prevent sticking, until very al dente, about 6 minutes. Drain.Meanwhile, wrap the thawed spinach in a clean kitchen towel and wring out as much excess liquid as possible. Transfer to a medium bowl and combine with the ricotta, parmesan, 1 teaspoon of salt, and ¼ teaspoon of pepper.Heat oil in a 10-inch high-sided ovenproof skillet over medium-high. Add the beef and season with salt and pepper; break up into small pieces with a wooden spoon and cook, turning a few times, until the meat is browned, about 8 minutes.Drain excess fat from the skillet and scrape the browned beef into a large heatproof bowl. Set aside 1 ½ cups of Rao’s Homemade Marinara sauce and stir the remaining marinara into the bowl with the browned beef.Using the same skillet, (do not return to the heat) spread about 1 cup of the sauce mixture in a thin layer at the bottom of the skillet. Arrange a third of the noodles over the sauce, breaking the noodles up to fit if necessary, and spread half of the remaining sauce mixture over the noodles. Dollop with half of the spinach-ricotta mixture and sprinkle with a third of the mozzarella. Repeat layering one time with another third of the noodles, the remaining half of the sauce mixture, the remaining half of the spinach-ricotta mixture and another third of the mozzarella.Top lasagna with the remaining third of the noodles and spread the reserved marinara sauce over the top. Sprinkle with the remaining third of the mozzarella and bake lasagna until golden and bubbly, about 25 minutes.Let sit 10 minutes before serving. Sprinkle with parmesan.Recipe by Rao’s Homemade®Reviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitRao’s Homemade®SponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Rao S Homemade"]}