{"id": "348b19b2851aa202b8602a434ec63daf", "url": "https://www.bonappetit.com/story/57-chocolate-adrinka", "year": 2020.0, "month": 10.0, "day": 5.0, "content": "If You’ve Never Tried Ghanaian Chocolate, Now’s the Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You’ve Never Tried Ghanaian Chocolate, Now’s the TimeAnd you should start with ’57 Chocolate.By Elaine LeeOctober 30, 2020FacebookTwitterEmailPhoto by Laura Murray, styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When we think of chocolate, brands like Hershey’s, Cadbury, Godiva, and Nestle often come to mind. But at the annual Salon du Chocolat in Paris—the world’s largest event devoted exclusively to chocolate and cocoa—there are at least 230 boutique brands from over 60 countries that produce chocolate. Most of the festival’s 100,000-plus attendees flock there to find new favorites and explore new flavors at the colossal Porte de Versailles event center, where culinary and artistic competitions, chocolate-making workshops, musical performances, and even a chocolate fashion show are held every fall.I attended my first Salon in 2007. What began as the adventure of a chocolate lover has become a repeated pilgrimage. Last year, as I wandered through the villages of vibrant stalls—many assembled by region or theme—I arrived at a large pavilion sign that read “She Trades,” which showcased five African women–owned companies. After attending so many other salons, I realized that I had never met an African woman chocolate manufacturer. It was an honor, privilege, and delight to peruse the pavilion, sample their chocolates, and hear stories from Africa’s chocolate industry.I was particularly captivated by the beautifully engraved Adinkra symbols rising from the small chocolate squares at the ’57 Chocolate booth. ’57’s cofounder Kimberly Addison noticed my unbridled awe at her beautiful creations and welcomed me into her booth. After exchanging pleasantries, I asked her to tell me how ’57 came to be.“My sister, Priscilla, and I got the idea after visiting a Swiss chocolate factory,” said Addison. “We realized that Switzerland was making great chocolate with Ghanaian cacao beans. We thought, If Switzerland can make great chocolate with our resources, why can’t we? We returned to Ghana and began learning how to make chocolate in our home kitchen.”In 2016, ’57 Chocolate was born and with it the goal to make chocolate of equal or better quality than the famous chocolates that inspired them.And their offerings convinced me they had succeeded. Their smooth 73% dark chocolate had the perfect ratio of earthiness to mild sweetness, with a tantalizing tinge of nuttiness. Their Bissap white chocolate, made with a species of African hibiscus called roselle, was filled with the flower’s bright flavors and had a silky and luxurious body.All of ’57 Chocolate’s cocoa-rich bean-to-bar chocolates are 100% natural, containing no artificial colors, flavors, or preservatives. Some of the chocolates are infused with distinctive local ingredients like moringa leaf, mocha, toasted coconut, and hibiscus, but they also create classic light, dark, and white chocolates, with and without nuts.“You learn to work with the resources you have,” Addison shared. “You have a tiny little resource, and it’s a seed. And you water it, and it grows.”Addison told me that the company’s name pays homage to the year 1957, when Ghana gained political independence from England and acknowledges her country’s growing economic independence from the chocolate manufacturing industry.The sisters also wanted the chocolate to be a reflection of Ghanaian art. The Adinkra symbols that adorn their chocolates were created by a cultural group called the Ashanti in the 1800s. Originally printed on fabrics worn by royalty and spiritual leaders, the 122 symbols have a decorative function but also encapsulate evocative messages that convey traditional wisdom, aspects of life, historical events, or aspects of the environment. Today, Adinkra-printed fabrics can be worn by anyone, and the symbols are widely used throughout present-day Ghana, not only on clothing, but also furniture, jewelry, art, architecture, and, now, chocolate. The symbols on the ’57 Chocolate squares represent beauty, humility, strength, and resourcefulness.For the past 150 years, Africa has produced nearly 70% of the world’s finest cacao beans, but less than 1% of the world’s chocolate. Western companies have dominated the $110 billion chocolate manufacturing industry, while Africa’s 2 million cocoa bean farmers average less than $1 per day in pay.But thanks to a new generation of entrepreneurial African women chocolatiers, like the Addison sisters, the centuries-old paradigm is shifting. Instead of sending cocoa beans to other countries around the world to be turned into the finished chocolates, ’57 Chocolate and companies like them are manufacturing chocolates in Ghana, developing a new generation of talented chocolatiers and local industry in the process. Their evolutionary fair trade chocolates are another Salon du Chocolat discovery worth celebrating.’57 Chocolate Adinkra 3-Pack$8 at Nubian Hueman$6 at Soul and StoryExplore Bon AppétitChocolateAfricanHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-30", "author": ["Condé Nast", "Elaine Lee"]}