{"id": "348e026cfe8f5f2bdd2fdfc435e1eafd", "url": "https://www.bonappetit.com/story/jammy-french-toast", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Add Jam to Your French Toast to Make It Way More Flavorful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One Addition Makes French Toast Way More FlavorfulJam in your French toast > jam on your French toast.By Kendra VaculinFebruary 21, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailIn the hierarchy of formal breakfast carbohydrates, French toast trails behind pancakes and waffles by a significant margin. You can’t blame the dish—it’s fighting an uphill battle: Waffles are fun! Pancakes are adaptable! French toast is… bread. Dipped in goop? You can understand why it’s taking up the rear—and why, at least in my mind, it is 100 percent a food you only make at home, never order in a restaurant. French toast is the best thing that almost-stale bread can become, but a “use it up” mentality isn’t the same as a “treat yourself” one. Despite it’s solid spot in the breakfast top three, plain French toast just isn’t that special.Growing up, however, I did order French toast regularly at one establishment, a café and bakery in my hometown in Northern California called the Rising Loafer. The original location has since closed, but the space is still clear in my mind: butter yellow walls with fake cracks and vines painted on them, rows of crusty bread behind the cash register, and a big outdoor patio that was prime real estate on Saturday mornings. Without fail I would order the orange-raspberry French toast, made with thick slices of their house-made bread. The fruity flavors came from a glug of orange juice whisked right into the batter and a bright raspberry purée drizzled over the top—a combo that felt, despite its French toast base, very special indeed. I would also add butter and syrup (duh), then clean my plate of every last drop.I started re-creating the dish once I moved away from home but tweaked it ever so slightly: Because I never keep OJ in the house and always have a jar or two of Bonne Maman, I’ll whisk a big scoop of jam directly into the batter instead—a way to get the topping into the slice itself. The result is a sweet and subtly fruity dish, tinted ever so slightly by the color of the jam (though you can usually only see it once you cut inside). The sugar in the jam helps the outside of the French toast caramelize a bit more than your standard variety, and it almost doesn't need any extra toppings… though if you add butter and syrup, you wouldn’t be alone.Making your own jam-infused French toast is as simple as whisking jam into your French toast batter, but there are a few tips to keep in mind. First, start with the custard mixture from your favorite classic recipe; one without any bells or whistles is ideal, and if you’re using a very sweet jam, omit the added sugar. Any flavor jam will work—I’ve tried berry, stone fruit, fig, orange marmalade, even pear and apple butter—as long as it’s not too chunky, since those bigger bits of fruit will get left behind in the batter bowl. I like to use 1 scant Tbsp. jam per egg in the custard, but your perfect ratio will depend on the brand and style you use. Give your jam a vigorous stir by itself first to smooth it out; if it’s really thick, whisk it with a teaspoon or two of warm water in a bowl to loosen the spread and help it integrate completely with the eggs and cream later on. Then add any ground spices and extracts you’d like: For berry jams, I’ll add a bit of vanilla extract to the batter; for stone fruits, just a smidge of almond extract; for orange marmalade, a sprinkle of ground cardamom.Finally, proceed as you would normally, giving your bread ample time to soak in the custard and plenty of fat to cook in. A little char and caramelization is natural thanks to the sugar in the jam, so keep an eye on your heat and how quickly the slices brown. I’m not saying this version will knock pancakes or waffles out of the breakfast baking top spot, but it at least gives French toast a fighting chance.Explore Bon AppétitBreakfastcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-21", "author": ["Condé Nast", "Kendra Vaculin"]}