{"id": "3494f5bc349982d18b9775ed19d4e4c1", "url": "https://www.bonappetit.com/recipe/double-pecan-thumbprints", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Pecan Thumbprints Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueDouble Pecan ThumbprintsBy Chris MoroccoNovember 12, 20214.7(67)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese buttery frangipane-filled pecan buttons are decadent without being fragile, and they make excellent cookies for boxing up and giving as gifts. Dusting them with powdered sugar before baking creates a crackly, glossy coating. Feel free to add more afterward as well.IngredientsMakes about 26Frangipane2cups pecan halves, such as Fisher® Pecan Halves⅓cup granulated sugar1large egg white2Tbsp. unsalted butter, room temperature2tsp. espresso powder½tsp. kosher salt¼tsp. almond extractDough and Assembly1¼cups all-purpose flour1tsp. kosher salt½tsp. baking powder¾cup (1½ sticks) unsalted butter, room temperature¼cup granulated sugar¾cup powdered sugar, divided; plus more for serving (optional)1large egg yolk1tsp. vanilla extract or pastePreparationFrangipaneStep 1Preheat oven to 350°. Lightly toast pecans on a rimmed baking sheet, tossing halfway through, until slightly darkened in color and fragrant, 6–8 minutes. Let cool; set 1¼ cups pecans aside for making the dough.Step 2Pulse granulated sugar and remaining ¾ cup pecans in a food processor until nuts are very finely ground (be careful to stop before they become a paste), 30–60 seconds. Add egg white and pulse just to blend, then add butter, espresso powder, salt, and almond extract. Pulse just until mixture is smooth and combined. Scrape frangipane into a small bowl and chill at least 30 minutes before using.Step 3Do Ahead: Frangipane can be made 3 days ahead. Cover and keep chilled. You will have more than you need, but try slathering leftovers on toasted brioche and baking until lightly browned (sort of like an almond croissant). We guarantee you won’t be upset about it.Dough and AssemblyStep 4Pulse flour, salt, baking powder, and 1 cup reserved pecans in clean food processor until nuts are very finely ground, about 1 minute.Step 5Beat butter, granulated sugar, and ¼ cup powdered sugar in the bowl of a stand mixer fitted with paddle attachment on medium-high speed until light and fluffy, about 4 minutes. Add egg yolk and vanilla and beat until combined and no streaks remain. Reduce speed to low and add dry ingredients. Beat just until incorporated, about 1 minute. Cover bowl with plastic wrap and chill dough until it’s firm enough that you can scoop it and it will hold its shape, 30–45 minutes.Step 6Place racks in upper and lower thirds of oven; preheat to 350°. Place ½ cup powdered sugar in a shallow bowl. Working in batches, scoop out tablespoonfuls of dough and roll into balls between your hands, then roll in powdered sugar, knocking off any excess. Transfer to 2 parchment-lined baking sheets as you work, spacing 2\" apart.Step 7Bake cookies until puffed but edges are still soft, 6–8 minutes. Carefully remove from oven and make an indent in the center of each cookie with the handle end of a wooden spoon or a similar heatproof object. Spoon a heaping ½-teaspoonful of frangipane into each and top with a pecan half from remaining reserved ¼ cup. Return cookies to oven and continue to bake until edges are set and very lightly browned, 6–8 minutes longer. Let cool on baking sheets.Step 8Just before serving, dust cookies with more powdered sugar if desired.Step 9Do Ahead: Cookies can be baked 5 days ahead. Store airtight at room temperature.How would you rate Double Pecan Thumbprints?Leave a ReviewTell us what you thinkReviews (46)Back to TopTriangleMap, if you're still following, I automatically reduce the sugar by 25% in any cookie recipe.  I live at 9200 ft elevation in CO so you may not have to reduce it that much.  I also, sometimes, add an extra egg yolk, if the dough seems dry; it adds a bit of fat (that keeps is moist longer after it's baked) and liquid.AnonymousCO1/14/2022Wow, these cookies are DELICIOUS!  Definitely my favorite holiday cookie this year.  I see other people not liking the saltiness and the espresso, but I thought they worked perfectly.  I kind of eyeballed both so I may have over-measured a bit, but I still love these.  As a friend said, a very adult tasting cookie 😄.  They do take a bit of work, but these will certainly make another appearance next year.Jeff P.Los Angeles1/8/2022These are so good! Perfectly tender, sweet and salty! Just one tip: after roasting the pecans, make sure you measure and split the pecans up. The recipe can be kind of confusing when it comes to how many pecans are used in the frangipane and the dough. I spaced out and added almost all the pecans to the frangipane instead of saving some for the dough (even though I make these every year, I still get confused!) I ended up with a double batch of frangipane, which i spread on croissants! AnonymousWisconsin 11/28/2021These cookies are SO delicious and worth all of the processing. However, like others, I struggled with the format of the recipe and method. Two cups of pecans weren't enough but luckily I counted out the 26 for the toppers before measuring out the rest for the batter and frangipane. I also wish the ingredients were listed by weight instead, it'd just make the pecan measurement especially feel less like guesswork.KaitBrooklyn, NY12/21/2020Love these cookies. Like other reviewers, I found the espresso strong when tasting the frangipane, but once it is baked on the cookie, I didn't taste it as much. In fact, I think it helps the cookie from being overly sweet. This is definitely a time-consuming recipe, with multiple steps and having to wash the food processor between steps *and* use the mixer, but they are worth the effort. Definitely not a \"quick mix and drop on the baking sheet\" kind of cookie. CojackBay Area, CA12/9/2020Ok, I think I've figured out how to (mostly) have these come out looking beautiful. After shaping and putting on cookie sheet, depress with back of rounded teaspoon. Bake 6 minutes. Depression will have risen slightly. Gently depress again, then deposit heaping 1/2 tsp of previously frozen balled frangipane (which, oddly, never freezes through). Top with pecan and bake 8-9 minutes. Fiddly, but people love these.Jstew52Mosier, OR12/4/2020How should I adjust for high altitude baking?  They were delicious but spread out too muchMAPHayden, ID12/4/2020I gave these out with my annual holiday cookie assortment. Everyone said they were the best and begged me to make them again this year. The leftover frangipane is so delicious on just about anything! I agree that they are time consuming but they are well worth it. Colorado cookColorado 11/23/2020Just finished making these, they're super crumbly, rich, buttery shortbread cookies and DELICIOUS. Be sure to read the recipe through carefully to avoid missing out on any instruction-it's all vital! For a few of the cookies, I added bits of a salted dark chocolate bar into the thumbprint which I highly recommend trying. The saltiness and bitterness of the chocolate cuts through the rich buttery cookies. I might skip making the frangipane next time to save time, but I still recommend trying it. NOTE: I halved the recipe and didnt have a food processor-just used a spice grinder to make the ground pecans. I used an electric hand mixer instead of a stand mixer, too.Huffy25Toronto3/23/2020Excellent. The espresso in the frangipane topping really made the cookie outstanding. A bit time consuming to make, but worth it for the holidays.Winnetka, IL12/20/2019Absolutely delicious and unique! They turned out perfectly on the first try. I actually thought they tasted better on the second / third day after baking... so they were perfect to pack into gift boxes. Anonymous12/19/2019Delicious recipe! I'm vegan and substituted egg replacer without any issues.AnonymousOntario, Canada12/18/2019It took my cookies FOREVER to get even the least bit golden brown.  I used the underside of a small measuring spoon, and I think the well it created was too large, although it didn't run over.  My frangipane wasn't like pecan pie filling at all--it was kind of an off-putting color too, but it was tasty.  I think the long baking time resulted in a dryer cookie.  All in all, I'm a bit disappointed in appearance and dryness.  Based on the effort and time I spent baking these, I don't think I'll try them again.AnonymousOxford, Mississippi12/17/2019Great recipe, terrible directions. Come on, Bon Appetit, re-write this so people who don't do this for a living can actually make it and end up with something good and edible. And while you're at it, I had good success rolling the balls in sparkling sugar instead of confectioners sugar, which was gummy coming out of the oven. Also, I used a wooden spoon to make the holes for the frangipane before the first bake because doing it later caused the cookies to crack and look unattractive. Finally, I used a piping bag for the frangipane instead of a spoon - so much easier. Nothing was too salty and the espresso powder wasn't too bitter, in fact, this was the best cookie I made this year ... but your directions were still terrible. sherryhutcheWalnut Creek CA12/15/2019For the reviewers who found this recipe too salty: reduce the amount of espresso powder.  I made the recipe twice, the second time reducing the 2 tsp of espresso powder to 1/4 tsp.  Perfect.  Not \"too salty\" at all.  While I like the coffee flavor in the frangipane, reducing the amount of espresso powder lets the pecan flavor shine through and, yes, tastes less salty.  I wouldn't omit the powder altogether, however; a little adds depth of flavor to the paste.paintchipgirlAustin TX12/9/2019Explore Bon AppétitCookieDessertPecanNutSnackBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}