{"id": "349fd12a0bafcaff1afc37664e898ecf", "url": "https://www.bonappetit.com/recipe/pumpkin-tahini-mousse-pie", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Pumpkin-Tahini Mousse Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPumpkin-Tahini Mousse PieBy Diana YenNovember 16, 20204.0(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintThis cloudlike version of pumpkin pie uses earthy tahini for extra nutty flavor. The trick to keeping it so light is mixing the pumpkin-tahini base with whipped cream in two additions: The first half ensures that the mixture is well combined, while the second half is ever so gently folded in to maintain its airiness. Lining the pan with sesame seeds gives additional texture to the cookie crust, helping it stay firm even when the pie is made ahead. We recommend topping with dried seasonal fruit just before serving. Pop any leftovers into the freezer: This pie is equally enjoyable as a frozen treat.Ingredients8 ServingsCrust7Tbsp. unsalted butter, melted, slightly cooled, plus more room temperature for pan1Tbsp. sesame seeds8oz. chocolate wafer cookies (such as Nabisco Famous or Goya Maria)½tsp. kosher saltFilling and assembly1¼cups heavy cream¼tsp. cream of tartar1cup unsweetened pumpkin purée½cup tahini1tsp. vanilla extract1⅓cups powdered sugar1tsp. ground cinnamon½tsp. ground cardamom¼tsp. ground nutmeg½tsp. kosher salt1Tbsp. sesame seedsDried fruit (such as dried orange slices; for topping)PreparationCrustStep 1Preheat oven to 350°. Butter a 9\"-diameter pie pan, then sprinkle evenly with sesame seeds.Step 2Pulse cookies and salt in a food processor until finely ground. With the motor running, stream in remaining 7 Tbsp. melted butter and process until crumbs are evenly moistened. Transfer to pan. Using a flat-bottomed measuring cup, pack crumbs firmly onto bottom and up the sides. Freeze crust 10 minutes to firm up.Step 3Bake crust until slightly darkened and fragrant, 10–12 minutes. Transfer to a wire rack and let cool.Filling and assemblyStep 4Using an electric mixer, beat cream and cream of tartar in a large bowl, starting on medium speed and gradually increasing to high as it thickens, until medium peaks form, about 4 minutes.Step 5Whisk pumpkin, tahini, vanilla, powdered sugar, cinnamon, cardamom, nutmeg, and salt in another large bowl until well combined. Using a rubber spatula, fold half of whipped cream into pumpkin mixture until smooth. Gently fold in remaining whipped cream just until incorporated (be careful not to overmix).Step 6Spoon filling into crust and spread evenly to edges, creating a swirl on top. Sprinkle sesame seeds over and arrange dried fruit on top. Cover and chill until set, at least 4 hours.Do ahead: Pie can be made 2 days ahead. Keep chilled.How would you rate Pumpkin-Tahini Mousse Pie?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleMEH. I made this exactly as the recipe directed - no substitutions, though I had to re-whip fresh cream because, as the other reviewer stated, 4 minutes is way too long to whip fresh cream, and mine started turning to butter. In any case, I served this for a Halloween dessert and my four friends at the table responded with a resounding \"Eh, nope. You don't have to make this again.\" Bland and squishy. Julie RicheyDallas11/1/2021This pie is delicious. I could not find chocolate wafer cookies of any brand, so I used gingersnaps. Often my cookie/graham cracker crusts crumble to bits when I slice them, so I was extremely forceful when I packed the crust into my pie plate (which is a thick, heavy ceramic type, f.y.i). As a result of this, the crust was packed so tight (and maybe not spread up the sides enough, so it was pretty thick on the bottom) I couldn't slice through it. Eventually I got through and it was so tasty. The filling was looser than I thought it should be. Maybe I was paranoid about over whipping the cream, but I got medium-stiff peaks before folding it in. The tahini added such a unique, pleasant nuttiness. It was like eating sweet pumpkin cream on top of a ginger cookie.  Natalie MatzOmaha,NE11/28/2020Delicious, recipe was true except for the timing on the whipped cream. If you whip for 4 minutes you'll get butter. Medium peak was a little more than 2 minutes.AnonymousSan Francisco, CA11/27/2020The \"bones\" of this recipe are what count: so far as you get a creamy mousse and focus on the nutty, savory flavors of pumpkin and nut butter, you're going to get a winner here. To wit: I made it with what I had in-house--which meant substituting typical frozen store-bought pie crust and pumpkin pie spice blend + saffron for the cardamom and other things--and swapped out most of the sugar for Swerve; it was still killer.  Will be making it again with cardamom and a graham cracker crust to see where I can take it.Lost Four WordsChicago11/23/2020Made this for a Friendsgiving with my little COVID pod. I really liked the pumpkin-tahini mousse, but I used a can of Sprouts store-brand pumpkin that was a little more runny than Libby's pumpkin, so the mousse came out slightly looser than I would have liked. It may be worth specifying that the recipe was developed with a drier variety of canned pumpkin to get a firmer mousse. The nutty flavor of tahini does work well,  and  the cardamom note comes through nicely - I'm a sucker for tahini with cardamom. I would have preferred a graham-cracker crust to a chocolate wafer crust, as I think the honey notes would go better with the tahini and spices. But overall, a good concept that I'll probably make again. My friends thought it looked pretty (I used pomegranate arils & black sesame to decorate, and the color was nice) and enjoyed the pumpkin-tahini combo. RocketSciencePasadena, CA11/22/2020Explore Bon AppétitPieDessertTahiniCondiments, Sauces & PastesPumpkinSquashVegetableFallBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Diana Yen"]}