{"id": "34b500f2411386d1536b36fded9a0ad5", "url": "https://www.bonappetit.com/story/greenest-grain-bowl", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "The Greenest Grain Bowl in the Land | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Greenest Grain Bowl in the LandThis one is perfect, and I won’t be taking questions.By Carla Lalli MusicAugust 29, 2019FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I think about this salad a lot. It’s green, it’s crunchy, it’s riffable, and it’s sustaining. It’s the platonic ideal for a winning grain salad, even though it’s built on a base of cooked quinoa, which is technically a seed, but let’s move past that.This recipe will teach you how to make a grain salad without a recipe, if you treat it as an example and follow its lead. I love how green and springy the version we photographed is, and while we call for broccoli, snap peas, and pea tendrils, the mix of vegetables is completely customizable to whatever produce moment you find yourself in. I would make this right now with flat pole beans and crunchy thin green beans, raw corn kernels, and cucumber rounds.Want this letter before it hits the website? Sign up for our newsletter!I love that this salad instructs you to briefly blanch the vegetables, removing their raw taste, sweetening their flavor, and softening their bite. I love that it includes a crunchy fatty thing—toasted pistachios, but you can use whatever nut you want—a critical element in any good grain bowl, but one that people often leave out. It’s got great proportions: cups and cups of vegetables and just enough grain to show up in every bite, without weighing everything down. This is one of those dishes that lets you shop with abandon at the farmers market or the grocery store, getting whatever looks good without worrying about what you’ll do with it when you get home.Photo by Ted + Chelsea CavanaughThis grain bowl is plant-based and also filling, so you can listen to all the voices (intuitive and otherwise!) telling you to eat more produce and consume less meat without being concerned that you’ll wish you had eaten more. It’s got a creamy dressing that contains no cream, just herbs and nuts and olive oil that are emulsified in the blender, and it can be made with whatever tender herbs you happen to have, or grow, or like to use. It’s a grain salad for weekend picnics and beach outings, but any leftovers will still taste great on Monday when you’re looking for a lunch to tote to the office.The best part is that I can make this salad without having to think about it too much, which is good because there’s this “last weekend of summer” situation gobbling up the majority share of my brain power. About that: This is a keeper recipe even though we can’t keep this season forever. In a couple of months you can make it with tart apples, bouncy strips of Tuscan kale, shaved cauliflower, and diced fennel. And chances are, after you make this one, you might not even have to look at the recipe while you throw it together.Explore Bon AppétitCarla NewsletterRead MorecultureMy Favorite Farmers’ Market Challenge RecipeBy Alex BeggscultureIs It Ever Okay...To Touch All the Tomatoes at the Farmers’ Market?By Alex BeggscookingRun, Don’t Walk, For Runner BeansBy Carla Lalli MusiccultureI Can Schlep Without Worry, Thanks to This Mesh ToteBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-29", "author": ["Condé Nast", "Carla Lalli Music"]}