{"id": "34cd8ee3a6dce69edd52d0c3aae415d9", "url": "https://www.bonappetit.com/story/best-kitchen-gifts-under-100-dollars", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "15 Best Kitchen Gifts Under $100 for Everyone in Your Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertClose15 Gifts That Are Under $100 (and a Few Splurges!)ShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopUnder $35Under $100 (And a Few Splurges!)CookbooksRestaurant MerchHealthyish FavesMarcus's PicksGift Guide 202015 Gifts That Are Under $100 (and a Few Splurges!)The best kitchen gifts for people requiring a capital G gift. You know the ones.By MacKenzie Chung FeganNovember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.We assembled our favorite gifts under $35 for all those friends and family who could use a thoughtful little something. But for your loved ones who really deserve something nice this year—whether that’s your health care worker auntie who will never spend money on herself or your Quarantine Boo who at this point is just your Actual Boo—we’ve got you covered too. Read on for statement bar carts, sacks of oysters, and a play kitchen for the trendsetting toddler who is impossible to shop for.For your friend who is sad that CSA season is overJosephine Heilpern, the ceramist behind BA editor fave Recreation Center, turned us on to Piera Bochner’s candles—one part produce and one part NSFW. Bochner learned the art of mold making while training as a sculptor in Berlin, and after casting a candle mold from a greenmarket romanesco, she knew she had found her muse. Now she scours the produce aisle for textural fruits and vegetables, like bitter melon, sugar apple, and bumpy decorative gourds, to make these whimsical candles that will delight any farmers market regular. The only thing Heilpern laments: “I can’t bring myself to burn these—they’re too beautiful.”Photo by Laura MurrayPiera Bochner Bitter Melon Candle$69 at Piera BochnerPhoto by Laura MurrayPiera Bochner Romanesco Candle$69 at Piera Bochner$65 at GarmentoryFor the Kondo convertHandcrafted by master artisans in northern Ghana, these Pakurigo wave baskets are woven from durable vetiver grass. Their undulating, organic forms—each basket is unique—remind us of mollusk shells, or maybe pattypan squash run amok. The compulsive organizer in your life will find the 12-inch basket the perfect size for stashing away winter scarves (only the ones that bring her joy!) or showcasing a clementine haul.Baba Tree Tiny Pakurigo Wave Basket$85 at Goodee World$85 at Baba TreeFor the designer-jeans fiendUlrich “Ubi” Simpson designed for brands like Tommy Hilfiger and Pepe Jeans for 25 years, but he hadn’t spent much time in the kitchen until the birth of his daughter. It was then that he saw a need for durable, protective aprons, oven mitts, and pot holders, and Mi Cocina was born. His pieces are crafted from hard-wearing denim that gets better with age. The classic apron comes in four different washes with cross-back adjustable straps and all the pockets your Re/Done-loving brother could need.Mi Cocina Denim Apron$99 at Mi Cocina$99 at GarmentoryFor the minimalistCeramist Lalese Stamps was feeling stuck. “I was making the same pieces over and over—pieces that people really wanted to buy—but I wasn’t challenging myself,” she recalls. To break out of her rut, Stamps set a goal of making a different mug every day for 100 days. She chose sleek black clay for the project and fashioned a different handle for each. One resembles the rings of Saturn, another a tiny steering wheel, and a third sports spikes worthy of Bowser Koopa. Fun yet modern, they’re like the little black dress of coffee mugs.Lolly Lolly 100 Day Project Mug$52 at Lolly Lolly CeramicsFor your compost-loving sister with no outdoor spaceYour sister ended her worm bin composting experiment when they escaped from under the kitchen sink, and now that she’s saving her food scraps to drop off at the local greenmarket, she doesn’t have any room for her Quorn patties in her freezer. The Vitamix FoodCycler offers another solution. This countertop appliance, which is about the size of a breadmaker, dehydrates and grinds food scraps down into nutrient-rich dust. Combined with potting soil, it’ll keep your sister’s houseplants happy and healthy.Vitamix FoodCycler FC-50$400 at Vitamix$400 $280 at AmazonFor the host whose party is canceled this yearWe all have that friend who throws the holiday party of the season, the one with a giant bowl of punch and a cheese ball the size of a baby’s head. Chances are he’s spending this year on the couch, watching a slideshow of holiday parties past. (Cue “The Way We Were.”) Cheer up the off-duty host with a sack of Sweetwaters from Hog Island Oyster Co., an oyster farm north of San Francisco that is selling directly to consumers as a way to make up for decreased demand from restaurants. He can slurp his fill without worrying about guests spilling cocktail sauce on the rug.Extra Small Hog Island Sweetwater Oysters$75 at Hog Island Oyster Co.For your older sister who’s all about form and functionIs it a necklace or a trivet? Crafted from solid brass, this set of trivets comes in three different sizes to accommodate your tiniest pot and largest casserole dish. The organic lines call to mind puddles of water, clouds, or various types of potatoes, but whatever your Rorschach test results, your discerning sis will think they’re beautiful enough to leave on any table 24/7.Ferm Living Pond Brass Trivets$69 at END.For the midcentury-modern aficionadoPastry chef Ayako Kurokawa, owner of the tiny Brooklyn bakery Burrow, swears by this set of stainless-steel bowls from Japanese midcentury industrial designer Sori Yanagi. “They’re both beautiful and practical—stackable and easy to hold,” Kurokawa explains. Yanagi, whose furniture appears in the permanent collections of the Museum of Modern Art and the Louvre, was guided by the philosophy, “True design lies in a realm counter to trends.” These simple, durable bowls are the antithesis of trendy, and for Kurokawa, no others will do; she brought her own personal set to Burrow as soon as she signed the lease.Sori Yanagi Stainless-Steel Bowls$217 at JinenFor your auntie who keeps the Kikkoman dispenser with the red spout on her counterMade by Tokyo’s oldest glassmaker, Hirota Glass, this delicate soy sauce cruet has milky opalescent stripes and holds five ounces of liquid. Help your auntie level up her kitchen countertop by encouraging her to keep it on a tray by the stove, next to the oil and the salt that is definitely still in its carton. You can get her a nice salt cellar next year.Whitney OttSoy Sauce Cruet$52 at East ForkFor the green pink thumbWe’ve already proclaimed this the Year to Grow Indoor Citrus, and we’re doubling down with this variegated pink lemon tree. With painterly green stripes on the rind and blush pink flesh inside, pink lemons are a serious contender for Most Beautiful Citrus (we love you anyway, ugli fruit). If you’re giving this to someone who doesn’t live in a warm, sunny climate, the tree can still thrive indoors with the right amount of sunlight and humidity.Variegated Pink Lemon Tree$68 at TerrainFor your mother-in-law who loves a statement pieceWe love marble—who doesn’t love marble?—but we don’t always love the price. A great alternative is onyx, a type of quartz that, according to the ancient Greeks, formed from the fingernail clippings of the goddess Venus. We’ll take a hard pass on that origin story, but this gorgeous centerpiece, hand-carved by artisans in Pakistan using stone mined in Peshawar and Quetta, will please even the hardest-to-please in-law.Photo by Laura MurrayThe Artisan Variety Onyx Stone Bowl$105 $84 at EtsyFor the ambitious toddlerFrankly, this kitchen makes us feel attacked. The subway tile. The brass hardware. The Pantone Color of the Year cabinets. We want this for our kitchen. Are we being actively mocked, mocked by children who are still in diapers? This play kitchen comes with a lidded pot, saucepan, spatula, cutting board, and wireless telephone, so your kid can order takeout on the nights they don’t feel like cooking.Teamson Kids Little Chef Berlin Modern Play Kitchen$199 $173 at Walmart$181 at MaisonetteFor your nephew who just moved into a 300-square-foot studio apartmentBA editor Elyse Inamine uses this mod rolling shelf as a bar cart, but we think it would make a great addition to your nephew’s 300-square-foot apartment with no closets. It’s endlessly adaptable. He can use it in the kitchen to store boxed macaroni and protein powder, as a nightstand by his bed, or in the bathroom for grooming products and toilet paper. (Who are we kidding, he never has toilet paper.) Even if he doesn’t know how chic this cart is, he’ll thank you.CB2 Peekaboo Acrylic Rolling Two Shelf Cart$349 at CB2For the golden child of the familyIt’s no secret that we here at BA believe a set of fine-mesh strainers is an indispensable addition to any kitchen. But presenting your little sister with practical $12 cooking utensils doesn’t exactly scream “festive!” The holidays call for excess and frippery and GOLD, so get her these gilded ones instead. She can use the large one to drain lentils, the medium one to separate out the seeds from raspberry purée, and the tiny one to sift powdered sugar over a flourless chocolate cake. And when they’re not in use, they’re beautiful enough for your sister to keep on display rather than tucked inside a drawer with the vegetable peeler you got her last year.Photo by Laura MurrayGold Stainless-Steel Strainers$58 at TerrainFor you, because you deserve something niceThere’s no other way to put it: This is a $100 Champagne coupe. Is it extravagant? Yes. Frivolous? Perhaps. But you’re probably not throwing a raucous holiday bash this year, so you have no need for a set of 20 Champagne glasses. Maybe your “New Year’s Eve party” is you, a bath, a bag of Takis, and a single perfect Champagne coupe. It’s been a rough year. Get yourself something nice.Calici Milanesi Champagne Coupe$100 at The WebsterExplore Bon AppétitShoppingGift GuidesHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-17", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}