{"id": "34d343138d855c4e00b5480186a64787", "url": "https://www.bonappetit.com/recipe/black-pepper-tofu-and-asparagus", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Black Pepper Tofu and Asparagus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlack Pepper Tofu and AsparagusBy Sarah JampelMay 11, 20204.7(155)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Bowl by Meilen Ceramics EmailPinterestPrintEmailPinterestPrintIn this 30-minute dish, which is inspired by Yotam Ottolenghi's recipe in his 2011 book Plenty, black pepper is the star, not the sidekick: When bloomed in oil, the coarsely ground peppercorns become piquant and fragrant enough to flavor the entire sauce, no red pepper flakes, dried chiles, or hot sauce needed. Take care not to burn the peppercorns as you toast them or the flavor could swing from spicy to bitter.Ingredients2 servings114-oz. package firm or extra-firm tofu, drained1Tbsp. black peppercorns2garlic cloves11½\" piece ginger, peeled1Tbsp. cornstarch½tsp. kosher salt3Tbsp. extra-virgin olive oil1lb. asparagus, trimmed, cut into 1½\" pieces⅓cup soy sauce1Tbsp. sugar1tsp. unseasoned rice vinegarCooked white or brown rice (for serving)PreparationStep 1Wrap tofu in a clean kitchen towel and place in a shallow baking dish or on a rimmed baking sheet. Weigh down with a heavy object (a cast-iron skillet topped with a couple of heavy cans works well). Let sit at least 15 minutes and up to 1 hour (go the full time if you can).Step 2Meanwhile, coarsely crack peppercorns in a spice mill or with a mortar and pestle (you can use a chef’s knife or a very heavy object, although be prepared for some peppercorns to fly!); set aside. Finely grate garlic and ginger into a small bowl; set aside.Step 3Unwrap tofu and cut into 1\" cubes. Transfer tofu to a medium bowl. Add cornstarch and salt and toss gently to coat tofu.Step 4Heat oil in a large nonstick skillet over medium-high. Arrange tofu in skillet in a single layer and cook, turning occasionally, until golden brown and crisp all over, 6–8 minutes. Using tongs or a slotted spoon, transfer to a large plate or baking sheet.Step 5Reduce heat to medium and add reserved cracked pepper to skillet. Cook, stirring often, until very fragrant, about 2 minutes, then add asparagus and cook, stirring often, until bright green, about 1 minute. Add reserved garlic and ginger and cook, stirring constantly, until fragrant, about 1 minute.Step 6Return tofu to pan and gently toss to combine. Increase heat to medium-high, add soy sauce and sugar, and cook, tossing occasionally, until sauce thickens slightly, about 3 minutes. Remove from heat and add vinegar. Taste and add more salt and/or vinegar if needed.Step 7To serve, divide rice among plates and top with tofu mixture.How would you rate Black Pepper Tofu and Asparagus?Leave a ReviewTell us what you thinkReviews (73)Back to TopTriangleI've made this recipe three other times. I don't think the salt flavor is too strong. It's fine for me and my boyfriend. The pepper will cause some stingy in the eyes and maybe some coughing, but I come from a household where we roasted out chiles over a flame, so it's not that bad. Overall, I love love LOVE this dish! I love tofu dishes so much and the spicy, saucy, tingly flavor is perfect over a bed of rice. Definitely recommend this recipe.Julie D.Hanford, CA1/25/2022Overall pretty good, but too salty even with less soy sauce based on other reviews, and I’m generally not that salt-sensitive. I would make the following changes next time: half the soy sauce and replace with water, half the pepper (my whole house was coughing and sneezing), and 1.5x the sugar. SheridanTexas1/17/2022Great recipe - taste was amazing.  Quick and easy for an impressive weeknight meal.  I adapted a bit to use a wok for even easier cleanup, and left out the sugar.  There was a moment when I was sautéing the pepper that I thought I goofed - the smell that black pepper emitted was very pungent to say the least.   Will also have to adapt it a bit next time to make more so there is leftovers for the next day!Nick LaTronicaNew York, NY1/13/2022This was good, but as others said, it’s too salty and I would not only add water to the soy sauce, but double the sugar as well. We had it with sushi rice that was unsalted. My partner had no complaints, so the salt level might be fine for some folks.  CakieTucson, AZ1/5/2022So good. Crushing the peppercorns is a pain, but I'm thinking of investing in a spice mill just for this dish. Definitely reduce the soy sauce (try 1/4 cup with a little water); I used the full amount the first time and it was too salty. SusanQueens, NY6/12/2021Incredible recipe. I cut the soy down to 1/4 cup, used Chinese black vinegar instead of rice vinegar, and subbed half of the black peppercorns with Szechuan peppercorns. Best recipe from BA in a long time.Timothy S.Washington5/26/2021A great, hearty vegan dish! We went back for seconds. The black pepper gives this loads of flavor and a lingering heat. The asparagus is perfect and the tofu came out nice and toothy. I do second what everyone is saying about reducing the soy sauce to 1/4 c ... and that was with using reduced sodium soy sauce. We served it with Japanese GABA rice for a healthy base. Delish! Will definitely make again!Anonymous5/5/2021Sooo good! Tofu crisps perfectly and the sauce is just salty enough. LizOrange County, Ca3/23/2021Delish! I used low sodium soy sauce and it was just right. \n AnonymousOakville ON3/8/2021I used shrimp instead of tofu and it turned out great! I used a lot less soy sauce though based on the other reviews and could have used some more... wasn't as saucey as I'd like it to be. Generally though the flavor was delicious.Tara BToronto, ON2/22/2021Tasty but much too salty. Next time I’ll use less soy sauce and add water. Will also omit salt with cornstarch. I used a combination of asparagus, Asian greens and broccoli.  Served with coconut rice from Epicurious’ website.SuzanneVictoria, BC2/21/2021This recipe is very good but my family found it far too salty. For better results I would suggest using the 3S sauce- equal parts soy sauce, sugar and sake. AnonymousFort Lauderdale FL2/6/2021This was so good! I made with green beans bec they were in my fridge and used Chinese black vinegar instead of rice vinegar. Truly delicious and so simple. At it with some simple white rice - can’t wait to make it again! A JToronto, Ontario, Canada 2/1/2021I never ever leave reviews, but this was SO good!!! I’m not a giant tofu fan and absolutely loved this! 10/10 completely recommend!!ChrisChicago, IL1/29/2021We should have known something was wrong when suddenly we couldn't breathe and our eyes were watering . Had to open all the doors in the middle of winter. The outcome of the dish was even worse, a bitter pepper flavour overpowered everything. Perhaps we used too much pepper, perhaps we ground the pepper too fine, perhaps we burned the pepper. Perhaps all three led to our near-lethal experience. Went to bed hungry and wheezy. \nErik Brown & Vanessa HariMontreal, Quebec1/26/2021Explore Bon AppétitStir-FryAsianAsparagusVegetableTofuOther IngredientsGingerHerbs & SpicesSpringQuickEasyWeeknight MealsMainDairy-FreeVeganVegetarianHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-11", "author": ["Condé Nast", "Sarah Jampel"]}