{"id": "34e46216a53c29c3c62be84a06d2a4af", "url": "https://www.bonappetit.com/story/gourmet-hot-pockets", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Claire Saffitz Wants You to Make Her Gourmet Hot Pockets and Send Feedback | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Saffitz Wants You to Make Her Gourmet Hot Pockets and Send FeedbackIt’s Gourmet Makes, but in YOUR home…By The Bon Appétit StaffMay 14, 2020FacebookTwitterEmailPhoto by Claire SaffitzFacebookTwitterEmailLast month we announced that Claire Saffitz’s hit YouTube series Gourmet Makes would be headed from its well-equipped station in the BA Test Kitchen to the comfort of her own (er...much tinier) home kitchen in New York. With this new spin, Claire is revisiting her favorite recipes from the show and modifying them to suit the tools and ingredients she’s got in her own cabinets—which just might be in yours, too. And you know what that means: We want you to cook along with us.We’re posting the recipes ahead of each show so you can make her reimagined versions of nostalgic store-bought treats, and share your experiences with us—and the millions of other people who tune in. Last time we baked Gourmet Pop Tarts! Next up: Gourmet Hot Pockets! (Watch the OG episode below!)For a chance to be featured in an upcoming episode, follow the recipe below and send a video with subject line \"My Hot Pockets\" to gourmetmakes@gmail.com showcasing your final product, explaining how well they turned out, or any snags you hit along the way. Please keep videos to 60 seconds, shot in landscape with NO music, sent in mp4 or .mov form. Submissions accepted through May 18!That time when Claire made Gourmet Hot Pockets in the Test Kitchen\nGourmet Hot PocketsThe addition of soppressata to the classic pepperoni and cheese filling in these homemade hot pockets is a definite upgrade, but you could riff on the filling any way you like (perhaps a little blanched and chopped broccoli rabe or cooked Italian sausage? Why not?). Just make sure you're not adding anything with lots of moisture, like fresh tomatoes, which could make the baked hot pockets soggy.Makes 8IngredientsDough1 tsp. active dry yeast2 Tbsp. extra-virgin olive oil1½ tsp. sugar1 tsp. kosher salt4 cups (500 g) all-purpose flour, plus more for dusting¾ cup. (1½ sticks) chilled unsalted European-style butter, cut into ½\" pieces1 Tbsp. finely grated Parmesan½ tsp. garlic powder½ tsp. onion powder¼ tsp. dried oregano¼ tsp. freshly ground black pepper¼ tsp. paprikaFilling1 24-oz. jar marinara sauce2 oz. sliced pepperoni, chopped2 oz. sliced hot or sweet soppressata, chopped8 oz. low-moisture whole-milk mozzarella, finely chopped6 Tbsp. finely grated Parmesan¼ tsp. dried oregano¼ tsp. crushed red pepper flakesKosher salt (optional)Seasoning Mix and Assembly2 Tbsp. plain fine dried breadcrumbs½ tsp. kosher salt½ tsp. onion powder¼ tsp. paprikaPinch of cayenne pepperAll-purpose flour (for dusting)1 large egg white, beaten to blendInstructionsDough: Whisk yeast and ¼ cup warm water in a large bowl until yeast is dissolved. Whisk in oil, sugar, salt, and 1¼ cups room-temperature water. Add 4 cups (500 g) flour and stir with a wooden spoon until a shaggy dough forms.Turn dough out onto a clean surface and knead to bring together and incorporate any loose flour. Continue to knead, dusting with more flour as needed to prevent sticking, until the dough is very smooth and firm and no longer sticky, 10–12 minutes. Gather dough into a ball, dust with more flour, and place in a clean large bowl. Cover with a damp towel. Let the dough sit in a warm draft-free spot until doubled in size, about 1½ hours.Meanwhile, place butter on a large sheet of parchment paper and sprinkle Parmesan, garlic powder, onion powder, oregano, pepper, and paprika on top; toss butter to coat. Place in a pile on 1  side of parchment. Fold opposite side of parchment over; lightly beat with a rolling pin in several directions until butter is pliable and forms into a single mass (it should still be cold and have a waxy texture, not soft and greasy looking). Unfold parchment and use a small offset spatula or butter knife to spread butter into about a 7\" square. Fold parchment back over butter, this time enclosing it in a neat square packet like you’re wrapping a present. Place packet seam side down, then roll over it with the rolling pin to smooth butter into an even layer and work into corners of packet. Chill until dough is ready.Turn dough out onto surface and punch down with your fist to deflate. Place on a rimmed baking sheet lined with a sheet of plastic wrap and stretch  into about a 9\" square, flattening it with the heel of your hand. Cover with another sheet of plastic wrap and freeze until dough is very firm but not frozen solid, 10–15 minutes.Remove dough from freezer and transfer to a lightly floured surface. Remove butter from refrigerator and unwrap. Place butter on top of dough, arranging in the center at a 45° angle  so it looks like a diamond set inside the square of dough. Fold dough corners up and over butter so they join in the center. Pinch along the seams to seal. You should now have a square of dough completely encasing the butter.Dust underneath and on top of dough with more flour, then roll out into a long, even slab that’s about 3 times longer than it is wide, keeping the ends as square as possible. Fold slab from short ends  into thirds like a letter to form a square packet, then rotate the dough 90-degrees and roll out again to the same dimensions. Try to work quickly to prevent butter from softening and making dough sticky and hard to roll (if this happens, chill dough about 10 minutes before proceeding). Fold in thirds again, then wrap in plastic and chill until dough is very firm, at least 2 hours and up to 1 day.Filling: Arrange a  rack in middle of oven; preheat to 350°. Line a small rimmed baking sheet with parchment paper and pour marinara onto sheet; spread into a single layer. Bake, stirring with a heatproof rubber spatula every 15 minutes, until sauce is thickened, darker in color, and starting to blacken around the edges, 45–60 minutes. Reduce oven temperature to 300° and continue to cook, stirring every 15 minutes, until sauce holds its shape and is the consistency of tomato paste, 45–60 minutes more. Let cool.Meanwhile, toss pepperoni, soppressata, mozzarella, Parmesan, oregano, and red pepper flakes in a large bowl to combine. Add reduced tomato sauce and mix well to evenly distribute. Taste filling. It probably doesn’t need salt, but add a pinch if you think it does.Using a kitchen scale, measure out filling into 60 g portions. Press each portion between your hands (wear gloves if you have them) to form tightly compacted 4x1\" rectangles. Place portions on a large plate or a rimmed baking sheet and chill, uncovered, until ready to assemble hot pockets.Do Ahead: Filling can be made 4 days ahead. Cover and keep chilled.Seasoning Mix and Assembly: Toss breadcrumbs, salt, onion powder, paprika, and cayenne in a small bowl to combine; set aside.Roll out chilled dough on a lightly floured surface to a large ¼\"-thick slab a little more than 22x11\", dusting underneath and on top with more flour as needed. Using a knife or pizza cutter, cut into a sharp even 22x11\" rectangle, then cut rectangle in half lengthwise. Cut each half crosswise in fourths to make eight 6x5½\" rectangles.Working with 1 square at a time, lightly floured work surface and thin out and elongate both longer sides of dough with rolling pin, leaving about a thicker 1½\" wide strip in the center. Place a portion of filling on thicker part, then brush thinner sides with a thin layer of egg white. Trim the thinner edges to make them straight, if needed, then fold them up and over the filling, overlapping as much as possible. Trim away all but about 1½\" excess dough on shorter sides, then pinch them firmly together to seal. Fold shorter sides up and over like a burrito. Place on a parchment-lined baking sheet, seam side down. Once you have finished assembling all of the hot pockets, make sure they are evenly spaced out on the baking sheet and cover with a damp towel. Let sit at room temperature until slightly puffed, 15–25 minutes.Meanwhile, preheat oven to 300°.Uncover hot pockets and brush all over with remaining egg white. Sprinkle with reserved breadcrumb  mixture and cut four ½\"-long vents in the surface of each one, spacing evenly. Bake until hot pockets are puffed and golden brown all over and illing is lightly bubbling, 30–35 minutes. Let cool before serving.Do Ahead: Hot pockets can be made 2 days ahead. Store tightly wrapped at room temperature.Explore Bon AppétitGourmet MakesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-14", "author": ["Condé Nast", "The Bon Appétit Staff"]}