{"id": "34f404145b8484ceae8483c31154c9d3", "url": "https://www.bonappetit.com/story/fatteh-hummus", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Don’t Ask, Because I Will Not Share My Fatteh Hummus  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Even Ask, Because I Will Not Share This Savory Breakfast With YouFatteh hummus serves four, but it’s mine, all mine.By Carla Lalli MusicMarch 14, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I had never heard of fatteh hummus until Andy Baraghani put a plate of toasty pita chips topped with yogurt, buttery nuts, and chickpeas in front of me at a recipe tasting about a year ago, but I was immediately obsessed. Obsessed! “It’s a typical part of a Lebanese breakfast,” he told me and the other tasters while I noisily crunched through layers of crisp pita and cashews, creamy dollops of cool unsweetened yogurt, and garlicky chickpeas.“Usually you would have this with some fresh radishes or cucumbers and olives to the side,” Andy continued.“Cool, man, whatever you say,” I replied while using my spoon and a pita chip to compose the perfect bite. I held it up to show everyone how the pita was cradling a swoosh of yogurt, pair of chickpeas, and a brown butter cashew on top. “Look, guys!” No one applauded, so I kept eating.“Why is this so good,” I muffled through a particularly creamy-crunchy mouthful.Want this letter before it hits the website? Sign up for our newsletter!“It’s the textures,” said Andy. “I baked torn pita with extra olive oil so they get extra dark, toasty, and crisp. Stale ones would work great.”“You’re thhooo thmart,” I said, still stuffing my face.Photo by Alex Lau“Then there’s the yogurt, which is purposely not Greek, for a change. You want that slightly flowy, drizzle-able texture for getting in and around all the ingredients,” Andy continued.“Yeah! I see how that’s doing that,” I said, again deploying my signature pita-as-shovel technique to bulldoze more chickpeas towards my face. “What the hell did you do to these chickpeas, you fiend? You made them from scratch, didn’t you. That would be so you.”“Yeah, no,” replied Andy. “They’re canned. I just warmed them up with some garlic and olive oil to make them more savory.”“Well, that worked too!” I yelled. By now, everyone else at the tasting, aware that I would not be sharing, had left the table. “Andy, why does it seem like the nuts are surrounded in a cloak of brown butter?”“Because the nuts are toasted in a skillet with foaming butter, instead of just roasting them in the oven,” he patiently responded.“You mean you are telling me that you can sauté nuts in butter and the nuts will toast and the butter will brown at the same time?! You’re an ever-loving genius, Baraghani,” I said, without making eye contact with him because I was very busy assembling more bites that combined all the soft and crisp ingredients left in the bowl.“And then I added some herbs because that’s my thing: herbs,” I heard Andy say faintly, his voice barely audible from across the kitchen. He too had decided to leave me alone with my first fatteh.“I’m going to make this,” I said to no one. There was just enough yogurt left in the bowl for the last piece of pita. “I am definitely going to make this.”Get the recipe:Spiced Chickpeas with Crispy Pita, Yogurt, and Brown ButterThis version of the Levantine breakfast dish, known as fatteh hummus, is all about the contrast of textures and flavors: crunchy pita chips, creamy chickpeas, and tart yogurt.View RecipeExplore Bon AppétitCarla NewsletterBreakfastRead MorecultureOur March Cookbook Club Pick Is Our Very Own Carla Lalli Music’s Where Cooking BeginsBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Carla Lalli Music"]}