{"id": "34f589ea19203fb368d158f492874b18", "url": "https://www.bonappetit.com/story/eat-your-way-around-europe-with-chef-mary-nolan-and-princess-cruises", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Eat Your Way Around Europe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredEat Your Way Around Europe with Chef Mary Nolan and Princess Cruises®Bon Appétit and Princess Cruises have joined forces to create one-of-a-kind excursions that put cruise goers at the center of unforgettable culinary journeys. Bon Appétit-Exclusive and Bon Appétit-Recommended excursions offer behind-the-scenes access to mouth-watering experiences, while allowing guests to deepen their understanding of each destination. That’s more than 380 destinations across seven continents to explore and enjoy.By Princess CruisesFebruary 5, 2019FacebookTwitterEmailFacebookTwitterEmailDuring every excursion, guests are immersed in local ingredients and cooking styles. Bon Appétit's Executive Chef Mary Nolan just had to experience it for herself. She set sail to Rome, Dublin, and Corfu, to taste, smell, sip, and savor her way through some of the exclusive culinary tours offered on Princess Cruises.Here’s a taste of her trip.In Corfu, Greece, Chef Nolan experienced the Greek Classics in Corfu Tour. It began with a drive through the meandering countryside of Corfu island, passing lush mountain ranges and crystal-clear waters along the way. “There were gorgeous, breathtaking views everywhere you looked,” Mary noted. Once she arrived at a local Greek restaurant, Chef Nolan learned, just as guests do, the ins and outs of preparing a classic menu including tzatziki, taramosalata, Greek salad, and moussaka, a decadent dish made from layers of minced beef with vegetables and white bechamel sauce.ContentThis content can also be viewed on the site it originates from.Chef Nolan’s next adventure took her just south of Dublin, Ireland, where she traced the steps of the Bon Appétit-exclusive tour, Baking at Ballyknocken. “The cooking school is so quaint, set in a converted barn,” Mary explains. In the sprawling green countryside of County Wicklow, she joined TV chef and food writer, Catherine Fulvio, at Ballyknocken House and Restaurant, a 4-star bed and breakfast. There the two chefs perfected the art of the scone, and then savored their pastry over a cup of tea among the lush garden scenery–exactly the way Princess guests get to enjoy the experience first-hand with this unique excursion. “I love that this excursion takes guests out of Dublin into the countryside,” adds Mary. “You really get to explore Ireland.”ContentThis content can also be viewed on the site it originates from.Finally, Chef Nolan headed to Rome to experience the Eating Italy Foodie Walking Tour, where she set out in the area of Prati to try one of Rome’s most coveted cuisines: Supplì, the famous Roman fried rice ball and Rome’s first street food, at Franchi Delicatessen. But first, breakfast at the legendary Il Sorpasso. “The city can feel overwhelming with so much to offer,” Mary said, “but our guide knew the city like the back of her hand.”Along her tour she sampled local wine, flavorful Italian olive oil, cured meats and cheeses, and, of course, sipped freshly roasted Italian espresso perfectly paired with a fluffy pastry. If that weren’t enough to conjure every foodie’s dream, she finished it all off with homemade, artisan gelato. “I learned a lot about how to spot a good gelato place,” she said. “And like the locals, we got a dollop of unsweetened whip cream on top.”ContentThis content can also be viewed on the site it originates from.On her epicurean tour of Europe, Chef Nolan was given access to a world of authentic cuisine, which is what every Bon Appétit-Exclusive and Bon Appétit-Recommended excursion is specially designed to do: marry adventure, intimacy, and authenticity, while offering guests a taste of local cuisine in Princess destinations around the world.You can find Corfu and Rome on the Mediterranean and Aegean cruises and Dublin on the British Isles cruises on princess.com. Wherever you want to go, there’s a culinary adventure waiting for you on Princess.Get In Touch With Princess: Facebook | Pinterest | Instagram | TwitterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-05", "author": ["Condé Nast", "Princess Cruises"]}