{"id": "34fed47ee37106d99fc9c6db1046521a", "url": "https://www.bonappetit.com/recipe/grilled-carrots-with-avocado-and-mint", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Grilled Carrots with Avocado and Mint Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Carrots with Avocado and MintBy Andy BaraghaniJune 18, 20184.9(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy Baraghani, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintYou actually don’t have to bother with peeling the carrots for this recipe—not only do the thin skins pack lots nutrients, but you’ll also get a better char with them on.Ingredients4 servings1tsp. cumin seeds3Tbsp. fresh lemon juice2tsp. honey¼cup plus 2 Tbsp. extra-virgin olive oil1serrano chile, thinly sliced11\" piece ginger, peeled, finely gratedKosher salt1½lb. medium carrots, scrubbed, halved lengthwise, tops trimmed to about 1\"2avocados, cut into large pieces½cup mint leavesPreparationStep 1Prepare a grill for medium heat. Toast cumin seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes. Let cool.Step 2Coarsely crush cumin seeds in a mortar and pestle or with the flat side of a chef’s knife. Transfer to a large bowl. Add lemon juice and honey. Whisk in ¼ cup oil until combined, then stir in chile and ginger. Season with salt. Let sit until ready to serve, which will give the chile and ginger time to infuse into the sauce.Step 3Toss carrots with remaining 2 Tbsp. oil on a rimmed baking sheet; season with salt. Grill carrots, turning occasionally, until lightly charred in spots and tender, 14–18 minutes. Immediately transfer carrots to bowl with sauce. Toss to coat; season with salt.Step 4Arrange avocado and carrots on a platter. Spoon any remaining sauce over, then top with mint. Serve carrots warm or at room temperature.How would you rate Grilled Carrots with Avocado and Mint?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleSo easy and yummy.\nAnonymousTulsa OK8/2/2021Delicious! I doubled the dressing and drizzled more on at the end. Coarse salt on the top. I have also made this adding grilled asparagus. Yum! Everyone loves this.Jen F.Piedmont, CA4/10/2021I could live without cooked carrots...root veggie, not exciting, BUT this was amazing. Truly amazing. Of course, most of that is grilling and the great tangy sauce, but the mint and avocado were nice cool offsets to the sauce. Highly recommend, especially when your CSA has too many carrots. Plus it's tasty hot or room temp. Love it.Anne San Diego, CA3/28/2021Ehhhhhh. Just ok. Anonymous12/17/2020Amazing, delicious and so flavorful.  I've made this numerous times.  I roast the carrots in the oven and always double the recipe.  I find the mint to be delicious but I've also made this with basil.  I've also used Cumin powder when I don't have seeds.  Enjoy!AnonymousHarrison, NY11/21/2020Next time I need to make sure to sear the carrots for longer but this turned out so well and was truly so easy! Highly recommend! AnonymousNew York9/29/2020Literally obsessed with how this turned outAnonymousNew York9/29/2020This is a very easy recipe with a big payoff in flavor.  The dressing was so good I saved what was left in the bottom of the dish and used it as a vinaigrette the next day; didn't want to waste a drop!AnonymousCold Spring Harbor, NY7/31/2020Amazing flavor. The ginger gives the carrots a zing and the the peppers give a surprising kick!AnonymousBelleville,Il6/27/2020Surprisingly amazing. Will be grilling all of my garden carrots this season!AnonymousCalifornia6/17/2020We were surprised by how good this was! My serrano had gone bad so substituted it with a healthy dose of red pepper flakes. Agree with Erockett that the mint should be chopped up. Looking forward to making this again for the next family bbq.AnonymousEl Paso6/10/2020We absolutely LOVE this recipe and are making it again now that it’s getting warmer. It just feels right. The sauce is soooo good. Eric WakelingTustin, CA4/30/2020SO GOOD - I could drink that sauce all day 😍AnonymousCanada 4/4/2020This was one of the best carrot dishes I’ve ever had.  It was a perfect balance of spicy, sweet, sour and rich.  I’m salivating just reminiscing about this recipe.  I’ll be making this all summer long.OgbmoreChicago6/25/2019Made this last night and it was amazing.  The only thing I had to change was adding more honey to the dressing.  Also I’d chop the mint next time.  But overall a huge winner- I’ll be making this all summer!erockettNew York 6/24/2018Explore Bon AppétitCarrotVegetableAvocadoMintHerbs & SpicesEasySideDairy-FreeGluten-FreeNut-FreeVegetarianHealthyishGrillingRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-15", "author": ["Condé Nast", "Andy Baraghani"]}