{"id": "350901f0fa3534423fa3543689ae83ff", "url": "https://www.bonappetit.com/recipe/butter-pecan-skillet-cookies", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Butter Pecan Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueButter Pecan Skillet CookiesBy Rick MartinezNovember 19, 20194.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintIt looks like cake. It tastes like butter pecan ice cream. You don’t need a baking sheet to make it. But don’t let anyone try to call you out on a technicality—one bite and it’s clear this big sliceable round boy is all cookie. Maple-syrup-glazed pecans in the dough lend nutty depth, then get sprinkled on top with sugar for an icicles-on-tree-branches vibe sure to freeze out the cookie swap competition.IngredientsMakes about 161⅓cups (160 g) chopped pecans4Tbsp. pure maple syrup2tsp. kosher salt, divided10Tbsp. chilled unsalted butter, cut into pieces, plus more for pan1¼cups (160 g) all-purpose flour6Tbsp. (packed; 75 g) light brown sugar1large egg1Tbsp. plus 1 tsp. vanilla extract or vanilla bean paste1cup (120 g) powdered sugar3Tbsp. (or more) whole milkCoarse white sanding sugar and edible glitter (for decorating)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Toss pecans, maple syrup, and ½ tsp. salt in a medium bowl. Scrape onto a rimmed baking sheet lined with a silicone baking mat or parchment paper and spread nuts into a single layer. Bake until pecans are slightly darkened and syrup is dark and bubbling, 15–20 minutes. Remove from oven and carefully toss pecans in hot syrup to coat again. Let cool on baking sheet until caramel hardens, about 30 minutes. Break up candied pecans into pieces; discard any burned bits.Step 2Reduce oven temperature to 325°. Generously butter a 10\" cast-iron or stainless-steel skillet; line bottom with a round of parchment paper and butter parchment. Pulse flour, brown sugar, half of candied pecans, and 1¼ tsp. salt in a food processor until nuts are finely chopped. Add egg, 1 Tbsp. vanilla, and remaining 10 Tbsp. butter and process until a shaggy dough forms.Step 3Transfer dough to a large bowl and knead a couple of times just to bring it together. Using damp hands, pat dough evenly into skillet, extending all the way to the sides of the pan. Bake cookie until edges are golden brown and center is slightly puffed, 30–35 minutes. Let cool in skillet 1 hour. Invert cookie onto a cutting board and cut into 16 wedges. Turn right side up and transfer to a wire rack set inside a rimmed baking sheet.Step 4Whisk powdered sugar, milk, remaining ¼ tsp. salt, and remaining 1 tsp. vanilla in a small wide bowl until smooth. The glaze should be the consistency of heavy cream; thin with more milk if needed. Transfer half of the glaze to another small wide bowl (you’ll need to use 2 bowls as the glaze will start to collect crumbs and you’ll want a fresh start).Step 5Working one at a time, lightly dip half of the wedges, top side down, into first bowl of glaze so that only the surface is covered and no glaze drips down the sides. Use a toothpick to pop any bubbles and smooth glaze; coating should be thin enough to see the cookie peeking through. Repeat with remaining wedges and second bowl of glaze.Step 6Top wedges with remaining candied pecans and let sit 10 minutes. Sprinkle with sanding sugar and glitter and let sit until glaze is set, about 1 hour.Step 7Do Ahead: Cookies can be baked 1 day ahead. Store airtight at room temperature.How would you rate Butter Pecan Skillet Cookies?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleAlways a crowd pleaser!! Perfect ‘grown up’ cookie that everyone always loves. I’ve made them so many times and never get over them!AnonymousAustralia8/8/2021Guessing all the folks complaining about saltiness either did not use KOSHER salt or they did use it but didn't realize some kosher salts taste way more salty than others.\n\nBest guess: Rick Martinez used Diamond Crystal kosher salt when developing the formula. Just meCT3/21/2021Not my favorite... cookie was way too salty and when baked turned into a dry crumbly mess. The icing coat also made it overly sweet. The best thing about it was the glazed pecans which I just ate by themselves. I agree with ANONYMOUS from Denver when he wrote \"almost Nature Valley Bar level\". I don't usually write negative comments, but this recipe truly made my stomach hurt. DO NOT TRY THIS RECIPE!YOURS TRULYHOUSTON6/19/2020I wanted to love these cookies, but they were way too salty for my taste. Also, the dough was too dry, resulting in a crumbly mess as an end product (almost Nature Valley Bar level). AnonymousDenver1/2/2020Pretty easy to make, and people loved them. I added flakey salt on top as decor, which I prefer to added sugar. I'll note that they don't keep at all, I made them on Thursday and by Saturday the candied pecans had become syrupy again which was a mess. Also be super careful of the tips, they break off just for the heck of itAnonymousmichigan12/23/2019These are SO GOOD. Very rich and nutty and not too sweet. I found them a tiny bit salty for my tastes (followed recipe exactly using Diamond Crystal kosher salt) but will absolutely make them again a tad less salty on the glaze maybe. I spread the glaze On the cookies with an offset spatula to prevent them from crumbling and it worked great, but a half batch of glaze would have been more than enough. You can use the glaze to “glue” any cracks together too, just smush them up against the baking sheet sides to hold them together while the glaze dries- worked like a charm. They looked gorgeous served on a cake plate!dcdoDC12/16/2019I loved making this recipe and the taste is really great. My concern is that once I made the cookie when it was cooled it was too crumbly to pick up to dip into the glaze, I ended up having to spoon it on. This was only my first time trying the recipe but does anyone have any advice on how to make the cookie stick together a little better? AnonymousBloomington, Indiana12/15/2019Thank you for putting gram weights in this recipe.AnonymousSeattle12/14/2019My main criticism is that these cookies are a little putzie. Next time I'll maybe bake the pecans or make the cookie ahead of time. I definitely added 2-3x as much milk to the glaze as it called for in order for it to be as thin as it called for and I don't think I needed the 2 bowls of glaze. My cookie wasn't that crumbley. Love the taste. 10/10 would make again.AnonymousDuluth, MN12/11/2019I don’t normally post reviews on here but this was so good I couldn’t help myself. A truly 5 star dish. The cookie itself is very much like shortbread so it has that trademark sandy texture and shouldn’t rise or become cakey which was mentioned in another review. With the glaze, they are pretty rich and sweet which I personally love (and the richness keeps me from eating all the cookies in one sitting). The only alteration we made was instead of dipping the cookies in the glaze, we spoon drizzled it over the cookies on the wire rack then smoothed with an offset spatula which worked great. We were worried that with the crumbly texture of the cookies that they would break if we dipped them.AnonymousLos Angeles, CA12/10/2019I'm confused by the lack of baking soda or baking powder - the cookie never rose and it fell apart once baked and cooled,  making it impossible to salvage inro an actual cookie Disappointing because I wanted to take them to the office to share. The crumbles will make a tasty yogurt topping I guess (I'm not wasting the ingrediemts!).TColleenFort Wayne, IN12/9/2019This cookie tastes like the holidays. The dough has great flavor and texture, and the candied pecans on top add an extra crunch that is absolutely divine. It was surprisingly easy to make, and the results (both in flavor and aesthetically) were superb.CalizonaCookLos Angeles11/29/2019Explore Bon AppétitCookieDessertAmericanPecanNutBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}