{"id": "351400900fe085f993472f344ade5c49", "url": "https://www.bonappetit.com/recipe/porterhouse-with-summer-au-poivre-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Porterhouse With Summer Au Poivre Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssuePorterhouse With Summer Au Poivre SauceBy Chris MoroccoJune 2, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintGetting the interior of a porterhouse steak to a blushing, consistent medium-rare is a feat, one that chef Christina Lecki, formerly of Brooklyn’s Reynard, accomplishes by keeping the steak in near perpetual motion while it’s on the grill. Constantly repositioning the meat relative to the fire ensures that the strip side gets most of the heat while the tenderloin stays protected, and the plattered steak looks like a marvelous meaty magic trick. In the sauce, pickled green peppercorns (find them here) give a softer punch than black, plus chewy pops of texture. Their bright floral aroma is ideal for this summery riff on steak au poivre, but if you can’t find them, just use half the amount of black peppercorns.Ingredients2–4 servingsVegetable oil (for grill)2Tbsp. drained pickled green peppercorns, plus more for serving½cup (packed) basil leaves½cup (packed) mint leaves½cup extra-virgin olive oilKosher salt12 lb. porterhouse steak (about 2\" thick), preferably prime or as well-marbled as you can findPreparationStep 1Prepare a grill for high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); oil grate with vegetable oil. Coarsely chop 2 Tbsp. peppercorns, then coarsely chop basil and mint right on top of peppercorns. Transfer to a small bowl and mix in olive oil; season with salt. Coarsely chop a few more peppercorns and set aside for serving.Step 2Season steak generously with salt. Grill over direct heat, keeping tenderloin (the smaller side) away from the most intense heat and turning steak about every minute or so to control flare-ups and ensure even browning, until deeply browned on all sides (including standing it on its side with tongs to render and brown fat around edges), 6–8 minutes.Step 3Move steak over indirect heat (still positioning tenderloin side away from the heat) and grill, turning every 1–2 minutes and moving closer to or farther away from heat as needed to build even color, until an instant-read thermometer inserted into the thickest part of steak registers 120° for medium-rare, 10–12 minutes. Transfer to a wire rack set over a rimmed baking sheet and let rest 15–30 minutes.Step 4Transfer to a cutting board and cut meat away from each side of the bone, then slice crosswise. Serve topped with sauce and reserved peppercorns.How would you rate Porterhouse With Summer Au Poivre Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleReally great!AnonymousDetroit, MI5/28/2021This is a lovely recipe, made it last night. If you can't find pickled green peppercorns but can find dried at your local supermarket, you can pickle them yourself, in equal parts white vinegar and boiling salted water. AnonymousIthaca, New York6/17/2020Explore Bon AppétitSteakBeefMeatBasilHerbs & SpicesMintSummer5 Ingredients or FewerMainDairy-FreeNut-FreeGluten-FreeKetoGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}