{"id": "351d53420bb30436c0de91ee7c2bf34d", "url": "https://www.bonappetit.com/story/the-power-of-pelau", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Pelau, the Unofficial National Dish of Trinidad and Tobago, Is Powerful, Nuanced, and Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Learn About Trinidad and Tobago, Start by Cooking PelauIt encapsulates the richness of a multicultural society and its history of triumph and tragedy.By Brigid WashingtonMarch 17, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellFacebookTwitterEmailTrinidad and Tobago’s pelau is the type of dish that life doesn’t make anymore. Like the twin islands, pelau is complex and nuanced. It’s a twisty story of a meal that incorporates the culinary legacies and cooking techniques of the two most dominant ethnicities on the islands, Africans and East Indians. Pelau does more than just capture and reflect the cultural vibrancy of Trinbagonian life—it tells of the country’s tragic and triumphant history, encapsulating the richness of a truly multicultural society.Pelau is not dissimilar from other protein-rich rice dishes found throughout the world. Like jambalaya, biryani, and paella, pelau is rice cooked with protein, aromatics, and vegetables. Typically, chicken or beef is used in pelau, and it’s seasoned with a bevy of pungent herbs and aromatics—scallions, cilantro, parsley, thyme, onions, ginger, garlic, and Scotch bonnets. This marinade provides an assertive and arresting bedrock of bright, unrelenting flavors in which the other ingredients—long-grain rice, pigeon peas, root vegetables, and coconut milk—are slowly simmered.But it’s also a lot more than its parts. As one of Trinidad and Tobago’s unofficial national dishes (callaloo is another), pelau is a homegrown darling and its widespread appeal goes beyond its luscious and spiky bite. The power of pelau is in the way that its components give veiled visibility to almost all of the nation’s composite groups, from the Indigenous Amerindians (native herbs), to the European colonizers (oils), to the enslaved West Africans (pigeon peas), as well as the indentured laborers from the Indian subcontinent (rice). With a distinct island lilt, pelau melds the rice preparations adored in the East with indigenous ingredients and African cookery processes that took root in the Caribbean during the transatlantic slave trade. It manages to collapse the gulf between faiths and factions, being for Trinidadians of all stripes a dish that amplifies the islands’ history.There is no precise certainty regarding when pelau first burst onto the scene, but it’s widely believed to have originated from polow, a popular rice dish in the Middle East and South and Central Asia that was adapted by East Indians into pilau (the Anglicized reworking being pilaf). In the mid-1800s, after slavery was abolished in the Caribbean, the first group of indentured laborers from the subcontinent was brought to Trinidad and Tobago on a ship called the Fatel Razack, and their arrival sparked the advent of a rich and robust Indian culture. Like many dishes from the East that were hybridized in the West Indies, pelau is a product of geographic syncretism: Rice, brought over from India, was cultivated in Trinidad’s fertile Caroni swamp, and the cooking technique of charring meats in scorched sugar is an African tradition. There exist few other dishes that hold the weight of the country’s history, and it is in this marvelous motley that pelau retains its cultural relevance. But it is in the deep and distinctive taste, where bright and bold savory flavors erupt, that pelau truly shows its steel. And it starts with sugar.Burnt sugar essence (a.k.a. browning) is the ingredient that imparts pelau with its unmistakable darkness—and there can be no pelau without it. An essential ingredient in Caribbean cooking, browning harks back to an era when sugarcane, powered by slave labor, anchored the British economic interest in Trinidad and Tobago. The inclusion of browning in pelau and in many other native Caribbean dishes, like Black Cake, moves the brutal past of plantation slavery from the periphery of memory to the forefront. As Trinidad’s first prime minister Dr. Eric Williams wrote in his landmark book Capitalism and Slavery, “Strange that an article like sugar, so sweet and necessary to human existence, should have occasioned such crimes and bloodshed.”Even though bottled offerings are readily available in grocery stores and online retailers, browning is easy enough to make at home—and useful enough that you’ll want to. It’s made by burning brown or granulated sugar in oil over high heat until the sugar crystals caramelize and solid granules turn from small amber globules to large black viscous orbs. The browning is ready when all the sugar has reached a rich dark brown (but never black) hue. In the case of pelau, when the well-marinated meat gets tossed and turned in fresh browning, it takes on a perceptible smokiness and mild sweetness that adds to the dish’s depth and complexity. Browning is the fundamental feature that adds a deep, rich hue, allowing all the other ingredients (grassy pigeon peas, earthy-sweet carrots, and nutty rice) to absorb deep flavor while cooking on the lowest possible flame.The slow, tender and uninterrupted development of pelau is an integral part of the process. The pot should be left alone to simmer without any disruptions so as not to interfere with the formation of a burnt layer that adheres to the bottom of the pot, which locals affectionately call “bun bun.” For many, the bun-bun—the last and lowest burnt black bits that one might be tempted to scorn or discard—is the most favored part of pelau, a telling preference that points to a larger social metaphor that even lowly spaces can be a source of goodness and delight.Last month on a trip to Tobago, I asked my mother how my grandmother, Teacher Cadet, made pelau. With folded arms and a faraway smile, my mother regaled me with stories from her childhood in south Trinidad. I hung on to her every word as I watched her dormant memories come to vivid life. She reminisced about the massive “heavy iron pot” her mother employed, as well as the hours-long process of shelling fresh pigeon peas, with a deserved chide directed my way: “None of that canned peas business you buy.” My mother’s memories were elastic, stretching wide and deep to connect me to a grandmother I’ve only known through stories and sepia-toned photographs.It was deeply reassuring that not much has really changed between that pelau and the one that’s two generations removed. When I make pelau now, at home in Raleigh, North Carolina, the flavors still roar and roll in a manner similar to that of my mother’s and, as I now know, my grandmother’s, too. In making pelau, I’m walking directly into the line of sight of a grandmother I’ve never met, and I feel embraced by her unrealized love, which will always be near and nourishing. By binding and yoking history and people across time and space, all in one unpretentious and unassuming pot, pelau is exactly the meal that Trinbagonians both need and want.Brigid Washington is the author of the forthcoming cookbook Caribbean Flavors for Every Season.Get the recipeTrinidadian Beef PelauThis one-pot wonder is Trinidad and Tobago’s unofficial national dish and a vibrant reflection of some of the Caribbean’s finest flavors: bright herbs, spicy-sweet aromatics, and rich coconut milk. View RecipeExplore Bon AppétitcookingCaribbeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-17", "author": ["Condé Nast", "Brigid Washington"]}