{"id": "352b21cd2741701c19b5021d4d503a6e", "url": "https://www.bonappetit.com/recipe/milk-and-honey-pie", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Milk and Honey Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueMilk and Honey PieBy Sohla El-WayllyOctober 20, 20203.3(31)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintA custard pie inspired by the milk and honey-based desserts across India, Bangladesh, and the Middle East, with milk powder in the meringue that makes it almost creamy in the middle, chewy on the outside—similar to the texture of pavlova. Use a mild honey so the flavor doesn’t overwhelm the pie. Mounding the meringue onto the pudding while it is still hot helps it set better so you don’t end up with a weepy, slip-slide-y meringue. This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.Ingredients6 - 8 ServingsCrust1Tbsp. sugar1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt1½cups (188 g) all-purpose flour, plus more for dusting12Tbsp. (1½ sticks) chilled unsalted butter, cut into ½\" piecesHoney pudding¾cup honey⅓cup (45 g) cornstarch¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt5large egg yolks2large eggs1½cups whole milk1cup heavy creamMilk meringue and assembly¼cup (35 g) nonfat milk powder1Tbsp. cornstarch1cup (200 g) sugar, divided5large egg whites¼tsp. kosher saltPreparationStep 1Whisk sugar, salt, and 1½ cups (188 g) flour in a medium bowl. Add butter and toss to coat and distribute. Using your hands and working quickly, rub and smash butter into flat irregular pieces. (Be careful not to overwork; you don’t want to soften the butter too much. Just make sure you smash each piece at least once.) Drizzle ⅓ cup cold water over and mix with a rubber spatula, smashing in butter, until dough mostly comes together; it will be dry and shaggy.Step 2Turn dough out onto a lightly floured surface. Gather dough into a rough 1½\"-thick square. Lightly flour dough and gently press and roll out to a ½\"-thick square. Fold dough in half, then in half again to make a square. Repeat rolling and folding process 2 more times. Pat dough into a disk, wrap tightly in plastic, and chill at least 2 hours.Step 3Dust dough with flour and place on a lightly floured surface. Using rolling pin, gently press out dough while rotating until just under 1\" thick. Lightly flour both sides of dough and continue rolling out, stopping often to turn dough and flour, to a 13\"–14\" round about ⅛\" thick. Brush off excess flour on both sides. Fold dough in half, then in half again, and transfer to a 9\"-diameter pie dish. Unfold into dish and lift edges to allow dough to slump into dish. Gently press into dish. Using kitchen shears or a small, sharp knife, trim off any excess dough so you have about 1½\" overhang. Fold overhang under dough and crimp edges as desired. Chill in freezer at least 1 hour.Step 4Place a rack on the lower third of oven; preheat to 350°. Line crust with 2 layers of foil, making sure to cover edges. Fill with pie weights or dried beans (go all the way to the top). Set on a baking sheet and bake 1 hour. Transfer to a wire rack and let cool 15 minutes.Step 5Remove pie weights and foil. Use the same foil to cover edges of crust, leaving sides and center exposed. Return to oven and bake until golden brown, 25–30 minutes. Transfer to rack and let cool.Step 6Do ahead: Dough can be made 3 months ahead; cover and keep frozen. Thaw at room temperature 1–2 hours or in the fridge overnight before using. Crust can be baked 3 days ahead; store tightly wrapped at room temperature.Honey puddingStep 7Whisk honey, cornstarch, and salt in a medium saucepan until smooth. Add egg yolks and eggs and whisk until well combined. Stream in milk and cream, whisking until incorporated. Cook over medium-high heat, whisking constantly, until mixture thickens and begins to bubble, about 5 minutes. As soon as you see that first bubble, set a timer and simmer 1 minute. (This ensures that the cornstarch is fully hydrated and a protein-dissolving enzyme found in eggs is deactivated.) Pour into pie crust; smooth surface.Milk meringue and assemblyStep 8With rack still in lower third of oven, preheat oven to 350° if needed. Pulse milk powder, cornstarch, and 2 Tbsp. sugar in a spice mill or blender until fine; set aside.Step 9Pour water into a clean medium saucepan to come 2\" up sides; bring to a simmer over medium heat. Whisk egg whites, salt, and remaining sugar in the bowl of a stand mixer just to combine. Set over pan of simmering water and cook, stirring and scraping bottom and sides constantly with a heatproof rubber spatula, until warm to the touch and sugar is dissolved, 5–7 minutes. Fit bowl back on stand mixer, attach whisk, and beat mixture on high speed until thick and fluffy and meringue balls up inside whisk, about 4 minutes. Reduce speed to low; sprinkle reserved milk powder mixture over and beat just to combine.Step 10Using a spoon, pile meringue over pudding and spread to edges, creating big swoops and swirls. Place in oven and immediately reduce heat to 250°. Bake until meringue is golden brown and crisp on the outside but still soft on the inside, about 75 minutes. Chill 3 hours before serving. Slice with a barely damp serrated knife for clean portions.How would you rate Milk and Honey Pie?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI made this recipe last year for Thanksgiving and again this year.  It is a total crowd pleaser!  Everyone loved it.  Yes, the first time I made it I used 3 sticks of butter for the crust and it was too much.  Half of that is good.  Maybe everyone I know likes sweet things but no one said the custard was too sweet.  The meringue is tricky to make (I had to do it twice to figure it out) but worked once I got the hang of it.  My guests all asked for the recipe.  susan schmitzMadison, WI11/26/2021This recipe sounded so good in concept but the combination of meringue and honey pudding is sickly sweet to the point of being inedible. It's also nearly impossible to get a crispy top on the meringue (I baked it for much longer than suggested trying to achieve that texture). I think it might have something to do with all the moisture in the oven from the pudding. As other reviews have noted, the pie crust recipe also is not great. What you end up with is a mushy pie that's too sweet to eat. I had to throw most of this away because I couldn't convince anyone to eat it!AnonymousMassachusetts10/13/2021Please don’t be dissuaded by the negative reviews. I’m not a master of pie baking by any means but this was my best pie to date and all I did was give myself enough time and read through the recipe carefully. It is definitely very sweet, but the flavours are rich, and complex and gorgeous. Truly though, the crust was incredible and unbelievably flaky, just make sure you read the recipe and get the butter right. 10/10 would bake againC10/11/2021Halved the butter and this turned out excellent!Clara12/25/2020I was a little nervous after reading the reviews, but I had already committed to making this pie for Thanksgiving.  Plus, half the time when reviews on a recipe are bad it's because whoever made the recipe changed something or messed something up.  This is an excellent example of that. \n \nWhoever said they used 3 sticks of butter apparently can't do math, because that's twice as much butter as the recipe calls for.  I will say that the crust gives me more shortbread vibes than pie crust vibes, but I'm honestly not mad.  I felt the crust was a bit too salty, but it was pretty balanced by the sweet pudding.\nTHE PUDDING oh my goodness, I absolutely love the pudding.  In fact I might just make the pudding without the rest of the pie at some point.  I will admit I have a sweet tooth, but it was just so creamy and yummy, the honey blending in perfectly with the cream, absolutely incredible.\nWe really mucked up the meringue (a certain someone accidentally added all of the ingredients together). We didn't get a real meringue but it's a sweet milky fluffy egg white-based sauce that we drizzled onto the pie when serving it.\n\nI will say that it was a LOT of work.  Probably too much work for a pie. I didn't look at the recipe closely until the day before Thanksgiving and I do regret that, making the crust is a very long process that I definitely would have done several days in advance.  That's really the only reason I gave it 4 stars instead of 5 - but a lot of BA recipes are very time-consuming and delicious.Allie LWashington, DC11/27/2020Glad I saw the reviews here before making. Sohla I love you, just wanna put that out there.\n\nHere’s how this recipe will work: DONT use this pie crust recipe. Use another. Any other. We cooked the crust 30 minutes more than described and it still wasn’t crispy. Hardly cooked. \n\n1/2 the sugar in the merengue. Everyone was saying it was sickly sweet and although our merengue was not as fluffy or thick, I thoroughly enjoyed the taste. \n\nCherry on top? Make a tart berry compote. It is amazing with this pie and counters the sweetness. JoyPittsburgh 11/26/2020This recipe was.... not good. As noted by prior reviewers, the pie crust recipe in the print edition was completely off and called for 2x the amount of butter that was necessary. Also, it was far too sweet. The meringue was delicious but when paired with the incredibly sweet honey pudding, it was sugar overkill. It never really got crunchy either, despite baking for nearly 20 minutes more than the suggested time. That may have been operator error.  Either way, we threw it out after just a few bites :( SarahNew Jersey11/9/2020If the iplan was to make a \"pate sablee\" crust, the ratio should be about 2 cups of flour for 1 stick of butter. This said, the idea of honey pudding appeared interesting, but the combination with the meringue would be too sweet and out of balance.P'tit Chef PierreCalifornia11/7/2020Please kitchen test your recipes.Anonymous11/6/2020Totally agree with the comment about the pie dough - ratios are off, I had a ton of butter drip from the dough as it was baking (good thing I used a baking sheet)! Also, expect the pudding to take more like 10-15 minutes to thicken on the stove top.\n\nMain issue I have with this recipe is that meringue is super-sweet, and goes best with sour (lemon/lime) or bitter (dark chocolate) flavors. Putting a sweet meringue on top of a sweet pudding (I even reduced the honey a bit) was overkill. My little nephew's got a major sweet tooth and even he couldn't finish it because it was too sweet.AnonymousOregon11/2/2020Guys. This pie dough recipe has to be wrong in measurements. 3 sticks of butter to 1.5 cups of flour? That’s not a shaggy dough that’s a soggy butter blob. I know, I made it twice. Love you sohla and I love your recipes (you are an f-ing gem and a genius) but someone messed up with a typo or something girl. AnonymousIdaho10/23/2020Explore Bon AppétitPieDessertFallSnackNut-FreeBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}