{"id": "352d6e42fcd871f724f62840a5371915", "url": "https://www.bonappetit.com/recipe/grilled-lamb-chops-and-peppers", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Grilled Lamb Chops and Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueGrilled Lamb Chops and PeppersBy Kelly MarianiJuly 9, 20195.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintLamb chops need enough time on the grill to let the fat render. You’ll get flare-ups as the fat melts onto the coals—that’s inevitable—but instead of letting the chops char, just move them to a new spot as needed and keep going. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients4 servings3garlic cloves, thinly sliced2Tbsp. chopped rosemary2Tbsp. plus ½ cup extra-virgin olive oil; plus more for peppers12lamb rib chops (about 2¼ lb. total), preferably unfrenchedKosher salt, freshly ground pepper1cup parsley leaves with tender stems½cup small dill sprigs1lemon12–16Jimmy Nardello peppers, 8 Cubanelle peppers, or 8 oz. shishito peppersRed wine vinegar (for serving)PreparationStep 1Pound garlic, rosemary, and 2 Tbsp. oil with a mortar and pestle until pulverized. (Alternatively, finely grate garlic and finely chop rosemary. Combine in a small bowl and mix in the oil.) Season lamb chops on both sides with salt and black pepper. Coat all over with garlic paste and let sit at room temperature 30 minutes or cover and chill up to 12 hours.Step 2Just before you are ready to grill the chops, make the herb salsa. Pound parsley and dill with mortar and pestle with a big pinch of salt until coarsely crushed. (Alternatively, finely chop the herbs and combine in a medium bowl.) Finely grate zest from lemon into herbs, then slice lemon in half and squeeze in its juice. Stir in ½ cup oil; taste and season herb salsa with more salt if needed.Step 3Prepare a grill for medium-high heat. Grill lamb chops, turning often to encourage fat to render and moving to a new spot on the grill whenever there’s a flare-up, until nicely charred on the outside but still pink in the center, 6–8 minutes. Transfer to a platter and let rest 5–10 minutes.Step 4While the chops are resting, toss peppers in a medium bowl with enough oil to coat; season with salt. Grill peppers, turning often, until skins are blistered and charred in spots and flesh is tender, about 3 minutes. Return to bowl, add a few dashes of vinegar, and toss to coat.Step 5Serve lamb and peppers with herb salsa for spooning over.How would you rate Grilled Lamb Chops and Peppers?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleLove this recipe.  We've made it several times.AnonymousWashington, DC2/7/2022This is my go to recipe for grilling lamb! I typically leave out the peppers for simplicity. NatalieWashington, DC6/30/2021Explore Bon AppétitShishito PepperVegetableLamb ChopLambMeatSummerEasyMainDairy-FreeGluten-FreeNut-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}