{"id": "35366e581b332e99de987d30a5ee00e0", "url": "https://www.bonappetit.com/story/buxton-hall-collard-greens", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "I Didn’t Know Collard Greens Could Taste Like This Until I Went to Buxton Hall | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Didn’t Know Collard Greens Could Taste Like This Until I Went to Buxton HallNow I’m a believer.By Emily SchultzJuly 11, 2019FacebookTwitterEmailPhoto by Wes FrazerFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Everyone knows a good accessory can make an outfit. A pair of brightly colored earrings takes my all-black outfits from 0 to 60. A chunky belt, not so much. Now—stay with me—aren’t sides, like, the accessory of a meal? They can transform a meal into something transcendent, especially when it comes to barbecue. Sides round out all that meat with acid (pickles!), crunch (slaw!), carbs (mac and cheese!). That’s why I’d like to introduce you to the humble side that completes any meat spread: the smoky, tangy collard greens from Buxton Hall in Asheville, North Carolina.In 2016, this very publication named Buxton Hall one of the best new restaurants in the country for many reasons: the shreddy and flavorful Eastern Carolina-style pulled pork, the endless list of perfect desserts (looking at you, brown-butter crumble). During a trip to Asheville last summer, I couldn’t wait to dive, mouth first, into the juicy, fatty pork, piling it high on slightly sweet cornbread. But then I scooped up a mound of those collard greens, and I was like WOW.Instagram contentThis content can also be viewed on the site it originates from.Chef Elliot Moss is clearly a collards whisperer. Where other collards suffer—soupy, under-seasoned, mushy—Moss soars. He braises them for two hours in lots of rendered pork fat and pork broth (double pork!), which gives the collard greens a salty, luscious flavor. And don’t you worry: To balance out the fat, he finishes the dish with a hit of vinegar. This side blew my mind—I almost missed my flight back to New York City (another story for another time). So yes, the melt-in-your-mouth pork is worth a trip to Asheville, but those tender, smoky collard greens make the meal.Go there: Buxton HallIf you can’t—get the recipe for Buxton’s other collard greens, with bacon and beans added in:Smoky Tangy Greens and BeansView RecipeExplore Bon AppétitHighly RecommendAsheville, NCBarbecueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Emily Schultz"]}