{"id": "354496a84a1b8c2eb56e9e310c49914b", "url": "https://www.bonappetit.com/story/my-waffle-quest", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "My Search for the Perfect Waffle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Search for the Perfect WaffleCrispy, buttery, and dunked in maple syrup. Beautiful waffle, where are you?By Sonia ChopraOctober 2, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Recently I’ve been craving waffles. This isn’t normal for me—I much prefer savory foods first thing in the morning—and I think it stemmed from a convo I had with coworkers about our all-time favorite hotel breakfasts. Honestly, there’s not much I love more than an international hotel’s breakfast buffet. Some standouts for me include Paris, where I had the best yogurt of my life; Singapore, where our hotel had a congee bar and all kinds of noodles; Dubai, where the sheer variety was so staggering I couldn’t pick a favorite dish; and Amritsar, where piping hot parathas were made to order and stuffed with our choice of spiced filling. But the image stuck in my mind after that Slack chat is a perfect plate of waffles, which I can picture so clearly that it almost feels like a stock image rather than an actual dish.Here’s what I’m picturing: Two thick quarters of waffle stacked and sprinkled with sugar, crisp on the outside and soft within, topped with a melting pat of butter, garnished with a few berries, and served with a tiny pitcher of maple syrup. Chances are you’ve ordered this exact plate at a brunch spot, right? It’s iconic. It’s everywhere. But I can’t remember the last time I ordered any kind of waffle—outside of, obviously, late-night Waffle House excursions—and once I realized that, I haven’t been able to get them out of my head.So—surprise!—I decided that I have to make some. I’ve been doing research in the archives of BA and Epicurious, starting with Epi associate editor Joe Sevier’s deep dive into making crispy waffles and this great waffle maker review. On Bon Appétit, we’ve got all kinds of recipes, from sweet whole wheat oat waffles, corn waffles with strawberry syrup, and chocolate-buckwheat waffles to savory loaded baked potato tot waffles and (!) Tex-Mex breakfast waffle nachos. In the October issue, we’ve got a great recipe from chef Woldy Reyes for bibingka waffles made with rice flour that I’m really looking forward to trying. If you have a favorite recipe, I’d love to hear it: I’m sonia@bonappetit.com.Here are a few other things I’m loving:I grew up eating jaffles (we simply called them square sandwiches) so I’m loving this jaffle maker recommendation from associate editor Ali FrancisPaola Briseño-Gonzáles’s recipe for this toasted pumpkin seed and tomato dipMore recipes: Meherwan Irani’s all-purpose coconut curry, Simone Tong’s cold noodles with Sichuan peppercorn dressing, Rachel Gurjar’s air fryer sesame-coconut chicken tenders, Christian Reynoso’s Sonoran-style potato, cheese, and tomato soupThis great interview with author Emily Itami about her lovely book Fault LinesA food lover’s guide to cooking with Parkinson’sOn YouTube: André Mack tries 16 boxed winesAnd on the podcast: Why would anyone open a restaurant?Explore Bon AppétitLetter From The EditorCultureRead MorecookingThese Earthy-Creamy Tahini Cookies Win Best Supporting RoleBy Sonia ChopracultureWhat I Cook When I Don’t Want to Cook AnythingBy Sonia ChopraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-02", "author": ["Condé Nast", "Sonia Chopra"]}