{"id": "35476789205d00deb49242f32058ab20", "url": "https://www.bonappetit.com/recipe/basic-crepes", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Easy Crepes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2016 IssueBasic CrepesBy Ludo LefebvrePhotography by Peden + MunkJanuary 24, 20224.6(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + MunkEmailPinterestPrintEmailPinterestPrintThis easy crepe recipe from French chef Ludo Lefebvre makes enough for a party or leftovers (store the remaining batter in an air-tight container in the refrigerator for up to three days)—and it can easily be halved. If it’s your first time making crepes, know that it will take a few tries to master swirling the pan just so to attain a thin, even layer of crepe batter. Using a short-sided crepe pan can make maneuvering easier, but you can make delicious homemade crepes using a traditional nonstick pan too. Once you get the hang of it, things move quickly, so prepare your accompaniments like chopped fresh fruit or orange juice-based Suzette and milk chocolate sauces in advance.If you prefer savory crepes, try stuffing them with ham and cheese or smoked salmon and crème fraîche. For a heartier style of crepe, these buckwheat ones with creamy leeks and baked eggs work well for a light supper or as an all-in-one brunch dish.Editor’s note: This recipe was originally published in our December 2016 issue and first appeared online November 15, 2016.IngredientsMakes about 204large eggs, room temperature2⅓cups whole milk⅔cup sugar1teaspoon vanilla extract2⅓cups all-purpose flour½teaspoon kosher salt4tablespoons unsalted butter, meltedSuzette Sauce and Milk Chocolate Sauce, whipped cream, powdered sugar, and/or jam (for serving)PreparationStep 1Blend eggs, milk, sugar, and vanilla in a blender until smooth and frothy. Add flour and salt and blend just to combine. Cover batter and chill at least 1 hour.Step 2Heat a medium nonstick skillet over medium-high, then brush with melted butter. Ladle about ¼ cup batter into skillet and swirl to evenly coat bottom. Cook crepe until bubbles form on surface and edges are golden and crisp, about 3 minutes. Slide a spatula underneath crepe to loosen and carefully flip. Cook on the other side until a few brown spots appear, about 15 seconds, then transfer to a plate. Tent with foil to keep warm while you cook remaining crepes. Repeat with remaining butter and batter.Step 3Serve crepes with Suzette Sauce, Milk Chocolate Sauce, whipped cream, and/or jam alongside.Do Ahead: Batter can be made 1 day ahead. Keep chilled. Stir gently to reincorporate before cooking.Nutrition Per ServingCalories (kcal) 660   Fat (g) 22  Saturated Fat (g) 11 Cholesterol (mg) 230   Carbohydrates (g) 96  Dietary Fiber (g) 0  Total Sugars (g) 41  Protein (g) 18  Sodium (mg) 280 How would you rate Basic Crepes?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleExcellent! They're fantastic. I blended my batter to obtain a smoother consistency, which was a fantastic idea. They were neither too salty nor too sweet; they were exactly right.Julia FoxMiami1/30/2022This is an easy recipe that turns out tasty, credible crêpes. I also use a recipe from my friend's family's cave in Médoc: 1 bottle beer + 1 stick butter, melted + 6 eggs, blended + pinch of salt + 2 1/2 c + flour, depending on the humidity; mix all the ingredients together; cover and leave on the counter overnight; cook as described in your recipe's directions. I use my fingers to flip them and separate each with a paper towel that can be used for other things afterwards; some people are very talented & use the pan to flip each cake up in the air and catch it in the pan. Very impressive!AnonymousGolden, CO1/25/2022Who needs 20 crepes? How about changing the recipe for maybe 4, 6, or 8.NealAsheville, NC1/25/2022Parfait! I lived in France and these are just like the crepes from Normandy.Amy FrenchRockingham, NC5/7/2021Very forgiving recipe - I used oat milk because I didn't have any milk and I also didn't have vanilla. I also used cold eggs and only chilled the batter for like 10 minutes lol. They turned out perfect! Lots of butter in the pan is essential :) AnonymousToronto, ON5/30/2020great recipe, but it really could be useful to add a measurement in grams at the ricepe 😅 plurralEurope 4/11/2020Great recipe! I add in some chia seeds, oregano and garlic, perfect for savory moments. Good with ground meat and veggies!AnonymousSingapore4/10/2020I've never made crepes before and these are delicious and much easier than I expected. Using a blender to mix everything and then pour is really nice. I only had whole wheat flour so it was harder to tell when they were done and ready to flip because it was a darker batter, but still were delicious!morgansainDenton, TX4/4/2020Excellent! I found keeping the pan a little lower on heat worked best for my stovetop/cookware.AnonymousHalifax, NS12/29/2019Explore Bon AppétitCrepePancakeFrenchEuropeanEasyVegetarianNut-FreeFryBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-11-15", "author": ["Condé Nast", "Ludo Lefebvre", "Peden"]}