{"id": "355592f3314ecb61245dc5fea2f80b9a", "url": "https://www.bonappetit.com/story/socle-baltimore", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Ever Heard of a Communal Restaurant? Here’s How Four Baltimoreans Make Socle Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEver Heard of a Communal Restaurant? Here’s How Four Baltimoreans Make It WorkAt Socle in Baltimore, you can start your morning with a latte at Sophomore, chow down on bean-heavy grain bowls for lunch at Larder, then head to the gorgeous bilevel Fadensonnen for a frosty glass of beer, natural wine, or fireside sake. Just don’t call it a food hall.By Allison RobicelliOctober 18, 2019FacebookTwitterEmailPhoto by Kate GrewalFacebookTwitterEmailOver the past decade, Lane Harlan and her partner, Matthew Pierce, have redefined what it means to have a proper drink in Baltimore, first through their intimate cocktail bar W.C. Harlan, then with their mezcaleria Clavel. Lying dormant in their minds the entire time was the idea for a modern, open-air biergarten. But as Harlan points out: “Spaces dictate what you do with them.” So last year, when the ideal locale—a former residence and carriage house, built in the 1850s and separated by a vacant lot—finally came up for sale, the couple realized this project would be more than just theirs alone. They gathered some friends and created a dining collective, with five distinct spaces and an artist residency, called Socle, which means a platform for displaying art.A subterranean corner lot became Sophomore Coffee, from former Clavel manager Kris Fulton and his partner, Ann Fortune. A small retail space with an open kitchen became Larder, a thoughtful lunch concept from artist-turned-chef Helena del Pesco. Across the communal patio sits Harlan and Pierce’s baby, Fadensonnen: downstairs, a casual beer parlor; upstairs, a cozy natural wine and sake bar. “Someone could go to Sophomore on a Saturday morning to drink coffee and check their email,” says Harlan. “They could walk to Larder, order lunch, and sit with a friend in the courtyard. Then they could ease into evening with a glass of wine from Fadensonnen. We’re individual concepts coexisting, but we’re also a cultural community of our own.” Here’s how it all comes together.Owner Kris Fulton mans the counter at Sophomore Coffee.\nPhoto by Kate GrewalAn employee gathers herbs from the shared rooftop garden.\nPhoto by Kate GrewalDel Pesco is in charge of food for the entire complex, collaborating with Harlan and Fulton on menu ideas before selling finished products back to them wholesale. Her days start at 6 a.m., when she starts baking Sophomore’s signature salted chocolate chip cookies and seasonal pastries. From 11 a.m. to 4 p.m., she churns out grain bowls, soups, and killer grilled cheeses at Larder. When Fadensonnen opens at 5 p.m., she starts sending over small bites to be plated by the wine bar staff: marmalades, lacto-fermented vegetables, and pâté made from local mushrooms, whose earthy flavors come together with a splash of rancio sec from the bar’s rotating wine list.Socle grows “more herbs than we know what to do with,” according to Harlan, in a shared rooftop garden. Fertilized by food scraps from all three businesses, the herbs are used for Larder’s dishes and the teas served at Sophomore and Fadensonnen. The rest of the scraps and used compostable containers are collected weekly by Washington D.C.’s Compost Cab, which donates them to local farming nonprofits.Fadensonnen's downstairs taproom features an array of local beers.\nPhoto by Kate GrewalLunch is served at minimalist all-day cafe, Larder.\nPhoto by Kate GrewalAll the owners are committed to smart sourcing, and buying collectively lets them support smaller producers, like family-run South Mountain Creamery, which still runs a door-to-door milkman service. Much of Socle’s produce comes from Chesapeake Farm to Table, a network that’s helped transform some of Baltimore’s vacant lots into urban farms. Many—such as Larder favorite Strength to Love—are located in food deserts, and also provide job training and agricultural education.“We share basic materials like ice in the summertime when people are drinking tons of iced coffee at Sophomore, shrubs at Larder, and spritzes at Fadensonnen,” says Harlan. “We got on an ‘ice pickup’ schedule so that our single machine has enough hours in between to recuperate!”Locals gather for sake and natural wine at Fadensonnen's airy upstairs bar.\nPhoto by Kate GrewalThe team regularly collaborates on fundraisers—like Gut High, a wild fermentation festival spearheaded by Lane Harlan and the Fadensonnen team—to raise money for the Old Goucher neighborhood where they’re located: planting native flora like pussytoes and Christmas ferns, adding brighter street lighting, and installing sidewalk bike racks for public use.To supplement the small plates on Wednesday through Sunday nights, Harlan rents out a community food truck parked outside the beer garden. She subsidizes half the rental cost to promote experimentation and diversity. Frequent guest chefs include the Mera Kitchen Collective, a worker-owned female refugee cooperative, and Harlan’s mother Lola Yuzon-Harlan, a Filipino émigré who serves Pampanguenan comfort foods like arroz caldo, sinigang, and adobo.Explore Bon AppétitRestaurantsBaltimoreRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-18", "author": ["Condé Nast", "Allison Robicelli"]}