{"id": "355a89984ab7802bf453c8906ba5a692", "url": "https://www.bonappetit.com/story/kings-hawaiian-rolls", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "King's Hawaiian Rolls Are My Sandwich Secret Weapon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKing’s Hawaiian Rolls Are My Sandwich Secret WeaponSorry, sourdough, but some things are destined to be stacked between two pillowy, kinda sugary rolls.By Aliza AbarbanelJanuary 21, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Most of the time, I prefer bread that at least attempts to gesture at health. Dense, seedy slices of rye. Holey, tangy loaves of sourdough. But sometimes, only the squishy sweetness of a King’s Hawaiian roll will do.The appeal comes from the balance of texture and flavor: The sweetness delicately offsets any salty sandwich fillings, like ham and cheese, while its fluff envelops those fillings into itself and is just fun to bite. The recipe is based on Portuguese sweet bread, which is super rich from plenty of eggs, butter, and sugar. And, in case you’re wondering, yes! King’s Hawaiian really did start in Hawaii. Legend (a.k.a. the brand’s FAQ section) has it that Hawaii native Robert Taira started baking batches of these doughy breads in Hilo in the 1950s, before moving the operation to Honolulu, then California, where he rolled out distribution nationwide.Fried chicken sandwiches are just better with King’s Hawaiian rolls.\nPhoto by Laura MurrayOf course, a lot of the appeal comes down to nostalgia. To have eaten King’s Hawaiian rolls as a child is to love King’s Hawaiian rolls as an adult. Growing up, I ate the buns on their own, pulling them apart into soft, glutinous tufts to savor each bite. (Back then, I also swore the sweetness came from pineapple, but it’s not listed as an ingredient...so that was probably just an overactive imagination.)I’ve since evolved to use these rolls as an ingredient. Their status as a semi-regular grocery store staple makes them a summer cook-out essential, perfect for contrasting crispy fried chicken and pickle-y slaw. In the winter, I use them to soak up savory braises and stews, plus the occasional jambon beurre. But still, I’ll always save a few rolls to snack on straight up, albeit lightly toasted and smeared with butter. Some things never change.Buy it: King's Hawaiian Original Hawaiian Sweet Rolls, $17 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingBreadRead MorecultureOf All the Things in My Pantry, This Za’atar Blend Is My FavoriteBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-21", "author": ["Condé Nast", "Aliza Abarbanel"]}