{"id": "355fc680623fa008fd632739ebc11a2f", "url": "https://www.bonappetit.com/story/megalyn-echikunwoke", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Actress Megalyn Echikunwoke Is A DIY Beauty Lover With No Time for “Food Bullies” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleActress Megalyn Echikunwoke Is A DIY Beauty Lover With No Time for “Food Bullies”She's got a serious case of wanderlust too.By  Siraad DirsheOctober 15, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailIn our new series Person of Interest, we talk to the people catching our eye right now about what they're doing, eating, reading, and loving. Up next, 'Night School' actress Megalyn Echikunwoke.Social media can be a mind-boggling place with an overabundance of homogenous feeds, meticulously curated with hints of millennial pink and gold-accented marble. So when we stumble on an account that’s full of pics from a person’s real life (like, actual real life), it’s a real breath of fresh air.Actress Megalyn Echikunwoke is that breath of fresh air.Echikunwoke, whose long resume includes roles on hit TV shows House of Lies and Mind Games along with the recently released movie Night School, uses her platform to speak her mind. “I have something to say, I have a point of view, these are my views, and if it means something to you then great, and if not, that's fine also,” she says of her Instagram account. “If I can say something that has an impact a thing that's important to me, then I'm super happy,” the Echikunwoke says.It’s clear talking to Echikunwoke that she’s extremely thoughtful about everything she does, including her acting work. She equates being an actor to being an anthropologist: “The people around you are what feed your work. Getting as much as you can from all different kinds of people only adds to your creative arsenal,” she says. We talked to Echikunwoke about how she approaches wellness, travel, and even her beauty routine.My career highlight so far has been… Playing Claire in Alexi Kaye Campbell’s Apologia. It’s my stage debut, and that has been something I've wanted to do for a long time, so that's really exciting.For me, wellness is… a very individual thing. I think a way to wellness comes from really listening to your body, understanding how to keep yourself healthy, and, as much as you can, taking preventative measures to support your body. I think doing something that you love is a form of being well.I’m obsessed with… dancing, especially ballet. Dance is a foundation of my fitness routine. Anywhere I am, I try to make sure I'm as close to a dance studio as possible, and I think I'll probably practice or study ballet until I'm 80 years old. At least, I hope so.I feel my best when I’m… consuming art, and lots of it. I'm always at the movie theater, I'm always seeing Broadway shows, off Broadway shows, dance performances, concerts—it’s how I feed my soul creatively. It’s very therapeutic, meditative, and healing for me.The only diet I abide by is… no diet. I hate food bullies, and I hate having to label my diet all the time. I’m not one type of eater—I just eat what makes me feel good. I try to maintain my blood sugar, but thankfully I don't really crave sweets and am totally happy not having dessert.But when I do indulge I go for... coffee. I definitely need a lot of coffee every day. I’ll also indulge in an alcoholic drink every now and again.One thing you probably don’t know about me is… I love making my own beauty products. I make a body scrub with sugar, because salt can dehydrate your skin. I use a lot of lemons to break down the sugar in the scrub before I add the oil. And I always make sure to travel with the scrubs and masks that I whip up.Growing up in northwest Arizona taught me… to explore the world. I grew up in a really remote place with a rich, beautiful culture, and I think that had a huge impact on my love of traveling. Also, my mom was really wonderful about making sure that we traveled as much as we could. We didn't have a lot of money, but she always made sure that we got to go somewhere for the summer, or we would go camping. She made the most of it.I’m most comfortable when… I’m uncomfortable. I like to be figuring stuff out, and I like being lost in a city. That’s also why I love traveling so much.The country I’m dying to explore more is… Nigeria. There’s so much I want to discover and uncover in Nigeria, and I’m dying to explore more of West Africa.One piece of advice I’d give young people is to… stay curious. And, ultimately and above all, remain compassionate and try to find compassion for yourself and others.Explore Bon AppétitHealthyishCelebritiesPerson of InterestInterviewsRead MoreLifestyleOra Wise Is Building Community Through Food and Finding Joy on the Dance FloorBy Keia MastrianniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-15", "author": ["Condé Nast", "Siraad Dirshe"]}