{"id": "3562157ea81aae02becb47cab00b90a0", "url": "https://www.bonappetit.com/recipe/sweet-potato-tian", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Sweet Potato Tian Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueSweet Potato TianBy Peter SomOctober 19, 20214.3(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintThe classic Provençal tian—a gratin of layered sliced vegetables served right from the vessel it’s baked in—gets a Chinese American twist, courtesy of recipe developer and fashion designer Peter Som. In this recipe, a favorite on his Thanksgiving table, Som uses thinly sliced rounds of sweet potato tossed in brown butter spiked with ginger, miso, dark soy sauce, and five-spice powder. “Made of fennel seeds, cinnamon, cloves, star anise, and Sichuan peppercorns, five-spice is infinitely versatile,” he says. “It brings warmth to whatever I’m making. I like to say it’s pumpkin spice’s bolder cousin.” Stacking the slices so they stand upright on their sides (rather than flat against the pan) exposes their edges to the heat of the oven, allowing them to become crispy and intensely flavorful. If you can’t find dark soy sauce, you can substitute 2 Tbsp. regular soy sauce plus ¼ tsp. granulated sugar.For the rest of Som’s Thanksgiving menu, see his recipes for Asian Pear Salad With Peanut-Lime Dressing, Roasted Brussels Sprouts With Gochujang Brown Butter, Dutch Oven No Mai Fan, Char Siu Wellington, and Milk Tea Bread Pudding With Crème Anglaise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSmall Saucepan$155 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonIngredients8 Servings6Tbsp. unsalted butter, plus more for pan3garlic cloves, finely grated11\" piece ginger, peeled, finely grated1Tbsp. finely grated orange zest¼cup fresh orange juice (about 1 orange)¼cup low-sodium vegetable broth¼cup light brown sugar2Tbsp. dark soy sauce1Tbsp. white miso2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. five-spice powder½tsp. freshly ground black pepper1Tbsp. thyme leaves, plus more for serving4lb. medium sweet potatoes, unpeeled, sliced ⅛\" thickPreparationStep 1Place a rack in middle of oven; preheat to 350°. Butter a 10\" cast-iron skillet or a 2½-qt. shallow round or oval baking dish. Melt 6 Tbsp. butter in a small saucepan over medium heat and cook, stirring often, until butter foams, then browns (do not burn) and smells nutty, 5–8 minutes.Step 2Remove saucepan from heat and whisk in garlic, ginger, orange zest, orange juice, broth, brown sugar, soy sauce, miso, salt, five-spice powder, pepper, and 1 Tbsp. thyme.Step 3Combine sweet potatoes and brown butter mixture in a large bowl and toss gently until sweet potatoes are thoroughly coated.Step 4Stack sweet potato slices upright on their edges in vertical rows along perimeter of skillet, following the curve of the pan. Arrange more vertical rows of sweet potatoes down center of skillet to cover entire pan. Be sure to pack sweet potatoes tightly and fill in any gaps with smaller sweet potato slices. Pour any remaining brown butter from bowl over sweet potatoes, then cover skillet tightly with foil.Step 5Bake sweet potatoes until fork-tender, 50–60 minutes. Carefully remove foil and increase oven temperature to 425°. Continue to bake until tops of sweet potatoes are deep golden brown, 30–40 minutes longer.Step 6Scatter more thyme over tian and let cool slightly before serving.Do Ahead: Tian can be baked 1 day ahead. Let cool; cover tightly with foil and chill. Reheat, loosely covered with foil, in a 350° oven until heated through, 40–45 minutes.How would you rate Sweet Potato Tian?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleDelicious.  I didn’t have a cast iron skillet so used a ceramic pie pan.  I couldn’t find garlic so replaced them with a diced onion.  I had a jar of red miso so used it.   After turning up the oven, the crust burnt so I discontinued baking after 20 minutes.   \n\nI would use it anytime other than Thanksgiving or Christmas.  Lady MarieOlympia, WA12/28/2021Very pretty presentation but the taste was not great - had way too much leftovers vs candied sweet potatoes - might try with candied recipe but with the slicesjkLong Beach, CA12/7/2021Perhaps sliced a tad too thin, but was able to make a pretty rosace and the flavor is insane!  A keeper! Donna CMooresville, Iredell, North Carolina, USA11/29/2021This was wonderful. A big hit at Thanksgiving with friends. I used 2 kinds of sweet potatoes so it looked like a flower. Will definitely make it again.ValerieSummit Hill PA11/27/2021This looks great! I plan to make it this coming week before Thanksgiving when we have company for dinner. We love sweet potatoes and I am always looking for new ways to prepare them.\nAnd a note to GLEE in Kailua, HI - I agree, sweet potatoes are really hard. I plan to use my mandoline, which is really sharp, to slice them. It can slice from 1/8 inch to 1/4 inch slices. I never thought I needed one until I got this one as a gift many years ago - now I use it all the time!MichelleAnderson, SC11/20/2021A huge hit! The depth of flavor was amazing and it was not complicated to make. This will be my new go-to sweet potato dish for Thanksgiving/Friendsgiving. JeannieNew York, NY11/20/2021This sounds delicious, and I will try it soon. In answer to the previous question, the only way I would slice them is with a mandoline, which enables you to slice the sweet potatoes uniformly and thinly. AnonymousMontana11/12/2021Sweet potatoes are like rocks. How do you safely slice them like this when raw? But it sounds delish.gleeKailua, HI11/2/2021Explore Bon AppétitSweet PotatoThanksgivingSideVegetarianRoastDinnerFallWinterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Peter Som"]}