{"id": "35634bf52b2b83db03355a7cede7e0e6", "url": "https://www.bonappetit.com/story/steak-big-beach-sandwich", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "This Steak Sandwich Is the Ultimate Big Beach Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Eat Steak on the Beach (in a Big Sandwich)The art of the Big Beach Sandwich.By Emma WartzmanAugust 10, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailA few weeks ago in our daily staff meeting, we were discussing our 2018 Summer Bucket List—the recipes we absolutely have to make before the sun starts to set earlier and peak produce dwindles away. Christina Chaey, my colleague and a very smart woman, brought up that she would like to make a Big Beach Sandwich (I have taken liberties with capitalization for emphasis that this is, indeed, a thing). And what is this thing? A huge sandwich to fortify you during a day at the beach,  that holds up well for transportation purposes, and ideally gets even better with time.Now, that could be any number of sandwiches. Think this one with pork tenderloin, for example, or a classic pan bagnat. But the number one best Big Beach Sandwich to make, in my personal opinion, is this Open-Face Steak Sandwich with Parmesan Dressing. Hold up!, you might be thinking. How is an open-face sandwich a good idea for the beach?! Make it closed. Boom. Done. Problem solved.Once closed, this sandwich has all the components of a perfect Big Beach Sandwich. And if you haven’t figured it out already, that also means it would make a great Big Park Sandwich. Or Big Waterfront Sandwich. Or Big Really Anywhere You Want to Eat It Sandwich.Peppery arugula is the perfect green topper to this sandwich.\nEd AndersonFirst of all, it’s got ultra-crusty bread, which is ultra-sturdy. The recipe calls for ciabatta, but you could easily use a baguette. Second of all, the dressing, which comes together with a few blitzes of a food processor, soaks into the bread without breaking it down. It makes the soft and chewy inside full of Parmesan-y, mustardy, lemony, oily flavor. Seriously, the dressing itself is so good. I’ve even sought this recipe out for the dressing alone, to put on salads, roasted vegetables, and grain bowls.And then there’s the flank steak! A relatively cheap cut, both easy and fast to cook. It’s seasoned simply with salt and pepper and cooked in a hot skillet for a handful of minutes per side. After it rests for 15 minutes, it’s ready to be thinly sliced and placed on your soon-to-be-closed sandwich. The whole thing gets topped with thinly sliced red onion and arugula, both of which add a sharp bite to cut through the fatty, meaty, cheesy components.Now, despite the fact that I have talked up the virtues of this sandwich when closed, I can also make a strong case for keeping it open. Served open, it’s a great Party Sandwich. The same way it will hold up between your house and the beach, it will also hold up when you invite friends over to casually hang and shmooze and eat and drink and watch the sun go down at 8:30 p.m.Get the recipe:Open-Face Steak Sandwich with Parmesan DressingView RecipeMore steak, for your pleasure.Explore Bon AppétitSteakSandwichRead MorecookingHow To Build a Better Vegetarian SandwichBy The Healthyish TeamcookingI Love This Sandwich at Least as Much as My Actual ChildrenBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-10", "author": ["Condé Nast", "Emma Wartzman"]}