{"id": "356888dbe2e9d3d7b6fc535fbdfbb12e", "url": "https://www.bonappetit.com/story/whole-foods-365", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Whole Foods Is About to Open the East Coast's First Lower-Priced \"365\" Store in Brooklyn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhole Foods Is About to Open the East Coast's First Lower-Priced \"365\" Store in BrooklynWhole Foods Market 365 will open in Fort Greene on January 31.By Andrea ParkJanuary 26, 2018FacebookTwitterEmailPhoto by Patrick T. Fallon/Bloomberg via Getty ImagesFacebookTwitterEmailSay goodbye to \"Whole Paycheck\"—Whole Foods's newest outpost is more of the \"Half Paycheck\" variety. The grocery chain announced Thursday that the seventh Whole Foods Market 365, its lower-priced, millennial-focused mini-chain, will open in Brooklyn next week, bringing the brand's locally sourced foods and grab-and-go options to the East Coast for the first time since the first 365 store opened in 2016.According to a press release, New York's own Whole Foods Market 365 will be located in Fort Greene, in the 300 Ashland building near the Atlantic Terminal and Barclays Center, and will open on Wednesday, January 31. Not only will the 30,000-square foot space house the typical butcher counter, antipasto bar, wide array of artisan cheeses, hot and cold grab-and-go bars, bakery, and generous selections of craft beer and wine, but it will also feature a café level containing \"four distinct venues.\" These \"Friends of 365\" include Next Level Burger, marking the plant-based vegan burger joint's first non-West Coast outpost; NYC institution Orwasher's Bakery & Coffee Bar; organic and vegan health food chain Juice Press; and the POURiT Authority (get it?!), Whole Foods Market 365's first foray into what they call the \"get it your d*mn self\" model of self-serve beer, cider, and wine, powered by \"reloadable electronic cards and digital screens.\"Brooklynites hardy enough to brave what are sure to be massive crowds at next week's grand opening will get to sample coffee and snacks from Whole Foods and the Friends of 365, and will be able to snatch some swag from the four brands. The first 100 visitors to the store will receive a mystery Whole Foods gift card, ranging in value from $5 to $365; if you'd like to try your luck, be sure to get in line well before the 9 a.m. opening time. Additionally, five percent of the new store's net sales on opening day will be donated to the Fort Greene Park Conservancy as part of its \"5 Percent Day.\"The first Whole Foods Market 365 store opened in Silver Lake, California, in May 2016, and was followed by five more in California, Ohio, Oregon, and Texas. But don't worry if none of those are near you—and the post-Amazon buyout price slashing still isn't low enough for your liking—since the Whole Foods website claims that 16 more stores in nine states across the country are in the works. Reasonably priced artisan cheese for all!Explore Bon AppétitHealthyishGroceryTrendsRead MorecultureThrow Out That Kale and Avocado, Whole Foods Just Released Its Surprising 2018 Food TrendsBy Andrea ParkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Andrea Park"]}