{"id": "358d95ade20b2e8d13271f0281105ae7", "url": "https://www.bonappetit.com/story/leah-guerrero", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Leah Guerrero, Brujita Skincare Founder, Digs Ambient Music and Red Sheets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBrujita Skincare Founder Leah Guerrero Digs Ambient Music and Red SheetsOf course the founder of Brujita Skincare has an enviable nighttime moisturizing routine.By Zan RomanoffSeptember 23, 2019FacebookTwitterEmailPhotograph by Rozette RagoFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.For Leah Guerrero, the magic begins in Mexico’s mercados. That’s where she finds the inspiration and ingredients for Brujita, a natural skincare line she started in 2017, which has already garnered praise from the likes of Bri Luna, a.k.a The Hoodwitch, and spiritual advisor Emilia Ortiz.Leah and her girlfriend, Yomahra Aquino, go to Mexico three or four times a year, sourcing ingredients like maca root powder, maracuya (passionfruit) oil, and prickly pear oil for Brujita’s facial serums and scrubs. Guerrero brings everything home and assembles her products in her downtown L.A. studio space—though she’s looking to move into nicer digs soon.Brujita Skincare is only two years old, but it’s been growing so fast that some days Leah feels like she can barely keep up. “Yesterday I was lining up everything and I started tearing up,” she reports. “Because I made it all in the span of two days, but it’s all going out tomorrow and I have to do it again!’Luckily Yomahra and a few pals are there to remind her that her epic production pace is a sign of her willingness to work, and that her work is clearly resonating with Brujita’s ever-expanding customer base. That pace has also made finding ways to disconnect, relax, and restore herself more crucial than ever: Guerrero says she’ll answer customer DMs any time, day or night, but she also tries to make sure she gets plenty of long baths and check-in conversations with Yohmara to keep her life in balance. Here’s how the skincare maven saves time for herself at the end of the day:Talking it out (loud)My wind-down routine is about really taking time and not rushing to go to bed. Self check-ins are super important, especially if you're a busybody in production mode all the time. Before bed I ask myself: Did I have a good day? What can I change for tomorrow? I always encourage people to speak to themselves out loud, because when it comes out of your mouth you feel the power behind it. You hold your own answers; you just have to figure out how to ask yourself the questions.A sneak peek at the private altar\nPhotograph by Rozette RagoDIY altar timeI have my own private altar, which I think is crucial. An altar doesn't have to be elaborate: You can just have a candle, a few things that make you feel good, and a few future goals that you want to set for yourself. You just look at it every night and set your intention, really focusing on what you want and visualizing it. I have currency from other places, like Balinese money, 'cause I want to go back, as well as the Mexican peso. I have those there to keep that lineage close together: I'm coming back for you.Of course Guerrero has a next-level skincare lineup.\nPhotograph by Rozette RagoBut first, Brian EnoI have cherry-picked records that have real intention, and they’re a big part of my life. I have my Nu Rage, and my ambient records, and a lot of Brian Eno and Linda Perhacs. Those records made Brujita become what it is. Before I started Brujita, I had to leave a toxic business and a toxic friendship at the same time, and when I went to Mexico these musics were really alive to me. I feel like they spoke about my story and the person I am. Two bedtime favorites are Brian Eno’s “Music For Airports” and Georgia Kelly’s “Tarashanti.”Get That GlowI only use my own products on my face. If I want to be extra-dewy in the morning, I'll use my Hechizo facial drops, then the Essence of Bali Crema, then the Eternal Balm to keep a really heavy glow. When I wake up in the morning, I'm beaming so bright. I'm like, yeah, you had a good night for sure.The scarlet red sheet situation\nPhotograph by Rozette RagoRed-y for AnythingMy bed is all in red. I got that from Maria Abramovic; there’s a scene in the documentary The Artist is Present where she's like super sick and she's like, “I have to sleep in red. This is the only thing that's gonna make me feel better.” Red makes her feel powerful, vivacious, and alive, and the red makes me feel like Superwoman in the morning too. I'm not so lazy now. I wake up really quickly and happy, and I feel like I'm taking care of myself.Netflix and chill—no, seriouslySometimes I don't feel like working on my breathing or meditating with crystals or taking the hour-long bath. Sometimes I just wanna veg out and watch Netflix, and that's totally okay. I'm deserving of that. A lot of people see reality TV as junk, but I see it as endorphins. All this stuff makes me feel happy, whether I'm laughing at The Kardashians because it's dumb or I'm sobbing at someone's story on Survivor. If I'm not feeling good, I can't feel good towards the community, and my priority is staying healthy so that I can tend to them.Explore Bon AppétitHealthyishGoing to Bed withprofileRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-23", "author": ["Condé Nast", "Zan Romanoff"]}