{"id": "359c9b11ce573b24cb5d2819e1684b06", "url": "https://www.bonappetit.com/story/does-butter-go-bad", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Does Butter Go Bad? Not As Quickly As You Might Think | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDoes Butter Go Bad? Not As Quickly As You Might ThinkPlus, how to store it on the counter, and in the fridge and freezer.By Alyse WhitneyNovember 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling Judy ManciniFacebookTwitterEmailPicture this. You’re frying some eggs, crisping bacon, and ready to slather some sourdough toast for a perfect weekend breakfast. In goes your knife into the stick of butter and...nothing. No give. Hard as a rock. Only fools take a stick of butter straight out of the fridge for spreading! Trying to spread a cold pat o’butter is going to get crumbs everywhere, and there will be no edge-to-edge melting coverage on your toast.Here’s the hill I will die on: You should always leave softened butter on the counter. Room temperature or bust. But, but, doesn't butter go bad? I hear you protesting. The short answer: yes. The long answer? Not as quickly as you think. Butter is a little more resilient than other dairy, especially when it’s salted, which helps preserve it. You should have it covered in some capacity, either in a butter dish or in a French butter keeper, which uses a little water to seal the lid so air doesn’t get in, and keeps things cool inside the crock. Air is the enemy of butter, because it oxidizes the fat and makes it spoil.Butter can keep for at least a few days at room temp, but I’ve gone close to two weeks before something tasted a little off. For me, it was an odd, stale, bitter taste with a slightly funky smell. I knew immediately. I’m sure that if I tasted it the day before, I would have noticed less. So if you want to be more cautious, only take out half a stick at a time, or as much as you’d reasonably use in a few days. Stick it in the fridge if you’re going on a trip, or if it’s summertime and hotter than 70° in your house. In both of those cases, it’s either not being used (because you’re not there to enjoy it) or it’s warm and the butter will start to melt and lose its shape, just like you do in the summer.Does butter go bad? Sure. But that shouldn't keep you from having spreadable butter on hand at all times.\nMichael Graydon + Nikole HerriottMeanwhile, in the fridge, it can last as long as your box tells you—usually four months in its original packaging. In the freezer, about a year, but it depends if your freezer turns things to weird, dry crystals like mine does. I tend to keep a box in the freezer, a stick in the fridge, and one on the counter to be ready for any baking, cooking, or toast situation.So yeah, don't let your fear of spoiled butter keep you from lavish schmears on your toast. Or you could keep trying to spread cold butter like a fool. Your call.And if you need something sweet to spread it on:Apple Butter Spice Cake with Cinnamon CrumbleCINNAMON. CRUMBLE.View RecipeExplore Bon AppétitButterBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Alyse Whitney"]}