{"id": "35ae3a9bbac1cae4caf610fdd83d93b1", "url": "https://www.bonappetit.com/story/pot-brownies-dance-breaks", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Pot Brownies, Dance Breaks, and More Things I'm Enjoying This Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersculturePot Brownies, Dance Breaks, and More Things I'm Enjoying This WeekI felt truly joyful for the first time in weeks.By Amanda ShapiroApril 23, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,In last week’s list of things that were helping, I mentioned cry-dancing, but I forgot to talk about the other kinds of dancing that have been getting me through. Like last Friday night, when I danced for an hour on a Zoom party hosted by associate editor Hilary Cadigan and felt truly joyful for the first time in weeks.This period of quarantine has already spawned about a million posts about dancing, from the rise of virtual classes to the joys of doing it alone, and what I’ve learned from reading them all is that it’s hard to write well about dancing, to capture the physical experience on the flat, digital page. But luckily we have Hilary, who writes as well as she dances, and who went all out in her essay about leading Zoom dance parties for the Healthyish Guide to Being Alone.I have felt alone so many times before—in crowded rooms, in bars full of people, surrounded by friends. That’s what depression and anxiety can do to you, but it’s also just the reality of living in this weird, connected-but-apart world, where we bond with people and then leave them, always on the hunt for something else. We move to new cities and see each other less and don’t call as often as we could. Some of us get married and some of us have babies, and, slowly, without even realizing it, we break away from each other like icebergs on a warming planet.If Hilary’s story inspires you to move, she’ll be hosting a dance party on Healthyish’s Instagram Live this Friday at 3 EST. I’ll be there, as Hilary says, “dancing like a maniac across the void.”What else I’m reading this week:At the height of the AIDS epidemic, an underground bakery in San Francisco was churning out thousands of pot brownies a month for sick customers. We got the full story from the baker’s daughter, and, given how many of you have been clicking on our weed butter guide recently, perhaps her famous brownie recipe will be of interest too?Basically editor and Healthyish columnist Sarah Jampel pulled out the stops with this vegetarian dumpling soup that tastes like it’s made with chicken broth. Bonus points for the dumplings being gluten-free.Photo by Sarah Jampel Working from home has wreaked havoc on all of our routines, and for the most part I’m fine with that. We have bigger problems than forgetting what day it is, ya know? But after reading Healthyish assistant editor Aliza Abarbanel’s defense of the lunch break, I felt like it was time to establish my own midday ritual. I’ve been wanting to “get back into napping” since I was, uh, five. Seems like now’s the time.Speaking of being a toddler, here is the answer to my constant question, how many hours until it’s appropriate to eat my next snack?I clicked on this story because the headline made it sound like it was about dancing, but really it was about how to live when you don’t know how long you’ve got (which applies to...all of us): “If I didn’t drink, it was because it felt good not to drink. If I didn’t eat sugar, it was in search of something better. Josie wasn’t calling out in favor of cravings, addictions or the compulsive filling of voids. Josie’s point was that deprivation isn’t the opposite of unhealthy — it’s the opposite of living.”And this essay by Glynnis MacNicol, a love letter to the New York she once knew, caught me from the first scene: “To know New York City by bike is to know it intimately in a way not possible by foot or car. It’s like being thrust into the bloodstream of a great beast, privy to its every pulse.” I’ve thought about this essay every day since I read it, as I’ve picked up my restaurant to-go orders, walked my dog down quiet streets, and delivered groceries to neighbors. It’s about the strange sadness that comes from missing your home even though you’re still there and the courage it takes to love it through its darkest hours. “New York in this moment may be saying goodbye to us, but we refuse to say goodbye to New York.”Me over here, missing you.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThree Things That Are HelpingBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Amanda Shapiro"]}