{"id": "35b24f278007d03f3de0a4a7805c1bb1", "url": "https://www.bonappetit.com/story/samin-nosrat-kinder", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "How Samin Nosrat Learned to be Kinder to Herself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Samin Nosrat Learned to be Kinder to HerselfHow do you learn to love who you are after a lifetime of feeling uncomfortable in your own skin?By Samin NosratJanuary 15, 2020FacebookTwitterEmailIllustrations by Justyna StasikFacebookTwitterEmailThis essay is part of 20 Ways to Feel Better in 2020, a collection of our best ideas for getting you to whatever version of \"better\" feels best to you.I've never been able to fit into a certain version of what a cute girl is. I’ve never had a tiny body, and I grew up really tomboyish with short curly hair amid a sea of Southern California straight-haired blondes. I had no desire to wear makeup, and it always felt weird when my mom made me put on dresses; it just wasn’t my personality at all.A lot of my anxiety about not being “feminine” enough comes from my own family and culture. Iranians have a very specific, exaggerated version of femininity: making sure your eyebrows are really well-kept; that you’ve removed all other facial and body hair; that you wear clothes that are feminine enough, like dresses and skirts and certain kinds of shoes; and that you don’t chew gum in front of men. There’s a lot of, “This is what a woman does, and this is what a woman does not do.” I couldn’t bring myself to care about it—I just wanted to be climbing trees and riding bikes. But I still felt like a failure for feeling that way.The times when I feel the most attractive and like me have so little to do with what I’m wearing or whether I have the right makeup on.The first time I saw a cut from my Netflix show [Salt, Fat, Acid, Heat], I remember opening my computer screen, seeing myself, and closing the screen. I panicked and thought, I can’t do this. But I had to participate in the production, which meant I could either spend every day of the editing process going down some emotional sinkhole about myself and the way I looked, or I could do my job, which was to critically watch this show and try to make it better. It was almost as if I had to decide to not see myself—like when you’re brushing your teeth in the morning and you know you’re in the mirror, but you’re not ready to look yet.When we were filming in Italy, I knew I wanted to do a montage in which I eat like 50 different scoops of gelato. I knew that was possibly an invitation for someone to comment on my weight, but I just had to put it out of my mind because if I sat around being worried about what somebody might say about the way I look, then I wouldn’t be able to be myself. And the times when I feel the most attractive and like me have so little to do with what I’m wearing or whether I have the right makeup on. It has so much more to do with the environment I’m in and who I’m around and how they’re able to let me feel funny, or witty, or silly, or generous, or smart.There’s still plenty for me to be insecure about as a woman of color living in a world designed to make us loathe ourselves. I have a knee injury that makes exercise really complicated, and I’ve gained a lot of weight in the past few years, so it’s harder to find dresses that fit. I’ve also had a couple of surgeries recently. The older I get, anytime something isn’t working right, I’m much more aware of how important it is to take care of my body because it’s a physical thing that is deteriorating. But I also now understand that I can’t let shame control me. If I did, it would be the only thing I would have the time or energy for. I’m trying to grow my way out of that.As told to Christina Chaey, associate editorExplore Bon AppétitHealthyishFeel Better in 2020essayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-15", "author": ["Condé Nast", "Samin Nosrat"]}