{"id": "35c21fcdc35fb8dd33b020d9acb994e7", "url": "https://www.bonappetit.com/story/first-ba-cookbook-club", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "How Our First Cookbook Club Went Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Our First Cookbook Club Went DownSenior staff writer Alex Beggs shares highlights from the first #bacookbookclub, her favorite fall pasta dish, and more in her weekly newsletter.By Alex BeggsOctober 6, 2018FacebookTwitterEmailPhoto by Emily SchultzFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.How the first #bacookbookclub went downNormally I live by the Groucho Marx maxim “I don’t care to belong to any club that will have me as a member,” but made an exception for the newly launched Bon Appétit cookbook club. You get food at the end? Okay, I’m in. 16 staffers and not a single man (you know who are—and you better join in next month or ELSE) cooked recipes from Nik Sharma’s beautiful new book, Season, and gathered around the table to talk about how it went. I made a pineapple-serrano infused gin cocktail that had me squeezing pineapple pulp in cheesecloth over my sink at 8 a.m. like an amateur milkmaid, which was a first but not a last. The finished cocktail had a subtle heat and clean pineapple flavor—refreshing! Molly Baz made chaat masala-rubbed pork chops (pictured above) that wowed us all, Carla Lalli Music made lamb-stuffed mashed potato pancakes I wanted to sit in close proximity to, and Carey Polis’s sweet potato bebinca, a smooth pudding cake of my favorite texture (jiggly), was all I wanted for breakfast today. The challenge to tackle a recipe you might not have otherwise, coordinate and gather with friends around a table, talk about your successes and pitfalls in the journey of cooking—it’s not just for Thanksgiving! Find a cookbook you’re excited about and give it a go. A Google doc and a little planning is all it takes.Want this letter before it hits the website? Sign up for our newsletter!Peden + MunkThe price of pastaYou know how people lie? They say, “Yum! That was delicious.” But you can tell they’re just saying what they’re supposed to say as dinner guests at your table. And I can live on that alone! But sometimes they tell the truth and in those moments you bask in the glory. I made this winter squash carbonara recently and everyone at the table went back for seconds, using tongs to grab extra slivers of chopped bacon. My great aunt, whose kitchen I was crashing, went back for thirds. And she does thing where she puts a New York menu price on the dish, which I love. “You could charge $16 for this!” She told me over the blasting audio of whoever was pontificating on MSNBC. “At Via Carota!” She added. My heart was full. The roasted squash melts into the noodles + egg yolks + pasta water and becomes creamy, coating each strand. The bacon is bacon. We added a little Lacinato kale for health. Make this pasta.Alex LauGarlic powder 4 lyfeThis chicken cutlet is a great recipe, but a lot of people decide not to make it because they can’t find Maggi seasoning (a super concentrated “flavor enhancer” like extreme soy sauce). It goes in the buttermilk ranch dressing that’s doctored up with crème fraîche, onion powder, and garlic powder, the ingredient we waxed poetic about this week. Why use garlic powder instead of fresh? You can find out here, and then buy yourself a new jar, because yours looks dusty.The sprouting sweet potatoSpeaking of natural wonders of the world, we’ve have a purple Japanese sweet potato on our snack table for a few...months now. When it finally sprouted, Basically editor Amiel Stanek started referring to it as his “son.” Suddenly we were all emotionally attached to this grotesque and lumpy potato boy. As it sat in the sun, more sprouts grew into what looked like a curly head of hair atop the potato head. This week, Brad Leone walked over and gasped in delight: “Look at that! You can plant it in some dirt and it’ll sprout more sweet potatoes.” Alex Delany popped up from his desk, “No it won’t,” which really riled Brad up. “PUT IT IN THE DIRT, YA DINGLE!” He said. “I do it every year—decoratively.” So when the time is right, we might just do that. If Amiel can say goodbye.Photo by Heather StenTwo great readsCecilia Chiang is a 99-year-old restaurant icon. I can’t believe Priya Krishna was invited to her birthday dinner and got to snag a selfie with the (selfie-loving) lady of the hour. (Read for her aside about James Beard.)I’m intrigued by udon master (and BA Hot 10 chef) Tsuyoshi Nishioka’s obsession with dreams. Am I workshopping my life goals enough? Clearly not. Am I eating enough udon? Also no. I gotta work on that.Unnecessary food feud of the weekApple announced a few new food emojis this week, the most controversial being this shiny, dry-looking abominably plain bagel. “Dewy,” wrote Healthyish editor Amanda Shapiro, shuddering as she typed. “It’s like a Ken doll version of a bagel,” said restaurant editor Elyse Inamine. “The inside is like unexpectedly looking into a high def zoom mirror that shows you all of your pores,” said editorial assistant Jesse Sparks, who’d rather not catch that glimpse. “Uncomfortable,” noted social media manager Emily Schultz. “rly firm” typed editorial assistant Emma Wartzman. Molly Baz uploaded an image of a Thomas brand bagel for some reason. Like the drooly face, clown face, and blue bowl with NOTHING IN IT, the new bagel will be relegated to the emojis of little purpose file. At least it wasn’t...blueberry?Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-06", "author": ["Condé Nast", "Alex Beggs"]}