{"id": "35c276185eed3fdaf5d3f6d26cdc3f06", "url": "https://www.bonappetit.com/story/mushroom-powder", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Mushroom Powder Gets You Big Flavor in a (Literal) Pinch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMushroom Powder Gets You Big Flavor in a (Literal) PinchAdd it to soups, beans, sauces, braises, and baked goods—or sprinkle it right onto your tongue.By Bettina MakalintalMarch 23, 2022FacebookTwitterEmailPhotograph by Isa Zapata, Food Styling by Judy KimFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In the early days of the pandemic, I bought a container of Totole granulated mushroom bouillon, drawn to both the smiling mushroom mascot (a fun-guy, indeed!) and the promise that this do-it-all mushroom powder “makes everything delicious,” according to the Amazon listing. Aside from its use as a soup base, it is a powerful flavor enhancer—basically MSG on ’shrooms (MSG is the main ingredient, with dehydrated mushroom lagging behind).I’ve been intrigued by mushroom powder ever since. As it turns out, there are plenty of kinds, from the glutamate bomb of powdered bouillon to good old unadulterated ground fungi. Mushroom powders come in clutch in the kitchen when the flavors of what I’m cooking fall just a little short, and are especially useful in vegetarian dishes that don’t feel complex enough. Here’s what you need to know about the magical world of mushroom powder.Totole Granulated Mushroom Bouillon$12 at AmazonWhat is mushroom powder?In its purest form, mushroom powder is nothing more than mushrooms that are dehydrated and finely ground. The types of mushrooms that are used in the powder depend on the purveyor: Porcini and shiitake mushroom powders are probably the most readily available, but blends made of specialty mushrooms exist too. As Nikki DeGidio, kitchen manager of Seattle’s Foraged & Found Edibles, explains, “There are so many mushroom powders out right now, especially with the booming medicinal market, that it can get a little confusing.” So, let’s break that down!Shiitake Mushroom Powder$25 at SpiceologyWe can group mushroom powders into two broad categories: culinary powders, which you’ll find from spice sellers, and medicinal powders, which you’ll see in the wellness aisle (that’s different, of course, from, er, magical mushrooms). Often made with lion’s mane and reishi mushrooms, the latter are branded with a focus on potential health benefits like cognitive support (some studies have suggested that mushrooms may have positive effects on brain health in humans if consumed frequently). The two aren’t mutually exclusive though; as Michael Crowe, owner of Phoenix’s Southwest Mushrooms, explains, many mushrooms are both flavorful and functional.What does it taste like?The flavor and smell vary depending on the mushroom, says Crowe. That might influence how you use them. Lion’s mane powder, with its subtle cocoa scent, is mild enough to add to anything, he says, while maitake powder is darker in color and earthier in taste, and shiitake powder is even more pungent. A mix of mushrooms can add complexity: Foraged & Found Edibles’s wild mushroom powder has a toasty, caramel, maple aroma that DeGidio attributes to its blend of foraged varieties, including chanterelle, porcini, lobster, morel, and hedgehog mushrooms.​Pay attention to what you’re buying: Some wellness products, like drink mixes, aren’t intended for cooking and often include other flavors.How do I use mushroom powder?DeGidio particularly loves using mushroom powder in homemade breakfast sausages, but also recommends whisking it into a warm vinaigrette for vegetables, as a seasoning on potatoes, and as a dry rub for meat. Steep mushroom powder for a broth that tastes flavorful fast, or add it to sauces, soups, beans, greens, and baked goods—really, anything in which you want a little more oomph. To impart mushroom flavor into every bite of his potato gnocchi, chef Stefano Secchi makes his own porcini powder by blitzing dried mushrooms, then incorporates it directly into the dough along with all-purpose flour. And according to Crowe, some chefs have even used his mushroom powders as a gluten-free breading.“There are soooooo many applications for mushroom powder,” DeGidio says. “But the key is: It needs to see heat to bloom, just like most spices. You won’t get the depth of flavor and aroma if you simply try to sprinkle it on top of cooked food as a finish.”If it’s potential health benefits that you’re after, Crowe says that many people opt for two teaspoons of mushroom powder per day, mixed into a beverage like coffee or a smoothie, with lion’s mane being the most neutral-flavored option.How do I store mushroom powder?Crowe sells his mushroom powder in resealable bags, which he recommends storing in the fridge to ensure potency. There, the powder will stay fresh and flavorful for a long time, though he recommends using it within one to two years of purchase. The freezer is a good option too, according to DeGidio.Are there any other kinds of mushroom powder?It does not, in fact, stop there! There are also many mushroom powder-based products that are more like spice blends, typically containing salt and other additives. Examples include Nom Nom Paleo’s magic mushroom powder, Takii’s umami powder, Trader Joe’s multipurpose umami seasoning blend, and Imperial Taste’s mushroom seasoning.Takii Umami Powder$9 at AmazonThese options will instantly add savoriness, but you might want to use them with a lighter hand. For every bit of umami they add, they’ll also make things saltier, and since they often have other spices, these blends might not necessarily fit into the flavor profile you’re going for. For this reason, DeGidio recommends always reading the label on mushroom powders so you really know what you’re getting and what uses it’s suited for.Real mushroom heads know the move here: Buy multiple kinds for multiple uses, of course.Vroom vroom mushroomsPorcini Gnocchi With Butter SauceThis mushroom gnocchi gets its savory flavor from dried porcini mushrooms, which are ground into powder and mixed into the dough.View RecipeExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-23", "author": ["Condé Nast", "Bettina Makalintal"]}