{"id": "35cc61d8abf8bdc7ee8cabd452d41765", "url": "https://www.bonappetit.com/story/nigella-lawson-ina-garten", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "How Nigella Lawson and Ina Garten Helped Me Love My Fat, Queer Self | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Nigella Lawson and Ina Garten Helped Me Love My Fat, Queer SelfI learned to have an unapologetic appetite, a body that took up space, a desire to love and be loved, and an ability to show all of that through food.By KT HawbakerJune 3, 2019FacebookTwitterEmailIllustrations by Bryan FountainFacebookTwitterEmailI just knew I would never have a worthwhile body.I came to this conclusion sitting outside my then-boyfriend’s house, just a few days before I left for college. It was late July and, in Iowa, that meant walls of sticky humidity. Which meant major swamp-ass and serious chub-rub between my thighs.“I have a secret to tell you,” Boyfriend said. “But, you can’t get mad—and, you can’t tell anyone.”“Of course,” I replied breathlessly. I wanted more than anything to be his unconditional confidant.“I’m turned on by big bellies. Like really fat women and pregnant women,” he divulged, almost whispering. “I watch videos of obese girls eating huge portions of food. It’s like porn.”A baby feminist without a grasp of kink or fetish cultures, I was immediately floored. I’d spent my whole life being told I wasn’t thin enough. Now the man I loved was telling me I wasn’t large enough to be his fantasy. Or, was I? What did he want from my body? Whatever the answer, I wanted to give it to him.Looking back, this moment is pretty exemplary of how I spent the first 25 years of my life. My body belonged to whomever loved me; I saw myself how they saw me. And they usually saw a fat-ass. Someone they could inflict with their own deeply held insecurities. A body they could loathe.My grotesque dieting routines—800-calorie-a-day benders, weeks without carbs, fruit, sugar, meat, whatever—were complicated by my emerging desires. As I got older, wiser, and very aware of kink, I began to feel impulses off the hetero path. In my early twenties, my conservative, Christian upbringing collided with the radical dyke I was becoming. They were both ferocious. My body felt totally out of my control. The worst part of this whole tug-of-war was that I loved food. I loved making it, reading about it, and most of all, writing about it; even my senior thesis was about underground food cultures at a women’s prison.I eventually came out—brashly—as pansexual and cooked gorgeous dinners for my partner while secretly enrolling in Weight Watchers. I preached hard about the powerful, political relationships between women, femmes, non-binary people, and food, all while quietly having an affair with diet culture. I felt like a hypocrite. I couldn’t admit that I was starving for a connection with my body.Her cooking practices weren’t about innovation or molecules; they were about treating yourself well.I divorced my partner during another sweltering July, rife with chub-rub. I filled my emptiness with delivery food and gallons of Chardonnay, adding intoxication to my self-flagellation, maxing out my credit cards on pizza and hate-watching Sex and the City. I stopped caring about dieting; I stopped caring entirely about what happened to me.But, then a small internet miracle happened. I’d been watching some tragic music video on YouTube when an episode of Barefoot Contessa began to auto-play. I’d remembered my mom’s friends talking about Ina Garten, and while I loved watching the Food Network as a kid, I always changed the channel during her show because she lacked the pizzaz of Alton Brown.Now, though, Ina’s pastel sense of cool and subtle deviance felt soothing. She looked at her husband like she looked at dessert—she and Jeffrey are wild about each other—and offered a well-dressed brand of hedonism that instantly allured my sick mind and body. Ina somehow mastered what I’d been longing for all along: an unapologetic appetite, a body that took up ample space, an eager desire to love and be loved on equal terms, and an ability to show all of that through food.In Roxane Gay’s memoir, Hunger, she writes, “What I love most about Ina is that she teaches me about fostering a strong sense of self and self-confidence. She teaches me about being at ease in my body.” That’s precisely the remedy The Barefoot Contessa provided me.As I fell down this cooking video rabbit-hole, I also rediscovered Nigella Lawson. It’s impossible to ignore Nigella’s visceral, physical approach to eating. On Nigella Bites, she sticks her fingers in the sauce, wipes smears from her kids’ faces, and eats midnight leftovers in her pajamas. In my mind, her recipes were acts of radical self-indulgence. Her cooking practices weren’t about innovation or molecules; they were about treating yourself well.As I read more about Lawson, I discovered that she, too, had a vexed relationship with food and her body. She once told Australia's Sunday Telegraph Style, “My mother had an eating disorder, so I felt very strongly that I was not going to be tyrannised in that way. Also, if you've known three people you love very much die of cancer, you do not equate extreme thinness with healthiness.”So often, women and femmes are made to separate their pleasure from their power.It’s tricky talking about pleasure and Nigella Lawson because horny straight men so often start the conversation. For example, if you watch this clip of Jay Leno’s 2003 interview with her, you’ll encounter some mind-numbing misogyny at work. What I see in Lawson is a woman who is very plugged into how food, sex, and pleasure all overlap. Her recipe index includes “Slut Red Raspberries in Chardonnay Jelly,” and the description reads like Anais Nin: “This is heaven on the plate: the wine-soused raspberries take on a stained glass, lucent red, their very raspberriness enhanced; the soft, translucently pale coral just-set jelly in which they sit has a heady, floral fragrance that could make a grateful eater weep.” So often, women and femmes are made to separate their pleasure from their power, but Lawson keeps them both close at hand and uses food to bring them together.Both Nigella and Ina offered me revelation, a means of acknowledging that I’d been starving for a sense of self, for physical intimacy, for fat. It was as if they were telling me, “This is what it looks like to act on desire — all of your appetites. Give it a try.” They taught me that resistance to oppressive gender roles begins in the kitchen. Of course, putting this power into motion is challenging—it requires a special blend of vulnerability and chutzpah that’s in direct conflict with the cultural messages I receive all day long. And it’s a lifelong change that requires a tribe. Nigella and Ina led me to Lindy West, to the #fatacceptance pages of Instagram, and to the practice of intuitive eating. In my own recovery from diet culture, Nigella and Ina operate as vision boards, voices I turn to when the outside noise becomes overwhelming. I can always turn on an episode when I need to feel better in my skin.Explore Bon AppétitIna GartenessayRead MoreLifestyleThis Diner Is a Queer Oasis in the California DesertBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-03", "author": ["Condé Nast", "Kt Hawbaker"]}