{"id": "35d0e63e5ae897e256fdce622f0d6d5a", "url": "https://www.bonappetit.com/story/hot-10-best-new-restaurants-2019", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "The Hot 10: America's Best New Restaurants 2019 | Bon Appétit\n\n\n\n\n   \n        1. KONBI  2. KHAO NOODLE SHOP 3. LONGOVEN 4. OCHRE BAKERY 5. THE ELYSIAN BAR 6. KOPITIAM 7. TAILOR 8. LE COMPTOIR DU VIN 9. MATT’S BBQ TACOS 10. THE WOLF'S TAILOR       \n           1. KONBI  2. KHAO NOODLE SHOP 3. LONGOVEN 4. OCHRE BAKERY 5. THE ELYSIAN BAR 6. KOPITIAM 7. TAILOR 8. LE COMPTOIR DU VIN 9. MATT’S BBQ TACOS 10. THE WOLF'S TAILOR       \n                                                           \n   \n   After we spent months traveling the country and eating ourselves into a state of jaded, overfed delirium, these 10 restaurants were the places that snapped us out of it. They reminded us that tasting menus can still inspire awe; that a classic steak tartare can taste brand-new alongside the right glass of cloudy Chenin Blanc; and that an egg salad sandwich lunch can be so damn good that you think about it while you’re eating dinner, and long after you’ve left town. These are the restaurants that reminded us just how special dining out can be.   by JULIA KRAMER with AMIEL STANEK\n                 This story begins with hand soap. The brand: Kerzon. The scent: eucalyptus, but, like, real, woodsy eucalyptus—not potpourri-esque. Nine months ago I made a mental note of the tall teal bottle in a restaurant bathroom in Los Angeles. Then, because I was confident that this soap would improve my life, I ordered it on the flight home. (It’s not even on Amazon!) Every day since then I have thought about Konbi.   I’ve thought about that first visit, when I watched in awe, but also a certain amount of disbelief, as a bulked-out guy in a short-sleeve white button-down meditatively attended to the same two square-shaped pans of eggs for my entire visit. He folded the beaten eggs methodically with chopsticks until they formed tidy little omelet pillows, which he set between slices of cloud-soft milk bread spread with spicy mustard and mayo that he then carefully trimmed two crusts off of, like some loving parent making a PB&J for a five-year-old.   That guy was Nick Montgomery, who opened Konbi with Akira Akuto; both are alums of David Chang’s Momofuku restaurants in New York. American chefs talk about opening “odes” to little spots they stumbled upon in Tokyo, and while this 10-seat space is indeed Montgomery and Akuto’s ode to Japan’s konbini (24-hour convenience stores), there is a palpable intensity to their level of study that makes Konbi entirely its own.    Photographs by Alex Lau         The chocolate croissant worth planning your entire morning around       The take-out window       Turnips With Spicy Meyer Lemon Dressing       The meditative omelet method       Shishito Pepper–Pistachio Dip       Chefs Akira Akuto and Nick Montgomery         I’ve thought about what it was that compelled me to go back the next day, this time to the take-out window, for another omelet sandwich, sliced in three segments and set in a little white box of just the right size. And a crispy pork katsu one. And the egg salad one made Instagram-famous by its orange-yellow yolk half-moons. And also the carrots with weirdly good dip that turned out to be blitzed shishitos and pistachios.   I’ve thought about my next visit to L.A., when I vowed not to leave without one of Konbi’s coveted croissants, of which only 36 are made daily. I showed up at 11 a.m.: sold out. I returned early the next morning: They weren’t out of the oven yet. I came back 90 minutes later: The last two chocolate croissants were mine!   This experience should have made me resent Konbi, a place that actually prompted me to describe the process of buying a pastry as Kafkaesque. But I didn’t (obviously). Because as I stood there, on an Echo Park sidewalk in front of the shop next door that sells vegan cheesecakes and crystals, and shamelessly covered myself in the deep-golden crumbs of a croissant so fresh that the ample amount of chocolate inside hadn’t yet returned from its melted state, I knew: This was the best croissant I’d ever had, and it was worth it.   This is the thing about Konbi, a tiny sandwich shop that has received, since before it even opened, an inordinate amount of attention. Its sheer popularity should make it a maddening place (and a maddening choice for best new restaurant). If only everything about it, from the croissants to, yes, the hand soap, weren’t so perfect. —J.K.   Wanna try Konbi's food? Get tickets to the Hot 10 party.       THE PLAYERS: Chef-owners Akira Akuto and Nick Montgomery   THE SETUP: Daytime-only Japanese sandwich counter, with stellar French pastries   THE ORDER: Layered omelet sandwich, potato salad, chocolate croissant   THE MOVE: Time your visit around 9:30 to (try and) snag one of the 36 chocolate croissants.     Photographs by Alex Lau             At Konbi they crack dozens of eggs each day for the signature pork katsu sandwich.       Whisking water into the eggs makes sure the panko coating isn’t too thick.       Cooks dip the pork cutlets in egg yolk, letting the excess drip off.       Next up is a dip in panko. Konbi uses Miyako brand.       Cutlets get a drizzle of tonkatsu sauce, then mustard.       Each sandwich gets a layer of cabbage.       Close ‘er up!       Each sandwich gets sliced into three perfect segments.       Showing off the interior for maximum photogenic-ness.     \n                 There are approximately 12 dishes on the menu at Khao Noodle Shop, each only a few bites or spoonfuls, and none costs more than $8. So in my attempt to understand what exactly the chef and owner Donny Sirisavath was trying to do, it was easiest just to order them all.   After one slurp of painstakingly handmade noodles in a savory, complex pork blood broth, the restaurant’s roots came through clearly: This is the cooking of Laos, the country the chef’s mother fled after its civil war before resettling in Texas in 1977. Sirisavath, who was born in Amarillo, grew up helping his mom in the kitchen of her Thai restaurant, learning how to make pad kee mao and wok-fried rice. Years later, after his mom died, he began hosting Lao pop-ups as a side project (he was a Hewlett-Packard engineer by day), then left his job to open Khao Noodle.   Now, in a strip mall in East Dallas—an area once home to many Southeast Asian refugees in the late ’70s and early ’80s—Sirisavath serves a menu inspired not by books or classes or other restaurants but by his own singular vision, rooted in family and place. This is a rare thing to find, and I felt lucky just to be there.   But Khao Noodle Shop is not a restaurant that looks only to the past. From the laid-back vibe inside—the high-top tables, the stools spray-painted by friends, the tight-knit staff, the sheer fun of the place—I could feel Sirisavath’s excitement at doing things his way. And once I tried the deep-fried tripe chicharrones and the musubi-like moutsayhang (a two-bite stack of crispy pork patty, sticky rice, and a thin layer of omelet), it was clear that Sirisavath was telling a story all his own. —J.K.       THE PLAYERS: Chef-owner Donny Sirisavath   THE SETUP: Snack-size Laotian at high-top communal tables, day and night   THE ORDER: Boat noodles, khao soi, moutsayhang (spiced pork-and-rice bites), shrimp bites   THE MOVE: Don’t share—each dish is only a few bites. Oh, and BYOB!     Photographs by Alex Lau          Small dishes help create a Lao street food experience.       Sirisavath says he learned everything he knows about restaurants from his mom, Phaysane.       Moutsayhang is a play on Hawaii’s Spam musubi.       Sirisavath and his friends designed and built out Khao's space themselves.       Sirisavath makes his noodles the old-fashioned way, by ladling the batter onto a stretched cloth over a vat of boiling water.       Making noodles from scratch isn't easy or fast, but Sirisavath says you can taste the labor and the love that goes into them.       Khao Noodle Shop is full of photos of Phaysane Sirisavath and other personal mementos.       Sukiyaki with glass noodles, fermented tofu, coconut cream, and a soft boiled quail egg       Food is served in bowls, baskets, and dishes brought back from trips to Laos and Thailand.       Wet khao soy with rice noodles, mushrooms, and fermented pork     \n                   Longoven is the most unlikely standout fine-dining restaurant in America. The chefs—Andrew Manning, Megan Fitzroy Phelan, and Patrick Phelan—have little name recognition outside their hometown. Their restaurant is housed in a nondescript building in a rapidly developing neighborhood clamoring more for taprooms and barbecue joints and taprooms-slash-barbecue joints than for an austere-looking tasting-menu spot. That neighborhood (Scott’s Addition) is in a city (Richmond) that’s only very recently begun to draw attention as a dining destination.   And that doesn’t even begin to tell the circuitous 15-year epic of the three chefs behind it. (Let’s just say it involves a stint in Alba, Italy, and many arduous hours in the catering world.) Eventually they reconnected and decided to move to Richmond, where they launched Longoven pop-ups in 2014. I stumbled into one at Sub Rosa Bakery in 2016. Given what they were able to pull off with a wood-fired oven and two camping burners, I was very curious about how they’d do in an actual kitchen.   Well, spoiler alert: The brick-and-mortar Longoven, which finally opened last year, is mind-bogglingly good—each dish so technically precise, so truly dedicated to ingredients, not to mention so, so pretty. This is very beautiful and very serious food served in a very beautiful and very serious space. Yet there is none of the “staged-at-Noma-once” ego trip that has mucked up many similarly ambitious projects. Instead, there’s a refreshing graciousness and hospitality—a sense that everyone is actually happy you’re here. Behind it all is the earnestness and maturity of three people who have worked harder than I can imagine to get to this place and who take none of their (unlikely) success for granted. —J.K.       THE PLAYERS: Chef-owners Andrew Manning, Megan Fitzroy Phelan, and Patrick Phelan   THE SETUP: Tweezer food you actually want to eat   THE ORDER: The tasting menu   THE MOVE: Make a reservation. Wear something nice. Go all in.     Photographs by Emma Fishman             Course 1: Snacks at Longoven mean a tiny nasturtium-covered carrot-mole tart, a fried squid ink “churro,” and nori crackers with smoked mackerel.       Course 2: The staff loved the Meyer lemon kombucha at family meal so much that Manning made it into the base of this refreshing scallop crudo.       Course 3: Manning emulsifies foie gras with cream and gelatin until airy, then tops it with hazelnuts, grapefruit, and a snow cap of carbonated ginger ale.       Course 4: As a play on Caesar salad, the plate is streaked with sea urchin, clam-infused buttermilk dressing, and romaine brushed with ramp vinegar then grilled.       Course 5: Manning serves his fava-bean-and-mushroom salad with grilled Maine lobster.       Course 6: Manning turns pig ears into paper-thin sheets, then crowns them with peas and beans of all types.       Course 7: That grated white stuff? Not parm; it’s scallops that have been cured, cooked with mushroom scraps and dashi, and then dehydrated and shaved over charred maitake mushrooms.       Course 8: Beneath the tangle of agretti (a chive-like Italian vegetable), there’s roast lamb loin, and next to it is a pool of blackened sunchoke purée.       Course 9: For dessert, Fitzroy Phelan transforms house-made fig leaf oil, the staff’s beloved condiment, into a sorbet paired with pickled blueberries.       Course 10: “Super cute!” That’s how most guests respond to Fitzroy Phelan’s mushroom-shaped chocolate cake dusted with dried porcini and cocoa.       Course 11: The black-sesame-tahini-chocolate gold bar now has a cult following, but don’t sleep on the blueberry macarons, pâte de fruit, and sage-caramel bonbons.     \n                 8:43 a.m. I’m at Ochre Bakery, and the first thing I’m eating today is a danish, the crumbly, deep-golden pastry barely holding on to the squiggles of still-juicy rhubarb in the center.   8:46 a.m. Watching the guy behind the counter make a cortado, I realize that this is as much a Serious Coffee Shop as it is a bakery, which makes sense given that it’s owned by Jessica Hicks and Daisuke Hughes, the same people behind Detroit’s much-loved Astro Coffee. I’m getting lost in the idea that I could live in Detroit and this could be my coffee shop and I could eat this Danish every morning when…   8:57 a.m. My plate of scrambled eggs shows up, but to call it a plate of scrambled eggs is kind of rude given that it’s eggs softly scrambled with turmeric; tzatziki with slivers of kohlrabi; a big pile of bitter greens; a very generous serving of very good butter; two holey slices of country bread; and a tiny handmade ceramic bowl of cumin seeds, Aleppo-style pepper, and flaky salt that I can sprinkle over whatever I like.   8:58 a.m. Can we talk about this bread? I was so fixated on the pastry case, I didn’t notice the room behind the counter where cult local baker Max Leonard babysits the sourdoughs. So not only does this place turn out pastries and coffee and savory food at the highest level, but there’s also a high-key bread program?   9:18 a.m. I’m the person taking pictures of the blue and ochre (duh) tiles hand-painted by Hicks.   9:28 a.m. Yeah, I’m going to need a slice of the lemon-pistachio loaf cake, a piece of the chocolate banana bread, and one of every cookie (espresso shortbread, chocolate-hazelnut, oaty Anzac) to go. Or maybe I’ll just never leave. —J.K.   Wanna try Ochre Bakery's food? Get tickets to the Hot 10 party.       THE PLAYERS: Chef-owners Jessica Hicks and Daisuke Hughes   THE SETUP: The dream of a sun-soaked bakery/café   THE ORDER: Spiced scrambled eggs with tzatziki, a seasonal Danish, and an Anzac cookie   THE MOVE: Grab one of everything from the pastry case to go—and a loaf of bread too.     Photographs by Michael Graydon + Nikole Herriott          Server Solomon Gaut grabs a slice of layer cake for a very lucky (and smart) customer.       The muffin selection changes with the seasons: These are Apple-Honey-Pecan.       Outside of lunch hours, Ochre is open all day for espresso and pastries.       Max Leonard’s housemade bread comes served with Smoky Carrot Dip, Beet and Hazelnut Dip, and Hummus With Pistachio Dukkah.       Server Destany Colagrossi works the lunch shift.       The Chocolate-Hazelnut Cookies are too small to share (at least that’s what we told ourselves).       Chef-owner Jessica Hicks decorates the Lemon-Pistachio Loaf.       Muffins and Lemon-Pistachio Loaf in the pastry case.       Sunny day patio vibes.       Seven-month-old Yuka Hughes scrutinizes the offerings.     \n                   I had a feeling about the Hotel Peter & Paul. Not a good feeling. Something about sleeping in a former convent gave me the creeps. As much as I tried otherwise, I kept picturing the World War II–era schoolhouse in Au Revoir les Enfants (a strangely seminal movie in my childhood). Then I showed up to meet a friend for a drink at the hotel’s restaurant, the Elysian Bar, which occupies the ground floor of a building that used to be the rectory. And I realized: Sometimes I am kind of an idiot.   Calling this a bar is an understatement. First of all, it’s a full-on restaurant, from chef Alex Harrell and the team behind the beloved NOLA hangout Bacchanal. You can make a meal out of gulf shrimp showered in bottarga breadcrumbs or steamed mussels in smoky tomato broth—this is not a town that messes with dainty bar snacks. Second, this is less a defined space and more a multiroom wonderland, with a sunny patio, elegant parlor rooms, and a cozy bar that feels straight out of a Hollywood movie set. The complex has been revived by Nathalie Jordi, a former journalist, in collaboration with the Brooklyn-based developer ASH NYC (also behind Providence’s The Dean hotel and The Siren in Detroit) and NOLA’s StudioWTA. Together they transformed the 1860s Catholic church and schoolhouse into 71 hotel rooms unlike any other—plus magical open-to-the-public spaces like this very bar.   At a time when design trends come and go so fast (ahem, pink neon), it’s unusual to step into a space with such a deep sense of character. There’s not much more I could have asked for in this setting than a cool vermouth spritz, a perch on one of the custom cherry-leather stools, and a long, lazy afternoon with nowhere else to be. Turns out, you can have all that, with a flawless caviar-topped omelet too. —J.K.       THE PLAYERS: Managing partner Joaquin Rodas, chef Alex Harrell, general manager Lisa Nguyen   THE SETUP: 19th-century-church becomes old-world hotel bar   THE ORDER: Duck egg omelet with caviar and any spritz you feel like   THE MOVE: Book a room at the Hotel Peter & Paul; pretend you live here.      Photographs by Alex Lau additional reporting by Chelsea Brasted           Designed to resemble a tree trunk, the bar’s back wall was crafted by Kern Studios, which also carves the Styrofoam figures on Mardi Gras floats.       Design firm ASH NYC modeled these barstools after a midcentury stool from Italian furniture maker Bonacina.       The Kir Royale (right) comes in a Nick & Nora glass with subtle lace etching made by British company Steelite.       Monet’s dining room in Giverny inspired the breakfast room, and the dish set he used there inspired these hand-thrown custom plates from ceramist Jono Pandolfi.       This cart-slash-magazine holder was bought from a Parisian textile dealer who had been using it as a display.     \n                 Is it possible to love someone without really knowing them? What about a restaurant? I fell for Kopitiam in its first iteration, a hole-in-the-wall Malaysian coffee shop on the border of Chinatown. I’d duck in among the neighborhood regulars for sesame noodles or nasi lemak: a coconutty rice bowl topped with crispy-crunchy crumbles of teeny little fried anchovies dressed in a sweet-spicy sambal.   And when Kopitiam’s chef, Kyo Pang (pictured above, right), partnered with Moonlynn Tsai (formerly of the Taiwanese spot Pine & Crane in L.A.) to relocate and expand Kopitiam down the block, I immediately loved this location even more. The space is comparatively sprawling, with lots of good light coming in through the big windows facing East Broadway and a whole expanded menu of brothy, noodle-y, rice-y dishes showered with those shoestring-fry-like anchovies. There was anchovy broth loaded with rustic hand-cut noodles for pan mee; fried belacan wings coated in caramelized shrimp paste; squishy squares of honeycomb cake.   But the more dishes I tried, the more I realized I’d only scratched the surface. On weekends there were rounds of new specials: fragrant assam (tamarind) curry; slow-cooked beef rendang. As Lower East Siders with white sneakers and AirPods crammed into the space, Pang seemed to only dig deeper. And finally I learned her story: how her cooking is influenced by her background as Baba-Nyonya (sometimes called Nyonya or Peranakan), the descendants of Chinese settlers in Malaysia. How she sought asylum in the U.S. a decade ago as an openly gay woman. How she hasn’t seen her parents in 11 years. How her cooking connects her back to her family.   There was so much more I wanted to know about Pang, about Kopitiam. That’s why, of course, I have to keep coming back. —J.K.   Wanna try Kopitiam's food? Get tickets to the Hot 10 party.       THE PLAYERS: Chef/co-owner Kyo Pang and co-owner Moonlynn Tsai   THE SETUP: Counter-service Malaysian, any time of day   THE ORDER: Lobak (ground pork wrapped in tofu skins), nasi lemak, kuih lapis (layer cake), teh tarik (pulled tea)   THE MOVE: Ask about the daily specials on weekends and you will be rewarded.     Photographs by Alex Lau          After a rent hike forced Pang to close her original location, she and Tsai teamed up to open this expanded, sunny space in June 2018.       Kaya butter toast, with a thick layer of pandan leaf and coconut jam sandwiched between two golden slices of fluffy bread, is a must-order.       The deeply savory pandan chicken, a compact triangle of minced chicken, is wrapped in aromatic pandan leaves that impart a sweet and grassy aroma.       The small menu is chock full of noodles, rice dishes, and more plates inspired by the Baba-Nyonya food Pang ate growing up in Malaysia.       To make the crispy-crunchy topper for her nasi lemak, Pang fries small dried anchovies until crisp and tosses them with toasty peanuts and sambal.     \n                 A restaurant’s generosity can take many forms. A half-empty wine glass topped off with a wink. A gratis dessert when service is slow. But the particular brand of radical generosity on display at Tailor, the brick-and-mortar evolution of chef Vivek Surti’s beloved Nashville pop-up, exists on a higher plane. It’s personal, direct, honest. Because before each course in the “dinner-party-style” tasting menu—eight to 10 dishes, two seatings each night—Surti stands in front of the room and gives.   Born outside of Nashville to parents who emigrated from Gujarat in western India, he gives of his heritage when he explains to 30-odd mostly white diners that the fragrant amber-tinged diamond under a layer of toasted coconut and sesame seeds is called dhokla, a common breakfast halfway around the world. He gives of his craft when he goes into how the tangy ranch-esque dressing for a bowl of young lettuces and crisp radishes is inspired by chaas, a fermented dairy-based hot-weather tonic (like yogurt Gatorade, if you will). And he gives of his own history when he shares that this drink is what his mom gave him after basketball practice.   Surti’s storytelling suffuses the space and the food served within it with so much vulnerability and personality and love that you could not possibly be anywhere but “our home,” as he refers to the restaurant. Which is exactly where you want to be. To dine at Tailor is to be his guest, fully and completely. And that’s a rare kind of generosity indeed. —A.S.       THE PLAYERS: Chef/managing partner Vivek Surti   THE SETUP: Gujarat meets the American South via a set menu   THE ORDER: That’s up to Surti and the seasons.   THE MOVE: Book a seat at the bar counter for the best view of the action.     Photographs by Marcus Nilsson          Boiled Peanuts With Chile       After years of running his pop-up restaurant VEA, Surti can turn any space into a kitchen, including the bar counter of Tailor.       Chefs Patrick McCandless and Allie Evans (right) sprinkle cilantro over baigan ravaiya, local eggplants stuffed with coconut and lady peas.       Little Gem Salad With Buttermilk Chaas       Bourbon Fruit Tea Punch       It’s Surti’s party and he’ll slice spiced roast pork if he wants to.       Spiced Roast Pork With Fennel and Apple Salad       Surti seasons boiled peanuts with chile and coriander, which “is very Indian” but reminds him of Cajun-spiced ones from gas stations in the South.       Rose and Yogurt Panna Cotta       \"The most iconic dish Indians make at home,\" says Surti: Sweet-and-Sour Dal Bhat     \n                 This is not the first restaurant to serve French classics in a cozy, warmly lit, slightly ramshackle bistro setting. But if there’s any place in the country that’s making this quintessential genre feel fresh and new and fun and youthful, it’s Baltimore’s Le Comptoir du Vin.   It all starts with the delightful couple who opened it: Rosemary Liss, an artist whose residency at the Nordic Food Lab in Copenhagen involved making a quilt out of dehydrated kombucha mothers, and Will Mester, who was chef de cuisine at the restaurant that used to be in this same space, Bottega. The pair built Le Comptoir as an homage to a neighborhood restaurant in Lyon of the same name, which Mester liked so much that he convinced the chef to let him spend a night in the kitchen.   Like the Lyonnaise original, the scrappiness of the Le Comptoir operation is its charm. Mester didn’t want to be the type of chef who oversees lots of stations; the kitchen is just he and his sous-chef, Kelsey Martin, who runs point on the bread and baked goods.   And yet: They turn out the silkiest chicken liver pâté. They hand-cut a tartare that practically glistens, the steak tossed in colatura (anchovy sauce) and served with roughed-up golden hunks of potato that made me question how I ever could’ve enjoyed steak tartare any other way. For dessert they make crazy things like Grandpa toast, in which foie gras is shaved onto a piece of well-crisped bread, and it’s exactly what you think a frozen waffle smothered in butter and maple syrup is going to taste like but never does.   For as satisfying and timeless and rustic as these dishes are, the food is not even really what Le Comptoir is about. It’s about having a place where you feel immediately welcomed. A place where you can settle into a worn wood chair under a wall-mounted marlin and drink glass after glass of delicious natural wine from the scribbled list. A place where you just wanna hang out, as golden hour fades, hoping the night never ends. —J.K.       THE PLAYERS: Chef/co-owner Will Mester and co-owner Rosemary Liss   THE SETUP: Come-as-you-are natural wine bar-slash-French bistro   THE ORDER: Chicken liver pâté, steak tartare, Paris-Brest (and Grandpa toast if it’s on the menu)   THE MOVE: Try something you’ve never had before from the short-and-quirky wine list.     Photographs by Alex Lau          Paris-Brest with pistachio cream       Owners Will Mester and Rosemary Liss       Egg yolk ravioli with ham, peas, and brown butter       Pig’s head terrine with pickled fennel       The restaurant’s ever-changing chalkboard menu       Roast chicken with fried potatoes and mojo rojo       Le Comptoir's menu changes almost daily, tied to both the seasons and whatever wines Liss is excited about.     \n                 There are two things in this package that are going to upset a lot of people in Texas. One: naming Dallas our restaurant city of the year, which I have a feeling a lot of people in Houston and Austin are, uh, not gonna like. Two: what I’m about to say about a breakfast-taco joint…that’s also a barbecue joint…that’s in the most un-Texas location imaginable—Portland, Oregon. Please don’t hate me.   The person to blame for this is Matt Vicedomini. He’s an unsuspecting character for a barbecue icon: from Long Island, learned how to smoke meat at a cowboy-themed restaurant in Australia, has never lived in the Lone Star state, though he has made many, many brisket-oriented pilgrimages there. He eventually settled in Portland and opened a trailer—Matt’s BBQ—in the parking lot of a pawnshop. Sure, there wasn’t a lot of competition for Texas-style ’cue, but nevertheless Matt’s immediately became known as the best in the city.   This winter Vicedomini followed that up with not one but two new spots, both of which show off his legendary brisket, simply seasoned but expertly smoked, low and slow, over oak for 10-to-12 hours. The first is Eem, a Thai barbecue collab with the folks from Portland’s celebrated Langbaan and pop-up cocktail bar Shipwreck. The second is Matt’s BBQ Tacos, which opens at 8 a.m., with that brisket and pork belly burnt ends and more smoked meats. They all come piled with scrambled eggs and potatoes and salsa onto unbelievably puffy flour tortillas made with rendered lard.   The pleasure of Matt’s BBQ Tacos is pure and simple: When I think about where I was the happiest on the road this year, my mind immediately goes to sitting in the sunshine (yes, in the Pacific Northwest!) at one of the picnic tables next to the trailer, folding up the most irrefutably delicious tacos one after the next, pausing only to dip a fresh-fried tortilla chip into creamy queso. What’s to hate about that? —J.K.   Wanna try Matt's BBQ Tacos' food? Get tickets to the Hot 10 party.       THE PLAYERS: Chef-owner Matt Vicedomini   THE SETUP: Breakfast-and-lunch food trailer with picnic tables   THE ORDER: Sliced brisket taco, migas breakfast taco, chips and queso   THE MOVE: You want the (deliciously lard-y) flour tortillas.     Photographs by Laura Murray          Vicedomini’s got a thing for trailers—they remind him of Texan barbecue titans (Franklin Barbecue, La Barbecue) but feel distinctly Portland, with all its food carts.       The key to the perfectly chewy flour tortillas at Matt’s BBQ Tacos? Leftover lard from his restaurant Eem.       Is there anything better than a thick, wobbly slice of brisket, topped with pickled red onions and guacamole and wrapped up in those flour tortillas?       Fact: Breakfast tacos just taste better outside.       Meet the barbecue taco crew, from left to right: Chris Robblee, Matt Vicedomini, Matt Billups, Josh Fisher, Derek Burrus, and Dustin Reum.     \n                 I think we can all agree that the Wolf’s Tailor really needs to chill out. Don’t get me wrong, I am extremely into the fact that I can start my meal with a hot puffy disk of chef Kelly Whitaker’s heirloom-grain piada bread straight from the restaurant’s wood-fired oven. But don’t you think that the binchotan-fueled Japanese robata grill, the one they use to sizzle skewers—a juicy chicken meatball, or crispy-edged mortadella—to succulent perfection is kind of gilding the lily? Just a little?   Another great example of way-too-muchness: the pasta program. The toothy mafaldine I had one night—made from local grains milled in-house and tangled up with morsels of grassy whey-braised Colorado lamb and tender little peas—was the single most exciting plate of pasta I ate this year. But did Whitaker really have to take the leftover bran from milling that flour and use it to ferment all sorts of electric, eyebrow-raising pickled vegetables? Again: I love those pickles. But you have to admit it’s a little…extra, right?   And how is it even fair that Whitaker nabbed chefs Kodi Simkins and Sean May, of Frasca Food & Wine fame, to make his whole freaky vision come alive? Or that he brought on the Michelin-starred pastry chef Jeb Breakell to whip up as-fascinating-as-they-are-lovable desserts? (That red miso panna cotta!)   And the generous big-meat family-style entrées. And the tight, well-curated natural wine list. And the Japanese highballs made with ice so crazy-clear I could see through the cubes halfway across the room (and nearly spilled half my drink trying to do so). And, and, and.   Enough is enough! Is it too much to ask that they save some of the fun for everyone else? —A.S.       THE PLAYERS: Chef-owner Kelly Whitaker, culinary director Sean Magallanes, chefs de cuisine Kodi Simkins and Sean May, pastry chef Jeb Breakell   THE SETUP: Handmade pasta and robata, so well executed that it works   THE ORDER: House pickles, chicken skewers, any pasta, large-format pork ribs   THE MOVE: Desserts are wild and not to be overlooked.     Photographs by Alex Lau          The egg yolk dipping sauce served with the chicken meatball skewers is topped with a zesty house-made yuzu kosho and dehydrated chives.       King trumpet mushrooms are grilled over a mix of Japanese binchotan and Pok Pok charcoal for skewers.       Whitaker installed the wood-fired oven specifically for baking his signature piada, a fluffy, hot, pita-like disk of bread made with heirloom grains.       Piada bread served with farmer's cheese, edamame purée, garden herbs, and benne.       The bran leftover from milling grains into flour is used to make fermented pickles, like this Napa cabbage seasoned with Calabrian chiles and dried anchovies.       We've adapted these addictive ribs so you can make them at home with excellent results. Get the recipe: Miso Pork Ribs with Chile-Honey Glaze        The pasta drying room features a large glass window that looks into the restaurant's main dining room.       The Wolf's Tailor uses an extruder to make various pasta shapes, such as the paccheri and mafaldine shown here.       The tasting menu option comes with a bowl of this cozy, congee-like porridge. Get the recipe: Rice Porridge with Dashi       Sake-Braised Mustard Greens with Sesame     \n     Project Lead: Julia Kramer   Additional Reporting: Andy Baraghani, Molly Baz, Hilary Cadigan,  Christina Chaey, Elyse Inamine, Sarah Jampel, Carla Lalli Music, Meryl Rothstein, Jesse Sparks, Amiel Stanek, Anna Stockwell   Senior Staff Photographer: Alex Lau   Development: Alexander Ratner   Art & Design: Chris Cristiano, Chelsea Cardinal, Bryan Fountain, Christa Guerra   Copy & Research: Brian Carroll, Greg Robertson, Susan Sedman   Social: Rachel Karten, Emily Schultz   Special Thanks: Emma Fishman, Michelle Heimerman, Sasha Levine, Michele Outland, Carey Polis, Adam Rapoport, Annalee Soskin, David Tamarkin", "date": "2019-09-17", "author": ["Condé Nast"]}