{"id": "35d6065f54284014c6e9a9d1dbbe85f3", "url": "https://www.bonappetit.com/recipe/smashed-cucumber-salad", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Smashed Cucumber Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueSmashed Cucumber SaladBy Justin LeeApril 20, 20214.2(33)Read ReviewsTriangleEmailPinterestPrintPhotograph by Frank Frances, food styling by Lillian Chou, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintGrowing up, Justin Lee, owner and chef of Fat Choy, enjoyed smashing cucumbers for this salad in a bag. “It was like a Chinese American kid’s version of Shake ‘n Bake,” he says. This is a refreshing saucy dish that’ll cool you down all through summer. At the restaurant, they make their own chili oil, but you can keep it simple and grab your favorite brand from the store.Ingredients4 Servings6medium Persian cucumbers (about 1 lb.)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1garlic clove, finely grated¼cup tahini3Tbsp. fresh lime juice1Tbsp. soy sauce1Tbsp. unseasoned rice vinegar1Tbsp. white miso1tsp. finely grated ginger1tsp. sugar1tsp. toasted sesame oilChili oil (for serving)2scallions, thinly sliced on a diagonal1tsp. toasted sesame seedsPreparationStep 1Cut cucumbers in half lengthwise, then slice ¼\" thick on a deep diagonal into 2\"–3\"-long pieces. Transfer cucumbers to a large bowl, add salt, and toss to combine. Cover and chill at least 1 hour and up to 12 hours. Drain cucumbers.Step 2Whisk garlic, tahini, lime juice, soy sauce, vinegar, miso, ginger, sugar, and sesame oil in a small bowl to combine. Pour dressing over cucumbers and toss well to coat.Step 3Transfer cucumber salad to a platter. Drizzle with chili oil and top with scallions and sesame seeds.How would you rate Smashed Cucumber Salad?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThis was a big hit! It's a great side dish for any Chinese meal. Easy enough to make mostly ahead so you aren't juggling multiple dishes at once. I will salt the cucumbers earlier next time. They released a lot more water and made the dressing watery even when I drained and dressed them right before serving dinner. It was a little salty, too, and I think more salt would drain off with the water if I'd let them sit longer.\nThis makes way too much dressing, just save it for later. I had it on a simple salad of romaine and cherry tomatoes and it was great. It reminds me of the sesame dressing you get in sushi restaurant salads.ElCeeToronto, Canada3/25/2022This tasted great, I served it as an accompaniment to the \"Crispy Pan Fried Shrimp with Cabbage Slaw and Gochujang Mayo\" recipe (also delicious) and they went really well together. I only put the salted cucumbers into the fridge for an hour due to a lack of time but next time I'll leave them for 12 as the dressing did go a bit watery after a while given the cucumbers hadn't had a chance to dehydrate very much.\n\nI do wish the cucumbers were smashed though - I was looking forward to it!HansweenNew Zealand12/21/2021This is CUT cucumber salad.  Why wax poetically about smashing them when the recipe instructs slicing?  Stupid. DonaldLos Angeles 8/12/2021This salad is so delicious it takes all the self control I have not to lick the plate! I love using my favorite Fly By Jing chili crunch oil on top. Sarah SuluGrass Valley, CA6/22/2021After reading the reviews of this recipe, particularly about \"gloppy\" dressing, I made some adjustments. The first adjustment I did, (which I know literally counter indicates the name of the recipe) was leave out the Tahini. I'm not a huge fan of Tahini and I didn' have any on hand. I did double the miso however. I also left out the sugar. Not having chili oil available I used chili paste which I mixed into the dressing. Since I was not \"presenting\" it, I mixed everything together. The result was a nice consistency for the dressing that coated everything perfectly. No glops. I also added some fresh cilantro which gave the dish a nice brightness enhancing all the other flavors. I enjoyed it thoroughly.T.J.San Francisco, CA6/5/2021I made this and did not use all the dressing. The salad was AMAZING and I have been devouring the leftover dressing as a dip with cucumber slices for a snack ever since. I HIGHLY recommend this recipe. I did add a little light smashing of my cucumbers for fun - why not?Mari K-CGrand Rapids, MI6/3/2021I don't even like cucumbers and have been craving this since I first made it at my kids' request.  I made exactly as specified (sliced cucumbers instead of smashed), except used chile crunch instead of chile oil - love the texture that added.  I would use less ginger next time and add a drop or two of fish sauce.  This will be a staple in the summer.AnonymousDenver, CO5/14/2021I can't help but feel like this could have been great if I only added a tablespoon of tahini instead of the required 1/4 cup. It ended up looking nothing like the picture-- the cucumbers were utterly drenched in tahini, and instead of the lightness of a salad, you have this buttery, thick gloop, and the nuttiness just completely overwhelms and fights with the acidity and umami. These ingredients together sound interesting but wow did this just really misfire. I can't recommend it.Alex BLos Angeles5/5/2021Usually, you would put the cucumbers in a plastic bag and gently smash them with a skillet (just enough to split them).  Remove them from the bag and further split/shred them into not-too-slim pieces.  Here, he slices them.  It's more fun to smash them, and the salad looks more rustic.DeeNew York5/3/2021It does sound great, and I look forward to trying it - but when does the smashing happen?  It's not mentioned in the recipe at all.  After the chilling with salt, maybe?  Or before the salting?  Does it matter?  Or are they sliced *instead* of being smashed?  Confused!LizOntario, Canada4/22/2021This sounds great - but I am confused.  He talks about enjoying \"smashing\" the cucumbers - but NO WHERE in the recipe do you actually smash the cucumbers.  Was something left out? - do you smash before you marinate the sliced pieces??Anne VrolykOakland, CA4/22/2021Explore Bon AppétitSaladCucumberVegetableEasyQuickSideVeganVegetarianDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Justin Lee"]}