{"id": "35e12792cb4276944a46141f3e556dbf", "url": "https://www.bonappetit.com/city-guides/montreal/venue/st-viateur-bagel-shop", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "St-Viateur Bagel Shop Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for classic Montreal-style bagels at one of the city’s most iconic bakeries, St-Viateur Bagel Shop. A quick lesson from Montreal Bagels 101: This bread is chewy and slightly sweet (it’s boiled in honey water!), and it’s almost impossible to eat just one.ORDER: any of the bagels, but you can’t go wrong with the earthy rosemary one or the sesame-poppy seed bagel (it looks like a black and white cookie!). Help yourself to the condiments—butter, cream cheese, smoked salmon, and jelly—at the self-serve area, but don’t expect anyone to slice your bagel in half for a sandwich. These bagels are made for ripping, dipping, and walking as you eat.THE VIBE IS: steamy. The ovens are blasting, so it can get a little toasty inside, but you won’t mind with that intoxicating smell wafting throughout the space. The service can be lukewarm, but at least the bagels are always hot.PRACTICAL STUFF: There are six locations across Quebec, so check the website for specific opening days and time, but the flagship outpost is in Mile End, open 24/7, and located just down the street from Café Olimpico. Pair them together for an ideal simple, cheap breakfast. Heads up: St-Viateur is cash-only.—Alyse WhitneyPhoto by Dominique LafondWE ALSO LOVEBoucherie LawrenceAll the Mile End goods to smuggle back homeDieu du CielChoose your own microbrew adventure in Mile EndCafé OlimpicoGet your caffeine fix at this Mile End espresso shopExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Alyse Whitney"]}