{"id": "35f20b3a13fb397f076896968fcd71ca", "url": "https://www.bonappetit.com/recipe/slow-roasted-bell-peppers", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Slow-Roasted Bell Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueSlow-Roasted Bell PeppersBy Jason HammelApril 17, 20183.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintWe streamlined this recipe to get excellent results in an hour; serve alongside roast chicken or spooned over pan-fried fish or toasted bread.Ingredients4 servings 5yellow, orange, or red bell peppers, halved, seeds and ribs removed6Tbsp. extra-virgin olive oil, divided, plus more for servingJuice of 1 lemon1Tbsp. fig jam1Tbsp. white balsamic vinegar or white wine vinegarKosher salt2Tbsp. oregano leavesPreparationStep 1Heat broiler. Toss peppers with 2 Tbsp. oil on a rimmed baking sheet to coat and arrange cut side down. Broil, rotating baking sheet halfway through, until skin is blackened, 12–14 minutes. Reduce oven temperature to 200° and continue to roast peppers until very soft but not mushy, about 1 hour. Let cool slightly, then scrape off and discard skins. Cut peppers lengthwise into ½\"-wide strips.Step 2Whisk lemon juice, jam, vinegar, and 4 Tbsp. oil in a medium bowl. If fig jam is very coarse, use a fork to mash into smaller pieces; season dressing with salt. Mix in peppers; taste and season well with salt. Toss to coat.Step 3Just before serving, mix in oregano and drizzle generously with more oil.Step 4Do Ahead: Peppers (without oregano) can be made 2 days ahead. Cover; chill.How would you rate Slow-Roasted Bell Peppers?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI would prefer to have a recipe that I can print unencumbered by advertisements.\nTherefore I shall NOT be cooking this.Somewhere you are NOT.9/19/2018I loved this dish. Unctuous yet fresh, and such a lovely combination of flavors. I used O white balsamic (lovely stuff), from California, which is not white, true, but it's light enough in color to not darken the pretty, brightly colored peppers as regular balsamic would. Thanks for sharing this delightful recipe.patressaVirginia8/12/2018Dear Chef Hammel I guess the girl with the figs didn't tell you that WHITE balsamic vinegar does not exist in Italia, the type of grape and the process for making aceto balsamico with the changing of the different types of wooden barrels would only result in a very dark vinegar.  I've never seen nor looked for white balsamic vinegar in Italia I also asked some of my colleagues, they agreed with me. The rest of the recipe was good.pacepuleoMilano Italia5/15/2018Explore Bon AppétitCondimentBell PepperVegetableHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Jason Hammel"]}