{"id": "35ff7344067006d696ae074241318ef3", "url": "https://www.bonappetit.com/recipe/all-day-every-day-sauce", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Everyday Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueAll Day Every Day SauceBy Andy BaraghaniJuly 9, 20193.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOnce you’ve paired this sauce with all sorts of vegetables and proteins, reinvent it. Try adding chopped toasted nuts, minced tender herbs, spices (such as cumin, turmeric, or coriander), and/or finely chopped dried fruit (like raisins, apricots, and/or dates).IngredientsMakes about 1½ cups1½cups plain whole-milk Greek yogurt1Tbsp. fresh lemon juice1tsp. kosher saltPreparationMix yogurt, lemon juice, and salt in a small bowl to combine. Cover and chill until ready to use.How would you rate All Day Every Day Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitSauceYogurtOther IngredientsGluten-FreeNut-FreeVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}