{"id": "35ffec890d86fbe0cb9915465afcc9e6", "url": "https://www.bonappetit.com/story/rachel-brosnahan-winter-strategy", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Rachel Brosnahan's Winter Strategy Involves Bone Broth and Swaddling Her Dogs in Blankets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRachel Brosnahan's Winter Strategy Involves Bone Broth and Swaddling Her Dogs in BlanketsThe 'Marvelous Mrs. Maisel' star's ideal cozy night in: board games, linen pajamas, bath bombs, and turning her dogs into little Babushkas.By Alyse WhitneyDecember 5, 2018FacebookTwitterEmailPhoto by Noam Galai/Getty ImagesFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Up next is Rachel Brosnahan, the Emmy-winning star of The Marvelous Mrs. Maisel. Season two is streaming now on Amazon.On The Marvelous Mrs. Maisel, Midge Maisel shocks everyone in her life by going from a brisket-making housewife to an outspoken, wildly inappropriate standup comedienne. And offscreen, star Rachel Brosnahan has a few surprises up her sleeve, too. Like...a former wrestling career?Looking at Brosnahan, you'd never guess that, back in high school in Highland Park, Illinois, she was on a co-ed wrestling team—and she won against both girls and boys. “A lot of my buddies wrestled in junior high and I always wanted to do it,” she told me before hosting American Express’ Cash Magnet Card holiday dinner at Haven’s Kitchen in NYC. “I auditioned for the musical and didn’t make it, so I was trying to figure out what to do with my time in my freshman year. I loved it and did it again my sophomore year, and then the junior year I had to choose once again between the musical and wrestling. I went for the musical.” We think she made the right decision by choosing acting over wrestling, and the Emmy award sitting in her NYC apartment agrees.These days, Brosnahan prefers spoiling her pups (a Pit Bull named Nikki and a Shiba Inu named Winston) and donning cozy pajamas as opposed to throwing down on the mat. Here's what else she’s into right now.The most Midwestern thing about me is... keeping things close to home. I have more fun spending a Friday night at someone’s house with friends, drinking wine, and playing board games than going out on the town. I love Yahtzee!I’d love to book a trip to... Phuket, Thailand. I have a lot of friends who have traveled there and said it was the most incredible trip they’ve ever taken and so stunning.My dream dinner party guest list would include... Oprah, obviously, and Michelle Obama. She can bring Barack as her plus one. And I’d love to party with Sarah Paulson, Emma Thompson, Melissa McCarthy, Frances McDormand, and Ruth Bader Ginsburg.The last thing I splurged on was... a New York City-themed dog toy package for my dogs. It had a cup of coffee, a doughnut and a MetroCard. I also love spoiling them with new blankets. They love really soft things, so around the holidays, I get them new faux fur ones. They both like to be wrapped up like burritos, as tightly as possible. Like full Babushka.At the end of the day, I unwind by... reading a book in the bath. I love bath bombs, like lavender, citrus, or sometimes even the ones that smell like trees. I always like to read physical books, not on my Kindle, because I like having them to read again or pick up years later.I just finished reading... Sapiens: A Brief History of Humankind by Yuval Noah Harari. It’s basically everything that I wish I had learned in school and more. I gifted it to everyone after we wrapped the second season, and I’m planning on giving it to friends and family for the holidays. My favorite gift to receive is books that other people have loved.I’m listening to... The Tallest Man on Earth. I don’t listen to a ton of music because I’m constantly on the road, and when I’m traveling, it sounds really creepy but I’d rather listen to what’s happening around me and slightly eavesdrop on other people’s conversations. I’m not the type of person who sticks headphones in on the subway.I feel most comfortable in... cozy pajamas. I love my sweater and pants set from Beyond Yoga because they are so, so soft. I also love Sleepy Jones, which makes crisp cotton pajamas. They are totally the opposite, but really comfortable in their own way and great to lounge in.To get ready to sleep, I... do a face mask before bed, especially if I’ve been traveling. I really love the Joanna Vargas Euphoria face mask, Then I get my silky sleep mask all situated to block any light and spray my pillow with a lavender spray. Sometimes when I’m traveling and in a strange bed it can be hard to fall asleep, but that’s the thing that keeps every place feeling like home for me.The one wellness trend I actually believe in is... bone broth. On the first season of Maisel, we worked really long hours and someone made me some bone broth. I was hooked. I was the only member of our cast who didn’t get sick all season, so I swear by the stuff now. When I got a cold recently, I went right to Springbone in New York and got anything that sounded like it would boost my immune system.Explore Bon AppétitPerson of InterestCelebritiesHealthyishInterviewsRead MoreLifestyleNathalie Huerta on Founding The Queer Gym and What Ayahuasca Taught HerBy Melissa Pandika Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Alyse Whitney"]}