{"id": "361b90508322550a653da2b51a5e4087", "url": "https://www.bonappetit.com/recipe/coconut-mango-lime-barfi", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Coconut-Mango-Lime Barfi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueCoconut-Mango-Lime BarfiBy Rachel GurjarFebruary 8, 20223.5(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintOne bowl, no-bake, and make-ahead-friendly? That’s right: This South Asian dessert checks all the boxes. While the world of barfi is vast and varied, we love this mango version because it’s bright and tart, with tang, fruitiness, and a soft chew too. Using canned or frozen mango purée ensures a consistent level of sugar and moisture and means you don’t have to wait for rock-hard fruit to ripen (or mango season to come). Choose the shape that’s pleasing to you: We went for triangles, but it can also be sliced into bars or diamonds or simply rolled into truffles.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8\" Baking Pan$25 At AmazonSilicone Spatula$13 At BA MarketMicroplane Grater$16 At AmazonCan Opener$14 At AmazonIngredientsMakes about 22½cup sweetened condensed milk¼cup plus 2 Tbsp. canned or frozen mango purée½tsp. finely grated lime zest, plus more for serving3Tbsp. fresh lime juice½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt4cups (320 g) unsweetened shredded coconut, plus more for servingPreparationStep 1Line an 8x8\" baking pan with parchment paper, leaving generous overhang on 2 sides. Using a rubber spatula or whisk, mix condensed milk, mango purée, lime juice, salt, and ½ tsp. lime zest in a large bowl until smooth and combined. Add 4 cups (320 g) coconut and mix until all of the coconut is coated.Step 2Scrape coconut mixture into prepared pan and spread evenly all the way to the edges and corners, then use the spatula to flatten. Sprinkle with more lime zest and shredded coconut, then chill in freezer 45 minutes to let set. Cut into triangles with a large knife to serve.Do ahead: Barfi can be made 3 days ahead. Store airtight at room temperature.How would you rate Coconut-Mango-Lime Barfi?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis didn’t work for me. As others mentioned, it never set and was too coconut forward. Won’t make again. MizziBoston, MA3/25/2022Not thrilled with this recipe. Pressed it into an 8x8 inch pan. It's so crumbly like it never set up. Should I have used the really finely shredded desiccated coconut?AnonymousAustin, TX3/18/2022Awesome recipe but with no cardamom powder as an ingredient doesn’t sound exactly authentic. I always associate cardamom with Indian sweets. I’ll try it as a diabetic friendly recipe with evaporated milk and tiger nut flour. I’ll let you know how it turns out.RitzeegalHouston, TX2/28/2022Explore Bon AppétitDessertEasy5 Ingredients or FewerGluten-FreeSouth AsianAsianBar CookieCookieMangoStone FruitFruitCoconutLimeCitrusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Rachel Gurjar"]}