{"id": "362dcdf67fbfad6cbb06002fc44eb2e1", "url": "https://www.bonappetit.com/story/why-fiber-is-important", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Scientists See Fiber As More Important Than Ever Before | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy Scientists See Fiber As More Important Than Ever BeforeFiber used to be the most boring nutrient we eat. Then scientists started looking at our microbes.By Dana NahaiMay 10, 2019FacebookTwitterEmailPhoto by Peden + MunkFacebookTwitterEmailFiber is the sensible shoes of good nutrition: boring, but necessary. For decades it was assumed to be useful simply for bulking up food waste and keeping the digestive tract tidy. Unlike nutrients with sexier reputations, it was never touted for its power to reduce stress, alleviate mental fog, or boost sleep until now.As a dietitian, I’ve been yapping for 20 years about the importance of fiber to help curb unhealthy food cravings, lower cholesterol, and prevent diet-related cancer, but as scientists have begun taking a hard look at human gut microbes, fiber’s reputation has gotten even more of an upgrade.You eat fiber when you eat plants. As the structural backbone of plants, fibers are stubborn carbohydrates that resist digestion and therefore aren’t counted as calories. The fibers that dissolve in liquids are soluble, the ones that don’t are insoluble. Another type, resistant starch, acts like a digestible carbohydrate when cooked and eaten warm but behaves like fiber when cooled. For most people, as long as you’re eating a lot of unprocessed plant food, it doesn’t matter which physical type of fiber you’re getting.Every plant is a combo of fibers tightly interwoven with other nutrients. This organic knitting helps you out first by slowing down how quickly food gets turned into blood sugar, then by ferrying other nutrients to specific destinations along your bowels. And it’s on this journey through the lower digestive tract that fiber’s power gets turbocharged.Getting your fiber from food is critical because the heartier your gut microbe population, the better your overall health.The beneficial bacteria in your gastrointestinal (GI) tract do with fiber what your upper digestive tract can’t: transform indigestible carbohydrates into fuel. A big nutrition reveal of the past few years has come from observing what happens when gut bacteria eat your fiber. By-products made from digesting microbial fiber positively impact health issues as wide ranging as anxiety, depression, insomnia, attention, dementia, type 2 diabetes, and much more. And these new discoveries are changing the way scientists, dietitians, and people in the wellness world are talking about fiber.If you’re thinking you can fertilize your gut bacteria with an over-the-counter fiber supplement instead of natural food, it won’t work. You need to eat a wide variety of plant food to coax your bacteria into working hard. A study published last year evaluated over 10,000 human participants and found that eating more than 30 unique types of plants a week produced the most abundant and diverse gut microbes; participants who ate less than 10 had by far the least. Getting your fiber from food is critical because the heartier your gut microbe population, the better your overall health.But fiber in over-the-counter prebiotics may offer an additional advantage to what you’re getting from food. New supplements called synbiotics pair probiotic microbes with their preferred prebiotic fuel. As noted by Raja Dhir, cofounder of the microbial sciences company that produces Seed, a synbiotic capsule, gut bacteria can biotransform prebiotic fibers into powerful compounds that have a beneficial role for humans. Not all prebiotic fibers are the same, and these supplements should be used in conjunction with a diverse plant-based diet.Some of my clients use drinkable fiber supplements in an attempt to manipulate their bowels, usually for weight loss or constipation. For someone with a healthy GI tract, this can provide short-term success, but long-term improvement in weight management and bathroom habits result from better food and lifestyle choices, not an over-the-counter supplement. When it comes to IBS or other digestive diseases, I use extreme caution when prescribing probiotics and supplemental fibers because they can trigger increased irritation and pain in some people.So how much fiber will cover the needs of your microbes and you? A review of more than 240 international clinical studies published this year summarized that eating 25–29 grams per day was protective, but that eating more than 30 grams seems to offer the greatest benefit. This equals ten 1/2 cup servings a day of vegetables, fruit, whole grains, and/or legumes.As for improving your fiber diversity, eating 30 unique types of plants per week is no small job, even for a dietitian. Stay encouraged: I’ve yet to work with a client who isn’t amazed by how energized they feel after ramping up their plant-based food choices. Organizing a grocery list by category is an effective starting point: Try for ten varieties of vegetables, five fruits, three grains, two legumes, two nuts, two seeds, and two herbs. Focus on progress, not perfection, and your microbes will thank you.Explore Bon AppétitHealthyishHigh FiberessayRead MoreLifestyleWhat’s the Deal with Probiotics and Which Ones Should I Take?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-10", "author": ["Condé Nast", "Dana Nahai"]}