{"id": "362ee8590074edac71fab33892b8beee", "url": "https://www.bonappetit.com/story/types-of-lentils", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "All the Types of Lentils (and What the Hell to Do with Them) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Types of Lentils (and What the Hell to Do with Them)Brown. Red. Black. French. With so many types of lentils to choose from, you need to know what each one is good for.By Alex DelanyJanuary 9, 2018FacebookTwitterEmailFacebookTwitterEmailYou want to make lentil soup. You open up your cabinet. You pull out five half-full bags of five different types of lentils. You scratch your head, wondering if you can substitute brown lentils for red lentils, or if you can mix the dregs of a few bags to get the full one cup you need. Well, that depends. Here's what you need to know.You might think that lentils are beans, and technically, you’d be right. Lentils are members of the legume family, just like chickpeas or pinto beans, but we have a special, separate place for all the different types of lentils in our hearts. Across the board, lentils cook more quickly than beans. That’s why they're weeknight dinner heroes. And since there are so many types, there’s a whole world to explore. Some firmer, some softer, some creamier, some more colorful. Here’s how to use the types of lentils you’ll most likely find at the grocery store.Rice and brown lentils, friends forever.\nYossy ArefiBrown and Green LentilsWhen you think of lentils, these are probably the ones that come to mind. Brown and green lentils are the “everywhere” lentil. When you order generic “lentil soup” at a diner or neighborhood restaurant, you’ll just about certainly be getting these guys, which are bigger than the other kinds and have a flattened lens-like shape. These cook quickly (between 20 and 30 minutes), and tend to split and fall apart when they are cooked through, thickening and lending a mild, earthy flavor to soups and stews—their natural habitat. Use these when you want to lean into that mushiness, not when you want whole, intact lentils for, say, a salad. They also slay in a puréed dip or spread.Lentil, coconut, and tomato soup. With red lentils. Duh.\nAlex LauRed LentilsSome red lentils are red, as you have probably observed. But they also move into the yellow/orange category too. Regardless of the hue, they’re most commonly found in Indian curry dishes like daal. These take about 20 minutes to cook, and when the skin of the red lentil splits, it breaks down quickly, turning mushy. This is exactly what you want when dealing with daal or sauces in need of thickening, and are more or less interchangeable with the brown and green ones. Again, when you want a thick, soothing mush, these will do you fine.French confetti lentils, earning their name.\nALex LauFrench Lentils (aka Lentilles du Puy)We’re all about French lentils, because like the greatest boxers, lawyers, and internet trolls, they’re thick-skinned. This means that these speckled, greenish-bluish-greyish orbs, also called green French lentils or lentilles du Puy, retain their shape when cooked and have a pleasant, poppy texture. This lack of mushiness makes them ideal for non-soup applications. (Though they're great if you want a brothier soup with more distinct textures.) French lentils are perfect for a side dish or salad. Just dress them with oil, vinegar, a bit of crumbly cheese, and some salt and pepper. Maybe a little thinly sliced raw vegetable for texture. Remember though, with thicker skin comes a longer cooking time. These take about 45-50 minutes to cook through, but check on them periodically after 40—you want them a little bit al dente.Spiced black lentils, FTW.\nHirsheimer & HamiltonBlack Beluga LentilsThese are the most flavorful lentils around. Black lentils might not be quite as common as the other varieties, but buy them if you can find them. They’re small, nearly spherical, and can be mistaken for brown lentils with a darker shade of brown. What sets them apart is a thicker skin. Think of these as a hybrid between French and brown lentils, just as good in salads as they are in soups. That means you need to be careful about cooking time though. If you want to use them sans-broth, cook them closer to 30 minutes, at which point they'll retain their shape and texture like their French comrades; cook them for closer to 40 minutes, and they'll start to fall apart like the brown, green, and red ones.Now, red lentil soup. Because whatever else you were thinking about isn't important anymore. Sorry.Explore Bon AppétitBasicallyLentilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Alex Delany"]}