{"id": "362f6207bc537bb87295cd11b4d3e627", "url": "https://www.bonappetit.com/story/no-fryer-crispy-shrimp", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Crispy Shrimp, No Deep-Fryer in Sight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCrispy Shrimp, No Deep-Fryer in SightWith this method, I can get golden, crackly shrimp without gloopy batter or a giant bucket of oil.By Joy ChoJuly 13, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Kat BoytsovaFacebookTwitterEmailWhen I used to imagine “crispy shrimp,” a basket of fried seafood eaten beachside or shrimp tempura is what came to mind. Delicious, to be sure, but I couldn't help but also picture heavy, gloopy batter and a gigantic pot of bubbling oil—which is why I’d mentally filed the treat under “things I enjoy but definitely won’t be cooking at home.”But what if I told you that you could get a similar result—golden, crispy shrimp—without deep-frying it? Well, you absolutely can, and it only requires one pantry ingredient (cornstarch) and a few minutes in a (hot) pan. Yep, you heard that right!Using cornstarch to coat and fry foods is not a novel idea, but I never really believed in the technique’s efficacy until I tried my mom’s pan-fried shrimp which were, amazingly, crispy. Her method, similar to others, is simple and straightforward. All you have to do is give seasoned shrimp an even and thorough dredge in cornstarch, then cook them in a hot pan with just enough oil until the shrimp turns golden brown, flipping them halfway through. The result is shrimp with a crackly, barely-there coating and none of the hassle and mess associated with deep-frying.As uncomplicated as the overall technique is, each step is important to follow for best (read: light and crispy) results. While you’re not deep-frying, you can’t skimp on the oil, otherwise the cornstarch coating sticks to the pan. And if the oil isn’t shimmering-hot, the shrimp won’t cook properly. (I learned both the hard way, unfortunately.) But once I learned to avoid these pitfalls, I never looked back.I can’t get enough of these simple-but-satisfying shrimp. They’re a delicious addition to any manner of weeknight recipes, but paired with a zippy red cabbage slaw, toothsome farro, and a creamy, gochujang-spiked mayo—as they are in this recipe—they might as well be summer in a bowl. Now that I’ve got this technique down, I’m happy to report that crispy shrimp is something I both enjoy and cook at home. Armed with a bit of cornstarch and my trusty frying pan, I have everything I need.Get the Recipe:Crispy Pan-Fried Shrimp With Cabbage Slaw and Gochujang MayoAll the pleasures of fried shrimp without the hassles of deep-frying? Count us in.  View RecipeExplore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-13", "author": ["Condé Nast", "Joy Cho"]}