{"id": "3652ff8eb61c0f190dc6534140ac516d", "url": "https://www.bonappetit.com/story/what-is-a-ham-hock", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Ham Hocks Are My Secret Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHam Hocks Are My Secret IngredientSalty, smoky, fatty, and always in my freezer. By Carla Lalli MusicOctober 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina Boytsova FacebookTwitterEmailOn the list of cured pork products you should definitely have in your freezer at all times, ham hock is my Number One.Other people might advise that you keep slab bacon, pancetta, or guanciale on hand, and while those things are great enhancements, ham hocks are a quadruple threat: They’re smoky, they’re collagen-rich, they’re salty, and they’re inexpensive. (And porky. But that's a given, right?)Okay, but what is a ham hock? Cut from the bottom half of the pork leg, it’s a chunky, 4-inch section of bone surrounded by collagen, connective tissue, and some meat, all encased in a thick band of fat and skin. Hocks are typically cured with salt and smoked, so they’ll lend a bacony flavor to whatever you add them to. Ham hocks are usually sold in pairs that are pre-weighed and stocked in the butcher case with the other pre-packaged items. And they won’t set you back, price-wise, either (they’re typically less than $3 a pound).Unlike bacon or pancetta, hocks are not especially meaty, which is why they’re a great addition to long-cooked things—soups, of course, but also pots of beans, braised greens, and beef or poultry stocks. They need all of that time to get nice and tender. When ham hocks cook in a liquidy environment for a long time, the collagen and fat slowly dissolve, infusing their surroundings with richness, saltiness, and smokiness. You won’t necessarily want to eat whatever fatty bits are still clinging on at the end of cooking, but you can easily pull all of that off to unearth the few pockets of actual meat tucked against the bone. Shred or dice the meat up and add it back to whatever you’ve cooked.What if you’re a vegetarian and still want to make a soup or stew that contains a ham hock? Just omit it and add another few tablespoons of extra-virgin olive oil to whatever you’re simmering to make up for the renderings, and be sure to check for seasoning, too, since you’ll be missing out on some salt. My hammy chickpea soup is seasoned only once with a measured amount of kosher salt at the beginning of the cook time because the hock rounds things out nicely. As it melts, the collagen in the hock also adds body to the soup; if you are omitting it, you might want to simmer for an additional 15 minutes or until the liquid is a little thicker.You only need one ham hock for most recipes, but since they’re sold in two-packs, you’ll always have an extra one on hand. Pop it into the freezer for another lazy soup-and-stew Sunday. They’re the ultimate humble brag.Get the recipe:Hammy Chickpea SoupName a better activity for an autumnal, sweater-weather Sunday than simmering a cozy soup. (Oh, and apple-picking doesn't count.)View RecipeExplore Bon AppétitHamPorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-10", "author": ["Condé Nast", "Carla Lalli Music"]}