{"id": "3659ba98464e18f2d2df89fd8fbc7838", "url": "https://www.bonappetit.com/story/making-perfect-thanksgiving-stuffing", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "The Perfect Thanksgiving Stuffing: There Will Be Corn Nuts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perfect Thanksgiving Stuffing: There Will Be Corn NutsThe cornbread base is oomphed up with corn nut magic dust for an extra hit of funky corn flavor. By Alex BeggsOctober 30, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how the Cornbread Stuffing With Sausage and Corn Nuts came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamRick Martinez and Chris MoroccoThe ChallengeStuffing can go one of two routes: white bread (in Chris’s family) or cornbread (in Rick’s). Which one reigns supreme?The SolutionRick’s dad flew in from Texas to show us how to make their cornbread stuffing—and it won. “Cornbread is scaffolding to which you can direct a ziggurat of flavor,” Chris said, to which we replied: “Wow, okay.” The sweetness of the cornbread complements and accentuates the sausage, celery, onion, and herbs, while the addition of corn nut magic dust makes for an extra hit of corn flavor. There are distinct bites of toasted bread on top and an almost-but-not-quite-custardy interior.Watch Rick and Chris try to make the perfect stuffing.\nThe Case for Homemade CornbreadWhile you can absolutely use store-bought, we prefer to make our own cornbread. Why? Well, we have some control issues. Homemade means you get to choose the ratio of cornmeal to flour (we keep it 50:50 for flavor and sturdiness, though cornmeal superfan Rick goes as far as 70:30), adjust the sweetness, and add buttermilk for tang and tenderness. Last year Molly developed a recipe for cornbread specifically intended for stuffing. How convenient! Some stuffing recipes call for stale bread, but we prefer to toast our cornbread low and slow in the oven so it gets crunchy browned edges and a nice roasty flavor.Extreme Amounts of ButterThere’s a cup of butter in this baby. Two sticks. “This is the most butter we’ve put in a stuffing, ever,” Chris said. Call it Rick Martinez Maximalism, but it’s the crucial source of richness, and because the cornbread is absorbent it won’t feel like too much. “We took it to the point of greasiness,” Chris said, “and then we backed off, for respectability.”More Is MoreWe crammed in as much sausage, stock, and aromatics as we could fit— the cornbread can take it. If the stock pools in the dish when you pour it in, don’t panic: It gets soaked up in no time.Bring the HeatTwo Thai chiles (or one Serrano), give the stuffing a fleeting fire that will either slow you from eating the entire casserole’s worth—or only encourage it.Earthy, funky, wonderful corniness.\nPhoto by Alex LauWe’re Cuckoo for Corn NutsCorn nuts (the bagged ones, yes!) make the cornbread taste “like a better version of itself,” quoth Chris. But they serve another purpose too, Rick pointed out, which is that store-bought cornbread can vary dramatically in terms of sweetness and corniness, depending on where you live. Cooking the pulverized Corn Nuts in butter “blooms” them like spices, bringing out their earthy, funky, wonderful corniness.“We used the original flavor,” Chris said, and then his eyes grew wide as he realized, “but what if... you used Ranch?” We’ll leave that fate in your hands.And With Those Leftovers...Make this crazy stuffing fried rice with smoky Mexican chile crisp (ancho, guajillo, and arbol chiles), allspice, garlic, shallot, and a touch of agave. Oh and soy sauce and Thai chiles and jalapeños. “It shouldn’t work but it does,” said Rick, “It’s amazing.”Get the recipe:Cornbread Stuffing With Sausage and Corn NutsSweet, spicy, sausage-y cornbread stuffing with corn nut magic dust for an extra hit of corn flavor.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeExplore Bon AppétitThanksgivingStuffingMaking Perfect: ThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-30", "author": ["Condé Nast", "Alex Beggs"]}