{"id": "365dea18d55c95a3b7db5d74ef914739", "url": "https://www.bonappetit.com/story/prunes-feud", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "More Prunes! More Prunes! More Prunes! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMore Prunes! More Prunes! More Prunes!A case for juicy, sweet plums in everything you’re braising this fall.By Alex BeggsOctober 26, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Simon AndrewsFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When tortilla chips imitate leavesTrader Joe’s Extreme Fall lineup is here! “Are you already sick of all the pumpkin stuff?” I asked a cashier. “No,” she said, “it reminds me that things change.” Which, whoa. So let the pumpkin spice literally seep into your skin with a seasonal face mask, shovel maple ice cream into your mouth, and accept the fact that things are moving forward, whether you like it or not.For more tricks and treats: Trader Joe’s new fall stuff, reviewedWant this letter before it hits the website? Sign up for our newsletter!Hardy KiwisRachel Karten picked up some Hardy Kiwis at the farmers’ market and we gathered ‘round to taste the invasive but cute mini fruit. They were the size of grape tomatoes with taut brown skin. Inside, they looked like kiwis but tasted sweet and sour. Like regular-sized kiwis, they left a tickly feeling on my tongue. According to my Google results for “kiwi makes mouth feel weird” this is an allergic reaction. Another Hardy Kiwi fact: “Some people find they have a strong laxative effect.” (Got that from a brief from Cornell University on “Minor Fruits.”) Kiwi, kiwi, the minor fruit, the more you eat, the more you…Photo by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiAbout the potatoesCarla Lalli Music scrolled through her phone next to me, huffing and puffing as she read angry YouTube comments deeming her and Molly’s perfect velvety mashed potatoes...too watery. “There’s not even water in it!” she exclaimed. In the video, the potatoes look looser than they were IRL, and they’re marvelous, because I’ve tasted them. But YouTube commenters can’t taste through the screen. “Ugh, ‘potato soup’? Everybody shut up!” said Carla, shaking her head. “Telling me how you do it in Ireland is besides the point!” Exasperation. “Everyone is wrong!” More scrolling. Until she lifts her head up and tells me: “There will be no apology video.” Stay strong, Carla.Watch it: Molly and Carla Make the Perfect Mashed Potatoes & GravyLearn why we’re using German Butterballs this year and spiking the gravy with MSG.Photo by Michael Graydon and Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiSome things are fancyAlison Roman’s new cookbook, Nothing Fancy, came out this week and we have a whole menu for the chillest possible steak night party you could possibly host. The rib roast is rubbed with an anchovy-garlic-rosemary mixture—!!!! The creamed greens are spiked with crème fraîche! Martinis are big-batched! If this is all starting to sound too fancy for you, I talked to Alison* and she said it was okay to cook everything in your Lady’s Fun Wear bikini t-shirt.Get the recipes: Alison Roman’s Steakhouse Night at HomeListen to an interview with Alison on the BA foodcast.*No, no I did not.Photo by Laura Murray, food styling by Kat BoytsovaDrink the latteSpeaking of pumpkin spice and everything nice, Dappled author and pastry chef Nicole Rucker wrote about her love and appreciation for the PSL this week. “How many ridiculous drinks I can order without feeling the shame of false purism?” she asks in a moment of existential crisis at the airport. The answer, to me, is AS MANY AS YOU WANT. Within the constraints of your blood sugar level, that is. Within the office we call this your “diva coffee order” (DCO). Despite being called “diva” I want you to know this is a gender neutral designation. It’s like your astrological sign, but with complicated coffee shop orders that make you feel like Marie Antoinette. A large dirty iced almond chai, for example, is one unnamed BA staffer’s. I’m a PSL with an extra shot of espresso, no whipped cream. Who are you?Overheard in the BA officeA long and sustained whisper: “Wegmanssssssssss.”Haha“Regular wines require you to memorize pretentious, insider-y terms, like ‘terroir’ and ‘mouthfeel,’ and pretend that you can taste leather, granite, and even barnyard in the drink. Natural wines require you to do the exact same thing, but on Instagram, so it’s O.K.”From The New Yorker: What You Need to Know About Natural WinePhoto by Chelsie Craig, food styling by Alison AttenboroughHappy DiwaliPriya Krishna is making Shahi toast, a.k.a. no-bake cardamom bread pudding, for Diwali before she flies from Dallas to New York to be the special guest at a standup show at Union Hall on Sunday with comedians including Aparna Nancherla and Hari Kondabolu, some of who will be bringing Indian dishes. “I hope I don’t accidentally insult anyone’s grandmother’s chole recipe!” she said. Find out if she does by showing up!Get the recipe: Cardamom Bread PuddingUnnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Laura Murray, food styling by Kat BoytsovaSohla El-Waylly’s Chicken Thigh Biryani is here just in time for weekend cooking. Every time we tested it I kept chanting: “Prunes! Prunes! Prunes!” And yet the recipe calls for “dried fruit, such as prunes….” Which is fine. But you should use prunes. “I want people to use prunes,” said Sohla. They get plump and juicy in the oven, it’s heaven. Why so divisive?“They’re the worst of all dried fruit!” exclaimed tart cherry champion Aliza Abarbanel. “Disgussssstingggggggg,” Ryan Walker hissed. “They’re concentrated sugar,” said Andy Baraghani. “I don’t like anything dark and shrively,” groaned Emma Wartzman. “It’s a big raisin, right?” said a confused Christa Guerra. “Imagine all of the other fruits you can eat instead of a prune,” said Alex Delany while opening a can of dolmas at 10:57 a.m. “I don’t like anything that reminds me I’m aging,” said existential Walter Green.The pro-pruners were ready to fight. Just look at Chris Morrocco: “I fucking LOOOOOOVE a prune,” he said so passionately he threw a ball of wax paper and croissant crumbs across his cooking station. “Super soft jammy fruits, sun-kissed whatever-they-are,” he continued, “I celebrate the plums in all of their splendor; I celebrate prunes, as a logical extension of the glory of plums.” Wow.Rapo likes them in Pork Marbella.Chris Cristiano likes them stuffed with mascarpone at Frankie’s in Brooklyn.Amanda Shapiro likes them “when you need them.”Hilary Cadigan likes them “in a bag with other dried fruits.”You’ll like them in Chicken Thigh Biryani.Explore Bon AppétitBeggs NewsletterRead MorecookingNot My Amu’s Chicken Thigh BiryaniBy Sohla El-WayllycultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggscultureI Was a Competitive Barista, But I Love a Pumpkin Spice LatteBy Nicole RuckercookingSteak and Potatoes Night in AmericaBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-26", "author": ["Condé Nast", "Alex Beggs"]}