{"id": "36621620c919865ae59f9032a0205ed0", "url": "https://www.bonappetit.com/story/butter-basted-mushrooms", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Week at BA: Butter-Basted Mushrooms and Cookie Feuds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Week at BA: Butter-Basted Mushrooms and Cookie FeudsSenior editor Alex Beggs also discusses an eerily empty office and an NYC restaurant closing in her weekly newsletter.By Alex BeggsSeptember 22, 2018FacebookTwitterEmailNicole FranzenFacebookTwitterEmailEvery Friday morning, Bon Appétit senior editor Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cook mushrooms like steak“‘Tis the season!” I declared, pulling a long-forgotten basket from a drawer in my desk. “PEPPERMINT BARK?” screeched Basically editor Amiel Stanek, rushing around the corner to see what it was. Sorry, Amiel. It was the Halloween-candy sized stash of Emergen-C packets I still have from my very official taste-test. Everyone’s been sniffling and sneezing, so it was time to hit the powder.Want this letter before it hits the website? Sign up for our newsletter!It’s also the season for butter-basted mushrooms In the farmers’ market equivalent of a late-night ASOS shopping spree, I spent way too much money on some impulse mushrooms. The most expensive, hen of the woods aka maitake, are also the most delicious, in my humble opinion. The ONLY recipe I go to now is this one, where you treat the mushrooms like steak, basting them with rosemary (or thyme) browned butter until they’re tender, crispy, and divine.Photo by Emma FishmanWhere is everybody?The office was eerily quiet. Last weekend, a handful of BA staffers were in Portland for Feast, and here’s what my eyes and ears on the ground reported back. Editor in chief Adam Rapoport, who was caught drinking prosecco on ice, told deputy editor Julia Kramer that all staff were required to run the Healthyish 5k-ish, “And he made me run alongside him, making small talk, the *entire time,” she said. There was a field trip to a dispensary that looked like a Parisian jewelry store, where one editor picked up some CBD bath salts for his wife. At dinner at Kachka, herring under a fur coat and too many vodka shots were had. Brad was recognized by strangers everywhere he went (“I have so many friends here!” he told associate editor Christina Chaey). People transported via electric scooters. Amiel wore a lilac suit. The Turkey and the Wolf team brought their own McDonald’s plateware and a 12-pack of Pabst. I guess you just had to be there!Farewell, restaurantNew York readers might have heard that Café Loup closed this week for alleged tax evasion, which is a pretty gangster way to go for an old school spot like that, so I accept this news with a grief and understanding. A few semesters ago, I took a continuing education writing workshop at the New School (never stop learning!), and every Friday after class, I’d meet a friend there for an icy martini—and sidecar—with fries. Everything else on the menu was terrible. It would be 6 p.m., the place mostly empty, and the maitre’d would look at me with disgust and say there were no tables. And then he’d relent, fine, a little spot near the bar, if you must. (I guess I didn’t look enough like Christopher Hitchens.) So farewell, Loup! May you rest in peace in restaurant heaven, where I imagine Florent lives on, 24/7 in our hearts.Twizzle de dooWatch Claire make gourmet Twizzlers here!The way the Christmas cookie crumblesDespite the lack of peppermint bark tins, we did have three weeks of Christmas cookie testing at the end of the summer. During those three weeks, we filmed a handful of videos–like Molly Baz’s scallops—and in the background, Chris Morocco has his headphones in, blasting the electronica band Timecop1983. “I really needed to go to a different place,” Chris told me about the struggle to think holly-jolly when it’s 90 degrees out. “I needed ambient soundwaves, no singing, none of Brad’s Neil Young, which honestly is how I feel year-’round, but that’s another thing.” I’ll let the Neil Young comment slide. “I thought he was listening to some dorky dad music,” Molly said, “but it’s like, the vibiest music ever.” This was Chris’ first year on Christmas cookie duty for the magazine, which is a big deal in our neck of the woods. “He did a fine job,” said Brad “not really a cookie guy” Leone. “The linzer sandwich thing was dynamite. With a cup of coffee, Beggs, forgettaboutit.” I’m a fan of Chris’ sparkly snickerdoodle 2.0—just wait til you see it (December issue!).Tara DonneUnnecessary food feud of the weekAll this cookie talk, and a meeting on the theme of the word “crunchy,” got people arguing about what’s better: a soft and chewy chocolate chip cookie, or a crispy one? Video editor Misa Spencer is team Soft ‘n’ Chewy: “I never understood why people liked crispy packaged cookies—they make my mouth dry and sad,” she told me, adding that her mom, apparently a canonized saint, would time her batches of chocolate chip cookies so that they’d come out of the oven right before Misa got home from school. “Crispy cookies belong in icebox cakes and cookie cereal,” said contributor and big ol’ softie Sarah Jampel. Christina Chaey posted an image of Pepperidge Farm’s Sausalito cookies, her favorite of the chewy variety, to which Chris replied: “stop posting things just to upset me.” Others felt a truly perfect cookie is both crispy on the exterior, but soft within. (That answer is a cop-out). But I agree with digital director Carey Polis: “Sometimes you have cookie emergencies and that’s when Tate’s is really there for you.”Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-22", "author": ["Condé Nast", "Alex Beggs"]}