{"id": "3686376602bc364fa0bf32c71e2a2890", "url": "https://www.bonappetit.com/story/just-buy-it-fine-mesh-strainer", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "A Fine Mesh Strainer Made All My Grain Bowls Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Fine Mesh Strainer Made All My Grain Bowls BetterI didn't know how badly I needed one. But now I don't know how I ever lived without my precious fine mesh strainer.By Aliza AbarbanelAugust 17, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAs much as it pains me to admit it, I’m not MacGyver. But I am stubborn and resourceful, which is a dangerous combination in the kitchen. I’ve been known to improvise and attempt feats that frankly shouldn’t be attempted—namely this entire past year, in which I tried over and over again to drain things without a fine mesh strainer.This might sound like a minor infraction. But honestly, my cooking suffered. My grain bowls were soggy. My homemade stock was full of sediment, like the bottom of a bottle of natural wine. I wasted a year trying to cleverly dry quinoa by placing paper towels over a colander! Spoiler alert: I wasn't being clever.If my editors are reading this right now, please don’t fire me. I knew what I was doing was wrong! I was just too stubborn (and, okay, too cheap) to do anything about it.But once I finally caved and dropped a (very reasonable) $10 on a set of three mesh strainers, I realized that there’s a big difference between being stubborn and being right.  The 4.72-inch (very precise!) sieve strained the pulp from my salted watermelon juice with zero splashes, and helped me squeeze out every precious drop of watermelon goodness. The 7-inch strainer drains big batch grains easily, ideal for someone like me who makes grain bowls more than any other meal. The majority of my baking experience remains the times when I binge watch The Great British Baking Show when I can’t fall asleep, but I know these will come in handy when I work up my nerve an attempt a crepe cake.Goodbye soggy grain bowls!\nI'll admit that fine mesh strainers are annoying to clean, but these pro-level tips from the BA test kitchen ease the pain. And the results speak for themselves. My broccoli quinoa salad is fluffier than a baby alpaca (you’re welcome for that image), and a few quarts of cooked—and perfectly-drained!—grains have become a meal prep staple I can really be proud of. Most importantly, I’m not spending my Tuesday nights trying to keep tiny quinoa from falling through big colander holes. Nobody should.Just Buy It: Ipow Stainless Steel Fine Mesh Strainer, set of 3, $10 on Amazon.And make a grain bowl to celebrate:Pesto-y Roasted Vegetables Make Rent Week BearableThe dinner you need when your wallet is empty and your crisper is half-full.View StoryAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCooking TipsBasicallyCommon MistakesShoppingRead MorecookingThese Metal Nesting Bowls Are a Kitchen Prep LifesaverBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-17", "author": ["Condé Nast", "Aliza Abarbanel"]}