{"id": "368f0819aba2a1acc75279303835cee3", "url": "https://www.bonappetit.com/story/piquette", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "Piquette Is White Claw for Wine Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhite Claw for Wine LoversSparkling, low ABV piquette is made for lazy summer sippingBy Marissa A. RossJuly 27, 2020FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailWhen it comes to day drinking, I’m all about “maintaining,” which is simple, at least in theory: The goal is to maintain a nice buzz rather than getting hammered and waking up the next day feeling like you ate a burrito filled with regret (spoiler: YA PROBABLY DID). But maintaining is not as easy in practice, especially when you’re drinking 14 percent ABV wines in the sweaty backyard happy hours of late summer. This is where piquette comes in.Piquette is basically White Claw for wine lovers: low ABV, high drinkability. It’s made by adding water to grape pomace—the solids left over after grapes are pressed for wine—and fermenting it into a deliciously sparkling bev that clocks in between 5 and 9 percent. While piquette’s flavors vary depending on the grape variety, it always tickles your nose with fresh fruit and pricks your palate with salty effervescence that begs for a second round. It goes down as quick as your favorite flavor of La Croix but with the bright acid and soft tannin textures of your favorite pétillant-naturel.Also piquette is much more than a fad. Spiked seltzer is a fad; ancient Romans were not messing with spiked seltzer, but they did mess with piquette. It has been made for centuries across the globe as a way to use grape pomace that would otherwise be thrown out. It’s less wasteful than chucking the stuff and it gives winemakers another source of revenue.But as I was saying, piquette is [chef’s kiss] perfect for maintaining. You may beat your friends at bocce while throwing back two cups of chilled Merlot, but you’re probably not making it to dinner. Piquette is different. It won’t leave you with a burrito-size hangover...or any other regrets.3 Bottles We Love:The standard-setter from New York’s Hudson Valley: Wild Arc Farm Traminette, $15 (pictured above)Gamay fans will love these prickly bubbles from Beaujolais: Domaine des Grottes, $21 You know it’s from California thanks to the citrus notes: Monte Rio Cellars, $22 Explore Bon AppétitHealthyishUnfiltered Summernatural wineWineessayRead MoreLifestyleIt Didn't Feel Like Summer Until I Drank This WineBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-27", "author": ["Condé Nast", "Marissa A. Ross"]}