{"id": "3694b268161f215420bbee81484150f6", "url": "https://www.bonappetit.com/story/nail-polish", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Yes, You Can Work in the Restaurant Industry and Have Cute Nails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingYes, You Can Work in the Restaurant Industry and Have Cute NailsManicures have long been frowned upon in food service, but as gels and chip-resistant polish become commonplace, chefs and food workers are finding power in the paint.By Tiffany Hopkins and Jenna Adrian-DiazAugust 16, 2021FacebookTwitterEmailIllustration by Elena XausaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My nails are currently long, tapered, and the color of a yellow highlighter. Last week they were covered in a pearly white lacquer. I’ve loved doing my nails since I was a teen. But the decade I spent working front of house at fine dining restaurants, casual brunch spots, and specialty bars taught me that food service and manicures don’t mix. While there are completely legit sanitary reasons for food handlers to keep their fingernails short and polish-free, I couldn’t help but feel like the reasons my employers disapproved of my glimmery fingernails often had nothing to do with hygiene.There are unspoken standards in many industries that suggest that brightly colored nails are unprofessional; acrylics mean you’re not ready to work; and a bejeweled manicure implies that you are somehow frivolous and unserious. In the bar and restaurant industry, where female chefs receive fewer accolades and less media attention than their male counterparts and as many as 90% of female restaurant workers experience sexual harassment, “high femme” is often seen as incongruous with “serious chef.”With ever-evolving nail polish technology—hello, chip-resistant gel—and also gloves, which exist, it’s high time to reexamine our ideas about professionalism in hospitality. We spoke to some of our favorite chefs, bartenders, and bakers about the power they find in taking care of their nails and the polishes they love the most. For them—and for me—getting a manicure isn’t just a form of artistic expression. It’s a way to practice self care in an industry that demands so much of its workers. —Tiffany HopkinsTiffanie Barriere, mixologist and drinks educator, The Drinking CoachInstagram contentThis content can also be viewed on the site it originates from.I do my nails because I’m basically a hand model. Every time I place that drink down, people are looking at my hands—especially in this digital, photographic, Instagram-centered world we live in. Holding a glass with colorful nails just looks really pretty. With all of the work and washing that my hands endure, I love a picture-perfect manicure.I don’t have hair and I don’t wear makeup and my jewelry is simple, but my nails are always done. They’re a part of my presentation, part of who I am. I grew up that way. My grandmother would take us to get our nails done on our birthdays—she did it for me and all of my cousins, all 19 of us. It was like before you see granny, no matter what else you do, your nails have to be done.I remember years ago if my bosses even allowed us to wear nail polish, they’d still have rules about the colors we could wear. That was so annoying. I love lavender. Lavender lavender lavender! Or an apricot or peach—it’s gotta be nice and light. White also makes me very happy. I’m an OPI girl and always have been, and there’s no changing it. My favorite part of a manicure is at the end when Nancy, my nail tech, applies the tea tree oil to my cuticles, and we both look down and smile because my nails just look so good.Photo courtesy of TargetOPI Do You Lilac It?$10 at Bed Bath & Beyond$10 at TargetJessica Quinn, pastry chef and cocreator of Dacha 46Instagram contentThis content can also be viewed on the site it originates from.I’ve worked in kitchens for 12 years, and “no nail polish” has always been one of the cardinal rules. So as much as I loved getting manis and pedis, I resigned myself to the fact that it wasn’t going to be a part of my life working in kitchens. Then this last year my wife Trina and I started our own pop-up and I decided that I was bringing my manicures back.I always prided myself on being a serious chef, and there’s an assumption that if you’re a serious chef, you don’t get your nails done. Busted nails gave you street cred. Then I realized how ridiculous that was. I saw a meme recently that said, “The new model for being a serious chef is to be well-fed, well-slept, and well-hydrated.” I love that. Not taking care of yourself used to be applauded in the food industry, like it meant that you were so dedicated to your craft that looking after yourself took the back seat. Now, instead of being proud of working all those doubles and feeling and looking tired, I hope the new thing is to feel good about glowing and getting enough sleep.When you’re working in kitchens all the time, you’re hot. You’re sweaty. You’re gross. You’re usually covered in food. Looking down at my nails and having a fresh manicure makes me feel fantastic. I love wearing bold colors like hot pink or a bright, in-your-face red. I wear gloves when handling food; I am a serious chef, after all. I take pride in my craft and the food that I make, and I also take pride in my appearance.essie A List$9 $7 at AmazonTara Thomas, chef and cofounder of nonprofit Breaking Bread NYCInstagram contentThis content can also be viewed on the site it originates from.In middle school my dad started taking me to the nail salon with him because he likes getting his nails done. It was something that we did on weekends or after school on a Friday. I’ve loved doing my nails ever since. It’s a form of meditation—no devices, just being present with myself and whoever else is in the room.The food industry is very anti-nails. But I don't really fit into the typical spaces that we find in the industry. Prior to the pandemic I was doing a lot of event production, but I burned out from that and found it hard to be inspired. I've been investing my time in the nonprofit I cofounded called Breaking Bread, which distributes food to vulnerable communities, and my community garden. I like to do my nails myself because if my manicure chips while I’m working in the garden, I can just throw on another coat.I love J. Hannah nail polishes. The colors feel natural and earthy and familiar. I really like the shades Patina, Miso, and Dune. Here in New York, nail art is kind of a scene. A lot of my friends who like to get their nails done are unapologetic about it, regardless of their jobs. It’s a form of self-expression.Photo courtesy of J.Hannah JewelryJ. Hanna Patina$19 at J. HannahDan Pelosi, food and lifestyle creator, GrossyPelosiInstagram contentThis content can also be viewed on the site it originates from.I wear nail polish to talk about what masculinity means. My identity is colorful, it's joyful, it's positive. Doing my nails is an extension of that, and also, because I photograph my hands so much, it’s such a great way to add to the story.In my videos, sometimes I match my nail polish to the cookware or different ingredients in the dish. For one video where I made an Italian sponge cake with berries, I did my nails in this purple hue that was reminiscent of my apron and my hat as well as the berries. A harmonious color story! People pick up on it, which I love.See My Toes is a brand started by a friend of mine who lives in Portland, Oregon. They have really great colors, and it's vegan and cruelty free. We collaborated on a color called Lost in the Sawce, after my vodka sauce recipe. You know the sauce is done when its color matches your fingernails. We did a really limited run, only like 100 bottles or something like that, and it sold out in a weekend.Photo courtesy of See My ToesSee My Toes Wanderlust$18 at CommunionLena Sareini, pastry chef and James Beard Award semifinalistInstagram contentThis content can also be viewed on the site it originates from.Having a fresh manicure makes me feel like a bad bitch! Before I started culinary school, I always had my nails done. My sister was really into nail art, and she would give me fun designs. But after I started working in restaurants, my relationship with nail polish really depended on whether my employer allowed it or not, and when they didn’t, it was devastating. I get it—nail polish can chip and get into the food you’re working with. But shellac exists, and it’s basically chip-resistant and lasts a long time, so I wear that.And now that I’m no longer working at a restaurant—I’m just doing the freelance thing with my own pop-ups—I have my nails done all the time, and I love it. I like to wear rings and jewelry, and polished nails really make the whole look come together. There’s also something to be said about going to the salon, too. I do mental health, self-care days when I get a mani, pedi, and a massage. It’s important.Currently, I’m really into doing a clear coat of polish with dried flower petals or gold leaves underneath—that’s actually what I’m wearing right now. I also love to do a different color on each nail, then on my ring finger, I’ll take a ballpoint pen, dip it into nail polish and use it to draw a little flower onto my nail. It’s a super easy trick for doing your own flower designs. I don’t have a favorite nail polish brand, I usually just go by color. I love glitter nail polish—glitter everything!Photo courtesy of Targetessie Summit of Style$9 at Bed Bath & Beyond$9 at TargetHetal Vasada, baker and author of Milk and CardamomInstagram contentThis content can also be viewed on the site it originates from.Nail art is an expression of my creativity, but when I started working in commercial kitchens, they were very much like “don’t wear nail polish.” So there would be this cycle—I’d do my stage, then go get my nails done right after I finished. I’d get to keep it for about a week before my next stage, when I’d take my polish off and begin the cycle again.I’m a baker, and I have baker hands. My fingers are wrinkly and rough from washing dishes and being in hot water. New manicures make me feel fresh, neat, and clean. I do a lot of hands-and-pans videos on Instagram, and I want my hands to look nice. Even when I’m not wearing makeup on my face, I can still hold the food I made, take a picture, and feel a sense of glam.One of my favorite nail artists is Bonnie C. of Skin, Body, Zen in the San Francisco area. Right now, I’m obsessed with short, almond-shaped nails with really abstract art. My designs are always inspired by the season and my mood. In summer, I usually go with bright neon colors, and in fall, I like to do eggplant purples and deep sage-colored greens. My favorite nail product has to be Scratch Nail Wraps by Nina Nailed It. They’re amazing! She has so many cool designs, and they’re easy to use and last forever.Photo courtesy of UltaScratch Lemon Zest Nail Wraps$10 at UltaExplore Bon AppétitShoppingRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-16", "author": ["Condé Nast", "Tiffany Hopkins", "Jenna Adrian-Diaz"]}