{"id": "36a34e7c199161fd050b438e7684256c", "url": "https://www.bonappetit.com/story/pudding-chips", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "I Made BA’s Best Banana Bread and It Was Indeed the Best | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Made BA’s Best Banana Bread and It Was Indeed the BestA good recipe, some weird food news, and more from the Beggs newsletter.By Alex BeggsJanuary 25, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Something to cookI made BA’s Best Banana Bread last weekend and it lived up to its name. I only had three overripe bananas, swapped ¼ cup of AP flour with almond flour for fun, and made it into muffins (so cut the cook time in half). They turned out so moist and banana-y! Would make again!Get the recipe: BA’s Best Banana BreadA look that says “what have you done with that frosting sir”Gourmet Makes star Claire Saffitz was on The Tonight Show Starring Jimmy Fallon this week, decorating a layer cake and attempting to teach Jimmy Fallon how to do the same. My takeaway: Claire is so patient and charming, just like real life! I need a spin-y cake stand! Why do they use SO MANY SPATULAS?Watch it here!Photo by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaWant this letter before it hits the website? Sign up for our newsletter!In a noodle moodHappy Year of the Rat! When Lisa Cheng Smith was in the Bon Appétit Test Kitchen making the recipes for this Lunar New Year menu, I went back for bowl after bowl of the scallion-oil noodles. The scallion flavor is so deep and caramelized—nothing like that sharpness you get when they’re sliced raw and on top of stuff—because they’re sautéed in oil for nearly 30 minutes!!!Get the recipe: Scallion-Oil NoodlesAnd on the occasion of the Lunar New Year, BA contributor MacKenzie Fegan wrote a great piece for the San Francisco Chronicle about her family’s Chinese restaurants in the area, Henry’s Hunan. It’s a story about the country’s first Chinese restaurants, the struggles of sustaining family-run businesses, and the physical toll that restaurant work requires of the human body. I loved this quote from Meng Tao, MacKenzie’s mother’s half-sister, who still shows up to wash dishes when needed: “I don’t care about my clothes. I don’t care about mahjong,” she told MacKenzie, “I just like to eat.”Read it: Three Generations At Work in Henry’s Hunan Restaurants in San FranciscoOh no no noNo no no noooooooThis newsletter was filed...very lateBecause I was watching the Mario Buatta auction LIVE all day Thursday. The interior decorator, who died in 2018, had such a vast and quirky collection of...things...by the time the Sotheby’s auction had been running for four hours, we were only on Lot 192...of 969. Items were going for tens of thousands of dollars. My eyes were on: oil portraits of moody cocker spaniels (want), velvet upholstered footstools (need), and beautiful Delft blue and white porcelain (never enough). When it got to the TROVE of asparagus and cabbage decor, I realized I should maybe write about it to share my wonder and delight with you. Above, an asparagus-shaped tureen ended up selling for $25,000. 25,000!!!!Courtesy of Frito-LayPudding...chips?Have you scanned the chip aisle lately and thought: “Too many flavors!”? It’s true! There are too many! The first flavors of potato chips were barbecue, onion, and salt & vinegar. But two weeks ago we got a delivery of Flamin’ Hot Limón Doritos (not into those) and jalapeño-cheddar Lay’s (very into those). The Guardian has a nerdy-fascinating article about the rise of high-concept chip flavors, I mean flavours, especially those very UK-centric ones, like Christmas pudding and “whisky and Haggis,” which, oof.Photo by Transcendental Graphics/Getty ImagesPR stunt of the weekMr. Peanut had to “die” in order to direct your attention towards a salty tin of peanuts this Super Bowl season. The mascot, despite having the top hat and monocle of a 19th century oil baron, was never able to afford a pair of pants. Read more about the stunt in a funny piece at Vox.Unnecessary TikTok of the weekNEVER LET GO.Unnecessary food meme of the weekUnnecessary food feud of the weekTensions in the world—in the Senate—are mounting. Flus are spreading. Fires, burning. We did not feud over petty food topics in the office this week. And hopefully, in your life, things are peaceful too. At least for a little while.Explore Bon AppétitBeggs NewsletterRead MorecultureMake Chicken Meatballs for the SoulBy Alex BeggscultureMake Black Bean Soup and Then (Easily!) Clean Your Dutch Oven This WeekendBy Alex BeggscultureMy 2019 “Keeper” Recipe Is Never Leaving My SideBy Alex BeggscultureThe Most Ridiculous Baking Project Is the Bûche de NoëlBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-25", "author": ["Condé Nast", "Alex Beggs"]}