{"id": "36b83688d9092dd5c713108eb082c09c", "url": "https://www.bonappetit.com/recipe/corned-beef", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Corned Beef  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCorned BeefBy Brad LeoneMarch 1, 20224.9(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, styling by Anna BilingskogEmailPinterestPrintEmailPinterestPrintWhile this corned beef recipe is simple to make, planning is key. You’ll need to clear some space in your refrigerator and get organized at least a week before you plan to eat it. Curing the meat takes about five days and is a crucial first step—corned beef is named for the large grains or “corns” of salt that were traditionally used in the curing process. We opt for a small amount of pink curing salt, which gives the interior of the cooked beef an appetizing rosy hue. A host of pickling spices go into our curing mix, too, plus a can of Guinness, which adds some richness and a refreshing touch of bitterness. If necessary, a gluten- or alcohol-free beer can stand in for the Irish stout.After curing, you'll simmer the corned beef brisket with more of that spice mixture for about 45 minutes per pound. Serve it on St. Patrick’s Day with halved or quartered red-skinned potatoes, wedges of green cabbage, and large chunks of carrot (just drop the veg into the cooking liquid about 40 minutes before the beef is done) for what’s known in New England as a Boiled Dinner. For more guidance, check out this video.If you have leftovers and aren’t feeling like a sandwich on rye or a classic corned beef hash, try chopping the meat and using it in egg rolls (it works surprisingly well!) or drape slices atop a Reuben sandwich–inspired Dutch baby (simply swap the pastrami for the corned beef).Editor’s note: This recipe was originally published March 14, 2017.Ingredients6–8 servingsPickling Spice5dried chiles de árbol11-inch piece fresh ginger, peeled, coarsely chopped13-inch cinnamon stick10cardamom pods8dried bay leaves3tablespoons whole peppercorns2tablespoons coriander seeds2tablespoons mustard seeds1tablespoon allspice berries1tablespoon juniper berries1teaspoon whole clovesBrine and Brisket114.9-ounce can Guinness draught½cup (packed) light brown sugar5teaspoons pink curing salt2½cups kosher salt, plus more15–6 pound untrimmed flat-cut beef brisketPreparationPickling SpiceStep 1Toast chiles, ginger, cinnamon stick, cardamom, bay leaves, peppercorns, coriander seeds, mustard seeds, allspice berries, juniper berries, and cloves in a large dry skillet over medium heat, shaking pan occasionally, until spices start to jump in pan and are fragrant, 3–5 minutes (don’t let them burn). Transfer to a mortar and pestle and coarsely crush about 1 minute (or crush with a knife).Brine and BrisketStep 2Whisk Guinness, brown sugar, curing salt, 2½ cups kosher salt, and 1 gallon water in a large pot or container (at least 8 quarts) until sugar and salts are dissolved. Scoop out ½ cup pickling spice and set aside in a small bowl or jar (you won’t need it again until it’s time to cook the corned beef). Add remaining spice mixture and brisket to brine and weigh down with a plate to keep it submerged (it’s okay if brisket needs to be crammed into the container, just don’t fold it; you can also cut it in half if you can’t find a large enough container). Cover with plastic wrap or a lid and chill, flipping meat once a day, 5–6 days.Step 3Bring a large pot of lightly salted water to a simmer. Remove brisket from brine and rinse thoroughly under cold water; discard brine. Add brisket to simmering water along with reserved ½ cup spice mixture and cook, covered, until corned beef is fork-tender and easily shreds with the grain, 4–4½ hours.Step 4Slice corned beef against the grain and serve.Do Ahead: Corned beef can be cooked 1 week ahead; cover with plastic and chill.How would you rate Corned Beef ?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleFor all the people that don't read the whole article:\n\nEditor’s note: This recipe was originally published March 14, 2017.Ryan K.California3/16/2022The first thing you say is that you have to start a week ahead, but that means ready next Tuesday, days after St patrick's Day.  Not very sharp planning on this one, I'm afraid. \nPaigeChicago3/15/2022As has been mentioned, this recipe would have been ideal to have a week ago. All that being said I can’t wait to try it as I make corned beef at least 5-6 times a year. ScottSan Juan Bautista, Ca3/15/2022You said you were not doing beef recipes. Are  you not woke anymore?Petenaples fl3/15/2022I had to chuckle as I read the reviews. Isn't this Corned Beef and Cabbage Dinner always this way? The Brisket might be too salty, the carrots too soft, same with the cabbage, the potatoes just right, and hopefully the Corned Beef not too stringy. And we eat it anyway and it's a great meal and traditionVicky OVershire, Vermont3/15/2022If this take a week why are you giving us the recipe 3 days before St Patrick’s Day? Anonymous3/15/2022I’m with Willie on wondering why you would suggest a recipe that is already too late to start?Mike3/14/2022Looks like a great recipe, but if it needs to be started a week before it’s ready to eat, why are we hearing about it only 3 days before St. Paddy’s day?Willie3/14/2022Pretty good! I had more like a 3.5/4lb brisket (cooked for a bit under 3h). It did turn out a bit saltier than I'd anticipated, and I second the recommendation to cook your cabbage separately. The EXTREMELY salty (by the end) boiling water makes for A+ potatoes, but too much (imho) for carrots, unless you cook them only very briefly. I spooned out a couple of ladle's worth of the boiling water into a separate pan, added twice that amount of water, and cooked my cabbage in that. Laura G.Los Angeles, CA11/17/2020On the bag of cure it says a tsp is good for 5 lbs.  I use .25 percent when doing jerky.  Im curious how much to use in a brine with a 9 or 10 lb brisket.  Shussey512High River, Alberta5/15/2020Wow.  This produced the best corned beef I’ve ever had.  Had a timing issue and ended up brining for only one day but doing the 4.5 hour boil with a great result.   Used Boston Spice’s “Southie” blend of pickling spices, which are very similar to BA’s recipe.  SO fragrant, bright, and delicious.  We are blown away.  Thanks BA!laura_birenbaNYC3/30/2020I would like to try this recipe.  After brining the brisket, any thoughts on cooking using the sous vide method, rather than boiling it?  Would it taste the same and have the same texture?prosecute1966Elgin, Illinois3/18/2019This was a delicious meal. We had a 6 lbs brisket which we brined for 5 days per the instructions. I simmered it for 4.5 hours and it was just a little over cooked on the thin edge but I should have payed closer attention. Added 2-3” carrot pieces and quarter red potatoes 25 minutes before cooking finished and cooked the cabbage for 15 minutes while the meat rested. JWatIV13Rapid City, SD9/4/2018This was a fun recipe to try! The meat turned out nice and pink from the curing salt, and it was super tender and flavorful. I do think next time I would cook the cabbage separately since everything was so salty from being cooked in the same liquid.\n\nIf you make this, make sure you find curing salt ahead of time since I had a crazy hard time finding it. Spice House in Chicago finally saved me.soapnanaChicago4/9/2018Explore Bon AppétitIrishEuropeanBrisketBeefMeatMainDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-14", "author": ["Condé Nast", "Brad Leone"]}