{"id": "36bd925681b62f4b110ea74307c1cc6d", "url": "https://www.bonappetit.com/story/deep-eddy-cabaret-austin", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Deep Eddy Cabaret in Austin Is Dive Bar Royalty | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDive Bar Royalty Has a Name, and It’s Deep Eddy CabaretThis is where you go to drink pitchers of beer and play pool with hipsters and cowboys alike.By Alex DelanyDecember 20, 2019FacebookTwitterEmailPhoto by Matt Taylor-GrossFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.In a world of bars claiming the title of “dive bar,” Deep Eddy Cabaret actually is one. It’s a neighborhood joint that isn’t fueled by ambition but by comfort and dependability. All those hipster beer-and-a-shot joints want to be this when they grow up. But Deep Eddy has been that way since 1951—and there’s nowhere else in Austin I’d rather drink a pitcher of Lone Star.That wondrous experience starts before I even enter the bar. Deep Eddy’s fluorescent, back-lit sign—with an inexplicable baby blue tornado logo and midcentury, serifed red letters—illuminates a corner that, unlike most of Austin, is incredibly quiet and surrounded by houses and a glowing Chevron station.And once you walk in, it’s a vibe all Deep Eddy’s own. Pool tables. A UT football game on the TV. Pitchers of beer and bags of Fritos covering laminated wood tables. Decades old, worn, stackable chairs, and a jukebox blasting Willie Nelson or the like. A cigarette machine that seems not to have gotten the memo that cigarette machines don’t really see action anymore. The occasional burger, delivered from Larry McGuire’s Pool Burger just behind the building. Christmas lights hanging from the ceiling. Neon signs and brewery placards on every inch of the walls. A collection of knick-knacks—from hockey masks to postcards to footballs to family portraits—that seem to have come from just about every part of the country. And everyone else who decided to show up that night: mostly Austinites, young and old, buzzed and...slightly more than buzzed.But for all that Deep Eddy is, it’s what it isn’t that makes it truly phenomenal: It isn’t a wine bar. Or a beer bar. It isn’t a whiskey bar. Or a cocktail bar. Deep Eddy Cabaret is just a dive bar. And a damn good one at that.Go there: Deep Eddy CabaretExplore Bon AppétitHighly RecommendBarsAustinRead MorerestaurantsIt’s Called Spaghett and It’s Now My Favorite Summer CocktailBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-20", "author": ["Condé Nast", "Alex Delany"]}