{"id": "36bf65b2299c7a1984e2b0503499f3e2", "url": "https://www.bonappetit.com/recipe/hibiscus-gandt", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Hibiscus G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHibiscus G&TRawlston Williams shows us his take on a classic G&T. His recipe includes a hibiscus-ginger simple syrup and a lime garnish–a nostalgic combination that will make you feel like you're on vacation.By BOMBAY SAPPHIRE® GINDecember 11, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire4oz. premium tonic water, to top1piece of ginger about 1 ½-in., thinly sliced1cup sugar1cup dried hibiscus flowers1cup water½oz. fresh lime juice plus thinly sliced rounds, for garnishIcePreparationStep 1Combine sugar, hibiscus, ginger, and 1 cup water in a medium saucepan. Bring to a simmer (do not boil) over medium-high, stirring until sugar is dissolved. Remove from heat. Let steep 20 minutes until flavorful and bright.Step 2Set a fine sieve over a medium heatproof bowl. Strain the mixture into the bowl; discard solids. Refrigerate hibiscus-ginger syrup until chilled, at least 30 minutes.Step 3Fill the glass with ice. Pour in the Bombay Sapphire, 1 oz. of the hibiscus-ginger syrup, lime juice, and tonic water. Gently stir. Garnish with 1-2 thinly sliced lime rounds.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2020. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Hibiscus G&T?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-11", "author": ["Condé Nast", "Bombay Sapphire"]}