{"id": "36d03c5b2a78e6b2485a8a924cdfe0f7", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/barabba", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Barabba Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenBarabbaMake the most of your jet lag by staying up all night at this Indre By chefs’ hauntFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for the mostly natural wines, handpicked by 108’s opening wine director Riccardo Marcon, with Italian food that reads as rustic on the menu but modern on the plate. (See binchotan-grilled octopus with a constellation of heirloom potatoes and olives tucked beneath young sorrel leaves.)ORDER: all of the pasta; grilled octopus; red prawns with romaine; and anything wild and gamy (the chef and co-owner Marco Cappelletti  loves to hunt).THE VIBE IS: dark and a little scruffy at first glance, but the incredibly friendly Marcon and Cappelletti have a serious fine-dining background, so everyone feels well cared for. Natural-wine groupies can be seen poring over Marcon's list at the bar. Open late and good for groups—two rarities in Copenhagen—this place gets fun on weekends and is often a final stop for local chefs.PRACTICAL STUFF: Open for dinner Wednesday to Sunday, from 6 p.m. to 2 a.m. Closed Monday and Tuesday.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVECafé Atelier SeptemberThe breezy Indre By café that’s turned avocado toast into an art formAdmiralgade 26Make yourself at home, if home’s got smoked duck hearts, at this styled-out Indre By spotDemocratic CoffeeOne more reason to love the library (or at least this Indre By one): buttery croissantsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}