{"id": "36d4741598bb302594ce23a09762c557", "url": "https://www.bonappetit.com/story/journey-by-the-sea-a-food-lovers-running-guide-to-vancouver", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Journey by the Sea: A Food Lover's Running Guide to Vancouver | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredJourney by the Sea: A Food Lover's Running Guide to VancouverBy Destination CanadaMarch 7, 2018FacebookTwitterEmailCopyright  1996-2014 Accusoft Corporation. All rights reserved. DCIM\\100MEDIAFacebookTwitterEmailVancouver’s Pacific Rim locale, gorgeous mountain ranges, and globally influenced dining scene have made this West Coast city a food and fitness lover’s dream destination. Boasting a bevy of urban paths, wooded trails, and a vibrant list of eateries, you’d be hard pressed to find a city better suited for great food and outdoor fun. After a run on one of Vancouver’s many city or ocean-side routes, you'll be ready to enjoy a culinary reward created with local ingredients and West Coast flair. Take advantage of the Pacific city’s one-of-a-kind offerings with this eclectic food and running guide.Run the TownSlip on your sneakers and head to Coal Harbour to complete a 6-mile loop of the Stanley Park Seawall. Jog around the picturesque park—pausing for a scenic stop at Second Beach or to snap a pic beside the Harry Jerome Statue (honoring the record-setting Vancouver runner) at Hallelujah Point—before crossing back at Lost Lagoon to complete the run back where you began.For a shorter run in the city, embark on the 5-mile loop of False Creek. Begin in Yaletown and stride along the edge of the shore past Olympic Village. Circle False Creek itself, waving to your fellow joggers and passing the glittering geometric dome at Science World before returning to the start by crossing the Burrard Street Bridge. In the mood for something short and sweet? This run can be shortened by cutting back early to check out the thought-provoking public artwork under the Cambie Street Bridge illustrating future sea level rise. Or by zipping across False Creek on a water taxi.The Stanley Park Seawall, Vancouver, BC.\nScience World, Vancouver, BC.\nDine Before You Dash: ForageBefore you lace up, fuel up at Forage in the city’s West End. This self-proclaimed casual, minimalist-modern restaurant from chef Chris Whittaker delivers locally sourced and ethically minded food to the highest standard. Try one of their dishes made with cultivated mushrooms or Okanagan goat cheese for a taste of ingredients that are foraged and found within the region.1300 Robson St., Vancouver; 604.661.1400, foragevancouver.comA look inside Forage in Vancouver’s West End.\nForage's signature bison steak with hay-smoked potatoes and foraged green chimichurri.\nPost-Run Refreshment: MELU Juice & Health BarGet reinvigorated after your run with the cold-pressed Grapefruit Heartbeet juice—a refreshing blend of pineapple, grapefruit, beetroot, lemon, and mint—or a handcrafted Creamsicle Dream smoothie at MELU Juice & Health Bar. Many of MELU’s items also come in cool-as-can-be takeaway jars, allowing you to sit and savor or continue on with your day, drink in hand.1110 W Pender St., Vancouver; 778.379.6358, melujuice.comMELU's takeaway juices are ideal for active travelers.\nHealthy homemade treats round out MELU's creative menu.\nLocally Sourced Lunch: Tractor Foods (Coal Harbour)After working up a sweat and taking in the Vancouver views, enjoy a different kind of scenery: the city’s food scene. Reward your cardio cruise with a personally curated dish from Tractor Food’s à la carte menu of sandwiches, soups, stews, and salads served in a modern cafeteria-inspired setting. Consistently delicious, this local favorite has multiple locations around the city, making it a sure bet no matter where you wander.335 Burrard St., Vancouver; tractorfoods.comTractor Foods, Burrard Street, Vancouver, BC.\nTractor Foods boasts a fresh and inventive menu with à la carte items for all tastes.\nBrews Cruise: Callister Brewing Co.Following lunch, explore some of Vancouver’s beer-based artistry courtesy of the brewmasters at the community-minded, co-working Callister Brewing Co. Relax into a tasting tour of their always-rotating roster of traditional and experimental beers, like the “Greyhound” Gin Barrel-aged Grapefruit IPA or the “Tin Top” Amber Ale, or enjoy a beverage for all ages—their effervescent handmade sodas.1338 Franklin St., Vancouver; 604.569.2739, callisterbrewing.comPulling the perfect pint at Callister Brewing Co., Vancouver, BC.\nTasting tours are a great way to try Callister's always-changing offerings.\nChic Aperitif: ChambarIn the evening, swap runners for blue suede shoes and head to Chambar in Crosstown for pre-dinner drinks. Informal yet elegant with exceptional food and refined beverages, it’s Chambar’s towering cocktail bar that takes center stage. In this rustic-chic space, enjoy a Safflower Negroni or try the “Panacea”  cocktail (pictured) and other custom creations conjured up by Vancouver’s top bartenders.568 Beatty St., Vancouver; 604.879.7119, chambar.comThe “Panacea” cocktail at Chambar, Vancouver, BC.\nInside Chambar’s inviting dining room.\nDine at the Finish Line: BotanistTreat yourself to a day well run at Botanist restaurant, tucked within the exquisite Fairmont Pacific Rim hotel. Its setting gives the air of a secret garden while the dishes served are equally delightful, like hand-cut tagliatelle with “mushroom soil” and crispy Piave cheese. Ask for a seat in the garden—a plant-filled space adorned with a dizzying variety of greenery, fruit bushes, and spice plants. Cap off the evening at the Botanist Bar and Cocktail Lab to sip on one of their whimsical cocktails and end the day in style.1038 Canada Place, Vancouver; 604.695.5500, botanistrestaurant.comFoliage takes center stage at Botanist in Vancouver, BC.\nBotanist offers a warm welcome, nestled inside the Fairmont Pacific Rim hotel.\nReady to hit the trails and taste the food scene? It's time to plan your next great adventure in Vancouver.Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Destination Canada"]}