{"id": "36e4e0bbff1fa59c5201c6503841640d", "url": "https://www.bonappetit.com/recipe/upside-down-caramelized-leek-tart", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Upside-Down Caramelized Leek Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesUpside-Down Caramelized Leek TartBy Molly BazMay 6, 20194.4(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintYes, this is an impressive-looking, deliciously savory tart. And no, it’s not at all difficult to make. The peak season leeks and store-bought puff pastry are doing all the hard work for you.Ingredients2 servings for dinner or 4 servings as a light lunch or appetizer114-oz. package frozen puff pastry, thawedAll-purpose flour (for surface)6leeks, root ends and dark green parts removed, cut in half lengthwise2Tbsp. extra-virgin olive oil½tsp. kosher salt½tsp. freshly ground black pepper, plus more¼cup white wine vinegar2Tbsp. unsalted butter1tsp. sugar1tsp. thyme leaves, plus more for serving2Tbsp. Dijon mustard2oz. Parmesan, finely grated (about ½ cup)Flaky sea saltPreparationStep 1Place a rack in center of oven; preheat to 400°. Roll out puff pastry on a lightly floured surface to a 12\" square. (If you have 2 sheets of pastry, stack and gently roll out to adhere.) Using a 10\" cast-iron skillet turned upside down as your guide, trace a circle with a sharp knife around circumference of skillet. Reserve scraps for another use. Prick pastry round all over with a fork. Roll dough onto rolling pin, then unfurl onto a rimmed baking sheet and chill until ready to use.Step 2Toss leeks, oil, kosher salt, and ½ tsp. pepper on another rimmed baking sheet. Arrange leeks cut sides down and roast until tender and lightly browned in spots, about 20 minutes. Let cool. Remove tough, leathery outer layer, then transfer leeks to a cutting board.Step 3Meanwhile, bring vinegar to a simmer in 10\" cast-iron skillet over medium-high heat and cook, stirring occasionally, until slightly reduced, about 1 minute. Add butter, sugar, and 1 tsp. thyme and continue to cook, stirring occasionally, until butter has melted, about 2 minutes. Remove from heat and let cool slightly.Step 4Arrange leeks cut sides down and side by side in rows in vinegar mixture, trimming as needed so they all fit snugly in skillet. If there are any gaping holes, fill in with small pieces. You may have a leek or two left, but better to err on the side of having too many than not enough.Step 5Brush leeks with mustard. Sprinkle with 2 oz. Parmesan. Drape chilled pastry over leeks, tucking edges inside skillet with a spoon. Cut three 3\"-long slits into pastry (cutting all the way through) to let steam escape—this will help the pastry cook more evenly. Bake tart until pastry is deeply golden brown and puffed, 35–45 minutes.Step 6Let tart cool slightly, about 5 minutes. Carefully place a large plate on top of skillet. Using towels, invert tart onto plate. If some of the leeks get left behind in skillet, use a butter knife or offset spatula to release and nestle them back into tart.Step 7Top tart with thyme. Season with sea salt and pepper.Step 8Do Ahead: Dough can be prepped 8 hours ahead. Cover with plastic and keep chilled.How would you rate Upside-Down Caramelized Leek Tart?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleGreat recipe, easy to make and looks stunning.AlBrooklyn, NY11/20/2021I used a standard pie crust instead of a puff pastry, and it turned out great. Reminds me of something you'd get at a bistro-type restaurant. I do agree with the other reviewer that said this is too heavy on the vinegar-- I'd reduce by half.AnonymousCape Cod, MA4/3/2021Made the tart, adding some thinly sliced, parboiled new potatoes tossed with melted butter as a second layer above the leeks. I sliced leeks on the bias, as suggested by other testers. I spiked the vinegar mixture with a bit of balsamic-not necessary., and darkens the color on the top. Next time,  I will try russet potatoes for mine remained slightly al dente, and will parboil them sliced as opposed to the whole spud like I did this time. Too much vinegar. Should cut down on the acid. Note to self-king Arthur pie crust rolled twice like a puff pastry. Paula Wolfert’s method for rolling pita dough.FiratSan Francisco 1/30/2021Simmering vinegar in a cast iron skillet?  Won’t that strip the seasoning from the skillet and affect the flavor?  I treasure my cast iron and don’t want to sacrifice it even for a recipe that sounds as delicious as this one.  Looking for some reassurance here.  Thanks in advance for responding. A Cook in Seattle Seattle12/2/2020I loved this so much. Like many other commenters have written, this is a really easy and lovely recipe that does turn out super beautiful, just like the photo. I used the Bon Appetit Shortcut Puff Pastry and it was absolutely delish. We ate the leftover roasted leeks in an omelette the next day, superb!AnonymousNew York City6/10/2020Delicious, I scaled everything back to make an individual tart for one and it made the perfect late lunch.\nI cut my leeks into coins ~ 1cm thick and used wholegrain as that's all I have in.\nI ate it semi-warm with salad leaves, mini cucumbers and a small wodge of welsh blue cheese washed down with a glass of white. LaviniaPSwansea, Wales4/22/2020First off, this is delicious. Make it now! I’ve got the second in two weeks in the oven right now. That said, how are we making this? Meaning, how am I supposed to cut the leeks? These past two times I cut them in half then sorta riffle them like a deck of cards so they fall apart in a bowl into single whatever a single leek skin thing. Then toss with olive oil etc... then after roasting put down in a single layer in the pan. Should I roast them as more whole pieces and then peel apart to lay in pan or am I doing t right?NewguySan Diego6/12/2019This is actually possible to make and have it look like the picture! And it was so yummy. It made for great leftovers warmed up in the toaster oven. My only complaint was similar to other reviews, it is a bit difficult to cut with the long leeks. I think I'd cut them in half next time. AnonymousSeattle6/10/2019Delicious! Even my picky eaters really enjoyed it. The only thing I might do a smidge differently is cut the leeks into smaller pieces. But the flavors and ease (a weeknight special!) was spot on.AnonymousLawn Guyland, NY5/15/2019Awesome recipes I try at home today love it \n\nAnonymousUnited Kingdom5/14/2019I was making two many recipes when I started this one and forgot the parmigiana, but I must say the leeks were perfection against the Dijon and the pastry dough gave elegance. The tart was amazingly delicious  despite my blunder. \nI am entering this one into rotation. delicious!Benicia CA5/14/2019This was beautiful and had good flavor, but I found it quite difficult to cut and eat. If I was to make it again, I would probably cut the leeks into smaller pieces. Anonymous5/12/2019Has anyone made this with fennel or any other vegetable? Anonymous5/9/2019Does anyone know if this can be served at room temperature? Sophronia SphynxToronto, Canada5/8/2019I don't know what else to eat with this! If I make this as a side, what else would be good?AnonymousUS5/8/2019Explore Bon AppétitSavory Pie & TartLeekVegetablePuff PastryOther IngredientsMainStarterVegetarianChristmasDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-06", "author": ["Condé Nast", "Molly Baz"]}