{"id": "36e61ce945880e120765972fb0c3e446", "url": "https://www.bonappetit.com/story/tan-tan-cafe-and-delicatessen-tet-lunar-new-year", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Our Restaurant's Name Means 'New Beginnings.' That's Never Felt More True. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsOur Restaurant’s Name Means ‘New Beginnings.’ That’s Never Felt More True.From escaping Vietnam to opening our restaurant, from surviving COVID-19 to celebrating the Lunar New Year, my family has always found a way.By Lisa Tran, as told to Elyse InamineFebruary 12, 2021FacebookTwitterEmailPhoto by Leah NashFacebookTwitterEmailOur official restaurant name is Tân Tân Café & Delicatessen. Tân Tân translates to “new.” It means new beginnings, which encompasses everything that my family has been through. From my parents escaping Vietnam to opening this restaurant, from us surviving COVID-19 to celebrating the Lunar New Year, this time reminds me of our name and our story.My mom caught my dad’s eye because she was chubby. It was a sign of prosperity and health. That’s how they began their romance, on a boat trying to escape Vietnam in 1975 after Saigon fell. My dad was months away from becoming a priest and my mom was an elementary school principal. Together, they asked for blessings from their families for an informal engagement and left with some of their siblings on another boat. After three days on the ocean, they were raided by Thai pirates. The women were raped, the men were horrendously beaten, and all their belongings and food were stolen. They were basically left to die. My father, being a spiritual person, led everyone on the boat through prayers, which were answered when a Thai fisherman came to save them. He fed them and gave them water as they were towed to Thailand. Our story is not a unique one. There were thousands of boat people trying to escape Vietnam during this time.My parents stayed in Thailand for a year before they were transferred to the Galang Refugee Camp in Indonesia. I was born in that camp. When my mom was pregnant with me, she craved Vietnamese food and sauces, but my parents didn’t have money to buy things from the commissary. So my dad carved figurines out of wood to sell and used that money to buy ingredients. My mom was always a wonderful cook, so she’d make bánh kẹp, a crispy rice snack that’s not quite a cookie, not quite a cracker. At the same time, the rest of my mom’s sisters quietly left Vietnam in small groups to avoid getting caught together. They also spent time in refugee camps and eventually moved once they got sponsored, to Holland, Hong Kong, Canada. My aunt went to Oregon and began the paperwork to sponsor my family.Lisa’s parents Vinh Tran and Hongmai Nguyen at Galang Refugee Camp\nPhoto courtesy Lisa TranWhen my parents arrived in Beaverton, Oregon, after I was born, their educational backgrounds from Vietnam were not useful at all. My mom could speak French but not English. In between taking ESL classes, she worked as a seamstress and later on for Nike. My dad started out as a landscaper and dishwasher until some kind people suggested he become a machinist for better pay. He went to night school and ended up working at Boeing for 37 years. In 1995 they both were out of work. My mom was diagnosed with breast cancer and retired early from Nike, and there were mass layoffs at Boeing. That’s when they decided to open the deli.Initially, we had a small menu at Tân Tân. Beef meatballs swimming in a clear, savory broth. Bánh mì filled with pâtés. My mom made a hot chili sauce to highlight the meat items, but she was such an amazing cook that people kept asking for more. Someone would come in and say, “I really miss bún riêu [a crab noodle soup with ham hock and pork blood]. My mom doesn’t live here and I can’t get it anywhere.” My mom would say, “I can make that,” and then she would add it to the menu.As time went on—and the menu grew to 100 items—customers wanted to sit down to enjoy these things. So our two little tables doubled to four. Then eight. The deli shrunk while the restaurant expanded. It got to the point where the Department of Agriculture, which usually oversees inspections for delis, told us, “We need to transfer you to the Department of Health, as much as we love you.” That’s how we became a restaurant. We just celebrated our 22nd birthday.We’re like the Vietnamese Olive Garden. When you’re here, you’re literally with my family. My cousins work the register. My aunts help cook. But my parents never intended for me to join the restaurant business. After I applied to medical school twice—and didn’t get in twice—they sat me down and told me, “You need to think about this as a career path.” Customers had been asking us to expand to Washington state, so we started looking and found a spot in Vancouver, Washington, just north of Portland. This was where I learned how to run a business. I harnessed the magic of QuickBooks and figured out how to cook all my mother’s recipes. We began making our own hoisin because the store-bought brands were so sweet and overpowered delicate Vietnamese flavors. Customers asked us if they could buy our hoisin and hot chili sauce, so we sold them in 32-ounce tubs.When I found out I was pregnant with twins, I was still running on restaurant hours, opening the restaurant at 7:30 a.m. and closing it at 10 p.m. Doing this seven days a week is not conducive to newborns, so I began thinking about a new business: selling my mom’s hot chili sauce. I went to the local small business development office to draw up a business plan, which I had never done before. As I was waiting I saw a flier that said: “Do you have a recipe? Have you ever wondered how to get your recipe on the shelf? Call us!” So I punched in the number, which was for a 12-week food business cohort called “Getting Your Recipe to Market” and joined after I had my babies.I attended class one night a week, after working at the restaurant. My instructors advised us to offer multiple products to give buyers a choice. Since our hoisin sauce is the base for my mom’s hot chili sauce as well as our peanut sauce, I thought, “Okay, I’m going to launch with these three sauces.” For the class final we had to pitch to New Seasons Market, a local grocery chain. We hadn’t even bottled the sauces yet, and I used double-sided tape to put on the labels. My mom made fried rice to highlight the hoisin; my husband smoked ribs with the hot chili; and I fried chicken wings and tossed them with peanut sauce. We were the first company coming from this course that got into all the New Seasons Markets. We called the sauces Tân Tân because they were another new beginning for our family.Raw eye of round does not translate well to delivery. When we had to close our dining room because of COVID-19, it took some time to explain to our customers that it’s okay to just put the meat in the hot soup to let it cook through. At our lowest point in the pandemic, our sales were down 70 percent. But closing wasn’t an option. If we closed, we couldn’t support our employees or our local meat and produce purveyors. So we were determined to stay open with a limited staff. At the same time, sales for our sauces went up. We also got discovered by Christopher Kimball of Milk Street last October. Every product he recommends goes through a rigorous taste test, so we’re humbled that they enjoyed our flavors so much that they picked us up. That introduced our sauces to customers on the East Coast who weren’t familiar with us yet. Our sauce sales have been up 65 percent.We set up the sauce and the restaurant as two different companies because we didn’t want one to adversely affect the other. In the end the restaurant had to take a loan out from the sauce business to help pay for rent, staff, and purveyors. In a sense the sauce business saved the restaurant.Right before Thanksgiving we fully shut down the restaurant. It was such a relief. Every day I had been wondering, “Will we break even today? Which produce will go bad today?” It was just very unpredictable and stressful when you’re sitting at the restaurant for hours without any customers. Our goal was to reopen during Lunar New Year.In my family’s tradition, the week before the new year, we make a big pot of thịt kho trứng, cooking it down and adding in hard-boiled eggs so they’re coated in a rich, caramelized sauce. We scrape out the middle of bitter melons and stuff it with ground pork, scallions, and wood ear mushrooms, then make a soup out of it. It’s called canh khổ qua and it’s really bitter—it symbolizes eating the bitterness away, absorbing it, so you can look forward to the new year. We also have a variety of pickles. Since my family is from the south, we make sweeter, more tropical pickles, like pickled bean sprouts with chives. My grandma, who is 89, still makes bánh tét chuối, the special New Year’s rice cakes: long logs of coconut sticky rice, stuffed with creamy mung beans and a thin strip of pork belly and steamed in banana leaves. We eat with the whole family: my parents, grandma, siblings, aunts, uncles, and cousins. We wear our new clothes and give each other red envelopes, called lì xì, filled with money for good luck. We gamble and play bingo. And even though my family is Catholic, we set aside a little meal for my grandfather who passed away. It’s not a way to worship but to honor those who have gone before us.Lisa, as a baby, with her mom in Oregon\nPhoto courtesy Lisa TranWhen we celebrate the New Year, we say, an tết, which means, “eat New Year.” It’s all about the food. We’ve often offered a Lunar New Year menu at Tân Tân—canh khổ qua, thịt kho trứng, and my grandma’s bánh tét chuối—the things we cook and eat together as a family.This year we won’t be able to open Tân Tân in time for the Lunar New Year, nor meet as a family for our Tết feast. But at least we have FaceTime. Where we are today goes back to our immigrant mentality. My parents have been through so much—they have faced death on the open ocean and prejudices when they arrived here. As challenging as COVID-19 has been, it’s been something my parents’ experiences have really prepared us all for. We’ve learned to be resilient and also optimistic.That’s why Tết is so special to us. The New Year means rebirth and new beginnings, and it reminds us of where we came from and who we are. We have survived and overcome so much, we will survive and overcome again.Explore Bon AppétitRestaurantsOregonFirst PersonVietnameseLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-12", "author": ["Condé Nast", "Lisa Tran", "As Told To Elyse Inamine"]}