{"id": "36fd90f40f6fcac2b6c35de16794c731", "url": "https://www.bonappetit.com/story/ina-garten-makes-baked-alaska-cool-again", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Ina Garten Makes Baked Alaska Cool Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIna Garten Makes Baked Alaska Cool AgainIn Garten’s newest cookbook, she developed a simplified version of the ’50s dessert. It took her 15 tries, but somehow she made it manageable for home cooks. Here’s how she did it.By Alyse WhitneyNovember 1, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIna Garten is Bon Appétit’s guest editor this week. Take a look into her pantry, read celebrity and chef odes to their favorite Ina recipes, watch her and food director Carla Lalli Music make chocolate-pecan scones, and read more from her guest-editing week here. \n Staring into a bowl of egg whites, I felt a sudden surge of anxiety. During the hop from one half of a cracked eggshell to the other, I had accidentally let the yolk drop, and completely ruined a batch of meringue that I was making...with Ina Garten. “Maybe we can fish it out?” I stammered. She calmly corrected me: “One drop of yolk will keep the meringue from whipping. Don’t worry, it happens to everyone. Just start over.”Before this day in Ina’s East Hampton kitchen, baked Alaska wasn’t on my radar. It seemed like an entirely unapproachable and totally outdated dish from the canon of 1950s Americana cuisine. But that’s not how Ina saw it.The raspberry sorbet and vanilla ice cream soften slightly and swirl together, saturating the pound cake underneath.\nPhoto by Emma Fishman“I wanted to take a complicated recipe and make it as simple as possible,” she said of her single-serving, raspberry-vanilla version, which appears in her newest cookbook, Cook Like a Pro. Garten has always been known for simple home cooking, but with this book—her 11th—she aims to elevate everyday cuisine with “pro tips” culled from decades of her own experience, plus advice from chefs like Yotam Ottolenghi and Jean-Georges Vongerichten. Little tricks like cutting carrots on a diagonal before roasting or swooshing hummus on the bottom of a Mediterranean salad are just a few of the techniques she offers. “It should look professional, but you don’t need to be a pro to make it,” she said. Of all the recipes that made it into the book, the baked Alaska was the one Ina struggled with most to make doable at home.Sometimes Garten gets a recipe right in two tries; other times it takes 24. Baked Alaska took her 15 attempts. The biggest hangup for her and her assistants, Lidey Heuck and Barbara Libath, was figuring out the two-flavor ice cream combination. “You don't want one flavor to hit you in the head and another one to get lost.” She tried passionfruit and vanilla, which was a little too sweet, and contemplated coffee and chocolate, but ultimately went for raspberry and vanilla, an ode to her love of raspberry crème, in a swirled scoop.The next part of the process was to eliminate the grandiose, intimidating elements and offer some shortcuts to make things easier. That included the suggestion to purchase good-quality raspberry sorbet and vanilla ice cream (according to Garten, Talenti and Häagen-Dazs make the best, respectively) for the filling and store-bought pound cake for the base. “It’s such a small part of the dessert that it’s not worth making from scratch,” she says of the latter. She advises to make sure it’s the best quality possible, which means it should be “nice and brown, and look like it’s oozing butter.”As for that meringue, Garten tested three major types—French with egg whites and granulated sugar, Italian with sugar syrup, and Swiss with the sugar heated in a double boiler before whipping—before settling on the last. She most appreciated how its “marshmallow-like” texture held up best after baking, a less intimidating final step than a go with a blowtorch to brown the top. Together, we babysat the meringue until it came to temperature—she advises investing in a candy thermometer to make sure it reaches exactly 120°F—before whipping it into stiff, glossy peaks.Garten went sharp with meringue peaks so they brown in the oven.\nPhoto by Emma FishmanAfter the mixture cooled slightly, Garten filled a pastry bag and piped big, dramatic stars atop her marbled ice cream ball while I swooshed mine with an offset spatula. When developing the recipe, she tried six different styles of piping, but decided to let readers choose their own adventure. The only thing that mattered was making sure the entire filling was encased in meringue before putting it in the oven, so none of the ice cream melts out and the exterior can get bronzed.“Make as many peaks as possible, because those are what get the most color in the oven,” she instructed. “It’s going to be messy, but that’s okay—I’m a messy cook,” she said, unphased as meringue spilled out of the bag and down her hand. “Do it when nobody's looking for the first time—don't do it for a dinner party. I know I cook and talk for a living, but it's really hard to do. I don't wanna be piping when friends are watching!”A drizzle of raspberry sauce—made with seedless jam, raspberries, and sugar—finishes the dish with a pop of color.\nPhoto by Emma FishmanIf Garten was serving baked Alaska at a party, she’d serve them on one of the vintage cake stands she’s collected over the years. Here they are on display in her study.\nPhoto by Emma FishmanWatching Garten cook on TV comes with witnessing her seemingly effortless East Hampton lifestyle—the spotless white kitchen, her friends who drop by for dinner with a floral arrangement in hand, and her loving husband Jeffrey who dubs every dish his “favorite”—and as I walked through her gardens later that afternoon, picking fresh shishito peppers, the word “aspirational” very much came to mind. But with her recipes, it all somehow feels within reach: For the Barefoot Contessa, accessibility and wow factor are not mutually exclusive.After pulling the dessert from the oven, we surveyed our work. “It’s like that scene with Julia Child and Martha Stewart making croquembouche,” she said. “Did you ever see that bit? Martha’s looked like she’d done it with a precision instrument, and Julia looks at Martha and goes, ‘Mine looks like a pile of rocks.’” She laughed heartily, then reassured me that she couldn’t tell the difference between my attempt and hers.Garten and I enjoy the fruits of our labor.\nPhoto by Emma FishmanI had nothing to compare it to, having never tried a baked Alaska before, but it struck a nice balance of tart and sweet. I was skeptical we’d be able to make this dessert in the five hours I was scheduled to be with Ina; it took less than an hour.. But that’s the Garten magic—she strives to demystify a perceived challenge and empower readers to cook something new.“Recipes should be impressive, not intimidating,” she said. “When someone gets to a trickier part of a recipe, I want to make it feel like I’m standing right there next to them, helping them through their problems.” And, if you can’t have Ina Garten by your side in the kitchen, rest assured, store-bought ice cream is just fine. Get the recipe for Ina’s baked Alaska here. And read more from Ina Garten’s guest editing week here!Explore Bon AppétitIna GartenCelebritiesDessertIce CreamSorbetRead MorecultureA Letter from Our Guest Editor, Ina GartenBy Ina GartencultureIna Garten’s Grocery List Includes Whiskey Sour Supplies and Impulse CookiesBy Alyse WhitneycultureNeil Patrick Harris and David Burtka Built Their Relationship on Ina Garten’s GuacamoleBy Neil Patrick Harris and David BurtkacultureNancy Meyers Won’t Throw a Party Without Ina Garten’s Sun-Dried Tomato DipBy Nancy MeyersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Alyse Whitney"]}