{"id": "370370f3c30e098d2574edb8bb691068", "url": "https://www.bonappetit.com/story/indianish-roti", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Roti Is the King of All Indian Breads | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRoti Is the King of All Indian BreadsI’d choose it over naan any day of the week.By Priya KrishnaAugust 2, 2018FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Naan (not naan bread—please don’t say that!) is the bread that gets undue attention in Indian restaurants. There are dozens of Indian carbs, but somehow, naan is often the only bread offering on menus. Naan, naan, naan. Marsha, Marsha, Marsha!I’m here to tell you about the unsung star of the Indian bread family: roti (also known as chapati)—easy to make, extremely versatile, and a sturdy base for practically any Indian dish. It’s far superior to naan, which tends to weigh me down in that carb-y, dissatisfying way. Roti, on the other hand, feels like actual nourishment. You can taste the wheat in the flour, but it still has the stretch and chew that you want. You can eat several in one sitting and honestly feel fantastic!Making roti is simple: the dough is just wheat flour (or atta, as it’s known in Hindi), warm water, a little oil, and a pinch of salt. Then it’s rolled into perfect rounds, and cooked quickly over a hot fire until brown and blistered. Once it’s done, all you need is a generous  swipe of ghee. (At my apartment, I use a cast iron pan over high heat, and it works beautifully.)For my family, and many other North Indian families, roti is the building block of most meals, as essential as a napkin. Dinner is always a variation on dal, sabzi (sautéed vegetables of some kind), kachumber, rice, and roti. Roti is the vehicle for eating everything else. Tear off a piece of roti, make a little parcel with a spoonful of sabzi, maybe dip it in dal, eat, and repeat. And when the meal is over and there’s leftover sauce on the plate, sop it up with a roti, of course.When I was a kid, every Indian family in my hometown of Dallas had a roti dealer, a local cook or caterer who made and distributed fresh rotis out of his or her house. Very often, after my dad picked me up from school, he would drive twenty minutes out of the way to an address in Las Colinas, where I was sent to fetch the rotis. I remember very few details about this mysterious lady except that her house has this distinct smell of turmeric saturated into couch cushions. They’d arrive as a warm stack wrapped in a plastic bag, and that’d be our roti supply for the week. Eventually, my parents got tired of driving all the way to Las Colinas and found that the whole-wheat tortillas sold at Central Market—Dallasites’ favorite gourmet grocery store—tasted just as good.Serve this butter chicken with a side of roti.\nAlex LauEarly on, my mom recognized roti’s potential beyond being a side to our weeknight meals. She figured out that roti makes for the perfect, charred, crispy pizza crust, piling mozzarella and tomatoes (and eventually more creative toppings like cheddar cheese and cilantro chutney) on top and baking them in the oven. We called this “Roti Pizza,” and it remains the most-requested dinner in our house.Before vacations, to avoid having to suffer through terrible, overpriced airport food, my mom would put a spoonful of sabzi on top of a bunch of rotis, roll them up, and wrap them in foil like taquitos—those were called “Roti Roli Polis” because they reminded my mom of the roly poly bugs that are ubiquitous in Dallas. Partway through the flight, we’d happily peel the foil around our roti roli polis, burrito-style, while the flight attendants distributed the sad packets of peanuts to everyone else. Most likely, we were unbearably smug about it.For a quick dessert at home, she’d rub extra ghee on top of a roti, along with a sprinkle of brown sugar. And upon returning from a trip to Sri Lanka last year, she recreated the exciting new roti variation she had discovered called Kottu Roti: strips of roti pan-fried in a wok with lots of vegetables until soft and pappardelle-like. Roti is our family’s universal comfort food. Buy a stack of rotis, and you can Make. Shit. Happen.Perhaps what I love most about roti is that anyone, anywhere can make it. When my mom immigrated to the U.S. from India, she couldn’t find the ingredients she loved from back home (yogurt, cumin seeds, curry leaves, and the like), but she could find wheat flour, and she could make roti.And when my extended family rented a little house in southern Italy one summer and my mom was craving Indian food, my cousin, Hirsh, and I went out to a wheat field, picked wheat (lol we really did this), mashed it into flour with a stone, mixed it with water and salt, heated it up over a pan, and presented my mother with a fresh roti. We didn’t pick enough wheat, so the round was only about 2 centimeters in diameter. Nonetheless, it was roti, and she happily ate it.1 / 50ChevronChevronButter ChickenView RecipeExplore Bon AppétitIndianishIndianBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-02", "author": ["Condé Nast", "Priya Krishna"]}