{"id": "370e27bce49c1442ceec87bdbfeb4e74", "url": "https://www.bonappetit.com/recipe/shaved-carrots-with-charred-dates", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Shaved Carrots with Dates Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueShaved Carrots with Charred DatesBy Chris MoroccoOctober 16, 20183.8(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintCrunchy tender carrots tossed in a tangy-sweet dressing meet soft and blackened dates for literally everything you want in one bite.Ingredients8 servings 1½lb. purple or orange carrots, trimmed, scrubbed, shaved on a mandoline or very thinly sliced into roundsKosher salt3large blood oranges or 2 small grapefruits¼cup extra-virgin olive oil2Tbsp. fresh lime juice2Tbsp. unseasoned rice vinegar10Medjool datesTarragon leaves (for serving)PreparationStep 1Place carrots in a large bowl, season generously with salt, and toss to coat. Let sit at least 10 minutes and up to 1 hour to soften slightly. Pour off any liquid that collects in bowl.Step 2Meanwhile, cut peel and white pith from oranges. Working your way around, cut citrus flesh off cores in lobes. Cut each lobe into large pieces and place in a medium bowl; set aside. Squeeze cores over a small bowl to extract any juice (you want 2 Tbsp.; discard or drink any extra). Discard cores. Whisk oil, lime juice, and vinegar into orange juice; season with salt.Step 3Pour half of dressing over carrots and let sit, tossing occasionally, until ready to serve. Set remaining dressing aside.Step 4Heat a small skillet, preferably cast iron, over medium-high. Cook dates, turning occasionally, until blackened in spots, about 3 minutes. Let cool; remove pits.Step 5Just before serving, pour off excess liquid from carrots and discard (carrots will have softened by now). Drizzle reserved dressing over carrots and toss to coat. Tear dates into bite-size pieces; add to carrots along with reserved oranges and toss to combine. Taste and season with more salt if needed. Top with tarragon.Step 6Do Ahead: Carrots can be tossed with dressing 1 day ahead. Cover and chill carrots and remaining dressing separately.How would you rate Shaved Carrots with Charred Dates?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleYes good, but it cost $10 to makd a side dish!\nAnonymous9/22/2021This was soooo tasty! Made it for Christmas dinner and everyone loved it! Used grapefruits instead of blood oranges and it was really great. Will definitely make again! Would be great for a potluck also!Vancoucer, BC12/25/2019Strongly recommend checking the carrots 10 minutes after they've been mixed with the salt even though the recipe says they can sit for up to an hour - at 25 minutes I found them quite salty & even a rinse didn't help (perhaps a soak in fresh water instead - which I realize may defeat the purpose of salting them but that might have helped with the excess salt). That being said I'd definitely make these again with lots more citrus (a mix of both as others have mentioned) and maybe some green cardamom. As for the current salty batch I'll be using it as one of many veggies in a green salad so they don't go to waste.ballondusoleil11/30/2019Made this today, just because of the 1 start reviews.  People, people, please.  Has reading comprehension no longer being taught in school? 1st use purple carrots (yes it is a thing).  The carrots are not cooked, they are softened around the edges by the salt.  2nd the supremes of the citrus fruit are in the dish.  Can't understand how reviewers are missing this.  (maybe it is my first point).  I cooked the dates on my flat top until they charred.  Its a nice side dish with good flavors. I agree with the op that a spiced papita or blanched pistachio would go nicely on top.  People, please read the recipe before you start cooking.  I teach this to my students all the time. It really is a very basic thing.\n USAChef37Georgia12/9/2018I freaking love this recipe. It's sweet but not too sweet, refreshing, zippy, and a great mixture of textures. I served it at thanksgiving and it provided a great contrast to all the heavy dishes. I don't know why people are having so many problems with it. Even if you added the grapefruits AND the oranges, instead of choosing and using one, I don't see how that would hurt the recipe, except to make it a little more fruity. If you wanted to change anything, throwing in something crunchy like some pistachios or pumpkin seeds might be a fun addition. It's been added into my rotation.AbbyRAlabama11/24/2018Editors: maybe add literally sentence-by-sentence pictures for those readers who refuse to read instructions. Anonymous11/24/2018If there was an option of no stars I would take it. The recipe calls for meticulous preparation of the grapefruit, but no mention of when to add it. I googled a picture and there were no grapefruit sections in it. Maybe I should have added them anyway as they may have masked the God awful taste. The dates were good, and I should have served them by themselves. Never have so many labored so long for so little!ChefgswFort Wayne, Indiana 11/23/2018Guys, let's actually read the recipe and not simply glance at it. The dark color comes from using Purple carrots. And it calls for 3 oranges OR 2 grapefruits. Supreme the citrus: cut off the peel and white pith; then make slices along the membranes so that you cut out the citrus wedges. Wedges are added to the carrots, and leftover membrane/core is squeezed for the juice.\n\nThis recipe is delicious! Anonymous11/22/2018This recipe doesn't make much sense. It asks for 3 oranges and 2 grapefruits. The grapefruits are never mentioned at all and then you only need 2 tbsp of orange juice. Why do you need 3 oranges for that?? Also what's an orange core exactly, that's not something that really exists is it?AnonymousNY11/22/2018Carrots are not cooked, they are  tenderized with salt. The salt mildly softens the carrots, while still keeping the centers crunchy. \nYes the oranges are added, it says so in the recipe.\n The wonderful color of the carrots is from the variety of carrots, not them being cooked. \n\nAs far as my review; Amazing. As always.\nI went with a little variation and added micro-diced shallot and sumac. UmamiiCT11/20/2018Are the reserved blood orange lobes then tossed with the carrots to form the salad?Anonymous11/18/2018People, those are purple carrots. That's their color, they're not cooked. The dates are charred.AnonymousLos Angeles11/16/2018So... when (and how) do you cook the carrots?? If not, how do they get browned and \"crispy\", like they're described in the intro? Would love to try this!\nAnonymousChicago11/14/2018I just made this and the dinner group loved it!AnonymousCape Cod11/2/2018The photo looks like the carrots are lightly browned, but recipe just calls for them just salted???Anonymouswilmington nc10/26/2018Explore Bon AppétitSaladCarrotVegetableDateDried FruitFruitBlood OrangeOrangeCitrusTarragonHerbs & SpicesFallSideDairy-FreeNut-FreeVeganVegetarianGluten-FreeHealthyishThanksgivingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Chris Morocco"]}