{"id": "372cad87e641c717c3fcb0bba824aae1", "url": "https://www.bonappetit.com/story/overnight-french-toast-casserole", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "This Overnight French Toast Casserole Is the Holiday Breakfast As Exciting as Presents | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Overnight French Toast Casserole Is a Holiday Breakfast as Exciting as PRESENTSSSSThis crispy-custardy, hands-off dish feeds all 12 reindeer—whatever their names are.By Alex BeggsDecember 18, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmail‘Twas the night before Christmas, when all through the house, not a creature was stirring, except whoever hasn’t wrapped their presents yet. Someone already breaking into the eggnog. Someone on the phone with FedEx because the ergonomic socks they ordered never arrived. Mom, freaking out. Dad, freaking out. Kids bouncing off the walls tracking Santa on some bogus website sponsored by Big Candy. NO ONE IS SNUG. IT IS CHAOS.Except your overnight French toast, all comfy in the biggest casserole pan you own, covered in custard, waiting patiently to be unwrapped for breakfast the next morning. Take a photo with it in your jammies, send it to @mollybaz and say, “Thanks for the overnight French toast, I’m going to wear it all day! It fits perfectly! I love it!”This recipe is your holiday feeding-a-boatload breakfast solution, all of the prep takes place the night before serving, and that prep is: slicing and toasting bread, mixing some eggs with milk and cinnamon, and assembling a shingled masterpiece, and shoving it in the fridge. The day of, you pour some butter on top and bake. And hey, it works for all kinds of crowds, not just Hallmark movie family unit clichés. I made it recently for two of the people I will spend Christmas with: my boyfriend and my great aunt. We ate ALL OF IT. The recipe feeds six. IT WAS SAVAGE.A few details guarantee a French toast better than most:The bread: Use challah or brioche. Those eggy breads will soak up the custard like a sponge. However, you MUST toast the bread (in the oven) first so that when it gets covered in liquid it keeps its shape and doesn’t get soggy and gross. So yes, you need to turn the oven on, but maybe it was already on for some cookies or something?Make it rain.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensTriple dairy threat: The custard is a ton of eggs, plus a combo of whole milk and heavy cream, because it’s CHRISTMAS, COME ON. The third dairy is a dollop of crème fraîche on every serving, the metaphorical tiny present you find under the tree after all the presents have been opened—and inside the ring box is a dollop of crème fraîche.That’s pretty much it, honestly. You smush the bread under the custard with a spatula, then soak it all overnight (make room in the fridge! This can also just be for two hours!), cover with melted butter and coarse sugar in the morning, and bake it for half an hour until puffy, golden, and crispy around the edges. The pieces on the bottom of my casserole were pudding-like and gooey good, the pieces on top were crispier like cinnamon toast. A bite that combines both is sensational. Now let’s get to the presents.Get the recipe:French Toast CasseroleSet this up the night before and all you’ll have to do in the morning is brush it with butter and bake. The ultimate hands-off entertaining brunch dish.View RecipeExplore Bon Appétitholiday2018BreakfastBrunchFrench ToastPartyWeekend BrunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Alex Beggs"]}