{"id": "372ee9220356b1edec705687a55b91d2", "url": "https://www.bonappetit.com/recipe/chickpea-pancakes-with-greens-and-cheese", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Chickpea Pancakes With Greens and Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueChickpea Pancakes With Greens and CheeseBy Chris MoroccoFebruary 9, 20214.5(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThese cheesy, green-y, and utterly satisfying chickpea pancakes were inspired by Healthyish contributor Aliza Abarbanel’s favorite work-from-home comfort lunch. “I’ve filled these pancakes with just about every leftover in the fridge, from cooked greens to roasted mushrooms to marinated lentils, but melty cheese remains a constant,” she says. Gluten-free and packed with protein, chickpea flour pancakes come in many variations across the world, from Indian besan chilla to French socca to Italian farinata. If you don’t feel like or have time to make pancake batter during your lunch break (though we highly recommend it!) large flour or alt-flour tortillas work wonderfully as a substitute; just fold the cooked greens and cheese inside the tortillas and heat directly in the skillet to melt the cheese.Ingredients2 servings½cup chickpea flour3Tbsp. plus 4 tsp. olive oil, dividedKosher salt½medium red onion, thinly sliced4garlic cloves, smashed1cup brussels sprouts, thinly sliced1small bunch Tuscan kale or other kale, ribs and stems removed, thinly sliced2tsp. hot sauce, plus more for serving4oz. sharp cheddar, coarsely gratedPlain yogurt (for serving)PreparationStep 1Preheat oven to 350°. Whisk chickpea flour and ½ cup plus 2 Tbsp. cold water in a small bowl. Whisk in 1 Tbsp. oil and a pinch of salt. Let sit at least 10 minutes and up to 1 hour to allow flour to hydrate.Step 2Meanwhile, heat 2 Tbsp. oil in a large nonstick skillet over medium-high. Add onion, garlic, and brussels sprouts; cook, tossing occasionally, until softened and lightly browned, about 3 minutes. Add kale and cook, tossing often, until tender, about 3 minutes. Add 2 tsp. hot sauce, season with salt, and toss well. Transfer to a medium bowl; wipe out skillet.Step 3Swirl 1 tsp. oil in skillet to coat; heat over medium-high. Pour ¼ cup batter into center of skillet and swirl to form a thin 6\"–7\"-diameter pancake. Cook until well browned underneath and crispy around edges, about 2 minutes. Flip pancake and cook just until second side is lightly browned, about 1 minute. Transfer to a rimmed baking sheet. Repeat process with remaining batter and 3 tsp. oil to make 4 total. Divide vegetables between 2 pancakes and top with cheese and remaining 2 pancakes. Bake until cheese is melted, 6–8 minutes. Serve topped with yogurt and more hot sauce.How would you rate Chickpea Pancakes With Greens and Cheese?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThis recipe is wack. The filling is great! I loved it. But I could not make the chickpea pancake work out. I wish there were more tips on how to make it. I tried a few different things but they just got mushy and tore or burnt. Used corn tortillas at the last minute instead, which was really yummy. Genie. Chicago, IL1/4/2022Similar to the Cromlet recipe from 2017 - still one of my faves.  Equal parts flour of choice & liquid of choice, an egg, seasonings.JFoxyNY, NY12/25/2021The pancake mix was thick and sticky and would not spread anywhere or drip off anything. I kept adding more water hoping it would become a little more runny but it just stayed thick.  AnonymousAbroad12/20/2021Once you make the chickpea pancakes a few times it gets much easier.  I use whatever leafy veggies I have around - kale, broccoli rabe, spinach.  There's another recipe on here for chickpea pancakes which uses fennel, zaatar, and chickpeas which is also great.  Ale Italy 10/3/2021This is one of those recipes that looks kind of bland on paper but is actually really flavorful. Once you get the hang of the chickpea pancakes, it's also quick. I agree with other reviewers that having some of this filling in the fridge, even to eat with tortillas for lunch, is great.AnonymousGothenburg, Sweden9/24/2021I thought this dish was really flavorful and a good way to get a lot of veggies.  I didn't  make the chickpea pancakes, but instead used soft flour tortillas.  I also couldn't figure out how this was supposed to be assembled at the end [picture above really helps], so I did one flour tortilla and cooked it like a quesadilla.  I thought it was delish and so did my husband.AnonymousVienna, VA4/27/2021I'm making the filling for these a lot now, and putting it on corn tortillas or cassava tortillas. I don't care for the flavor of chickpea flour for some reason. But this filling is delish. Like another commenter, I grate manchego cheese to keep from using cow's milk cheese. If you use corn or cassave tortillas, lightly toast them first under the broiler. Donna in InwoodNYC4/1/2021Absolutely delicious!  Actually made these for dinner. My pancakes only got crispy around the edges but I do think I made them too thick. And completely versatile. We used brussels  sprouts and Swiss chard, with sharp provolone. Instead of hot sauce we used what little Calabrian chili sauce we had left and harissa. YUM! I have been in love with chickpea flour since having cecina (AKA, farinata) in Italy and this was such a great alternate use for the flour. Bonnie4/1/2021I cooked the pancakes over a very high heat and found that it helped them not fall apart. You still need to have the spatula firmly under the pancake when you take it out of the pan though, or they can tear. Caroline3/24/2021Love, love these.  I used broccoli rabe and kale.  Substituted manchego and sheep cheddar as I don’t eat cow dairy products.  It was fabulous for a lunch and I will try other veggies. Thank you.AnonymousNew York3/23/2021Very odd-- I had a really difficult time getting crispy pancakes that didnt tear when I tried to flip them or they were soft because I made them a little thicker to help with flipping.  The veggies were tasty, but I don't think I'd make this again.  Also took about an hour to put together, which was all of my lunch breakTinaNew Haven, CT3/16/2021This came together quickly and was tasty. Made it as is this time but it would be easy to make all kinds of different styles of filling as the author suggests. \nwill definitively make it again!Cécile3/15/2021The taste was great, but the fragile nature was frustrating. Thicker would be easier to handle but would be less crispy? I can't imagine being able to pick these up? I used knife & fork like it was FB omelette. Terri Victoria BC Canada 3/5/2021Wtf is this? Im so frustrated and annoyed. While this didnt taste bad, im just so confused by the concept. The pancakes also rip super easily l. No thanks. AnonymousPortland, OR3/5/2021Please make your recipies more printable...too much paper!!KarenCanada3/4/2021Explore Bon AppétitPancakeChickpea FlourFlourBrussels SproutVegetableKaleLeafy GreensQuickEasyWeeknight MealsMainVegetarianNut-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Chris Morocco"]}