{"id": "374163585780a91202cdfb2f1c03e80d", "url": "https://www.bonappetit.com/story/dreyfus-restaurant-toronto", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Dreyfus Restaurant in Toronto Is My Ultimate Dinner Date Location | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIf I Lived in Toronto, Every Dinner Date Would Be at Dreyfus Wine bars are my love language. By Aliza AbarbanelDecember 9, 2019FacebookTwitterEmailPhoto by Michael Graydon + Nikole HerriotFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I love going on dates at restaurants, but I hate “date restaurants.” You know, the ones with the dangerously drippy candles, an abundance of strip steak, and an all-jazz soundtrack. To me, it just feels forced. That’s not the case at Dreyfus in Toronto.Helmed by Zach Kolomeir, the former chef de cuisine at Montreal’s bacchanalian bistro Joe Beef, Dreyfus is an unquestionably charming, unquestionably diminutive French-ish bistro tucked inside a brick row house. The cozy space is imbued with Québécois flair, from the handwritten French menu (deciphered by amiable waiters for non-Francophones like myself) to the kitchen’s unrestrained use of butter.After perching at the bar and snagging a bottle of wine from the all-natural lineup, my partner and I happily ordered half the menu. It was summer, so we were especially spoiled: heirloom tomatoes on aioli-smeared challah toast, fried anchovies tossed with shishito peppers, and impossibly crisp pommes dauphine—a dangerous mix of mashed potatoes and choux pastry, deep-fried and served with sour cream and trout roe. It was too much. It was perfect.By the time 10 p.m. rolled around, I was completely sold on Toronto. (I’ll admit my mood was influenced by a few glasses of Beaujolais and the casually chic staff who scribbled down restaurant recommendations on the back of a menu for us in between opening bottles of Champagne for other guests.) And once I returned south of the border, I kept thinking about that meal. Canadian friends warn me that it’s easiest to love Toronto in the heat of summer, but I can’t help but imagine waiting out a winter storm at Dreyfus’s moodily lit bar. What could be more romantic than getting snowed in with a few plates of lobster salad and pommes dauphine as provisions?Go there: DreyfusExplore Bon AppétitHighly RecommendRestaurantsCanadaRead MorerestaurantsThe Restaurant at Pearl Morissette Offers a Tasting Menu for the Climate-Conscious EraBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-09", "author": ["Condé Nast", "Aliza Abarbanel"]}