{"id": "374673c465039bbbb772ae20bb1776b4", "url": "https://www.bonappetit.com/story/you-need-a-salt-cellar", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "A Salt Cellar Can Make You A Better Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGet a Salt Cellar, Become a Better CookA VIP ingredient deserves a VIP home.By Antara SinhaOctober 26, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.For experienced chefs and novice cooks alike, seasoning by hand is objectively better than reaching for a salt shaker full of caked iodized table salt that’s been sitting on the counter since the early aughts. Take it from cookbook author Cal Peternell, who is adamant when he says, “Using a salt shaker is a mistake.”To eliminate any over- or underseasoned cooking mishaps, you need a trusty salt cellar by your side. Reaching into a salt cellar and tangibly feeling how much salt you’re grabbing is not only more reliable (every shaker shakes different!), but also hones your skills as a cook. Over time you’ll gain a more intuitive sense of how to season your food to your own liking—two pinches of salt in three beaten eggs, a palmful in a pot of water for pasta, just a touch in the rice. (And not to reference a certain January 2017 meme, but there is something fun and dramatic about finishing up a meal with a flourish of the flaky stuff.)Creative Co-op Salt Glass$22 $19 at AmazonThere’s no need to make a fancy splurgeeither. Any vessel you can reach all five fingers into counts as a salt cellar in our book: A favorite short coffee mug, a 9th pan, a small shallow bowl, even a pint deli container would do the trick. As for a lid, that’s entirely up to you. You don’t necessarily need one, but it can be helpful in keeping out moisture (which can cause clumping) and preventing spills. Salt boxes often come with hinged lids that can be propped open when you’re actively cooking and closed for safekeeping all other times.ZERO JAPAN Salt Box$39 $37 at AmazonKeep your salt dish next to your stove. With salt readily accessible, you’re more likely to season as you go. Senior cooking editor Sarah Jampel advocates for two cellars: one by your side in the kitchen when you’re cooking and one at the dinner table. (If you’re looking for one that can solicit a compliment, we’re fans of this adorable Pottery Salt Pig from JQ Dickinson Appalachian Mercantile.)Photo by Isa ZapataPottery Salt Pig$45 at J.Q. Dickinson Salt WorksAs for what salt you should be stocking your salt cellar with, we strongly recommend coarse salt, whether it’s kosher or sea. Fine granules are tricky to grasp and likely stick to your fingers or make a mess.As one of the most frequently used ingredients in your kitchen, salt deserves to be in its own cozy home within easy reach, not relegated to an unceremonious corner in a shaker. Stock up on some quality salt, a nifty salt cellar, and get seasoning.Explore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-26", "author": ["Condé Nast", "Antara Sinha"]}