{"id": "3747b176683411357ad12ebc9cc259d4", "url": "https://www.bonappetit.com/story/make-ahead-mashed-potatoes", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Make-Ahead Mashed Potatoes Take One More Thing Off Your To-Cook List | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCheck One Thing Off Your Thanksgiving To-Cook List with These Make-Ahead Mashed PotatoesThe most perfectly light, velvety mashed potatoes you’ll ever make—two days ahead of time.By Alyse WhitneyNovember 16, 2018FacebookTwitterEmailFacebookTwitterEmailRing the alarm, I have a hot (potato) take! There’s no better way to screw up a perfectly good potato than to boil it and then pulverize it. Mashing it is simply the worst thing you can do. I don’t know about you, but every version of this dish I’ve ever eaten was either too gummy or too chunky, tasteless or under-seasoned—a solid C+ every time. Why have mush when you can have crispy-crunchy taters? Roasted potatoes and French fries exist, and thrive! I’m sure the mash method has “potential,” but rarely do I see any signs of it.The one exception? Our new make-ahead mashed potatoes, the most perfectly light, velvety mashed potatoes on earth. Chris Morocco developed the recipe to solve every problem that typically befalls the steaming pile—and right in time for Thanksgiving too. But he also did one better by making it so you can cook them days in advance. The approach is simple, but employs a few key tricks that make all the difference, so sit up, and pay attention.The first step is to cook the potatoes—we like yukon gold for their naturally buttery, creamy texture—skin-on in super salty water. Chris says the skins keep the potatoes from absorbing excess water, which is the enemy of a creamy mash, while allowing some of the saltiness to penetrate and give the tubers a jumpstart in flavor. He recommends tossing a solid handful of the Kosher stuff into a pot of cold water that just covers the whole potatoes by an inch, and then bring it to a boil so they all cook at the same rate.Once they’re tender—after about 30-40 minutes—drain any excess water, and let the potatoes hang out in the hot pot (off the heat) until they’ve dried completely. Why? Same reason: Water activates the potatoes’ starch and that leads to gumminess we really don’t want.This is Butter Insulation in action. Ricing potatoes is so easy that even Chris’s son, Alec, can can do it!\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThat’s also why Chris calls for a technique I like to call Butter Insulation. Essentially, the fat creates a barrier around the potato innards, so it won’t soak in any extra water from the dairy you’re about to add. All you have to do is put the unpeeled cooked tots and butter together in an old-school potato ricer, and push them through the perforated holes like its a giant garlic press. The whole vibe is a bit Play-Doh, but instead of a putty-like product, you get a cohesive mixture and the creamiest, fluffiest mash that’ll hold up way better to the abuse of reheating. (If you don’t have a ricer, you can also use a food mill fitted with a fine disk to the same effect.)Now if you’ve been skimming along with us, time to perk up! The order you add the next ingredients is important: First butter, and then warmed cream and milk. Starches start to bind at cooler temps, so hot liquid means less ”stiff mass” and more melt-in-your-mouth heaven. You add the cool sour cream last for a little tang and extra creaminess, and then all you have to do is taste for seasoning, maybe eat a few spoonfuls for quality control, and chill it until Turkey Day.A final stir in of sour cream makes things extra luxurious.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe day-of reheat is super straightforward: Stir the mash in a pot over medium-low heat with an additional ⅓ cup of milk and ⅓ cup of cream. If it looks liquidy, don’t worry! It will thicken into the perfect consistency as it stands in the serving bowl. Just make sure the mixture doesn’t boil, and stir often so the bottom of the pot doesn’t scorch.Spooning this mixture straight from the pot into my mouth, I had to revise my feelings on the mash. Truth is, now I’m actually tempted to make a batch in place of their crispier cousins, served alongside cold-weather meals like braised short ribs, stews, and pork roasts. Done the right way, creamy, buttery mashed potatoes are a damn good way to use a potato—especially when all the work can be done in advance.Get the recipe:Make-Ahead Mashed PotatoesThese creamy, glossy mashed potatoes can be made up to two days before the big night without losing their velvety texture.View RecipeExplore Bon AppétitPotatoholiday2018ThanksgivingMashed PotatoesRead Morerecipes41 Thanksgiving Potato Recipes We Can’t Live WithoutGallery41 SlidesBy Mehreen KarimrecipesOur 73 Best Potato Recipes, Just in Time for Carb SeasonGallery73 SlidesBy Mehreen Karimrecipes85 Thanksgiving Recipes You Can Make AheadGallery85 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Alyse Whitney"]}