{"id": "3756dec1cbeace679a0ef45dda4c6dd3", "url": "https://www.bonappetit.com/story/favorite-ways-to-make-coffee-at-home", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "The Best Ways to Make Coffee, According to Baristas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Ways to Make Coffee, According to BaristasPlus, their favorite tools for getting the job done.By Tiffany HopkinsFebruary 21, 2022FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When it comes to the best ways to make coffee, plenty of people have Strong Opinions on how it should be done, what gadgets are necessary or not, and what exactly constitutes a good cup. We’re here to say—let’s all take a breath. “The perfect cup of coffee is the one you enjoy,” says Areli Barrera de Grodski, co-owner of Little Waves Coffee Roasters and Cocoa Cinnamon coffee shop in Durham, North Carolina. We could pit the French press against the pour-over and debate which method is better all day, but the truth is, most baristas agree that you can brew great coffee with any method and any tools you have on hand. Whether you love the ritual of making your cup manually or you adore your automatic coffee maker, there’s no wrong method—but each has its pluses and minuses. We spoke to Barrera de Grodski and other coffee experts about their favorite ways to make coffee at home and how to improve your morning cup of joe, regardless of how you like to brew it.Drip Coffee MakerIf your household drinks a lot of coffee or you just want something that’s convenient and essentially foolproof, Barrera de Grodski believes that a solid batch brewer (a.k.a. drip machine) is the way to go. “I love the idea of pressing a button and making good coffee that’s well-balanced, slightly sweet, and so good that it doesn’t need milk or sugar,” she says. “I can easily achieve that with my batch coffee maker.” The flavor of your cup, she explains, will depend on the water you’re using, the ratio of grounds to water, and, of course, the type of coffee itself. For better coffee, start with freshly roasted beans and filtered water and use a scale to measure a coffee-to-water ratio of 1-to-16, or 16 grams of water for every gram of coffee. Note: This is a great starting ratio, but you can (and should!) adjust according to your preference.When it comes to making coffee at home, Sarah Elisabeth Huggins, co-owner of Daughter in Brooklyn, New York, is also on team automatic coffee machine: “I love my Moccamaster, and have no shame in filling it with Café Bustelo.” Baristas also recommend the Bonavita 8-cup Coffee Maker, which Barrera de Grodski likes specifically for its showerhead dripper, which evenly disperses the water onto a flat bed of coffee and allows for an even extraction.Bonavita 8 Cup Coffee Maker$150 at Bed Bath & Beyond$289 at AmazonTechnivorm Moccamaster 10-Cup Coffee Maker$319 at Food52$340 at AmazonThe French PressIf you’re into rich, full-bodied coffee, then the French press is for you. This method brews by soaking ground coffee directly in hot water—sans filter—rather than letting water pass through the grounds. Aki Yaguchi, head barista at Migrant Coffee in Melbourne, Australia, likes this method for its robust flavor: “Since the water sits in contact with the coffee for longer without a filter, the results are more well-rounded with bolder, richer flavor,” she says, “It’s creamier and less watery.”Here’s how it works: Pour the grounds into the carafe, fill it with hot water, and stir it to make sure all of the coffee is properly saturated. Wait four minutes, put the lid on, and slowly depress the plunger to isolate all of the grounds at the bottom of the carafe.For the best results, use a coarser grind (Yaguchi loves her Porlex Mini Stainless-Steel Coffee Grinder) and make sure your water isn’t too hot. These factors play a big role in brewing coffee that isn’t under- or over-extracted. “I think there’s this misconception that coffee has to be at boiling point, but you want it to be at roughly 194°F to properly extract the flavors and not burn the coffee.” If you’ve heated your water to a boil, let it sit for a minute to cool down before brewing. And once the coffee has finished brewing, decant it into a mug as soon as possible instead of letting it sit in the French press so it doesn’t become over-extracted.Bodum Chambord French Press$40 at Target$40 at AmazonThe Pour-OverIf you want a delicate, lighter-bodied coffee that gives you (almost) complete control over the flavor of your cup, then you’ll appreciate a classic pour-over coffee. It’s made by placing a simple filter cone over a coffee cup or carafe, filling that filter with ground coffee, and then pouring hot water over it and letting it drip through. It’s a favorite among baristas, and it’s the method Huggins turns to when she wants to delicately extract all of the coffee’s tasting notes. “With a pour-over, you have the paper filter that removes some of the heavy oils. You have control over the speed of the pour and how many rounds of pouring there are,” says Huggins. “I like having that level of control.”With pour-overs, it’s even more important to make sure you’ve got the right grind size, water temperature, and coffee-to-water ratio. Baristas recommend using a burr grinder (manual or electric) and a gooseneck kettle for better precision. “The grind size will determine the brew time,” says co-owner of Daughter Brian Stoothoff, “If the coffee is taking too long to come down, the grind is too fine—if the water is flowing too fast, it’s too coarse.” A brew time that’s too fast will lead to coffee that tastes salty and sour, while a longer brew time that’s too slow will lead to coffee that tastes bitter, ashy, and burnt. “You want to hit that sweet spot for balanced acidity, bitterness, and sweetness,” says Stoothoff. “Shoot for between two and a half and four minutes.” The method takes a little patience and practice, but once you’ve got it down it becomes a no-brainer.Hario V60 Pour Over Coffee Starter Set$22 at AmazonKalita Ceramic Coffee Dripper$19 at AmazonChemex Coffeemaker$47 at Amazon$50 at Sur La TableThe AeropressThe Aeropress is a favorite for coffee lovers on the go. This compact brewing device acts in the same way that a syringe does, with a plunger forcing hot water and grounds through a filter and straight into your cup. Coffee brewed in an Aeropress boasts a super-quick brew time and is generally smooth with low acidity. Some people claim that the Aeropress turns out single-serve coffee that’s as strong as espresso, since technically you’re brewing it under pressure, but actually that isn’t possible. No matter: It’s compact and lightweight enough to bring just about anywhere you go. “It’s a great device for beginner coffee makers who are brewing a single cup. It’s so simple to use and easy to clean,” says Huggins.Aeropress Coffee Maker$30 at Amazon$30 at Bed Bath & BeyondEspresso MachineIf you like extremely strong coffee and espresso-based drinks (and have extra counter space and the money to spend)—then you may want to consider getting an espresso maker. In this brewing method, a small amount of hot water is forced under a large amount of pressure through finely-ground coffee beans, which results in a super concentrated coffee. The high pressure also speeds up the extraction and brewing process to between 20 to 30 seconds, so you have a shorter period to hit that flavor extraction “sweet spot.” Of all the popular coffee brewing methods, espresso takes the crown for being the most finicky, so use a burr grinder and scale and familiarize yourself with your machine.“When making an espresso, your grinder is your biggest point of control,” says Huggins. “When making espresso at the shop, I’m constantly tweaking the grind dose and grind size.” If your espresso doesn’t taste good, those are the first two variables to play with.Gaggia Classic Pro Espresso Machine$449 at AmazonBreville Bambino Plus Espresso Machine$500 at Bed Bath & Beyond$598 at AmazonThe Moka potIf you want to make strong coffee but don’t feel inclined to purchase an espresso machine, the Moka pot (a.k.a. stovetop percolator) is for you. Like with espresso, boiling water—pressurized by steam—is passed through ground coffee, and the result is rich, flavorful, and highly concentrated. When Yaguchi isn’t using her French press, she’s reaching for her Moka pot: “It does take a little more attention and practice, but using a Moka pot is a fun, somewhat whimsical experience.”Bialetti Moka Pot$40 at Target$40 at AmazonCold brewPrefer your coffee over ice? Cold brew is made by soaking coffee grounds in cold or room temperature water for 16 to 24 hours. It’s a slow extraction method, and the result is a smooth, heavy-bodied coffee. You can use a large mason jar and a sieve, but Yaguchi loves the Toddy Cold Brew System, which creates a concentrate that’s less acidic. All you have to do is fill the Toddy with coffee and water, refrigerate it overnight, and extract the concentrate the next day. When you’re ready to drink, pour it over ice and dilute it with three parts water. “It makes a really delicious, strong cold brew,” Yaguchi adds.You can also flash-brew iced coffee by making regular coffee or coffee concentrate, then pouring it over ice. Barrera de Grodski also recommends the Coldwave Beverage Chiller, which cools hot beverages to room temperature in minutes. “Essentially, you create a regular brew and instantly make it cold without diluting it—and you don’t have to make a concentrate,” she says.Toddy Cold Brew System$40 at AmazonColdwave Beverage Chiller$40 at AmazonWhile you’re here, check out the rest of our Coffee Week recipes, product recommendations, and brewing techniques:This Reusable Coffee Filter Means I Never Worry About Running OutThe Coffee to Water Ratio That Makes a Perfect BrewThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeYou Should Add Spices to Your Coffee GroundsExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-06", "author": ["Condé Nast", "Tiffany Hopkins"]}