{"id": "375ec69ff692aa564635fc90b099c370", "url": "https://www.bonappetit.com/recipe/salsa-de-molcajete", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Salsa de Molcajete Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalsa de MolcajeteBy Bricia LopezMarch 15, 20214.1(9)Read ReviewsTriangleEmailPinterestPrintPhotos of Oaxaca: Home Cooking from the Heart of Mexico courtesy of Quentin BaconEmailPinterestPrintEmailPinterestPrintSalsa de Molcajete, which translates to “salsa made in a stone mortar” (an essential piece of cooking equipment in Mexican households), is an irresistible sauce that is an iconic part of Oaxacan cooking. Tangy, smoky, and just a touch spicy, my simple version—made with charred tomatoes, jalapeños, garlic, and salt—is an example of how just a few ingredients can transform into something truly spectacular. Everyone has their own twist; salsas like this are about having fun and finding your own sazón (flavor). If you want to up the spice level, try subbing serranos for the jalapeños. Just be sure you pick good tomatoes because that will determine the sweetness and acidity—heirlooms work perfectly because of their meatiness. Making this salsa in a molcajete gives it a truly traditional flare, but you can use a food processor to get the same delicious result. Put it on fried eggs for breakfast or spoon it over any dish that you think needs a little extra flavor boost. It will stay fresh for up to a week. IngredientsMakes about 2 cups6small heirloom tomatoes (about 1½ lb.), cored, halved½small onion, peeled, quartered3garlic cloves, peeled3small jalapeños, stems removedKosher saltPreparationStep 1Heat broiler. Place tomatoes, onion, garlic, and jalapeños in a roasting pan or on a large rimmed baking sheet and broil until charred on top, about 4 minutes. Remove from broiler and turn vegetables over. Broil until other sides are charred, about 5 minutes. (Watch the garlic carefully and remove earlier if needed.)Step 2Transfer vegetables to a molcajete and mash into a coarse purée; season salsa with salt.Recipe adapted from Oaxaca: Home Cooking From the Heart of Mexico by Bricia Lopez and Javier Cabral. Published in 2019 by Abrams, an imprint of ABRAMS. All rights reserved. Copyright © 2019 Bricia Lopez. Photographs copyright © 2019 Quentin Bacon. Cover © Abrams.\n\nBuy on Amazon or BookshopHow would you rate Salsa de Molcajete?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe traditional way to cook this in Mexico is on a charcoal or wood fire. Not only is it traditional, but it tastes best that way due to the added smokey flavors. Gas couldn't do that even if it wanted to. You are probably not going to light up the charcoal grill just for this dish, but if you are cooking some protein already it's easy to grill the tomatoes, onions, peppers and even the garlic on the side (use a wire basket for the latter). Sometimes adding a splash of water is necessary to get the right consistency. Yum!Will TriggsSan Francisco11/18/2021I made this several months ago (it's in Bricia's cookbook!) and it was fantastic. Roasting the veggies really brought out so much flavor and I loved how simple it is. SarahIN3/15/2021Explore Bon AppétitSalsaCondimentOaxacanMexicanLatin AmericanJalapeñoChileVegetableOnionHeirloom TomatoTomatoQuickEasy5 Ingredients or FewerSnackStarterVeganVegetarianDairy-FreeGluten-FreeNut-FreeBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-15", "author": ["Condé Nast", "Bricia Lopez"]}