{"id": "3764f00ab0c662613649f1d4a352001f", "url": "https://www.bonappetit.com/story/tawakal-halal-cafe-boston", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Tawakal Halal Cafe Is the First Place I Go After Landing at Boston Logan Airport | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Second I Land at Boston Logan Airport, I Head for Tawakal Halal CafeFlaky chapati FTW.By Emily SchultzAugust 14, 2019FacebookTwitterEmailPhoto by Yahya Noor / Tawakal CafeFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I arrived at Tawakal Halal Cafe, I could still smell engine fuel. That’s how close it is to Boston Logan Airport. But I quickly forgot about my proximity to TSA (shudder) as I sat down at this family-run cafe, with sunny yellow walls and handmade trinkets from Somalia placed in every nook and cranny. Chef and owner Yahya Noor welcomed me like I was in his own home and was delighted to explain every dish on his menu once he found out I had never tried Somali food before. Noor was born on the southern coast of Somalia and was raised in a family that loved to cook. He landed in Boston in 1998, after fleeing his country at the start of the ongoing civil war. Now he keeps his family’s cooking traditions alive through Tawakal, which only recently reopened after a seven-year hiatus.Photo by Timna NwokejiEverything was downright comforting. There’s sambusa, a crispy fried dough filled with coriander, cumin, and cardamom-spiced beef and slightly caramelized onions; chapati, the super flaky flatbread found mostly in Central and South Asia, served with luscious chickpeas and spinach and fragrant basmati rice; and the biryani with fatty, fall-apart-tender goat. But the dish that I still think about to this day, the one I sometimes look through my phone to find and admire all over again, is the Tawakal Plate. It starts with crisp chapati, cut into strips and cooked in a tomato stew with tons of aromatic spices, spinach, and bell peppers. Then it’s loaded with incredibly juicy chicken that’s neon-orange due to the addition of turmeric and paprika. The result is a crispy-gone-soggy masterpiece that takes you on such an epic journey through sweet and spicy flavors and bouncy, shreddy, crunchy textures that you’ll forget all about the nerves-ridden one that got you here in the first place.Go there: Tawakal Halal CafeExplore Bon AppétitHighly RecommendBostonAfricanRestaurantsRead MoreLifestyleLauren Friel Is Making Boston Drinking Culture a Little Less Bro-yBy Meghan NesmithRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-14", "author": ["Condé Nast", "Emily Schultz"]}