{"id": "379be931d1ae080e18b83ba9e95e2a64", "url": "https://www.bonappetit.com/story/daily-rewards-are-a-necessary-pleasure", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Daily Rewards Are a Necessary Pleasure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDaily Rewards Are a Necessary PleasureBy Peet's Iced EspressoJune 18, 2019FacebookTwitterEmailFacebookTwitterEmailBuzz, ding, beep-bloop: the emails from your boss are coming in fast and furious, your little brother’s texting you, and you’ve only got five minutes to scarf breakfast and get to your first meeting. Life can be hard—and nobody’s going to greet you with the medal you deserve for making it on time and with your shirt on right-side-out.But we, as humans, still need rewards. It’s important to celebrate all of our successes, whether that’s drawing a huge crowd for a performance or simply drawing on the perfect eyebrow. Rewards reinforce good behavior and combat burn-out by incentivizing good habits—it turns out you can bribe yourself into doing a better job at life.The rewards don’t need to be any grand gesture—you don’t want to do anything that blows you off track, like a shopping spree to celebrate your excellent budgeting. It can be as simple as doing something to put a smile on your face without disjointing your day. Nothing expensive, nothing fancy: simply a routine of rewards you create just for always being awesome. Here’s how:Start by watching a funny video: Cue up the trailer for that new comedy everybody’s been talking about, cue up this hilarious clip of comedian, Iliza Shlesinger, facing off against a hotel door, or just re-watch that viral video of one dog hiding under another dog a thousand more times. Laughter is the best medicine but it’s also the best reward for the same reasons: it relieves stress, stimulates your organs, and improves your mood.If you’re looking for something a little stronger, have a drink. No, we’re not suggesting you crack a beer at work, but it’s totally acceptable to grab a Peet’s Iced Espresso and let the rich, creamy drink wake you up—and cheer you up. It’s made with carefully sourced ingredients, including single-origin dark roast Colombian espresso, pure cane sugar, and hormone-free milk and with less sugar than competitors and no artificial colors or flavors. It’s the kind of easy reward you can drink every day, and you'll find it at most convenience and grocery stores in a right-sized eight-ounce can, perfect for telling yourself, “Congratulations on making it through another morning.”For those particularly hectic days, you can reward yourself by simply doing nothing. Give yourself the gift of zero activity (physical or brain) for 5 minutes without guilt. Grab a seat in the sunshine or just pop on your noise-cancelling headphones at your desk, and let your mind drift away from what’s next at work, family obligations, and your never-ending to-do list. Let it wander only into vacations, flower fields, and exciting weekend plans; create the space for all the happy thoughts that you usually push aside—consider it a thank you for all the thinking your brain has done today.Get a little help in pushing the real world away for a second by spritzing yourself. Good smells and moisturized skin are two things that make everybody happy, and facial sprays will perk up your nose and your skin. Even if you don’t have time for the other quick options here, it only takes a few seconds to use these. A little four-ounce bottle will slip right into a purse or desk drawer, and they come in a variety of aromas that you can tailor to your needs—lavender is known to be stress reducing, while peppermint can cheer you up. And on top of the instant refresh for your skin and mood, you can also feel good about staying moisturized.Life is hard, especially when no one else gives you the praise and compensation you deserve. But there’s no need to save that reward for a special day—after all, you made it out of bed today, you deserve a prize.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-17", "author": ["Condé Nast", "Peet'S Iced Espresso"]}