{"id": "37a4cef8591491499170cf0ed39ba252", "url": "https://www.bonappetit.com/story/bell-and-evans-spatchcocked-chickens", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Bell & Evans Now Sells Spatchcock Chickens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBell & Evans Just Made All Our Spatchcocking Dreams Come TrueYou can now get a whole, spatchcocked bird at your grocery store. That means ultra-crispy chicken skin ridiculously quick.By Emma WartzmanFebruary 21, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf I had a dollar for every time someone at Bon Appétit raved about a spatchcocked chicken, I’d be a wealthy woman. Add to that our enthusiasm for deploying the technique on a Thanksgiving turkey, and I might just quit my day job. But even after years of hearing all that’s good and glorious about the flattened, backbone-less version of the bird, I never thought to try it at home. That’s because I shop at a regular grocery store and not a specialty butcher shop, where a butcher with knife skills that I do not possess can remove said backbone for me.Then, the other day, Adam Rapoport, the editor in chief of this very publication, saw BA contributor Alison Roman’s Instagram Story showing that Bell & Evans is now selling spatchcock chickens in ready-to-go, vacuum-sealed packages at, yep, regular grocery stores. This seemed like a very good reason for me—a leisurely Sunday night roast chicken enthusiast—to cook one and find out for myself what all the hype is about.As I came to learn, the virtue of the spatchcock lies in two very important things: time saved, and the crispiest of crispy skins.“With a whole chicken, crispy skin is actually a myth,” senior food editor Chris Morocco says. “In an ideal world, it’s evenly, beautifully browned, but the ambient heat of an oven is just not going to make it crispy.” With spatchcocking, he explained, the bird has gone from being three dimensional to a (fat) two dimensional, which means more of it can get contact with the heat source: a piping hot cast-iron skillet sitting atop a direct flame. It helps that a second (smaller) skillet—or a brick, or a stone, or whatever oven-safe heavy object you have on hand—is putting extra pressure on the bird to keep all that skin against the pan the whole time.Thanksgiving will never be the same.\nThe other advantage is that the entire cooking process takes about half the time. It gets about 15 minutes on the stove and then, flipped to the other side (and lose the extra skillet), 20 minutes in the oven. I was worried about the chicken drying out with no backbone in it, but Chris says there’s actually less of a chance that will happen. “You get pretty much all of the browning on the stovetop,” he explained, “so once it goes into the oven, you’re just controlling for internal temperature.” (You have an instant-read thermometer, right?) There’s none of that fine-line balancing that happens when you’re trying to push your roast chicken to be its most golden self all while keeping it extra juicy on the inside.Suddenly, making a whole bird on a weeknight becomes possible. (Just remember to aggressively salt the chicken and let it sit out at room temp for about a half an hour first to draw out the moisture. An hour is even better. Twenty-four hours uncovered in the fridge is even more ideal if you like to plan ahead.) Don’t get me wrong though: There’s still a place in my heart for a totally time insensitive Sunday roast. But a quick post-work stop at the market and less than an hour of cooking time? Wednesday night chicken dinner, here I come.Get the recipe:Chicken Under a Skillet with Lemon Pan SauceThe flatter the chicken, the more contact with the cast-iron pan and the more crackly skin to enjoy at the end.View RecipeExplore Bon AppétitChickenWeeknightRead MorecookingI Learned Some Lessons Spatchcocking a ChickenBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Emma Wartzman"]}