{"id": "37bed41391bebd6cbbffa183574e784a", "url": "https://www.bonappetit.com/story/boulted-bread", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "I Ate My Weight in Carbs at Boulted Bread in Raleigh, NC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Went To Raleigh for Four Days and Ate at Boulted Bread Four TimesJust try and stop me from eating all the grits bread and rye loaves and rutabaga turnovers and...By Alex DelanyMay 13, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Most people quantify love by how happy something makes them. I tend to quantify love by how angry I get.I recently spent four days in Raleigh, NC, and during my stay, I ate at least one baked good from Boulted Bread on each of those days. (At my most severe, it was four pastries and a loaf in a single 24-hour period.) Three days into my relationship with the bakery, I was sitting on its small, sun-lit patio, staring at a loaf of levain, earnestly whispering, “I love you,” to the soft webs of tangy sourdough spreading from crust to perfectly crunchy crust. A voice inside my head warned that I was moving too quickly, that I should take things slow.But the intense flavor of the house-milled flour was too overwhelming to ignore. Fantasies of sliced grits bread fried in butter replayed over again in my mind. I could not take my eyes off a dense rye loaf. The pastries that baker Josh Bellamy pulls out of the oven are just as intoxicating. I thought that lamination this expertly executed was reserved only for vintage cookbook illustrations and fairy tales, but each buttery layer of dough in the raspberry jam pinwheel and rutabaga turnover was so pronounced and deeply browned that they might as well have doubled as textbook-perfect sedimentary cross sections. My everything bagel spiced croissant eating experience was audible. Shards of flaky pastry exploded over the table with each bite. I am not exaggerating when I say it was the best I ever had.If you find yourself in Raleigh, I offer this tale as both encouragement and warning. Because ever since I’ve been back in New York—a place, mind you, with no shortage of extremely talented bakers—the sun seems to be shining a little less brightly, and it’s all because I can’t find any gluten that I enjoy as much as I did the spread at Boulted. I am truly madly deeply in love everything that’s baked there, some 500 miles from where I wake up each day. And for that, I am pissed.Go there: Boulted BreadExplore Bon AppétitRaleigh, NCRestaurantsHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-13", "author": ["Condé Nast", "Alex Delany"]}