{"id": "37c21cd07430cb15394db108003f5c48", "url": "https://www.bonappetit.com/story/how-to-freeze-tomatoes", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Here’s How to Freeze Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Freeze Tomatoes Without Totally Changing Their TextureDo your dead-of-winter self a favor.By Grant MeltonAugust 13, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailHaving never gone to culinary school or worked the line in a restaurant, I often find myself learning about food the hard way. When I landed my first gig as an assistant food stylist, one of those learn-from-my-mistakes moments happened when I stored tomatoes in the walk-in refrigerator of the TV studio kitchen where I worked. Whoopsies! Turns out cold boxes can be a “tomb of death” for tomatoes, transforming them from delicious, photogenic beauties to wrinkly, mealy messes not exactly ready for their close-up (or for your sandwich).But having grown up in a three-freezer household, my instincts tell me that whenever I can score a deal, I should buy extra. And when tomatoes are in their prime, they’re also at their most affordable. So if you can’t refrigerate tomatoes, what can you do?It turns out that even though refrigerating tomatoes is terrible, freezing them is totally doable with one clever trick. Since tomatoes are made of mostly water, you can’t freeze them as is, BUT if you dry them out prior to freezing, it protects their structure, preserves their flavor, and stocks your freezer full of their sunshine all year long. And you don’t even need a fancy dehydrating contraption to do it.First, set your oven to 225° F. Line a sheet pan with parchment paper and place a wire cooling rack over the top.Next, slice a bunch of tomatoes in half. I like to use cherry or grape tomatoes because they dry out more quickly, but you can do this with any variety of tomato. Keep in mind, the bigger the tomato, the longer it’ll take to cook. (This trick will help you slice through three pints of small tomatoes fast.)Arrange the tomatoes cut side up on the cooling rack and season them. I recommend keeping it simple with just salt and pepper, but if you want to add spices, chopped garlic, or dried herbs, go for it. I might prefer to-may-to, you might prefer to-mah-to. The good news is that either is great on a cold December night.Cherry or grape tomatoes will take about three hours to dry out. You’ll know they’re done when they’re pruning up (think fingertips approximately one hour into a hot bath) and have shrunk to about half their original size. Allow the tomatoes to cool completely.Once cool, dump them onto the parchment paper and place the entire sheet tray in the freezer. Once they’re fully frozen (I like to leave them there overnight to be safe, but four hours oughta do it), place the frosty tomatoes into a ziptop bag and put them back in the freezer.Three hours later…\nPhoto by Chelsie Craig, Food Styling by Pearl JonesSidebar: This tray-first, bag-second method is great when you freeze berries or blanched veggies too. It prevents everything from freezing in a big clump, making your produce easier to cook with later.But back to the topic at hand. To use the tomatoes (try to wait until the temperature has dropped and you really need some tomato treatment), remove however many you’ll be using from the bag and let them thaw at room temperature for about an hour. The thawed tomatoes will be slumped and slightly wetter than when they were frozen. If you want to give them a pat dry before using them, go for it, but either way their incredible concentrated flavor will remain.You can use the tomatoes however you’d like: tossed with cooked spaghetti, olive oil, and a flurry of parm for a super riffable pasta supper, assembled into a caprese, scattered on top of pizza. But my personal favorite is sandwiched into a middle-of-winter BLT, with each bite tasting as bright as the summer sun.Grant Melton is an Emmy Award–winning culinary producer, food stylist, and recipe developer who’s favorite food is chocolate chip cookies (salted, obviously).Explore Bon AppétitTomatoFreezingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-13", "author": ["Condé Nast", "Grant Melton"]}