{"id": "37c5dbd75b6f5c553b7287c87cee5cc5", "url": "https://www.bonappetit.com/recipe/churros-with-bittersweet-chocolate-sauce", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Churros with Bittersweet Chocolate Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChurros with Bittersweet Chocolate SauceBy Rick MartinezSeptember 4, 20214.3(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Styling by Judy ManciniEmailPinterestPrintEmailPinterestPrintDusted in cinnamon-sugar, plunged into a rich chocolate sauce, and served with Mexican Hot Chocolate, there is no incorrect time of day for churros. Precision is crucial in this recipe, starting with the shape of the pastry tip used to pipe the eggy batter through on its way into hot frying oil. If the tip isn’t rounded or in a star pattern, the churros may break as you’re frying them (we used size 845 tips). Keep in mind that if you’re using a tip with a wider or narrower opening, the cook times may vary. And, no matter the size, be careful to not crowd the pan because the dough will expand as it fries. Finally, the type of sugar you toss the churros in just before serving matters, too. Conventional granulated is too fine (it can get clumpy) and raw sugar is too coarse (it won't stick to the churros) so recipe developer Rick Martinez recommends using organic unrefined cane sugar, which offers the right amount of texture and a little warm, molasses flavor, thanks to how it’s processed. Watch Rick break down how to make this churros recipe in this helpful video.Editor’s note: This recipe was originally published on May 1, 2017.IngredientsMakes about 26Chocolate Sauce½vanilla bean, split lengthwise1cup heavy cream5tablespoons dark brown sugar1tablespoon unsweetened cocoa powder1teaspoon espresso powder⅛teaspoon kosher salt3ounces unsweetened chocolate, choppedChurros1tablespoon ground cinnamon (preferably Ceylon)1tablespoon plus 1 cup organic sugar½vanilla bean, split lengthwise½cup milk6tablespoons unsalted butter1teaspoon kosher salt1cup all-purpose flour3large eggsVegetable oil (for frying; about 12 cups)Mexican Hot Chocolate (for serving; optional)Special EquipmentA pastry bag and a large closed star tip; deep-fry thermometerPreparationChocolate SauceStep 1Scrape vanilla seeds into a small saucepan; discard pod. Add cream, brown sugar, cocoa powder, espresso powder, and salt and cook over medium-high heat, whisking occasionally, until sugar is dissolved, no lumps of cocoa powder remain, and mixture is simmering, about 4 minutes. Remove from heat and add chocolate, stirring to melt. Keep warm over very low heat until ready to serve.ChurrosStep 2Fit pastry bag with star tip. Whisk cinnamon and 1 cup organic sugar in a medium bowl; set aside.Step 3Bring vanilla bean, milk, butter, salt, remaining 1 Tbsp. organic sugar, and ½ cup water to a simmer in a medium saucepan over medium-high heat. Using a wooden spoon, add flour in one go, and vigorously mix until dough comes together, about 30 seconds. Transfer to the bowl of a stand mixer or a large bowl; discard vanilla bean. Let cool slightly.Step 4Using a stand mixer fitted with the paddle attachment on medium-low speed, add eggs to dough, one at a time, making sure to incorporate each egg before adding the next (alternatively, stir vigorously with a wooden spoon). Dough will look broken at first; continue to beat, scraping bowl occasionally, until dough is smooth, glossy, and somewhat stretchy (pull off a small piece of dough and stretch it—it shouldn't break). Spoon dough into prepared pastry bag.Step 5Pour oil into a large pot to come halfway up the sides. Fit pot with thermometer and heat over medium-high until thermometer registers 350°. Holding bag at an angle so tip is a few inches above surface of oil, squeeze out dough, moving the bag as you squeeze so dough is piped in a 6\" length into oil. Using a paring knife, cut off dough at the tip to release into oil. Repeat process to make 4 more dough lengths. Fry churros, turning once and adjusting heat as needed to maintain oil temperature, until golden brown on all sides, 2–3 minutes per side. Transfer to a paper towel-lined baking sheet. Repeat with remaining dough.Step 6Toss warm churros in reserved cinnamon-sugar mixture. Serve with warm chocolate sauce and hot chocolate, if desired.How would you rate Churros with Bittersweet Chocolate Sauce?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleWould anyone know if the churros dough can be put into the pastry bag and refrigerated, then taken out a little before making? Want to make before a party so I am not doing this recipe at the last minute....thanks in advance(Spelling error in prior ask :( )JadzaNYC9/2/2020Would anyone know if the churros dough can be put into the pastry at and refrigerate, then taken out a little before making?\nWant to make before a party so I am not doing this recipe at the last minute....thanks in advanceJadzaNYC9/2/2020Made this churro recipe seemed to fry up nicely but we couldn’t get the sugar mix to stick to it. We did it straight from the frying pan warm, with and without the paper towel stepAnonymousCalifornia 8/3/2020Just made these tonight and they were perfect! Crispy on the outside, lovely and soft on the inside ^_^\nMy family loved them and I will definitely be  making them again. Thank you, Rick! :DNajlaaLondon4/17/2020You still have not corrected the ingredient list for the half cup of water. It is a must for this recipe to work. Please correct it so this recipe is as correct as he made them!!!! This was brought up nearly 1.5 yrs ago and you still haven't fixed it. ☹️Melanee MortensenColorado4/10/2020Amazing recipie! Easy to make and it is delicious. My family loved this recipe and I'll definitely do it again. l_deniauFrance 3/28/2020Caution: Do NOT use a Closed star pastry tip! With this type of tip when you pipe out the dough, it turns it into a bunch of thin squiggly lines that are very loosely held together. It totally ruins the texture as they fry up immediately and you don't get the custrady inside since they're so thin. Use a regular, open, star pastry tip instead. I almost bought the open tips instead as it seemed odd to use closed tips, but I went with what the recipe said since they stressed using closed and not open. They are completely wrong and need to reassess what open vs. closed tips mean and how they're labeled in the store. The fried shoe string that resulted from the inaccurate tip directions tasted fine but they're  not churros with how thin and crispy they are. BA please adjust the equipment recommendations here and convert the recipe into weighted measurements instead. These will greatly help increase positive results with this recipe.AnonymousVirginia12/25/2018Love this recipe, Delicious and I'll definitely make it again!\n I notice that the ingredients don't mention the 1/2 cup of water in the making of the churros, did I miss something?\nI did find that scissors were a little easier to use when cutting the churro from the piping bag, but not too much better as it will still stick a little as it does with a knife.\nAlso is there any way we could have metric as it's a little more reliable, thank you ^_^CallumScotland 12/1/2018Would this recipe would work with soy milk (or any other non dairy milk in the batter)?AnonymousOgden, UT11/5/2018Explore Bon AppétitPastriesDessertSpanishEuropeanChocolateOther IngredientsNut-FreeDeep-fryBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-01", "author": ["Condé Nast", "Rick Martinez"]}