{"id": "37daa12fd03260b9aeb61f0b06031aa0", "url": "https://www.bonappetit.com/recipe/beef-hot-links-with-chowchow-and-gold-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Beef Hot Links With Chowchow and Gold Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueBeef Hot Links With Chowchow and Gold SauceBy Omar TateJune 2, 2020EmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintOmar Tate, chef-owner of the pop-up dinner series Honeysuckle, dresses up store-bought Johnsonville beef hot links with a mustard-and-spice packed Carolina gold sauce and garlicky quick-pickled chowchow, which he makes himself or buys from Wanda’s Cooking. Stacks of squishy, untoasted white bread go on the side—a kind of edible plate ideal for soaking up flavor.Ingredients8-10 servingsChowChow4garlic cloves, smashed2cups apple cider vinegar½cup granulated sugar¼cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt½small head of cauliflower, cut into ½\" pieces1medium red bell pepper, ribs and seeds removed, cut into 1\" pieces1medium green bell pepper, ribs and seeds removed, cut into 1\" pieces4celery stalks, sliced 1\" thick1medium carrot, peeled, sliced ½\" thickSauce and assembly1Tbsp. vegetable oil½medium onion, thinly sliced1garlic clove, smashed1tsp. ground ginger½tsp. cayenne pepper1cup low-sodium chicken broth¼cup apple cider vinegar¼cup Dijon mustard¼cup (packed) dark brown sugar2Tbsp. unsalted butter2tsp. hot sauce1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt212-oz. packages beef hot links12slices white breadPreparationChowchowStep 1Bring garlic, vinegar, granulated sugar, salt, and 2 cups water to a boil in a medium saucepan. Add cauliflower, bell peppers, celery, and carrot and simmer until crisp-tender, 6–8 minutes. Let cool. Cover and chill in pickling liquid at least 12 hours.Step 2Do ahead: Chowchow can be made 3 weeks ahead. Keep chilled.Sauce and AssemblyStep 3Heat oil in a medium saucepan over medium-high. Cook onion and garlic, stirring occasionally, until tender, about 3 minutes. Add ginger and cayenne; cook, stirring, until fragrant, about 30 seconds. Add broth, vinegar, mustard, and brown sugar. Bring to a simmer; cook until flavors meld, about 5 minutes. Let cool 10 minutes.Step 4Transfer to a blender; purée until smooth. With motor running, add butter 1 Tbsp. at a time; blend until sauce is thick and glossy. Add hot sauce and salt.Step 5Prepare a grill for medium-high heat. Grill links, turning over halfway through, until heated through, about 4 minutes. Transfer to a platter. Serve with sauce, bread, and chowchow.How would you rate Beef Hot Links With Chowchow and Gold Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitSouthernAmericanBeefMeatSummerMainGrillingJuneteenthDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Omar Tate"]}