{"id": "37dc86e0f0281f540dfab4900a447533", "url": "https://www.bonappetit.com/story/bloom-your-spices", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Blooming Spices is the Key to Getting the Most Flavor From Your Ground or Whole Spices | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Not Blooming Your Spices, You’re Missing Out on Big FlavorThe big bloom theory.By Sarah JampelMay 20, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat BoytsovaFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.Raw spices are like shy friends: It takes a little effort to draw them out of their shell to see their true colors. Toasting your spices in dry heat is a good start (a friendly wave, if you will), but frying those spices in oil or ghee is the ultimate ice-breaker. Also known as chhonk, tadka, vaghar, or tempering, among other names, blooming spices in fat is a South Asian cooking technique that brings the complex aromas to their fullest expression. This is because many of the flavor compounds found in spices are fat-soluble and because fat coats the tongue, bringing those aromatic compounds into contact with your taste buds for a longer period of time, like a powerful hug.Blooming spices turn whole seeds crunchy and make ground spices toasty, and on top of all that, it also leaves you with an infused oil that you can use to add a flavor boost to nearly anything, from popcorn to boiled potatoes to a ripe avocado. Priya Krishna’s khichdi is finished dramatically, doused in cumin and chiles sizzled in ghee.To do it, start by heating 2 Tbsp. ghee or oil over medium-low heat. Then add ground spices or any you’d happily eat whole (like cumin/mustard/crushed coriander seeds), as well as other aromatics like sliced garlic, curry leaves, bay leaves, dried chiles, or lemon peel, and cook until the spices sputter and smell—this will be only a matter of minutes, so stay close by. Pour over roasted/sautéed/steamed veg, use it to marinate beans or lentils, stir it into yogurt for a savory dip, or make it the base of your vinaigrette.Get the recipe:KhichdiView RecipeExplore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Sarah Jampel"]}