{"id": "37e16ae15add8dc57a412bed27d2a285", "url": "https://www.bonappetit.com/story/rye-whiskey-cocktails", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "4 Rye Whiskey Cocktails and a Swap to Make Them Far More Sophisticated | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Holiday Season, Tell Your Family These 4 Cocktails Are Your Gift to ThemThis easy swap will make your whiskey cocktails faaaar more sophisticated. By Al CullitonNovember 25, 2019FacebookTwitterEmailFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.It’s common knowledge that bourbon is a classic American spirit, one that bartenders often reach for when mixing drinks like those we’ll be talking about today: the Old-Fashioned, the Manhattan, and the Whiskey Sour. And while I don’t want to stir up controversy (...get it?!), when it comes to cocktails, I’d take rye over bourbon pretty much any day. Why? Rye’s spicy and dry while bourbon is rounded and sweet. Rye is the mature older sibling to lovable baby brother bourbon, bringing a depth and sophistication to classic American cocktails. Bourbon, on the other hand, is pleasant yet one-sided.You might be wondering why they taste so different in the first place, even though they’re both technically American whiskey. It’s all about something we call the “mash bill.” A mash bill is the mix of grains used to make the “wort,” a fermented liquid (think unpalatable sour beer, thin texture) that’s then distilled to remove water, thus creating a spirit. When it comes to bourbon, that mix has to be 51% or more corn. But with rye, it’s got to be, you guessed it, 51% or more rye. Rye, which is a grass related to barley and wheat, has far fewer sugars than corn, which is the main reason for the marked difference in flavor between the two spirits.Now that we know why rye and bourbon behave differently in drinks, let’s go ahead and make some cocktails. This is our chance to practice skills before you try and impress your family with your mixology this holiday season.Photo by Chelsie CraigYour Shopping ListRye whiskey (Old Overholt is an old standby, and it’s not so\nexpensive)Sweet vermouth (Cocchi di Torino or Carpano Antica)Angostura bitters6 lemons2 orangesLuxardo cherries (any good\nbrandied cherry will do, just don’t get the dyed, corn syrupy\nkind)EggsSugarTo prep, we’re going to make the world’s most straightforward simple syrup. It’s a 1:1 ratio of water to sugar. Boil water. Put 1 cup granulated sugar in a heatproof bowl. Pour 1 cup boiling water into the bowl and stir until sugar is completely dissolved. You don’t want granules of sugar left in your syrup. Let cool completely before using.1. The Old-FashionedPhoto by Chelsie CraigThe Old-Fashioned is for your friend who’s a no-frills straight shooter. There’s sturdy construction, with nothing superfluous.Like all cocktails that originated in the early 1800s, this is a mix of liquor, sugar, bitters, and water (today, it’s usually ice). It didn’t start being called the “Old-Fashioned” (that’d be like year 200 B.C.E. starting out as, well, 200 B.C.E.) until much later in the nineteenth century. Before that, it was simply known as the “Whiskey Cocktail.”To make it, pour a heaping ¼ oz. simple syrup into a rocks glass, followed by 2 generous dashes Angostura bitters. Add 2 oz. rye whiskey and fill the glass with ice. Using a bar spoon or, you know, whatever you can find, stir for 20 seconds to chill and dilute the cocktail. With a vegetable peeler, cut a long, wide piece of peel from an orange. Hold the colorful side down and pinch the peel using your thumb and fore- and middle fingers (of both hands!) to express the peel’s oils onto the drink. Then drag the oily side of the peel around the rim of the glass, finally placing it in the drink. I garnish this with only an orange twist, but many enjoy a nice cherry, too, which is a vestige of the muddled-fruit version of the Old-Fashioned from the twentieth-century.2. The ManhattanPhoto by Chelsie CraigThis classy little number is just the thing for your most elegant friend, the one who sets the table with cloth napkins and all that. Created in the later nineteenth century in New York City, the Manhattan was one of the first popular cocktails to contain vermouth—and it’s the first mixed drink I really fell in love with.To make it, combine 2 oz. rye whiskey, 1 oz. sweet vermouth, and 2 dashes Angostura bitters in a mixing glass. (FYI: The biggest favor you’ll ever do for your bar setup is trading in a pint glass for a real mixing glass.) Add ice three-quarters of the way up and stir for 20 seconds. Strain into a chilled coupe or other stemmed cocktail glass. Garnish with a cherry on a cocktail pick.3. The Whiskey SourPhoto by Chelsie CraigThis sour is just perfect for your friend who exudes breezy self-confidence without the slightest trace of arrogance. While whiskey sours are too often associated with bad sour mix or, worse, the powdered stuff from the 1960s, they’re classic, delicious, and, when properly made, incredibly satisfying. If you haven’t had a good one, you've been deprived of one of our national treasures.To make it, combine 2 oz. rye whiskey, 1 oz. lemon juice, and 1 oz. simple syrup in a shaker. Add ice, seal, and shake vigorously for 15 seconds. Strain into a rocks glass over fresh ice. Garnish with an orange slice and a cherry, perhaps with the orange surrounding the cherry on three sides and a pick through the whole thing to hold it together.4. The Boston SourPhoto by Chelsie CraigThere is a lot of debate when it comes to how to make and serve whiskey sours, but it’s widely accepted that a whiskey sour with egg white and served up, is a classic—and it’s called a Boston Sour. Egg whites were a common ingredient in many classic cocktails and are still used in great cocktails bars today. (Don't be scared of egg whites—it’s going to be fine!) Compared to the more elemental version above, this one’s a little more dressed up, like a gentleman in a top-hat and tails, treading the sawdust floor of a saloon.To make it, add the same ingredients as above to a shaker, plus about ½ oz. egg whites. Do not add ice! Seal the shaker tightly and shake, holding the tins together firmly, for about 10 seconds. (That was dry shaking! You did it!) Then open your shaker back up, add ice, and seal again. Shake vigorously for another 15 seconds. Strain into a coupe. You’ll see the frothy egg white layer really take shape at the top of the glass. To get really fancy, take the little dasher top off the bitters bottle and, using a dropper, apply to the drink’s surface 5–6 drops in a circle, at equal intervals. Then take a cocktail pick and drag it through each drop in the circle to create heart-like markings.Now go forth and give rye a chance! I hope you’ll see that it’s worthy of a place on your home bar and absolutely gives bourbon a run for its money.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Still got a bottle of bourbon to put to use?3 Easy Cocktails That'll Make You Feel Like You're Sitting By the FireA bottle of bourbon, one surprising bottle of wine, and enough easy cocktails to get you through the rest of the winter.View StoryExplore Bon AppétitRyeRye WhiskeyHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-25", "author": ["Condé Nast", "Al Culliton"]}