{"id": "37e686d68029a2402d325bdbe3a35b54", "url": "https://www.bonappetit.com/story/different-types-of-paprika", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "All the Different Types of Paprika and How to Use Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Different Types of Paprika and How to Use ThemThere are different types of paprika. Hungarian. Spanish. Smoked. Sweet. Here's how to get down in paprika town.By Alex DelanyJanuary 4, 2018FacebookTwitterEmailTed CavanaughFacebookTwitterEmailPaprika falls somewhere between red and orange, and it ends up on deviled eggs. That’s about the extent of many people's paprika knowledge. Most of us don't understand the different types of paprika. We know paprika, but we don’t really know paprika, kind of like your friend’s freshman year roommate. What’s that dude’s deal, anyway? Who is he, really? We’re launching an investigation. Into paprika. Not the roommate.There’s more to this sweet, smoky, flavorful spice than deviled eggs. There are different varieties, with different origins and flavor profiles, and, while the world of paprika is a wide one, it all starts at the same place.Paprika is made from dried peppers. That’s where the red-orange color comes from, but, as you know, just because two peppers are red, doesn’t necessarily mean they taste the same. Paprika varies in flavor based on what types of peppers are dried and pulverized. The spice can range from mild to spicy, a little sweet to 100% savory. Here are the most common types you’ll encounter:Chicken Paprikash is a classic paprika-friendly dish.\nPhoto by Chelsie CraigBasic PaprikaThe paprika that you see in the grocery store, the stuff that just says “Paprika” on the front, is guaranteed to be mild. That’s about it. Regular paprika is the least assertive in flavor, offering a low-intensity pepper flavor without much heat or sweetness. The real play here is for color, not flavor. Livening up chicken, hummus, eggs, potatoes, or rice with a dash of the red stuff makes life a little more interesting.Hungarian PaprikaIf you want to know about true, deep paprika love, talk to the Hungarians. It’s the country’s spice of choice, a staple in Hungary’s national dish: Goulash. Where our basic grocery store paprika is one-dimensional, Hungarian paprikas are anything but. It's like comparing The Little Engine That Could to The Iliad. One is…a little more complex. Hungarian paprika traditionally comes in eight different flavor profiles, ranging from mild and bright red to spicy, pungent, and pale orange. The most common is a bright red variety called édesnemes, which has a pungent pepper flavor and sweetness. You’ll most likely see it labeled as \"Sweet Hungarian Paprika\" outside of Hungary. If you live in Hungary, you should have just skipped this section. Sorry.Spanish PaprikaOften labeled \"pimentón,\" Spanish paprika is commonly made with smoked peppers, which, as you can probably gather, brings a deeper, smokier flavor to the table. The heat and sweetness levels in Spanish paprika vary based on the blend of peppers used. You might see dulce (sweet), agrodulce (bittersweet), or picante (hot) varieties at a spice shop or well-equipped grocery store. This isn’t to say all Spanish paprika is smoked, but the Spanish varieties available to us most likely are. And when we’re making something like paella, that's exactly what we're looking for.Chicken Paprikash time is now! Go! Go! Go!Explore Bon AppétitBasicallySmoked PaprikaPaprikaSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Alex Delany"]}