{"id": "37eba2e85f02c9393f0ae862f9e934e4", "url": "https://www.bonappetit.com/story/sherry-vermouth-cocktails", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "3 Sherry and Vermouth Cocktails That Are Low-ABV and Downright Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Sherry and Vermouth Cocktails That Are Low-ABV and Downright DeliciousProving you don’t need hard liquor to make cocktails.By Al CullitonAugust 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.By this time each summer, it feels like we’ve finally reached the bottom of a bottomless pitcher of margaritas, mojitos, daiquiris, or Negronis. They’re all great drinks, but as we get into August, I’m craving something with a lower ABV and lots of class. Enter two European wines: sherry and vermouth.If you’re an Anglophile like me, you’ve probably noticed that in every British mystery or period drama people are constantly drinking sherry poured from elaborate crystal decanters. But this wine isn’t English. It comes from a tiny area in Cádiz, a province in the Andalusia region of southern Spain. It’s a fortified wine, which means that a small amount of spirit has been added, usually a grape brandy. In the olden days, brandy preserved the wine for the long voyage to England. Because of this, sherries end up being stronger than typical wines, at 15%–22% depending on the type. There’s a lot we could say about the range of styles, but today we’re primarily using drier varieties of sherry, not the super sweet stuff.We’ve discussed vermouth in the past, but here’s the gist. It’s an aromatized, fortified wine, which means that like sherry it’s got the addition of liquor and it’s also been infused with botanicals, like roots and barks, herbs, spices, and citrus peels. Vermouth can be made anywhere, but Italy and France are the biggest producers. The ABV hovers around 16%–18%. Vermouth and sherry both show up in a ton of old-timey cocktail recipes, and that’s because those guys knew what they were doing. These wines can add all sorts of flavors—briny, nutty, herbaceous, floral or botanical, and more. See for yourself.Try these three cocktails this month: the Sherry Cobbler, the Bamboo, and the Adonis. They’re at least 100 years old and taste dynamite.Your Shopping List:1 bottle sherry (I recommend Amontillado for an all-purpose, middle-ground sherry)1 bottle dry vermouth1 bottle sweet vermouth1 bottle orange bittersSugar2 lemons4 orangesSoda or tonic, optionalPrep TimeTime to make a simple syrup: Combine 1 cup granulated sugar with 1 cup boiling water and stir until the sugar has completely dissolved. Let cool.Photo by Chelsie CraigThe Sherry CobblerLet’s kick things off with the oldest of this trio. The cobbler was the king of cocktails in the mid-19th century America. And sherry was its most common base. A cobbler is fortified wine shaken with sugar and citrus, strained over ice, and garnished with fruit. It’s got a lot in common with the sangaree, an even older drink and the grandmother of modern-day sangria. It’s icy-cold, pleasantly winey, and a little fruity-sweet—just the thing for a hot day.Straws came into use because of the cobbler and other ice-cold drinks of its day. Not only did the straw make drinking more convenient but it also protected those with sensitive teeth (nearly everyone) at a time when dentistry was not especially advanced or widespread. Before ice became commonplace drinks were served room temperature or hot.How to make it: put 3 orange slices and ½ oz simple syrup into your cocktail shaker and muddle gently. Pour in 3½ oz. of sherry and fill with ice. Seal shaker and shake hard for 12 seconds. Strain into a Collins or highball glass over fresh ice (crushed, if you have it!) and garnish with an orange or lemon slice and some berries, currants, or any fruit that looks pleasing. Serve it with a—compostable or reusable–straw!Photo by Chelsie CraigThe BambooThe Bamboo is often referred to as the martini of the sherry world because it is unfailingly clean and crisp. In a typically convoluted origin story, it was invented in the late 19th century in Japan by a German running a hotel bar for a group of Americans. I could drink a bunch of these in a row, ideally in a bespoke linen suit on a veranda somewhere. It’s a briny, dry, refreshing trip back in time.How to make it: In a mixing glass, combine 1½ oz. sherry with 1½ oz. dry vermouth. Add 2 dashes orange bitters and fill mixing glass with ice. Stir to chill well, about 20 seconds. Strain into a coupe or other stemmed cocktail glass. Using a Y-peeler, peel a nice broad slice of lemon peel. With the yellow side down, using both hands, pinch the peel so that the oils from it are released onto the surface of your cocktail. Drag it around the lip of the glass before placing it nicely in the drink, with one end sticking out a bit. (If you get hooked on this one, try it with a fino sherry next time, which will make it even drier.)Photo by Chelsie CraigThe AdonisFor our third drink, we’re sticking with the 19th century. The Adonis has a near identical recipe to the Bamboo, but because of one major difference, it’s the Manhattan of the fortified wine realm. I really like this one for its herbal and citrusy flavors. It was invented at the Waldorf Astoria’s legendary bar in the 1880s and named for a musical that was running in a then-nascent theater district called Broadway.How to make it: Combine 1½ oz. sherry with 1½ oz. sweet vermouth in a mixing glass and add 2 dashes orange bitters. Add ice to the mixing glass and stir to chill, about 20 seconds. Strain into a coupe and garnish with an orange peel, employing the method described above. (If you love it, give oloroso sherry a shot next time; it’s oxidized, round, and flavorful, especially for the cold weather months.)Make It Your OwnIf you want more sherry in any of these cocktails, mess with the ratio! Two to one in either direction is great, I just happen to prefer equal parts here. Secondly, stick with the orange bitters for the Bamboo (it’s a martini cousin, after all, and you don’t want to overpower it with spices). But if you’re a Manhattan fan, feel free to try other traditional bitters in the Adonis, like Angostura or Peychaud’s, which contribute cinnamon, nutmeg, clove, or anise, depending on which you choose.How to Treat Fortified WinesWe’ve said it before, but will happily say it again, for the love of vermouth and sherry: When you open a bottle of fortified wine, write the date you opened it on the label. Always store it in the fridge, not on your bar cart, and drink it within a month. It’s wine. Would you drink wine you opened a month ago?And you don’t have to make cocktails every day to use it up. Instead of cracking a beer or having a glass of wine when you get home from work, take a cue from the Europeans: Sherry or vermouth on the rocks with a twist or a splash of soda or tonic makes a tasty and refreshing drink for the weary worker. You’ll see.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlCocktailRead MorecookingRum + Sugar + Lime = 3 Perfect Summer CocktailsBy Al CullitoncookingKick Off Summer with a Big Ol' Pitcher of Pimm's CupsBy Al CullitoncookingHow to Pre-Batch Old-Fashioneds—and Any Stirred Cocktail—for Maximum Party PortabilityBy Al Cullitoncooking3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeBy Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-08", "author": ["Condé Nast", "Al Culliton"]}