{"id": "37f57633a167017b45a50958adc0c93f", "url": "https://www.bonappetit.com/recipe/any-berry-shrub", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Any-Berry Shrub Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueAny-Berry ShrubBy Christina ChaeyMay 25, 20214.7(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Julian Cousins, food styling by Adriana Paschen, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThere’s no summer beverage more refreshing than a puckering fruit shrub mixed with club soda over ice. There are many ways to make a shrub, but we prefer the cold-process method in which ripe berries and sugar macerate for a day until they turn into a flavorful syrup. Once you strain the fruit syrup into your jar, you can add all kinds of additional flavors to infuse your final shrub. A few to try: a 2\"-piece of ginger, peeled and thinly sliced; a small bunch of basil or mint leaves, clapped to release aromas; a few sprigs of fresh rosemary or thyme; or a 3\"-piece of lemongrass, tough outer layers removed, smashed. Mix the resulting fruity-sweet vinegar with club soda (and maybe tequila or gin, no one’s stopping you!) and you’ve got the makings of an instant party drink. You can drink the shrub right away, but it will taste even better after a week or so when the flavors have mellowed.IngredientsMakes about 20shrub12oz. berries (such as raspberries, blackberries, blueberries, or strawberries), sliced or quartered if large1½cups (or more) granulated sugar1cup (or more) vinegar (such as red wine, white wine, apple cider, white balsamic, or unseasoned rice)assemblyClub soda (for serving)Fresh berries and/or herb sprigs (for serving; optional)Special equipmentA 1-qt. glass jar with a lidCheesecloth (optional)PreparationStep 1Gently mash berries in a medium bowl with a fork. Transfer to jar, add sugar, and stir to combine. Seal jar and let fruit mixture sit at room temperature, shaking a couple of times, until berries are very soft and falling apart and sugar is at least mostly dissolved, about 1 day (mixture should look very juicy).Step 2Strain fruit mixture through a fine-mesh sieve (line sieve with a layer of cheesecloth if you want to catch every bit of seed and fruit pulp) into a medium bowl; discard fruit. Scrape any undissolved sugar left in jar into bowl.Step 3Add vinegar to syrup and stir to combine. Taste shrub and add more sugar or vinegar to your liking—it should taste both sweet and sharp but not overpowering in either direction (keep in mind the flavors will meld as the shrub ages). Pour shrub into a clean jar; cover with lid and chill until flavors come together and mellow, at least 1 week.Do ahead: Shrub can be made 6 months ahead. Keep chilled.assemblyStep 4For a refreshing nonalcoholic drink, pour 2 Tbsp. shrub into a glass filled with ice and top off with club soda; stir gently to combine. Garnish with berries and/or herbs if desired.How would you rate Any-Berry Shrub?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleMade it with Strawberries he first time and it was delicious, just made a second batch with Peaches and mint.  I think it's going to be just as delicious.  Drink it with sparkling water and its fab with rum. froze the discards and put them in my morning greek yogurt, double yum!!AnonymousMasshole displaced in VA.7/19/2021Made it , loved it! Mix it with Gin and soda water or just sparkling water!!Linda ElkindChicago, Il7/17/2021Those who said that their shrub tasted like vinegar clearly did something wrong. I’ve been experimenting with different shrubs for the past year and I’ve never had that resultCarlo Swestern MA7/14/2021For this recipe, after macerating your berries (or whatever you're using) with the sugar and straining, definitely measure how much of the resulting liquid you have and start with the addition of half as much vinegar and then increase to taste. \n\nI used red wine vinegar and used a little more than half the volume of my sweetened berry syrup. As a note: I would suggest a red or white wine vinegar, depending on the fruit -- apple cider vinegar is a very strong flavor and can overpower others, so make sure that's the flavor you want (and possibly cut it with other more neutral vinegar).Erik F.Houston, TX7/6/2021Tried it with raspberries, and to be honest, the only thing it tastes like is vinegar.  Undrinkable.  Maybe it will mellow as it sits, but as-is, I found it very disappointing.PaulNorthridge, CA6/30/2021Love this recipe! It's fantastic. I made a batch of strawberry shrub, then adjusted the recipe for some farmers market peaches and made a batch of ginger/jalapeno/peach shrub. It's delicious with some plain Waterloo or La Croix. Quite refreshing! \n\nJust a thought for the recipe. With all of the food waste that occurs, why not include different suggestions for what to do with the fruit, other than discarding it? That could make a lovely topping for pancakes, ice cream, yogurt, etc. HannahLufromTennesseeSpring Hill, Tennessee6/21/2021Delicious with soda water snd better with Gin!Ali oopsVancouver Canada 6/19/2021I made some with mostly red wine vinegar, a splash of balsamic vinegar, and strawberries. Haven’t tried it in a drink yet, but it was absolutely delish splashed over good vanilla ice cream!Grace SSan Diego, CA6/17/2021We made a batch with strawberries and apple cider vinegar and a batch with red wine vinegar and cherries. Both turned out great! KerryChicago6/13/2021I used apple cider vinegar (as mentioned) and 1 cup was too overpowering. The drink basically tastes like apple cider vinegar. Maybe the flavors will truly \"mellow\" over the next 6 months, but wish I started with ½ cup and added more to taste.AnonymousChicago, IL6/11/2021So delicious! I made a strawberry shrub with white wine vinegar. Mixed it with Ha’Penny Rhubarb Gin and some strawberry sparkling water.  A perfect summer cocktail. Sarah Beth KingKnoxville, TN 6/7/2021Delicious, refreshing and very satisfying. I used Pommery red wine vinegar crisp and sharp. I bet it’s great with gin.EXHSNNew York City6/1/2021Explore Bon AppétitCocktailDrinks AllCold DrinkBerryFruitBlackberryBlueberryStrawberryRaspberryGinAlcohol & Other DrinksTequilaSummer5 Ingredients or FewerDrinksDairy-FreeGluten-FreeNut-FreeVeganVegetarianNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-21", "author": ["Condé Nast", "Christina Chaey"]}