{"id": "37f80304333d107adf89917607d991d2", "url": "https://www.bonappetit.com/story/stuffed-peppers-recipe", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "A Stuffed Peppers Recipe That You'll Keep Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStuffed Peppers Are Old School, But This Recipe Is ForeverThe old school was cool as hell. These aren't going out of style any time soon.By Alex DelanyFebruary 22, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Chris MoroccoFacebookTwitterEmailIf you happen to be an Italian American, there is an undeniable dose of nostalgia served alongside a stuffed peppers recipe. If you’re not, it’s just some tasty stuff inside a pepper. But test kitchen manager Brad Leone falls into the nostalgia category, with a big thanks to his grandmother’s stuffed peppers. That love, coupled with the bizarre fact that we did not possess a recipe for stuffed peppers (mind-boggling) led to the development of the beautiful peps you see before you. Yes, beautiful is the right word.Stuffed peppers, as their name asserts, are stuffed with filling. The contents of this filling may change from family to family, but for Leone’s grandmother, the combination was set in stone: a mixture of ground pork and beef, onion, cooked rice, golden raisins, walnuts, Parmesan cheese, and a blend of spices, including turmeric and smoked paprika. The walnuts (which Leone says are the secret ingredient) give some textural variety, and the raisins create a sweet and sour agrodolce effect. The filling essentially turns peppers into large, edible suitcases filled with the meaty, sweet, salty, cheesy, savory contraband that the TSA would surely confiscate.In this stuffed peppers recipe, we use unsweetened, 100% tomato juice and bit of tomato paste (not puréed tomatoes) to mix into that filling. The loose consistency of the juice keeps the filling juicy. Crushed tomatoes or tomato purée would reduce into a thick, gummy mess. Which is definitely not cool.Here at BA, we get into fights about bell pepper colors quite frequently, but we’d like to just say this: You can use whatever color bell pepper you want for stuffed peppers. This is your show.A pot of stuffed peps, standing at attention.\nPhoto by Chelsie Craig, Styling by Chris MoroccoIf you’ve made stuffed peppers before, you’ll know that the most frustrating part of the process is getting the peppers to stand up. Bell peppers are like your freshman year roommate at the end of a Saturday night. They fall down a lot. But Leone is a stable-footed dude with a technique to save your peppers. Shaving off the tips on the bottom of the pepper with a knife creates a flat surface for the peppers to stand on. Just make sure you don’t make your way into the interior of the pepper, or all the filling will leak out.When packing your peppers, make sure to really get that filling in there. And add a generous amount of Parm to brown on top. The filling will shrink while cooking, so you’ll be left with a bunch of extra filling and sad half-filled peppers if you don’t really go for it.And speaking of really going for it, Leone recommends doubling this recipe, inviting your whole crew of exactly 12 people over, and popping several bottles of red wine to make it a real Italian dinner. You’ll be faced with a room full of people shouting Italian phrases in terrible accents, as they slice through their tender, spicy, cheesy, vegetables. And that’s fine. Your actual ancestry doesn’t matter much when stuffed peppers are on the table.Get the recipe:Stuffed PeppersBelieve it or not, these are even better reheated the next day!View RecipeExplore Bon AppétitNostalgiaItalianGround PorkGround BeefPepperRead MorecookingManicotti Is the Greatest Recipe of All TimeBy Brad LeonecookingThe Ultimate Spaghetti and Meatballs Sunday SupperBy Bon AppétitcookingBA's Best Lasagna Is Our Only Winter HobbyBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Alex Delany"]}