{"id": "381188118e15ceab01d83b418b0ed6ba", "url": "https://www.bonappetit.com/story/history-of-rice", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "4 Recipes That Explore the Little-Known History of Rice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Deep, Winding History of Rice Across the African Atlantic DiasporaFor many, rice is the staff of life. But the simplicity of this globally beloved staple is deceptive.By Jessica B. HarrisJanuary 13, 2022FacebookTwitterEmailPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranFacebookTwitterEmailIf you’re throwing a dinner party and the guests are picky, it’s always a good idea to serve rice. It’s enjoyed around the world from North to South America, Asia to Africa. In fact, it’s so popular in some parts of West Africa that Peace Corps volunteers who worked on the continent in the 1970s jokingly suggested that the Christian Lord’s Prayer there be adapted to say “give us this day our daily rice.”I visited Senegal years ago while working on my doctoral dissertation and found that most meals included rice. There, some dishes are prepared with rice stuffings, while others, like the national dish thieboudienne, incorporate rice into (or under) fragrant stews. For many in the African Atlantic world, this humble crop is the staff of life, and for centuries survival depended on its cultivation. But the simplicity of this common ingredient is deceptive. Within each tiny grain lies the little-known history—a connection to Africa.Western awareness of African rice began when the first Portuguese reached the West African coast and witnessed its cultivation. Portuguese chronicler Gomes Eanes de Zurara wrote about large fields planted with rice as early as 1446, saying the region looked like a swamp. But in the 16th century, Portuguese colonizers introduced high-yield Asian rice (Oryza sativa) to the African continent, replacing much of the production of native rice (Oryza glaberrima). To this day, most of the rice consumed on both the African continent and in the Americas is from this Asian variety.From the West African crucible, once known as the Rice Coast, the crop made its way to the New World via the transatlantic slave trade. In the 18th century its cultivation was central to the economy of the South Carolina and Georgia Low Country. Back then enslaved Africans from rice-growing regions of West Africa were especially prized, as they brought with them the expert agricultural knowledge responsible for the region’s vast wealth.But the Low Country is only one of the New World spaces to which African mastery of rice cultivation was brought. Many a traveler in Haiti has dozed off on the road north from Port-au-Prince to Cap-Haïtien and awakened with surprise to see rice paddies that look like they were transported from the other side of the globe. This story repeats itself in other areas of the Caribbean and Central America, in northern Brazil, and throughout the New World, where Africans grew rice to feed themselves and others. The rice they cultivated became a foundational part of many of the culinary cultures of the diaspora, so much so that in some Spanish-speaking areas, a pairing of beans and white rice is simply known as la bandera—the flag!Just about every culinary technique imaginable can be used on rice. Some people are partial to steamers and electric rice cookers while others swear by the stovetop. I myself could not cook rice from scratch for years, using nothing but precooked minute rice until one day, as I was facing the stove, my mother seemed to speak to me from beyond the grave. I remembered suddenly how she cooked rice like pasta, boiling it until done, draining it, and then steaming in a covered pot until fluffy, which is how I cook rice to this day.While some Americans are increasingly moving away from white rice toward wild and other variants, many dishes of the African Atlantic world still hark back to the traditional fluffy white grains. In Brazil leftover white rice is famously fried and served as rice balls or fritters, like Erminia Apolinario’s golden Bolinho de Arroz. West African cooks like Pierre Thiam often add broth, meat, and vegetables to their leftover rice, cooking it down into creamy Senegalese Mbahal.Across the Caribbean, bean-and-rice dishes like Gregory Gourdet’s version of the Haitian classic Diri Kole ak Pwa are highly revered, and in the American South, rice turns up in memorable chicken-rich soups and stews. Lucky for us, Gullah chef Matthew Raiford has shared his renowned Nana’s Chicken and Rice Stew. These chefs are all experts in the rice-cooking traditions of their respective communities, and these flavorful recipes celebrate the prominence, history, and enduring versatility of a staple we all know and love.Jessica B. Harris, Ph.D., is an acclaimed culinary historian and author of several books including ‘High on the Hog,’ now a Netflix series.Bolinho de Arroz — Brazil“Brazilians, we eat rice and beans every day. It’s a food that feeds the masses. I was raised on bolinho de arroz. When my Tia Zita would visit from Rio, she’d say, “Erminia, I made you a surprise rice ball. What do you think I put inside?” I loved to play that game with her. It’s a very popular snack because you can put whatever you have in your kitchen inside; it can be cheese, sausage, chicken, or fish. It’s also a bar food—as a tropical country, we drink a lot of beer!” —Erminia Apolinario, chef and catererBolinho de Arroz With Molho VerdeThese crunchy, cheesy fried rice balls are the perfect snack for any time of day, and they come together in less than half an hour.View RecipeMbahal — Senegal, West Africa“Senegal definitely breaks some records when it comes to rice. If there’s no rice on a given day, it’s like you haven’t eaten. Mbahal is a dish that oftentimes comes in between meals. Rice that’s already cooked is turned into a porridge by adding broth. Mbahal means ‘to boil’ in Wolof, so it’s a boil, really. The rice is boiled, the meat is boiled, whatever vegetables you have—anything can go into mbahal. It’s the dish that every single household has a recipe for.” —Pierre Thiam, chef-cofounder, YoléléMbahalThis creamy Senegalese rice and lamb dish combines peanuts, okra, and black-eyed peas to build beautiful West African flavors in a comforting one-pot meal.View RecipeDiri Kole ak Pwa — Haiti, the Caribbean“In the Haitian community we joke that a meal isn’t complete without rice. There are so many different rice dishes in Haiti, and diri kole ak pwa is probably the most popular. It’s a dish that doesn’t see class—if you’re struggling financially, diri kole is something you can get on the table for your family, and even if you’re among the wealthy, it’s still on your table. Rice with beans has so many variations throughout the Caribbean, but the epis (green seasoning) creates this uniquely Haitian flavor profile, and a few tablespoons in your rice give it that distinction.” —Gregory Gourdet, chef-owner, KannDiri Kole ak PwaEpis, the punchy, peppery Haitian seasoning, gives this iconic dish its complex flavor profile.View RecipeNana’s Chicken and Rice Stew — Georgia Low Country“I grew up eating rice with just about every meal possible. Someone said to me once, ‘Man, y’all so Geechee, y’all eat rice all the time!’ But Gullah Geechee food culture isn’t a monolith—people adapted to the areas they were in with the produce and foods that were available. If you had a large family, a stew could last for two or three days with one chicken, vegetables, and rice. When my nana would do it, it was really about stretching the meal for all of us, and doing the most with the food until it cannot be done anymore.” —Matthew Raiford, chef and author, Bress ’n’ NyamNana’s Chicken and Rice StewA hearty blend of chicken, rice, fresh herbs, and a grandmother’s love.View RecipeExplore Bon AppétitCultureRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-13", "author": ["Condé Nast", "Jessica B. Harris"]}