{"id": "38170a5528916a4142c9b62cd79169ec", "url": "https://www.bonappetit.com/city-guides/montreal/venue/cafe-olimpico", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Café Olimpico Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealCafé OlimpicoGet your caffeine fix at this Mile End espresso shopFacebookPinterestTwitterEmailCourtesy of Café OlimpicoGO HERE: for Café Olimpico’s legit espresso. You’ll need it after all the eating.ORDER THE: cappuccino, topped with a big cloud of foamed milk. Espresso lovers will appreciate Café Olimpico’s special coffee blend, purportedly created by café founder and Italian immigrant Rocco Furfaro.THE VIBE IS: molto Italiano but also molto Mile End, with soccer playing on the TV screens, cannolis in the pastry case, and hip tattooed baristas pulling shots of espresso behind the bar.PRACTICAL STUFF: Open every day 7 a.m. to midnight. Pro tip: Stop here for a quick espresso before or after your bagel run (St-Viateur and Fairmount are a few blocks away).—Claire SaffitzCourtesy of Café OlimpicoWE ALSO LOVESt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainBoucherie LawrenceAll the Mile End goods to smuggle back homePatisserie Au Kouign-AmannA carby, sugary haven in the PlateauExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}