{"id": "381bb473602b47651c18dea234a35b29", "url": "https://www.bonappetit.com/story/georgia-restaurants-reopening", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "One Month Into a Reopened Economy, Georgia’s Restaurants Are Still Making Tough Choices | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureOne Month Into a Reopened Economy, Georgia’s Restaurants Are Still Making Tough ChoicesWhen it comes to the future of dining out, the first state to lift lockdown is a canary in a coal mine.By Mara ShalhoupJune 3, 2020FacebookTwitterEmailPhoto By DUSTIN CHAMBERSFacebookTwitterEmailI’m greeted at the curb by a hostess who appears to smile under her face mask as she scans my forehead with an infrared thermometer. A latex-gloved hand eases open the heavy double doors and I’m ushered into the dim and spacious lobby, whisked past one of a half-dozen sanitization stations, and led along a short walkway that flanks the upper dining room. I follow the arrows taped on the ground that enforce one-way traffic flow and pass another sanitization station, this one manned by two staffers dedicated to continuously wiping down high-traffic touch points.A wall of windows looks out over the biggest draw at Ray’s on the River: the restaurant’s park-like main patio. (There are two, but this one has the choice view of Atlanta’s lazy Chattahoochee River.) I keep moving into a detached pavilion with abundant overflow seating—open to diners most of this season now that the wedding receptions are on pause—then pass through a private dining room, repurposed to hold as many properly distanced tables as you might find in a more reasonably sized restaurant. Behind the scenes, masked prep cooks make somewhat feeble attempts at kitchen banter while plunging immersion blenders into vats of potatoes. The whole thing is a little bit Goodfellas, a little bit Contagion.Ray Schoenbaum posts up in a cushy circular booth with a view of all three levels of his restaurant. The grizzled second-generation restaurateur—whose various operations have survived such setbacks as the 1979 gas crisis, 9/11, the Great Recession, and the peculiarly Atlantan meltdown that ensues after a dusting of snow—takes a call from his lawyer, who asks how business is going on this day in early May. “Well, we’re doing about 15, 20 percent of what we were doing,” Schoenbaum says, “but it’s going to take time.”Hostess Nadia Turner takes a customer’s temperature at the entrance to Ray’s On The River.\nPhoto By DUSTIN CHAMBERSFour days earlier, on May 1, Ray’s was among the first restaurants to resume dine-in service in the first state to reopen after a weeks-long COVID-19 lockdown. Schoenbaum says reopening felt ballsy, despite the abundance of precautions he and his team have taken. At Ray’s, the silverware is heated to 195 degrees (a temperature said to kill the coronavirus) before it hits the table; the new AC filtration system employs UV rays to annihilate pathogens; and the surplus of servers and staff sanitizers on the floor, all receiving hazard pay, are at militaristic attention.“I’ve been in the business a long time, been through a lot of situations,” Schoenbaum says, fiddling with the edges of a cocktail napkin. “You live on the edge a little bit. I feel like this country wasn’t built on being afraid. I mean, if we want to be a great country, we have to take some chances.”In the days after Governor Brian Kemp announced he would restart Georgia’s economy, Schoenbaum joined an email chain with about 70 other local restaurateurs who were struggling with whether to reopen. At the time he found himself to be something of an outlier. “I didn't completely agree with the fact that almost all of them, especially in the city, didn’t want to open yet,” Schoenbaum says. “It’s probably a little bit of an economic decision, but it’s also a little political.”Server Mercury Jackson walks past a couple on a date in the dining room.\nPHOTO BY DUSTIN CHAMBERSThat first night, Ray’s turned just 125 tables—a little more than a third of a pre-pandemic Friday. But maybe that’s not so bad for the first weekend following six weeks during which nary a single dining room in Georgia (and most states beyond) sat a single diner. Or, depending on whom you ask, maybe that’s not so good. It’s particularly hard to tell in Georgia whether the virus is anywhere close to under control given the state’s epic COVID-19 case-tracking screwups. That the Centers for Disease Control and Prevention is headquartered here offers little consolation and ample irony; on April 28, the day after Georgia restaurants were allowed to welcome back diners, CNN’s Sanjay Gupta asked Emory University infectious disease expert Carlos del Rio, M.D., if Georgia was ready to reopen. “I don’t think so, but…from a health standpoint, it’s always too soon. From a business standpoint, it's always too late,” del Rio replied. “I'm not going to restaurants and I'm continuing practicing social distancing, and I'm continuing doing it because I care for my health.”There are two common endings to pandemics according to historians: the “medical,” in which the sickness somehow or other subsides, and the “social,” in which humanity slowly, collectively begins to simply move on. The latter ending feels distinctly American, especially now—though not altogether reassuring.But the social ending might be the only one that will save a certain type of restaurant: chef-driven, innovative, intimate. If those places stay closed for too long—if only the big deep-pocketed guys are willing to reopen—that has the potential to reshape not just Atlanta’s but any city’s dining scene, in devastating and homogenizing ways.“There’s a moral thing, there's a science thing, and then there’s an actual financial thing.”On April 28, 64 chefs and restaurateurs took a vow—in the form of a full-page ad in the Atlanta Journal-Constitution—not to reopen their dining rooms. The collective, dubbed #GAHospitalityTogether,” is a who’s who of the state’s most innovative culinary superstars, including James Beard winners Mashama Bailey of The Grey, Hugh Acheson of Five & Ten and Empire State South, Steven Satterfield of Miller Union, and Anne Quatrano of Bacchanalia, Star Provisions, W.H. Stiles Fish Camp, and Floataway Cafe.Pietro Gianni, partner and general manager of Storico Fresco in Buckhead and its newer sister joint Forza Storico on Atlanta’s Westside, is among the five or so restaurateurs helping to lead the #GAHospitalityTogether collective. The movement began as a way to take a stand against reopening too soon, but it also has functioned as a network of shared resources. It’s a way for restaurateurs to help one another navigate the complexities of federal aid for them and their employees and to interpret and improve upon the recommended safety precautions against the coronavirus.8Arm sous chef Duy Huynh bundles vegetables from local farms for a CSA program the restaurant is running in lieu of regular food and drink service.\nPhoto by DUSTIN CHAMBERSGianni and his partners went back and forth for weeks on what to do with their two restaurants. “There’s a moral thing, there's a science thing, and then there’s an actual financial thing,” he told me when we first spoke in early May.Gianni grew up in Rome and his family is still there, so he got a bit of a head start in weighing the moral thing—while his family is healthy and safe, they’ve accepted social distancing as a way of life to protect their larger community. Also, his girlfriend is an anesthetist who intubates patients, which is to say his intake of terrifying COVID info is high. Scientifically speaking, he was uncomfortable with the sheer amount of time guests hang out in a restaurant (sitting for hours in an enclosed place where you’re in proximity to others and touching multiple surfaces can help the coronavirus spread) and with the fact that restaurateurs can’t easily control the behavior of their guests. “You start having stays of an hour and a half, two hours or longer, because these days people have been home for so long they’re excited to be out,” he said. “Then there's the alcohol, which is freaky. You drink. You don’t know what you’re doing. You become a danger.”And financially, Georgia’s reopening guidelines are pretty thorny too. While the original rule  stating that restaurants could seat 10 customers per 500 feet of public space was adjusted on May 12 to allow 10 customers per 300 feet, that’s still well under 50 percent capacity for all but the largest restaurants. “Our restaurants are not made for those guidelines,” Gianni told me. “We only make money if we’re packed out. I’m not going to reopen to break even and put people in danger and make them make less money than they’re making with their unemployment. It’s just a dog that chases its own tail.”For diners like Shannon Green, the sooner Gianni and others could figure out these issues, the better. The interior designer says she was miserable while holed up for weeks in her high-rise waiting for the restaurants she most loves, including Storico Fresco, to reopen. “All my friends in California and all over, they’re firing away text messages to me, asking what it’s like,” Green says. “And at first I was like, ‘It’s the same. No one is opening. Doesn’t matter what the governor said, no one is doing anything about it.’”By Friday, May 1, a neighborhood grill near Green’s apartment was open for dine-in and she met a friend there for margaritas, burgers, and fries. “All the staff and everyone was wearing masks,” she says. “I wasn’t wearing a mask because it was the first time I got dressed up. I was not going to ruin my outfit. And you’re eating, so what’s the point?”Server Jessica Justice carrying a glass of white wine in the bar area at Ray’s On The River.\nPhoto by DUSTIN CHAMBERSGreen points to the fact that she’s young—33—and lives alone as reasons she can more safely dine in restaurants. “And I have an immune system where I can’t even remember the last time I was sick,” she says. “I mean, maybe I’ll get a sinus infection for a day. I’m also pretty hardheaded and I think that that makes me more immune too. So I’m not worried at all about contracting COVID. And if I do, okay, in two weeks I’ll be fine.”Though Green’s isn’t exactly representative of the average Atlanta diner (many are taking a more cautious approach), she’s also not alone in her rush to return to restaurants. At Escobar, a glamorous and lounge-y spot from restaurateur Mychel “Snoop” Dillard and the rapper 2 Chainz, the rush of diners was so intense after the dining room reopened at reduced capacity on May 4 that the staff had to turn people away from the door. (A few weeks later, the restaurant was temporarily shut down by the Georgia Department of Public Safety after officers determined its crowds were in violation of state social distancing guidelines.)One of Dillard’s biggest motivations for reopening Escobar was to get her staff back to work, since not all of them were able to qualify for unemployment. She also points out that her Paycheck Protection Program small-business loan requires that she hire back the majority of her staff by the end of June. That condition has been a major challenge for restaurants nationwide; Congress is currently trying to change the rule so that businesses receiving PPP loans aren’t forced to rush people back to work before businesses have the need for them.Dillard says she’s grateful to be able to bring employees back. “I know that the governor has been getting a lot of backlash, but I'm actually happy that he at least has given us the option to operate our business,” she says. “Not every citizen has to come out if they don't feel comfortable enough, but I think it just helps get the economy back, and it gives business owners the option to stay in business.”There’s no place Monica feels less safe than behind the counter at the mobbed fast-casual restaurant where she works in midtown Atlanta. (We’re withholding her last name because she fears reprisal for speaking up about her working conditions.) She tried her best not to be there. Though she’s young, in her 20s, her asthma puts her at a higher risk for COVID-19.\"It’s like I'm staring death in the eye for $10 an hour.”Monica gave her boss a doctor’s note back in March and stayed home for several weeks. She waited for a stimulus check that never arrived (despite the fact that she filed her 2018 and 2019 taxes on time and makes way less than the $75,000 cutoff) and for unemployment benefits that as of mid-May hadn’t materialized (she says her unemployment claim had been approved, but the money failed to show up week after week).After blowing through her savings and getting a request from her boss to come back to work, she says she had no choice but to return the week of May 11. She was appalled by the behavior of the customers and by the fact that it was so stiflingly hot in the restaurant’s space that she often had to pull down her mask to breathe. “If we were in a more sensible society, I wouldn’t have to worry about this,” she says. “But it’s like I'm staring death in the eye for $10 an hour.”Monica encountered hundreds of people on each of her shifts, most of them on their way to or from Atlanta’s massive (and often overcrowded) Piedmont Park. She says many of them were drinking or downright drunk and quick to ignore the restaurant’s rules about minimizing congregation on the patio. “I’m almost resigned to the fact that I’ll catch it,” she told me in her second week back. “I’m hoping it won’t kill me.”She’s spent a lot of time thinking about the psychological divide between customers “who are having a fun time getting their food” and workers like herself. “They should really know that on the other side of their transaction there’s a human being who’s really scared,” Monica says. “At least tip a lot, at least keep a mask on, at least don’t make the jokes that I have to fake laugh at about you not caring about coronavirus.”Georgia state Rep. Bee Nguyen, who was elected three years ago to the seat vacated by Stacey Abrams, says one of her main concerns with reopening restaurants is “how this is going to affect workers who may not feel safe going back into work and then will no longer qualify for unemployment.”Sous chef Thomas Hubbard walks past a worker putting together a takeout order in the kitchen at Ray’s On The River.\nDustin ChambersNguyen says she’s been on plenty of calls with the state Department of Labor, “and it's been really challenging to get an answer.” All she’s been able to determine is that if a worker has contracted COVID-19 or lives with and/or cares for a family member who has, that worker is still eligible for unemployment under the federal government’s evolving coronavirus provisions. So is anyone who has an underlying health condition that puts them at risk, is unable to get to work due to the pandemic (as in the event of a canceled bus route), or has a child at home who’s unable to go back to school.But what about workers who don’t fall into any of the above categories? “I think [the labor department] has been very careful to not give an affirmative answer on that,” Nguyen says. “And, quite honestly, there are things that the governor could have done that would have ensured better safety for workers.”She believes the state should have mandated that any business wanting to reopen require its employees to be regularly tested for COVID, at the state’s expense. “I would actually recommend that restaurant owners and employees go ahead and get tested now and try to get tested repeatedly because we know you can contract it at any time. The testing is free. You call the state partnership hotline and they’ll direct you to testing centers in your county.”As of late May, Monica hadn’t taken a coronavirus test—but she did have some good news. “Got unemployment!” she DM’d me on Memorial Day. “I worked my last shift yesterday.”Chef Maricela Vega helms 8Arm, a restaurant where equity and social justice are as much a part of the menu as the locally foraged mushrooms and masa crafted in-house from heritage corn. Under normal circumstances, 8Arm’s dining room, patio, and adjacent natural wine bar seat 125 people. By Vega’s estimate, Georgia’s guidelines would allow between 25 and 40. “I’m potentially looking at somehow opening up for those 25 people to sit down,” she told me in mid-May. “But I don’t want anybody hanging out around here right now.”8Arm isn’t currently offering takeout either. Vega’s initial and short-lived take-out menu (which, it should be mentioned, was among the very best in the city) brought in a fifth of the revenue she saw on her slowest pre-pandemic nights. “We had convinced ourselves that it would be easy,” she says. “We really did try—and it was just so exhausting. It’s embarrassing, but some days we weren’t even making $500.”Instead, Vega pivoted by launching a riff on a Community Supported Agriculture (CSA) program (it was already in the works, but she rolled it out early). The program is of modest benefit to 8Arm—the restaurant makes money only when buyers add extras such as Vega’s fragrant lentil-and-pickled-ramp tamales and her fermented-pumpkin hot sauce to their produce bags. “If we hadn’t added the add-ons,” she says, “we wouldn’t even be making enough to make rent and cover the bills.”Maricela Vega stands among CSA bags being prepared for customer pickup in the dining room of 8Arm.\nPhoto By DUSTIN CHAMBERSThe CSA program does much more to benefit the local farmers who had relied on 8Arm to buy their micro-crops of heirloom curly kale, pinky-finger-size carrots, and tender cutleaf coneflower greens. Through the CSA, Vega has created more demand for their produce than even her restaurant had warranted. “I had at least three farmers say, ‘You helped us make payrolls and secure jobs we were about to furlough,” she reports.Still, sales of the CSA packages dipped a little when she increased the price, tacking on $15 so that she could provide packages free of charge to undocumented workers who’ve lost their jobs; those workers have been hit disproportionately hard by the pandemic, qualifying for neither stimulus checks nor unemployment. “The restaurant industry has relied for ages on the equity and work of undocumented people,” Vega says. “For them to not have any sort of help in a concerted way—I mean, it’s crazy.”And as for the restaurant itself? “I think we just have to be patient,” she says. “There’s no real answer that I’ve been able to figure out. What is the plan that we should be going with? To be truthful, the plan changes almost every week.” (Editor’s note: At press time, 8Arm had just announced a new patio-only concept launching on June 4, with private dining in the adjacent wine bar to follow.)On May 28, del Rio, the Emory infectious disease expert, held a press conference to offer his thoughts on a recent spike in COVID-19 cases in Georgia. The state Department of Health had chalked up the 26 percent week-over-week rise to the fact that more widespread testing had become available in the state. But there was plenty of speculation that the reopened economy was to blame. “It’s not either-or,” del Rio said. “I think it’s probably both.”The press conference came exactly a month after #GAHospitalityTogether placed that ad in the newspaper—and since mid May at least 20 of the chefs and restaurateurs who’d vowed to keep their dining rooms closed have reopened them.Two weeks after I first spoke with him, Gianni and his partners reopened their Westside restaurant for dine-in customers on May 20. The following week they reopened their Buckhead location. The first night of service on the Westside included an expanded and socially distanced patio, the ability to order by smartphone and request minimal contact with staff, and a jersey-clad referee who patrolled the area to ensure diners played by the rules. The next day I asked Gianni what swayed him. “The decision was, I kinda want to and I kinda have to,” he said. His restaurants had survived the first two months of the pandemic by selling take-out food to the public and preparing meals—paid by charitable organizations and the business sector—for frontline medical workers. But then, the weekend before Forza Storico reopened, the donations dried up.“I was fearful,” he said, “but I’ve seen how well we were able to make an awkward situation fun and cool.”Diners at a table in the dining room at Ray’s On The River\nDUSTIN CHAMBERSThe day after Forza Storico reopened, Anne Quatrano—Atlanta’s grande dame of down-to-earth fine dining and another member of #GAHospitalityTogether—was preparing to reopen Bacchanalia and Floataway that very night. “Today I am more anxious than I’ve been for any of our real restaurant openings,” she told me. She’s had 12 of those.Quatrano says there was no coordinated reopening effort between her and other chefs in the collective. The main thing for her was that the vast majority of her staff said they were ready to come back to work, so she brought back whoever wanted to return.In Bacchanalia’s brave new world of fine dining, all four courses now arrive on the table covered by domes, and the amuse bouche and mignardises are presented in little boxes. Cocktails are prebatched and bottled; diners pour them themselves. Gone are the multiple table settings (that’s way too many touches); instead, all the cutlery for the meal will be on the table from the very beginning, in a single bespoke package. Quatrano even ditched her legendary cheese cart (the potential for cross-contamination is too risky), but there will still be a cheese course.“We had eight weeks to figure it out,” Quatrano tells me. Waiting any longer, she says, could have forced her into an early retirement—and after running Bacchanalia for 27 years, she’s not ready to accept that ending. “Restaurants, we change all the time. We have to. We need to be prepared to serve people however they want to be served, however they feel comfortable and safe, and that’s our job. It’s changing, but I think we’re going to handle it.”On May 29, the day this story was set to go to press, major protests broke out in Atlanta over the murder of George Floyd by Minneapolis police. The ongoing unrest and resulting daily curfews added yet another layer of uncertainty to the lives of restaurant owners trying to simultaneously navigate the threat of COVID-19 and the confusion of a reopened economy.The issue is particularly thorny for Black business owners located in the areas where protests are most prominent, as Derrick Hayes of Big Dave’s Cheesesteaks can attest. Hayes got his start cooking cheesesteaks in a space attached to a Shell gas station, where he worked a single fryer and a three-foot grill. Over the past six years, he built up his customer base and its Instagram following (214,000 and counting)—until finally, last summer, he was able to move his operation across town, into bigger and nicer digs in downtown Atlanta.Even after the virus forced him to close his dining room in March, Hayes maintained his breakneck pace with takeout orders—including an afternoon of free chicken cheesesteak egg rolls for 1,000 curbside customers who followed social-distancing rules and a month of meals for frontline workers, paid for in part with money raised by Chicago rapper Lil Durk.“The community knows how I stand for them,” Hayes says. That made it all the more difficult when, as he was contemplating when and how to safely reopen his dining room, Big Dave’s storefront windows were smashed on the first night of Atlanta’s protests. “I was hurt, because I worked my tail off to get that location open,” he says. “But at the same time, I understand. We're angry. We're tired of going through this. We want to be treated equally.”The broken windows will keep Big Dave’s out of commission at least until next week; Hayes is waiting on the special glass that has to be specially made for the historic building that houses his restaurant. But the community has stepped in to help: As of June 3, repairs have been fully covered by online fundraisers and a large donation from another rapper, Russ. Big Dave’s will reopen—still just for takeout—as soon as the glass sets, and is now using any further donations from their GoFundMe to help support other local small businesses owned by people of color.“We're all in this together,” says Hayes. “Let's show that we’re all in this together.”Mara Shalhoup is deputy editor at Atlanta magazine.Explore Bon AppétitRestaurantsGeorgiaAtlantaCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-03", "author": ["Condé Nast", "Mara Shalhoup"]}