{"id": "381ce69d77aa8f87e6d75757fc652dbc", "url": "https://www.bonappetit.com/recipe/chorizo-and-chickpea-braised-chicken-thighs", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Chorizo & Chickpea Braised Chicken Thighs Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesChorizo & Chickpea Braised Chicken ThighsFacebookPinterestTwitterEmailThe bonus of braising chicken in stock is a delicious, flavorful pan sauce. Sherry vinegar adds complexity to the dish, but if you can’t find it or prefer to use something on hand, red wine vinegar is a good substitute.PrintIngredients3 ounces dried chorizoOne 12 ounch jar roasted piquillo peppers, (or substitute red bell peppers)4 large garlic cloves6 chicken thighs, about 2 1/4 pounds3 tablespoons extra virgin olive oil2 tablespoons tomato paste1/4 cup sherry vinegarOne 15 ounce can chickpeas1 cup Swanson Chicken Stock1/2 cup pitted green olives, preferably castelvetranoA few sprigs fresh parsleyRecipe PreparationPreheat oven to 425. Remove the skin from the chorizo, if necessary, and cut into ¼-inch pieces. Drain roasted peppers and discard the brine. Pat dry and thinly slice 1 cup of the peppers into strips, reserve the remaining for another use. Peel and thinly slice garlic. Rinse and drain chickpeas.Heat 2 tablespoons of the oil in a large high-sided skillet over medium-high and season the chicken with salt and pepper. Brown the chicken, about 5 minutes per side. Remove the chicken to the plate and drain excess fat from skillet.Return the skillet to medium and add the remaining tablespoon of oil, the garlic and chorizo. Cook, stirring until the garlic is light golden, about 2 minutes.Add the roasted pepper and tomato paste and cook, stirring, to toast the paste, 3 minutes.Increase the heat to high and pour the sherry vinegar into the skillet. Boil, until reduced to a glaze, about 2 minutes.Add the chickpeas and pour in the Swanson® Chicken Stock. Bring to a rolling boil.Nestle the browned chicken thighs into the skillet, skin side up, and transfer the skillet to the oven. Roast until the chicken is cooked through, about 20 minutes.While the chicken roasts, roughly chop the olives. Pick the parsley leaves and roughly chop.Remove the skillet from the oven and top with the chopped olives and parsley.Recipe by Campbell'sRelated VideoChorizo & Chickpea Braised Chicken ThighsReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}