{"id": "383254d0b31e27af73e8800b44c57db3", "url": "https://www.bonappetit.com/story/dawnie-walton-cocktails", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Novelist Dawnie Walton's Life Story in Eight Drinks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Life Story in Eight DrinksFrom college Kamikazi shots to lounge martinis, novelist Dawnie Walton’s taste in booze has evolved, and so has she.By Dawnie WaltonApril 20, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.1986, Jacksonville, Florida: At the family reunion, I’m supposed to be playing with my gaggle of cousins, but I’m much more interested in peeping the grown folks. Mama plucks a Bartles & Jaymes out of a cooler and sways to Stevie Wonder; Daddy mixes a screwdriver at the card table before the next hand of spades. How delicious those pinks and oranges look, like the colors in a scoop of rainbow sherbet!But even plain brown liquor fascinates me. My G-Mama—my father’s mother and the most elegant woman in the world, with her silvery updos and perfume bottles—keeps bourbon next to her bed. The vessel is always the same: a dainty juice glass painted with golden wheat stalks. I never see her take a sip, but the afternoon light makes the liquid inside glow amber. Though I don’t dare touch, I’m convinced these potions must be magic.1994, Rome: I’m 17 on a spring break tour of Europe. My mother has plundered her savings to afford it, the first time anyone in our family has traveled abroad. So far the first dinner has been a letdown— not the rich pasta I’d been imagining but a lukewarm hamburger with fried potato cubes. My spirits perk up when the waiter brings a bottle of red wine (which Mama, reluctantly, has agreed I can try). I turn my stemmed glass upright, heart pounding as the waiter pours the first alcohol to ever pass my lips. I take a sip and taste not candy but…vinegar? I’ve been duped! I struggle to keep from spitting it out.1997, Portland, Oregon: I’m a summer intern for the daily newspaper. Far from home, my palate expands from California rolls to sashimi. I fall in love with Ethiopian food—the spongy sourness of injera, the spice of doro wat, the communal fun of pinching open the boiled egg at the center of the stew. I’m still wary of most things alcoholic. Everybody here raves about Hefeweizen, but, like all the beer I’ve dared to try, I pronounce it hella vile.Near the end of June, I turn 21 and my roommate Rachel and I plan a big house party. “Dress: Up,” we note on the invitations. I try to look as elegant as G-Mama would and pack a blank cassette tape with ’70s jams. That night we have a tableful of spirits and mixers: What would the birthday girl like to drink? On another birthday years from now, it will be kamikaze shots and the resulting hangover will put me off vodka. But tonight I nurse a few splashes in a cup of cranberry juice before ditching it to dance to “Sir Duke.” I’ve had just enough to feel officially grown.1997, Florida A&M University: I'm in my last semester of college and someone at some party has introduced me to the Midori sour. The color is an electric version of FAMU green, and it tastes like a watermelon Jolly Rancher—so tart that the glands at the back of my jaw do a dance. Awww, snap. This might be it!Dawnie Walton in Paris just before lockdown.\nPhoto by Anthony Santagati1998, Portland Again: I’m back at the newspaper for my first post-college job. “You want a what?” says the guy behind the bar at North by Northwest. I start to repeat my order but realize he’s heard me perfectly well; he just can’t believe what I’ve asked for. Guess a Midori sour ain’t it after all. But thank God for Rachel, who introduces me to a shame-free, tiki-themed watering hole in a weird part of town. The bartenders at the Alibi make tropical fruity drinks, yes, but also keep milk on hand for white Russians. The Big Lebowski has made them a thing. Licking my lips, I'm not mad at The Dude.1999, D.C.: I’m working at The Washington Post, a staff job in the Style section. My résumé shines, but the hours are dismal (5 p.m. to 1 a.m.). I live way out in the Virginia suburbs, near the hellish junction of two interstates. The most nightlife I experience is through the gossip and arts columns I copyedit. I’m 23, and nearly dry.Early to Mid-Aughts, NYC: I’m an editor for an entertainment website—which means going out is part of the gig! Variations on martinis and mojitos are hot, and so is rock and roll: TV on the Radio, the Strokes, the early-’70s classics I love. One day I’ll write a novel inspired by such gorgeous rackets, starring an electric Black woman who lights up New York, but for now I’m just soaking up the scene. The lounges have tiny speakers screwed into the ceiling, plus new-style bartenders called mixologists offering interesting flavors and textures: the smoke of mezcal, the foam of egg white at the top of a fizz. Though I still enjoy the sweet and sour, I learn to love my drink like I love my music: complex, and with a little bite.2021, Brooklyn: My husband hunts down a high-quality CD player as a gift (almost every album I own is available to stream, but I can’t bear to part with my physical copies). Flipping through liner notes, I stumble across faded concert stubs and memories of previous nights out. Due to the pandemic, I won’t be barhopping anytime soon, and since I have no skills in mixing drinks myself, a good red wine is now my go-to. But I can still dream: of the music and the cocktail craftspeople who translate my vague descriptions of the tastes I want into magic. I’d ask for something herby and citrusy, I think. A small prayer of brightness for the summer ahead.Get the Recipe: Rosemary Mezcal FizzLime juice and fresh rosemary give this fizzy-frothy mezcal cocktail plenty of citrusy and herbaceous notes—a small prayer of brightness for the summer ahead.View RecipeLike what you read? Get Dawnie’s book here:The Final Revival of Opal and Nev$27 $13 at Amazon$24 at Barnes and NobleExplore Bon AppétitFirst PersonAll on the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Dawnie Walton"]}