{"id": "3850922f312a2c9a19d450537545f3df", "url": "https://www.bonappetit.com/story/recipe-writing-whitewashed", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "When Did Recipe Writing Get So...Whitewashed? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen Did Recipe Writing Get So...Whitewashed?Cookbook authors Priya Krishna and Yewande Komolafe discuss.By Priya KrishnaJuly 29, 2020FacebookTwitterEmailPhoto by Yewande KomolafeFacebookTwitterEmailBack in May—what seems like truly an eternity ago—I was sitting in my parents’ backyard in Dallas, catching up over FaceTime with Yewande Komolafe, a talented recipe developer, writer, and author of a highly anticipated cookbook on Nigerian food out next year. The conversation turned to discussing our grievances with recipe writing. We lamented the extra labor that non-white people are often asked to do—from including additional explanations of dishes in the hed note to finding imperfect substitutions for ingredients—in service of making their recipes more accessible to a white audience. We started to wonder: when did American recipe writing get so... whitewashed? Has it always been this way? So last week, we sat down to continue the conversation, looking back at how our communities have historically shared food traditions, while envisioning what a more inclusive system of American recipe writing might look like.Priya: You and I were talking a bit ago about the frustrations that we have faced as recipe developers because of the whiteness that is so pervasive in recipe writing.Yewande: Well, food in general.Yes, food in general. But recipes are a great example of that. I'd love for you to talk a little bit about your process for developing and writing down a recipe.I'm always backtracking. In my head, a dish will exist as something that I've experienced or tasted before. I start there, and then I'm trying to recreate that.We both grew up in kitchens where our families didn’t follow recipes. Does the process even feel natural to you?I’m actually a scientist at heart. Before I went to culinary arts school, I went to college and got a degree in Biology and Psychology, and took chemistry classes. So in a certain way, exact measurements and instructions totally speak to me. Also, my mom is a food scientist. I grew up around her test kitchen at work, where she was in charge of creating new food items for Cadbury's Chocolate out of Nigeria.At the same time, though, it's something I'm increasingly questioning—especially when it comes to the way recipes are written in cookbooks and magazines. I think too often the expectation is that if you as a home cook follow a recipe exactly, then it's going to look like the picture. And that's not true. I don't cook like that. I don't think that most people cook like that. A recipe should be more like a set of guidelines.I look at a recipe and I don't see guidelines. I see very specific rules: one half cup of this, and one teaspoon of that. What, to you, is flawed about Western conventions of recipe writing?I think that they place too much power with the person who wrote the recipe and not enough emphasis on the person who is making the recipe. I've been called \"the voice of Nigerian cooking.\" No, I'm just one perspective of Nigerian cooking. If you make my recipe for jollof rice, that isn’t necessarily how jollof rice is made in all of Nigeria. It’s specific to me.Yewande Komolafe\nPhoto by Steph GoralnickThe question of power is really interesting. If you look at a lot of early, popular American cookbooks, who are they written by? White people. White people took credit for the recipes of the people they enslaved. White people initially codified Indian food for Western audiences. So much of the canon of American food has been told through this very white Euro perspective.The job of recipe writer shouldn’t be for one type of person. Anybody can write recipes. But historically, it has been a job that mostly white people do. The power dynamic has to shift.At first, the power came from being able to read, write, and have access to the resources to actually record and publish their process—all things that require privilege. Now you see people like you and me having access to those resources, having that know-how, and yet we both are still asked to fit our recipes into certain conventions.I’m realizing that there’s so much value to oral tradition. It kind of just blows apart the notion that you need a written recipe for a food culture to exist. You can pass on recipes without writing them down—even without using a scale.I use my scale every morning. I literally cannot make my coffee without a scale. That's how much I've been trained to think that my scale is my most important tool. And yet, there is a craft and a knowledge that exists without writing things down, without measuring, and that's also a very beautiful thing.Ultimately, there are great limitations to the written word, and I think non-white communities and non-Western societies have long understood that.Yeah, like tell me in writing what asafoetida is.Exactly. It's really hard.It blew my mind when I first moved here how there’s a name for everything. Like, in Nigerian cooking there's this process where you take a starch and you pound it, but there’s no technical name for it. I think the way we write recipes now almost demands that we have one word for a given technique. When you throw spices in oil, it's called blooming. But do you bloom onions, too? Do you bloom dried fish?Being a part of a community where oral traditions are so common, where do you see your cookbook fitting in, as a written piece?I think of myself as dispersed from the place where I grew up. It’s not always convenient to get on the phone and talk to my mom for two hours, or be on FaceTime with her to watch her cook something. That's why I'm writing a cookbook of Nigerian basics—because there's been movement, there's been migration. Not all Nigerians live in Nigeria. I’m writing this book for ease and for convenience, and to ensure that these recipes are passed down, even when there's no oral tradition.Priya Krishna, left, with her mother, Ritu.\nPhoto by Mackenzie KelleyWhen I was writing Indian-ish there was a constant tension between me and my mother where she felt it was insane to ask someone to measure out a half cup of cilantro to garnish a bowl of dal. I kept asking things like, “Is that a medium tomato or a small tomato?” My mom would get so frustrated. She’d say, “If you use more cilantro, less cilantro, if you use three tomatoes, or two tomatoes, the dish will still taste good.”Whose standards are those anyway?And then there are the ingredients themselves. For my cookbook, I felt like I was constantly self-conscious about the fact that someone might not be able to find chaat masala or curry leaves: how do I accommodate that person?Food media is always addressing the white reader. Even if it's a story about Nigerian food, I’m asked to make substitutions, because where would people find scotch bonnet peppers? People want convenience. They don’t want to go to Harlem to get palm oil, so they ask what they can substitute from Whole Foods, when in fact there’s nothing that tastes or feels like it. I want to see people who make my recipes commit to the full dish.We're in this odd double bind where we're asked to provide substitutions for our ingredients, and yet, those same ingredients we grew up with are Columbused by white people. They don't want to buy turmeric to make dal. They want to buy it to make something called golden milk. Why can't we find that middle ground?I think it’s because of the way the food industry is structured. If I'm pitching a recipe to editors who have zero context of what I'm talking about, then they're going to ask a lot of questions about every single ingredient. It’s not possible to fairly talk about global foods when the people on the masthead don’t reflect the communities where that food is coming from.I think that there's this feeling within these publications that they just discovered turmeric, or they just discovered palm oil. But no, millions of people eat this food every day. I'm here for a food world that reflects the actual world that we live in.It's why modifiers like “simple” or “weeknight” that many publications (including BA) have historically added always make me laugh. Indian is my weeknight food. There's no weeknight dal and then dal. It's all just dal. It’s as if our food needs to be made more approachable.Yeah, I had to fight to not get the name of jollof rice changed to baked tomato pepper rice. And I'm just like, nobody's going to know what that is. It's jollof rice. I don't know who calls it tomato baked rice.It’s also true that those compromises will often put people of color in a really awkward position with the rest of their community. I was so excited to publish my mom's recipe for kadhi, a wonderful dish I grew up eating. The recipe title reads \"Kadhi,\" and then in parentheses \"Turmeric Yogurt Soup.\" Of course, people in the South Asian community were like, \"What are you doing calling it a soup?\"We end up straddling this place where it's like, I'm so excited that you're going to include Nigerian recipes in the pages of this food section, but by the time it reaches a Nigerian audience or a West African audience, they don't even know what it is anymore. They're like, \"Wait, what? Why'd you do that to our recipe?\"Priya's kadhi. \nPhoto by Emma Fishman, food styling by yekaterina boystova, prop styling by Allie WistLast year when my book was coming out, I had to take a stand against italicizing non-English words. It's a way that Western publications literally \"other\" non-white foods: they make them look different. But why can't dal and jollof rice and macaroni and cheese all exist in the same font style?Moving here, I had to do the work to understand what a burger was, or what french fries were. Why are publications assuming that as a consumer you don't have to do any work?I think this is another reason why, to your earlier point, there needs to be people of color in editorial leadership positions. I can't tell you how many times I've written a story and not a single person of color touches it or reads it. Even in editorial meetings, people assume things about our collective tastes as a group.More and more I’m becoming okay being the lone voice saying, \"No, I don't get it,\" or \"No, I don't agree.\" More and more I'm becoming comfortable asking for a Black photographer or Black food stylist to work on something with me.On the one hand, I feel guilty asking a white person to not center themselves. But at the same time, I have been forced to think outside of myself and my identity my entire career. So why can't white editors change their mindset now?When you’re molding whatever you're saying in a way that makes it okay for a white listener or a white reader, you don't get to be your full self. I want to be my full self wherever I go.I think the future of recipe writing is about empowering recipe writers of color to own their full selves.I hope it’s shifting. I know individually at least, in conversations like this, it is shifting.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-29", "author": ["Condé Nast", "Priya Krishna"]}