{"id": "386834a10e8036bf0f7b0e89f84fadf6", "url": "https://www.bonappetit.com/recipe/fettuccine-alfredo", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Fettuccine Alfredo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2016 IssueFettuccine AlfredoBy Carla Lalli MusicPhotography by Michael Graydon Nikole HerriottFebruary 23, 20224.3(168)Read ReviewsTriangleEmailPinterestPrintMichael Graydon & Nikole HerriottEmailPinterestPrintEmailPinterestPrintIn the early 1900s, Italian restaurateur Alfredo Di Lelio started serving plates of pasta, cheese, and butter at his restaurant in Rome. Known today as fettuccine Alfredo, the dish gained more fame in the past century in the U.S. than in its home country. But it also evolved in its new environs, and American cooks added heavy cream to thicken and enrich the sauce, and sometimes tossed the pasta with chicken or shrimp. To each their own, but no real fettuccine Alfredo recipe should ever (ever!) include cream.Like Roman staples cacio e pepe and pasta alla gricia, the gloss in Alfredo sauce comes from an emulsion of starchy pasta water and cheese—and, in this case, butter. It’s not a complicated technique, but it requires patience. Add the butter and then the cheese to the pan gradually, making sure everything has come together before you whisk in more. For extra guidance, check out this step-by-step video.The short ingredient list—pasta, butter, and Parmesan—means this is the place to be choosy, particularly with the cheese. Parmigiano Reggiano, which is stamped with its name on the side of the wheel, is the classic choice and will absolutely give you the best flavor, but there are (less expensive) substitutes. Whatever you buy, choose a whole wedge and grate it yourself—or, pulse it in a food processor or high-powered blender (about five 30-second pulses should do it), which will produce small beads of cheese that melt evenly.Editor’s note: This recipe was originally published in our October 2016 issue.Ingredients4  Servings12ounces fettuccine or other long pastaKosher salt¼cup (½ stick) unsalted butter, cut into small pieces¾cup finely grated Parmesan, plus more for servingFreshly ground black pepperPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente. Drain, reserving 2 cups pasta cooking liquid.Step 2Transfer 1 cup pasta cooking liquid to a large skillet. Bring to a gentle simmer, then whisk in butter, no more than 1 tablespoon at a time, until melted. Whisking constantly, gradually add cheese, making sure it’s completely melted and incorporated before adding more. Add pasta and toss to coat, adding more pasta cooking liquid as needed, until sauce blankets noodles completely. Serve topped with pepper and more cheese.How would you rate Fettuccine Alfredo?Leave a ReviewTell us what you thinkReviews (89)Back to TopTriangleHISTORY OF ALFREDO DI LELIO CREATOR IN 1908 OF “FETTUCCINE ALL’ALFREDO” (“FETTUCCINE ALFREDO”), NOW SERVED BY HIS NEPHEW INES DI LELIO, AT THE RESTAURANT “IL VERO ALFREDO” – “ALFREDO DI ROMA”  IN ROME, PIAZZA AUGUSTO IMPERATORE 30\nWith reference to your article I have the pleasure to tell you the history of my grandfather Alfredo Di Lelio, who is the creator of “Fettuccine all’Alfredo” (“Fettuccine Alfredo”) in 1908 in the “trattoria” run by his mother Angelina in Rome, Piazza Rosa (Piazza disappeared in 1910 following the construction of the Galleria Colonna / Sordi). This “trattoria” of  Piazza Rosa has become the “birthplace of fettuccine all’Alfredo”.\nMore specifically, as is well known to many people who love the “fettuccine all’Alfredo\", this famous dish in the world was invented by Alfredo Di Lelio concerned about the lack of appetite of his wife Ines, who was pregnant with my father Armando (born February 26, 1908). \nAlfredo Di Lelio opened his restaurant “Alfredo” in 1914 in Rome  and  in 1943, during the war, he sold the restaurant to others outside his family.\nIn 1948 Alfredo Di Lelio decided to reopen with his son Armando his restaurant in Piazza Augusto Imperatore n.30 \"Il Vero Alfredo\" (“Alfredo di Roma”),  whose fame in the world has been strengthened by his nephew Alfredo and that now managed by me, with the famous “gold cutlery” (fork and spoon gold) donated in 1927 by two well-known American actors Mary Pickford and Douglas Fairbanks  (in gratitude for the hospitality).\nSee the website of “Il Vero Alfredo”. \nI must clarify that other restaurants \"Alfredo\" in Rome do not belong and are out of my brand  \"Il Vero Alfredo – Alfredo di Roma\". \nThe brand \"Il Vero Alfredo - Alfredo di Roma\" is present in Mexico with a restaurant in Mexico City and a trattoria in Cozumel on the basis of franchising relationships with the Group Hotel Presidente Intercontinental Mexico.\nThe restaurant “Il Vero Alfredo” is in the Registry of “Historic Shops of Excellence - section on Historical Activities of Excellence” of the Municipality of Roma Capitale.\nBest regards Ines Di Lelio\n\nIN ITALIANO\n\nSTORIA DI ALFREDO DI LELIO, CREATORE DELLE “FETTUCCINE ALL’ALFREDO” (“FETTUCCINE ALFREDO”), E DELLA SUA TRADIZIONE FAMILIARE PRESSO IL RISTORANTE “IL VERO ALFREDO” (“ALFREDO DI ROMA”) IN PIAZZA AUGUSTO IMPERATORE A ROMA   \n\nCon riferimento al Vostro articolo ho il piacere di raccontarVi la storia di mio nonno Alfredo Di Lelio, inventore delle note \"fettuccine all'Alfredo\" (“Fettuccine Alfredo”).\nAlfredo Di Lelio, nato nel settembre del 1883 a Roma in Vicolo di Santa Maria in Trastevere, cominciò a lavorare fin da ragazzo nella piccola trattoria aperta da sua madre Angelina in Piazza Rosa, un piccolo slargo (scomparso intorno al 1910) che esisteva prima della costruzione della Galleria Colonna (ora Galleria Sordi).\nIl 1908 fu un anno indimenticabile per Alfredo Di Lelio: nacque, infatti, suo figlio Armando e videro contemporaneamente la luce in tale trattoria di Piazza Rosa le sue “fettuccine”, divenute poi famose in tutto il mondo. Questa trattoria è “the birthplace of fettuccine all’Alfredo”.\nAlfredo Di Lelio inventò le sue “fettuccine” per dare un ricostituente naturale, a base di burro e parmigiano, a sua moglie (e mia nonna) Ines, prostrata in seguito al parto del suo primogenito (mio padre Armando). Il piatto delle “fettuccine” fu un successo familiare prima ancora di diventare il piatto che rese noto e popolare Alfredo Di Lelio, personaggio con “i baffi all’Umberto” ed i calli alle mani a forza di mischiare le sue “fettuccine” davanti ai clienti sempre più numerosi.\nNel 1914, a seguito della chiusura di detta trattoria per la scomparsa di Piazza Rosa dovuta alla costruzione della Galleria Colonna, Alfredo Di Lelio decise di aprire a Roma il suo ristorante “Alfredo” che gestì fino al 1943, per poi cedere l’attività a terzi estranei alla sua famiglia. \nMa l’assenza dalla scena gastronomica di Alfredo Di Lelio fu del tutto transitoria. Infatti nel 1948 riprese il controllo della sua tradizione familiare ed aprì, insieme al figlio Armando, il ristorante “Il Vero Alfredo” (noto all’estero anche come “Alfredo di Roma”) in Piazza Augusto Imperatore n.30 (cfr. il sito web di Il Vero Alfredo).\nCon l’avvio del nuovo ristorante Alfredo Di Lelio ottenne un forte successo di pubblico e di clienti negli anni della “dolce vita”. Successo, che, tuttora, richiama nel ristorante un flusso continuo di turisti da ogni parte del mondo per assaggiare le famose “fettuccine all’Alfredo” al doppio burro da me servite, con \nl’impegno di continuare nel tempo la tradizione familiare dei miei cari maestri, nonno Alfredo, mio padre Armando e mio fratello Alfredo. In particolare le fettuccine sono servite ai clienti con 2 “posate d’oro”: una forchetta ed un cucchiaio d’oro regalati nel 1927 ad Alfredo dai due noti attori americani M. Pickford e D. Fairbanks (in segno di gratitudine per l’ospitalità).\nDesidero precisare che altri ristoranti “Alfredo” a Roma non appartengono e sono fuori dal mio brand di famiglia.\nIl brand “Il Vero Alfredo – Alfredo di Roma” è presente in Messico con un ristorante  a Città del Messico e una trattoria a Cozumel sulla base di rapporti di franchising con il Group Hotel Presidente Intercontinental Mexico.   \nVi informo che il Ristorante “Il Vero Alfredo” è presente nell’Albo dei “Negozi Storici di Eccellenza – sezione Attività Storiche di Eccellenza” del Comune di Roma Capitale.\n\nGrata per la Vostra attenzione ed ospitalità nel Vostro interessante blog, cordiali saluti\nInes Di Lelio\nInes Di LelioRome. Italy2/25/2022It is amazingly delicious if you make it right !!AnonymousBoston, MA9/25/2021I enjoyed Bon Appetit's pasta carbonara, so I decided to try other pasta dishes. This was disappointing, compared to the carbonara.AnonymousMountain View, CA9/9/2021A superb recipe. Just follow it and you will be ok. The thing is, you need good cheese and you need to whisk the butter and water vigorously to get a good emulsion. I also find letting the pasta sit in the sauce until it thickens is a more satisfying experience. BLMToronto. CA8/18/2021A few notes fir those who have issues with this recipe. This is an emulsion, not a cream sauce. It will not get thick but it will incorporate the butter into the pasta water so that it can coat the pasta (melted butter basically rolls off the pasta, an emulsion coats). The butter must be cold and cut into small pieces. Get the pasta water simmering and add all the butter at once then whisk gently until it becomes an emulsion take off the heat and add all at once. Whisk again until it joins the sauce. If you are cooking fresh pasta it can very quickly so you should use a lot less water than usual so the starch is concentrated. Once the cheese is melted, add the pasta and toss to coat. In the original Alfredo’s restaurant this was prepared table side and truffles were shaved generously over it, which smells amazing and tastes fantastic. Alfredo should never have anything but pasta water, butter, and cheese in it. Make sure the cooking water has salt in it but remember part is salty. And do not use store bought grated cheese- it has chemicals to keep it from clumping and it will not melt properly. Only real parm from Italy!Martin EdicRochester, NY4/24/2021This recipe is ABSOLUTE GARBAGE. Tried the immersion blender technique too. Waste of time and energy . Anonymous4/23/2021This went poorly to say the leastAnonymousWisconsin4/2/2021I made this at the beginning of the pandemic and it was truly phenomenal. Absolutely amazing. But every time since then I can’t get this to emulsify. The cheese becomes gluey or the sauce is clumpy. I’m not sure if it’s a pan I’m using or the cheese or what but I know it’s my error. Love this recipe but I can’t get it right 99% of the time. Regardless, butter and cheese on noodles never disappoints. Lauren Washington, DC3/31/2021I can’t believe how easy it was. The flavor is second to none and I make this regularly now. Would definitely recommend using a higher quality Parmesan for the best flavor!Nancy from Cranston is GrossAustin3/29/2021Turned out beautifully! I have been cooking at home for years now and love experimenting, but by no means an expert. Just a home cook here! It turned out perfect on my first try whisking by hand. Great recipe and loved learning a new technique!Aneila BakerMcgaheysville, VA3/10/2021My god, this was delicious! I made a batch of duck egg & semolina pasta this morning, and was looking for a no-fuss dinner recipe to use it with. Turned out superbly! The sauce came together quickly, which I think was helped by the super starchy pasta water.  Do yourself a favour and be generous with your cheese.  I had a blend of parmesan and pecorino in the fridge... used  lot of it and have zero regrets. Thanks for the recipe, it's going straight into my favourites! Casey TAustralia3/6/2021Great recipe. It's basically wide noodle pasta, butter, and Parmigiana Reggiano in the salted pasta water with pepper. Agree, you need to stir this for a good two minutes until it emulsifies. By hand. Then add pepper. That's about it. Delicious. Not understanding how this is hard? It's way better than cream-based FA. I made it again tonight and it is a family favorite, couldn't be more simple. Added a chopped Roma and some grilled chicken.AnonymousSt Louis, MO3/6/2021I made this recipe with very high hopes. I had read reviews that it did not work out and followed their advise. I made sure the my cheese was completely well incorporated before adding more. I whisked like a m*****f***** my arm hurt but my sauce did not emulsify. A piece of advise (this is how I saved my sauce) if your sauce is not emulsifying but it into your blender and blend on medium speed for like 5-8 minutes then let it simmer back in your pan. The taste was alright but definitely not worth the pain in the  a** this recipe took to make. \n\n2.5/5  AnonymousLos Angeles, CA3/2/2021I do using a vintage parmesan (plenty) 120 months old.\nDelicious.PierinoModena, Italy2/7/2021I really have to say, I like it so much more with cream otherwise give me caico de pepeAnonymousNYC2/2/2021Explore Bon AppétitPastaItalian AmericanAmericanFettuccinePasta & NoodlesParmesanCheeseEasyQuickWeeknight Meals5 Ingredients or FewerMainVegetarianNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-09-21", "author": ["Condé Nast", "Carla Lalli Music", "Michael Graydon Nikole Herriott"]}