{"id": "386abd65d9f53bcd56ba06b5dfed8dcc", "url": "https://www.bonappetit.com/story/natalie-portman-vegan-ice-cream", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Natalie Portman’s Food Philosophies Mostly Involve Vegan Ice Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNatalie Portman’s Food Philosophies Mostly Involve Vegan Ice CreamAnd tempeh bacon, home-grown avocados, homemade hummus, and “throw-it-all-in” one-pot meals.By Alyse WhitneyJune 22, 2018FacebookTwitterEmailFacebookTwitterEmailNatalie Portman has been vegan for almost a decade, and most of that time has been spent trying to find her platonic ideal of vegan ice cream. If she could only eat two flavors for the rest of her life, they’d be Magpies’ soft serve “fried pie”—which she says tastes like “the most satisfying, amazing Carvel ice cream cake from my childhood”—and Van Leeuwen’s mint chip and matcha scoops. “Every flavor, I will just go to town on,” she jokes when we talk on the phone.Portman’s overall food philosophy is all about balance. “I really love food, and I want to take joy in it, and part of enjoying my food is also knowing that it’s positive for other creatures and not harming anyone,” she explains. Portman had been a vegetarian since she was nine years old, but she cut out dairy and eggs in 2009 after reading Jonathan Safran Foer’s Eating Animals. Now, nine years later, she helped turn that the best-selling nonfiction book into a documentary of the same name, both producing and narrating the eye-opening film about the realities of industrial meat production and the ethics of factory farming.In addition to vegan ice creams, Natalie Portman has sussed out the best vegan alternatives for her other favorite foods. The least-cardboard-like bacon is Lightlife, though she’s “not sure it tastes like actual bacon because I haven’t had it in a very long time.” Impossible Burgers and other products from Impossible Meat are her go-tos for cooking protein at home. To top a burger or to spread on crackers, she reaches for Kite Hill’s garlic-herb spreadable nut cheese. Put them all together and you have a dream vegan bacon cheeseburger.When Portman moved from Paris back to Los Angeles a few years ago, she learned more about seasonality and now always tries to buy what’s freshest. (Right now, she’s glad it’s finally peach season.) Trips to the farmers’ market led to her and her husband Benjamin Millepied starting their own robust garden: herbs, chard, artichokes, carrots, tomatoes, peppers, lemons, avocados, figs, peaches, and even olives (which she’s going to learn to brine next).The literal fruits and vegetables of their labor go into “very, very basic” meals. Millepied does most of the cooking for their family of four, but Portman will make a lot of couscous, Tagines, veggie stir-fries, chilis, and other “one-pot, throw-it-all-in” dishes, plus the occasional hummus or tahini to “satisfy the Israeli in me.” The household isn’t entirely vegan, though: Her husband eats meat, and they are letting their kids make their own decisions about how and what they want to eat. “My son has actually become quite an animal rights activist and is very vegetarian. He’s very passionate about it, so he’s on my team” she says of her seven-year-old son, Aleph. But the ritual of sitting down to a family meal is the most important thing to Portman—and, of course, everyone gets vegan ice cream for dessert.Explore Bon AppétitVeganCelebritiesHealthyishInterviewsRead MoreLifestyleOur Favorite Ice Cream Brand Just Dropped a Dairy-Free LineBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Alyse Whitney"]}