{"id": "386ea7aae0202899a56e252618fc095c", "url": "https://www.bonappetit.com/recipe/cornbread-and-salami-dressing", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Cornbread and Salami Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueCornbread and Salami DressingBy illyanna MaisonetOctober 20, 20204.1(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis eggless dressing holds together just fine thanks to plenty of chicken broth and tender cornbread that takes on the ideal crispy-soft texture. “Buttery boxed cornbread mix and salty salami, when placed on a fork with a piece of turkey and rich gravy, is the perfect bite,” says writer illyanna Maisonet. Serve this dressing with her family recipe for Pavochon, the centerpiece of a Puerto Rican Thanksgiving.Ingredients8 Servings8Tbsp. (1 stick) unsalted butter, divided, plus more for pan12cups 1\" cubes cornbread18–10-oz. salami, cut into ½\" pieces1large onion, cut into ½\" pieces3celery stalks, cut into ½\" pieces5garlic cloves, choppedKosher salt, freshly ground pepper3Tbsp. finely chopped sage15–7-oz. bag stuffing mix croutons3cups low-sodium chicken brothPreparationStep 1Place rack in middle of oven; preheat oven to 350°. Butter a 13x9\" glass baking dish. Arrange cornbread in an even layer on a rimmed baking sheet and bake, tossing halfway through, until golden brown around edges and partially dried out, 25–30 minutes. Let cool.Step 2Meanwhile, melt 1 Tbsp. butter in a large skillet over medium heat. Cook salami, tossing often, until lightly browned, about 4 minutes. Using a slotted spoon, transfer salami to a large bowl.Step 3Add remaining 7 Tbsp. butter to skillet and let melt. Add onion, celery, and garlic, and season with salt and pepper. Cook (still over medium), stirring occasionally, until very soft, 10–12 minutes. Add sage and toss to combine.Step 4Add croutons and toasted cornbread to salami and gently toss to combine. Add vegetable mixture and any butter in skillet and gently toss again. Drizzle broth over and let it absorb into bread; season with salt and pepper. Toss gently until just combined (overmixing will cause the cornbread to fall apart); season with more salt and pepper if needed. Dressing should be moist, but there shouldn’t be any liquid pooling in bottom of bowl.Step 5Transfer to prepared baking dish and bake until golden brown on top and bottom, 40–45 minutes.How would you rate Cornbread and Salami Dressing?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangledelicious flavor 'cause... salami. but so dry you have to eat it out in the rain. don't hold to 3C liquid. made this  TG 2020 and can't stress how dry it was. like we just baked a pan of croutons or like there is a typo in the recipe. trying again this year cause we love the salami but i'm trusting my instincts and just riffing on it.sanguinesque2794611/13/2021I made this for Thanksgiving.. was  the BEST!!AnonymousUmatilla, Oregon11/27/2020In case anyone was wondering, two boxes of jiffy cornbread mix makes about the right amount for this recipe. Toss as minimally as possible as mine was quite crumbly. Such a yummy combo.Izzy SiedmanPortland, ME11/25/2020Made it.  Loved it.  Unconventional but soooo good. Bobby KarimianToronto, ON11/25/2020Explore Bon AppétitStuffingSalamiCured MeatMeatSideNut-FreeThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Illyanna Maisonet"]}