{"id": "3877953e774d94a51357cd1d05abe857", "url": "https://www.bonappetit.com/story/hannah-bronfman-tips-dining-out", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "How to Eat Healthy at Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Hannah Bronfman Stays Healthy While Eating Out a TonThe HBFIT founder is not NOT going to order the burger.By Julia BlackJanuary 18, 2018FacebookTwitterEmailProcessed with VSCO with a5 presetCopyright 2018. All rights reserved.FacebookTwitterEmailBy now, you've learned how to prepare yourself two weeks' worth of healthy meals and routines to help you feel your best year-round. But the best-laid food plans often go awry when you leave the comfort of your own kitchen for the temptation-laden menu of your favorite restaurant. (After all, they say the reason it's so difficult to recreate your favorite restaurant dishes at home is that chefs use amounts of fat and salt that would be difficult for you to, well, stomach.)But if anyone has mastered the art of balancing a full-to-the-brim social and work calendar with a healthy lifestyle, it's HBFIT founder Hannah Bronfman. As fashion's favorite DJ, she travels the world to attend glamorous parties where the bar is always beckoning and temptations pass by on every hors d'oeuvres platter. As a health, beauty, and fitness entrepreneur, she frequently eats and drinks out while taking meetings. And as a self-proclaimed foodie, she loves to keep up with the best new restaurants and what her favorite chefs are up to.Bronfman has developed a few key strategies to make sure your health plans aren't derailed every time you go out to eat.A fully-loaded salad is always a good idea.\nFeast on the good stuff, nibble on the rest.\"I'm not too concerned about portions because I'm eating really nutritious food. Most of my diet is based on the keto fundamentals: high fat, lean protein, pretty much no simple carbs, and some great complex carbs like vegetables. So I don't really necessarily deprive myself because I know how mindful I am when I'm eating. [I'll often order] a big salad where I can add a lot of olive oil, protein, veggies.\" The same rules don't apply across the whole menu, of course. \"If I'm going to one of my favorite restaurants like 4 Charles Prime Rib, I'm honestly ordering a burger and I'm having a fourth of it. I'm not throwing all of my shit off, but I'm also loving the flavor.\"Do a gut check.You don't have to order the big, hearty entrée for dinner if you're still full from your late lunch. \"A big thing for me is understanding when I'm hungry and when I'm not,\" says Bronfman. \"[I’ll ask myself,] What is this feeling right now? Have I had any water in the last three hours? Should I drink a big glass of water, or am I craving food? That's a big thing, taking my own temperature.\"Plan ahead.Especially if you're vegetarian, vegan, gluten-free or have other specific dietary restrictions, says Bronfman, \"it's helpful to do research to find places that have the best options for you. I do that whenever I travel to a new city. I always want to know where the nearest juice places are. Where can I find Bulletproof Coffee? Where can I find chia seed pudding?\" Map out a few good options before you head to a new city or even a new neighborhood so that you're not stuck making mealtime decisions on a growling stomach.Nix fried food and sugar-laden drinks.\"[My only hard-and-fast rule is] no fried food.\" You don't necessarily have to cut out alcohol altogether, but those syrupy cocktails won't do your body any favors in the morning or in the long run. \"We're young. We're not going to stop going out,\" says Bronfman. \"But, for me, it's tequila all the time, on the rocks with lime and maybe a little jalapeño.\"Eating Italian? Opt for the meatballs.\nFocus on what you're keeping, not what you're cutting out.\"Don't go to an Italian place and then sit there all upset that you can't eat pasta. I'm not going to torture myself like that. Emilio's Ballato, one of my favorite Italian places has amazing meatballs, so I'll order those with a tricolor salad and a mushroom dish. I'm a big broth person, which is why I also love soba and ramen. I do try to avoid the noodles and go for all the other goodness in those bowls of deliciousness, but a few noodles never killed anyone! That's my favorite thing to get from Hanoi House. Their pho is outrageous.\"Up your supplement game.\"I try to stay away from dairy and gluten, but sometimes eating out I'll compromise on the dairy stuff. When I eat dairy, I bloat up pretty easily—even my face gets puffy—so I have a great fenugreek and thyme supplement to combat that.\"Ask for accommodations... nicely.Some menus will clearly state their “no substitutions or alterations” policy, and there's not much you can do about that. But others—as long as you're friendly, polite, and reasonable—will be willing to work with you. \"I'm not the type of person who likes to make a lot of requests or substitutions; I just find that that's annoying for the servers and the chef. I always just try to find something that they already have going. Like the spaghetti and meatballs. 'Can I do that without the spaghetti?' They're like, 'Of course!'\"Find a teammate.[My husband] Brendan and I love going out for brunch, we love going out to dinner with friends, we love cooking and having people over. He's very healthy, but he also loves a nacho plate. I think for us it's everything in moderation. We're people who really love to live life so we're not depriving ourselves or being super strict all the time. It's about making yourself a little bit flexible in your own beliefs.\"Here's a zoodle soup we bet Hannah Bronfman would love:Root Vegetable Zoodle Soup with Bacon and Basil OilFirst of all, zoodle is a made-up word for vegetables that have been cut to look like noodles. Make this recipe vegetarian by substituting 8 oz. fresh shiitake mushrooms in place of the bacon and using a vegetable stock or water.View RecipeExplore Bon AppétitRestaurants + TravelHealthyishInterviewsRead Moreculture'Battle of the Sexes' Star Natalie Morales Is Queer, Vegetarian, Cuban, and ProudBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Julia Black"]}