{"id": "387fd6301ca122f9021385c0009c1b1d", "url": "https://www.bonappetit.com/story/mindful-eating-nuns", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Mindful Eating and What I Learned From a Group of Progressive Nuns | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat a Group of Progressive Nuns Taught Me About Mindful EatingBefore they dig in, the Dominican Sisters of Hope thank God but they also thank the growers, the pickers, the transporters, the recipe writers...By  Gina CilibertoJuly 18, 2018FacebookTwitterEmailIllustration by Adrian ForrowFacebookTwitterEmailFor the past four years, I’ve worked with the Dominican Sisters of Hope, a group of Catholic Sisters in New York who take eating seriously. A progressive bunch, the 140 sisters focus their ministries on everything from anti-fracking campaigns and beekeeping to teaching sign language and building homes for those affected by natural disasters, among others. But everyday at noon sharp, you’ll find anywhere from 10 to 40 sisters in the dining room at The Mariandale Center, their headquarters in Ossining, NY, piling soup, meat and pastas, and vegetables and greens from the garden onto their plates.For the next hour, no one works or wanders off or checks a phone. There’s one table and a row of hot trays. There’s conversation and laughter around the yellow-walled room, and there’s often a slew of comments about what spices are in the soup or how pleasantly crispy the homemade croutons are today. Beef and cold cuts are never served, but a freshly baked dessert is available with every meal in addition to cookies kept in a jar. Even if the flavors aren’t spectacular, there are almost always second helpings. It’s clear that eating is, for these women, a joy.I never imagined myself working with nuns. During my time at public school, then a Catholic university, I never knew any religious women or had any affinity for them. Yet, when I saw a listing on my alma mater’s career site for a digital journalist position with the Dominican Sisters of Hope, I applied. They were looking for someone to conceptualize and launch a new website, write daily content, and manage the community’s social media presence. Four years later, I’m still working to introduce the justice and spirituality mission of the sisters to new audiences (including those who watch Inside Amy Schumer) in a way that prioritizes values over dogma.When I started my job, I thought the sisters’ fanfare around eating appreciation was a little much. At bigger, more formal dinners, the sisters pray aloud for everyone who grew, harvested, transported, and cooked the food before they eat. Though praying for a litany of souls is customary for Catholics, this specific ritual takes at least five minutes, during which time the food is getting cold. It always seemed to me that when one says a very generic prayer before eating, God understands that it includes pickers, growers, transporters, recipe-writers, servers, cooks, etc. Once I have hot food in front of me, I want to go at it. The sisters, contrarily, wait patiently with their heads bowed. Then, at the end of the meal, they call out the kitchen and serving staff to applaud them and sing a blessing over them.This isn’t to say that I don’t appreciate food, especially that which is promised to be fancy or adventurous. I relish fish ball soup, salty plum juice, or squid soaked in its own ink; dating a homebrewer, I'm exposed to IPAs that resemble a peanut-butter-and-jelly sandwich and gose that’s soured on purpose. But, while fun, these eating experiences don’t necessarily make me more mindful, especially not when I’m compulsively photographing the food to broadcast it via my Instagram feed.At work, though, my conversations with the sisters have bolstered my understanding of the holiness of food. On a macro level, they never use articles in front of “Earth,” due to their unwavering belief that Earth is not a thing but rather a source of energy. As they eat within yards of their herb and vegetable garden, the miracle of photosynthesis is not lost on this group. The sisters frequently talk about how food should be eaten soon after it’s picked, as that’s when it retains the most nutrients and energy. The vegetables and herbs are filled with, they say, light.So, when a sister with whom I'm especially close described eating itself as a prayer, I wasn’t totally surprised. She was talking about her experience on a weeklong silent retreat, and she was making the case that her prayer doesn’t go on hiatus for mealtime. It’s an inherently Buddhist concept, these sisters are largely ecumenical, and there’s never any rush while dining at their table, never any gluttony.Once, a 91-year-old sister told me that her favorite part of growing tomatoes is that she never uses gloves. She loves feeling the soil: the coolness, the wonderful, healthy smell. It’s a “tremendous spiritual uplift,” she said, for her to come into contact with “part of all of this evolution in time,” she said.The poetry of her words struck me. I thought of all the times that I don’t have a strong awareness of what I’m eating or where it came from, whether I’m rushing from one commitment to another or consuming lazily and mindlessly.Most recently, I spent time with a sister who frequently visits an organic farm run by another Dominican community in Goshen (its slogan: our health and well-being begins on the farm and in our relationship to nature). This sister isn’t a farmer herself, but she spends her retreats on the farm walking the land, remembering her family’s extensive gardens from her childhood, and being present with Earth. On one of her retreats, she meditated on a squash plant in front of her. She described her contemplative prayer as feeling grounded by Earth.I have a long way to go before my own eating is a prayer in this way. But, I’m taking small steps. I joined a CSA to simplify the link between my produce and Earth. I’ve advocated for pickers' and growers' rights. And, on a deeper level, four years of lunching with the sisters has affected my own sense of presence. Now, I often reflect on Earth as a living being, on the injustice surrounding farmworkers who grow and pick my food, on the fuel required to transport my food to me. And, when I eat, I try to taste the light.Explore Bon AppétitessayHealthyishRead MoreLifestyleHow Meditating Before Eating Changed My Relationship With FoodBy Perri Ormont BlumbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-18", "author": ["Condé Nast", "Gina Ciliberto"]}