{"id": "389c8e135290d1ceaa69b191f4c5c043", "url": "https://www.bonappetit.com/recipe/basque-burnt-cheesecake", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Basque Burnt Cheesecake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasque Burnt CheesecakeBy Molly BazJanuary 24, 20194.7(478)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis cheesecake is the alter ego to the classic New York–style cheesecake with a press-in cookie crust. Inspired by a Basque version, this is the cheesecake that wants to get burnt, cracked, and cooked at high heat. Which also means this is the cheesecake that’s impossible to mess up.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron10\" Springform Pan$19 $15 At AmazonStand Mixer$460 At AmazonMesh Sieve$13 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonIngredientsMakes one 10\" cakeUnsalted butter (for pan)2lb. cream cheese, room temperature1½cups sugar6large eggs2cups heavy cream1tsp. kosher salt1tsp. vanilla extract⅓cup all-purpose flourSherry (for serving; optional)Special EquipmentA 10\"-diameter springform panPreparationStep 1Place a rack in middle of oven; preheat to 400°. Butter pan, then line with 2 overlapping 16x12\" sheets of parchment, making sure parchment comes at least 2\" above top of pan on all sides. Because the parchment needs to be pleated and creased in some areas to fit in pan, you won’t end up with a clean, smooth outer edge to the cake; that’s okay! Place pan on a rimmed baking sheet.Step 2Beat cream cheese and sugar in the bowl of a stand mixer fitted with the paddle attachment on medium-low speed, scraping down sides of bowl, until very smooth, no lumps remain, and sugar has dissolved, about 2 minutes.Step 3Increase speed to medium and add eggs one at a time, beating each egg 15 seconds before adding the next. Scrape down sides of bowl, then reduce mixer speed to medium-low. Add cream, salt, and vanilla and beat until combined, about 30 seconds.Step 4Turn off mixer and sift flour evenly over cream cheese mixture using a fine-mesh sieve. Beat on low speed until incorporated, about 15 seconds. Scrape down sides of bowl (yet again) and continue to beat until batter is very smooth, homogenous, and silky, about 10 seconds.Step 5Pour batter into prepared pan. Bake cheesecake until deeply golden brown on top and still very jiggly in the center, 60–65 minutes.Step 6Let cool slightly (it will fall drastically as it cools), then unmold. Let cool completely. Carefully peel away parchment from sides of cheesecake. Slice into wedges and serve at room temperature, preferably with a glass of sherry alongside.Do Ahead: Cheesecake be made 1 day ahead. Cover and chill. Be sure to let cheesecake sit for several hours at room temperature to remove chill before serving.Step 7Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Basque Burnt Cheesecake?Leave a ReviewTell us what you thinkReviews (172)Back to TopTriangleAmazing, \nI added a smidgen more sugar and vanilla to mine, but the flavor of the caramelization of the outer part is what does it for me, and the texture is amazing.\nDo not put anything with it except a glass of wine. No berries, no chocolate sauce. Let it stand on its own.MarcIndianapolis 3/24/2022I’ve made this recipe twice. The first time, I served later in the day and it was very light. I found that it has a different consistency when you eat it at room temp/warm or cold from the fridge. The second time I made it, I let it cool for about an hour then stuck it in the fridge about two hours before dinner. Served some fresh strawberries with it. Everyone loved it and even had a second slice. The next day, we went out to dinner and my boyfriend’s parents couldn’t wait to finish dinner and eat the leftover cheesecake.AnonymousPhiladelphia, PA3/13/2022I have used this recipe several times and love the outcome everytime. Crustless, hint of sweetness and creamy. It is everything a Burnt Basque cheesecake should be. Every bite makes you want another slice. This is my all time favorite type of cheesecake to make. Simple, easy and perfect everytime.Mimi LimPhiladelphia, PA2/23/2022First of all, my home was filled with a delightful aroma while baking. This cheesecake has a subtle vanilla flavor and very creamy texture. The caramelization gives depth to the cheesecake's flavor.  Simply delicious!Kate GBuffalo, NY2/16/2022i used a little south american trick and mixed 1tbs dark rum with a little lemon zest and let it sit for a few minutes before adding it into the mix, it really brightened up the flavor and helped cut through all the fat and add some complexity! i know its not traditional but i feel it is my latina right to ignore the traditions of the spaniards and make my own instead AnonymousBoston, MA2/4/2022I can't wait to try this recipe out based on these reviews, but a question if I need to travel with the cheesecake; can I wait to unmold it right before serving, or do I need to put it on a serving plate? How long can I chill it in the fridge?RawanRamallah1/10/2022My new go to Cheesecake! Very simple, creamy and delicious. Very good recipe. Teresita Meadows1/9/2022I made this for Christmas for the first time. It was absolutely perfect. Even better the next day after it had been refrigerated. Molly was right. So so simple. STNiagara Falls, Ontario12/28/2021First time newbies making out first Basque cheesecake. Definitely easy to make. Creamy and delicious. We couldn't wait for it to cool, ate it warm. But it tasted better after being refrigerated. Excited to be able to make this again.  ShareToronto, canada12/14/2021I finally made this famed cheesecake, and funnily enough, it tasted somewhat like the Russian omelet. Interesting but very pleasant, it practically melts in your mouth. A very easy dessertHyeriCalifornia12/12/2021Made this for Thanksgiving and it was a big hit! Absolutely delicious.BethPlymouth, MA11/27/2021Made this twice. Absolutely the best cheesecake I’ve ever eaten. This time I used turbinado sugar instead of white and added a splash of bourbon. Can’t wait!David AndersonNavarre Florida 10/31/2021Love love love this recipe and so does everyone I've made it for. My question is can this recipe be frozen, if so is it just as good afterwards.\nMaryNew Zealand10/23/2021I made this for a potluck at work and it was the best cheesecake ever! The Caramelized top was decadent! I baked it at 30% steam in my steam oven on convection heat at 400 degrees F. It was so light and creamy. The dark brown top and the creamy interior made such a beautiful presentation! This recipe will forever be my go-to Cheesecake recipe, so simple and easy to make.KateSeattle, WA10/19/2021Alright, so I changed this up a lot, in order to treat myself for my birthday. I veganized it, using miyokos cream cheese and just egg, with coconut milk for the dairy substitute. You might be thinking, WTF, she’s INSANE, but all I have to say is….this was INSANELY good. Like everyone else, I checked in at 50 minutes, and it was juuussst beginning to brown. The center looked okay, though. So I turned on the broiler on low  for another 10 minutes or so, and it was beautiful. The coconut flavor was not too pronounced, and even when you did catch a hint, it was a lovely combo with the cake.  I served it with fresh berries and peaches on the side, and yes, I ate it for breakfast on my birthday. MissGingerNew York, NY8/20/2021Explore Bon AppétitCheesecakeCakeDessertCream CheeseCheeseEasyBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Molly Baz"]}