{"id": "38bf35c8b78306e38a8f75bcbd2f4706", "url": "https://www.bonappetit.com/story/make-hot-fudge", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "The Only Thing Better Than Ice Cream... | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Thing Better Than Ice Cream...You can’t bake, you can’t cook, but you can make hot fudge.By Carla Lalli MusicJuly 18, 2019FacebookTwitterEmailPhoto by Stephen LewisFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Guess what I don’t have in my Brooklyn kitchen? Air conditioning. Guess what I’m not doing this weekend? Baking. Guess what’s better than sweating over an all-butter dough in this humidity? Ice cream, that’s what.You heard me. As long as your freezer can hold its own when indoor temperatures hit the mid-80s, ice cream is the ticket. That said (you knew that was coming, right?), we wouldn’t be in this conversation if we didn’t all like making exceptional things to eat. The desire to execute a recipe is irresistible, but making ice cream takes too long! Buy it, and embellish it! Now that ice cream flavors come with the toppings pre-mixed in, the only topping worth tackling is hot fudge.Want this letter before it hits the website? Sign up for our newsletter!Lucky for us, Claire Saffitz figured out how to make hot fudge at home, and the results will eclipse anything you can scrape out of a jar. Hot fudge is more involved than chocolate sauce but less tricky than the walnut-topped confection your great-grandmother made. The key moment comes when you cook cream with brown sugar and agave until it hits 220° on a thermometer, which will drive off the right amount of liquid and change the sugar’s structure so that the mixture will be stretchy and chewy at room temperature. Once that magic moment has elapsed, you add unsweetened chopped chocolate and continue cooking until the mixture is thickened—it only takes a minute but you have to stir diligently the entire time to prevent the chocolate from burning.Hot fudge would definitely be good on this caramel ice cream.\nMichael Graydon & Nikole HerriottOff heat, Claire stirs in cocoa, vanilla, and salt—those ingredients are less sciency and more about seasoning the sauce so that it tastes robustly chocolatey and rich. Inevitably, as soon as you add the cocoa, the mixture will separate and look like a sludgy mud pile, but you didn’t ruin it by mistake! Once you whisk in a little water, it will return to a shiny, supple state. (All of this is in the recipe, by the way.)I did an informal poll of hot fudge enthusiasts earlier today, and I knew I had the right focus group when one of them said that she “got a warm feeling just from hearing the words hot fudge.”“Do you like it when the fudge is hot and streaming over the ice cream, or cold and chewy at the bottom of the bowl?” I asked.“Hot and flowy,” replied Shirley*.“Cold and chewy,” interjected Moe*.“Somewhere in between,” opined Marjorie*.Well, there you have it. Truly and officially, hot fudge is all things to all people, and the ultimate summer food.*Names have been changed.Get the recipe:BA's Best Hot FudgeView RecipeExplore Bon AppétitCarla NewsletterFudgeIce CreamSummerRead MorerestaurantsThe Hype Ice Cream I’m Willing to Wait in Long, Near-Rioting Lines ForBy Sarah JampelcookingA Strawberry Dessert for People Who Can’t BakeBy Carla Lalli MusiccultureOne of My Most Prized Possessions Is an Ice Cream Sandwich Brand's SwagBy Zoë SessumsLifestyleThis Frozen Greek Yogurt Blackout Pie Is Here to Dethrone Ice Cream CakeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-18", "author": ["Condé Nast", "Carla Lalli Music"]}