{"id": "38c6847fece3cad1470fd01d93697d4f", "url": "https://www.bonappetit.com/story/cultured-guru-sauerkraut", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Cultured Guru Sauerkraut Makes Me Truly Excited to Drown My Gut in Probiotics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCultured Guru Sauerkraut Makes Me Truly Excited to Drown My Gut in ProbioticsThe microbiologist-made brand crunches like fresh cabbage and packs in the probiotic microbes too.By Mary Claire LagroueFebruary 14, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailWhen a food possesses superpowers like, oh, a dose of good-for-the-gut bacteria, I can’t help but have faith in it. I just know I will relish the flavor and reap the benefits and sing its praises for all time, forever, amen. It’s a feeling, not a science.Somehow, though, the first two jars of sauerkraut I tried reached their expiration date still half-full. The first one I tried was too pungent; the next was too pasteurized (honest mistake). Out went the jars, and out went the wild optimism I’d placed in sauerkraut.Some months later, I heard about a fermented foods brand called Cultured Guru right where I used to live in Baton Rouge. Its microbe-rich pickles, sauerkraut, and kimchi line the refrigerators of health food stores across Louisiana, from Whole Foods to the no-frills neighborhood shop where I break for produce and plate lunches. Cultured Guru’s Instagram feed of plant-based bowls—bibimbap! sushi bowls! supersized, spiralized salads!—mesmerized me. So did the science behind its products.Put that sauerkraut in a grain bowl.\nMicrobiologist and co-owner Kaitlynn Fenley developed Cultured Guru’s small-batch sauerkraut recipe to allow “the best probiotic microbes from the cabbage to thrive and remain throughout the fermentation process,” she says. A super-specific ratio of sea salt, water, and cabbage means the finished product teems with lots (and lots) of species of Lactobacillus. Fenley tests every batch to be sure.So yeah, I had reason to believe this sauerkraut would be good for me. But I really wanted to know if it would taste good.Cue the praises.Its saltiness, brightness, and just-right tang made me wonder how I ever gave up on sauerkraut. It tasted and crunched like fresh cabbage (!!) after three-ish weeks of fermentation. Turns out, fermenting in an oak barrel keeps the cabbage crisp thanks to tannins, and it boosts the number of bacteria species in the veg. This, I’m told, sets Cultured Guru apart from other fermentation companies in the United States.Now, I’m scooping it onto salads, burgers, and breakfast skillets or downing shots of brine like it’s lemonade. Just like that, I’m stocking up on sauerkraut again before the jar in the fridge even dips below half full.Buy it: Cultured Guru Sauerkraut, $9.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishSauerkrautCondiment/SpreadShoppingRead MoreLifestyleWhat Are Prebiotics and Do We Really Need to Take ANOTHER Supplement Every Day?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-14", "author": ["Condé Nast", "Mary Claire Lagroue"]}