{"id": "38c7a2e2b3483c62b7e4116fb7b5f95d", "url": "https://www.bonappetit.com/story/gueyu-mar-conservas", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Güeyu Mar Conservas Might Be the Best Tinned Fish Out There | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought I Knew Tinned Fish. Then I Tried These Spanish CalamariSpanish conservas brand Güeyu Mar is finally (!) available in the States. Buy many tins. Serve them with everything. By Benjamin KemperFebruary 25, 2021FacebookTwitterEmailPhoto courtesy Güeyu MarFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It was the goth squid that got me hooked on Güeyu Mar—fork-tender tentacles bobbing in a jet-black sauce that tasted like the ocean mixed with campfire smoke. As a six-year Madrid transplant, I’d eaten calamares en su tinta (squid in ink sauce) in abuelas’ kitchens, neighborhood taverns, and starchy fine-dining restaurants, but it never tasted like this. How on earth could such a delicacy come from a can?Güeyu Mar, which hit the U.S. market in December (full list of retailers here), is not like other conservas companies you may have heard about. While most traditional canneries steam their seafood before packing it in water or oil, Güeyu Mar goes primal, cooking its sardines, cockles, squid, what have you, over live oakwood flame. This step imbues each morsel with an intoxicating smokiness that, to me, evokes sunny Mediterranean seafood shacks and pre-pandemic beach barbecues.Once the seafood is cooked, it’s either drenched in thick green arbequina olive oil from Castillo de Canena and sealed, or destined for meal-in-a-can wonders like sardines in escabeche (garlicky vinaigrette) or that blissfully chthonic squid, which Güeyu Mar dubs calamares de otro planeta (squid from another planet). I always have a few Güeyu Mar cans in the cupboard for when hunger strikes—and motivation doesn’t. Lately I’ve been tipping whole tins of cockles into linguine for a quick, smoky vongole and bulking up my pan con tomate with sardine loins.If these cans sound very chef-y (and more expensive) than most, that’s because they are: Güeyu Mar is named for a well-known seafood restaurant in Playa de la Vega, Asturias. Its chef, Abel Álvarez, makes no compromises when it comes to quality of ingredients, and that approach applies to his tins as well.Friends who have dined at Güeyu Mar tell me it’s a Spanish seafood Eden—picture a converted stone house in the middle of nowhere with views out to the Cantabrian Sea. Traveling to Asturias may be off the table for the time being, but with a tin or two of Güeyu Mar conservas—and a bit of imagination—you’re basically halfway there.Photo By Jorge Lopez GhisoliGüeyu Mar Grilled Cockles$47 at Despaña Brand FoodsWant to shop in person? Find Güeyu Mar at brick-and-mortar shops across the country here.Explore Bon AppétitHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-25", "author": ["Condé Nast", "Benjamin Kemper"]}