{"id": "38ce34caccc604379f31ca740d5acd78", "url": "https://www.bonappetit.com/story/mooncakes-online", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Where to Buy Mooncakes Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhere to Buy Mooncakes OnlineSweet little parcels delivered to your door in time for Mid-Autumn Festival? Yes, please.By Michelle TcheaSeptember 14, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Like with all Chinese holidays, food plays an important part in the celebration of the Mid-Autumn Festival, or Moon Festival, which falls on the 15th day of the eighth lunar month of the Chinese lunar calendar. It’s a time when the full moon is at its brightest and families and old friends reunite, giving and receiving tins of mooncakes—the original salty-sweet dessert combo. All who eat them on this day are said to be blessed with good fortune.Traditionally, a mooncake is a delicate, tender pastry encasing a sweet filling, like red beans, white lotus seed paste, or candied fruits and nuts, usually wrapped around a salted duck egg, which symbolizes the moon. The mooncake, often circular in shape, is pressed into a traditional wood mold, which embosses the pastry with decorative flowers and lucky Chinese words. It’s said (at least by my mom) that mooncakes were made to honor the wife of a tyrant, who sacrificed her life and flew to the moon to escape her abusive, power-hungry, and immortality-obsessed husband. Drama! But these days, we’re taught that they represent unity, happiness, and good fortune, and they’re given to friends and family in the lead-up to the Mid-Autumn Festival, which this year falls on September 21.Classic renditions are still the most common, but luxury hotels and popular bakeries in China, Hong Kong, Taiwan, Singapore, and Chinatowns around the world are taking their mooncakes to a whole new level with creative flavors like durian, prawn, and truffle, as well as creating novelties like mooncakes for pets. Ahead of the festival, here are some of my favorite online retailers that will ship nationwide. Whether you’re a traditionalist or crave something more modern, you’re sure to find something tempting on our list of the best mooncakes you can buy online.Sheng Kee BakeryFounded in Taiwan in 1948, Sheng Kee Bakery is still run by its founding family and now has more than 11 stores in California. If you pop into a brick-and-mortar location, you can pick from 14 different mooncake varieties, including date, taro, and pineapple. But Sheng Kee also sells mooncakes online—more than 1.5 million a year!—to meet the demands of homesick Taiwanese Americans. My two favorite boxes are the Deluxe Assorted Mooncake Mix, which includes both oolong and chestnut fillings, and the Taiwanese Yummy Paste variety, which has an exceptionally flaky and delicate crust and a sweet green bean filling. My advice: Why choose? Get both.Sheng Kee Assorted Moon Cakes in Deluxe Box$54 at AmazonSheng Kee Yummy Paste Mooncakes$48 $45 at AmazonAmoyIf you crave a denser filling that has more oomph in every bite, then the Amoy mooncake set is for you. Each box of eight contains custard, matcha, and purple sweet potato flavors that are decadent and rich, like slicing into a New York cheesecake. These are “lava custard” mooncakes, so you’ll find a melty center in each tiny pastry. Get the classic Amoy white lotus paste with two egg yolks to bring good vibes for you and your fellow mooncake eaters this Mid-Autumn Festival.Amoy White Lotus Paste Moon Cakes$47 at AmazonAmoy Lava Custard Paste Mooncake$59 at AmazonKee Wah CaliforniaThis 70-year-old bakery is a Hong Kong institution with locations in California as well for easy access to mooncakes during the Mid-Autumn Festival. But if you cannot get to Monterey Park, San Gabriel, or Rowland Heights, Kee Wah Bakery also sells all its signature Cantonese-style mooncakes online with free shipping via Amazon. Stick with the traditional mooncakes like red bean paste (with double salted egg yolk to bring extra luck), or choose custard mooncakes, which ooze when you bite into them.Kee Wah Bakery Red Bean Mooncake$44 at Amazon$59 at GoldbellyKee Wah Bakery Yolk Custard Mooncakes$37 at AmazonWing WahWing Wah mooncakes can be found in festive, decorative tins in most Asian grocers in the United States, and they are also available online. Go for the original Cantonese-style white lotus paste with single or double yolk or choose the molten custard variety which has a luscious, liquidy duck-egg center instead of the dry yolk found in traditional mooncakes.Wing Wah Molten Custard Mooncake$83 at AmazonWing Wah White Lotus Moon Cakes$69 at AmazonFay Da in NYCTraditionalists can opt for the lotus seed, red bean, and mixed nut mooncake gift sets (with optional salted egg yolk inside, of course) at Fay Da Bakery in NYC. But if you want to add some color to your life, go for the rainbow-hued Lava Collection, which boasts fillings of gooey custard, orange, matcha, and durian.Fay Da Mooncakes$59 at Fay Da85℃ Bakery and CafeThis hugely popular Taiwanese bakery chain in California has carb-fans lining out the door for pillowy-soft pork floss buns and custard doughnuts seven days a week. But during the Mid-Autumn Festival, 85℃ fans can enjoy both Cantonese- and Taiwanese-style mooncakes made fresh on the premises. What sets 85℃’s mooncakes apart is the addition of mochi, which adds extra chew and bounce. I highly recommend the Dong-Po 85℃ mooncake, which contains pork floss, mochi, red bean, walnut, salted egg and Asiago cheese, but if you want to impress your in-laws, you can’t go wrong with the Cantonese-Style Mooncake Gift Box, which features walnut date mochi, almond lotus seed, red bean yolk, and pineapple yolk mooncakes. Mooncakes come with free shipping too.Cantonese-Style Mooncake Gift Box$30 at 85 at HomeExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Michelle Tchea"]}