{"id": "38cf6205278d6a7db09868885aac001c", "url": "https://www.bonappetit.com/recipe/chicken-breast-with-peas-and-croutons", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Chicken Breast With Peas and Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueChicken Breast With Peas and CroutonsBy Ali Slagle April 20, 20214.9(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintRecipe developer Ali Slagle was a self-proclaimed never-breaster who only tolerated chicken breasts when they were breaded and fried. Then she developed this method for crackly-skinned, juicy roast breasts that has quickly earned a spot in her regular rotation. Preheating the skillet before adding the chicken jump-starts the browning process; the bones provide a buffer that protects the meat from drying out as the skin gets golden. Use the leftover schmaltz (chicken fat) to make any kind of side, from sautéed greens to warm salad dressing to the herby peas and croutons shown here. Frozen peas make this a year-round meal, but you can also use shelled fresh peas.Ingredients4 Servings4skin-on, bone-in chicken breasts (about 3 lb. total)2½tsp. kosher salt, divided, plus moreFreshly ground black pepper1large shallot, halved, thinly sliced1Tbsp. fresh lemon juice4tsp. (or more) extra-virgin olive oil4cups ¼\"–½\" pieces torn country-style or multigrain bread2Tbsp. unsalted butter3oil-packed anchovy fillets2cups fresh or frozen English peas¼cup torn tender herbs (such as basil, parsley, dill, and/or mint)Lemon wedges (for serving)PreparationStep 1Place a rack in middle of oven and set a large cast-iron skillet on rack; preheat oven to 425°. Pat chicken dry and rub with 2 tsp. salt; season with pepper.Step 2Stir shallot and lemon juice in a small bowl; season with salt and pepper. Set aside.Step 3Pat chicken dry again; rub with oil. Carefully place skin side down in preheated skillet and roast, turning skin side up halfway through, until an instant-read thermometer inserted into thickest part registers 150°, 20–25 minutes. Transfer chicken to a cutting board, leaving fat behind, and let rest (temperature will rise as meat sits).Step 4Place skillet on stovetop over medium heat (be careful of that hot handle). Add bread and season with salt and pepper. Toast, stirring often and scraping up browned bits, until golden, about 4 minutes. Add more oil if pan looks dry. Using a slotted spoon, transfer croutons to a plate.Step 5Add butter and anchovies to same skillet and cook, breaking up anchovies with a spoon, until butter is melted. Add peas, remaining ½ tsp. salt, and 2 Tbsp. water; season with pepper. Cook, stirring occasionally, until peas are bright green and warmed through, about 4 minutes. Remove from heat.Step 6Cut chicken meat from bones and slice. Stir croutons, herbs, and reserved shallot mixture into peas; season with salt and pepper. Divide among plates; top with chicken. Serve with lemon wedges.How would you rate Chicken Breast With Peas and Croutons?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI made this dish for my in-laws and they loved it.Brian Lighty11/28/2021This is delicious!  I love the varying textures and tastes.  The chicken came out beautifully - juicy and flavorful.  My husband really enjoyed it and it happens to be yummy cold the next day.  Jen M.Los Angeles, CA5/5/2021This was absolutely delicious! 100% make again. My chicken breast was a bit big so it took about 10 more mins to cook but did not change any other thing. I used parsley, basil and mint for my herbs. Simply perfect. CamiejoPlaya del Rey, CA4/28/2021I need to be honest. When I saw this recipe, I said, \"Oh, boring,\" but I happened to have bread staling and everything other than the chicken in my pantry. So glad I didn't pass this up! All of the proportions were exactly right for me (appreciate all of the cues for seasoning, too). Chicken was wonderfully crispy and juicy (I'm a never-breaster, too). Rest of the meal is perfectly balanced with the anchovies, butter, lemon and herbs. Extremely delicious. (I will say the croutons have more of a stuffing consistency than a salad crouton. I couldn't get them crispy.)hungryasianDC4/25/2021Explore Bon AppétitChicken BreastChickenPoultryPeaVegetableSpringWeeknight MealsEasyMainGluten-FreeNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Ali Slagle"]}