{"id": "38d5fa6c0b8fbd1ba1969feb9e087e38", "url": "https://www.bonappetit.com/story/mothers-day-steak-menu", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "The Mother’s Day Menu I’m Making My Mom, Starring a Giant Steak | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Mother’s Day Steak I’m Making My Mom, the Only Gift That MattersMy mom buys herself everything she wants, which is why my gift is a giant hunk of beef.By Christina ChaeyMay 11, 2018FacebookTwitterEmailA bone-in rib eye requires nothing more than salt, pepper, and a hot grill. Though to make it even more sublime, serve with scallions that have been tossed in olive oil and salt and given a quick char.Francesco TonelliFacebookTwitterEmailMy mother’s life philosophy is best summed up by Tracy Jordan of 30 Rock: “I don’t need a birthday ’cause I buy myself all the presents I need. And because of my drinking, they’re often a surprise.”This admittedly fabulous approach to living life makes it nearly impossible for me, her daughter, to buy her a birthday, Christmas, Valentine’s Day, or Mother’s Day gift she hasn’t already bought for herself.  So my strategy for the last few years has been to give her the one thing she can’t buy: a really, really good homemade meal. It’s the only gift I’ve given her that has been met year after year with raves instead of, “That’s nice.”Usually my sister and I will go home for the weekend and make her some Mother’s Day waffles—which is the one time a year we use the waffle iron—but this year, I’m also going big on dinner because I didn’t get her a birthday gift(!!!) in April, and she hasn’t forgotten. I’m building the whole meal around a couple of great steaks (my mother’s favorite food group), with lots of other veg-heavy dishes that come with plenty of built-in tasks for my prep cook aka Dad—so he doesn’t feel left out, you know? Here’s what I’m thinking:Peden + MunkRadish Yogurt with Pine NutsI tend to immediately check out when I see the words “pine nuts” in a recipe (do I look like I’m made of money tho???). But ever since my dad finished paying off his share of college tuition for me and my sister, he has enthusiastically adopted a way of life he calls “Livin’ Large.” Activities that fall under the purview of Livin’ Large™ include buying literally every nut at Costco, including luXeEe pine nuts, so radish yogurt dip it is! I always want to eat while I prep for dinner, so I’ll put this out with cucumber spears, halved radishes, and Stacy’s pita chips for us to munch on.Michael Graydon & Nikole HerriottLittle Gem Salad with Lemon Cream and HazelnutsThis is a far cry from the Chaey family house salad—chopped romaine hearts, cucumber coins, cherry tomatoes, and Wish-Bone Light Italian Dressing—and that is not a bad thing. Lots of tasks for dad here (washing lettuce, peeling garlic, picking mint, scrubbing carrots lol), but I can already tell I will have to make the dressing in a closet where no one can see me so I don’t have to explain why I’m making a salad with, um, whipped cream.Photo by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiA Giant SteakThe main event!!!! Okay so I’ve actually never cooked a rib-eye at home before because I’m too scared of effing up aka overcooking expensive meat. My plan is to follow the Test Kitchen’s golden rules (buy great meat, season it with LOTS of salt, bring it to room temperature before cooking) and hope for the best. I’m also going to bring home a cake tester because this restaurant trick for how to check any meat for doneness completely changed the way I cook protein.Asparagus with Lemon, Olive Oil, and PistachiosI’ve been waiting all year for fat spears of purple-tipped local asparagus to show up at the farmers’ market, and last weekend I was finally rewarded with some sweet, sweet stalks. I think most roasted asparagus is kind of lame and not nearly as vibrant as blanched, so I’ll cook these in very well-salted boiling water for 30 seconds to a minute, just until they turn bright green, then dunk them in a salted ice bath (the salt is key to lots of flavor!) Lemon, olive oil, crushed toasted pistachios, flaky sea salt. Done.Photo by Laura Murray, styling by Judy ManciniPotatoes with Fennel and Radish SaladWhile I love a mayonnaise-based potato salad, I think this lighter version topped with lots of shaved crunchy vegetables from Kismet in L.A. is exactly what I want to cut through the richness of a butter-bathed steak. Also, Key Dad Task: scrubbing the potatoes.And for dessert: A pint of Häagen-Dazs coffee ice cream, which is my mother’s favorite food of all time and beats out any other dessert in her book. Apparently the perfect Mother’s Day gift was hiding in plain sight all along—it was just in the freezer.Steak studies:Explore Bon AppétitSteakMother's DayAsparagusPotato SaladMenusRead Moreculture8 Great Mother’s Day Cookbooks, Recommended by Our Very Own MomsBy The Bon Appétit Staffculture9 Mother's Day Gifts for Every Kind of MomBy Ashley MasoncultureMother's Day Should Be the Official Start to Grilling SeasonBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-11", "author": ["Condé Nast", "Christina Chaey"]}