{"id": "38d50e653243244b6a5f423b12bc279e", "url": "https://www.bonappetit.com/recipe/slow-roast-beef", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Slow Roast Beef Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSlow Roast BeefBy Chris MoroccoNovember 20, 20184.7(14)Read ReviewsTriangleEmailPinterestPrintPHOTO BY ALEX LAU, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIEmailPinterestPrintEmailPinterestPrintWe've adapted the classic roast into a buffet-style, serve-yourself dish, with options: Make a sandwich (with cornichons and horseradish sauce) if you want, or eat it up as distinct components if that's more your thing. Store-bought rolls that have been reheated, brushed with butter, and sprinkled with flaky salt might not be the same as homemade, but they will impress nonetheless.Ingredients8 servings14-lb. New York strip roast, preferably prime, untiedKosher salt, freshly ground pepper6garlic cloves, finely grated3Tbsp. finely chopped rosemary5Tbsp. extra-virgin olive oil, divided½cup plain whole-milk Greek yogurt½cup sour cream2Tbsp. prepared horseradish½tsp. finely grated lemon zestWarm rolls and cornichons (for serving)PreparationStep 1Lightly score fat cap of roast, spacing cuts about ¾\" apart, with a sharp knife, being careful not to slice into the flesh. Season roast generously on all sides with salt and pepper. Mix garlic, rosemary, and 3 Tbsp. oil in a small bowl and rub all over roast. Loosely cover with plastic wrap and chill at least 12 hours and up to 2 days.Step 2Preheat oven to 200°. Place roast on a wire rack set inside a large rimmed baking sheet. Roast until an instant-read thermometer inserted into the thickest part of meat registers 118°–120° for medium-rare, about 2½ hours. Let rest 1 hour (internal temperature will continue to climb to 125°–130°).Step 3Mix together yogurt, sour cream, horseradish, and lemon zest in a small bowl; season sauce with salt.Step 4Heat remaining 2 Tbsp. oil in a large skillet over medium. Cook roast just until browned, about 2 minutes per side. Transfer to a cutting board and thinly slice. Serve with horseradish sauce, rolls, and cornichons.Step 5Do Ahead: Beef can be roasted and browned 3 days ahead. Cover and chill. Let sit at room temperature 1–2 hours before serving.How would you rate Slow Roast Beef?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMade this for Christmas last year, it was amazing! Followed the recipe and produced a tender, delicious roast.  Served with warm Kings Hawaiian rolls and the option of creamy horseradish or anjou.  Not a cheap cut of meat, but for a holiday/special occasion definitely worth it.  JoanCalistoga, CA12/20/2021Sooo, I have only tried this once but I would cook at 225F for 25 minutes per lb for blood rare, 30-35 minutes per lb for medium rare, and no recommendation for medium up. Otherwise, I love that it gives a thoroughly even doneness. Also, I might skip the wire rack as in my oven it reduces the heat to the underside cooking it less than the top.EzzymeSanta Barbara, CA12/26/2020OMG!!  This is literally one of the Top 5 beef dishes I have ever made.  Meltingly tender, sauce was sublime (use 3 tbsp horseradish and add cracked black pepper).AnonymousVirginia9/6/2020I'm going to try this, particularly the do-ahead. But I'm wondering if I could hold off on the outside crisping until after the roast came back to room temperature (1-2 hours) on party day. I believe it would make it much more delicious that way. \n\nAny thoughts as to why I shouldn't? Thanks!AnonymousChicago10/18/2019I've been using this technique for several years, and it works perfectly every time. The most essential tool is a good quality, remote-reading thermometer, preferably the kind with more than one zone. That takes all the guesswork out and assures terrific results. Using a low temperature method also makes cleanup much easier. No more burned on mess. An acidic sauce is the perfect foil to the richness of beef. I'll never go back to the conventional method of cooking meat.Anonymous12/29/2018I'm pretty shy about leaving reviews, but I knew I had to say something about this recipe. The meat is tender and super flavorful and i'm so glad we have leftovers to snack on. It was way easier to make than i thought it would be, and the payoff is huge! Probably the best thing I have ever made.AnonymousKansas12/28/2018Wonderful Party Recipe! I served this for a party of about 10 people, and had some leftovers. Served it with cornichons, arugula, red onions, and  horseradish sauce  to complete a make your own sandwich buffet. You shouldn't skimp on the rest time, so plan ahead. The roast also comes out on the rare side so keep that in mind if you want it a little more medium. It was wonderfully flavorful and juicy even when reheated for leftovers. lteutschNebraska 12/20/2018Incredible, surprisingly easy recipe. The butcher scored the fat for me, so I'm glad I asked. Do NOT forget the cornichons! Or some kind of pickle. You really need that acidic bite to balance out the fatty, rich beef. The garlic-rosemary rub is to die for; it filled my house with the most wonderful scent. When it came out of the oven, we picked off some of the rosemary and ate it plain, SO GOOD. alexbeggsBA.com 12/12/2018Explore Bon AppétitBeefMeatEasyMainNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}