{"id": "38d7183dd06f6b11d81469e581962cfd", "url": "https://www.bonappetit.com/story/hot-honey-chicken-thighs-recipe", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "Hot Honey Chicken Thighs with a Side of Chicken Fat Toast Because Why Not | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesHot Honey Chicken Thighs with a Side of Chicken Fat Toast Because Why NotAnd a whole new technique to get the crispiest possible skin.By Amanda ShapiroFebruary 21, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailIf hot honey chicken thighs with fried bread were an Olympic event, it would be luge. It looks pretty basic—they’re just riding sleds!—but the slight maneuvers you don’t even notice are where the real brilliance lies. This recipe uses fewer than ten ingredients, most of them pantry staples, and in a few key moves produces weeknight dinner gold. It also includes a brand new method for how to cook chicken thighs perfectly every time! I’m talking big, but trust me. Here’s how it comes together.The first move you’ll nail is the cold pan method. I’m already on record talking about how to cook chicken thighs perfectly, but this method completely changes the game. It’s the NEW perfect way to cook chicken thighs. You start with a cold, oven-safe pan, add a little olive oil and your marinated chicken thighs skin-side down, then turn on the heat. The slow increase in temperature keeps the skin from crisping too quickly and shrinking. It makes the skin brown more evenly, too. Get this technique right, and you’re already guaranteed a spot on the podium.Once the thighs are crisp and golden like the medal you’re going to win, put them into a 450° oven to cook through. While that’s happening, you’ll tackle move #2: hot honey. You’ve probably seen hot honey in fancy grocery stores, but it’s super easy to make at home. You thinly slice a red chile, warm it in a small saucepan of honey until it barely simmers, then let the mixture cool. Look at that: 10 out of 10! Impossible to mess up!When the chicken thighs come out of the oven 16-20 minutes later, put them on a plate and get ready for move #3: fried bread. This move is like nailing the tightest turn in the last five seconds of the course. Why? Because you’re pan-frying bread in chicken fat. Let me repeat: You’re putting slices of bread in sizzling chicken schmaltz and frying it on both sides. Start singing your national anthem of choice right now because you’ve clinched this one. (One word of caution: Use an oven mitt while frying because you’re going to grab the pan handle without thinking about it, and that pan just came out of a very hot oven, and even Olympians feel pain.)The secret to perfectly crispy chicken thighs is starting with a cold pan.\nWhen the bread is crisp and golden, take it out of the pan, sprinkle it with a little coarse salt, and let it drain for a minute on some paper towels. With a flourish, pour the last of the pan juices over a bowl of endive leaves like it’s no big thing, add lemon juice and salt, and toss like the champion you are.Now you have to get that presentation score: Put the schmaltzy bread on the bottom of the serving plate, poking some holes in it with a knife so the chicken juices can run through. Then top with your chicken, scatter the endive all over, and spoon the hot honey on everything. There’s no polite way to eat this, so go for it with your hands. Winners don’t apologize, and you worked hard for this.Get the crispiest, winning-est chicken thigh recipe of all time:Hot Honey Chicken Thighs with Fried BreadYou’re essentially making a large chicken fat–doused crouton here, people.View RecipeExplore Bon AppétitChickenhoneyBreadWeeknightRead Morerecipes13 Crispy, Juicy Chicken Thigh Recipes That'll Save You From YourselfGallery13 SlidesBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "Amanda Shapiro"]}