{"id": "38e0e00a250fa3c43e3e6f8539fb4a28", "url": "https://www.bonappetit.com/recipe/orecchiette-with-buttermilk-peas-and-pistachios", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Orecchiette with Buttermilk, Peas, and Pistachios Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueOrecchiette with Buttermilk, Peas, and PistachiosBy Molly BazMay 22, 20184.2(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintWe’re throwing this pantry pasta all-star a “Welcome to Summer” party with peas and mint. This dish was inspired by Rolf and Daughters in Nashville, where chef Philip Krajeck makes a fermented pasta cloaked in a tangy whey and butter sauce. We use store-bought buttermilk to mimic whey’s acidic flavor. It’s a perfect foil for the rich butter and cheese in this glossy sauce.Ingredients4 servings ¼cup pistachios12oz. orecchietteKosher salt12oz. peas (such as shelled fresh or frozen English and/or halved sugar snap)3Tbsp. unsalted butter2Tbsp. extra-virgin olive oil, plus more for drizzling2medium leeks, white and pale green parts only, cut in half lengthwise, thinly sliced3garlic cloves, thinly sliced½tsp. crushed red pepper flakes1small bunch mint, divided¾cup buttermilk3oz. Parmesan, finely grated, plus more for servingFreshly ground black pepper2Tbsp. fresh lemon juicePreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then coarsely crush with a measuring cup or glass.Step 2Cook pasta in a large pot of boiling salted water 6 minutes, then add peas and cook until pasta is al dente, about 2 minutes more.Step 3Meanwhile, heat butter and 2 Tbsp. oil in a medium heavy pot over medium. Cook leeks, garlic, red pepper flakes, and 3 mint sprigs, stirring occasionally, until leeks are soft but not browned, 6–8 minutes; season with salt. Add buttermilk; bring to a simmer. Pluck out mint; discard.Step 4Using a slotted spoon, transfer pasta and peas to leek mixture. Add 3 oz. Parmesan; cook, stirring vigorously and adding a little pasta water if needed, until sauce is creamy and coats pasta, about 1 minute. Season with salt and pepper. Remove from heat; add lemon juice. Pull leaves from remaining mint sprigs, tear into pasta, and toss. Divide pasta among bowls. Top with pistachios and Parmesan; drizzle with oil.How would you rate Orecchiette with Buttermilk, Peas, and Pistachios?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleThis recipe just did not work for me. Despite slowly putting in the parm and vigorously stirring, a sauce never formed other than a massive, rather unsavory clump of melted Parmesan, peas, and leeks which separated themselves from the pasta. When getting all of the components into one bite, I can tell that the flavors go well together but the fact that it never made a sauce and just a giant cheese ball makes it a no from me.Saucy? Not so much…11/17/2021Absolutely delicious!  One of our go to summer pasta dishes.  Super easy and tons of flavor.   Molly for the win, Always! CamNew York, NY8/31/2021Love love love this dish! It's a regular in our dinner planning. To save time, we crush up store bought roasted pistachios rather than roasting them ourselves. I find this dish really comes together with the toppings. Mint, lemon juice, pistachios, a bit of extra cheese...they're truly the cherries on top of an incredibly delicious dish!  JessicaMilwaukee, WI1/1/2021I love so many Bon Appetit recipes, but these flavor combos really did not appeal to my palate. I wish I had watched the video beforehand, and cooked my pasta much longer. 8 minutes and it was still crunchy, so sad. Thank you though Molly!Kait FreebergBoston4/29/2020Doubled the garlic (it still needs more!) and used half the amount of red pepper flakes (plenty of heat). I know why Molly's pasta was \"crunchy\"--8 minutes is not nearly enough time! Boiled mine for a good 12-13 minutes before being al dente. Definitely a keeper.AnonymousRichmond, VA2/29/2020Love this so much! Such a unique pasta dish. The toasted pistachios really put it over the edge for me. It was very stressful to make because the buttermilk split almost immediately for me and it took a while for the sauce to come together even once I added the parmesan, but it all worked out in the end beautifully. AnonymousOttawa10/27/2019LOVED IT. Added some mild Italian sausage by browning it for a bit before cooking with the leeks & garlic. Used half snap peas and half regular like in the video and it felt perfect. Leaving the buttermilk out on the counter during prep seemed to help it incorporate better, didn't have any issue with the sauce splitting. I actually forgot to add the lemon juice but found that it still tasted great and had a balance of spice, creaminess, and freshness. gelaaaMinneapolis, MN 9/15/2019OMG! This dish tastes amazing!! I loved watching Molly's related video, and her guidance through the broken buttermilk sauce was very helpful. I followed the recipe as I watched the video which was so fun. I ended up forgetting to add the lemon juice; I don't think Molly added any either. Despite not having the addition of the lemon juice, which I'm sure adds a little somethin' somethin', it was still so amazing. Who would have thought buttermilk and mint could come together so peacefully and rich in a pasta dish. I undoubtedly will make this again. Thanks Bon Appetit! :)lbochatIllinois9/15/2019This recipe was delicious. I accidentally bought low-fat buttermilk so I ended up using more buttermilk. I'm pretty sure that changed the end result from the original recipe but I don't think the tangyness/richness of the recipe was compromised in any way! the sauce was light yet creamy and the peas were a great addition. the sauce does split but comes together if you wait long enough. i added in sweet basil along with mint and it worked nicely, the dish was really perfumed. i added in some chopped capers for good measure. overall, LOVE! niccsuxSingapore7/16/2019Didn't love this. I made it twice and adjusted a few things because my buttermilk split the first time and it still didn't move the needle for me. I ended up adding (at the end) more lemon and more red pepper flakes because flavor was just kind of bland. The mint is the only flavor that comes through and even that was super mild.AnonymousDallas6/25/2019This was very very good.  A nice different pasta dish.\n\nI made it exactly as written.  Next time, however, I personally will omit the mint.  I get that peas and mint are \"a thing\" but mint doesn't really do anything for me in savory dishes.\n\nInstead, I can imagine parsley and/or kale would be a really great option instead of the mint.\n\nWe still all really enjoyed it, overall.daubie77Boston5/6/2019Great flavors, however the sauce did not come together as stated. I ended up adding a pinch of sodium citrate to the broken sauce to get it to emulsify, which kind of worked. Worth noting, I used Bulgarian buttermilk instead of low-fat. karlsaigonOakland4/29/2019Loved this! Such an unexpected combinations of ingredients and flavors that all work so well together. The orecchiette is the perfect shape to go with the peas and pistachios and the mint really brings it all together. Such a stunning recipe and not super complicated.Matthew LynessVirginia4/26/2019Very nice flavours although the buttermilk separated *instantly* after being added and did not come back together with mixing or extra pasta water - any advice?TezToronto3/21/2019This is so delicious and refreshing. Molly is a genius. My life is better now that I've had this pasta. AnonymousLos Angeles, CA1/26/2019Explore Bon AppétitPastaOrecchiettePasta & NoodlesPeaVegetablePistachioNutButtermilkOther IngredientsSpringSummerEasyWeeknight MealsMainVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}