{"id": "38e125644355b792261bc90c947e5890", "url": "https://www.bonappetit.com/story/tomato-powder-jar", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Tomato Powder Packs Big Tomato Flavor in a Very Small Jar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTomato Powder Packs Big Tomato Flavor in a Very Small JarAnything tomato paste can do, tomato powder can do better.By Sarah JampelApril 12, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I can’t remember the last time I used a full 6-ounce can of tomato paste. Without a doubt, I’ll scoop out ¼ cup, transfer the rest to a container, tuck it in my fridge, and forget about it until it’s unrecognizable. While tubes of tomato paste don’t go bad nearly as fast and pack more flavor into a smaller volume (they’re double- or triple-concentrated), they’re pricier and I go through them fast.Tomato powder—which is made from dehydrated and pulverized tomatoes—solves both of those problems. Not only does it stay good for a very, very long time (it will keep in your refrigerator almost indefinitely), but it can also be reconstituted to whatever concentration you desire, which means you won’t be left wondering whether your particular paste is inferior to another. (Perhaps something only I worry about?)You can exercise your tomato powder anywhere you’d use tomato paste. (Like with paste, you’ll want to be sure to cook it out until it darkens and starts to stick—that’s how you know the sugars are caramelizing and you’re getting maximum flavor.) Simply mix two parts powder to one part water and then go on your merry way: rigatoni with vodka sauce, tomato and cinnamon-spiced rice, risotto, a marinade for chicken skewers, etc.But tomato powder can also go where tomato paste cannot! It’s dry and sprinkle-able, meaning you can use it similar to a spice in rubs (tomato-rubbed chicken wings?!) or to flavor roasted vegetables or nut mixes. (I had great success using mine to re-create these Pizza Spiced Nuts from Food52.) Or mix it with salt and then use it to season popcorn, to coat the rim of a Bloody Mary glass, or to put a final touch on focaccia dough prebake. (I’ll report back when I try replacing a couple of tablespoons of flour in the dough itself for tomato powder.)While tomato powder is made from only one ingredient (if you guessed tomatoes, you are correct), it can still vary widely. The tomato powder from The Spice House is clown nose–red and as sweet as the summer’s smallest, ripest cherry tomato. Burlap & Barrel’s version, which is made from a particular variety of tomato grown along the coastline of the Aegean Sea in Turkey and dried in the sun, on the other hand, is an orangey-umber color, with a saltier, tangier taste. I use both in my kitchen: The Spice House’s version when I want a bright, purely tomato flavor (in chili, for example) and Burlap & Barrel’s when I’m looking to add complexity and acidity. It’s more of a special occasion sort of deal, reserved for garnishes and final flourishes.Come summer I’ll be mixing tomato powder into mayonnaise, spreading it on toast, and then layering thick slices of juicy beefsteak over. With more tomato powder on top of that, it’ll be the most tomatoey tomato sandwich of all time. Fine, that might be awhile from now—but my tomato powder will be waiting for me, good as the day I bought it, when the time comes.Photo by Emma FishmanBurlap & Barrel Tomato Powder$9 at Burlap & BarrelPhoto by Emma FishmanSpice House Tomato Powder$9 at The Spice HouseExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-12", "author": ["Condé Nast", "Sarah Jampel"]}