{"id": "38f687a33b5f215d0b134e0916c3018a", "url": "https://www.bonappetit.com/story/studs-food-earrings", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "These Food-Shaped Earrings Make Me Feel Like A Total Stud | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Food-Shaped Earrings Make Me Feel Like a Total StudI wear my heart on my sleeve and my cravings on my earlobe.By Chala Tyson TshitunduSeptember 9, 2021FacebookTwitterEmailPhoto by Anna RitschFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Imagine: The year is 2005 and you’re cruising the mall with your best friend on a pilgrimage to tween girl mecca, Claire’s. “Don’t Cha” by the Pussycat Dolls is blasting on the store’s stereo as you browse the big revolving racks of friendship necklaces and mood rings. You scrape together enough pocket money between the two of you to split a pack of sushi-shaped earrings and some Skittles-flavored Lipsmackers. Life is good.When I first encountered Studs, a direct-to-consumer earring brand bringing the art of over-accessorizing to the next generation, I was flooded with that same ephemeral Y2K gurl-power. Started in 2019 as a small SoHo piercing studio, Studs has evolved into a Gen-Z jewelry juggernaut, offering an extensive collection of over 250 earrings both online and at its five brick-and-mortar locations across America. While they don’t have California roll earrings like the ones I wore to death in my youth, they do have a number of delectable snack-shaped styles fit for any food lover like myself.GRIFFINPizza Slice Stud$24 at StudsAs a proud Zillennial (shout out to my generationally-fluid late-'90s babies), I am shamelessly susceptible to cool-kid social media marketing married with a twinge of nostalgia. Shopping for Studs brought out an almost obsessive excitement that I hadn’t experienced since the last time I stepped foot in a Limited Too (may she rest in peace). I spent what felt like hours scouring the website, dreaming of my perfect Earscape–that’s Studs-speak for your personally curated arrangement of quirky studs, dazzling hoops, and charmed huggies (snug hoops that “hug” the earlobe) adorning your ear.When I finally narrowed down my selection, what was left in my basket were, unsurprisingly, earrings that looked like food, all from the new Studs Loves New York collection—a zizmorcore-esque collaboration with indie jewelry makers Garbage NY. The delicious collection features over a dozen earrings and charms, most of which are modeled after some of the city’s most iconic eats like dumplings from Deluxe Green Bo, Challah Dolly’s buttery braided loaves, and, of course, the ubiquitous everything bagel.GRIFFINEverything Bagel Huggie$28 at StudsObviously I had to get my hands on all three, plus a pizza stud complete with cubic zirconia pepperoni. My tasty new bling arrived in the mail in a neon green pouch alongside laptop stickers and a sheet of stick on-earrings, and I felt myself transported right back to the days of filling out Tiger Beat quizzes with a sparkly gel pen. I decided to try my hand at Earscaping by popping all four earrings in at once. Not only did they look super-freaking-cute, but I was impressed by how lightweight and comfortable the Studs were. I have sensitive lobes that often require me to take jewelry out after a few hours, but to my surprise, I was able to wear my Studs all day without any irritation, and I even fell asleep in them! I’m so charmed (get it?) by my Studs experience that I’ve inadvertently turned into a walking advertisement for the brand—and now I leave the house everyday looking like an absolute snack and feeling like a total stud.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-09", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}