{"id": "3903f2def33917abcb81f6d73b42fd6b", "url": "https://www.bonappetit.com/story/never-fail-lime-pickled-onions", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "These Quick Pickled Onions With Lime Juice Taste Like Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Quick Lime-Pickled Onions Taste Like SummerCatch me putting them on everything I make until June. (And probably after, TBH.)By Aliza AbarbanelMarch 30, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the quick pickled onions that editorial web assistant Aliza Abarbanel just couldn't live without.Food is transportive. Sometimes it's connected to memory, like how eating Cracker Jacks will always feel like being at a baseball game. Sometimes it’s a regional thing, like how In-N-Out milkshakes will always remind me of family road trips up the coast of California. And sometimes it’s a pure, absurd fantasy, like how these lime-pickled onions have the power to conjure up vivid daydreams of beach vacations on even the gloomiest March evening.Summer is a state of mind, and these lime-pickled onions will get you there. Once that bright citrus tang hits your poor hibernating tastebuds, you’re practically lounging on the beach eating ceviche. Then comes a wave of salt, like ocean water mixed with boozy sweat and Banana Boat Deep Tanning Oil. (Yes, this sounds dreamy, but let’s all do our best to use SPF this summer instead.)I know what you’re thinking. Pickling? Who has time? Well, the best part of this whole condiment fantasy is the very real fact that this whole pickled onion situation comes together in just 15 minutes.If you’ve avoided pickled onions because you’re turned off by the idea of eating raw onions, I get it. (I once ate a raw onion like an apple on a dare at summer camp and, to be honest, I’ve never fully recovered.) Just know that quick pickling softens the bite, mellowing red onions out to the perfect amount of sharp flavor. And, while it’s common to see quick pickled onions made with apple cider or rice wine vinegar, using lime juice brings out a pronounced sweet-tart flavor that tones down that rawness even further.Those pickled onions would not suck on some fish tacos, just saying.\nChristopher TestaniStart by finely grating one lime until it’s basically bald. (This is the time to use that microplane grater you bought for garlic bread and then forgot about.) Lime zest is key. Seriously, if you’re a longtime fan of pickled onions but a newcomer to this lime version, prepare for a bit of lime zest to change the way you pickle for good. It packs in a huge amount of aromatic, lime-y flavor, coating each onion slice with potent citrus oils and providing a tiny bit of texture.Next, cut that lime in half and squeeze juice into the bowl until you have about two teaspoons. No need to wash your measuring spoons if they’re submerged in a pile of dirty dishes—just remember you want enough liquid to barely cover a small sliced onion and squeeze accordingly.Rinse a small red onion, slice it into thin rounds, and add those to your citrus bath. Use a mandoline if you have one—if not, stay chill and try to be somewhat precise. You want the rounds to be thin so the acid can permeate and pickle. Add sugar and a large pinch of salt and toss, squeezing the onion with your fingers to soften the onion membrane and speed up the pickling process. Let it sit for about ten minutes, or up to two weeks. You’re done! You pickled something! Now you’re basically Brad Leone!Senior food editor Andy Baraghani developed these lime pickled onions to top a bowl of spiced dal with fluffy rice and salted yogurt, and their acidic tartness provides the perfect amount of balance. Still, after I polished that dal off, I kept adding those onions to everything. They keep in the fridge for two weeks, making them the ideal condiment to keep on hand—just drain the liquid before using. Use lime pickled onions on grain bowls, larb, tacos, braises...really anything savory in need of a flavor upgrade. Just crank up your favorite summer playlist (or steal mine), and boom: It’s June.Get the Recipe:Spiced Dal with Fluffy Rice and Salted YogurtIn this dish, lentils get a double dose of tartness from lime-marinated red onion and a drizzle of tangy yogurt.View RecipeExplore Bon AppétitBasicallyLimeLime ZestRed OnionPickleQuickToppingNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-30", "author": ["Condé Nast", "Aliza Abarbanel"]}