{"id": "390e750ca442ea504efb990d53981a1b", "url": "https://www.bonappetit.com/story/jalebi-tips", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Want Perfect Jalebi? Follow These 4 Tips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWant Perfect Jalebi? Follow These 4 TipsJalebi baby.By Mehreen KarimDecember 9, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksFacebookTwitterEmailIf you’ve gone hard on a wedding dance floor, you know how critical a water break or bite of cake is for catching your breath and refueling between songs. But nothing will ever compare to the breaks I took from dancing at my best friend’s wedding to chow down on jalebi, the fried, crispy, syrupy South Asian treats. Whenever I felt my stamina crumbling under the motions of one Bollywood dance number after another, I dragged myself toward the event’s live jalebi stand. I stared in awe as a professional jalebi maker (artist, more like it) fried and stacked hundreds upon hundreds of these sweet nostalgic treats into glistening orange towers.But you don’t have to be a professional jalebi maker to make perfectly crispy jalebi in your own kitchen. This home-cook-friendly recipe guarantees an initial crunch followed by an ooze of the fragrant cardamom-spiked syrup that has steeped into the chewy interior. With these four tips you’ll be serving up mountains of wedding-worthy jalebi in no time.Lentils are the key to crispness.You probably already have all of the ingredients in this jalebi recipe but one: urad dal (ivory white lentils). This is a nonnegotiable—you’ll need to find urad dal at a South Asian grocery store or order them online for this recipe. They’re traditional to the dessert, and not only do they add a complex, nutty note to the sweetness, but they also guarantee your jalebi will remain crispy even after you soak them in syrup.Use the right piping tip.You can use whatever condiment bottle or piping bag you have handy to squeeze out the hypnotic spirals—even a gallon plastic bag can work in a pinch. Just make sure the diameter of the nozzle or tip is ¼\" wide. Any skinnier and the jalebi will come out too thin and potentially burn. Any wider, the jalebi may not maintain their signature swirly shape.Keep an eye on the thermometer.To prevent burnt jalebi (and disappointment), make sure you’re using a deep-fry thermometer to keep your oil right at 350°. If it’s too hot the jalebi will brown too quickly and taste bitter. On the other hand, frying at too low of a temperature can cause your jalebi to lose their suppleness and spring, resulting in sad, flat spirals. Be sure to bring the temperature back up to 350° before starting on a new batch.Don’t skimp on the soak.Once the jalebi are fried extra crispy, they get soaked in sugar syrup. Jalebi can handle a LOT of soak time in the sugar syrup, so don’t hold back! In fact, I encourage you to keep your jalebi submerged in the syrup for at least 5–6 minutes. A proper soak will ensure juicy jalebi that burst with syrup when you bite in (my dad’s indicator for a truly great jalebi). If you let them soak a little longer, that’s fine too: I’ve left them for upward of 15 minutes just to make sure their sturdy structure holds up—and it does.With these tips and my straightforward recipe, making this decorative delight will be easy as pie—possibly easier. In no more than an hour, you could be feasting on a platter of fresh, hot jalebi and serving up a wow-worthy dessert to guests—maybe even between songs on the dance floor.Get FryingJalebiIt only takes a handful of ingredients to bring this dazzling South Asian snack to life in your kitchen. These particular jalebi strike the perfect balance between crispy, chewy, and sweet.View RecipeExplore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-09", "author": ["Condé Nast", "Mehreen Karim"]}