{"id": "3920cd9c901de3d02649d35072343169", "url": "https://www.bonappetit.com/story/homemade-hamburger-helper", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Who Needs Fancy Pasta When You Have Homemade Hamburger Helper? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWho Needs Fancy Pasta When You Have D.I.Y. Hamburger Helper?It’s silky. It’s satisfying. And it contains no dubious ingredients. What’s not to like?By Amiel StanekSeptember 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Kat BoytsovaFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.Say what you want about Hamburger Helper, with its dubiously long and unpronounceable ingredient list, but it is my suspicion that it is in many ways the best pasta dish that many Americans have ever had at home. This was certainly the case for me, for the first two decades of my life, anyway. Because the few times I enjoyed the iconic 1970s meal-in-a-box were probably the only times I experience macaroni and sauce together as one, gloriously unified, rather than a pot of Prego and bowl full of spaghetti as distinct and dissatisfying elements of a weeknight meal. Before I discovered the game-changing pleasure of the real Italian pasta protocol in my early twenties—that is, cooking noodles until al dente and allowing them to finish in a pan of sauce goosed with a splash of starchy pasta cooking water—there was Hamburger Helper. And it was mind-altering in its deliciousness. Could a lip-smacking dose of MSG contribute to the appeal? Surely. But I would argue that this lowly-seeming “meal solution” is so beloved because at its core it contains a sparkle of the divine: pasta swimming in a creamy, generously emulsified sauce.And that sauce. Rich ground beef. Umami-packed tomatoes. The gentle tang of onion and other assorted aromatics. Ample quantities of melty dairy. I mean, what’s not to like?! It’s a slam dunk of a flavor profile, the basis of countless regional American skillet pasta favorites. American Chop Suey in the Northeast. American Goulash in the Midwest. Chili Mac in the Southwest. Each slightly different but comfortingly similar (and similarly comforting). Betty Crocker didn’t invent it; she just put it in a box.As with many convenience foods and church cookbook classics, an improved version—which is to say, more complexly flavored and perhaps a smidge more wholesome—is simply a matter of better ingredients and technique. I’ve been making my own version of a cheesy hamburger skillet pasta at home about once a month for the last year, and a little bit of extra care and attention to detail has, IMHO, made all the difference in the world without “elevating” the dish in an annoying or pretentious way; it just tastes more like itself. Taking the time to brown the ground beef so that it’s actually brown adds a layer of complex meaty flavor. Sizzling out the tomato paste so that it’s ruddy and caramelized creates depth and umami where there would otherwise be raw tinniness. Quality sharp cheddar (good brick stuff, nothing too crumbly or age-y) provides just the right amount of funk, with a handful of parm playing backup. And the sneaky additions of soy sauce and chopped pickled peppers add just enough umami and acidity to bring the whole beautiful thing into focus.But more than anything else, it’s building the dish as a restaurant cook would build any proper pasta dish that ups the ante. The cooked noodles (I prefer squiggly cavatappi, like elbow macaroni someone forgot to cut) go straight from their bath into that Dutch oven full of lovingly-cooked meat and aromatics, along with a healthy scoop of starchy, salty pasta cooking water. The cheese is incorporated slowly, a handful at a time, stirring all the while until a silky emulsified sauce appears like magic—“saucy-glossy” as BA is fond of saying. Served hot, ideally out of wide shallow bowls while binge-watching the newest season of Stranger Things, it’s perversely satisfying and almost impossible to stop eating. (I have found that four people can easily polish off a recipe that should by all accounts serve six.)At home, I’ve taken to calling the resulting dish Pasta alla Americaine—an appropriately fake-fancy moniker for what is just a gussied-up version of America’s favorite noodle-meat-tomato-and-cheese dish. Call it Bougie Chili Mac. Call it Hamburger, Helped. Call it All-American Cheeseburger Pasta. But don’t you dare call me late for dinner.Get the recipe:All-American Cheeseburger PastaWhether you know it as American Chop Suey, Chili Mac, or American Goulash, this deeply flavorful, super-comforting pasta dish is greater than the sum of its humble parts.View RecipeExplore Bon AppétitNot So FastPastaWeeknightFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-16", "author": ["Condé Nast", "Amiel Stanek"]}