{"id": "392762a4b4821503c3d40b3e5c427d1f", "url": "https://www.bonappetit.com/story/what-is-intuitive-eating", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "What Is Intuitive Eating? Here’s Everything You Need to Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought Intuitive Eating Was Just Another Diet—Until I Tried ItIt helped me feel more comfortable eating what I wanted, when I wanted.By Ali FrancisFebruary 4, 2022FacebookTwitterEmailIllustration by Alberto MirandaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Last summer I embarked on a road trip with my boyfriend across America for five months. On drive days, with all my attention on the road and none on planning my meals, I was either uncomfortably full of drive-by Dairy Queen or struggling to “eat healthy,” a.k.a. pecking at sad handfuls of nuts and seeds like a hangry bird. Whenever I ate a roadside burger and fries I felt nauseous (and a little guilty) afterward, yet the trail mix left my stomach gurgling like the cheap fuel in our rusted-out Subaru. I’d become estranged from food—yet also caught in its good-bad binary—and see-sawing between extremes had me tired, ashamed, and feeling out of control.I shared as much with my therapist, and that’s when she gently suggested I “might like to read” Intuitive Eating, the seminal text in which dietitians Evelyn Tribole and Elyse Resch introduce the framework. Intuitive eating, the authors explain, is a specific practice that encourages eaters to tap into their body’s hunger cues. Until my therapist brought it up, I’d really only heard of intuitive eating ambiently, via the counselors and dietitians who’d been using social media to proselytize its ideas. At first I had a knee-jerk reaction, assuming it was just another diet out to undo the damage caused by all the other diets. Or sell me stuff. (Okay, it did sell me a book.)But the more I read, the more I resolved to try and apply the simple yet seemingly powerful ideas in my own life. Eating intuitively was hard at first. When my gut said, “Turkey club,” my brain haggled, “Avocado salad?” I ordered the club but it took effort to silence the voices. When I was hungry at noon despite having eaten breakfast at 10 a.m., I had to remind myself to honor that feeling and grab a bite. Diet culture wants us divorced from our bodies. Unlearning its messages—that the thin (white) ideal is a signal of virtue and success, that “junk food” is inherently immoral—takes time and constant vigilance.Intuitive Eating: A Revolutionary Anti-Diet Approach$18 at AmazonAs weeks passed I noticed a shift in my feelings around food. Not only did my anxiety disappear over deciding what to eat when everything was fair game, I found myself living more intuitively too. I walked around whatever neighborhood I was visiting on the days I was too tired to run. I rescheduled my virtual Italian classes when I was too grumpy to absorb another language. I took hot baths in the morning before work on icy winter days. I treated my body like a friend, not a machine. Within reason I did and ate what I wanted, when I wanted. By listening to my own wisdom, I found the eating compass I didn’t know I needed.So how do you start Intuitive eating and what should you consider first? While Intuitive eating worked for me, it’s important to note that, like skin care, food is different for every body—so don’t take this as medical advice. If you are looking to change the way you eat, talk to a registered dietitian. (They take insurance!) In the meantime here’s what I learned on my own journey.What is intuitive eating?Intuitive eating is a framework that helps you tune out external messaging, like the harmful rules and rhetoric of diet culture, and tune in to your own body signals—hunger, fullness, cravings, etc. The goal is to break free from cycles of chronic binging and deprivation, as well as the emotional consequences of those behaviors, and heal your relationship with food. Intuitive eating rejects metrics like calories, macros, and points and embraces a more compassionate approach to nutrition. (I’ve always been a useless mathematician anyway.)Registered dietitian and certified intuitive eating counselor Marci Evans, M.S., CEDRD-S, L.D.N., says Intuitive eating is a direct response to diet culture, “which gives the message that, left to our own devices, we would be nothing but gluttonous slugs who never leave the couch.” This framework, she says, instead encourages you to follow “your own internal wisdom around what you need around food, what you need around taking care of yourself, what you need around movement.”The theory behind the framework is that we were all born wise little blobs that understood instinctively how much and when to eat. We didn’t label foods as “good” or “bad.” I watched this firsthand over the holiday break, with my boyfriend’s month-old nephew. He squawked like a seagull whenever he was hungry and fell asleep the minute he was full. (Goals.) But as we grow up, we encounter stifling body image standards. What's more, food insecurity deprives us from eating what and when we want. These challenges subconsciously silence and override these internal cues, which can make eating stressful, problematic, and anything but intuitive.What are the 10 principles of intuitive eating?Each guideline is designed to help people dive into intuitive eating. But the authors warn in the book they aren’t intended to be followed “as another rigid set of rules.” Whenever Evans counsels a new client, she walks them through the principles to identify “what speaks to them most.” In other words, as you read through all 10 principles, some may make more sense than others, and I’m pretty sure that’s the point? The following resonated most for me:Honor your hunger: Is your stomach grumblin’? Are you trying to work but feeling foggier than a winter morning? You need food! Speaking of…Challenge the food police: Ignore the critical voices telling you foods are either “good” or “bad.” You aren’t what you eat.Respect your body: Accept and embrace your body size and shape. Focus on what it does for you every day rather than what it looks like.Movement—feel the difference: Love Hula-Hooping? Dance? Find activities that leave you energized and hone in on how movement makes you feel.What are the benefits of intuitive eating?Studies over the years have tracked the impacts of intuitive eating on health and well-being. In 2015, an Appetite paper compared intuitive eating to flexible dieting (a plan based on counting macros) and found that the former “was related to lower rigid control, lower psychological distress, higher psychological adjustment, and lower BMI.”Dietitian Jessica Jones, M.S., R.D., C.D.E., writes in an essay for SELF that one of the biggest benefits intuitive eaters will experience is peace: “By paying attention to what your body and mind are asking you for, you will feel satisfied, not deprived, hungry, hangry, or craving foods that you aren’t ‘allowed’ to eat because of a diet you’re following.” In an op-ed for the New York Times, author Jessica Knoll explains how a dalliance with intuitive eating helped her unpack the impossible standards of modern wellness. “Food is a part of my life—a fun part—but it no longer tastes irresistible, the way it did when I told myself I couldn’t have it,” she writes.And in a Nutrition Matters podcast episode about intuitive eating in Black communities, nutrition therapist Ayana Habtemariam M.S.W., R.D.N., L.D.N., explains how, as a young woman, she didn’t realize the desire she felt to change her own body was rooted in “anti-Blackness”—borne of a society that idolizes bodies that don’t look like hers. Studying intuitive eating and other weight-inclusive philosophies helped ease her body image issues, stress, and anxiety around eating, and ultimately de-couple her weight from her worth.What are the downsides of intuitive eating?The framework has also raised eyebrows. Journalist Gary Taubes tells British Vogue that intuitive eating ignores biology: “[It’s] advice from thin people, who think the reason they’re thin is because they eat in moderation and exercise, when that may not have any real relevance to those of us who aren’t thin.” In the Nutrition Matters podcast, Habtemariam also adds that the intuitive eating hashtag on Instagram looks a lot like “white women eating doughnuts,” which can be off-putting for Black communities, who suffer disproportionate rates of chronic diseases like diabetes. Balancing intuitive eating and health concerns can be counterintuitive.Psychiatrist James Greenblatt also explains in an Atlantic report that intuitive eating might do more harm than good for people struggling acutely with eating disorders. “My concern is that too many patients that I’ve seen who had serious eating disorders were being treated with a mindful or intuitive approach and it wasn’t successful,” he says. “To me, [intuitive eating] is often the second step. The first step is to get the biology under control.”Even Evans admits that the framework isn’t for everyone. For starters, the principles written in the book are targeted at people with a lot of inherent privileges: easy access to food; enough money, time, and agency to focus on eating intuitively; and the ability to digest information and bodily cues. “This model really can be antithetical for individuals who are maybe neurodivergent or process things differently,” Evans says of the last one. But that shouldn’t discourage people from trying out the framework. If it’s possible, she says, they can seek out individualized support from an intuitive eating counselor who has experience working with related issues.While the principles seek to reject diet culture, they’re also, like all of us, tangled up in its sticky web. “The fantasy that many people have is that, ‘Okay, if I just do the intuitive eating thing, I'm naturally going to lose weight,’” Evans explains. Then the guidelines morph into another set of “rules” we eventually fail at following, as Intuitive Eating’s authors caution against—and we feel bad all over again.Got it. I want to eat more intuitively. How could I get started?Evans suggests anyone interested in trying out intuitive eating immerse themselves in online resources. Jessica Jones​​ runs Food Positive, an intuitive eating course designed specifically for BIPOC and coproduces the Food Heaven podcast. Christy Harrison, M.P.H., R.D., CEDS, offers a virtual Intuitive Eating Fundamentals course and produces the Food Psych podcast. Evans also recommends reading a variety of books beyond Intuitive Eating, the OG:I didn’t read this, but The Intuitive Eating Workbook, also by Tribole and Resch, takes their best-selling work and breaks it down into practical, actionable steps. Structured around the 10 principles of intuitive eating, this hands-on guide shows you how to implement them in daily life.The Intuitive Eating Workbook: Ten Principles for Nourishing a Healthy Relationship with Food (A New Harbinger Self-Help Workbook)$25 at AmazonEvans recommends How to Raise an Intuitive Eater for parents. It teaches caregivers how to throw diet culture out with the dirty diapers and nurture intuitive eaters with positive food and body relationships.How to Raise an Intuitive Eater$15 at AmazonFor people who need to get really mad before they take action, Christy Harrison’s Anti-Diet is the perfect motivation. The book takes a big old whack at the ways diet culture and capitalism intersect and reveals how buying into a thin ideal costs us time, money, happiness, and our health. It will probably make you hate the word wellness.Anti-Diet$30 at AmazonIt’s now been six months since I started this intuitive eating journey, and not to be hyperbolic, but it’s kinda changed my life. I no longer define food as anything but something to eat. Most days I feel completely, happily neutral in my skin. And my meals are unrecognizable. Yesterday I ate roasted vegetables, hummus, and some rice crackers for breakfast; chocolate pumpkin bread and a raspberry yogurt for lunch; and a huge bowl of brothy pasta and chickpeas for dinner. The day before it was three crumpets with butter and honey, a charcuterie platter, and a tub of borscht. That’s the thing about intuitive eating: It doesn’t have to look right to feel right.Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-04", "author": ["Condé Nast", "Ali Francis"]}