{"id": "3938b71fcd7b1110cf0e9316ec98bc2f", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/vinskabet", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Vinskabet Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenVinskabetIndulge your inner wine geek at this breezy Nørrebro bar.FacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for a lovely low-key evening of natural wine and seafood in a sprawling yet cozy space that extends onto the sidewalk come summer. Inside-baseball natural wine merchants Rødder & Vin (a living room–like wine shop nearby where you’ll see people with tote bags from Brooklyn’s Four Horsemen) provide the bottles, which you order from the butcher-paper menu hung on the wall. It’s never precious or too cool. In fact, it’s just right.ORDER THE: oysters; tartare; and always nibble the bread: They get it from Mirabelle.THE VIBE IS: beachy Scandi, with whitewashed walls and raw wood floors. The service is casual and friendly, thanks to owner Sarah-Emilie.PRACTICAL STUFF: Open Tuesday to Thursday from 4 to 11 p.m. and Friday and Saturday from 4 p.m. to midnight. Closed Sunday and Monday.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEAncestraleIn Vesterbro, a cool little wine bar (and a relief to your wallet) Den VandretteGet your L’Anglore fix at this sunny Indre By wine barVed Stranden 10Get lost in natural wines at this living room-esque Indre By barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}