{"id": "3940af37a627f9646330398b7ce523da", "url": "https://www.bonappetit.com/story/what-is-processed-cheese", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "What Is Processed Cheese, and Should We Eat It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Processed Cheese, and Should We Eat It?When it comes to cheese, is \"processed\" a dirty word? Or just a really melty one?By Alex DelanyApril 25, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailIn the world of alt-flour this and activated charcoal that the word “processed” sounds like the gnarliest of curse words, the kind we once whispered on the playground to see what would happen. We hear the word “processed” a lot, often in reference to various forms of vibrantly-hued cheese. But what is processed cheese, anyway? Is it really...not as good as real cheese? More artificial? Less healthy? We kind of know a lot of stuff about it, but let’s take a minute to set the record straight.Processed cheese is not 100% cheese. Most of the time it hovers around 50% cheese, sometimes more and sometimes less, but at a base level, processed cheese is real cheese cut with other, non-cheese ingredients. Those extra ingredients can include salt, food dyes, preservatives, extra dairy, emulsifiers, or other artificial ingredients. These ingredients are added to melted, pasteurized cheese, which is then converted to a sliced solid, a jarred sauce, a spread, a spray, or maybe even some little oil cartridge you put in a vape and inhale. (Probably not that last one, but we wouldn't be surprised). By the time the extra ingredients are added, the actual cheese in the mix has changed significantly in terms of both flavor and texture.Why would the people add this stuff to cheese? Well, we can say it’s to make the cheese a bit creamier or more consistent in flavor or just a little more well-seasoned and craveable. Processing produces cheese that melts like a dream without becoming oily or separating, facilitating the kinds of ooey-gooey cheese pulls that populate Instagram feeds the world over.  But really, these ingredients end up in processed cheese because it makes it last longer on the shelf. The preservatives are what give processed cheese the biggest draw. Some processed cheese doesn’t even need to be refrigerated; it can sit at room temperature for a seemingly-indefinite amount of time.What it comes down to is that grocers and distributors don’t have to care for processed cheese in the same way that they do for real cheese. It’s cheaper for the producer, the seller, and the consumer. It’s about money and time.Sweet, sweet Velveeta.\nPhoto by Alex LauSo...processed cheese is super bad? We should never eat that stuff, right? Uh...yeah, that's not what we're saying at all. Processed cheese can be amazing, and there are times when nothing else will do. If we’re talking about a cheeseburger or a breakfast sandwich, we’re hoping to see a perfectly melty piece of American cheese on top of that patty or egg. American cheese (and many other processed cheeses) melts in a way that real cheese doesn’t, and we love it for that. Cheese Whiz on a cheesesteak? Approved. Provel cheese on a St. Louis-style pizza? Oh, hell yeah.A breakfast sandwich isn't a breakfast sandwich without American cheese.\nPhoto by Alex Lau, Food Styling by Susie TheodorouIt’s fine to consume processed cheese, but like everything in life, it’s all about balance. You don’t want to eat processed cheese all the time. Not only is it not the healthiest thing out there, but it backs you into a corner that’s filled with one-noted cheeses. Because of the production process, real cheese holds flavor possibilities that processed cheese will never be able to replicate. The farms that raise the dairy animals, the hands of the cheesemakers, the microorganisms that convert milk into thousands of distinctly different, cheesy delights are all a part of what makes cheese special. With processed cheese, absolute consistency is the name of the game.A Budweiser and a craft IPA. A can of Spam and a dry-aged steak. A slice of American cheese and a wedge of beautifully stinky gorgonzola. There are times and places for options on both sides of the not fancy-fancy spectrum, regardless of what we’re talking about. Processed cheese is just a part of life, and the more you know, the better it will be.OK. A burger sounds pretty great, right about now.The Basically BurgerIt's all about that special sauce.View RecipeExplore Bon AppétitBasicallyCheese WeekCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Alex Delany"]}