{"id": "39497f57d07981e076122acfc030bc5b", "url": "https://www.bonappetit.com/recipe/squash-bowls-with-yogurt-sauce-and-frizzled-onions", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Squash With Yogurt Sauce and Frizzled Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSquash With Yogurt Sauce and Frizzled OnionsBy Sohla El-WayllyOctober 23, 20194.3(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kat BoystovaEmailPinterestPrintEmailPinterestPrintCookbook author Meera Sodha’s Goan Butternut Squash Cafreal recipe, from Fresh India, inspired this vegetarian main. Our favorite part? Crispy-sweet red onions that roast alongside the squash for a finishing dose of flavor and texture.Ingredients4 servings2medium red onions, thinly sliced10Tbsp. extra-virgin olive oil, dividedKosher salt1acorn squash, halved, seeded, cut into 1\" wedges1delicata squash, cut into 1\" rings, seeded1Tbsp. honey¾tsp. Aleppo-style pepper1½cups plain whole-milk Greek yogurt1garlic clove, coarsely chopped½bunch dill, coarsely chopped, plus more for serving½cup Castelvetrano olives, pitted, smashed, plus 1 Tbsp. olive brine3cups cooked brown ricePreparationStep 1Place racks in lower and upper thirds of oven; preheat to 375°. Toss onions, 3 Tbsp. oil, and a large pinch of salt on a large rimmed baking sheet. Bake on lower rack, tossing every 5 minutes, until onions are browned and frizzled, 30–40 minutes.Step 2Meanwhile, toss both squashes, honey, Aleppo-style pepper, and 2 Tbsp. oil on another large rimmed baking sheet. Season with salt. Arrange in an even layer and bake on upper rack until tender, 25–30 minutes.Step 3When onions are ready, remove from oven and increase oven temperature to 450°. Continue to bake squash until browned, about 10 minutes longer.Step 4Meanwhile, combine yogurt, garlic, ½ bunch dill, olive brine, half of the frizzled onions, and remaining 5 Tbsp. oil in a blender and purée until smooth. Add olives and pulse until finely chopped. Season to taste with salt.Step 5Divide rice among bowls. Pour ½ cup sauce over each. Arrange roasted squash over rice. Top with remaining frizzled onions and garnish with dill.How would you rate Squash With Yogurt Sauce and Frizzled Onions?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleDelicious! Made as is with plenty of salt at each stage.AnonymousSeattle, WA11/15/2021I was very disappointed with this recipe. Squash was bland and the sauce was gross. AnonymousNew York6/28/2020This is AMAZING. Bright, fresh, simple, and exciting! I wish I made about 4 times more onions, however. I will definitely be making this again!!AnonymousAustin, TX11/19/2019First of all, I've been loving BA recipes lately and have made so many from the Healthyish list! This was not bad, I enjoyed eating for dinner and lunch the next day, but probably won't be making this again. I felt like the sauce was missing a hit of acid, I had a half of a lime sitting in my fridge and that definitely brightened the sauce up, but it needed a lot more. I really loved the onions (I adore this method of preparing red onions and would eat it with anything) but I wasn't 100 percent sold on this combination of flavors. Ended up serving with farro instead of brown rice because that's what I had lying around. But hey, this was pretty cheap and healthy too. Overall, reasonably tasty recipe, but felt like my bowl was missing something when it was finally put together. AnonymousBrooklyn, NY11/11/2019Delicious, worth slicing my thumb on the mandoline for.AnonymousDelaware, United States11/2/2019Had this for lunches and ate cold-was really yummy. Also added some sautéed kale. This sauce is crack and I’ve been eating the leftovers with everything Sarah_kateAstoria, NY10/31/2019Isn’t “frizzled” Alison Roman’s coined slang?AnonymousCincinnati10/28/2019Explore Bon AppétitAcorn SquashSquashVegetableDelicata SquashOnionDillHerbs & SpicesRiceRice & GrainsFallMainGluten-FreeNut-FreeVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Sohla El-Waylly"]}