{"id": "395edde9baf7a65c71330264f66b6398", "url": "https://www.bonappetit.com/story/sweetbitter-show-restaurant-training", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "How ‘Sweetbitter’ Compares to Real Fine-Dining Restaurant Training | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow ‘Sweetbitter’ Compares to Real Fine-Dining Restaurant TrainingAnd see if you could pass the waitstaff’s fine-dining test.By Alyse WhitneyMay 10, 2018FacebookTwitterEmailMacall Polay/StarzFacebookTwitterEmailA crash course in fine dining ended with hundreds of broken plates and glasses across the set of Sweetbitter. To make the TV adaptation of the bestselling Stephanie Danler novel as authentic as possible, the entire cast was trained as if they were working in a real restaurant. According to Caitlin FitzGerald, who plays wine expert and server Simone on the series, it was a “total war zone” during training at the Institute of Culinary Education. At least 20 wine keys were broken learning to open bottles tableside, and hot plates filled with a few pounds of real food shattered, but all of that couldn’t break the cast’s spirits. Throughout two grueling weeks, “front of house adviser” Justine Slattery (who spent 8 years at Union Square Café) helped everyone get to a point where it felt like an authentic running restaurant, and the only fake part of the show was the booze—no alcohol could be poured on set.The interior of 22W, Sweetbitter’s fictional restaurant in NYC.\nMacall Polay/StarzEven though the wine was tinted water, the knowledge about vino had to be real for FitzGerald. Her character Simone spills wine knowledge effortlessly, coaching doe-eyed newcomer Tess (Ella Purnell) on how to taste with every part of her palate—sweet, sour, salty, bitter, and umami, as displayed across the STARZ show’s promotional posters—and distinguish the difference between Cabernet Sauvignon and Malbec. Before the show, FitzGerald worked in catering as a teenager and at 10 restaurants during college and between auditions in NYC, but none were “as nice as 22W or required knowing so much information, especially about wine,” she said. “In the restaurants that I worked in, if you had a few things to say about each wine by the glass, you could get by. Most customers say, ‘I like a dry white’ or ‘I like a full-bodied red,’ so I had an answer for both of those, and a few in between. I never had an intimate relationship with wine until working on Sweetbitter.”In addition to learning “the ritual and ceremony of opening and pouring a bottle of wine tableside,” and how to hold a bottle properly, FitzGerald had to learn how to talk about wine. Slattery, the show’s restaurant consultant, currently works at wine bar Terroir in TriBeca and taught FitzGerald the art of wine conversation through osmosis. Slattery explained: “Wine is so intimidating to people, and oftentimes they’re just hoping the server will solve 35 years’ worth of marital strife and be their therapist. Navigating that is what the industry calls ‘reading your table.’ You have to know what people want in a split second and figure out if they want something new and interesting or chill and approachable.”FitzGerald (right) masters the three-plate hold on Sweetbitter.\nMacall Polay/StarzThe most difficult task to master on set for FitzGerald was opening a bottle of champagne. The script instructed her to open it “with barely a whisper,” meaning no pop, no flying cork, and definitely no exploding bubbly. “Justine and I opened 30 bottles of champagne one afternoon. I would say when we shot it, I had about a 30 percent success rate,” FitzGerald recalled with a laugh. “There was a couple of takes where I almost took my eye out!” (The trick is to keep pressure on the top of the cork with your thumb and hold the base of the bottle with your other hand. When you open it, gently twist the bottle and cork in opposite directions until it inches out.) One other eye-opening moment for her was learning about the difference in wine temperatures: “White wine should be taken out of the fridge 20 minutes before serving, and red wine should be put in the fridge for the same amount of time. If the wine’s too warm, the alcohol is the predominant flavor, and if it’s a little bit chilled, you get all the different complex notes.”On Sweetbitter, every 22W employee has to pass a written exam and a shadowed day of service to show their competence at the restaurant.  Slattery said that a standard NYC restaurant would likely have 15–30 comprehensive questions that gives management an idea of how much someone learns in a two-week trial run and what their weaknesses are.We excerpted six questions from the show’s fine-dining test, and FitzGerald aced it (with bonus points for wine barrel drawings—check it out below):Click here to enlarge the test and see FitzGerald’s answers (and wine barrel drawings) up close.\nAlex LauFitzGerald never had to take one of these tests during her restaurant days in NYC, but thinking back to her time waitressing stirred up a lot of old memories—especially the embarrassing ones. Her character, Simone, almost floats through the dining room, but in her 20s, she was not as graceful. “I was holding a pitcher of red sangria, tripped, and poured the entirety of it onto a woman’s white cashmere coat!” she recalled. “The whole restaurant went silent and stared at me, and I thought, ‘I could just walk out. I could get my coat and walk out the door and not look back.’ But instead, I paid her dry cleaning bill and came back the next day.” A decade later, she is still spilling wine and breaking glasses, but on Sweetbitter, the Gossip Girl of the restaurant world, the drama is fully embraced.Speaking of wine...Explore Bon AppétitTvInterviewsCelebritiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Alyse Whitney"]}