{"id": "39667b1a211dc4dd5048dc43de8b9286", "url": "https://www.bonappetit.com/recipe/grilled-spicy-pork-meatballs-with-nuoc-cham", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Grilled Spicy Pork Meatballs with Nuoc Cham Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJuly 2019 IssueGrilled Spicy Pork Meatballs with Nuoc ChamBy Molly BazJuly 3, 20194.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintIf you’re not set up for grilling or the weather doesn’t permit, a cast-iron grill pan will also do the trick for making these spicy, gingery, umami-packed meatballs. You may need to work in batches depending on the size of your skillet.IngredientsMakes 2012\" piece fresh ginger5garlic cloves, divided2lb. ground pork2tsp. kosher salt½cup plus 1 Tbsp. finely chopped cilantro¼cup plus 2 tsp. hot chili paste (such as sambal oelek)4Tbsp. fish sauce, divided4tsp. sugar, divided½cup fresh lime juice (from about 4 limes)2Tbsp. vegetable oil, plus more for grillSpecial EquipmentTwenty 8\" metal or wooden skewersPreparationStep 1If you’re using wooden skewers, soak in water 30 minutes.Step 2Finely grate ginger and 4 garlic cloves into a medium bowl. Add pork, salt, ½ cup cilantro, ¼ cup chili paste, 2 Tbsp. fish sauce, and 2 tsp. sugar and mix well with your hands to combine.Step 3Form pork mixture into 20 oblong (football-ish) balls. Transfer to a rimmed baking sheet or large plate and chill at least 15 minutes and up to 8 hours.Step 4Meanwhile, whisk lime juice and remaining 1 Tbsp. cilantro, 2 tsp. chili paste, 2 Tbsp. fish sauce, 2 tsp. sugar, and 2 Tbsp. water in a small bowl until combined. Finely grate remaining garlic clove into nuoc cham and stir to combine.Step 5Prepare a grill for medium heat. Lightly oil grate. Thread 2 balls lengthwise onto 2 skewers, repeating to make 10 skewers with 2 meatballs on each. (Using 2 skewers stabilizes the meatballs so that they won’t spin around when you turn them on the grill.)Step 6Drizzle meatballs with 2 Tbsp. oil. Grill meatballs, turning occasionally, until well charred and just cooked through, 7–9 minutes. Let cool slightly. Remove from skewers and transfer to a platter. Serve nuoc cham alongside.How would you rate Grilled Spicy Pork Meatballs with Nuoc Cham?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleDelicious! It was a bit on the salty side so I will definitely reduce the amount of salt added on top of the fish sauce next time. Didn’t have a grill so just seared the meatballs deeply on all sides in a pan. AnonymousSan Diego7/4/2020Bon Appétit does it again! Used a cast iron skillet on medium and worked in 2 batches. I would forego the 2 tsp salt next time since the fish sauce adds enough saltiness. We wrapped these up in fresh lettuce with rice and cucumbers. Amazing. Monica PavsSan Jose8/28/2019Absolutely delicious and easy to make . We used beef instead of pork since that’s what was on hand. Could also see turkey being great. I would like to live in the nuoc cham sauce. AnonymousNC8/8/2019 ❤️ ❤️ Absolutely drop dead gorgeous ❤️ ❤️\nMolly URA⭐Nottingham UK7/13/2019Great recipe!! Would definitely make again Anonymous7/8/2019\"You may need to work in batches depending on the size of your skillet.\" - there's no skillet in the recipe, did you mean grill? halpwrNew york7/8/2019Wonderful recipe, wouldn’t change a thing. Ebraun156White Plains, MD7/6/2019Explore Bon AppétitMeatballSkewerVietnameseSoutheast AsianAsianGround PorkPorkMeatSummerQuickEasyWeeknight MealsMainDairy-FreeNut-FreeGluten-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Molly Baz"]}