{"id": "3972086076070018b5a7eecde7a11efe", "url": "https://www.bonappetit.com/recipe/cod-cakes", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Cod Cakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueCod CakesBy Betsy and Kristine LarsenApril 14, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhotographs by Elizabeth Cecil, food styling by Danielle PattavinaEmailPinterestPrintEmailPinterestPrintYou can find salt cod in the seafood department of your grocery store or at a local fish shop. It may smell briny but once soaked will mellow while staying full of flavor. This recipe is from Larsen’s Fish Market, a tiny little seafood shack in the tiny little fishing village of Menemsha, Martha’s Vineyard.Ingredients1lb. dried salt cod2lb. russet potatoes (about 4 medium), peeled, quartered1medium onion, coarsely chopped4Tbsp. unsalted butter¾tsp. freshly ground black pepper, plus more1large egg, beaten to blendSpecial Equipment:A deep-fry thermometerPreparationStep 1Place salt cod in a medium pot and pour in cool tap water to cover. Bring to a boil; drain . Repeat process until a small flake of salt cod no longer tastes inedibly salty, 1 or 2 more times. Drain well. Wipe out pot and reserve.Step 2Meanwhile, fill a large pot with cold water. Add potatoes and bring to a boil. Reduce heat and simmer until potatoes are very tender, about 15 minutes; drain well. Transfer to a large bowl and mash with a potato masher.Step 3Pulse onion in a food processor until a paste forms. Melt butter in reserved pot over medium heat. Add onion paste and cook, stirring occasionally until water has mostly evaporated and onion is translucent, about 5 minutes; stir in ¾ tsp. pepper. Add onion mixture to potatoes and mash until evenly incorporated.Step 4Add salt cod to food processor (no need to clean) and pulse until finely chopped. Add fish to potato mixture and mash well to combine. Taste and season with salt and more pepper if needed. Let cool, then fold in egg. Cover and chill mixture until cold, at least 1 hour and up to 12 hours.Step 5Form mixture into ten 4-oz. patties. Place flour in a shallow bowl and dredge each patty lightly in flour, shaking off any excess.Step 6Pour oil into a large Dutch oven or other heavy pot to come 2” up sides. Clip thermometer to side of pot and heat oil over medium until thermometer registers 350°. Working in batches, fry cod cakes, turning halfway through, until golden brown, about 5 minutes per batch. Transfer to a wire rack as you go. Season cod cakes with salt and serve with tartar sauce and lemon wedges.Step 7Do Ahead: Cod cakes can be formed into patties 2 days ahead. Cover and chill until ready to dredge and fry.How would you rate Cod Cakes?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFor a classy appetizer course, mound the cod cake mixture on artichoke bottoms and put under the broiler until golden.  Briny fish and artichoke bottoms are amazing together!beejayCalifornia1/28/2022I learned a very similar recipe from my grandmother, who learned it from her mother-in-law (probably in the 1930's!). The main difference is that she pan fries them in butter instead of deep frying them. She didn't add onions (one of the few recipes in which she didn't). I do, but I don't puree them. I saute them and add them to the cod/potato mixture before pan frying them. I also don't flour or chill them. Form and pan fry! We serve them with baked beans. Sooooooo good. I'll give them a shot this way though. Keith SSeekonk, MA11/1/2021Love these, easy easy easy. \nQuestion: Can cooked fishcakes be frozen? Recipe makes more than we can use in one meal.baquilinoNew York, NY5/27/2020Explore Bon AppétitNew EnglandAmericanCodFishSeafoodPotatoVegetableRusset PotatoMainStarterNut-FreeGluten-FreeDeep-fryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Betsy", "Kristine Larsen"]}