{"id": "397a0f0e3bc9a2aa94b6aaccbb3c4cf0", "url": "https://www.bonappetit.com/recipe/citrus-and-avocado-salad-with-orange-water", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Citrus and Avocado Salad  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCitrus and Avocado Salad with Orange WaterBy Andy BaraghaniJanuary 9, 20183.3(5)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintSalting the citrus draws out some of the juice, which becomes part of the vinaigrette.Ingredients4 servings2½pounds mixed citrus (such as oranges, blood oranges, and/or grapefruit)½cup kumquats, thinly sliced, seeds removed (optional)2tablespoons fresh lemon juice2teaspoons orange-flower or rose waterLarge pinch of kosher salt1avocado, cut into large pieces3tablespoons salted or unsalted, roasted pistachios, finely crushed3tablespoons tarragon leavesExtra-virgin olive oil (for drizzling)PreparationStep 1Using a paring knife, remove peel and white pith from citrus, being careful not to remove too much of the flesh. Slice citrus into ½\"-thick rounds, then cut into 1½\" pieces (it looks cool and is less fussy if pieces aren’t too exact in shape and size). Transfer to a medium bowl and add kumquats, if using, lemon juice, orange-flower water, and salt. Toss and let sit 5 minutes so citrus can release some of their juices.Step 2Transfer citrus, leaving juice behind, to a large plate. Tuck avocado in between and around citrus.Step 3Spoon citrus juice over salad, scatter pistachios and tarragon over, and drizzle with oil.How would you rate Citrus and Avocado Salad with Orange Water?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGood and easy, hard to want more.ShelmarMacon, GA2/2/2021so good! I chopped the tarragon and pistachios together (not sure if you're supposed to do that) but it was amazing. kmarxmarxchicago6/13/2018Explore Bon AppétitSaladMiddle EasternOrangeCitrusFruitBlood OrangeGrapefruitAvocadoVegetableKumquatRose WaterAlcohol & Other DrinksWinterQuickEasySideDairy-FreeGluten-FreeRawVeganVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}