{"id": "39878ec406555ed64d909f857a7abe32", "url": "https://www.bonappetit.com/recipe/pink-grapefruit-sugar-cookies", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Pink Grapefruit Sugar Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssuePink Grapefruit Sugar CookiesBy Jesse SzewczykNovember 23, 20213.8(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintSoft grocery-store-style cookies get a makeover in food stylist and recipe developer Jesse Szewczyk’s book Cookies: The New Classics. “These sugar cookies are everything you love about the nostalgic lunchbox treat,” he writes, but “reimagined with the unexpected addition of pink grapefruit zest.” Citrus keeps the cookies zippy and offsets the sweetness of the fluffy frosting. Use a little gel food coloring (or a lot!) in the frosting to customize your shade.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonMedium #40 Cookie Scoop$16 At AmazonMicroplane Grater$16 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketWire Cooling Rack$17 At Bon Appétit MarketIngredientsMakes about 24Cookies2¾cups (344 g) all-purpose flour¼cup (30 g) cornstarch¾tsp. baking powder¾tsp. baking soda½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt2tsp. finely grated pink grapefruit zest1cup (200 g) granulated sugar½cup (1 stick) unsalted butter, room temperature1large egg⅓cup sour cream, room temperature1Tbsp. vanilla extractFrosting and Assembly4cups (440 g) powdered sugar, sifted½cup heavy cream½cup (1 stick) unsalted butter,room temperature1tsp. finely grated pink grapefruit zest1tsp. vanilla extract½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltRed (or any color) gel food coloring and sprinkles (for decorating)PreparationCookiesStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Whisk together flour, cornstarch, baking powder, baking soda, and salt in a medium bowl.Step 2Using an electric mixer on medium speed, beat grapefruit zest, sugar, and butter in a large bowl until light and fluffy, about 3 minutes. Add egg, sour cream, and vanilla and beat to incorporate, about 2 minutes (the mixture might look curdled, and that’s okay). Reduce speed to low and beat in dry ingredients until just combined.Step 3Using a #30 cookie scoop (about 2 Tbsp.) and working one at a time, scoop out portions of dough and roll into balls (you should have about 24). Divide between 2 parchment-lined baking sheets, spacing at least 3\" apart. Gently flatten cookies to about 1½\" in diameter.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway though, until edges are light golden but tops are still pale, 11–13 minutes. Let cookies cool 5 minutes on baking sheets, then transfer to a wire rack and let cool completely.Do Ahead: Cookies can be baked 5 days ahead; store airtight at room temperature.Frosting and AssemblyStep 5Using an electric mixer on low speed, beat powdered sugar, cream, butter, grapefruit zest, vanilla, and salt in a large bowl until combined. Increase speed to high and beat until light and fluffy, about 3 minutes. Using a toothpick or skewer, add a small drop of food coloring to frosting, then beat to combine.Step 6Spoon 1 heaping Tbsp. frosting onto each cookie; use a spoon or offset spatula to create swirls. Decorate cookies with sprinkles.Do ahead: Cookies can be frostedand decorated 2 days ahead. Store airtight at room temperature.Recipe Excerpted From ‘Cookies: The New Classics’, by Jesse Szewczyk (Clarkson Potter). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Pink Grapefruit Sugar Cookies?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleOne of the BEST cookies I've ever made! The cookie was fluffy and flavorful, and the buttercream is divine! The salt really makes it. I'm going to use this buttercream for cakes and macarons too! Absolutely a keeper. I made them exactly as written. SarahBaltimore, MD1/20/2022I made these exactly as described, and they looked perfect. The texture of both the cookies and frosting were amazing. BUT I was super disappointed with the flavor of the grapefruit. It was just...off. It tasted grape-fruitlike, and I love grapefruit, but it just did not do it for me in this cookie combination. I would like to try them again and sub pulverized freeze-dried berries for the grapefruit zest. But the structure of these cookies is really excellent.LibbyAtlanta, GA1/19/2022We loved these cookies! I’m not sure why some had the unfortunate experience of no flavor; ours were very flavorful. We are blessed with a yellow grapefruit tree in our front yard, which is what I used here (although I still used red gel in the frosting for the pretty pink color). While the juice from our yellow grapefruits is very bitter, both it and the zest of the fruit is incredibly flavorful— I love using them for baking! Perhaps try the yellow variety instead of pink if you can find them? Grace SSan Diego, CA1/3/2022I normally am not a huge grapefruit fan but made these to use up some sour cream in the fridge. I love them! I had great grapefruit flavor in mine, not sure why some people had issues. My cookies also didn't spread that much but I don't mind. Lovely!Sarah Saskatoon, SK12/18/2021For those who want the sprinkles: Wilton has a \"Rose Pink Pearl Mix\", that's what seems to be used on the picture.AnonymousPhiladelphia12/17/2021I substituted the grapefruit zest with orange, other than that I followed the recipe exactly  (thank you so much for the weights, it really simplifies the process). They got rave reviews even without the fabulous sprinkles. These are most definitely the closest to the grocery store cookies I have tried. Yummy. The delicious frosting was enough for two batches of the cookies.  I stacked them in a shallow container with parchment paper in between. Julianne Renton Washington 12/14/2021My cookies didn't spread at all.  I think I used a slightly small cookie scoop because I ended up with 31 cookies. I flattened them to 1.5 inches like the recipe said but they are still pretty fat and stubby looking. Otherwise I think the recipe works well. It's definitely a starchy, sweet, soft, cheap texture you might get from the Safeway bakery!StephanieBerkeley, CA12/11/2021Not the best recipe; my cookie tasted more like a scone. Not sure what went wrong, but you got me to try it with that gorgeous photo! On to the next recipe ;)Bree HansonLos Gatos, Ca12/9/2021I'm sorry. I followed the recipe exactly by gram weight even and was disappointed-no grapefruit flavor. I even added extra zest to both cookie and frosting. Don't need to make again. Just a very sweet cookie :( And I'd like instructions on once frosted, how do you stack them to store them?JessieHouston12/5/2021PLEASE reveal the sprinkle source Anonymous12/5/2021Ok, but where did you get those sprinkles???AnonymousBend, OR12/2/2021Explore Bon AppétitCookieDessertGrapefruitCitrusFruitEasyAmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Jesse Szewczyk"]}