{"id": "398fe3c3f1aa84ea2dd5087b262f0a98", "url": "https://www.bonappetit.com/story/cold-roasted-salmon", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "A Roasted Salmon Recipe That's Even Better Served Cold | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Roasted Salmon Recipe That Is Even Better Served ColdWhen it's this hot outside, dinner should be chill(ed).By Julia KramerJuly 30, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailYou know what’s overrated? Hot food.I want my coffee to arrive just warm to the touch—not so scaldingly hot I have to precariously balance it with my tangled headphones on the subway before finally being able to take a sip twenty minutes later. When I order a slice at the pizza shop late at night, I want it to be melty but really just above room temp—not so tongue-scorchingly hot that I can’t taste food for like two days afterward. And when I have people over for dinner, I would like to not spend one single moment worrying about how all the food is going to simultaneously emerge from the oven at the exact time we are all ready to sit down to eat.There’s nothing more affirming than when someone in the Test Kitchen—a person who is literally paid for his or her opinion about what temperature food should be—shares your sentiment on a food issue such as this, and a few months ago I discovered a kindred soul, Senior Food Editor Anna Stockwell, who felt so passionately about this topic that she pitched a whole feature story surrounding it (which I had the privilege of editing) entitled: Dinner Is A Meal Best Served Cold.There are lots of great recipes in this story—Cold Beef Tenderloin, yes please—but there is only one that I’ve already made three times, and it’s the Cold Roast Salmon, always alongside Anna’s Grilled Serrano Salsa Verde (though, full transparency, I just char the serrano or jalapeno in a cast-iron skillet, as I have never owned nor have any interest in owning a grill).The technique is simple: You season the salmon with salt, pepper, and red pepper flakes, and then you roast it in the oven at 300 degrees for a little under half an hour. This totally hands-off method—as anyone who has made this iconic roasted salmon can testify—yields the most buttery, rich, never-overcooked, gently flakeable salmon imaginable.And then, when it emerges from the oven, you do...nothing. You leave it out on the counter for a little bit while you set the table. You cover it and put it in the fridge. You go for a walk. You go the thrift store across the street and buy a lamp. You pick up some other stuff from the grocery store. You make a salad (maybe the smashed green bean one that lives with this salmon recipe, maybe not). You do whatever the F you feel like, because you’ve already made dinner and it’s, like, 3 p.m. And then, when people show up at your house around 7, you do the weirdest thing imaginable: You just sit on your couch and hang out with them.And when your friends start to look a little antsy and maybe wondering whether they got the wrong memo—since there is clearly no food actively being prepared—you go the refrigerator and you take out the salmon, and you hit it with some lemon juice and a drizzle of olive oil and some flaky sea salt, and you ruffle around in the fridge and find the mason jar of Grilled Serrano Salsa Verde from the other night, and you set out that salad you made. And then everyone immediately digs in.Because the best thing about this meal isn’t even that it takes away any conceivable worry about how everything’s going to come to the table at the same time while still being hot. It’s that, in this swampy time of year we call summer, roasted salmon actually tastes better like this—cool, refreshing, a little firmer but still tender and moist—and you don’t have to wait even a moment to eat it.Salmon and chill?Cold Roast Salmon with Smashed Green Bean SaladRoasting salmon low and slow yields fish that stays moist and tender even when served chilled.View RecipeExplore Bon AppétitHealthyishSalmonSummerRead MorecookingThis Grilled Salmon Recipe Is What Summer Weeknight Dreams Are Made OfBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Julia Kramer"]}