{"id": "3999adb44f557a9f00cb0ef921dfb807", "url": "https://www.bonappetit.com/story/casamara-club-soda", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "I’m Now a Leisure Soda Guy, Thanks to These Refreshing Leisure Sodas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Now a Leisure Soda Guy, Thanks to These Refreshing Leisure SodasWhen I’m not trying amari, beers, and natural wines on the job, I’m relaxing at home with a Casamara Club Soda.By Alex DelanyOctober 10, 2019FacebookTwitterEmailPHOTO BY JENNA BELEVENDER AND MICHELLE GERARDFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I am a big fan of alcoholic beverages. So much so that I have actually secured a job as a drinks editor here at BA where I get paid to drink them. Despite nerding out all the time over amaro and naturally sparkling Chenin Blanc and mixed-culture saisons, I have another drinks-related passion, one that doesn’t get shouted quite as loudly from the rooftops. And that passion is soda. So when I encounter a soda that provides the same level of enjoyment as, say, an Averna spritz, I need to shout about it from the electronic rooftops. So here we go: Casamara Club Sodas are superb, botanical, non-alcoholic beverages!Casamara Club in Detroit bases its sodas after Italian aperitivo and digestivo, which means—as an amaro lover—I’m already on board, drawn in by the unique flavors from roots, fruits, barks, leaves, and vegetables that are infused. They come in four varieties, but my favorite is the Capo, a minty, citrusy, bright, palate-cleansing soda that conjures fantasies of lavish skiing vacations in the Italian Alps. It is an absolute stunner and my refreshing afternoon drink of choice this fall.And yes, I could sell you based on the beautifully designed label. Or the fact that they’re low-sugar, low-carb, etc. But I don’t have to, because whoever is running copy over at Casamara already listed possibly the greatest selling point ever: Casamara is a leisure soda. That’s what they call it. How great is that? Are you drinking a soda? Oh, no. This is a leisure soda. Can’t you tell by how relaxed I look at the moment?Actually, that’s a good way to describe the beverage category I explore the most: leisure drinks. Whether we’re talking spritzes, light-bodied wines, or botanically infused soda, I’m looking to relax. And Casamara Club is one of my favorite ways to do just that.Buy it: Casamara Club Sparkling Amaro Soft Drinks, $36 for 12 bottles at Casamara ClubAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendSodaShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-10", "author": ["Condé Nast", "Alex Delany"]}