{"id": "399d752f371f5f01ffe384f5b3826357", "url": "https://www.bonappetit.com/story/salsa-verde-sauce-recipes", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "What Is Salsa Verde? 4 Types to Memorize | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Salsa Verde? 4 Types to MemorizeHow to use pesto, chimichurri, and more for marinating, finishing, and dipping.By Alyse WhitneyOctober 23, 2018FacebookTwitterEmailFacebookTwitterEmailIf you only make one type of sauce on the regular, it should be salsa verde. The biggest misconception about salsa verde is that it's literally salsa—as in, to dip tortilla chips in. But it's so much more than that. It's a category of green sauces that are served cold or room temperature and uncooked. Almost every country has its own favorite green sauce, and it can be vinegar-forward, oil-forward, or made of mostly vegetables. Popular salsa verdes include Argentinian chimichurri, Italian pesto, Mexican tomatillo and/or avocado salsa, and French sauce verte.Most all salsa verdes are five ingredients or less—garlic, herbs, oil, vinegar, and sometimes some form of heat like chiles or chile flakes—and work well as a marinade or finishing sauce for virtually any meat or vegetable. These green sauces are also as versatile and multi-purpose as mayonnaise: they can be a dip, spread, sauce, or condiment. Try it with anything from grilled chicken to eggs to dip for vegetables.Not sure of what green sauce to use? Here's a quick guide.Chimichurri and tri-tip steak are a wonderful match.\nGentl & HyersChimichurriIf your main ingredient is a little more hearty and robust like steak, top with a vinegar-based salsa verde to cut through the heaviness, like chimichurri. The quick sauce—garlic, parsley, cilantro, red wine vinegar, and olive oil—is particularly great on quick-cooking skirt, hanger, and tri-tip steak, but it would taste good with any meat, TBH.A classic basil pesto is a great type of salsa verde to make on a whim.\nPhoto by Alex LauPesto and Sauce VerteIf you’re cooking something a little milder—like fish, pasta, chicken, or vegetables—an oil-based pesto or mayonnaise-based sauce verte is probably a better way to add more flavor and more fat. Ideally, you don't want fat on fat. Pesto can be made a million different ways, with different greens—even kale and collards—olive oil, cheese, and nuts. Try it for grilled chicken, and then use the leftovers for pasta or potato salad.This salsa verde is made with avocados AND tomatillos.\nMarcus NilssonTomatillo or Avocado SalsaSalsa verde in Mexico is a green salsa, which could be tomatillo or avocado based. However, salsas are typically referred to by ingredient, not color. So if there was an avocado salsa, it'd be \"salsa aguacate\" and not \"salsa verde.\" It's served with tacos and other dishes, but the tart flavor would also pair well with grilled shrimp.Yeaaaah, salsa verde is great with crispy meatballs.\nNow that you're educated on salsa verde, use it for everything. You can top grilled tofu, fried pork scaloppine, beer-braised brisket, broiled red snapper, or one of our favorite weeknight dinners, crispy sheet-pan meatballs with salsa verde. It only gets more flavorful as it sits—though the color will darken slightly as the herbs oxidize—so you can make your coworkers green with envy when you bring leftovers it for lunch the next day. What are you waiting for? Go make a double batch right now.Explore Bon AppétitSalsa VerdeSauceBasicallyRead Morerecipes26 Pesto Recipes for When You Want Greens and CheeseGallery26 SlidesBy Bon Appétitrecipes48 Recipes for Mexican Foods That Aren't TacosGallery48 SlidesBy Bon AppétitcookingHow to Make Pesto Out of Just About AnythingBy Amiel StanekcookingSalsa Verde Is the Goes-On-Everything Sauce You've Been Waiting ForBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-06-29", "author": ["Condé Nast", "Alyse Whitney"]}