{"id": "39a025371c039ea6fc36704ccb513469", "url": "https://www.bonappetit.com/story/indigenous-chefs-thanksgiving", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "3 Indigenous Chefs Explain What Thanksgiving Means to Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle3 Indigenous Chefs Talk About What Thanksgiving Means to ThemBy Priya KrishnaNovember 25, 2019FacebookTwitterEmailWe asked these members of I-Collective, an organization of indigenous chefs and activists, how they're spending Thanksgiving.FacebookTwitterEmailLet’s take a pause from the turkey and stuffing. To many Native people, reckoning with Thanksgiving can be difficult—for obvious reasons. This is partially why the I-Collective, an organization of indigenous chefs and activists across the country, was born. The group hosts Thanksgiving dinners with a decidedly different narrative, celebrating the resilience of their people and telling their stories through food. We asked three I-Collective members to tell us about their own relationship to Thanksgiving and how they spend the day.Hillel Echo-Hawk\n“I know now that Thanksgiving wasn’t a nice party with pilgrims on one side and Natives on the other.”I grew up with a really big family in a very small town in Alaska. My mom is Irish and my dad is Pawnee. We always had Thanksgiving at our evangelical church. Turkey, mashed potatoes, stuffing, pumpkin pie. People would dress up as Indians and pilgrims. It was weird.As a kid I wanted to be the pilgrim. Indians didn’t have the good story. They were the supporting characters, not the stars. They were scary. It never occurred to me that there could be another way. Six years ago I read an article online about the real history of Thanksgiving, including one in 1637 that marked one of the first massacres of indigenous people on this continent. I felt sad and frustrated. How could no one have told me? I called my mom, and she had no answers. We have never talked about it since.My parents are divorced now, and my dad still puts religion above his Native identity. My mom celebrates Thanksgiving in Alaska, and she wants the American standards. But I see it as a time to hang out with my siblings. We make carnitas with refried beans, sweet potato pie with fried sage, and soba. We honor not just my Native culture, but the Mexican and Japanese heritages of my brothers-in-law.Now I have a small catering company, Birch Basket, in Seattle. My clients are mostly Native. I use my traditional foods—nettles, sunflowers, wild Alaskan cranberries, maple syrup, wild rice from the Great Lakes tribes—in everything I do. Indigenous people have been eating these foods and using them in ceremonies and as medicine for a long time. They were growing on this land before we got here. They are a part of me. I know now that Thanksgiving wasn’t a nice party with pilgrims on one side and Natives on the other. But to me it’s a day to celebrate our resilience and lift each other up. –Hillel Echo-Hawk, Pawnee and Athabaskan, Seattle Owner of Birch Basket.Tashia Hart“My identity is inseparable from the food that I eat.”From an early age my dad instilled in me a love and respect of the land, plants, animals, and people. In the summer he’d take us pole fishing. We’d traverse the back roads of the Red Lake Reservation of Anishinaabeg in northern Minnesota where I grew up, scouting for blueberries, looking for deer trails. We’d go around checking on the wild rice that grows in lakes and streams.When I was a kid, my mom told me that federal holidays like Thanksgiving were a vain attempt to celebrate something not worthy of celebration. I honestly can’t remember one Thanksgiving meal at home. I assume we ate like any other day (though I do remember liking the time off from school).Thanksgiving is a trying time for many in the Native community. Historically we’ve had our traditions and foods held in contempt by Americans—they have slaughtered our bison and drained the lakes we depend on for survival. It wasn’t until 1978 that the American Indian Religious Freedom Act gave our way of life legal protections. This is why a lot of us, when asked to supply recipes for picture-taking and publicity around Thanksgiving—we’re hesitant.My identity is inseparable from the food that I eat. Chokecherry syrup and mashkiigobagwaaboo (swamp tea) feel like home. They are markers of place, space, and time. I study and forage indigenous plants for a living, and I’m working on a cookbook about manoomin (wild rice).I’m doing my best to heal and trust. Food and healing go hand in hand. No matter what our walk in life, it’s our food memories with our families and communities that bring us a deep and powerful sense of kinship, well-being, and togetherness. This Thanksgiving, my advice is to celebrate your dependence on the food you eat, and show your food respect. Don’t be afraid to tell it: Thank you. I love you. I respect you. –Tashia Hart, Red Lake Anishinaabe, Duluth Culinary ethnobotanist and writer.Kristina Stanley\n“To me it’s about giving thanks for the chance to connect with my roots.”I had a pretty typical American understanding of Thanksgiving growing up in Wisconsin. My father didn’t learn he was Native until his early teens, and my mom is German. We had large family gatherings where we’d play football out in the street. It wasn’t until well into adulthood, working as a chef for the Intertribal Agriculture Council in Madison, that I discovered the true costs of colonialism.I still celebrate the day, but to me it’s about giving thanks for the chance to reconnect with my roots and helping my family reconnect as well. Each year I incorporate more indigenous ingredients into our meal. We make squash pie with amaranth and mesquite flour crust, venison, cornbread, wild rice, and whitefish. These foods help us deepen our connection to the culture and our ancestors. Sharing food stories with my family is healing.I encourage everyone to build their own traditions and develop what Thanksgiving means to them. There’s nothing wrong with celebrating family and gratitude. My hope is that people can do so while also learning about the holiday’s true origins. Seek out Native narratives. Incorporate indigenous ingredients into your meal. Source them from tribal producers like Red Lake Nation Foods or White Earth.I’ve worked with food my entire life, and it’s been the most natural way to give back to my community. My family’s story of disconnection is not uncommon, and my journey to connecting with my indigenous roots is just getting started. –Kristina Stanley, Anishinaabe of the Red Cliff Tribe, Appleton, WI Founder and head chef at Abaaso Foods.Photos by Alex LauExplore Bon AppétitHealthyishThanksgivingNative AmericanInterviewsRead MoreLifestyleFrom Acorn Bread to Chia Cake, This New Cafe Serves Only Indigenous FoodsBy Flora TsapovskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-25", "author": ["Condé Nast", "Priya Krishna"]}