{"id": "39a504043feb78b4d52fa861ef89240e", "url": "https://www.bonappetit.com/recipe/coconut-brussels-sprouts-gratin", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Coconut Brussels Sprouts Gratin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Brussels Sprouts GratinBy Brigid WashingtonNovember 23, 20204.0(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrint“Don’t be surprised if this creamy vegan gratin outperforms some of the heavier traditional Thanksgiving sides,” writes recipe developer Brigid Washington, who first shared this recipe in her book, Coconut. Ginger. Shrimp. Rum.: Caribbean Flavors for Every Season. “Here, coconut milk delivers all of the creamy, comforting goodness without any of the full dairy heft, plus it adds a mild, nutty flavor that leans into brussels sprouts’ natural savory sweetness. It has all the makings of a year-after-year holiday hit—or even just a comforting, cold weather go-to.”Ingredients4 Servings1lb. brussels sprouts (20–22 small to medium heads)1Tbsp. plus 1½ tsp. Diamond Crystal or 2½ tsp. Morton kosher saltZest of 1 large lemon113.5-oz. can full-fat coconut milk2Tbsp. extra-virgin olive oil1tsp. freshly ground black pepper1tsp. finely grated nutmeg1½cups unseasoned fine dry breadcrumbs or 1 sleeve crumbled Ritz crackersPreparationStep 1Preheat oven to 350°. Bring 4 cups water to a boil in a medium saucepan.Step 2Meanwhile, using a chef’s knife, remove stems from each brussels sprout, then cut each head into quarters through stem end.Step 3Season boiling water with 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton salt, then add brussels sprouts and cook 4 minutes. Drain brussels sprouts in a colander and run the coldest possible tap water over sprouts, about 30 seconds. (Because the brussels sprouts will be baked, cold tap water works just as well as an ice water bath here; they don’t need to be completely cooled.) Turn out brussels sprouts onto a kitchen towel and let drain.Step 4Whisk together lemon zest, coconut milk, oil, pepper, nutmeg, and remaining 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt in a baking dish just large enough to fit brussels sprouts.Step 5Add brussels sprouts to baking dish and gently toss to coat. Scatter breadcrumbs over and bake, uncovered, until top is golden and coconut milk has thickened slightly, 30–35 minutes. Let cool 10 minutes before serving.How would you rate Coconut Brussels Sprouts Gratin?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleMy new favorite way to eat Brussels sprouts.  Easy and tasty recipe.  Also vegan.  MonaNew York11/19/2021Honestly, if you don’t like brussels sprouts, this will appeal to you. On the other hand, if you’re fond of the vegetable already, you may be disappointed with how of the flavor of the sprouts takes a back seat in this recipe.K. DavieRockland, ME11/26/2020This recipe is ok as a side, but it's very bland as written and doesn't stand on its own. I would recommend increasing the amount of spices added, using cheese if non vegan, or finding some other ways to add additional flavor.Anonymous11/26/2020Used larger bread crumbs from the store and had to cook an extra few minutes to get golden brown crisp on top, but came out great!! 10/10 would make again and so easy and didn't really taste too coconutty! Really make sure the brussels are boiled and blanched well or else they'll be undercooked in the end! Non-vegans - I'd add pancetta and shaved parmesan! Emma GLondon11/25/2020Explore Bon AppétitCasseroleGratinBrussels SproutVegetableCoconut MilkOther IngredientsFallEasySideVeganVegetarianDairy-FreeHealthyishThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-23", "author": ["Condé Nast", "Brigid Washington"]}