{"id": "39af01c27c6c04c0feee2ea9ee307360", "url": "https://www.bonappetit.com/story/sonia-ripe-figs-cookbook", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "The Cookbook Sonia Chopra Keeps Going Back To | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Cookbook I Keep Coming Back ToI can’t get enough of Yasmin Khan’s Ripe Figs.By Sonia ChopraMay 20, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.This week I interviewed cookbook author Yasmin Khan, whose recipes grace the cover of our May issue. Her newest book, Ripe Figs, is out this month and paints a compassionate and beautiful story about communities across the Eastern Mediterranean—in Turkey, Cyprus, and Greece—and the foods they cooked.This book is so special, in part thanks to the short travel essays Khan writes, which evoke the beauty and bounty of the region but also talk about important social and community work, like the Greek women’s network Melissa in Athens, and community center One Happy Family in Lesbos. I love that she introduces these organizations and the people she meets and cooks with in these essays, and then those same names pop up in headnotes for recipes throughout the book.This Halloumi saganaki recipe from Ripe Figs is on bonappetit.com now.Photo by Alex LauIn the grid below, find a few great recipes from Ripe Figs, which Khan tied together with an essay about climate migration (subscribe for future issues here). If you’re curious, Khan also shared last night that her favorite kitchen tool is the Microplane (what isn’t improved by a little zesting!) and the ingredient she thinks is most underappreciated in American kitchens is dried mint, which Yasmin writes about here for Epicurious.And I’m curious: What’s the last cookbook you read from cover to cover? Are there any upcoming ones you’re excited to get? Let me know; I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorCultureBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-20", "author": ["Condé Nast", "Sonia Chopra"]}