{"id": "39bdd6781a38ca1b7c8dfcb3e71900d3", "url": "https://www.bonappetit.com/story/marinated-lentils-are-saving-my-vegetarian-protein-craving-soul", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Marinated Lentils Are Saving My Vegetarian, Protein-Craving Soul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMarinated Lentils Are Saving My Vegetarian, Protein-Craving SoulWhen my dinner ends up looking like a collection of what other people might call sides, I make these lentils.By Sarah JampelJanuary 30, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.As a vegetarian, I’m constantly on the lookout for easy, protein-rich accompaniments that will lend a semblance of balance to my meals and, most importantly, ward off hunger for a reasonable amount of time.On the most desperate nights, that’s a spoonful of peanut butter or exactly seven almonds (OMG, remember the good times???). But on the best nights—and when I’ve done even minimal meal prep over the weekend—it’s a mound of marinated lentils. “Marinated lentils” is just a fancy term for cooked lentils (beluga or Le Puy) tossed with olive oil that’s been infused with all sorts of delicious spices, aromatics, seeds, and hard herbs (rosemary, sage, thyme). Claire Saffitz’s recipe takes a minimal approach—heat oil with coriander and cumin seeds for a minute—whereas Alison Roman’s Spiced Lentils with Spring Onions in Dining In pull out all the stops: The oil is heated on low for 20 to 25 minutes with coriander, fennel, and cumin seeds, red pepper flakes, and sliced garlic; strips of lemon peel and scallions or spring onions are added for the last 5 minutes. You can vary the oil infusion—as spicy or herby or lemony or garlicky or seedy—as you’d like.Marinated lentils are better than regular old boiled lentils because they, uh, taste better. (And they’re better than marinated dried beans because they cook so much faster.) I understand and abide by the concept of adding a halved onion and a couple bay leaves to the lentil cooking liquid, but it never seems to impart enough (if any) flavor. Oil, on the other hand, is a much more effective flavor-carrier: Even a couple tablespoons of infused oil will transform lentils into something I'm ready to spoon directly into my mouth, no enhancements necessary. Marinating lentils doesn't take any additional time: Just heat the oil as the lentils cook, then toss the two together, and eat. If you have any leftovers, that's even better: Let the lentils hang out in any extra oil and they'll get even better in the fridge over the next few days.So when my dinner ends up looking like a collection of what other people might call sides, I make these lentils. They’re as good on their own as they are tossed into a leafy salad, nestled onto a sweet potato, or mixed into cook grains with herbs and cheese. The added fat from the infused oil makes the lentils rich and luxurious and improves anything plain-ish that you toss with them. If I’m really on my game, I’ll double the spiced oil and keep it in a jar in the fridge, turning to it whenever I’m sautéing greens, frying eggs, roasting broccoli or squash or cherry tomatoes, stirring together a lemony yogurt sauce, or making a vinaigrette.Now I'm really meal-planning.Make these lentils tonight:Marinated Lentils with Crunchy VegetablesView RecipeExplore Bon AppétitHealthyishLentilVegetarianThe Not Depressing VegetarianRead MoreLifestyleBlack Lentils Are the Best Lentil for Meal Prep, PeriodBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-30", "author": ["Condé Nast", "Sarah Jampel"]}