{"id": "39be1398200f8472401f92ec6a57d0fd", "url": "https://www.bonappetit.com/story/how-grocery-shopping-changed", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "How Has Your Grocery Shopping Changed? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Has Your Grocery Shopping Changed?Everything is different this year.By Sonia ChopraDecember 9, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by D'mytrek BrownFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Here’s a fun thing about my job: Every so often, I get to test recipes before they go live on our websites or into the pages of the magazine. It’s standard practice at publications like Bon Appétit and Epicurious to have multiple editors cook through recipes before they are published to make sure they will work for, well, people like me: cooking enthusiasts who are not necessarily trained kitchen experts.The first time I volunteered, I was totally in my head about it, afraid I didn’t have the chops to be useful and that I was wasting our food team’s time. But now I like to take on a recipe once a month or so, especially when it sounds particularly delicious (most do!) or will push me to try something new. For example, I don’t fry a lot of things at home, so it was fun to test these leek latkes from our holiday issue—though my first batch somehow took me twice as long as it should have, confusing both me and the editor—and it was even more fun to eat the leftovers with fried eggs for breakfast the next day.Want this letter before it hits the website? Sign up for our newsletter!Anyway, as I test new recipes this week, I’ve really been thinking about access to ingredients. I used to be able to take a train five stops to get fresh curry leaves or a specific kind of green chile, and now, more often than not, I’m finding a substitution or ordering them online. I’m aware of the privilege I started with—to have lived in such close proximity to specialty grocery stores in the first place, to be able to order what I’m looking for online and pay to get it delivered—and this pandemic is definitely making me more conscious of what I am buying and how I will use it all. Like when I inevitably make this pumpkin-tahini mousse pie, I will use leftover pumpkin for this spiced chocolate-pumpkin cake and leftover tahini in swirly loaf cakes and brownies.Tahini + chocolate = winning combo.\nPhoto by Alex Lau, Styling by Sue LiI’m curious to hear how you go about deciding whether or not to buy an ingredient you haven’t cooked with before when you see it in a recipe. Will you always do it if you can find it in your local grocery store? Will you only do it if you know you won’t have half a jar left? Are you game to try anything that sounds intriguing? And as I think about our ingredients, it’s difficult not to also think about what’s happening in India, where farmers are protesting agriculture bills, marching to Delhi and burning fields to fight for a fair market (Oakland-based spice company Diaspora Co., which works with independent farms across India, has a good primer). Or here in the US, where restaurants were forced to adapt fast to pandemic realities and started selling and delivering groceries—scrambling to make money without clarity or support—and where a new report says a staggering 17 percent of restaurants have now closed and 58 percent expect continued layoffs or furloughs for the next three months. This is a devastating time for our industry, and its impacts will be far-reaching and continue to affect us—the diners and consumers—as well as workers across the world. I’m committing to support independent food businesses wherever I can and would also love to hear about the products and organizations you love and are supporting this year. As always, I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-10", "author": ["Condé Nast", "Sonia Chopra"]}