{"id": "39e163a9e3512f851c34eaea277e136b", "url": "https://www.bonappetit.com/recipe/healthyish-chicken-salad", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Healthy Chicken Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHealthyish Chicken SaladBy Christina ChaeyMay 23, 20204.7(48)Read ReviewsTriangleEmailPinterestPrintPHOTO BY LAURA MURRAY, FOOD STYLING BY SUSIE THEODOROUEmailPinterestPrintEmailPinterestPrintThis is the summery chicken salad you could eat plate after plate of without feeling like you’ve downed a jar of mayonnaise—because you didn't! Tender poached chicken breast, crisp greens, cukes, and scallions get tossed with a gomae-inspired dressing, with pops of crunch from sesame seeds and the creamy nuttiness of tahini in every bite.Ingredients2–4 servings2skinless, boneless chicken breasts (1–1½ lb. total)3Tbsp. kosher salt, plus more3scallions, thinly sliced on a deep diagonal3Persian cucumbers½cup toasted sesame seeds, divided2Tbsp. fresh lime juice2Tbsp. tahini1Tbsp. soy sauce1tsp. honey¼tsp. crushed red pepper flakes¼head of romaine or green or red leaf lettuce or 1 head of Little Gem lettuceBig handful of cilantro leaves with tender stems½lime (for serving)PreparationStep 1Bring chicken, 3 Tbsp. kosher salt, and 5 cups water to a bare simmer in a medium pot over medium heat (chicken should be submerged). Be patient—this will take a little while. Once liquid begins to simmer, reduce heat to low and cook (water should not be simmering at all now) until juices run clear when thickest part of chicken is pierced, 8–10 minutes. Transfer chicken to a medium bowl; discard poaching liquid. Let chicken cool slightly, then shred meat into big pieces; set aside.Step 2Meanwhile, place scallions in a small bowl and pour in very cold water to cover; let soak 10 minutes. Drain scallions in a mesh sieve or colander, then rinse under cold running water, swishing vigorously to encourage them to curl up and to rinse off any scallion slime (ew). Shake off as much water as possible and place in a large bowl; set aside.Step 3Working one at a time, slice cucumbers in half crosswise, then slice each piece in half lengthwise. Place quarters cut side down and slice in half lengthwise again to create 8 pieces total per cucumber. Add to bowl with reserved chicken.Step 4Set 1 Tbsp. sesame seeds aside in a small bowl for serving. Crush remaining sesame seeds in a mortar and pestle until some of the seeds have turned to powder, but with plenty of whole seeds left. (Alternatively, if you’d rather spare yourself the elbow grease, pulse seeds a few times in a food processor or spice mill, then transfer to a medium bowl before proceeding). Add lime juice, tahini, soy sauce, honey, and red pepper flakes and mash to create a paste. Add ¼ cup water and whisk to combine (if you don’t have a small enough whisk, work in with the pestle). Taste and season with salt.Step 5Add lettuce and cilantro to bowl with reserved scallions. Pour half of dressing over greens and toss to coat. Arrange on a platter. Pour remaining dressing over chicken and cucumbers, toss to coat, and arrange over greens. Top salad with reserved 1 Tbsp. sesame seeds and squeeze juice from lime half over.How would you rate Healthyish Chicken Salad?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleWe aren’t the biggest fans of salads and were a little skeptical before making this recipe…\nBut wow! It was super yummy! And soo easy to make. Would recommend 100% TalaZurich3/20/2022I very much enjoyed this salad and for once my chicken was not dried out. I skipped the sesame seed step and adding them at the end and on top. I used arugula, pea greens, roasted beets, asparagus and almonds. I added pomegranate seeds on top and fresh basil since I just got two bunches from the Farmers Market. The chicken in the tahini mixture was very tasty and that says a lot because I do not care for chicken and may only eat it a couple times a year.ParisEdenLos Angeles 10/11/2021This recipe is amazing!! Something magical happens with the sauce between the salty soy and slightly bitter and creamy tahini. Such a rewarding and healthy summer entree that I have made more than once! I recommend making more of the sauce because it is THAT good!SophiaBoston, MA8/3/2021This was so easy.  Excellent flavor I did not have to change a thing.  I poached the chicken breasts a bit long so they were drier than I would have liked but it was still great.  I am going. to try it again this week using a rotisserie chicken from the grocery store just to see if I can make this even easier.  Strongly recommend this dishAnonymousNew Hampshire7/18/2021Wonderful recipe with beautiful layered flavors. The red pepper flakes added just the right amount of heat. I paired with with shredded grilled salmon and because I lacked sesame seeds,  substituted with toasted slivered almonds.  This one is a keeper!AnonymousSonoma, CA7/7/2021Really delightful and easy. When I make this again in the future, will opt for a no-cook solution by buying a rotisserie chicken and using the breasts from that. Currently storing the chicken and cuke mix, dressed, in one container and the salad mix, undressed, in another for easy summer lunches. I added fresh sliced jalapeño to the salad, and used a mix of gochugaru and crushed red pepper in the dressing. AnonymousWashington, DC6/13/2021I made the recipe exactly as written and it was good. I also liked it with the addition of tarragon and fish sauce, along with cilantro and olive oil drizzle to garnish. AnonymousSan Francisco9/16/2020I thought the recipe was a bit bland as written but I added a clove of garlic, a 1/2 tablespoon of fish sauce and a bit on minced ginger to the dressing and it was spectacular. AnonymousBrooklyn, NY9/1/2020Delicious salad - added some ginger and garlic to the poaching liquid and didn't blitz the sesame seeds but did everything else per the recipe and it was delicious! Definitely going to make this again.Anonymous8/10/2020This is such a yummy salad. I don't own a mortar and pestle so just mixed all the dressing ingredients together without using that tool, and it was perfect! I also added avo just cuz. The best upgrade to my WFH quarantine lunches. AnonymousLos Angeles8/5/2020This was easy and delicious! Didn't make any substitutions and thought it was great.AnonymousChicago8/4/2020This was our second salad for the week. The dressing was good. Had chicken breast on the bone so I poached that. This reminded me of another salad recipe. Very similar dressing but with miso.mmoriciJersey City, NJ7/31/2020Light, unique, and delicious! Made this exactly as-is except I used Tofurkey Seasoned Chicken pieces instead of meat and I omitted the pepper flakes from the dressing and added a chopped fresh jalapeño to the salad instead. MelodieRColorado7/25/2020This was great!! So light and fresh. I made it with half a rotisserie chicken to save time and used about 1/3 of the recommended sesame seeds - it was still great. Anonymous7/10/2020This was another home run for BA. We didn't have cucumbers...we subbed green squash and it still tasted great. The tahini rounded out the recipe by adding lightness and the cilantro made this a favorite for us. We will def make it again. ErikarenataSan Antonio, TX7/1/2020Explore Bon AppétitSaladChickenPoultryChicken BreastCucumberVegetableTahiniCondiments, Sauces & PastesLettuceLeafy GreensSummerEasyMainDairy-FreeKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-23", "author": ["Condé Nast", "Christina Chaey"]}