{"id": "3a04a34976ae3ca73868c096b7bead02", "url": "https://www.bonappetit.com/story/fruit-tart-recipe", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "This Fruit Tart Recipe Is Going Through Its Blue Period, Like Picasso | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Fruit Tart Is Going Through Its Blue Period, Like PicassoBlueberries, blackberries, custard, and an almond press-in crust. A new recipe to make all summer, or hang in MoMA.By Alex BeggsJune 8, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailI recently read this popular article about finding happiness (normal place to look for happiness) and I can’t stop thinking about how custard is an important part of the process. Make gratitude lists, take personality quizzes, meditate, spend time with people you love, eat custard. Yale students pay for this kind of info and yet here it is, on a random blog post! I have all the answers, and yet no one’s asking me the questions.In this new recipe for a summer berry fruit tart, Chris Morocco kept things simple. The crust is a press-in almond flour and butter combo, which is baked until deeply golden and has this toasted, nutty, expensive flavor. (Or maybe I just taste “expensive” when I’ve seen the price of the almond flour bag. Why do I love the finer things in life?! I blame MTV.) You can also make it with AP flour, FYI. The custard is your straightforward mixture of eggs, whole milk, sugar, vanilla, and cornstarch. You can even make that days ahead and accidentally eat it all and forget about the whole thing, lost in your custard coma. Or you can chill it, and add it to the cooled crust, top with berries, and impress all of your friends and countrymen. Choice is yours!A note on the berries:Yes, Chris is going through his Blue Period. How pretty is the blueberry-blackberry confluence here? Very! However, say strawberries are in season for you and you’d rather do a red theme, fine, but add the cut fruit right before serving, otherwise you risk this horror (not really) I call “puddling.” That’s when a fruit with a high water content (strawberries, pineapple), when cut, leaks a little on the custard and the whole thing sits around, looking like someone sobbed over it. So, uh, yeah, blueberries! Blackberries! Raspberries! Keep it fresh.Get the recipe:Fresh Fruit Tart with Almond Press-In CrustA delicious almond crust is the perfect complement to this beautiful, summery berry tart.View RecipeMore simple summer tart inspo:Explore Bon AppétitDessertSummer DessertsCustardAlmond FlourBlackberryBlueberryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Alex Beggs"]}