{"id": "3a1238b42ab219220a5d3d81209a5e4e", "url": "https://www.bonappetit.com/story/steamed-fish", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "The Steam Fish Recipe I Make When I’m Feeling Lazy but Craving Healthy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Steamed Fish Recipe I Make When I’m Feeling Lazy but Craving HealthyIt’s like your fish had a spa day and returned luxuriously silky and perfectly cooked and ready for you to eat.By Christina ChaeyMarch 8, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailI am extremely particular about the way I like to cook my fish. I love a crispy-skinned fillet cooked in a skillet, but it inevitably splatters oil everywhere and is, well, a little stanky. And although I get that “slow-roasted salmon” is a misnomer since it takes 30 minutes at most, I have an oven that preheats at a glacial pace, and I am not trying to spend an hour cooking fish for one. Which is why, when I crave marine life, nine times out of 10, I’ll steam it.This is not news to my friends, who are extremely used to making fun of me for how much I love to steam any and all foods. This recipe for Soy and Ginger Steamed Fish is loosely inspired by one of my all-time favorite fish dishes: a classic Cantonese whole steamed fish with scallions, ginger, and soy. The addition of mushrooms and Napa cabbage makes this pot o’ fish satisfying, warming, and light. I like to serve it with steamed white rice, which you can get going before you start preparing the fish.There are several things I love about this recipe: It takes 20 minutes to prep and cook from start to finish; you can make it without a steamer basket, as the Napa cabbage acts as a buffer between the fish and the bottom of the pot; and you can use whatever fish you want—it’s equally good with salmon or snapper as it is with splurge-y black bass. I’m also trying to figure out how to be a more conscious consumer of seafood, and simple recipes like this are a good reminder that flavor really does start with quality, as steaming brings out the incredible taste of good, fresh fish.Steaming as a technique might not get a lot of love, especially when it comes to cooking proteins—but it creates the ideal gentle sauna environment for perfectly flaky and never dry fish—not to mention succulent chicken (yes, even breasts!). If you’re not convinced yet, make this fish and get back to me. I guarantee you’ll go full steam ahead.Get the recipe!Soy and Ginger Steamed FishYou can use this foolproof steaming method to cook any sturdy fish—salmon, snapper, black cod, or arctic char would all be great.View RecipeExplore Bon AppétitHealthyishFishBassGingerSakeSoy SauceWeeknightRead MoreLifestyleThe Best Sweet Potatoes are Steamed, and I Don't Want to Hear About ItBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-08", "author": ["Condé Nast", "Christina Chaey"]}