{"id": "3a17d7b8781a111f355649a75654e35e", "url": "https://www.bonappetit.com/story/best-springform-pan", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "With the Best Springform Pan, Perfect Cheesecake Is Always Within Reach | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWith the Best Springform Pan, Perfect Cheesecake Is Always Within ReachFat Daddio’s nonstick springform pan won’t stick, leak, or overflow.By Erin McDowellJanuary 25, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I own dozens of cake pans of all kinds, but when it comes to springform pans, my heart is loyal. The best springform pan is made by Fat Daddio’s, and if you love to bake, you need one (or, in my case, four). I own these pans in a few different sizes—6-inch, 12-inch—but a standard 9-inch pan is the perfect choice for most springform recipes at home.Fat Daddio’s Springform Cake Pan$17 at AmazonWhy is this the best springform pan?There’s a lot to love about this pan, but two facets of its brilliant design stand out. Like all springform pans, it is made of two parts: the base and an outer ring. In many other designs, there’s a raised lip around the base that fits into a notch in the outer ring. This notch can make the cake hard to remove from the pan onto a cake stand and will often leave a visible divot on the side of the baked good after unmolding. But the design of the Fat Daddio’s removable bottom is inverted: The rim is lower than the bottom of the pan, which is raised—it looks like a mesa—and that the outer ring wraps around the raised middle section, leaving a lip around the edge. When the pieces are combined, the springform pan looks like a top hat. This makes for easy unmolding because it’s a cinch to slide a spatula under your cheesecake—something I’ve always found incredibly tricky on most springform pans because of that little lip. It also ensures beautiful, impressively straight sides that are augmented by the pan’s height—my second favorite feature. I think it has the perfect depth for a springform pan (and many other pans fall short…literally). At 3 inches deep, you’ll never experience overflow, even with your tallest, most impressive bakes.There are still more reasons why the Fat Daddio’s 9-inch nonstick springform pan is my top pick. The heavy-duty, stainless-steel, spring-lock buckle on the outer ring is the sturdiest I’ve tried. It’s still operating with the same strength and snap as the day I purchased it, with many bakes and washes behind it. It seals tightly (no leakage!) even when working with thin batter or a water bath. It also hits a lot of baker buzzwords: It boasts a nonstick coating and is easy to care for (hand-washing is recommended). Plus, it’s made of restaurant-grade anodized aluminum, which means no warping. It may just be the well-loved springform cake pan you eventually pass down to your kids after years of baking together. And ringing in at just $20, this baking pan isn’t even a splurge.Watch the Fat Daddio’s springform pan in action.\nWhat else can I use a springform for?Yes, this is the perfect pan for baking cheesecakes—classic, Basque, and beyond. But it’s also the perfect bakeware for all kinds of other cakes. Springform pans are great when you’re making a taller/deeper single layer cake, like this rustic fruit-studded cornmeal number. They’re also handy for more delicate bakes, like chiffon or flourless chocolate cakes, because there’s no flipping required. The easy release base and nonstick surface make it ideal for smoothly unmolding upside-down cakes, and it also works well for ice cream cakes and other frozen desserts. Personally, I love it for savory dishes like deep-dish pizzas, baked pasta casseroles, and tall, impressive tarts and quiches. Fat Daddio’s even says that this pan is pressure cooker and air-fryer safe, so the sky is truly the limit here. (Yes, air-fryer cheesecake is a thing.)Ricotta Pie with Amarena CherriesOkay, this is actually a cheesecake, but it’s so creamy and light that you won’t care what it’s called, you’ll just ask for more. View RecipeHow do I care for my springform pan?With any springform pan, the most important thing is to be sure to dry it very well after washing. Keeping the pan dry will keep the steel construction of the spring rust-free and working its sprightly best. Avoid using metal utensils whenever possible to keep any nonstick springform pan smooth and unscratched.Are there other worthy springform pans out there?Absolutely! The only negative about the Fat Daddio’s pan in my book is that it is a little bulkier than a standard cheesecake pan because of the height and wider base. If you’re looking for a solid option that will also take up a little less cabinet space, find a few favorites below:This bright red 9-inch springform pan comes from another reliable cookware brand, Nordic Ware. This pan isn’t just snazzy looking, it is made from high-quality aluminum, is freezer-safe, and even comes with a 10-year warranty. It’s not dishwasher-safe, so hand-washing is recommended if you want to keep it looking its best.Nordic Ware 9-Inch Springform Pan$20 at AmazonSilicone springform pans are prized for their nonstick ability, which can make unmolding even easier, and for their heat resistance—this one from Norpro is safe up to 450 degrees Fahrenheit. They are ideal for water-bath baking, but be sure you get one with a tight leakproof seal. These pans often boast glass bottoms so they can go directly from oven to table for service.Norpro Red Silicone Springform Pan$28 at AmazonWant more bang for your buck? This two-in-one springform pan set comes with two interchangeable bases: a flat base, like a classic springform, and a tube base—so you can make Bundt and angel food cakes in the same pan. This model from Ballarini comes in three different sizes and is nonstick, dishwasher-safe, and oven-safe up to 450°F.Ballarini Nonstick Two-in-One Springform Pan$20 at Food52Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-25", "author": ["Condé Nast", "Erin Mcdowell"]}