{"id": "3a1e7563088eabd97e26d913114433b3", "url": "https://www.bonappetit.com/recipe/paprika-shrimp-with-buttery-v8-sauce", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "Paprika Shrimp with Buttery V8 Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredPaprika Shrimp with Buttery V8® SauceThis Recipe is Guaranteed to Spice Up Your Summer. Sponsored by V8®.June 15, 20213.6(34)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredients3Tbsp. Extra-virgin olive oil, plus more for drizzling4garlic cloves, thinly sliced1¼lb. large shrimp, peeled, deveined, preferably tails left on1tsp. paprika½tsp. mild red pepper flakes (such as Maras, Urfa, or Aleppo-style), plus more for servingpinch of Kosher salt⅓cup of V8 Original 100% Vegetable Juice2Tbsp. unsalted butter½lemon½cup coarsely chopped parsleyPreparationStep 1Combine 3 Tbsp. oil and garlic in a large skillet. Set over medium heat and cook, tossing occasionally, until garlic has softened but has not taken on any color, 2–3 minutes.Step 2Add shrimp, paprika, and red pepper flakes, and increase heat to medium-high. Season lightly with salt and cook, tossing often, until shrimp is almost cooked through, about 2 minutes.Step 3Add V8 Original 100% Vegetable Juice and butter and cook, still tossing, until reduced by half and you have a silky red sauce, about 2 minutes.Step 4Remove skillet from heat. Finely grate zest from lemon half over shrimp, then squeeze in about 1 tbsp. lemon juice. Scatter parsley and toss once more.Step 5Transfer shrimp to a platter and drizzle with plenty of oil.Step 6Serve with thick slices of crusty bread.How would you rate Paprika Shrimp with Buttery V8® Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleWhy don't you just use the spicy V8???bejay1/13/2022Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-15", "author": ["Condé Nast"]}