{"id": "3a8f225b80391f215278ea4c2e5fbc71", "url": "https://www.bonappetit.com/city-guides/montreal/venue/agrikol", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Agrikol Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealAgrikolIn the Gay Village, a rum-fueled oasis run by Arcade FireFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for breezy Caribbean vibes and strong rum cocktails. Bonus: You can rub elbows with hip Montrealers (members of Arcade Fire own Agrikol) .ORDER THE: Ti punch, a French-Caribbean drink made from Barbancourt rum, lime juice, and freshly pressed cane sugar syrup, all served separately for assembly at the table (with the option of ordering a quarter, half, or full bottle of booze). If you really want to transport yourself to the Caribbean, order the slushie-like Kokonut cocktail and any of the classic dishes, like jerk chicken, whole fried fish, and griot (fried pork cubes).THE VIBE IS: island cool, with steel drums on the speakers and a two-story mural by Haitian-born artist (and former part-owner) Roland Jean. The restaurant occupies the ground level of this small house, so go up the big staircase for the bar, overflowing with shelves of rum bottles and moody vibes.PRACTICAL STUFF: Open every day 6 p.m. to midnight. No reservations except for large groups.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVELe MoussoSplurge a little on this innovative tasting-menu-powered restaurant in the Gay VillageDieu du CielChoose your own microbrew adventure in Mile EndLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}