{"id": "3a9cbca12fae3bec520e56912b332f23", "url": "https://www.bonappetit.com/story/rangoon-brooklyn-mohinga", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Everything That Goes Into a Hot, Luscious Bowl of Mohinga at Brooklyn’s Rangoon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEverything That Goes Into a Hot, Luscious Bowl of Mohinga at Brooklyn’s RangoonChef-owner Myo Moe introduces diners to the flavors of her Burmese childhood, starting with one iconic comfort dish.By Hilary CadiganOctober 26, 2020FacebookTwitterEmailPhoto by Jessica PettwayFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.In Rangoon, Burma (also known as Yangon, Myanmar—it’s complicated), mohinga is breakfast. “Every morning, street vendors serve it out of steamy pots as big as bathtubs,” says Myo Moe. “People stop by on their way to work or school, or visit the local mohinga stall for early lunch—it’s always packed.” At Rangoon the restaurant, however, the lemongrass-laced fish and rice noodle soup is dinner, served alongside a host of other Burmese classics like lahpet thoke (tea leaf salad) and wett thar hinn (sweet and tangy braised pork). “At first, I worried that mohinga would be too fishy for people who had never tried Burmese food,” Moe says, “but it’s turned out to be the best seller!”An elegant yet cozy little spot on the border of Crown Heights and Park Slope, Rangoon had the rough luck of making its debut just a few weeks before COVID-19 shut down everything. Born out of Rangoon Noodle Lab, a Bushwick pop-up that Moe and her husband, Daniel Bendjy, started in 2015, it’s now one of the only Burmese eateries in all of New York City.Though she’s a formally trained chef who has worked in restaurants from Hawaii to Colorado, Moe learned most of what she knows about the cuisine of her home country from her mother, a health care worker who spent most of her free moments cooking with her daughters. “There was a lot of political strife in Burma in the ’80s and ’90s,” she recalls, “so when I was a teenager, my family moved from Rangoon to the West Indies and then later to Queens, where my mom still lives.”For Moe, Rangoon the restaurant is a return to her roots—and a way of introducing American diners to a surprisingly underrepresented food culture. “I started this restaurant because I want people to enjoy Burmese food like how we would serve it at home,” she says. Here, she breaks down all the components of her best-selling dish.The BrothThe backbone of mohinga is its labor-intensive broth, and Moe cooks up a fresh 16-quart batch daily. Catfish fillets boil for two hours in a blend of water, ginger, onion, lemongrass, turmeric, and fish sauce, which, once thickened with toasted rice flour, forms a velvety texture. Then she removes the fish, smashes it by hand into a paste, sautés it till it’s dry and toasty, and adds it back into the broth for maximum fishy flavor.The NoodlesMoe would love to make all her noodles by hand like she used to back home, but the process is too time-consuming to juggle with running a restaurant. Instead, she buys extra-thin dried Vietnamese rice noodles—Bamboo Tree is her brand of choice. “In Burma we don’t like our noodles to be chewy at all,” she says. “We like them soft and a little sticky.” To achieve this perfect texture, the noodles are cooked separately and topped with a ladleful of soup just before serving.The Lotus RootA serious crunch-factor is needed to offset the softness of the noodles and broth, and traditionally that would mean slices of banana stem, the fibrous flower stalks of a banana plant. But despite the prevalence of the fruits they bear, finding the stems themselves isn’t easy in New York. So Moe uses lotus root instead, boiled and sliced thin: “It soaks up the flavor and color of the soup, brings a little added sweetness, and it’s pretty!”The Shallot FritterEvery bowl of mohinga needs its deep-fried crown. “At the stalls in Burma, there are always a variety of fritters to choose from,” says Moe. “Since I was a child I’ve always chosen the shallot ones. The sweetness and crunch pair so well with the mohinga’s rich broth.” She supersizes her fritters for dramatic effect, perching one on the edge of each bowl like a crispy, lacy doily. The batter is made from chickpea flour, a gluten-free Burmese staple.The ToppingsMoe always serves the soup along with ramekins filled with lime wedges, fish sauce, and toasted chile flakes. This is the classic trio of toppings you’d find on the table at any mohinga stall in Burma, and you’re supposed to use all three, adjusting the ratios to your exact liking. “We call these components chin ngn satt—which means ‘sour, salty, spicy,’” she says. “The combination is the key to Burmese flavor. We love it!”Explore Bon AppétitRestaurantsChefsNew York CityDish DecodedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-26", "author": ["Condé Nast", "Hilary Cadigan"]}