{"id": "3a9d8236d2a48f376ca29b0570c16a17", "url": "https://www.bonappetit.com/story/dinner-party-ceramics", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "7 Ceramic Dinnerware Sets That Will Make You Feel Fancy As Hell | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Ceramic Dinnerware Sets That Will Make You Feel Fancy As HellThey’re so chic your guests will forgive the serving snafus.By MacKenzie Chung FeganOctober 14, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This story is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.You’re hosting a dinner party, and you are ready. The dining table is set. Your linen napkins complement your tortoiseshell Sabre flatware perfectly. Your new stackable wine glasses have banished those permanently smudged old mason jars from the table. You bought flowers, and they are not carnations. The only problem? You don’t have enough plates to go around. Maybe no one will notice that you’re eating roast chicken from a bowl?Maybe it’s time to upgrade your tableware. I’m not saying you should go out and purchase a 96-piece dinnerware set (Does anyone need 12 teacups? What even is a “fruit saucer?”), but matching dinner plates, salad or dessert plates, and shallow bowls do go a long way toward making your table setting feel cohesive. Below, you’ll find our favorite ceramic dinnerware sets—the ones we use at home, secretly want to pilfer from the BA Test Kitchen, and spend hours gawking at on Instagram. Many are hand-thrown on a wheel by an actual person, and all are not only dishwasher- and microwave-safe but will also make your dinner party guests marvel at your togetherness—even if you overcooked the chicken.East ForkBack when desks and office lunches were a thing, we all coveted senior food editor Christina Chaey’s perfect East Fork Everyday Bowl, which she kept on hand for grainy salads and brothy noodles. You can purchase it solo or save 10% and snag the whole 5-piece Shallow Dinner Set, which also includes a breakfast bowl, a dinner plate, a side plate, and a cake plate. May I recommend the very ’70s Harvest Moon colorway?We also love the dedication East Fork shows to giving back to its community: Each quarter it fundraises for a different North Carolina–based nonprofit, organization, or individual. Send East Fork a screenshot of your donation receipt, and it’ll grant you access to its seconds site, where you can find slightly imperfect pieces at 20% off retail.The Everyday Bowl$40 at East Fork5-Piece Shallow Dinner Set$162 $146 at East ForkOur PlaceHere you’ll find dinner plates, side plates, and bowls in chic neutral hues that you can, of course, color coordinate with your Always Pan and/or nails. They’re made of porcelain, an especially durable type of ceramic that is fired at high temperatures, and the gloss finish over a matte base creates a sleek two-tone effect. The plates feature a little lip so your saucy spiced cod with corn does not runneth over, and the bowls are cylindrical and stackable.Main Plates (4-Pack)$50 at Our PlaceSide Plates (4-Pack)$40 at Our PlaceSide Bowls (4-Pack)$45 at Our PlaceJono PandolfiCeramist-to-the-culinary stars Jono Pandolfi crafts pieces for restaurants like Jean-Georges and Missy Robbins’ Lilia, and test kitchen director Chris Morocco credits the “Pandolfi magic” with transforming even his most half-assed lunches into something Instagram-worthy. Chris favors the Coupe Place Setting, which comes with an entrée plate, a salad plate, a cereal bowl, and the fan favorite Alaska bowl, which was originally designed for Eleven Madison Park’s dessert course.Coupe 4-Piece Place Setting$150 at Jono Pandolfi8.5\" Coupe Alaska Bowl$48 at Jono PandolfiFelt + FatThese minimalist porcelain plates and bowls put the attention right where it should be: on your beef Wellington that came out a little weird lookin’ but still tasted great. We carry Felt + Fat’s dinner plates, salad plates, and soup bowls in the Bon Appétit Market, as well as this petite planter that looks like a vanilla birthday cake covered in monochrome Nerds. The Pigeon colorway features a semimatte satin finish, but if slight silverware marks drive you nuts, get the glossy Milk glaze instead.Felt+Fat Dinner Plate$55 at Bon Appétit MarketFelt+Fat Soup Bowl$36 at Bon Appétit MarketSoil BakerYou can pluck gim bugak off Hye Rin Yang’s bowls and dishes at Atoboy in New York, or you can grab your own set from her exclusive collaboration with DTC cookware company Material. I’m especially fond of the shallow Open Bowl in Grotto, a dramatic dark glaze that shimmers like the night sky. Complete your dinner set with a full plate, half plate, and round bowl. Material x Soil Baker’s ceramics are lighter and more delicate than, say, East Fork’s or Heath’s heftier pieces, but they’re still durable enough for everyday use.The Open Bowl (2-Pack)$80 at Material KitchenThe Half Plate (2-Pack)$60 at Material KitchenHaandHaand’s porcelain dinnerware sets are a little swervier than some of the options on this list—the edges of its dessert plates and salad bowls are quirkily uneven with glazes in colors like sea-foam green and mottled copper. I have a couple of Haand’s large serving platters (bought during one of its very good seconds sales) which, when not holding a whole fish, double as a tray for candles and other tabletop paraphernalia. Its 3-Piece Ripple Dinner Setting comes with a dinner plate, a salad plate, and a pasta bowl. Otherwise, put on your big-boy pants and spring for the 5-Piece Skali Coupe Dinner Setting, which includes three different sizes of coupes—which are kind of bowl-like plates—a breakfast bowl, and a Chemist Cup perfect for a midafternoon pistachio snack.3-Piece Ripple Dinner Setting$114 $95 at Haand5-Piece Skali Coupe Dinner Setting$163.50 $135 at HaandHeathHeath is a classy broad and always will be. Edith Heath launched her best-selling Coupe ceramic dinnerware in 1948, and it arguably (by me, I am arguing this) cannot be improved upon. You’ll find Heath’s dish sets at restaurants like Chez Panisse and its sustainable tiles in the home of Maggie Gyllenhaal and Peter Sarsgaard (which I know because of this jaw-dropping house tour). Heath’s three-piece Basic Ceramic Dinnerware Set features a dinner plate, a salad plate, and a cereal bowl, and you can mix and match different glazes, including the exceptionally named Yuzu Fawn colorway.Varda Basic Dinnerware Set$107 at Heath CeramicsExtra credit: Make your own ceramic dinnerwareExplore Bon AppétitDinner PartiesPartiesCultureLifestyleShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}