{"id": "3a9ee6a5ced6cd27a749bf799a7dae40", "url": "https://www.bonappetit.com/recipe/big-shells-with-spicy-lamb-sausage-and-pistachios", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Big Shells With Spicy Lamb Sausage and Pistachios Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueBig Shells With Spicy Lamb Sausage and PistachiosBy Andy BaraghaniMarch 15, 2022EmailPinterestPrintPhotograph by Graydon Herriott, food styling by Sue Li, prop styling by Aneta Florczyk.EmailPinterestPrintEmailPinterestPrintInspired by Andy Baraghani’s travels through Italy, this recipe melds jumbo shells with spiced lamb sausage and bracing broccoli rabe that tucks into every nook and cranny. “The bitter broccoli rabe cuts through the sausage party,” Baraghani says, “while raw—not toasted—pistachios bring a fresh buttery crunch.” Don’t expect bottom-of-the-bowl sauce here—in Italy, cooks use just enough sauce to perfectly coat the noodles.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonMicroplane Grater$16 At AmazonHeatproof Measuring Cup$18 At AmazonTongs$13 At AmazonIngredients4 servings1bunch broccoli rabe3Tbsp. extra-virgin olive oil1lb. spicy lamb or hot Italian pork sausage, casings removed12oz. jumbo shells or paccheriKosher salt4garlic cloves, thinly slicedFreshly ground black pepper4Tbsp. unsalted butter, cut into pieces1tsp. finely grated lemon zest2Tbsp. fresh lemon juice⅓cup coarsely chopped raw pistachiosFinely grated Parmesan (for serving)PreparationStep 1Trim thick stems from broccoli rabe and reserve for another use (like a stir-fry). Coarsely chop greens and remaining tender stems; set aside.Step 2Heat oil in a large Dutch oven or other heavy pot over medium-high. Using your hands, grab small clumps of sausage (you’re going for rustic meatballs about the size of a golf ball) and add to pot. Cook, turning each piece as it becomes crusty, until deeply golden brown all over, about 4 minutes. Using a slotted spoon, transfer sausage to a plate, leaving fat behind. Remove pot from heat and reserve. If sausage has given off a lot of fat, tip some of it into a bowl; you want about 2 Tbsp. left in the pot (save the rest for another use—like frying eggs).Step 3Meanwhile, cook pasta in a large pot of generously salted boiling water, stirring occasionally, until just shy of al dente, about 1 minute less than package directions (it’ll finish cooking in the sauce). Drain pasta, reserving 1½ cups pasta cooking liquid.Step 4Set reserved pot with fat over medium-low heat. Add garlic and cook, stirring and scraping up any browned bits, until softened slightly, about 2 minutes. Add reserved broccoli rabe, season with salt and pepper, and cook, stirring, until greens are wilted and bright green, about 4 minutes. Return sausage to pot along with any juices on the plate. Break up sausage into smaller but still coarse pieces with a wooden spoon.Step 5Add butter, pasta, and ¾ cup pasta cooking liquid to pot. Cook, tossing often and adding more pasta cooking liquid a tablespoon or two at a time if needed, until pasta is coated in sauce, about 3 minutes. Remove from heat, add lemon zest and lemon juice, and toss to coat.Step 6Divide pasta among bowls and top with pistachios and Parmesan.Excerpted with permission from ‘The Cook You Want to Be: Everyday Recipes to Impress’ Copyright © 2022 by Andy Baraghani. Published by Lorena Jones Books, an Imprint of Penguin Random House.\n\nBuy on Amazon or Bookshop.orgHow would you rate Big Shells With Spicy Lamb Sausage and Pistachios?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerMainEasyWeeknight MealsPastaPasta ShellsPasta & NoodlesSausageMeatLambBroccoli RabeVegetableItalianEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}