{"id": "3aa1a7929eb36499e5d931f787e7d026", "url": "https://www.bonappetit.com/recipe/sticky-barbecue-chicken", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Sticky Barbecue Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueSticky Barbecue ChickenBy Kurt EvansJune 2, 20204.5(29)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintKurt Evans, culinary director at Drive Change, marinates his chicken in advance to ensure it won’t dry out on the grill, then he bastes it with sauce at the end for the crackliest, stickiest skin. Evans’s homemade barbecue sauce contains just a touch of blackstrap molasses: a rich, dark flavor brought by African American migrants from the Deep South. They used to make it on their rural homesteads from homegrown sugarcane during the time of the Great Migration.Ingredients8–10 servingsBarbecue Seasoning¼cup smoked paprika2Tbsp. light brown sugar2tsp. chili powder2tsp. garlic powder1½tsp. cayenne pepperChicken and Assembly12skin-on, bone-in chicken thighs (about 4 lb.)Zest and juice of 2 lemons4tsp. Diamond Crystal or 2½ tsp. Morton kosher salt5Tbsp. Barbecue Seasoning, divided1Tbsp. vegetable oil, plus more for grill1small onion, finely chopped3garlic cloves, finely chopped2Tbsp. light brown sugar¾cup ketchup2Tbsp. apple cider vinegar2Tbsp. unsulfured blackstrap molasses1Tbsp. Dijon mustard1Tbsp. Louisiana hot sauce1Tbsp. Worcestershire saucePreparationBarbecue SeasoningStep 1Whisk paprika, brown sugar, chili powder, garlic powder, and cayenne in a small bowl to combine. Makes about ½ cup.Step 2Do ahead: Seasoning can be made 1 month ahead. Store airtight at room temperature.Chicken and AssemblyStep 3Combine chicken and lemon zest and juice in a large bowl; toss to coat. Sprinkle with salt and 4 Tbsp. seasoning and toss again to evenly coat. Cover and let chill at least 2 hours and up to 12 hours.Step 4Heat 1 Tbsp. oil in a medium saucepan over medium-high. Cook onion and garlic, stirring occasionally, until tender, about 3 minutes. Add brown sugar; cook, stirring constantly, until sugar turns a shade darker, about 2 minutes. Add remaining 1 Tbsp. seasoning; cook, stirring, until fragrant, about 30 seconds. Add ketchup; cook, stirring, until slightly darkened in color, about 2 minutes. Stir in vinegar, molasses, mustard, hot sauce, and Worcestershire sauce. Bring to a boil over high heat; cook, stirring, 2 minutes. Let cool 5 minutes. Transfer to a blender and purée until smooth. Set sauce aside.Step 5Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on 1 side; for a gas grill, leave 1–2 burners off). Lightly oil grate. Grill chicken over direct heat, turning every minute, until browned on all sides, about 5 minutes. Move chicken over to indirect heat, cover, positioning vent over chicken if your grill has one, and grill, turning every 5 minutes or so, until an instant-read thermometer inserted into the thickest part of thighs registers 140°–145°, 18–25 minutes. Uncover grill and continue to grill, basting with reserved sauce and turning occasionally, until thermometer registers 165°, about 10 minutes longer.How would you rate Sticky Barbecue Chicken?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleAnyone that makes chicken on the grill knows that the black char on sauce means you waked away from your grill. \n I know you can cook your sauce before adding it to grilled meats and make the  auce nice and yummy, thick and sticky . By cooking your sauce down a bit, you're releasing steam and the water evaporates from the store bought sauce... ensuring you can get a thick yummy coat of sauce on your meat and avoid the cancer causing carcinogens which result from burning and charring meats to black. This way you dont have to burn ithe sauce onto your meat.  Bon Appetit~ Sxxxy~ Dayton, Ohio3/20/2022Incredible flavor, this has become my go to bbq seasoning, and sauce.  Excellent recipe…thank youMkellyNJ12/23/2021Fantastic flavour and unbelievably moist. ! grilled a whole chicken perched upright on the removable insert from a tube cake pan, which was more stable than a beer can. Unlike chicken pieces there was no hands on time while grilling. Didn't make any substitutions to the rub or sauce ingredients. The sauce was thick and smooth without pureeing. The skin looked exactly as pictured with the recipe.SadieCanada8/23/2021I'm a bit confused too, about the seasoning...is it really 1/4 CUP of smoked paprika, or something less?JuniorToronto Canada6/30/2021I cannot rave about this recipe enough! In terms of making your own seasoning and sauce, it does not get any simpler! I keep the dry rub in a jar and use it wherever I want a BBQ flavor. I love it! I have made it at least 3 times in the last year and continue to come back whenever I want BBQ chicken. KaiLos Angeles, CA5/2/2021This is a killer BBQ Chicken recipe!  Made it several times and it's turned out fantastic  I think the real star of this is the BBQ sauce - seriously the best BBQ sauce I've ever made and in the running for my favorite sauce out of all the BBQ I've sampled over the years.  Have made the sauce by itself several times just to use on pulled pork and anything else I've wanted BBQ sauce on.  Literally no reason to ever get store-bought sauce again with something this tasty and simple.  I've made this for friends and everyone raves about how good it is and are shocked when they find out I whipped it up in the kitchen.  Thanks BA!AnonymousCoastal Virginia8/8/2020I've made this sauce 3...maybe even 4 times now.  It's so good.  Started with the thighs but have also done mixed thighs and drumsticks, and would honestly put it on anything from a whole cut up chicken to just wings.  It's a lot of ingredients and takes time but it's gotten easier and faster every time, and now I've made bulk of the dry mix and have it ready to go!vaske13Lincoln, NE8/5/2020This is delicious.  It was so very good I was actually happy we were in quarantine and could not share with others.  I will make this again and again. BunnyinGAGeorgia7/8/2020Followed exactly and these came out perfectly! The marinade and sauce are both incredible - smoky, spicy, and just the right amount of subtly sweet. Was only able to marinate the thighs for the minimum 2 hour time and they were still super flavorful. AnonymousNew York, NY7/5/2020This chicken is far and away the best barbecued chicken I've ever made.  At first I thought all the different ingredients would be overwhelming, but instead they are perfectly balanced and create a glorious and sumptuous flavor.  The lemon pops just when you least expect it, giving the chicken a bright piquancy.  Simply divine.grimbergenNew Jersey7/5/2020Really really good.   I smoked two chickens (full chickens spatchcocked) outside at 300-325 (ish -- that's a hot smoking temp) for three hours, and sauced the chicken the last hour.  Really flavorful, the sauce had a nice kick to it.       Started the marinade in the morning.wburosAustin Tx6/22/2020I am a little confused about the seasoning! The barbecue seasoning recipe makes 1/2 cup, and the recipe calls for 5 TBSP should I have some left over? Anonymous6/21/2020This turned out excellent, and I've made it twice. Both times the chicken temperature stalled as soon as you begin to sauce. They sort of lingered at 140 until you start to put them back over direct heat. Since thighs are so forgiving, you can probably wait until they reach 155-160 before beginning to sauce and turn. The Juneteenth spread in the issue has a lot of great recipes, and the seasoning is used frequently. Great issue to pick up. I also made the potato salad and shrimp crackers. The crackers were wonderful. greengoFalls Church, VA6/18/2020That barbecue sauce is heavenly!! If I’m not making the chicken again I’ll definitely be making that sauce. The recipe was super easy to follow and I even added some drumstick to accompany the chicken thighs. Really great barbecue! groseoWisconsin 6/15/2020This is the only BBQ chicken recipe you ever need. 10/10 Don't skip any steps. I liked that the lemon flavor came through even with all the other spices. ginahemmings6613Denver, CO6/14/2020Explore Bon AppétitSouthernAmericanChickenPoultryPaprikaHerbs & SpicesMolassesCondiments, Sauces & PastesChicken ThighSummerEasyMainDairy-FreeGluten-FreeGrillingJuneteenthFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Kurt Evans"]}