{"id": "3aa9892579b71e4f088ffb0f6e1af2c5", "url": "https://www.bonappetit.com/story/low-abv-dating", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "A Brief History of My Wildly Unsuccessful, Non-Alcoholic Dating Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Brief History of My Wildly Unsuccessful, Non-Alcoholic Dating LifeWellness culture tells us to drink less. The apps tell us to date more. But can you do both at once?By Amanda ShapiroJanuary 15, 2020FacebookTwitterEmailIllustrations by Justyna StasikFacebookTwitterEmailThis essay is part of 20 Ways to Feel Better in 2020, a collection of our best ideas for getting you to whatever version of \"better\" feels best to you.Last summer I went on 16 first dates. That works out to one and a third first dates a week, from the graphic designer in May to the public defender in August. Is that a lot? I don’t even know anymore. I had just ejected myself from a four-and-a-half-year relationship like a fighter pilot with a wing on fire. Sitting in the wreckage, I was convinced I’d never love again. But I figured I should meet every unattached adult man in Brooklyn to make sure.And I decided to do it while drinking as little as possible. I’d taken booze breaks before—a few weeks here and there—and I always felt great. But I’d never done it while trying to date...[does some back-of-the-envelope math]...roughly half a million men.\nDrinking and dating go together like Harry and Sally. Kim and Kanye. Ellen and Portia. Carrie and Mr. Big. Since the dawn of time, bars have been where you met strangers you might want to sleep with. Now they’re where you meet strangers you’ve exchanged messages with on the internet whom you might want to sleep with. Really nothing has changed.But in recent years drinking less has become far more mainstream. My desk at Healthyish is lined with well-designed liquor-shaped bottles that don’t actually contain booze. There’s Seedlip, blends of botanicals designed to taste like spirits; Kin Euphorics, laced with mood-enhancing and brain-enhancing supplements; Curious Elixirs, made to taste like Negronis and Dark and Stormys; and Casamara Club’s “amaro sodas,” sparkling and bitter and also sans booze. Nonalcoholic cocktails (don’t call them mocktails) are on every new restaurant menu I see, and at dinner parties from L.A. to Brooklyn, weed has replaced wine as the thing to bring.I started my experiment months before it was declared #hotgirlsummer, but already the apps were hopping. My phone pulsed with eager energy. I gave myself a couple of rules: I’d avoid booze when possible, but if I did drink, I’d stick with low-alcohol options— spritzes, aperitifs, and the like—and I’d keep it to two in a night.My first first date, with the graphic designer, was at a beer bar with no nonalcoholic options on the menu. I ordered a Campari soda and tried to sip it slowly. He was nice and funny and had good hair, so I agreed to a second round. By the end of the night, we were sitting close at a cocktail bar, drinking something whiskey-forward on the rocks. First date: Success. Low-ABV: Fail.Five minutes into my second first date, with a computer programmer, I knew it was a dud. I extracted myself after one watery gin and tonic and went home to watch Game of Thrones. Low-ABV: Success. First date: Fail.I quickly realized I didn’t have the willpower to not drink in bars. So I decided to remove the temptation. It was summer in New York, after all; the parks were crammed with couples. I showed up to my first park date with a bottle of San Pellegrino and a chocolate bar. The psychologist showed up with a bomber of craft beer, which we shared. I took a walk with a wellness entrepreneur and ended up on a bench sipping whiskey from his flask.“Just tell people you don’t drink!” said my friend who is sober (and, for the record, married). But it felt impossible to admit, like announcing a sexual fetish after making small talk.I didn’t always fail. At a daytime roof party, the lawyer I was with downed margaritas while I stuck with cold brew, and no one seemed to notice. At the park with a novelist, we both showed up empty-handed and had a totally pleasant time. But I kept coming up against the same problem: If I actually liked the person, I’d drink with them. I never tested my dates’ tolerance for my low-ABV lifestyle, because my low-ABV lifestyle was a lie.Alcohol still has a choke hold on dating culture because dating is still one of the most stressful things we do by choice.Eventually I gave up on my rules. At a bar with a music executive, I ordered a mezcal cocktail right out of the gate. I split frozen margaritas with a Silicon Valley transplant. Negronis with a drummer. Oysters and champagne with a nurse. Whiskey and ginger ale with a photographer while we danced until the sun rose. I had the kind of carefree, high-intensity nights I’d been craving, and I paid for it: with lack of sleep, loss of productivity, lapsed friendships, and actual dollars (the follow-up to this essay will be called “My Low-Budget Single Life”).Thanks to wellness culture, we’re supposedly living in the golden age of not drinking. And thanks to the apps, we’re supposedly living in the golden age of dating too. But these trends do not, in my experience, overlap. Alcohol still has a choke hold on dating culture because dating is still one of the most stressful things we do by choice. And the apps, despite their illusion of frictionless romance, have made dating even harder. By the time you show up at the bar, you’ve looked through an infinite scroll of strangers, squinted at photos, made some arbitrary judgments, sent some messages, almost bailed at least six times, and are now hoping, by some algorithmic miracle, that you’ve picked someone you’ll like and who will also like you.Alcohol smooths these anxieties. It helps you forget those epic battles you fought to get yourself in the room. The only thing that those well-branded, nonalcoholic spirits do is make you have to pee.And feel guilty. One of the fancy bottles promised “a night where social isn’t sinful and self-care doesn’t stop at sunset.” A nonalcoholic rosé infused with crystal energy was billed as “social, sippable, self-care.” But why should self-care be a 24/7 job, one that includes eating right, exercising, sleeping eight hours, bathing with candles, getting a daily dose of crystal energy, and being mindful, not just at yoga class but all the time?When do we get to lose our minds? When do we get to stop self-care-ing and be total hedonists? I’m not saying alcohol isn’t bad for you. It is, of course, too good at letting us forget ourselves sometimes. What I’m saying is: Self-care can look a lot of different ways, and maybe there’s a kind of mindfulness in knowing when to let go.At least for me there was. That summer, dating was about escaping the grinding hour-by-hour work of getting over heartbreak. It was about stealing a few hours of fun during an otherwise brutal time. And I think that counts as balance. You spin out for a while, you reel yourself in. You have a Negroni. Some days you have two.Explore Bon AppétitHealthyishNonalcoholicessayRead MoreLifestyleBig Alcohol Is Bracing for a More Sober FutureBy Julia BainbridgeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-15", "author": ["Condé Nast", "Amanda Shapiro"]}