{"id": "3ab01e2926286e71c86fb6a0022ac16f", "url": "https://www.bonappetit.com/story/cassoulet-recipe-plan", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Cassoulet Is the Most Epic Dish You Will Ever Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCassoulet Is the Most Epic Dish You Will Ever MakeOur classic version takes no shortcuts and requires a little planning, but every step is totally doable, even if you’re not a pro.By Claire SaffitzMarch 8, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailI have made cassoulet more times than is advisable—first in culinary school, once with a friend for a dinner party, and at least half a dozen times in the BA Test Kitchen. The famed French peasant dish of white beans, silky duck confit, and rich ragout topped with a golden breadcrumb crust can take three days and nearly half a dozen pork products to make. It’s an occasion to break out the biggest pot you own, and I can’t think of another recipe that’s more fun to share with family and friends. Our classic version takes no shortcuts and requires a little planning, but every step is totally doable, even if you’re not a pro.First things first: As food director Carla Lalli Music advises, you can divide and conquer. Tag-team with your most ambitious cook friends. One makes the duck, another tackles the ragout and beans. Whoever has the biggest table hosts, and assembly is a group event. Then open a few of bottles of wine and hang out until it’s time to feast.But if you’re delving in yourself, here’s how to break it down, with some tips and tricks along the way. Sure, you need to spread the work out over three days, but the active cooking time is something closer to three hours, and no step requires advanced techniques. Here’s how to do it.Beans ready to cook.\nPhoto by Alex LauOne-Stop ShoppingCassoulet requires a few ingredients you won’t find in the typical supermarket. Save yourself from searching all over town and head to D’Artagnan’s website, where you can order French Tarbais beans, precooked garlic sausage, and Moulard duck legs. Just don’t leave this for the last second.Two Days AheadSoak the beans overnight.Soaking beans before you cook them ensures a faster cooking time on the other end. Yes, there’s a shortcut we endorse, but you’ve already decided to make cassoulet, so you might as well do it the right way. Cover your Tarbais, corona, or cannellini beans with several inches of cold water and refrigerate overnight. (They may start to sprout or ferment if your kitchen is too warm.) Tarbais beans are traditional in this dish, prized for their thin-but-resilient skins and creamy texture. Authentic ones grow in France’s Tarbes region and can get pricey, but both corona and cannellini make fine substitutes.Beans all flavored and tender.\nPhoto by Alex LauCure the duck legs.The duck legs need at least 12 hours to cure, but lucky for you the process is easy, requiring just a lot of salt and waiting time.One Day AheadConfit the duck legs.Confit duck legs are a gift that keeps on giving in this dish: The rich meat gets pulled off the bone, the rendered fat is used to sauté the sausages and breadcrumbs, and the skin gets crisped up to crumble on top at the very end.Confit complete.\nPhoto by Alex LauCook the beansAll the aromatics, veg, and herbs—cloves, carrots, onion, garlic, thyme, and a bay leaf—flavor the beans as they cook. Not to mention that there’s a thick piece of pancetta in there, too. While the beans are simmering away, you can move on to the next part.Shred that duck.\nPhoto by Alex LauMake the ragout.This is your final step for the day. And again, it’s pretty hands off. You’re browning your pork shoulder and then letting it slowly become fork-tender in liquid. Once that’s done and cooled, you simply mix in the beans with some of their delicious bean liquid. Save what you don’t use! You might need it for moisture later if the cassoulet is looking dry as it cooks.Ragout and beans ready to be mixed.\nPhoto by Alex LauThe Day OfPrep the sausage and the breadcrumbs.Remember that duck? You’re going to cook the skin from it first so that it gets all crispy and the fat renders out. Then you’re going to use that fat to cook your sausages. Lastly, you’re going to toast your breadcrumbs in the same pan, same fat. Pretty genius, right?That duck skin. Damn.\nAlex LauLayering away.\nPhoto by Alex LauLayer cassoulet.It goes like this: one-third of ragout mixture, half of the sausage and duck meat, another third of the ragout mixture, remaining sausages and duck meat, then remaining ragout mixture. Sprinkle most—but not all!—of the breadcrumbs on top.Get the juices flowing.\nPhoto by Alex LauBake cassoulet.You’re baking at 375° for 25-30 minutes at a time, a total of six times. In between each of those, you repeatedly break up the top layer with the back of a spoon and add more breadcrumbs before it goes back in the oven. This fuses the starchy beans and breadcrumbs with fat and gelatin from the meats, creating a deeply flavorful topping. After the final layer of breadcrumbs is added, you’ll serve with the ultimate garnish: Crumbled, crispy duck skin.Get the recipe:Classic CassouletLayers of duck, two kinds of sausage, a hearty ragout, and beans make this the comfort meal to end all comfort meals. It’s an occasion to break out the biggest pot you own. Our classic cassoulet recipe takes no shortcuts and requires a little planning, but every step is totally doable, even if you’re not a pro.View RecipeExplore Bon AppétitFrenchCasseroleWeekendRead MorecookingHow to Cook Dried Beans (the Tastiest Beans of All, if You Ask Us)By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-08", "author": ["Condé Nast", "Claire Saffitz"]}