{"id": "3abcf4890a018a759f0f9ae0ce29e678", "url": "https://www.bonappetit.com/story/should-your-cooking-water-taste-like-the-sea", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "How Salty Should Cooking Water Really Be? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShould Your Cooking Water Really Taste Like the Sea?Saltwater therapy.By Sarah JampelMarch 17, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailMaybe you’ve seen the videos: A cooking show host empties an entire box of salt into a pot of water because, they say, it’s gotta taste like the sea. So then you go to boil a pot of rice and dump in ½ cup of kosher salt, which renders the rice practically inedible. So how salty should cooking water really be?To determine how salty to make your water, you want to try to figure out (or guesstimate) how much the ingredient is going to absorb. Generally speaking, the greater the absorption, the less salty the water needs to be. If you’re cooking a very porous ingredient (peeled and cut potatoes or squash) or something that’s going to spend a loooong time in the pot (dried beans that simmer for 3 hours) or absorb the full amount of liquid (rice or quinoa made via the absorption method rather than by boiling like pasta), that ingredient is going to drink up a lot of salt—which means you don’t have to add as much of it.This seems like an obscene amount of salt—but whole, unpeeled potatoes won't take up that much water.\nBut when an ingredient is not going to absorb much water, either because it’s hardy and dense (like whole beets) or because it’s only going for a brief dip (pasta, rice you’re parcooking for cabbage rolls, spinach you’re blanching for namul) make the water salty: The food won’t drink up that much of it, so it should be concentrated. (That’s why we recommend very salty water for boiling whole potatoes.)And to set the record straight, chef Sohui Kim of Insa in NYC says that pasta water “doesn’t have to taste as salty as the ocean,”—this very detailed Serious Eats article explains why it really should not—“but you do have to be able to taste the salt.” In order to taste the salt, yes, you’re going to have to taste that cooking water. So grab a spoon, close your eyes, and imagine the sea—then aim for something not quite so dramatic.Time for pasta!1 / 45ChevronChevronOne-Pot Kimchi and Squash Mac and CheeseView RecipeExplore Bon AppétitPastaNoodleSaltRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-17", "author": ["Condé Nast", "Sarah Jampel"]}