{"id": "3ac8dc1eeb124f27a2473cccc120fb9e", "url": "https://www.bonappetit.com/story/spicy-cashew-dressing", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "A Salad Dressing Ingredient Swap That's Making Our Salads Taste Better Than Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Ingredient Swap Is Making Our Salad Dressings Taste Better Than EverAnd a creamy, spicy dressing recipe to get you startedBy Aliza AbarbanelApril 15, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailWe’re true believers in the transformative power of a good salad dressing. We’ve pledged allegiance to tahini-ranch, chile crisp, and miso-mustard dressing, but even our most trustworthy vinaigrettes feel tired eventually. So we borrowed a trick from Gerado Gonzalez's vegan Caesar recipe and swapped some of the oil with blended nuts creates a toasty, rich dressing that's unbelievable creamy—no dairy necessary.Exhibit A: This spicy cashew dressing, developed by senior associate food editor Molly Baz. The recipe uses deeply toasted cashews in place of half the oil along with fiery chile flakes, funky-savory fish sauce, a hint of honey, and a shot of bright rice vinegar. Make it vegan if you wish by swapping honey for maple syrup and fish sauce for soy sauce, but don’t skip the deeply toasted nuts. They’re infinitely more flavorful and aromatic than their raw counterparts. “This dressing hits the flavor notes of a Caesar but leans on cashews for some of the fat, because blending in deeply toasted nuts is like blending in oil,” Baz says. (Pro tip: senior food editor Chris Morocco used a similar technique to make a miso-hemp dressing for folks who don’t eat nuts.)If you’re working with raw cashews, start by tossing one cup of nuts with two teaspoons of oil and a half teaspoon of salt, then roast at 325°F until fragrant and darker in color. It should take about 15 minutes, at which point your kitchen should smell toasty and delicious.Then blend whole thing together with warm water, vegetable oil, and garlic until it’s smooth and pourable. It should only take a minute or two—I whipped up this dressing at 11 p.m. on a Wednesday and had no regrets.This cashew dressing is powerfully flavored, so it stands up to sturdy chicories, roasted vegetables, and whole grains. Serve it over a dinner-worthy salad with radicchio and roasted sweet potatoes, or hold back a few tablespoons of water to make a savory dip for crudités. Or, if you’re me, skip the pleasantries and dip some stray carrots straight into the blender. It might not be a salad (okay, it’s definitely not a salad), but it’s definitely delicious.Salad dressing forever:Spicy Cashew DressingInspired by the nut-based Caesar dressings at NYC’s Lalito and Scarr’s Pizza, our version starts with roasted cashews.View RecipeExplore Bon AppétitHealthyishSalad DressingSaladCashewRead MoreLifestyleHow to Make a Killer Fruit Salad No Matter the Time of YearBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Aliza Abarbanel"]}