{"id": "3ae08d692bf500199ffaf23018c0aaa4", "url": "https://www.bonappetit.com/recipe/cod-with-soy-caramelized-onions-and-potatoes", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Cod With Soy-Caramelized Onions and Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCod With Soy-Caramelized Onions and PotatoesBy Chris MoroccoMay 18, 20204.4(42)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Plate by Meilen Ceramics EmailPinterestPrintEmailPinterestPrintAdding ginger and soy sauce to caramelized onions gives a bit of zingy punch and intrigue, creating a multidimensional meal that comes together in just one skillet. Covering the onions briefly during the beginning of the cooking process helps them break down more quickly—a baking sheet will work if you don’t have a lid!Ingredients2 servings3Tbsp. extra-virgin olive oil, divided2medium onions, thinly slicedKosher salt11\" piece ginger, peeled, sliced into matchsticks or finely chopped2tsp. soy sauce1medium russet potato, scrubbed, sliced into ¼\"-thick rounds25–6-oz. cod, pollock, halibut, or other flaky white fish or salmon fillets2scallions, trimmed, thinly slicedFurikake, shichimi togarashi, sesame seeds, mild red pepper flakes, or other fun sprinkly topping (for serving; optional)PreparationStep 1Heat 2 Tbsp. oil in a large skillet over medium. Add onions, season with salt, and cover. Cook, uncovering and stirring occasionally, until onions are softened and just beginning to take on color, about 5 minutes. Uncover, add ginger, and cook, stirring occasionally, until onions are jammy and golden brown, 10–12 minutes. Stir in soy sauce. Transfer onion mixture to a plate and wipe out skillet.Step 2Pour remaining 1 Tbsp. oil into same skillet and increase heat to medium-high. Add potatoes in a single layer and season with salt. Cook, turning halfway through, until golden brown, 10–12 minutes.Step 3Spread onion mixture over potatoes, leaving a 1\" border of potatoes without onion mixture. Season fish with salt and place on top of onion mixture. Cover and reduce heat to medium-low. Cook until fish is opaque throughout and easily flakes apart, 10–12 minutes. Serve topped with scallions and furikake (if using).How would you rate Cod With Soy-Caramelized Onions and Potatoes?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleI dont know if the ginger and onions were suppose to cook covered or uncovered so I ended up burning my onions :(LeenaDetroit, Mi12/6/2021I am not impressed with this recipe. Not a repeat for sure.NerkoWestport, CT10/7/2021We don't eat potatoes, so we substituted chopped cauliflower florets and the recipe was excellent. It has a subtle taste that works great with cod.  We also used vidalia (sweet) onions and for appearance, topped with black sesame seeds along with the scallion slices.  Appearance was good enough to serve company.  David OBoston, MA7/8/2021One of the best white fish dishes we've ever tasted, and will definitely make again. Potato slices became crispy on the underside and provide a layer between the heat and the fish, so the fish basically was steamed to tendernessAnonymousNew York6/14/2021will not make again, do not use a thick fish filet, took too long to cook thru and ended up over cooked and tough.Anonymousnorthern California12/22/2020I'm not a pro.  This is good. Make it. Substitute if you need.. Make it.  This is good.Chacha55Clarksville,  Arkansas 9/27/2020This dish was tasty! Next time, I will look into how to cook the potatoes all the way through without destroying my pan... :( Next day leftovers are even better than the original dish. Make sure you leave yourself a little extra for the following day!AnonymousSeattle, WA7/23/2020Simple and simply delicious. Excellent weeknight meal (though the onions do take time), this was a big hit with the kids and adults in my house. AnonymousMontclair, NJ 6/24/2020This is the best bon appetit recipe I've ever made! It was so easy but gratifying as a young burgeoning home cook.sjeyaDallas, TX6/22/2020I've recently made several recipes from Bon Appetit and loved every single one but this one did not come together for me.  It was very one-note as expected with just soy sauce and salt as the seasoning.  It was also time-consuming having to cook onions and potatoes separately.  My family didn't care of it at all.  Felt like I wasted good, fresh-caught halibut.  AnonymousTruckee, CA6/21/2020Excellent. beloved by all who ate it.a.goekler7491Denton, TX6/19/2020This was outstanding.  Plan on spending a good 40 minutes in front of the stove, but worth it for a really nice dinner for two. I didn't have the fancy toppings, but did top with scallions, red pepper flakes and toasted sesame seeds. I added some finely chopped kale from my garden to the onion mixture after the onions had finished caramelizing. The recipe doesn't needed it, I just needed more healthy greenage in my dinner and didn't want to have to make a separate side. Can't wait to make this again!AnonymousMaine6/16/2020This was great easy weeknight dinner! I grated the ginger instead of cutting it into matchsticks - that was a mistake.\nAnonymousFrance6/10/2020This was v simple and easy to make. I had to make enough to serve 4 so the potatoes took a little long, since they had to be cooked in a single layer without piling up, but it all come together nicely. Served this with a side of rice and some greens. Queens6/9/2020So good, so easy (not fast, but easy), so few ingredients. Use high quality soy sauce. The onions and potatoes pack a wallop. Super easy week night meal if you don't mind the time it takes to caramelize the onions.6/9/2020Explore Bon AppétitCodFishSeafoodOnionVegetableEasyQuickOne-Pot MealsWeeknight MealsMainNut-FreeDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-18", "author": ["Condé Nast", "Chris Morocco"]}