{"id": "3af9cb0fd6507e60d5cc1d11a2ff29ba", "url": "https://www.bonappetit.com/story/it-hasnt-been-enough", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "It Hasn't Been Enough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt Hasn’t Been EnoughI love this community, and I want to do better for you.By Amanda ShapiroJune 4, 2020FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Let’s get right to it.None of what I’m about to say is a revelation; we didn’t suddenly “wake up” to the realities of racism in this country after the death of George Floyd. But in light of his death and other unconscionable killings, I think it’s necessary to be upfront about the ways institutional racism plays out, including at brands like Healthyish.While Healthyish has always sought to cover the diversity of the food and wellness worlds, we haven't always supported the Black community in a meaningful way. These are the ways that Healthyish and I, as its editor, have fallen short. So I want to talk about how Healthyish and I, as its editor, have fallen short. And how we’ve tried to improve. And the work we still need to do.Healthyish has been guilty of optical allyship.First, what’s optical allyship? As doula and writer Latham Thomas puts it, “it makes a statement but doesn’t go beneath the surface and is not aimed at breaking away from the systems of power that oppress.”Here’s what that means for us: We often say, “Wellness should be for everyone.” You could even say it’s our core mission. And the stories we run often focus on people of color, including those who are Black. But—and here are the problems—there are no full-time Black staffers at Healthyish. To be fair, there are no full-time staffers at Healthyish, period. Both assistant editor Aliza Abarbanel and I have responsibilities across Bon Appétit, and many other staffers contribute to Healthyish, but the vast majority of them are white too. Secondly we don’t hire enough Black freelancers. The vast majority of our pitches come from white writers, and we haven’t put in enough work to change that.As a result, I think our coverage, even when it’s about non-white people and groups, ends up being written for white readers.And while we promote non-white people and businesses by posting about them on our platform, we need to also promote Black writers—with jobs and paychecks and assignments. That’s true allyship.We’ve already been working to change thisIn recent years, Healthyish—and BA as a whole—has begun some of the difficult work of addressing these problems. We’ve been lucky to have Priya Krishna, a contributing writer, working with Healthyish and pretty much every part of BA to set goals for diversity and inclusion and hold us accountable to them. For my part, I’ve committed to hiring at least one new freelancer of color a month at Healthyish. I’ve committed to paying freelancers higher than the standard digital rate whenever possible. At least thirty percent of our recipes are already inclusive of communities of color (that could mean the recipe developer is a person of color, or the technique, ingredients, or dish as a whole is not Euro-centric). And I’ve committed to quarterly check-ins to assess our progress toward these goals.We have more work to doHere’s where recent events have changed my thinking. While the goals I mentioned are about all communities of color, I want to make some commitments to Black communities specifically. I recognize the need for more Black staff at Bon Appétit, especially at the senior level. Second, I want to expand our network of Black freelance writers to share their perspectives on whatever topics interest them most—not just race. (If you want to write for Healthyish, email me: amanda_shapiro@condenast.com.) Third, I want to publish more stories by and for our Black readers, like BA staffer Jesse Sparks’ guide to mental health resources. And, lastly, I want to help our non-Black audience become better allies by talking more about the barriers to wellness that Black people face and what the rest of us should (and should not) do to help.I know I sound like I’m running for office here, but I don’t know how else to make these commitments to you all, our Healthyish readers, clear. I love this community, and I want to do better for you. Please hold me to it.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyish NewsletteressayHealthyishRead MoreLifestyleIf You Care About WellnessBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-04", "author": ["Condé Nast", "Amanda Shapiro"]}