{"id": "3afac0f895af78d8c0a22cd77206da3a", "url": "https://www.bonappetit.com/story/lamb-meatballs-red-curry", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Lamb Meatballs, Red Curry, and Everything Else I’m Cooking This Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLamb Meatballs, Red Curry, and Everything Else I’m Cooking This WeekHow to hibernate in your kitchen, and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroJanuary 31, 2019FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,It's almost the end of January. It's only the end of January. Since I got back from the desert, I've continued to hibernate in my kitchen. Friday was for lamb meatballs, my ride-or-die. Saturday, I pulled together a vegetarian red curry loosely inspired by this one, and on Sunday I made those incredible soy-braised short ribs from the first episode of Salt, Fat, Acid, Heat. Meanwhile my partner(?!) descended further into the carb-filled black hole of bread-baking, emerging with a loaf of sourdough and some pizza dough too.It really set us up for the week. We had a lot of extra rice from the curry and the short ribs, so on Monday we fried it in leftover lamb fat with ginger, scallions, soy sauce, and some giant handfuls of spinach for health. Tuesday was pizza night, using the homemade dough and Joe Beddia's sauce recipe. Tonight I'm toasting the only-slightly-stale sourdough and sautéing leeks for a stripped-down version of these caramelized leeks on toast. I have a pint of dashi leftover from the short ribs, so maybe Thursday I'll use it to steam some salmon and broccolini, a combo I've been crushing on since Chris Morocco's crowd-pleasing Feel Good Food Plan recipe. And Friday, well, I'm going out.This is a yogurt moat. Isn't it pretty?\nPhoto by Ren FullerMy personal Cooking Season is definitely weather-related, but I've also been drawing inspiration from our amazing Healthyish columnists like our friends at Botanica, whose latest column is about how a yogurt moat (yes, I said \"yogurt moat\") can turn any side dish into a meal. At the restaurant, they use a fancy local sheep's yogurt, but you can use any full-fat variety you like, just be sure to season liberally with salt and whatever herbs, spices, citrus, etc., you like.If yogurt's not your thing, our brand-new columnist  Sarah Jampel makes a good case for marinating lentils, especially if you're a protein-starved vegetarian like her. They're a great meal-prep component, but they come together so quickly you can make them as an emergency dinner any night of the week. I'll be putting them on sweet potatoes with feta, tossing them into salads, and maybe working them into a pasta with garlic and olives.And, reporting from Joshua Tree, Alison Carroll closes out her column with about a million ideas for how to cook with olive oil when it's at its freshest, most nutritious best. Yes, olive oil has a season, and that season is now! Once I get my Wonder Valley shipment, I'll be following Carroll's lead and streaming it into pesto and over soft cheese—and if there's another loaf of sourdough in my future, which I'm almost certain there is, you can bet I'll be dunking that too.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleOoh Ooh Oooh, I’m on FyreBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-31", "author": ["Condé Nast", "Amanda Shapiro"]}