{"id": "3b048d7983c4cd96d02f38e85f4d44ba", "url": "https://www.bonappetit.com/story/cashew-yogurt", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Cashew Yogurt Is the All-Day Cafe Staple You Can Totally Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCashew Yogurt Is the All-Day Cafe Staple You Can Totally Make at HomeJust don't call it cashewgurt.By Aliza AbarbanelAugust 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailFirst came the nut cheese. Next, the dairy-free ice cream. Now cashews have entered the yogurt game, dominating all-day cafe menus (find it at L.A. mainstay Honey Hi and abcV in NYC) and the ever-expanding shelves of the dairy aisle (see brands like Forager, Vega, and Blode Kuh).Making regular dairy-based yogurt can feel intense (So many live cultures! So little time!), but it turns out that making nut-based yogurt is almost as easy as blending up a morning smoothie. And the payoff is huge: smooth, silky yogurt that’s definitely cheaper than the store-bought stuff.“Yogurt is the one dairy product I consume a good amount of, so I kind of scoffed at the idea of making this recipe,” says senior food editor (and noted yogurt lover)  Andy Baraghani. “But it’s really easy to achieve.”We could get lost in these swirls.\nPhoto by Alex LauStart by soaking a cup of raw cashews overnight to help the nuts soften and break down easily. In the morning, drain and toss them in a blender with some kosher salt, lemon juice, and honey. The lemon juice helps mimic dairy’s distinctive tang, plus it plays off the honey to balance the flavors in the bowl. Get the motor running and stream in ½–⅔ cup water until the mixture is smooth and has your desired, yogurt-like consistency. It's smart to start with ½ cup water and add more as needed, because soft cashews will absorb more water the longer they soak.Once the blended mixture looks like, well, yogurt, transfer it to a medium bowl. It'll keep in the fridge for up to a week—perfect for mornings when you barely have time to get dressed, let alone make breakfast.Because the yogurt-making process is so simple, now is the time to really go wild with your toppings. For this recipe, Baraghani macerated some cherries with lemon juice and sugar, using a food stylist’s trick to really amp up the all-day cafe look. “I like to pop the pits out with my thumbs to create a craggy effect,\" he says. \"It's so much more interesting than a clean cut.\" Try this technique on sugar plums or tiny apricots, or just use berries instead.Next, add some texture with toasted coconut, chopped nuts, a drizzle of honey, or some grain-free tahini granola. You can even swirl in some jam if you \"accidentally\" ate all the farmers' market fruit you were saving for breakfast. Serve it up in a good ceramic bowl, find some natural light, and boom—your kitchen just became the hottest breakfast spot in town. Bonus: you can absolutely eat there in your PJs.It's easier than you thought:Cashew YogurtThink of this creamy cashew yogurt as a new, flavorful vessel for your granola or fruit in the morning.View RecipeExplore Bon AppétitHealthyishCashewYogurtBreakfastRead MorecookingThese Onion-y Turmeric Eggs Are the Perfect Breakfast Comfort FoodBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Aliza Abarbanel"]}