{"id": "3b0c509b3e8fe5b745b162f09384169d", "url": "https://www.bonappetit.com/city-guides/new-york/venue/sahadis", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Sahadi's Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkSahadi'sA charming Brooklyn grocery store that specializes in Middle Eastern goods.FacebookPinterestTwitterEmailCourtesy of Sahadi's GO HERE: to participate in one of the best grocery shopping experiences in NYC. Sahadi's has been a family-run business since 1948 and it shows in all aspects. It sells really affordable grains, nuts, beans, and more esoteric Middle Eastern pantry ingredients that are hard to hunt down elsewhere. Plus, the crazy efficient and friendly staff will make you forget that you waited (with a number you pulled from a ticket machine) for 15 minutes to get your hummus fix.BUY THE: labneh! Spanakopita! Za'atar flatbread! Then, hunt down those ingredients you always mean to keep in your pantry but recently ran out of. That means tahini, pomegranate molasses, and all the lentils. Oh, and get a couple of cans of grape leaves while you're tossing things in your basket. Don't skip on the whole wheat pita—it's not otherworldly, but it's really cheap and does the trick.THE VIBE IS: frenzied, especially on Saturdays. The store is not huge and has a popular fanbase. Try going during off hours if crowds aren't your thing, but the customers are a nice community of people who just all happen to have that same hankering for baba ghanoush and taramasalata.PRACTICAL STUFF: Open daily from 9 a.m. to 7 p.m., except Sundays.—Carey PolisCourtesy of Sahadi'sWE ALSO LOVESOS ChefsWhere serious cooks stock up in the East VillageTanoreenThe bucket-list-worthy Middle Eastern destination in Bay RidgeMurray's CheeseA cheese lover's dream shop in the West VillageExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Carey Polis"]}