{"id": "3b212795da30f6fceade6c47fb0ab4a8", "url": "https://www.bonappetit.com/story/keto-diet-sweet-potato", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "The Keto Diet, Sweet Potato Season, and the Perks of Voting | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Keto Diet, Sweet Potato Season, and the Perks of VotingRecipe recommendations, voting reminders, and other opinions from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 1, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I've been off the boat for nearly a week, and people are still asking if I have my \"land legs back.\" I tell them I was on a ship the size of a small country so I never really lost them. Back at the office, we're churning out some pretty stellar Healthyish holiday recipes and plotting the Feel Good Food Plan for early next year. No spoilers, but it's gonna be DELICIOUS. Here's what else is going on:This Week on HealthyishOn Monday we published a little story from Molly Guinn Bradley about trying the keto diet and a gallery of keto-friendly recipes to match. You guys were...extremely interested. Personally even the thought of such a restrictive diet makes me panic and seek bread, but I get the impulse to read about extreme ways of eating. Just know that Marion Nestle, our favorite no-B.S. nutrition goddess, would never mess with keto.Make It TonightOn Sunday, after a stressful, chore-and-work-heavy weekend, I threw together a version of these Healthyish sweet potato bowls, roasting the sweet potatoes instead of steaming them, and sauteéing the fennel and onion in ghee instead of leaving it raw. I cooked the ground lamb with this ras el hanout from SOS Chefs that I love, and more ghee, until it was extra crispy. I layered the lemony yogurt sauce over the hot sweet potatoes, followed by the lamb, and finally the cooked fennel with fennel fronds on top. It took barely any time at all, and it was the comfort food I needed. Hashtag sweetpotatoseason, ya feel me?Influence ThisI love voting not just because it's a right and a privilege but because my polling place is at a retirement home and I love a good senior-citizen chit chat like nothing else. I'm happy that we're all reminding each other to vote on Election Day (Nov. 6, set that alert!), but PSA that showing up at your polling place without knowing what's on your ballot is like showing up for the final without cracking a book. There are probably more races and measures than you realize on your ballot, so head to a site like Ballotpedia or BallotReady to see exactly what you'll see on Nov. 6. (That's next Tuesday, people.) Then do your research!Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleNote from a BoatBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Amanda Shapiro"]}