{"id": "3b2203a40b99b8951e82948d94a45ee6", "url": "https://www.bonappetit.com/story/the-top-gainesville-forever-spinning", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Top in Gainesvilles Was the Weird, Wonderful Restaurant Where I Always Wanted to Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Weird, Wonderful Restaurant Where I Always Wanted to WorkI waited six years to work in this weird restaurant with comically sad snowmen paintings on the walls and Trivial Pursuit cards lining the bathroom shelves.By Zoë SessumsJune 6, 2018FacebookTwitterEmailPhoto by Allison DurhamFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I have favorite spots and furniture: table 31—the tiniest two-person booth—and the carved brown bear lamp that would fit perfectly in an old lodge. I have favorite moments: the time Joaquin Phoenix sat at the bar and the time the power went out, transforming the dining room into a kind of romantic, hazy candlelit chaos. And of course, I have favorite foods: the blackened salmon, the roasted garlic and goat cheese spread, and every slice of cake. And there’s all the stuff in between: playing dice in a too-much-French-toast stupor, eating plantain chips out of my apron pocket, and the songs we all heard one too many times, like that terrible cover of “Love Will Tear Us Apart” and Harry Nilsson’s “Me and My Arrow.” The Top, in Gainesville, Florida, is my most familiar friend.The Top started off as a hole-in-the-wall called Footlights, which opened in a former five-and-dime store in the summer of 2000 and quickly became a social destination, a staple of the neighborhood. Surrounded by an incongruous mix of law firms, punk venues, and family homes, there was a little something for everyone—come one, come all. No matter how you figured into the Gainesville scene, you could find your night to go, your drink of choice, and your platonic ideal of a burger.Always something interesting to spot at The Top.\nPhoto by Allison DurhamA place to refuel after a long bike ride from the prairie. A place to celebrate a graduation from college. Somehow meaning everything and nothing at all, one of the restaurant’s taglines aptly summed up the glorious hodgepodge: Good Food, Good Folks, Good Times.While I was growing up, my family of five didn’t go out to eat more than a couple times a month, but when we did, it was always to The Top. At 11 years old, marveling at the choreography of dishes and the warm rapport between staff and customers, I knew I wanted to work there. I wanted to be the woman balancing plates along her tattoo-covered arms or the man in paisley-printed tops who refilled drinks with a confident smile. I wanted to hang around the host stand, whispering with my coworkers and marking table maps with waxy crayons. I wanted to work in a weird restaurant with comically sad snowmen paintings on the walls, where random Trivial Pursuit cards lined the bathroom shelves.The coveted hostess stand that I dreamed of working when I was 11.\nPhoto by Allison DurhamI applied for a job the summer before my senior year of high school and was told by the long-bearded front-of-house manager to come back when I was older.Following that first rejection, I moved away to go to art school, returning to The Top during holiday breaks to satisfy my cravings for sweet potato fries and that vegan chocolate layer cake with tofu frosting. After four years of heartbreak and student loan debt, I found myself back home with no degree to speak of, making the transition into adulthood in the town that raised me. I started spending late nights at The Top, listening to DJs spinning The Jesus and Mary Chain and Rihanna in equal measure. After all the changes I had gone through, it was always reassuring that the Top was still there. Its logo, that endlessly spinning toy, made sense. I knew it was time to put in another application.A constant crowd-pleaser: the macadamia-crusted trout.\nPhoto by Allison DurhamIt turned out that six years older was finally old enough, and I was hired. Predictably, it wasn’t as glamorous as I had imagined. I schlepped slop buckets down long hallways, picked plastic straws from planters, and learned to balance baskets of corn nuggets along my arms. I can no longer stomach those crispy nuggets filled with piping hot creamed corn—I served so many that the smell of them, and the creamy garlic dipping sauce that accompanied them, began to make me sick. (Still, you should try them!) I ate scraps of macadamia-crusted trout and mushroom ravioli off of discarded plates until I came down with flu-like symptoms on more than one occasion.But, in so many other ways, working at The Top was every bit as special as 11-year-old me imagined. Within a few months, I could describe all 13 burgers with an intimate closeness (don’t worry about the chile-espresso rub on the Widow Maker, you’ll love it). Every summer, my coworkers and I hid golden baby dolls (an accidental, unofficial kind of mascot) around the restaurant for an anniversary celebration scavenger hunt. Every Halloween, during an annual music festival called The Fest, we welcomed a horde of punks in black jeans to feast on tofu melts with seitan bacon to fuel up for more headbanging. In the five years I worked there, I fell in love with favorite customers and their orders, I made the kind of friends I’d jump in front of cars for, and I ate my weight in dessert—the bourbon chocolate torte, the peanut butter pie, and especially the carrot cranberry cake.I’m never not thinking about this peanut butter pie.\nPhoto by Allison DurhamAt a certain point, comfortable became too comfortable, and I knew that it was time to go. What I thought would be a pit stop ended up being nearly six years. Leaving The Top felt harder than moving away from Gainesville after high school. It felt like I was breaking up with dozens of people at once. Cleaning out my tiny cubby, I  thought about everything that I’d be leaving behind. I’d miss cuffing our resident multilinguist and karaoke king Woot’s shirtsleeves. I’d miss telling J-Rey, who got me through countless neverending brunch shifts, to meet me at the back bar for a juicy piece of gossip. I’d miss eating every broken or “too small to serve” slices of cake. But I knew I could always come back. And in a small way, I’ll always be at The Top. When I left, my coworkers hung my portrait right next to the dessert case. In a small way, I’ll always be at The Top.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Zoë Sessums"]}