{"id": "3b265bf9798697dab0a949f2c211a362", "url": "https://www.bonappetit.com/story/lessons-on-opening-a-restaurant-sara-deseran", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "10 Lessons for Opening a Restaurant From Tacolicious's Sara Deseran | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDear Restaurant Owners: Please Forgive MeA former food writer turned restaurateur repents.By Sara DeseranOctober 3, 2018FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailTake this open letter as my formal apology.If it were a video, it would start with me, hands clasped, eyes down, in a display of humility and repentance. Throw in the fiery backdrop of a Bible Belt billboard, because sometimes it does seem like the End is Coming. This industry I’ve found myself in is imbued daily with both rapture and peril.Let me introduce myself: I am a recovering San Francisco–based food writer who entered the world of restaurants in 2010 by way of marriage to my restaurateur husband. (Yes, I met him while on assignment.) Since then, despite having good sense, we have opened five outposts of Tacolicious in the Bay Area, arguably the toughest market in the country.During my 15 years as a magazine editor for San Francisco magazine, I wrote trend pieces and annually selected the city’s Best New Restaurants. I was never a star-slinging restaurant critic per se. But there’s no denying the power of any kind of press—demonstrated by the fact that people pony up $5,000 a month to keep a publicist on retainer. It can make a writer a little delusional. After 20 years of covering what seemed like every nook and cranny of the restaurant industry, I passed judgment blithely. I thought I knew what I was talking about.If this were a video, there would now be a dramatic pause. Then I would laugh hysterically. It turns out that there are some things you just can’t know until a restaurant is your livelihood and your life. Here are my top ten lessons learned.1. Openings are like birth. Your taco/omakase/Macanese/farm-to-table fantasy, which started as a twinkle in your eye, begins with drumming up names and envisioning how you’re going to dress it up and quickly dissolves into a gestation period of permits and health inspections. On the heels of writing a business plan and wining and dining investors to raise (beg) for the million-plus to open a restaurant, you juggle architects, contractors, electricians, plumbers, and crazy landlords. Things for which you’ve had no training. In San Francisco you shell out around $300,000 for a liquor license and negotiate with NIMBYs who fight you as if you’re building a nuclear power plant instead of a restaurant patio. It’s like having a baby: You carry that thing for nine months and then defy all pain thresholds to push it out into the public. Hopefully on the day its born you have an epidural or a few shots of tequila.2. Practicing is not an option. Most restaurants don’t have enough money to do mock service for more than a few nights. Which means on opening day, your staff—from cooks to servers—are just getting to know the recipes, the table numbers, each other’s names. They’re actors performing a play when they’ve just received the script. Chaos is inevitable. It’s also inevitable that Yelpers/critics/bloggers/my former self are all in a mad dash to report on the latest opening. They will come in to dine and feel it is their duty to their fellow foodie citizens to write something that will live forever on the internet about the fact that your two-week-old baby restaurant was misbehaving and screaming its head off. One star.3. Stars matter. Particularly on Yelp. Studies show that sales can increase by 5-9 percent with an additional star. You start to regard Yelp like a horror show, hands over the eyes, never knowing where a killer is lurking. Also, influencers—those impossibly dewy, calorie-impervious smiling girls wrapping their mouths around a triple doughnut burger—with their 2 million Instagram followers matter too. They come with promises that their emoji-blinking boomarang of your margarita will garner your restaurant more followers and more fame. Every other day you will get an email from one asking to “collaborate” with you. For free food and a sum of money.4. Making great food isn’t the half of it. If your favorite art-project of a restaurant closes, be sad but don’t be surprised. Unless it’s funded by a billionaire, a restaurant’s longevity has little to do with ’grammable cement tiles, gold die-cut pasta, or a live-fire menu. Nor can it be measured by a line out the door or a feature in a glossy food mag. It’s a business equation. Restaurants run on wafer-thin profit margins—the national average is 3 to 5 percent—and the key to keeping the doors open means maintaining an iron grip on overhead and costs. Monitoring staffing, taking a monthly inventory of your bar, budgeting for equipment repairs, and negotiating the price of your janitorial crew—all things invisible to the diner—are the kinds of things that keep the bills paid. It’s not sexy stuff, which is why it’s not part of the restaurant-dream narrative; ratings would not go up if Top Chef contestants were challenged to find the best deal on toilet paper.5. A lot is out of your control. Particularly the weather, which you monitor obsessively. Restaurant owners pray for sun because people go out for margaritas when it’s 80 degrees. When it’s cold and rainy, they stay home and make pot roast. And since 28 percent of our seating is on our patios, the weather can determine a night’s profits. On a sunny day, or during the horrendous 2016 drought, diners flock to the outdoor tables. In contrast, this August was one of the foggiest in San Francisco’s history and our sales dipped by 20 percent. Other outside factors that impact our business: national holidays, Warriors games, and Burning Man.Kitchen staff making tacos at Tacolicious's Chestnut location.\nPhoto by Aubrie Pick6. A labor shortage + millennials = the perfect storm. Restaurants across the nation are experiencing a labor crisis, making retention a challenge. In San Francisco a server or cook can quit one job and get another in a hot second. Add to this the fact that 20-somethings, who make up a lot of our workforce, are part of a generation that wants “work-life balance.” It doesn’t seem to matter that servers at our restaurants can make $15 an hour plus $200 a night in tips. Last minute, dog-ate-my-homework call-outs are typical and result in operational chaos. And if Iyengar calls a server to go do yoga instructor training at an ashram in India, he knows he can have his job back the minute the soul searching is done because the labor pool is a mirage and we are thirsty.7. Delivery is a blessing and a curse. According to a National Restaurant Association study, by 2020, 70 percent of customers will be ordering food off of restaurant premises. The likes of Caviar and DoorDash can be a financial boon despite the fact that their service charges to restaurants start at 30 percent. They can also cause drama: An unwitting diner walks in the door to a quiet dining room, which gives the impression we’re twiddling our thumbs in back. In truth, the kitchen staff is madly assembling a 100-taco delivery, the order received 20 minutes earlier. Meanwhile, a pissed-off Caviar driver is standing in the doorway, his car is double-parked in our pissed-off neighbor’s driveway. The diner’s salad takes forever, and now he’s pissed off enough to go home and post something poetic on Yelp like “Service so slow and inattentive I entered as a young man and left as a weathered, sad old soul.” Two stars. (Yes, this is a real quote.)8. Booze will spice things up. Restaurants might be one of the few jobs that include an unlimited supply of alcohol. Thus, no matter how strict your policies, you will look on your security camera at some point to see your staff after hours dancing on the bar. A lot of things will happen while people, diners included, are drunk. Let’s not talk about the state of the bathrooms.9. Your food will never be perfect. Consistency is everything, but it’s purely aspirational. You can have all the recipe bibles, how-to pictures, and in-depth training, but your food quality will ebb and flow. Because cooks have arguments with their loved ones and accidentally over- and under-salt. They have days when they’re on and when they’re off. Unlike servers who are tipped to work better and more quickly, a cook’s main motivation is pride. They are human and not robots.10. On the good nights you will totally forget the first nine things on this list. The nights when your restaurant is in the zone—when everything is whirring and humming like you envisioned when you wrote that business plan. The swinging kitchen door opens and the cheery sound of banda and the patter of knives on a chopping board intermingle with the murmur of happy diners ordering a second round of cocktails. They are celebrating birthdays and friendships. It feels like you’re throwing the most epic party in your own house, that you are contributing to the joy of life. On those nights, owning a restaurant might just be the best thing on earth. In fact, it’s often enough to make you and your husband forget the pain of birth enough to look at each other lovingly and say, “Hey babe, let’s have another one.”San Francisco–based food writer Sara Deseran started Tacolicious with her husband Joe Hargrave in 2009. Today they have five locations in the Bay Area. And yes, they're planning to have another.Explore Bon AppétitRestaurantsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Sara Deseran"]}