{"id": "3b266573c286b9ef5feb51cae5140a6a", "url": "https://www.bonappetit.com/story/50-dollar-brunch-party", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "A $50 Brunch You Can Make Even When You’re Extremely Hungover | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA $50 (Kinda) Brunch You Can Make Even When You’re Extremely HungoverFor all those times when you accidentally drunkenly invite ten people over. (It happens!)By Amiel StanekMay 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe’ve all been there! You’re having a particularly excellent Saturday night out with friends. It’s late—too late!—and after some drinks—too many drinks!—a certain sneaking malaise starts to sink in. Do we really all have to stop hanging out? How could that be?? At this impulsive moment, you make a well-intentioned but ill-advised proposal: “Why doesn’t everyone come over to our place for brunch tomorrow?!”Fast forward nine-ish hours later. You’re wallowing in bed, disoriented, nursing a real asshole of a hangover, when you start getting The Messages. “What time should we come over?” “Hey, is it okay if my sister comes over too?” “So excited for brunch, what can I bring?” What have I doooooooone? you think to yourself. I’ll tell you what you’ve done. You’ve invited ten people over to your house for food that you haven’t bought and that you haven’t cooked.As a person who finds himself in this sort of situation embarrassingly often, my fiancé, Lauren, and I have developed a no-fail strategy for getting out of this mess and feeding everybody you promised to feed. Big pot of rice. Soft-boiled eggs. Some other kind of protein. A few simple vegetable dishes. Kimchi. Done. It’s a spread substantial enough to dull hangovers but light enough that it won’t send anyone crawling back to bed. And, most importantly, you can pull it all off  a handful of pantry ingredients and a few things you can pick up at the store, all without breaking $50. Let’s do this.Le Menu:Easy GomaeJammy EggsMaple-Sriracha Glazed BaconCrushed Cucumbers and RadishesKimchiSpicy Grapefruit ShandyYou’ll Need:2 lb. frozen whole-leaf spinach¼ cup raw sesame seeds2 lb. bacon (about 40 slices)4 cups grapefruit juice, preferably fresh¼ cup pickled ginger4 cups short grain white rice2 dozen eggs16 oz. jar kimchi10 Persian cucumbers15 radishesAssuming You Have:Low-sodium soy sauce or tamari (at least ½ cup), unseasoned rice vinegar (at least ½ cup), maple syrup (at least ¼ cup), mirin (3 tablespoons), Sriracha, kosher salt, freshly ground black pepperAsk Your Friends to Bring:A bag or two of iceCheap beerWineBubble, Bubble, Toil, and TroubleBefore anything else happens, get a big ol’ pot of salty water on the stove and turn the heat on high. This is pretty much always a good idea, even when you aren’t sure what you’re going to cook. It always takes longer than you think for water to come up to a boil, and gives you plenty of time to take stock of your fridge and pantry, figure out what you’re going to cook, and procure any necessary supplies. All good? Good.Frozen spinach: always there for you.\nPhoto by Alex LauNow that you’ve got a pot of water boiling, blanch the spinach for gomae. Usually, this Japanese side dish is made with blanched fresh spinach, but we’re using frozen spinach—whole leaf, not the chopped up stuff—for a few reasons. One: Fresh spinach is a pain in the ass—the mature stuff is dirty and always needs to be washed, and the baby stuff is expensive and shrinks down to nothing when you cook it, not good for a crowd. Two: Haters gonna hate, but frozen spinach is a Good Food—it’s picked at the height of freshness, blanched, flash frozen, and ready to go whenever you are. Dump the contents of one 16-oz. bag of frozen whole leaf spinach into the boiling water, let it go for about a minute, and then use a spider or slotted spoon to transfer it to a waiting sheet pan. Repeat with the second bag of spinach. Spread the cooked spinach out in an even layer and pop the whole thing in the fridge to chill.Photo by Alex LauProgress is being made. Now, while you still have all of that boiling water going, it’s time to cook some eggs. Does that spinach-y water look kind of gross? Yep! Would someone better credentialed or more fastidious dump out that water and boil fresh water to cook eggs? Probably! But if you ask me that would be a big fat waste of time and water. The eggs come in shells for a reason, people! Working in two batches of 10, boil 20 eggs for seven minutes—you want the yolks slightly past jammy—transferring them to a bowl full of ice water. Once they’ve had five or so minutes in the ice bath, peel all of the eggs, transfer them to a pot, and set it aside for later.Everything RiceBefore you forget: Make the rice! Assuming you have a rice cooker or an Instant Pot or similar device, I always find it better to get the rice cooking over with sooner rather than later and leave it on the “warm” setting until people sit down. For a group this size, 4 cups of short grain white rice should do the trick. If you don’t have one of these magic machines, it’s probably better to wait until a half an hour before your guests sit down to cook the rice. And if you’re the kind of person who gets really anxious about cooking rice, well, you can either A) have a friend pick up two or three quarts of cooked rice—chopstick-ready, not fluffy—from a restaurant on their way over, or B) find a different menu. Let’s move on!Crushing vegetables is one way to get out some hangover aggression.\nPhoto by Alex LauPositively Smashing!Onward! The crushed cucumber-radish situation we’re making is not quite a quick pickle, not quite a salad, but is probably the easiest veggie side you could make and extremely delicious—and you don’t even need a knife. Well, okay, that last part isn’t totally true, but you barely need a knife. Wash and trim the tops and tails from about 15 radishes , then, one at a time, place each radish on a cutting board and smash it with the bottom of a skillet or some other heavy object. Pull each one apart into bite-sized pieces and place in a colander. (Satisfying, no?) Then do the same with 10 Persian cucumbers. Hit the crushed cuke-radish mixture with two big pinches of kosher salt, give them a toss with your hands, place the colander over a bowl while you do other things—this helps to get some water out of the veggies.Photo by Alex LauOnce a bit of liquid has drained, pour it out, then transfer the cukes and radishes from the colander to the bowl. Hit them with a big splash of unseasoned rice vinegar (you can kind of use any vinegar here), another pinch of salt, and a few grinds of black pepper. Taste it—it should be on the edge of too-salty and very acidic, like a pickle—and adjust seasoning as needed. And there you have it folks! Set aside until you’re ready to serve.Photo by Alex LauTime 4 BaconWhat’s better than bacon? GLAZED BACON. This is a great party trick, because making bacon with a fun, hyphenate antecedent like “Maple-Sriracha Glazed” is actually as easy as cooking regular bacon, but nobody has to know that. Preheat the oven to 400°F. Cover two sheet pans with tin foil—not necessary, but it makes cleanup a hell of a lot easier—and arrange 2 lb. bacon slices (about 40 slices in all) in a single layer on the sheet pans. (They’ll probably overlap a bit, which isn’t a big deal; bacon shrinks up when it cooks.) When the oven gets up to temperature, get the sheet pans in there and let them go for 16-18 minutes, rotating the pans halfway through, until the bacon is cooked but not yet crispy, then take the bacon out and leave it until you’re closer to serving. In the meantime, you can get your glaze ready: In a small bowl, whisk together ¼ cup maple syrup, 1 tablespoon soy sauce or tamari, and 1 tablespoon Sriracha, and set it aside for later.Finish the GomaeRemember that sheet pan of spinach in the fridge? Take it out and, one small handful at a time, squeeze out as much liquid as humanly possible from that spinach. This step is crucial—the more water you get out of the spinach, the better it will absorb the tasty dressing you’re going to make. Squeeze! Squeeze! Squeeze! Then break apart the tight, dry ball of spinach and put it in a big bowl.Photo by Alex LauPhoto by Alex LauThe sesame dressing: In a small skillet over medium-low heat, toast ¼ cup raw sesame seeds, shaking the pan occasionally, until they’re lightly browned and fragrant, about 4 minutes. Transfer the toasted seeds to a small bowl and let them cool for a couple of minutes, then transfer them to a Ziploc bag and squeeze out as much air as possible. Place the bag on a flat surface and use a wine bottle or other smooth, heavy thing to crush the sesame seeds slightly—you want a nice mix of powder and whole seeds. (Traditionally, you’d use a mortar and pestle to crush the sesame seeds, which you should go ahead and do if you’re the kind of person who has a mortar and pestle.)Photo by Alex LauPour the seeds out of the bag and back into that small bowl, and then whisk in ¼ cup soy sauce or tamari, ¼ cups unseasoned rice vinegar (you could use white vinegar or white wine vinegar instead), and 3 tablespoons of mirin (a splash of white wine or cooking wine would do in a pinch). Et voila: dressing! Pour it over the squeezed-out spinach and toss it all with your hands to combine, breaking up any clumps of spinach as you go. Taste and add another splash of vinegar or soy if it needs it, and transfer to a platter.Photo by Alex LauGreens! Greens! Greens!\nPhoto by Alex LauSpecial Beer SplasherOkay, last thing, PROMISE! This grapefruit-pickled ginger drink is amazing, and has the power to transform cheap beer from something that tastes like bread-flavored seltzer into a refreshing, tangy, fancy-seeming cocktail. (It would taste great in actual seltzer, too.) Chop up ¼ cup of pickled ginger as finely as possible and put it in a pitcher or large jar along with ¼ cup of the juice from the pickled ginger jar. Add 4 cups of grapefruit juice, a small pinch of salt, and 20 grinds of black pepper and stir it all up to combine. Give it a sip. It should have a sweet-tangy balance, with just enough black pepper-kick; adjust with a splash of vinegar and more black pepper if needed, and stash it in the fridge for later.Take a Mo’You’re pretty well set up—everything else you have to do to finish this thing needs to happen in the last half hour or so before everyone sits down to eat. Take some Ibuprofen. Take a shower. (Unless you, like me, feel more hungover after a shower for whatever reason.) Pull on some pants. Clear the table of the fried chicken you forgot you ate last night and then set it with bowls and utensils and stuff like a G-D Adult. Do ya thang.Photo by Alex LauBring It All HomeHome stretch, friends! Put a kettle of water on to boil. Transfer the 16-oz. jar of kimchi into two small bowls and set that on the table along with the cuke-radishes and the gomae. When the water is boiling, pour it over the peeled eggs so that they’re nice and warm when people arrive. Flip the strips of bacon over, then brush each one with the glaze and pop the sheet pans back in the oven for 10-15 minutes, rotating halfway through, until they reach your ideal degree of crispiness. Leave the sheet pans on top of the stove so they stay warm, then transfer to a couple of plates right before serving.Photo by Alex LauPhoto by Alex LauWhen your first guest arrives, pour them a beer cocktail: Fill a tall glass with ice, fill three quarters of the way with beer, and then fill it the rest of the way with that grapefruit-pickled ginger business (stir it first, since the solid bits will settle to the bottom). When they take a sip and declare the cocktail “Delicious!” say to them, “Congratulations! You are now the Beer Cocktail Ambassador! Now help everyone else make one when they arrive!” A true honor.Photo by Alex LauWhen a critical mass of guests have arrived, slice the eggs in half, arrange them on a platter, and season with salt and pepper. Take that to the table along with the bacon. Bowl up some rice. Double check that everything that needs a serving utensil has a serving utensil.Then ring the M-F brunch bell, because it is tiiiiiiiime tooooooo diiiiiiiiiiine! DING A LING DING!Photo by Alex LauThere you have it, folks. You did it. Give yourself a pat on the back, pour yourself a cocktail, and let someone else do the dishes.Photo by Alex LauGet the Recipes:Easy Gomae (Japanese-Style Spinach Salad)This gomae recipe has a simple soy-sesame dressing that makes it a versatile side dish for whatever else you’re cooking.View RecipeMaple-Sriracha Glazed BaconSweet. Spicy. Bacon. What’s not to like?View RecipeSpicy Grapefruit ShandyThis sweet-tangy mixture transforms even the cheapest beer into a refreshing party-worthy cocktail.View RecipeExplore Bon AppétitBrunchWeekend BrunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Amiel Stanek"]}