{"id": "3b28d7a4e85c8e89782199cd36a53c28", "url": "https://www.bonappetit.com/story/camping-kitchen-gear", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "All the Camping Kitchen Gear You Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Camping Kitchen Gear You NeedAnd some you don't, but whatever.By Alex BeggsJune 3, 2021FacebookTwitterEmailPhoto by Julian Cousins, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JaimeFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In my basement there’s a big plastic tub labeled “CAMP STUFF” always at the ready. That way I never forget a bottle opener, a tiny container of salt, or my designated Negroni Nalgene. Cooking while camping can be minimalist—bring a bucket of Popeyes, call it a day—or maximalist (once we slow-grilled a lamb shoulder?!?!!? Kind of amazed we didn’t attract a bear). Either way you’re going to need some eating and cooking gear. Here’s what you need to get started.Camp stoveYou could cook everything over the fire, but sometimes coffee can’t wait for the kindling to catch. Eureka’s camp stove is lightweight, adorable, classic.Ignite Camp Stove$110 at Eureka$115 at AmazonFoldable grillMy favorite way to cook while camping is on this foldable grill by Breeo that can adjust up and down. We slow-roasted the aforementioned lamb on it, ate chicken wings right off it, and percolated coffee on it.Breeo Outpost 19 Grill With Bag$140 at BreeoNesting potsAt most you’ll need a pot (to boil water, this one has a built-in strainer) and a pan (scrambled eggs, pancakes), and these nest into each other nicely. Escape Pot + Frypan$80 at ZolaThe everything mugOne insulated tumbler does it all. Wipe it out after each use—you won’t have to worry about your wine tasting like Honey Bunches of Oats.YETI Rambler 10-Ounce Wine Tumbler$25 at YETIThe Negroni NalgeneBring the Nalgene that best fits your personality, but look, this one glows in the dark!Jessica LimPARKS Glow in the Dark Water Bottle$20 at Parks ProjectPlatewareSplatter enamelware is classic; can’t go wrong.GSI Outdoors Pioneer Table Set$70 at Amazon$70 $56 at MoosejawLong tongsFor cooking and moving logs around. Necessary. 16\" Heavy Duty Stainless Steel Utility Tongs$6 at AmazonCollapsible side tableIf all you want to eat while camping is a cheese plate and a good baguette—not a bad way to do it—you’ll still need a side table (or a convenient tree stump). This tie-dye one is super lightweight, packs into a tiny bag, and stretches taut to safely hold your drink. Don’t sit on it. Helinox Table One Camping Table$140 at Backcountry$140 at MoosejawRefillable water jugIf your campsite doesn’t have drinking water, bring a big refillable container like Reliance’s 7-gallon Jumbo-Tainer. It should last four people a long weekend in the woods and you can always refill it at a rest stop. It has a handy handle and spout and its flat shape will fit easily under your car seat.Reliance 7-Gallon Jumbo-Tainer Water Container$32 at Target$26 at WalmartHard coolerDoubles as a side table or extra seat if you need it. Do I even need to mention a brand here? You have one already. If not: YETI or bust.PHOTO BY TED CAVANAUGHYETI Tundra 35 Hard Cooler$600 at Amazon$250 at BackcountryCoffee, coffee, coffeeYou’ve just slept on hard ground and you need coffee as quickly as possible. Instead of lugging a French press or percolator into the woods, bring cold brew concentrate or, for a crowd, La Colombe’s cold brew box. Water it down and heat it over the stove, or drink it on ice. Trying to pack lighter? Alpine Start's Instant Coffee does the trick.Cold Brew on Tap Fridge Pack$34 at La ColombeWineBig-batch cocktails are a good idea. So is filling an XL insulated thermos with designated cocktail ice. Boxed wine is getting better and better, and the best place to drink it is in the woods, when you don’t want to be weighed down with glass bottles. A 3L box of Herisson Vin Rouge is the equivalent of four bottles and it’s a bright, acidic Gamay blend that pairs well with unwashed hair and howls in the night.Herisson Vin Rouge 3L Box$35 at Dandelion Wine Shop$35 at Fresh DirectDish stuffThis collapsible sink is game-changing. You can use it to haul kindling too. Bring an old kitchen sponge, Dr. Bronner’s (it’s biodegradable), and a ratty old towel to dry with. Also remember you don’t really have to wash everything. A rinse and a wipe will do the trick. You’re in the woods!UST FlexWare Collapsible Sink$26 at Amazon$20 at TargetHeavy-duty aluminum foilYou don’t even need plates if you make foil packets in the fire for dinner. But bring the heavy-duty foil, not the normal stuff, so it’ll hold up without risk of tearing.Heavy-Duty Aluminum Foil$10 at Target$10 at AmazonThe kitchen Dopp kit Fill this bag with the small guys: a few beat-up steak knives and one decent chef’s knife; a cheap plastic cutting board from T.J. Maxx; matches!!!; garage sale cutlery, Nalgene minis —they never leak—filled with olive oil, vinegar, soy sauce; a multi-tool you’ll use constantly; and a 1-oz. container with flaky salt or your favorite spice mix.Cooking Kit Bag$80 at Blue Ridge Overland GearExplore Bon AppétitShoppingCampingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-28", "author": ["Condé Nast", "Alex Beggs"]}