{"id": "3b2b6577d08124e9f44b44e0f7f65868", "url": "https://www.bonappetit.com/recipe/anytime-chocolate-chip-and-oat-cookies", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Anytime Chocolate Chip and Oat Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueAnytime Chocolate Chip and Oat CookiesBy Claire SaffitzAugust 18, 20204.4(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis dough is optimized for getting portioned, frozen, and baked right from the freezer, so you are never more than 25 minutes away from a warm, gooey cookie. We couldn’t help working in oats, whole grain flour, and nuts and seeds for maximum texture and flavor.IngredientsMakes about 22½cup chopped pecans or walnuts½cup raw seeds (such as pumpkin, sunflower, sesame, flaxseed, and/or hemp)¼cup unsweetened coconut flakes1cup (125 g) all-purpose flour⅔cup (83 g) whole grain flour (such as buckwheat, spelt, or rye)1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1¼tsp. baking soda1½cups (packed; 300 g) light brown sugar1cup (2 sticks) unsalted butter, melted, slightly cooled2large eggs, room temperature1Tbsp. vanilla extract8oz. semisweet chocolate, coarsely chopped, or 1¼ cups semisweet chocolate chips or wafers (disks, pistoles, fèves)1cup old-fashioned oatsPreparationStep 1Place a rack in middle of oven; preheat to 350°. Toast nuts on a rimmed baking sheet until slightly darkened in color and fragrant, 6–8 minutes. Transfer to a plate and let cool.Step 2Meanwhile, spread out seeds and coconut on same baking sheet and toast until seeds are slightly darkened in color and coconut is golden, about 5 minutes. Let cool on baking sheet.Step 3Whisk all-purpose flour, whole grain flour, salt, and baking soda in a medium bowl to combine. Vigorously whisk brown sugar and butter in a large bowl until very thick and smooth, about 30 seconds. Add eggs and vanilla; whisk vigorously until mixture is light and satiny, about 30 seconds. Add dry ingredients and whisk until completely incorporated and batter is smooth. Fold in nuts, seeds, coconut, chocolate, and oats with a rubber spatula until thoroughly distributed.Step 4Using a 2-oz. scoop or ¼ cup measuring cup, portion out dough, placing on a parchment-lined baking sheet as you go and spacing as close together as possible (it’s okay if they touch slightly). Cover tightly with plastic wrap and freeze until frozen solid, 2–3 hours. (If you can’t wait for cookies to freeze, chill in refrigerator just until firm instead, at least 30 minutes and up to 3 days. Cookies might bake a minute or two faster.)Step 5If needed, reheat oven to 350°. Arrange up to 8 cookies on a large parchment-lined baking sheet, spacing at least 2\" apart. (These cookies are large and will spread, so use another baking sheet if baking more than 8 cookies and place racks in upper and lower thirds of oven.) Bake, rotating baking sheet front to back (and top to bottom if using 2) halfway through, until deep golden brown and wrinkled around the edges (centers should still be pale and slightly shiny), 16–20 minutes. Let cool on baking sheet.Step 6Do Ahead: Dough can be made 2 months ahead; transfer frozen balls to an airtight container and keep frozen. Cookies can be baked 3 days ahead; store airtight at room temperature.How would you rate Anytime Chocolate Chip and Oat Cookies?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleDelicious! Froze half the batch in balls ready to throw in the oven - it worked only that mine didn't spread out large like the fresh batch did. I baked at 350 and about 18 mins...Still no complaints!Anonymous1/18/2022The 30 sec recommended whisking time must be for a stand mixer - that should be specified. Started off whisking completely by hand and had to switch to a hand mixer, with 2 mins+ whisking per step. Perhaps my butter was too cool? I did about 2-3 tbsp per cookie rather than the giant 4 tbsp recommended: ended up with 30 dough balls. Subbed half dark brown sugar due to not having enough light brown - the cookies turned out darker than BA's pic, but not burnt. Used a mix of sesame seeds, hemp hearts, and pumpkin seeds - don't feel the sesame/hemp add much taste so I'd go for mostly pumpkin seeds next time. With how many things need chopping and toasting/cooling - best make the full-size big batch to make the time worth it.sydneyBrooklyn, NY8/23/2021These cookies are sensational. I love everything about them. The crisp of the toasted seeds, the caramelised coconut, the chocolate chip surprise. Have made them twice since finding the recipe, I made some for my neighbours who were all asking after the recipe and loved them. Alicia London, UK4/7/2021Made another batch, this time I put the batter in the freezer first, and left them in the oven for less time than before. THEY WERE PERFECT! Gooey in the middle and moist but crumbly, perfect consistency. Would deffo make again like this and maybe swap out some of the ingredients to experiment too.TashaLondon3/13/2021I'm not sure if I did something wrong but the texture is not how I imagined. Taste good but quite dry and crumbly, not chewy as I would have hoped. The chocolate chips are too sickly but that's my own fault as I just used regular ones, as I don't think we have such a thing as 'semi sweet' choc chips in the UK. I like the ingredients in this cookie a lot though, think I'll try again with some adjustments! TashaLondon, UK3/5/2021the only cookies I will be making!! these are amazing. so yummy. I dont like putting them in the fridge too long I like them thinner and chewy. Anna WardSan Clemente, CA2/7/2021This is the 2nd weekend in a row I'm baking these. They're a hit w/ my bf who isn't big on sweets / pastries. My neighbors loved them and I can't stop reaching into the cookie jar. Just froze my next batch to have them at the ready whenever that craving kicks inAnonymousLos Angeles, CA1/29/2021So quick and easy.  Used whatever I had on hand:  buckwheat and oat flour and rather large rough cut chunks of 72% dark chocolate and pecan halves, pistachios, sunflower seeds, large coconut flakes. No chopping. And reduced the amount of sugar by about a 1/4 cup.  Did not refrigerate for more than 10 minutes (in a rush to have this ready for a dessert treat.   What finally came out of the oven was a delicious rather heathy and large, crispy cookie.  This is going in my regular rotation!AnonymousCalifornia12/8/2020These are amazing! I made with spelt flour, pumpkin seeds, sunflower seeds and walnuts. The first time I baked these, I didn't want to wait for the dough to freeze so I refrigerated a few of them for 30 mins then baked for 12 and they were perfect. Now I have a stash in the freezer and I always will! I love that you can bake just a few or enough for a group. AnonymousUtah10/29/2020Made these exactly as written here (following gram measurements) and they are delicious!! Used buckwheat flour and a combo of pumpkin, sesame and poppy seeds. They're a little oilier than I would like, so next time I might cut back a bit on the butter. I love the variety of textures here, and all of the flavours work beautifully together. Having bags of these in the freezer has changed my life! I never want to be without them. A great recipe. <3AnonymousMontréal10/6/2020Fantastic cookie. Making it again now. Not too sweet and a variety of textures. This is now one of my go tos. laddisSalt Lake City 10/4/2020To the Dane who can't figure out cups, ounces and teaspoons...two things, 1) You're reading an American publication. Those are the units of measurement we use. I wouldn't start complaining about metric measurements if I was reading a recipe in Copenhagen Cooking Monthly. 2) To help you in the future with your conversion issues there's a brand new invention called Google where you can type \"cups to grams\" and a converter magically appears on your screen.AnonymousTexas10/3/2020made this recipe using the buckwheat flour and pumpkin seeds. i didn't have any pecans/walnuts so  i used cashews instead (after tasting, seems like you could use any nut really). the only problem i encountered was that the dough was super runny BUT i tried refrigerating the dough for 15 minutes, and then formed them into balls / popped into freezer. they were SO good! really chewy, not \"healthy-tasting\" at all (probably because they aren't healthy). will definitely make again.Anonymoustoronto9/30/2020grams, please! no one outside of the US use these nonsensical, illogical measurements:-):-) looks delicious though!AnonymousDenmark9/29/2020I didn't see any replies to any of the questions on the quanity of ingredients measurements.... not going to try them until I know what is what.   Reply please?\nfrozenmuklukYellowknife, NT canada9/23/2020Explore Bon AppétitCookieDessertAmericanOatRice & GrainsChocolateOther IngredientsSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Claire Saffitz"]}