{"id": "3b45c0e2ae0b3b27994a4e2fdcc2e8a4", "url": "https://www.bonappetit.com/recipe/spicy-and-creamy-slaw", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Spicy and Creamy Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSpicy and Creamy SlawBy Andy BaraghaniAugust 18, 20205.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis super-flexible, all-purpose salad turns cabbage into luscious tangles of crisp leaves generously coated in a rich and bright dressing. It is guaranteed to go with any and all grilled foods, meaty mains like fried chicken, and hoagies that require two hands. Serve it right away or let it sit overnight—it’s good either way.Ingredients6 Servings½small red onion or 1 medium shallot, thinly sliced3Tbsp. apple cider vinegar or white wine vinegar½–1serrano chile or jalapeño, thinly sliced into roundsKosher salt, freshly ground pepper1small garlic clove, finely grated½cup plain whole-milk Greek yogurt or mayonnaise2Tbsp. extra-virgin olive oil1tsp. finely grated lemon zest1Tbsp. fresh lemon juice1medium head of savoy or green cabbage (about 2 lb.)½cup chopped dill or parsleyPreparationStep 1Combine red onion and vinegar in a small bowl; add ½–1 chile, depending on the heat of your chile and your preference; season with salt and pepper. Let sit 10 minutes. Whisk in garlic, yogurt, oil, and lemon zest and juice; set dressing aside.Step 2Cut cabbage in half through core. Remove core; discard. Tear leaves into 2\" irregular pieces and place in a large bowl. Season with salt and massage and scrunch firmly with your hands for a minute or so to soften. Pour reserved dressing over cabbage and toss with your hands to coat. Season with more salt if needed (cabbage can take a good amount of salt).Step 3Toss in dill just before serving.Step 4Do Ahead: Dressing can be made 12 hours ahead; cover and chill. Slaw (without dill) can be made 1 day ahead; cover and chill.How would you rate Spicy and Creamy Slaw?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleGreat summer salad.\nUse 2 Caraflex cabbages\nSubstitute a handful of scapes for the garlic.\nSoak the onion, chilli,garlic mix overnight to mellow the flavours\nUsed 1/4 cup Greek yogurt and 1/4 cup sour cream. Made a nice tangy salad.johnnyontario7/4/2021THIS is the salad I want to eat all summer long.  I make it with vegan mayo to turn this recipe vegan and it is just the most refreshing thing ever on a hot day.  I never would have thought to treat cabbage like you would kale in a salad by tearing it and massaging it.  I've made this with regular green cabbage and it works just as well.  I could eat the entire bowl in one sitting.  SO GOOD!Alyssa M.Bay Area, CA6/13/2021Dressing was a bit too rich imoAnonymous12/30/2020This salad is so good! I made it with mayo instead of yogurt and omg it was amazing! Perfect tangy and spicy! Highly recommend and will be making it again soon!Safa AToronto, Ontario 12/25/2020Explore Bon AppétitSlawSaladCabbageLeafy GreensVegetableSerrano ChileChileDillHerbs & SpicesParsleySummerEasyQuickSideVegetarianGluten-FreeNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Andy Baraghani"]}