{"id": "3b5c3c1d92c237d57cb6ea47b7b091f3", "url": "https://www.bonappetit.com/story/goodbye-to-andrew-knowlton", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "A (Kind Of) Goodbye to Andrew Knowlton | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA (Kind Of) Goodbye to Andrew KnowltonAfter 18 years at Bon Appétit, our deputy editor is moving on.By Adam RapoportMarch 20, 2018FacebookTwitterEmailPhotos Courtesy of Andrew Knowlton; Vincent Cross (Katz's)FacebookTwitterEmailA few years back Andrew Knowlton and I were in Chicago at Avec, trying to decide what to order. Actually, check that. Knowlton was telling me what we’d order.“We’ll get the chorizo-stuffed dates because you can’t not. Maybe we’ll try that seasonal shaved salad. The braised lamb’s neck. And I’m going to order this orange wine you’re probably not going to like, but we’ll get it anyway. Just trust me.”Now, normally, I can be kind of controlling when it comes to dining out. But this was one of many moments over the past seven years when I just sat back and reached for my cocktail. I’d been out with Knowlton enough times to know better than to interfere. As the deputy editor of this magazine and its chief critic, he approaches restaurants with the kind of studied exactitude of some old-timer baseball scout.Shortly after sitting down, he’ll pull out his notebook and jot down a bunch of…I’m not exactly sure what. He eagerly engages bartenders, asking about this tincture or that bottle of amaro. He’ll set servers on their heels, quizzing them on the specials.In our industry there are people like me—who like to think they know what they’re talking about—and there are people like Knowlton, who make it their job.Not that I always appreciated this fact. When I took over as editor in chief of Bon Appétit in 2011, Condé Nast had just moved the magazine’s editorial operations from L.A. to New York. I was tasked with rebuilding the brand. And Knowlton, who was already based in New York and had been with the magazine for 11 years, had the unenviable chore of having to lobby to keep his job. Figuring we ought to have at least one person on staff familiar with Bon App’s DNA, I decided to keep him.Perhaps Knowlton's greatest contribution to BA: His grandmother's pimiento cheese recipe.\nPhoto by Laura MurrayIt didn’t take long for me to realize how lucky I got. Knowlton wasn’t just aware of the magazine’s DNA; he was its DNA.Since 2011 he has been that guy on staff we all turn to. Again and again. Unsure of whether a budding trend is really a trend, we just ask Knowlton. Can’t find a contact for that chef we want to cover in the magazine? “Ask Knowlton.” Wait, should we even be featuring that chef? “Ask Knowlton.”A few months ago he took me out to lunch. We grabbed seats at the bar, and then there was an awkward pause. He gave me that look—the one that any boss is regretfully familiar with. With a remorseful smile, he simply said, “It’s time for me to go.”I sighed. Selfishly. Knowlton has been at Bon App for 18 years. He captained our Hot 10 Best New Restaurants issue for the past seven. Before that he was The Foodist (a dorky name, yes, but a great column). And for too long, he allowed all of us—especially me—to not do our jobs. I can’t tell you how many chefs I haven’t reached out to or restaurants I should’ve gone to but didn’t because I figured: Knowlton’s got it.He and his wife and two daughters are moving to Austin, where they can get all those things they can’t have in Brooklyn: a house, a yard, a grill, and really good breakfast tacos.He will continue on as an editor at large for Bon Appétit. And he’ll steer this year’s Hot 10 package. But if we need a random restaurant question answered at, say, 2:45 p.m. on a Tuesday, well, we’re on our own. He’s been prepping us for this moment since we relaunched the brand. We just didn’t know it.Read some of Knowlton's pieces:A Short History of My Long Drinking LifeI’ve learned to respect drinking, the craft of it, the camaraderie of it, and the importance of it in my life.View StoryWelcome to Hillstone, America's Favorite RestaurantView StoryWhat It's Like to Work at the Waffle House for 24 Hours StraightView StoryAnd watch him work 24 hours at Katz's:Explore Bon AppétitAndrew KnowltonLetter From The EditorRead MorerestaurantsWelcome to Hillstone, America's Favorite RestaurantBy Andrew KnowltonPhotography by Eva KolenkoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Adam Rapoport"]}