{"id": "3b5cd9b6ca0f5d3dff3e84b1ed235e36", "url": "https://www.bonappetit.com/story/turmeric-egg-breakfast", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "This Egg Breakfast Recipe Is Comfort Food Done Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Onion-y Turmeric Eggs Are the Perfect Breakfast Comfort FoodAndy Baraghani shares his dad's classic recipe.By Andy BaraghaniMarch 26, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailMy father is not a great cook. My father is not even really a good cook—apologies!—but he does three things very well when it comes to food. He makes the most weird and wonderful pickles, extremely fragrant and glossy jams, and an amazing egg breakfast.His egg breakfast recipe is basically a \"Persian omelet\"—not  a French-style omelet, made with three eggs, folded perfectly, and creamy in the center. It’s not an American-style diner omelet either, which has usually has little bit of browning going on. This is a spoonable Persian omelet, and it consists of just a few ingredients: onions, tomatoes, eggs, and turmeric. The ratio of onions and tomatoes to eggs is pretty high, making a creamy and spoonable scramble that's much softer than your typical egg dish. I did a little riff on it for a Facebook Live during the Feel Good Food Plan, and people were really into it, so here's the recipe:Start by heating 3 tbsp of extra-virgin olive oil in a nonstick pan over medium high and add 1 thinly sliced, large yellow onion. Cook these onions down until they go from soft to a little lacy and crispy at the edges. They should be a really deep brown, with spots bordering on black, because you want to caramelize in order to bring out the natural sweetness. This should take about 8–10 minutes—you want a little charring, because that slight bitterness goes really well with the other flavors.Add 2 cloves of thinly sliced garlic and sauté until they soften, then add 2 medium tomatoes that have been seeded and very finely chopped. Cook the tomatoes until they break down, a lot of water has evaporated, and stuff starts to stick to the pan. Then, add ½ tsp turmeric, along with some salt and pepper. At this point, my dad cracks six eggs directly into the skillet, but I crack them into a bowl and whisk to combine the yolks and the white.Add your whisked eggs to the pan and reduce the heat to medium, then season with a little more salt and cook until the eggs are just cooked through, then transfer everything to a bowl. I serve this Persian omelet with some salted yogurt, torn mint, a little bit more olive oil, a sprinkle of dried chile flakes, and some crispy flatbread. This egg dish has some of my favorite flavors, and dipping crispy flatbread into the warm bowl is one of the most comforting feelings in the world. Making this omelet is of my favorite ways to start the day, and I hope it becomes yours, too.Explore Bon AppétitHealthyishPersianOmeletBreakfastScrambled EggsEggTomatoOnionRead Morerecipes54 Healthy Egg Recipes for Breakfast, Lunch, and DinnerGallery54 SlidesBy Nico AvalleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-26", "author": ["Condé Nast", "Andy Baraghani"]}