{"id": "3b7141f7e5c327d66223107a6aed4da4", "url": "https://www.bonappetit.com/story/cook-less", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Why I’m Trying to Cook Less in 2021 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy I’m Trying to Cook Less in 2021It’s the New Year’s resolution my soul needs.By Christina ChaeyJanuary 24, 2021FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna BillingskogFacebookTwitterEmailEvery other week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,Hi, hello, and happy new year; after taking a brief newsletter hiatus at the end of The Year That Shall Not Be Named, it feels good to be back.Related: The Myth of Healthy Eating with Christina Chaey and Vanessa RissettoContentThis content can also be viewed on the site it originates from.It’s a little late in the month to be discussing new year’s resolutions. But given that this year didn’t feel real—like, really real—until the inauguration happened, I’m giving myself license to share some thoughts on my resolution to make 2021 the year I cook less.Yes, less.A bit of backstory: Long before food became my career, I fell into a nightly habit of getting home from work and embarking on a hectic evening of multiple cooking projects. I never considered what time I had gotten home (usually after 8 p.m.) or how tired I was (extremely) or any other external factor in my life; all I knew was that I had to cook. Most nights of the week, I would regularly proof dough for cinnamon rolls or braise beef stew (or, more likely, do both) well after 11 p.m. By the time I’d finished cleaning the kitchen and crashed into bed at 2 a.m., I was high on the temporary satisfaction of feeling like I had done something productive. It was the validation I needed in my twenties, when I worked so many jobs in which I felt lost and not good at anything yet refused to ask for help, believing that doing so would make me seem weak.At the time, I saw cooking as the activity I used to relax and unwind from the stress of the workday; I would often tell people cooking was my therapy. And yet I couldn’t understand why I never felt truly relaxed after a jam-packed weeknight that might include washing and storing an entire week’s worth of produce and making a jar of fruit compote, homemade chicken stock, a batch of granola, and cooked grains for packed lunches, not to mention whatever I was making for dinner. The more I checked off my “To Cook” list, the more stressed and frenetic I felt—though at least I had taken care of tomorrow’s lunch. It seemed no number of late nights spent fastidiously tending pots of beans or caramelized onions could convert the persistent inner voice that made me believe I wasn’t doing enough with my life, despite regular comments from friends and coworkers that I was one of the busiest people they knew.It would be a decade before I was able to recognize that my compulsive need to cook, cook, cook was an unhealthy coping mechanism for dealing with my anxiety; I had just disguised it as a form of “relaxing” for so many years that I had fooled myself. In fact, it was only after months into the pandemic (and starting therapy) that I was slowly able to recognize that the iron-clad narrative I’d constructed about the role cooking played in my life was a total sham.And so my resolution for this year is to cook less, but with more intention. To think critically about why I choose to cook the things I do, and ensure I’m putting myself in an environment where I feel genuinely relaxed, not strapped for time, and energized enough to take on one (fine, maybe two) project at a time. That’s how I whiled away an afternoon this past holiday Monday, slowly making a pan of butternut squash and leek lasagna from Anna Hezel’s delightful cookbook.And on those ultra-busy days when the thought of cooking dinner only adds more stress to an already stressful day, well, that’s when I break out the good cheese and crackers. That’s what they’re there for; there’s always tomorrow to cook.Till next time,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreLifestyleA Tale of One ChickenBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-24", "author": ["Condé Nast", "Christina Chaey"]}