{"id": "3b75b9eb16b6c224856b1e812f3e32fa", "url": "https://www.bonappetit.com/story/pumpkin-bread-recipe", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "The Great Pumpkin Bread Recipe Is Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Great Pumpkin Bread Recipe Is HereIt’s HEAPING with AUTUMNAL FLAVOR, oh, and salted maple butter on the side.By Alex BeggsOctober 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailThere’s no other way to say this, but this pumpkin bread is moist. (DEAL WITH IT.) It’s even moister—which isn’t a word—the day after baking. No one wants a dry pumpkin bread, a mouthful of over-spiced regret, and no one certainly wants a mushy loaf, a soggy forkful of fall’s failings. We want a moist loaf. M-O-I-S-T. Find out what it means to me.It means a lot. And to Molly Baz too. She developed this new recipe and didn’t want a typical vegetable oil quick bread. “Let’s resurrect the pumpkin bread from its sad sorry Starbucks state!” She declared. Okay!!!!Olive oil brings a buttery, barely grassy note that goes well with pumpkin (“because pumpkin...comes from the earth,” she told me to which I replied 🤔) and it’s what makes the bread moist but never mushy. Molly played with the ratio of flour to fat for weeks until she reached perfection. And since I tasted it, I can concur. Perfection.What else is inside this thing? A heaping dose of AUTUMNAL FLAVOR, that’s what! Cinnamon, nutmeg, a pinch of clove. This specific canned pumpkin. And fresh ginger, not the dry powder stuff. “I didn’t use pumpkin spice mix because I don’t believe in all the spices in that blend,” said Molly. She doesn’t believe in ground ginger. “People use ⅛ teaspoon a year and then it gets stale and flat in their pantry. Use fresh!” It brings a spicier, more dynamic flavor.ZOOMSCOPE: Crunchy rooftop.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensOn top we’ve got a rooftop of crunchy pumpkin seeds and sugar to make the whole thing shimmer in the evening moonlight. “Basic b*tches love glitter and so do I, let’s be honest,” said Molly.MAPLE BUTTER.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensDon’t forget the side dish of whipped maple butter, light and airy and just a bit salty. It’s best made with an electric mixer, but you can paddle the maple syrup into room temperature butter with a spatula if you can’t be bothered. It won’t be as fluffy, but you’ll have maple butter. There are worse things.“If I’m not picking apples this weekend,” Molly concluded, “I’ll be making pumpkin bread, and I hope the rest of the world is too.”Get the recipe:Pumpkin Bread with Salted Maple ButterPumpkin Spice Bread gets all grown up thanks to the addition of fresh ginger in this super-moist no-fuss bread with a crunchy pumpkin seed topping.View RecipeExplore Bon AppétitPumpkinBreadOlive OilDessertFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-12", "author": ["Condé Nast", "Alex Beggs"]}