{"id": "3b851c0fcc93b37faad33c137a55bd19", "url": "https://www.bonappetit.com/story/trader-joes-reviews-november-2020", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Trader Joe’s November Reviews: Huge News for Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s November Reviews: Huge News for CheeseAlso the existential question: How long until we everything-spice everything? By Alex BeggsNovember 20, 2020FacebookTwitterEmailFacebookTwitterEmailIn the subbasement of Trader Joe’s corporate headquarters, I assume there’s an evil scientist waving their hands around one of those electrified balls that make your hair stand up, but inside the ball is a head of radioactive cauliflower. The scientist is cackling maniacally, shrieking, “I’VE DONE IT! I’VE DONE IT THIS TIME!” And an assistant in a Hawaiian-print shirt rolls his eyes and is like, “What?” And the scientist is like, “CAULIFLOWER CRACKERSSSSSSSSSS.”And here we are. Trader Joe’s latest offerings include cauliflower crackers, yep, and multiple varieties of cheese: puffy, saucy, puddly, and firm. Those and more new products are reviewed below, from my own personal subbasement.(Read last month’s reviews)Alex BeggsBrown Things85 Percent Ugandan Dark ChocolateThis is the chocolate bar I picture when celebrities say they have “one square of dark chocolate” as dessert, maybe the most annoying dessert of all time. HAVE YOU HEARD OF CAKE?! It never ceases to disappoint. Celebrities: constantly disappointing. Oh, the chocolate, it’s bitter but still silky and rich. It breaks into shards sharp enough to clean the grime under your fingernails, though that might make them even dirtier.Organic Dark Chocolate Covered Whole Cocoa BeansThese are also intensely bitter but crunchy—so that’s fun. If you’re the person who likes just one square of chocolate because you read too many tabloids in the checkout aisle, you’ll love these. And who am I to question the whims of man?Instant Cold BrewSummon the memory of lukewarm rental-car lobby coffee, left in a paper cup overnight, and know that this is worse than that.Alex BeggsExciting CrackersRed Chili Scalloped Crackers“We will be buying these for the rest of our lives,” said my domestic partner, who this company has finally granted permission to be on my health insurance. And I say this without exaggeration: These are Trader Joe’s BEST crackers. The chile brings a hint of pizza Goldfish, they’re flaky yet sturdy, and they would never, ever refuse to concede an election.Bite-Size Sharp Cheddar Cheesy CrackersExcuse me, Joe? These need to come in a bigger box. If you like the cheese-greasiness of Cheez-Its, you’ll love these. They’re not airy/puffy/crispy, but dense and cheddar-y, a good martini snack—or in the afternoon with sliced apple. They taste fatty, buttery. I also like their cute scalloped edges, which remind me of the Chloé flats my absurdly wealthy NYU classmates wore in the mid-2007s. I made the mistake of splurging on a pair of purple Uggs I thought would get me laid. They didn’t.Alex BeggsEven More CrackersCauliflower CrispsDr. Joe had a breakthrough. The dehydrated cauliflower base (okay) is mixed with brown rice flour, which is super crispy and toasty tasting—smart combo. Also, it’s GLUTEN-FREE yada yada. The people want cauliflower, they demand it, let’s give it to them. I dipped these into the new cauliflower-jalapeño cheese dip (see below) for double-cauli-trouble (the trouble is the test of this cruciferous-ness on my intestines). Try ’em!Trail Mix CrackersEach nut is placed by hand? Good god, who has the time? A shattering cheesy cracker base is decorated with seeds and individually placed cashew halves and raisins. So they’re sweet, cheesy, nutty, crunchy, all at once. I ate them plain because I don’t see how you could possibly pile more on. Put them on a cheese plate and look forward to vacuuming the seeds off the floor when everyone leaves.Alex BeggsGluten-Free ThingsGrainless Cassava and Coconut Tortilla ChipsI texted my aunt with the chip basket above the fridge filled with years-old PopCorners and batteries she doesn’t want to throw away, because these are her JAM. They’re so airy, thanks to being fried in avocado oil and not reeking with rancid coconut oil. Something interesting: They’re flavored with everything bagel seasoning (poppy seed, dehydrated garlic and onion), but Joe didn’t call them “Everything but the Gluten Tortilla Chips.” Maybe that’s only interesting to me. They’re promoting the trendiness of CASSAVA and COCONUT, and I will whisper into your ear as you fall asleep on the couch watching women with perfectly wavy hair arrange empty vases on Dream Home Makeover, “they’re still chips.” Enjoy.Ginger Turmeric GranolaBIG clusters. Spicy and warming. 🚨 Nutmeg alert. 🚨Alex BeggsThere’s Always DipsEverything but the Bagel Greek Yogurt DipYa coulda fooled me, yogurt, I thought this was sour cream, it’s so thick and tangy. Perfectly paired with those everything-spiced cassava tortilla chips. Could you make it yourself by sprinkling “everything” seasoning into Greek yogurt? Maybe! But as the refrain this month goes: Who. Has. The. Time.Creamy Cauliflower Jalapeño DipINTO IT. Parmesan and ricotta are the base of this dip, a part of Joe’s Cauliflower Propaganda line. It’s not thaaat spicy, ya wimps. It’s no Buff Chicken Dip, I admit, but it’s truly, surprisingly good. Pair with Cauliflower Crisps, I don’t really care what you do with your time.Alex BeggsCheese and SausageChardonnay ToscanoThis cheese is soaked in Chardonnay, but who isn’t these days? Ha ha ha, put that on a wooden sign and sell it at HomeGoods. The Toscano is creamy, salty, and more snackable than Parmesan. Please follow the cheese commandments and eat it at room temperature. I’d buy this cheese again, and not because it has a performative drinking problem. It’s good!Buffalo Style Chicken SausageAffordable, tasty, serve with ranch.Alex BeggsSoupUnexpected Broccoli Cheddar SoupI was comforted to see that this soup is not green, but white, because it is mostly cheese. It’s creamy and sharp with a hint of broccoli. I saluted to the dutiful orange carrot cubes doing their part. I’ll take this over gloopy canned soup any day, even if it might just be queso?Alex Beggs2 Nondairy Things and 1 Dairy Thing (My Bad)Maple Oat BeverageGet a WHIFF of that, baby. That is the smell of maple, the flavor, not maple, the syrup. Maple the flavor has a whiff of sham to it, like year-round Christmas stores. Now, I love a year-round Christmas store—shout out to Bronner’s—therefore I love this oat beverage. It smells a lot stronger than it ultimately tastes, and it’s lovely steamed up for a latte or a London fog (chic).Dark Chocolate Almond Butter Cups *Leave these almond butter not-Justin’s 😉 cups in a sunny spot in your car/on the kitchen counter for optimal results: gooey, creamy almond butter oozes out.Sorry this has milk in itAlmond Beverage Chocolate BarThis is creamy imitation-milk chocolate for those who don’t do milk, and it is an uncanny impression. I did notice it was slightly chewy and doesn’t quite melt in your mouth. But the taste is creamy and would be great chopped up in chocolate chip cookies.Alex BeggsFrozen ThingsCreamed GreensMushy green puddle, don’t hate it!Alex BeggsBrazilian Style Cheese BreadYou can’t argue with pão de queijo ready for the smashing in 6–8 minutes. Puffy, cheesy, doughy, spongy, some cheesier than others, some mysteriously dense. Of all the new cheese products mentioned today, MANY, this is my favorite.Harvest Spaghetti Squash SpiralsThis belongs in TJ’s airline food collection, where everything is pretty disgusting but at least there’s melted cheese, and what else are you gonna eat? Skip this, and air travel, while you still can.Cheese-Filled Fiochetti with Pink SauceI added salt and some red pepper flakes to enhance the “pink sauce,” in which little coin purses of bowling alley sock–scented cheese swim about. I ate the whole thing and even drank the “pink sauce” (tomato queso, everything is queso) straight from the bowl as I watched Dream Home Makeover. I can’t stop thinking about those opulent homes filled with meaningless objets, arranged and rearranged on a never-ending loop. The decor equivalent of frozen pasta sauce. A beautiful, mass-produced lie. And I’ll drink every last drop.Alex BeggsTostonesServing suggestion: 1 coaster-size tostone per person?! This bag contains around 7–8 tostones, and two people will eat them all, smothered in refried beans, cheese, and pickled jalapeños, in my case (garlicky green sauce would be good too). You can bake them (bad idea, too dry) or fry them in oil (good idea, they’re fried).Alex BeggsA ChickenHeirloom Whole Chicken, “Giblets May Be Missing”This is an affordable whole chicken, and by cooking a WHOLE chicken of an heirloom breed, you are supporting a better, less wasteful, more humane food system, one that hopefully doesn’t force its workers into unsafe conditions where they contract COVID-19. Plus, you get to fill your house with chicken perfume and feel like a domestic goddess and all that shit. Make sure to roast the chicken on top of some potatoes or a pile of mushrooms for a chicken fat–soaked built-in side dish. See you next month!Previously: Trader Joe’s Reviews Are Back: The Good, the Meh, and the PuffyExplore Bon AppétitTrader Joe'sCrackerRead MorecultureTrader Joe’s Reviews Are Back: The Good, the Meh, and the PuffyBy Alex BeggscultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-20", "author": ["Condé Nast", "Alex Beggs"]}