{"id": "3ba18f08333157b4d4a575bdea69d891", "url": "https://www.bonappetit.com/story/hallacas-claudia-martinez", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Making Hallacas Is Like Gifting Yourself Little Meat-Filled Presents | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020Making Hallacas Is Like Gifting Yourself Little Meat-Filled PresentsAtlanta pastry chef Claudia Martinez shares a time-honored family recipe (and a step-by-step guide!) for the festive Venezuelan holiday dish.By Christina ChaeyDecember 1, 2020FacebookTwitterEmailPhoto by Yudi ElaFacebookTwitterEmailWhen you’re in the restaurant industry, there’s an unspoken rule that you’re expected to work the holiday rush, which is why on Christmas Eve you’ll usually find Atlanta-based pastry chef Claudia Martinez working dinner service rather than celebrating at home with her family. This holiday season it’s all but guaranteed that restaurants will be a lot quieter, but the good news is that Martinez finally gets to join her family for their most hallowed food tradition: preparing Venezuelan hallacas, savory corn dough filled with a savory meat stew and traditionally eaten around Christmas and the New Year.Making hallacas is a full-day project that’s best tackled with a group. In the Martinez household, every family member has a task. Claudia’s dad or grandmother always prepares the guiso, the tender shredded chicken and beef stew that comprises the bulk of the filling. One person slicks scoops of vibrant orange achiote-stained masa dough onto banana leaves, then passes them around the table to get filled.Hard to stop at one.\nPhoto by Yudi ElaClaudia’s grandma adds a spoonful of guiso; Claudia adds olives and capers; her sister adds a few raisins. Finally, each hallaca gets wrapped up in the fragrant leaves and tied with twine like a tiny present, ready to boil for a late Christmas Eve dinner. The Martinez family seldom makes fewer than a hundred hallacas at a time because they’ll take many to friends and family during the holidays. This scaled-down (step-by-step) version of their family recipe makes just under 20, enough for a big dinner plus leftovers you can freeze for another day. If you find yourself with leftover masa and stew, do as the Martinezes do: Make arepas with guiso and fried eggs for breakfast on Christmas Day. Catch Claudia on December 23rd at the last of her Café Claudia pop-up series at the Hotel Clermont in Atlanta. She’ll be selling these very hallacas and Christmas-themed pastries, with all proceeds going to Casa Alterna. Get the Recipe:HallacasIn this Venezuelan holiday dish, masa is filled with a shredded chicken and beef stew, then wrapped in fragrant banana leaves and steamed—like a tiny present.View RecipeExplore Bon AppétitHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Christina Chaey"]}