{"id": "3bab282318ab6d3797643a17985d87dd", "url": "https://www.bonappetit.com/story/favorite-lentils-for-soup-french-green", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "These Are My Favorite Lentils for Soup, Since You Asked | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Are My Favorite Lentils for Soup, Since You AskedI want a lentil that's going to stand up for itself, not turn to mush.By Molly BazMarch 27, 2019FacebookTwitterEmailMmeEmil/Getty ImagesFacebookTwitterEmailLentils in the morning, lentils in the evening, lentils at suppertime. You probably can’t eat lentils on a bagel...but, regardless, you can still have lentils anytime! We stan lentils over here at Bon Appétit. What’s not to love? They're cheap, relatively quick-cooking, packed with protein, and cute as hell. And, to top it all off, they're an essential component of one of my all-time favorite food categories: The Soup Group.Last week marked the first day of spring, and much to literally no one’s surprise we woke up in NYC to a supremely rainy and overcast day. This was an unfortunate circumstance for my spirits—but not for my dinner plans. Nothing makes me crave soup like a little bit of rain. And it just so happens that there’s a new soup in town, Little Miss Kielbasa and Lentil Soup with Lots of Basil, which features (you guessed it!) lentils. And while you could make it with any kind of lentil—brown, green, red, you name it—I think it's the most delicious version of itself when made with French green lentils. IMHO, they're just about the best kind of lentils for soup that exist. And I’ll tell you why.French green lentils, otherwise known as lentilles du Puy, are smaller and firmer than their lens-shaped counterparts, which makes them the perfect candidate for a soup situation like this. Again, any lentil will work here, but I love these Frenchies because, due to their thicker skins, they retain their shape when cooked instead of turning to mush. They're what I want when I'm after a chunky-yet-brothy soup—individual bits of lentils and veggies swimming happily in a rich, fortified cooking liquid—rather than a thick, uniformly-textured, porridge-like stew. (And, incidentally, that same quality makes them ideal for cold lentil salads.)This isn't to throw shade at all the other types of lentils—there is a time and a place for my mush-town friends. I want exactly that fall-apart texture when I'm making a spiced Indian dal that I'll serve over rice, or a thick, stick-to-your-ribs coconut-y lentil and tomato stew. But as the weather turns a bit warmer and we head into the damp, still-not-warm-enough spring, my attention immediately pivots to brothier things, where my beloved French green lentils shine brightest.Ready for some rainy day soup?Kielbasa and Lentil Soup with Lots of BasilExactly the kind of hearty-but-not-too-hearty soup you want on a rainy spring day.View RecipeExplore Bon AppétitBasicallyLentilSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-27", "author": ["Condé Nast", "Molly Baz"]}