{"id": "3bbd1c6599ad9aa50bdb6dca66def1a2", "url": "https://www.bonappetit.com/city-guides/montreal/venue/joe-beef", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Joe Beef Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealJoe BeefAn over-the-top meal unlike any other, in Little BurgundyFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for a form of Quebecois cuisine tying together local ingredients, classic bistrot tradition, and a certain Montreal joie de vivre that only Joe Beef can pull off. Think oysters, foie gras torchon, seared sweetbreads, roasted bone marrow, and lots and lots of meat.ORDER THE: selection of fresh oysters to start, impeccably shucked and elegantly served with all the accoutrements. Although the chalkboard menu changes constantly, you can still count on seeing certain crowd-pleasers, like the legendary lobster spaghetti and the marjolaine dessert, an elaborately layered assemblage of hazelnut sponge and mousse.THE VIBE IS: a party. The restaurant is a hodgepodge of multiple rooms inside a 19th-century building, and the dining room is candlelit, cozy, and buzzed. We guarantee you will leave fuller, and probably drunker, than you expected (or perhaps ever thought possible).PRACTICAL STUFF: Open Tuesday to Saturday 5:30 to 10:30 p.m., but many tables linger a little longer to drink. Closed Sunday and Monday. Reservations are notoriously tough, especially on weekends, so try to reserve months in advance on Resy if you can.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVELe Vin PapillonLittle Burgundy’s natural wine hubAu Pied de CochonGet your fill of foie gras and other Quebecois luxuries at this Plateau legendLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}