{"id": "3bbe206dde4f7c545b34cd58b1dc93ab", "url": "https://www.bonappetit.com/story/fonio-pierre-thiam", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "The Senegalese Chef Behind America’s New Favorite Supergrain | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Senegalese Chef Behind America’s New Favorite SupergrainPierre Thiam used to have to smuggle fonio from West Africa into the U.S. Now he’s getting it into as many of the country's restaurants and grocery stores as he can.By Elazar SontagOctober 17, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailPierre Thiam stood completely still in Dakar’s international airport. Arms wrapped tightly around his suitcase, he prayed guard dogs wouldn’t pick up the pungent smell of the fermented locust bean cakes stuffed between toiletries and bundled shirts in his luggage. If Thiam had wrapped the beans in enough aluminum foil, the dogs would keep moving. But if they stopped to sniff for a moment too long, he knew security would empty his bag and send him back to New York empty-handed as they had many times before.“There was no other choice,” the chef says. Without locust beans, bitter eggplant, tiny blond fonio grains, and the other Senegalese ingredients he hid in his carry-on, he couldn’t make any of the dishes on his menu.The memory, now two decades old, stands in stark contrast to where he sits now, one long skinny leg crossed over the other at his eight-month-old Harlem restaurant, Teranga, and at the head of his own food-importing operation, Yolélé. But he likely wouldn’t be where he is had the obstacles been different. If getting his ingredients from West Africa to Brooklyn were easier. If rising rents hadn’t forced the closing his restaurant, Le Grand Dakar, in Clinton Hill in 2011. If he hadn’t already been so exhausted from years cooking fine-dining cuisine.The idea for the businesses Thiam now runs began taking shape while he traveled throughout Senegal as part of a post-restaurant-closure research trip. If he started a sourcing company, he could build a bridge between Africa and America so that chefs no longer had to hide bags of grain and fillets of dried fish in their bags, and African farmers could find a new market for their goods. Back in New York, he would bring these ingredients to grocery stores for home cooks to use and to open a new restaurant where he could share them with diners. “Bringing the spices and the seasonings and the flavors of Africa to America, that was the vision,” Thiam says.At Teranga, fonio is made into jollof with green peas, and a salad with beets, pickled carrots, and pomegranate.\nPhoto by Emma FishmanBy 2017, he had set up relationships with several farming collectives in West Africa to launch Yolélé and bring its first product to the U.S. market: the highly nutritious African grain fonio. A staple in West Africa, fonio is everywhere. Cooks blanket the fluffy steamed grain in sweet, creamy peanut sauce; dot it with herbs and vegetables; and adorn it with braised lamb so tender the meat practically melts into the absorbent pearls. It’s cooked into breakfast porridges, covered in stew for lunch, and mixed with greens at dinnertime.In a changing climate, fonio is a stable source of sustenance and income, a crop that resists drought and harsh weather, unlike the others so many West African farmers began growing after colonial powers brought corn, peanuts, and cotton to the region. But it also grows more slowly and isn’t in the same demand internationally—yet. “The farmers that grow fonio are in dire need of income,” Thiam tells me. “They barely survive because there’s no market for it.”With Yolélé Foods (cofounded with food industry veteran Philip Teverow), Thiam wanted to show Americans that the grain could be just as exciting as any other ingredient New York chefs were cooking with, while also creating an outlet for West African farmers to sell their harvests. Two years in, his plan already seems to be working.Fonio imported by Thiam first appeared in Whole Foods Markets across New York City in 2017, and it will be more widely available in locations throughout the Northeast later this year. It’s also showing up at restaurants featuring non-African menus. At Dime’s, a breezy California-inspired spot in Manhattan’s Lower East Side, chef Alissa Wagner has incorporated fonio into a sweet porridge, a savory grain salad, and her take on shrimp and grits. At the Dining Room at the Metropolitan Museum of Art, fonio is part of a fluffy pilaf served alongside creamed nettles, rhubarb, and a thick slice of blush-pink duck. “Chef Pierre’s idea to [support this grain’s production] in an area that is being decimated by climate change—it's a stroke of genius,” Fred Sabo, the restaurant’s executive chef, says. Wagner expresses a similar sentiment: “Fonio is quick-cooking and easy to prepare, plus it’s gluten-free, which is an added bonus. I especially love that by using fonio at the restaurant, we are helping to support a community of West African farmers.”The counter at Teranga.\nPhoto by Emma FishmanWith Yolélé up and running, Thiam felt ready to open the restaurant he had envisioned while traveling through Senegal. In February 2019, eight years after his last New York brick-and-mortar shuttered, he and social entrepreneur Noah Levine launched Teranga in the Africa Center in Harlem. The Wolof word teranga translates loosely to “hospitality,” though Thiam insists the meaning is much deeper, a foundational value in Senegalese culture. “Opening another restaurant was always in the back of my mind,” Thiam says, “but I knew I wanted to take the time to think it through—to not fall into the same pitfalls that I encountered with the other restaurants. I didn’t want such a difficult life.”Unlike any of the chef’s past ventures, Teranga follows a fast-casual format: Premade dishes are displayed in colorful Dutch ovens behind a counter, ready to be assembled into customizable grain bowls and market plates. The dishes are a nod to the food that women in Thiam’s family made during his childhood: ndambe, a rich, comforting sweet-potato-and-black-eyed-pea stew brightened with rounds of crisp okra; egusi, a deep-orange stew of hearty greens made bitter by ground melon seeds; and tomato-based jollof made, of course, with fonio. “I have been living in New York for quite some time now,” Thiam says, “and I think Teranga was missing.”The chef is in a very different position now than when he opened Le Grand Dakar 15 years ago, working endless shifts, hoping his ingredients wouldn’t be confiscated en route to America. He has become an ambassador for West African cuisine and a guide for any American who wishes to cook it. Thiam now dedicates as much time—if not more—to introducing African produce to other restaurants as he does to cooking it at his own. “I see so much opportunity for African food culture in general to just explode in New York,” he says, his eyes twinkling. “This is just scratching the surface.”Thiam, in green, with his team.\nHe’s preparing to launch new menu items at Teranga later this fall, developing recipes inspired by his travels in Senegal. He’ll teach the cooks to re-create these dishes so that when he’s abroad, the restaurant will continue to serve the food his customers have come to love. “I still experience fine dining as much as I can when I travel, but I’m glad I’m not the guy in that kitchen at the moment,” Thiam says. “I don’t think anything is more rewarding than the type of cooking I’m doing now—the cooking that was directly inspired by my foremothers.”In November, he’ll publish his third cookbook, this one entirely dedicated to fonio. He’s already thinking of ways to build out Teranga by opening more locations of the restaurant to further share his vision with American diners. And, he’s got a line of fonio chips in the works. Through Yolélé, Thiam hopes to roll out other African-grown ingredients like attiéké, granules of fermented cassava pulp nearly identical in appearance to couscous; bambara beans; nutrient-packed moringa leaves; and the very same fermented locust beans Thiam used to have to conceal in aluminum foil.“At first, I had to smuggle African ingredients in my luggage,” Thiam remembers, laughing. “Now, I bring them in shipping containers.”Buy It: Yolélé Fonio (pack of 3 bags), $20 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitChefsNew YorkRead MorerestaurantsChef Pierre Thiam of Harlem’s Teranga Makes Classic Jollof Feel FreshBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Elazar Sontag"]}