{"id": "3bd45f2a0e5be31d4fef19e15caebddc", "url": "https://www.bonappetit.com/recipe/date-and-gorgonzola-scones", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Date and Gorgonzola Scones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueDate and Gorgonzola SconesBy Zaynab IssaNovember 23, 20214.7(5)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintA cheese board, but make it a scone! These mostly savory scones are packed with just enough caramelly, chewy Medjool dates to balance lots of crumbled blue cheese that melts into the flaky, buttery layers. The scones are just as good with a salty cocktail as with tea or coffee, which means they’ll be perfect for a hair-of-the-dog brunch the next day.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSilpat Roul' Pat$88 At AmazonPastry Brush$9 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxScale$25 At AmazonWire Cooling Rack$17 At Bon Appétit MarketWhisk$10 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes 121Tbsp. baking powder1Tbsp. sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt¼tsp. ground nutmeg3cups (375 g) all-purpose flour, plus more for surface½cup (1 stick) chilled unsalted butter, coarsely grated1large egg1tsp. vanilla extract¾cup chilled heavy cream, plus more for brushing7Medjool dates, pitted, cut into ¼\" pieces4oz. Gorgonzola, crumbled¾tsp. flaky sea salt¾tsp. freshly cracked black pepper, plus moreMascarpone or clotted cream and honey (for serving)PreparationStep 1Preheat oven to 400°. Whisk baking powder, sugar, salt, nutmeg, and 3 cups (375 g) flour in a large bowl to combine. Add butter and toss well to coat and evenly distribute.Step 2Whisk egg, vanilla, and ¾ cup cream in a small bowl to combine. Add dates and Gorgonzola and mix gently to coat. Scrape into dry ingredients and mix with a wooden spoon until dough just begins to come together with a few bits of dry flour remaining. Using your hands, knead dough in the bowl until it comes together.Step 3Transfer dough and any loose flour to a lightly floured surface. Flatten to ¾\" thick (the shape doesn’t matter). Using a knife, cut into 4 pieces, stack pieces on top of each other, and flatten dough into a ¾\"-thick 8\" square (this process will create flaky layers when the scones are baked). Cut dough in half lengthwise, then cut each half into thirds crosswise to form six 3\" squares. Cut each square in half on a diagonal to make 12 triangles total. (Alternatively, you can use a 2½\"-diameter biscuit cutter to punch out scones. Gather scraps and repeat, patting and cutting, until you have 12 scones.) Transfer scones to a parchment-lined baking sheet, spacing 1½\" apart, and chill, uncovered, at least 15 minutes.Step 4Brush scones with cream and sprinkle with sea salt and ¾ tsp. pepper. Bake until tops are golden brown, 18–20 minutes. Transfer scones to a wire rack and let cool.Step 5To serve, arrange scones on a platter and serve with mascarpone and honey in small bowls and more pepper for topping as desired.Do ahead: Scones can be formed 1 day ahead. Cover and keep chilled.How would you rate Date and Gorgonzola Scones?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThese were simple and simply delicious. I made a few adjustments (subbed half and half in place of cream/used mills 1-1 gf flour) and opted to try a half recipe which made out for 8 scones perfectly. Loved the more savory rendition with subtle sweet peeking through. Sent a few off to a friend who immediately called for the recipe. \n\nWill absolutely make the full batch next to round. Great for home and an easy thoughtful offering for neighbors and friends. Jeni A.CT12/31/2021Really delicious, though more savory/less sweet than I anticipated. The gorgonzola is pretty subtle once baked. I couldn't find Medjool dates and used Mazafati instead. I would definitely make this again, but with a a few more dates and a bit less salt on top. Perhaps clotted cream and honey would have suited it better and added the sweetness I wanted - we had ours with mascarpone.LaurenMontreal, QC12/11/2021Explore Bon AppétitBreakfastSnackBakingNut-FreeSconePastriesDateDried FruitFruitGorgonzolaBlue CheeseCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}