{"id": "3bdcc7022d3f3c8add60dfa0bd2293a0", "url": "https://www.bonappetit.com/story/remembering-romulo-yanes", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Remembering Romulo Yanes, Who Shot These Iconic Food Magazine Covers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRemembering Romulo Yanes, Who Shot These Iconic Food Magazine CoversFor decades, Romulo Yanes photographed beautiful and defining images for Gourmet, Bon Appétit, and Epicurious.By Bon AppétitJuly 2, 2021FacebookTwitterEmailChocolate truffle tart photograph for Gourmet magazine's February 2007 issuePhoto by Romulo Yanes, food styling by Paul Grimes, prop styling by Haley ThurshwellFacebookTwitterEmailSome of the most iconic food magazine covers of the past 40 years were captured by Romulo Yanes, a staff photographer at ‘Gourmet’ who also shot for publications, including ‘Bon Appétit’ and Epicurious, during his prolific career. After battling peritoneal cancer, Yanes died on June 16. We asked food stylists and editors who worked with him to share their memories, lightly edited for clarity.At Gourmet, we food editors wanted Romulo involved in all aspects of a recipe because he had such great ideas about making it visually appealing. He liked to tell the story of a recipe: sometimes that meant showing the beauty of the ingredients in a process shot, other times that meant cut-up fruit with juices leaking onto a cutting board, placed next to a hot-from-the-oven pie. And in the end, that’s what food magazines were and still are about: enticing viewers with photographs so delicious-looking they’ll want to run into the kitchen to start cooking.But Romulo’s thoughts on food weren’t confined to the visuals: With his keen palate and enthusiastic enjoyment of good food, he was sought after in daily tastings, and his opinions on dishes carried as much weight as those of my food editor colleagues. \nPhoto courtesy Yanes familySome of Romulo’s best pictures happened after he’d satisfied the art department with some shots. Then he’d say to the food stylist, “Let’s play,” or, “Let’s try it another way.” It might be as simple as turning the plate 180 degrees, or trying a different prop, or “messing up” the food on the plate to make it look as natural as possible. The shot that Romulo was really proud of was a slice of chocolate truffle tart with a forkful taken out and the fork on the plate. There are fork marks and a smear on the plate that show just how delightfully creamy the texture of the cake is.Dark chocolate wedding cake with orange buttercream frosting for Gourmet magazine’s September 1996 cover\nPhoto by Romulo YanesLocation shoots were also great fodder for stories. In the late ’90s, we shot a wedding menu in Bucks County, Pennsylvania. My two young daughters were enlisted to model as flower girls. They looked at the wedding cake from afar, afraid to get too close. In order to get a good shot, Romulo urged them closer. “Doesn’t that frosting look good? Don’t you want to taste it? Go on, try a taste. It’s okay, really, it’s okay.” And with that permission, my younger daughter swiped her finger through the frosting and into her mouth. Click! Romulo nailed the shot that went on the cover.In some ways, it’s fair to say that Romulo was the glue that kept the test kitchen together. He had a wicked sense of humor and kept all of us in the kitchen laughing throughout the day. When Gourmet closed, those of us from the food department missed the jokes and the camaraderie most. —Kemp Minifie, former executive food editor, ‘Gourmet’December 2011 cover of Bon Appétit\nPhoto by Romulo Yanes, Food styling by Karen Evans, Prop styling by Kim FicaroWhen I first arrived at Bon Appétit at 4 Times Square with an all-new staff, I commissioned Romulo to start doing the front of the book as a trial. I was intimidated by him at first. But within an hour of meeting him, I adored him. Not only was he charming and kind, but a brilliant food photographer who taught all of us so much. He sailed through the most difficult shots with grace and ease, always delivering perfect advice in the most humble way. We spent a lot of time together over the years on set, and one delirious evening when we had all been at it too long, we came up with “cheese nicknames” that best suited our personalities. We all knew that Romulo was most definitely “Manchego”—aged and slightly buttery yet zesty. —Alexandra Pollack, former photo director, ‘Bon Appétit’March 2012 cover of Bon Appétit\nPhoto by Romulo Yanes, Food styling by Rebecca Jurkevich, Prop styling by Lucy Attwater.January 2013 cover of Bon Appétit\nPhoto by Romulo Yanes, Food styling by Rebecca Jurkevich, Prop styling by Pamela Duncan SilverI met him while I was cross-testing and assisting at Gourmet, and he was quick to take me under his wing after we bonded over our shared Cuban heritage. While I can’t recall a specific moment on set, I do have a favorite cover. Or two. One is a pizza pie, and the other is a gorgeous pork chop sizzling in a cast-iron with butter, garlic, and herbs. My memory says we shot all night and went through hundreds of pizzas and pork chops to get those two shots. Obviously not the case, but maybe close.Rom was gentle, kind, quick-witted, and sharp-tongued. He was always making jokes and sharing beautiful images. We lost a very good soul. —Rebecca Jurkevich, food stylistCheese photograph for Bon Appétit March 2012 issue\nPhoto by Romulo Yanes, food styling by Alison Attenborough, prop styling by Beverley HydeWe always had fun working, and he would joke around calling me Lady A. He would drive me crazy with styling Christmas candies and tweaking them so I would leave him to it and let his inner food stylist come out! But we had great fun with cheeses and rigging them together—I think we worked on a beautiful cheese story for Bon Appétit. And one on Parmesan broth too.He worked at Condé Nast for 20 years, and his work was his life. He wanted to work until the end. I think, especially during COVID-19, working was a way for all of us to feel more normal. He took some beautiful images and was always passionate about his work. And he was an inspiration to many young photographers. —Alison Attenborough, food stylistFebruary 2006 cover of Gourmet magazine\nPhoto by Romulo Yanes, Food styling by Maggie Ruggiero, Prop styling by Julia Garcia-Tobar.Romulo was a great collaborator. He thought about every element in a photograph, and all along he would have us rolling in the aisles with his very wicked humor. His trademark was using a roll of Bounty paper towels for bouncing light; actually, he had several tricks up his sleeve using Bounty. Bounty was his muse. —Maggie Ruggiero, food stylistIce cream photograph for Gourmet magazine’s August 2009 issue \nPhoto by Romulo Yanes, food styling by Maggie Ruggiero, prop styling by Haley ThurshwellHe was generous and helpful with me, even though we did not work together that often. But it felt like we had always known each other in our work life. —Susie Theodorou, food stylistHe was wonderful, kind, and well-loved. A strong and talented pillar at Gourmet for so many years. I consider myself so lucky to have known and worked with him. It is heartbreaking that someone so lovely had to be taken away so soon. —Erika Oliveira, art director, ‘Gourmet’Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-02", "author": ["Condé Nast", "Bon Appétit"]}