{"id": "3be998f69a0d2ac95a0827be13d615e0", "url": "https://www.bonappetit.com/recipe/red-chilaquile-egg-bakeandnbsp", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Red Chilaquile Egg Bake Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesRed Chilaquiles Egg BakeFacebookPinterestTwitterEmailPrintIngredientsIngredients1 medium white onion4 large garlic cloves2 jalapeños2 limes2 tablespoons canola oil2 cans Campbell’s® Tomato Soup1 (14.5 ounce) can diced tomatoes1 tablespoon chipotle chili sauceKosher salt and freshly ground pepper1 (8 ounce) bag yellow corn tortilla chips4 large eggsDiced avocado, crumbled queso fresco, and chopped cilantro, for servingEquipmentCutting boardChef's knifeCitrus juicer10-inch enameled cast iron skilletWooden spoonSmall bowl1-cup measuring cupRecipe PreparationFinely chop the white onion.Peel and mince the garlic. Finely dice one jalapeno and thinly slice the remaining jalapeno, membrane removed.Squeeze the lime until you have 2 tablespoons juice. Heat oil in a 10-inch, heavy-bottomed skillet over medium-high. Add onion and cook stirring occasionally, until lightly charred in places, about 4 minutes. Reduce heat to medium and add garlic and the finely diced jalapeno. Cook, stirring, until fragrant, about 1 minute.Pour the Campbell’s® Condensed Tomato Soup. Add in diced tomatoes, ½ cup water, lime juice, and chipotle chili sauce into the skillet with the onion mixture.Bring to a boil, stirring to combine salt and pepper.Stir in the tortilla chips until coated in sauce. Add eggs.Bake until egg whites are set, about 13 minutes. Top with avocado, jalapenos, queso fresco, and cilantro.Recipe by Campbell'sRelated VideoRed Chilaquiles Egg BakeReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}