{"id": "3bebba6c953a8d4653ecd7f08f570fc2", "url": "https://www.bonappetit.com/story/josh-niland-fish-weight", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Josh Niland Fish Weight Has Forever Changed My Cooking Game | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought This Fish Weight Was Another Useless Kitchen Tool—Until I Used ItJosh Niland’s stainless steel press is the key to the perfect sear.By Sohla El-WayllyApril 7, 2020FacebookTwitterEmailPhoto by Sohla El-WayllyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My husband is a chef, and he often brings home a lot of useless kitchen tools. Just look at our closet—it has a broken pasta roller, a spherification kit, a wooden tofu press with an accompanying 10-pound bag of soybeans, and three (three!) blowtorches. So when he came home with this fish weight, I initially dismissed it as another new toy he’d play with for a week before shoving into our closet. Then, I noticed that his sear game had gone up a few notches. His steaks were more deeply and evenly browned than ever—even lean cuts, like pork and chicken, were somehow perfectly golden brown. I’ll admit, we’re a little competitive. So when all of the sudden his steaks started looking better than mine, I needed to know what the hell was going on. Was this oversized (and not inexpensive) paperweight really giving him such an edge?Although it’s designed for fish, I first gave it a try on a grilled cheese sandwich. It was nothing fancy—just pullman slices, butter, and cheese—but the press ensured the sandwich had even contact with the pan as it cooked, giving it smushed panini vibes and a perfect crust. But that was just the beginning. Soon I was using the fish weight for everything. I crushed boiled Yukon golds for the ultimate crispy-crunchy smashed potatoes. I struck the delicate balance of charring vegetables while maintaining their crisp-tender texture. And because it’s made of a nonreactive stainless steel, I used it to weigh down crocks of fermenting cabbage for all my sauerkraut and kimchi projects.Watch me wax poetic about this fish weight (at 6:59!).\nNow, let’s not forget about what it does for fish. Crispy-skinned fish is an elusive thing. As soon as your filet makes contact with a hot pan, it wants to curl up, which leads to uneven cooking and floppy skin. This weight flattens the filet and holds it down, so the skin can render and crisp up while the meat evenly cooks.Unlike other presses, which are usually cast-iron, this one—the work of Josh Niland, the chef at Saint Peter in Sydney who knows, loves, and respects fish—is made up of slick stainless steel that’s super nonstick and doesn’t require seasoning, so you won’t tear up your delicate filet when you remove the press. Its heavy weight and thick body retains heat, which allows you to cook food from both sides at once. And coming in at four pounds and six inches in length, this press is small but mighty. Other presses of the same weight usually are big and unwieldy, making them tough to use in smaller pans and requiring more room to store.But let me assure you: This weight is never going into storage. I use this fish weight nearly everyday, so it’s earned itself a coveted spot right by the stove. Move over, Joyce Chen shears and mortar and pestle, there’s a new “it” tool in town.Buy it: Josh Niland Fish Weight, $150 at Mr. NilandAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsRead MorecultureThe $3 Tool Chefs Use to Make Sure Fish Is PerfectBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-07", "author": ["Condé Nast", "Sohla El-Waylly"]}