{"id": "3bedb689f1f7c2695fbbde95c0178cbe", "url": "https://www.bonappetit.com/story/blueland-cleaning-kit", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "I Miss Blueland Soaps and Cleaning Products More Than I Miss My Former Roommate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Miss My Roommate, But I Really Miss Her Blueland Cleaning ProductsThey’re sustainably packaged, smell great, and actually work.By Emily SchultzApril 22, 2021FacebookTwitterEmailPhoto courtesy BluelandFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.After living with my friend Chrissy for five years in New York, I’ve recently made the ~adult~ jump to being roommate-less, and there are definite pros and cons. On the pro side, I can sprawl out naked in the living room. But there are things about sharing that I miss—like when I’d use her collection of expensive travel-size face masks when she wasn’t home. (Sorry, Chrissy, it was me.) Or sneak a piece of chocolate from her stash when the craving hit but I was too lazy for a bodega trip. But the thing I miss the most? Her Blueland soap and cleaner subscription.Blueland is a direct-to-consumer cleaning products company that is trying to eliminate single-use plastic, one bottle of window cleaner at a time. When you purchase the Clean Essentials kit, you get four simple bottles—a clear glass one with a pump for foaming hand soap, a pink one labeled “bathroom,” a yellow one labeled “multi-surface,” and a blue one labeled “glass + mirror.” The three spray bottles are made of Tritan, a BPA-free plastic that is shatterproof and sturdy enough to withstand indefinite reuse. The actual soap and cleaners, which are made using ingredients that are all transparently displayed on Blueland’s website, come in tablet form—another sustainable choice. Shipping small tablets is more efficient than moving liquid-filled bottles from point A to point B. When it's time to refill, just plop the color-coded tablet into its bottle, add water, and you’re ready to use!The sustainable packaging and subscription service is great and all, but more important, Blueland soap and cleaning products actually work. They smell so fresh—like the scent of orange peels lingering on your fingertips after you peel a ripe Sumo—and I only need a small spritz to clean my hands, grease, hard water stains, or the ring of coffee my morning cup inevitably leaves on the table.The Blueland subscription was my roommate’s, so when we parted ways I also said goodbye to my beloved bottles. But I’m an ~adult~ now, so I guess it’s time to get a subscription of my own.Blueland Clean Essentials Kit$39 at BluelandExplore Bon AppétitShoppingHighly RecommendSustainableCleaningRead MorecultureZip Top Bags Are Helping Me Drop Single-Use Plastic for GoodBy Sarah JampelcultureEvery Single Time I Break Out These Produce Bags, I Get a ComplimentBy Sarah JampelcultureThe Only Kitchen Scrubbing Pad That Matters Is Homax Steel WoolBy Carla Lalli MusicLifestyleHow To (Re)Organize Your Kitchen, According to a Professional OrganizerBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-22", "author": ["Condé Nast", "Emily Schultz"]}