{"id": "3bf69f37dbc33cc649405a47a8062ffa", "url": "https://www.bonappetit.com/story/womens-retreats", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Women's Retreats Are Changing Their Message From Weight Loss to Self-Empowerment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFrom Weight Loss to Self-Empowerment: Women's Retreats Are Changing Their MessageWomen's retreats are cashing in on promises of transformation, but can you change your life in one self-soothing (and expensive) weekend? By Sarah TreleavenOctober 14, 2019FacebookTwitterEmailPhoto by Erika LayneFacebookTwitterEmailI was in a small, unfussy coffee shop close to my cottage in rural Nova Scotia when I saw the poster advertising a women’s empowerment retreat at a rustic lodge on the shores of the warm Northumberland Strait.I’ve become increasingly curious about the growing interest in new-age spiritualism, and in particular, how women are seemingly using it as a way to address chronic dissatisfaction. Without knowing exactly what I would get out of it I contacted the retreat organizers to ask if I could attend the weekend’s events. Two weeks later I was sitting in a chair with my eyes closed in the middle of a log-walled room. Around me, dozens of women circled, taking turns whispering affirmations into my ear: “You are brave. You are loved. You are special.” Even as I rolled my eyes, I felt myself start to cry.“Oh god,” I thought. “It’s working.”I felt simultaneously defeated and relieved.The retreat, called “I Am Worth It,” was hosted by three wellness practitioners: a healing touch specialist, a reflexology therapist, and a naturopathic doctor. In addition to healthy meals, beach walks, and yoga, there were guided sessions that addressed letting go of past hurt, setting intentions, prioritizing self-care, and harnessing “energy centers.” It costs around $333 per person to attend. The duration of the retreat is two days. Rooms were shared.Over the course of the two days, from early morning until well into the evening, women shared stories, exhaled a lot, dabbed their eyes with tissues, and formed a drumming circle under the full moon. Throughout we received advice from the practitioners, intended to help budge participants out of a rut once they returned home: make sure to get out into nature, light some scented candles while soaking in a deep tub, observe your chakras, and tell your mirrored reflection “you’re beautiful” over and over until you start to believe it. We whispered affirmations in each other’s ears. At some point the naturopath explained that she tells clients, “We’re not going to talk about weight loss, but about how your parents treated you when you were little.”It was a rollercoaster of practical and obscure, out-there woo woo nonsense and disarmingly astute observation.Wellness retreats are nothing new. Since the 2nd century B.C. and its Roman baths, people have fled to spas and health-minded resorts in an attempt to feel better. These early incarnations eventually evolved into the spa model of Golden Door in San Marcos, California, and Canyon Ranch in Tucson, Arizona, both of which offered opulent surroundings coupled with rigorous training geared toward weight loss and physical transformation. By the mid 2000s yoga retreats filled up Instagram feeds with photos of virtuous-looking activities, sun salutations on the beach, and fit people inhaling huge amounts of avocado.[Retreats] grant women permission to prioritize their needs—promising that a greater sense of personal fulfillment will follow.And today’s retreat culture has moved past the “lose weight, feel great” mentality, beyond a week of yoga and vegan meals in Puerto Vallarta, and squarely into the realm of self-empowerment.These new retreat goers aren’t focused on losing weight, rehabbing, or escaping their problems. They’re packing their emotional baggage and heading to places like Renew Breakup Bootcamp in upstate New York, a broken-heart retreat that helps women address subconscious patterns that keep them from the love they really deserve. At a Purpose in Paris retreat, participants cast negative self-talk into the Seine and make “self-worth vows” at the iconic lovelock bridge. In Miami, there are vision-boarding and manifesting retreats to help pinpoint “limiting beliefs” and evict the “resident shit-talker living in your head.” And one Costa Rica retreat combines self-defense, mindfulness, and self-care with the promise that “your inner warrior princess is waiting to be unleashed into the world.”“I believe people are understanding their need to turn focus inward and shine a light on the dark parts of themselves that maybe they weren't willing to face before,” says Jennifer Sembler, whose Yemanya Travel company offers retreats for women with “a 360-degree approach to mind, body, and spirit,” including hiking, meditation, and life coaching sessions. “This search for inner peace and truth is one of the driving forces behind this retreat movement,” she says.Beth McGroarty, director of the nonprofit, research-oriented Global Wellness Institute, says that self-empowerment retreats for women have exploded in the last few years. And, overall, businesses that cater to all-female getaways have dramatically increased in popularity. McGroarty, who keeps tabs on these things, says that AdventureWomen, which has been in business for over 35 years, reported 42 percent growth in the last year, and that Wild Women Expeditions has grown by 1,000 percent since 2010 and doubled profits since early 2018.These new retreats are part of a broader cultural interest in self-care, a concept that has displaced the more rigid-sounding “self-improvement” in recent years. They cater to women primarily, and those with enough privilege to spend hundreds or thousands of dollars (and vacation days) on personal growth, mental health, or healing. Sara Elise, co-founder of Blind Seed, a company that hosts inclusive urban wellness workshops and retreats, says that these retreats tend to appeal to “white women with small, able bodies and deep pockets,” and that she and co-founder Tara Aura were inspired to launch their business because she had “never been to a wellness retreat with more than one person of color in a leadership position.”But McGroarty also points to broad demographic changes to explain this phenomenon: Women are marrying later and less often, having fewer if any children, and have far greater purchasing power than ever before. Then there's the rise of fourth-wave feminism (which is commonly associated with online activism, the #MeToo movement, body positivity, and the intersections of race, gender, sex and class), the failures of conventional healthcare to address women’s needs and concerns, an increasingly on-demand work culture, the gender pay gap, toxic social media, and generalized anxiety about economic stability and impending environmental catastrophe. All these factors are likely driving women to prioritize psychological wellness. “There’s a kind of zeitgeist right now of female empowerment, bonding, and transformation,” says McGroarty.Back at I Am Worth It, healing touch practitioner Jeanette Gormley blamed the zeitgeist on a toxic environment for womanhood—the constant swirl of negativity, the high expectations and demand for conformity, the disproportionate burden we often take on in our domestic lives. Elaine Falconer, who lives in River John, Nova Scotia and recently retired from her job as an occupational health and safety specialist, told me she was hoping the weekend would help her gain greater clarity. “Women put high expectations on themselves and don’t take enough time for self-reflection,” she said, facing the big stone fireplace at the front of our log-walled room. “It’s a bit of a process to prioritize what I need and not what others need from me.”Getting in touch with a suppressed or silenced interior life is a common goal among participants. Ali Wunderman, 29, a Montana-based travel journalist, attended a retreat in 2017 offered by The Storyteller Within, in Guatemala, where the emphasis was on writing. Over the course of ten days, at $1,595 USD for a shared cabana, attendees practiced meditation and yoga, ate plant-based communal meals, participated in Mayan fire ceremonies and cacao-induced “ecstatic dance.” And says, Wunderman, daily group therapy sessions. The various components contributed to a transformative experience. “Doing all that yoga put me back in touch with my body and its needs,” she says. “That healthy food cleared my mind so I could think more deeply. Being with a trusted group of formerly-unknown-to-me women created the space I needed to trust my vulnerability.”Wunderman sees the growth of self-empowerment retreats as part of a mass awakening. “Women are recognizing their individual power and their communal power and taking it back for the sake of liberation,” she says. “I don't think it's just because we want to, or just because it feels good: I believe a global shift is taking place in which we recognize we need to.”Many women say that they’re paying for the chance to step away from the competing needs of work, families, relationships, and daily life maintenance and simply hear themselves think again. Nathalie Schofield, a 39-year-old communications advisor who lives in Eastern Passage, Nova Scotia, attended the I Am Worth It retreat after going through a divorce. When I spoke to her several weeks after the retreat, she told me that a “spirit guide” emerged to her during the evening drumming session.“I was very angry and bitter and I knew I had to let go of something or change something,” she says. The drumming ceremony was just before a “releasing” ceremony, and as Schofield held her hands out she felt a spirit grasp them, followed by the sensation of hands on her shoulders. “I suddenly realized that I had to let go of trying to control everything,” she says. She thanked her spirit guides, took a piece of paper and wrote the word “control,” threw it into the fire pit and then “bawled like a baby.”As the gray and angry Atlantic Ocean lapped the shore of Nova Scotia, I began to glean why the women who can afford it are spending hundreds and thousands of dollars to take this particular kind of break. It was a temporary release from a socially endorsed obsession with external presentation in favor of interior experience—and at a time when so many women are so overwhelmingly worn out. The positive talk—being “worth it”; advocating for laughter as medicine—is the counterbalance to a constant swirl of negativity. The emphasis on “natural” and “holistic,” on beeswax candles and tucking dried lavender under your pillow, is a panacea for our increasingly toxic plastic world. But even more, they grant women permission to prioritize their needs—promising that a greater sense of personal fulfillment will follow.But what happens after these retreats? Do the spirit guides and the renewed commitments to self-care remain? Can an exercise in female empowerment in the presence of accepting female strangers translate to a more nurtured, calm, healthy, whole woman walking back into her office?For many of the women (including me) who attend these retreats, it seems unlikely that substantial life changes can be prompted in just one very expensive, self-soothing weekend. Most go back to the same lives that made us feel stuck in the first place. And while they purport to be feminist in their approach to self-empowerment, these retreats tend to emphasize practices like journaling, manifestation, and individual desires rather than building a more equitable society that doesn’t drain women so much in the first place. What would a retreat have to do to begin to accomplish that?Sara Elise makes the case that some retreats can help prepare women for the hard work of broader social change. “If we can use the support systems in a retreat setting to make room for expansion, we often come home with a greater capacity for the emotional labor and work required of us in the world,” she says. “Retreats that prioritize marginalized people can give all kinds of activists and oppressed people a chance to recalibrate with new questions, new perspectives and time away from the usual challenges of everyday life.”The retreat I attended sometimes made me feel even more cynical and impatient. I quickly grew weary of being told to hug myself in front of the mirror or being asked to join a circle. Like so many other women, I am often very tired and I didn’t really want to talk about how essential oils or spending more time in the tub might help solve my problems. What exactly were we accomplishing?But when an exercise involving Tibetan Rites pivoted to a discussion of mothers and boundaries, I was instantly struck by the universality of experiences being expressed, and the difficulty of trying to feel your way around a relationship with someone you love who sometimes hurts you. A number of women nodded along when one attendee said she recently told her mother to “go fuck herself.”Not unlike group therapy, it was the kind of environment where a participant simply benefits from feeling heard and recognizing their own experience in another’s story. The kind of meaningful exchange we’re sometimes short on while going through the busy motions of day-to-day life.I wasn’t the only one who cried during the affirmation exercise in Nova Scotia. The tissue boxes were there for a reason. Maybe you don’t always know what you need to hear until a stranger whispers it in your ear. And maybe, for some women, that’s the first step to figuring out what’s missing.Explore Bon AppétitHealthyishSelf CareTrendsRead MoreLifestyle5 Healthy Trips for People Who Hate Wellness RetreatsGallery5 SlidesBy Mackenzie WagonerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-14", "author": ["Condé Nast", "Sarah Treleaven"]}