{"id": "3bff94c04542c93ff64dbd49fcfa91d9", "url": "https://www.bonappetit.com/recipe/curry-leaf-and-mango-gandt", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Curry Leaf and Mango G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredCurry Leaf and Mango G&TRachel Gurjar shows us her take on a classic G&T, taking inspiration from her Indian heritage. With curry leaves, mango, and lime juice, this tangy and super refreshing cocktail feels like summer in a glass.By BOMBAY SAPPHIRE® GINJuly 28, 20214.0(8)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire3oz. premium tonic water2sprigs curry leaves (about 20 leaves), plus 4 leaves for muddling and a sprig for garnish1oz. mango puree½cup sugar½oz. fresh lime juice, plus 3 lime wheels, for garnishA pinch of saltPreparationStep 1In a small pot, combine the sugar and ½ cup water. Remove the curry leaves from 2 sprigs and break up the leaves with your hands, then add to pot. Bring to a simmer over medium heat, stirring until the sugar is dissolved. Remove from the heat and strain into a heatproof bowl; discard solids. Let cool completely.Step 2Crush the curry leaves with your hands and add to a cocktail shaker along with ½ oz. curry simple syrup and muddle. Pour in the Bombay Sapphire Gin, mango puree, lime juice, and a pinch of salt. Fill with ice and shake until well chilled. Fill a balloon glass with ice and strain mixture into glass. Pour in tonic and stir.Step 3Garnish with the lime wheels. Smack a curry leaf sprig with your hands to release oils, then garnish with the sprig. Curry leaves have a very unique flavor which is slightly pungent with citrus and lemongrass notes, this would complement the herbaceous perfectly! Alternatively, you can use makrut lime leaves or Thai basil, they don't have the same flavor but equally delicious!  Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Curry Leaf and Mango G&T?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleAmazing cocktail recipe, I am sure every mango loving Indian will love it. I added more than a pinch of salt, and it was amazing! :) Ruchita MArizona8/27/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-28", "author": ["Condé Nast", "Bombay Sapphire"]}