{"id": "3c000a04023eef1b048a11fadcea78cb", "url": "https://www.bonappetit.com/story/table-of-truth-coach-barry-switzer", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How I Got My Booth: Coach Barry Switzer on Othello’s in Norman, Oklahoma | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I Got My Booth: Coach Barry Switzer on Othello’s in Norman, OklahomaWhen the legendary football coach first moved to Oklahoma, the only Italian food available was Chef Boyardee. Then he met chef Pasquale Benso.By Barry Switzer, as told to Greg ElwellApril 16, 2019FacebookTwitterEmailPhoto by Rachel MaucieriFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I came to Oklahoma in 1966 with Jim Mackenzie, as an assistant coach for the University of Oklahoma football team, 53 years ago this January. We didn’t have, really, any place to eat. Most of the restaurants were out on Highway 77. We were still in the boondocks. But in 1972, there was an Italian gentleman who came from Brooklyn named Pasquale Benso. But everyone called him Patsy.I asked him what brought him to Norman and he said he’d read that in Oklahoma, they don’t know good Italian food: “All they know is, open a can of Chef Boyardee and pour some thick ketchup over spaghetti.”So he opens a restaurant called Casa di Vinci. He was trying to educate people on the finer Italian dishes, but they didn’t like it. They all wanted Chef Boyardee.He was so entertaining. You just marveled at his humor and his accent and his dialogue. In 1977, he opened this new place, Othello’s, and we became very close. I went to Italy with him probably six or seven times to his hometown of Mola di Bari. This was back in the ’80s and ’90s. He made me a fan of Italy.Welcome to the Table of Truth.\nPhoto by Rachel MaucieriIn 1980, I became single and I ate here every friggin’ night with Patsy at the Table of Truth. It was a small booth with a clear view back into the kitchen. Patsy named it the Table of Truth because it had all these cracks—he said, “You tell a lie at the table and it cracks.”The place would be packed, but nobody could sit there except for Patsy and his friends. People would come in and the waiter would say, “What do you want?” and they’d say, “I want what Coach Switzer is having,” because they knew Patsy himself fixed the dinner we were eating in the back.He couldn’t afford to put the food he made for himself on the buffet line. It was a home-cooked meal every night. I’d come in and say, “What are we having?” and go back sometimes and watch him cook. He’d make baccalà and things that he’d been cooking all his life. That’s what made this table special. Everybody knew what we were eating was different.When I coached the Sooners at OU, I used to bring the other coaches on staff here. Mike Leach, Bob Stoops. Pretty soon they became regulars too. I didn’t want the damn players in here, though. This was the coaches’ place!Everybody knew Patsy and loved him. He was a magnet. People were just drawn to him. You’d meet him one time and you wanted to come back. When I was later the head coach of the Dallas Cowboys, owner Jerry Jones would ask Patsy to come down to fix dinner for him at his mansion in Dallas, which he did on several occasions. I even took him with me to the Super Bowl in 1996 when we beat the Steelers. I looked up at the end of the game and somehow he’d gotten on the sidelines and was standing next to me. He didn’t know a friggin’ thing about football, but I said, “Well, Patsy? You want to go in and play the final down?”As he was getting older, Patsy wanted to move back to Italy, but me and a couple of guys convinced him to stay and open up a supper club where he could cook whatever he wanted.When Othello’s was hit by lightning and burned down in 2017, the new owners found the plaque for the Table of Truth in the rubble. When they rebuilt and reopened, they put the table back in the same spot. Patsy’s not with us anymore, but even when the restaurant is busy, I’ve still got a table waiting for me.Greg Elwell is the Eater-in-Chief of iateoklahoma.com and research editor for Oklahoma Today magazine.Explore Bon AppétitRestaurantsItalian AmericanRed SauceOklahomaRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Barry Switzer", "As Told To Greg Elwell"]}