{"id": "3c10c2398f60b9b9c90b06df28262d52", "url": "https://www.bonappetit.com/recipe/creamed-corn-and-pepperoni-grandma-pie", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Creamed Corn and Pepperoni Grandma Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamed Corn and Pepperoni Grandma PieBy Kay ChunOctober 28, 20204.7(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Pearl Jones, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintThis weeknight pizza introduces the topping you didn’t know you were missing: creamed corn. Blitzing raw corn kernels with ricotta, Parmesan, heavy cream, and olive oil creates a quick and lush creamed-corn sauce. Spicy, salty, and smoky pepperoni complements the creamy sauce, while smoked mozzarella brings an even deeper dimension to the pizza (but regular mozzarella also works). Be sure to top the finished pizza with plenty of bright basil for a super-fresh hit. Although this recipe works best with fresh corn, thawed frozen corn is a fine substitute.Ingredients4 Servings11-lb. store-bought pizza dough¼cup grated Parmesan¼cup fresh ricotta2Tbsp. heavy cream1small garlic clove, finely grated1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¾tsp. freshly ground black pepper1½cups fresh corn (from about 2 medium ears), divided4Tbsp. extra-virgin olive oil, divided, plus more for drizzling2oz. sliced pepperoni8oz. cherry tomatoes, halved (about 1⅓ cups)½cup grated smoked mozzarellaFresh basil leaves (for serving)PreparationStep 1Preheat oven to 500°. Let dough sit, covered, at room temperature 30 minutes.Step 2Meanwhile, process Parmesan, ricotta, cream, garlic, salt, pepper, ¾ cup corn, and 2 Tbsp. oil in a food processor until mostly smooth (mixture will still have some texture). Scrape creamed corn into a small bowl; stir in ¼ cup corn.Step 3Coat bottom and sides of a 13x9\" rimmed baking sheet or baking dish with 2 Tbsp. oil. Place dough in center of baking sheet; gently press and stretch until it reaches to edges and into corners. (If dough springs back, let it rest a few minutes before continuing.) Spread creamed corn over dough, leaving a ½\" border. Top with pepperoni, then tomatoes and remaining ½ cup corn. Bake until crust is golden underneath and cooked through, about 20 minutes. Top with smoked mozzarella and bake until cheese is melted, about 2 minutes. Drizzle with oil and top with basil leaves.Step 4Do ahead: Creamed corn mixture can be made 4 hours ahead. Cover and chill.How would you rate Creamed Corn and Pepperoni Grandma Pie?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleAt first glance, I made the same jokes as several commentators had already made. It's Flatbread, it's not pizza, why isn't the cheese gooey, who the hell puts creamed corn (a terrible food) on top of pizza. I passed the recipe around several whatsapp chats to be scoffed at. Up there with peas in guacamole or raisins in potato salad, some fool trying to \"better\" a perfectly good comfort food with an unneeded ingredient\n\nBut something kept intriguing me about this pizza. Bon Appetit had steered me wrong in the past with recipes that had an unusual mix of ingredients that never coalesced on the plate. Why would this one be different? I went back to the list and saw that the base was essentially a white pie with corn inside of it. The white pie is a fantastic alternative to the traditional cheese slice that most New York City pizzerias serve. My wife and child were big favorites of the white pie and I had made it often enough to know what kind of nutty and oily taste to expect. The corn would add an overwhelming sweetness to it. The saltiness and spice from the pepperoni would be a good compliment to both of those flavours. \n\nI kept building over and over in my head until I was in front of the basil at the grocery store. I silently swore and began going through my pantry, deciding to grab what I was missing, and went straight home to make an overnight warm ferment of pizza dough. This would be my midday election day treat to myself and I knew that would it be perfectly accompanied by a sour and fruity Berliner-weisse.\n\nI didn't used smoked mozz, the corn was thawed from frozen, and I hit it with several dashes of red pepper flakes (I just knew I wanted extra kick), but this Pizza absolutely delivered in flavour, texture, and delight. My wife still had to work today but commented that the pizza made her home lunch feel fancier.  To her, it was as good as any white pie I had made and in some ways better. It's definitely joining the rotation for dinner. \n\nI highly recommend you make this pizza if you ever had a white pie, need a change of pace, or want to expand your cooking palette. You won't be disappointed because this pizza is the truth.\n\nPedro Rainerdo TejedaBrooklyn11/3/2020Sorry, creamed corn also disgusting on a flatbread. Creamed corn is gross period.\nPutting it on a \"pizza\" is a doubly-gross affront to taste and to pizza :-)AnonymousNYC11/1/2020Lord! If this is an abomination then I am all in! Call it a flatbread if you can’t get over corn on pizza! If you don’t want to try anything new and delicious stop looking at great new recipes. PleeeeeseAnonymousOcnonomowoc Wi10/31/2020\"The pizza in the photo looks hardly cooked. The cheese isn't melted, the basil is raw. You need a better photo of the dish to advertise it.\"\n\nSomeone clearly didn't read the recipe before posting a comment. The cheese is melted. It's not gooey because it is added in the last few minutes of baking. The basil is raw because it's added after the pizza is already cooked as is often the case when basil is on pizza.Joshua Ortiz10/31/2020Come on people. This site is for those of us who are interested in expanding our culinary repertoire. Not being subjected to theoretical opinions of people who can't or won't try new things or techniques. It's silly to have to have this repeated continuously  but here we are. \nBTW the recipe clearly states to zhoosh up the pizza with fresh basil for serving and smoked mozz is not the same as reg; it doesn't melt the same (looks). That's why it doesn't look like a normie pizza in the pics.\nCome on we're better than this. Totally excited to hear cooks out there trying this. Heck, looking forward to making this myselfAnonymousLos Angeles10/31/2020The pizza in the photo looks hardly cooked.  The cheese isn't melted, the basil is raw.  You need a better photo of the dish to advertise it.AnonymousLos Angeles10/30/2020The idea of creamed corn on a pizza is an abominationAnonymousNYC10/30/2020Explore Bon AppétitPizzaCornVegetableEasyMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-28", "author": ["Condé Nast", "Kay Chun"]}