{"id": "3c146787558d0d27e8892ab517f35ae9", "url": "https://www.bonappetit.com/city-guides/london/venue/dishoom", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Dishoom Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlondonDishoomThe all-day restaurant that pays homage to former Irani cafes popular in 1960s BombayFacebookPinterestTwitterEmailPhoto by Carey PolisGO HERE: so you can go to the one place everyone tells you to hit up when you're in London (okay, besides Ottolenghi).ORDER THE: house black daal, okra fries, and enough grilled meat and biryanis to make you super stuffed. For breakfast, get the Big Bombay: a plate with a little bit of everything, including buttered buns, baked beans, grilled tomato, bacon, and sausage. You must order the house chai.THE VIBE IS: bustling, efficient, and super fun. Okay, yeah, the hosts do have headsets and the waiters take your order on iPads, but Dishoom doesn't feel like a sterile chain restaurant. Instead, it's just a useful way of streamlining the incredibly high volume of guests coming in for their chili cheese toast fix.PRACTICAL STUFF: Expect waits—even with six locations in London (check the website for hours). Reservations are only taken for groups of six, so plan on camping out at the bar with a Cyrus Irani cocktail (a mix of lime juice, tequila, and turmeric-honey lassi syrup).—Carey PolisWE ALSO LOVEOttolenghiMake a pilgrimage to the Ottolenghi mothership!The Marksman Pub The East London pub with a killer makeoverMomosan ShopAdopt the Japanese hipster home lookExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-07-02", "author": ["Carey Polis"]}