{"id": "3c194a0109a1fc005da86e78771f248f", "url": "https://www.bonappetit.com/story/meymuna-hussein-cattan", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "At Flavors From Afar, Refugees Run the Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAt This Sunny Neighborhood Joint in L.A., Refugees Run the KitchenFrom Chechen manti dumplings to Lebanese ouze, Flavors From Afar founder Meymuna Hussein-Cattan is sharing the home-cooked meals of asylum seekers.By Kaila YuNovember 28, 2021FacebookTwitterEmailPhoto by Matthew PalancaFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Meymuna Hussein-Cattan, who runs the Tiyya Foundation and sister restaurant Flavors From Afar.Tender lamb shanks melt into an Egyptian gravy, soaking the accompanying fluffy rice pilaf. This is one of the most popular entrées at Flavors From Afar, a sunlit restaurant in the Fairfax district of Hollywood opened by Meymuna Hussein-Cattan and cofounder Christian Davis in March of 2020.Alongside a staple menu of customer favorites, each month Hussein-Cattan taps a new chef who is a refugee or asylum seeker to share their culture via home-cooked meals—like Chechen manti dumplings, Lebanese ouze, and Kenyan coconut tilapia. This ensures a diversity of cuisine hard to find in many other restaurants. Most chefs are discovered through the Tiyya Foundation, a nonprofit Hussein-Cattan started with her mother, Owliya Dima, in 2010 to support families of refugees, immigrants, and displaced Indigenous communities. The relationship is self-sustaining: 40 percent of profits generated by Flavors From Afar goes towards Tiyya’s programming.“What I want to do is create a peer-to-peer dialogue,” explains Hussein-Cattan. As an East African refugee who moved to the U.S. in 1984, she knows firsthand how food can be an entry point for cultural exchange and a way to highlight talent over trauma. “I think our stories should be held in care,” she says. “At the start our audience was intrigued by my mother's experience as a refugee—her reasons for fleeing Ethiopia, life in the refugee camp, her transition into America. I wish she was empowered to lead instead with her favorite foods, music, and passion for gardening. [Because], ultimately, she became triggered by her past.”A year and a half after their launch, Flavors From Afar is still cooking. I sat down with Hussein-Cattan to chat about how her experiences as a refugee have shaped her career, why centering joy is important, and her favorite lazy meal on a night off.My parents fled… Ethiopia in the ’70s and I was born in a refugee camp in Somalia. I started the Tiyya Foundation in the U.S. with my mother to support refugee families because we knew how difficult it is to transition into a new country. Most of my upbringing was just watching my parents figure out how to navigate their lives here. However, we hit a wall in 2012 because being active in the non-profit triggered my mother’s PTSD due to the repeated retelling of her refugee experience. Many elders from Ethiopia seldom speak about the violence they witnessed. For my mom specifically, retelling her story brought up vivid memories that were unprocessed. After my mom left the foundation, I had faith [in our cause] and the right people showed up to help.In my experience, refugees are… like alchemists. They’re able to create something out of nothing after losing everything. We’re celebrating them for their gifts and talent as culinary artists—and amplifying immigrant women as the originators of these dishes—and that feels good to me. We introduce dishes that they make at home for their children. These aren’t recipes that you find everywhere; they’re not typically accessible in the American mainstream.As a Black, African, female refugee... I’ve experienced the repercussions of an immigration conversation that is othering. I think [tourists to the U.S.] are treated with higher regard than migrants, who actually bring more long-term value to a new country. Migrants stay, create new businesses, and pay taxes. Displacement is the real problem. It’s the direct outcome of wars, lack of resources, fear of government; it’s fleeing by force. Then, once someone arrives in a new country, they have to deal with language barriers, social isolation, cultural nuances, and discrimination.I had a lot of imposter syndrome… opening Flavors From Afar. All these other restauranteurs in Los Angeles—who are seasoned and at the top of their game—were forced to consider closing their doors when the pandemic hit. Yet I walked in with the audacity to open my doors. We opened the same week as the stay-at-home orders, and not just as a trial run. We opened for real, intending to stick with it for the long haul. I overcame my insecurities by acknowledging all of my transferable skills from the nonprofit sector. I know how to host fundraising banquets, create [social impact] programs, and lead evaluations. I nurtured these traits and trusted myself.I am the taste tester… at Flavors From Afar, not a chef. But I grew up learning to appreciate traditional recipes like injera, doro wat, tibs, and dabo sweet bread. Because my mother spent many formative years in Somalia, my family also grew up with biryani rice, sambusa, and chai in the home. I’m not the most fantastic chef, but I appreciated learning her recipes growing up. It’s something I can pass on to my own daughter.If I want a night off from cooking… I’ll go to Del Taco for their chicken soft tacos. It’s been my vice since high school—my go-to comfort food. Otherwise I’m all about the ambience of a place. I love the L.A. skyline, so I look for rooftop [bars and restaurants]. My favorite is Perch because the food doesn’t disappoint and the drinks are good. But I’m easy; as long as I have a nice view I’m good.The Ethiopian food I miss the most… is my mom’s home cooking. My parents live in Seattle now, and I only get to see them about twice a year—although we call and Facetime almost every day. I love the breakfast that she makes: her ful medames with Ethiopian spices and her sambusa with her secret blends.When you dine at Flavors From Afar… there’s an element of respect and reverence towards the refugees. There’s something about eating good food and knowing that the money is going back to a good cause. You’re nourished, but your heart also feels full.Explore Bon AppétitPerson of InterestRestaurantsRead MorecultureHey, It's Your Korean DadBy Bettina MakalintalcultureThis Twitter Tarot Reader Finds Mental Health Wisdom in the CardsBy Joseph HernandezLifestyleAlexis Nikole Nelson Is Making #ForagerTikTok Our Favorite Place to BeBy DennyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-28", "author": ["Condé Nast", "Kaila Yu"]}