{"id": "3c3d2cafc85213674a65921f35df2b04", "url": "https://www.bonappetit.com/story/how-to-make-flavorful-broth", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "How to Make the Best Broth, According to an Expert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make the Best Broth, According to an ExpertTurns out there’s more to great broth than throwing a bunch of scraps into a pot.By Elyse InamineFebruary 19, 2022FacebookTwitterEmailPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieFacebookTwitterEmailFor my entire cooking life, I took a kitchen-sink approach to broth. I grabbed the limp vegetables hiding in the crisper, the chicken carcasses and pork bones on the cusp of freezer burn, some chopped onions, and an old parm rind. I threw it all in a pot of water. I brought it to a simmer. I called it a day. This is a perfectly adequate approach, especially for any other cooks who straddle lazy and productive like me. And I was content to continue down this path of perfectly fine broth until I worked with Eric Sze, the chef-owner of 886 and wenwen in New York City, on this guide to hot pot.I snuck into the test kitchen while he and assistant food editor Jessie YuChen were cross-testing the broths for the story, and I was blown away by how delicious a vegetarian broth could be. I only slurped one spoonful, but even so I remember it clearly. It was unlike any broth I’d ever made: rich and deep with mushroomy flavor and distinctly herbal angelica root, thick and silken in texture like good tonkatsu, and rounded with a wisp of sweetness from rock sugar. I had a broth awakening.“Cooking is like building a house,” Sze told me later on. “You need to lay a foundation, then put down the bricks, the walls, the roof. Broth is very much the same thing.”For him, broth isn’t a reactive response to what’s in your fridge but rather a proactive choice to build something delicious. This isn’t to say that making an intentional broth will require much more effort than what you are already doing. When you decide to make broth, you’re already committing a certain amount of time and energy—here, Sze focuses that time and energy so the final liquidy product is less shot in the dark and more bull’s-eye. Below are the techniques, tips, and mantras he relies on to make broths with a little more intent and a lot more flavor.1. Pick your base ingredient.Before you start cooking, figure out what kind of broth you want: veg or meat? Whatever you choose, make sure you get a variety of that base ingredient. That means, if you’re doing a mushroom broth, don’t just buy shiitake but also enoki, king oyster, and portobello. If you’re making tomato soup, turn to fresh tomatoes, canned tomatoes, and paste. For cabbage soup, seek out Napa cabbage, green cabbage, savoy cabbage, and Taiwanese cabbage. Or, if you’re craving a beefy broth, get several types of beef bones and cuts: shank, top round, even ground beef. “It adds another element,” Sze shares. “You want the same umbrella of flavor but different pockets and punches of that flavor.”2. Then show it some TLC.Once you’ve chosen your path, prep that base ingredient. For a veg broth, cook down the base ingredient in a pan (or roast in an oven) to sweat out all the moisture and concentrate the flavor. For a meat broth, Sze blanches the bones to clean them before adding to the broth. “That’s my Taiwanese heritage talking,” Sze says.3. Unleash Maillard.If vegetables or meat are your superheroes, aromatics are their trusty sidekicks. Sze’s favorites come from the allium family—onions, garlic, scallions, leeks—which he gives a rough chop and browns in a pan, a crucial step. This upgrades your already very flavorful and fragrant aromatics to Super Saiyan level (I’ve been watching a lot of anime recently). “Broth never exceeds 212°F, so you need to unlock the Maillard reaction in the aromatics before adding the liquid,” he says. “Sear them to get them golden brown, then drop them into liquid.”4. Add depth beyond salt. You’re likely already salting your broth, but you’re probably not adding Taiwanese rice wine, MSG, or sugar for depth. And I would say that these ingredients are where the magic of Sze’s mind-blowing broths lies. “I always reach for Taiwanese rice wine, which balances out any gaminess from meat and also works well for veg broths,” Sze says. Just as valuable and versatile is MSG, which brings umami to whatever it graces, and rock sugar, a staple pantry ingredient in many Asian households, including Sze’s. “It’s the same as cane sugar, and it’s inexplicable,” he explains. “I add in a little bit at a time, tasting as I go. The sugar accentuates whatever flavors you’ve already developed.”5. Take your time.“Time is the most expensive ingredient” is Sze’s mantra. Once you have all your ingredients ready—blanched bones or sweated-out vegetables, caramelized aromatics, rice wine, MSG, and sugar—add water and bring it to a vigorous boil. Then sit back and relax.Vegetable broths come together quicker, usually around 90 minutes, whereas meat broths can take about 12 to 24 hours or until “the broth tastes pungent and not like tap water,” Sze says. Sure, you could try a pressure cooker, but Sze has misgivings. “It increases the pressure so that things cook faster, but it doesn’t release moisture,” and liquid needs to evaporate for flavors to concentrate, he says. Think about it: “Sun-dried tomatoes have intense tomato flavor because they’re totally dehydrated.” Anecdotally, any time Sze has tried to pressure-cook broth, it hasn’t come out as good compared to ye olde broth-making. “Not scientifically proven—just my personal opinion,” he adds.6. Skim off the right stuff.If you see any scum—those light brown, cloudy clusters of denatured protein—ladle it out. It’s not bad for you, just ugly. But hold off on skimming the fat. “Fat is your friend,” Sze says. “I like to fish out the fat at the end, so I can choose exactly how much fat I want in the broth. Any extra fat I keep for stir-fries.” Once the broth is done boiling, strain it, cool it, then remove as much fat as you want. All you’re left with is liquid gold.Now you’re ready for your own broth awakening.Broth o’clockMala Beef Hot Pot BrothThis fiery red broth is a labor of love, but it’s worth it—your hot pot spread depends on a rich, flavorful base.View RecipeHerbal Mushroom Hot Pot BrothUmami-rich and flavorful all on its own, this vegan hot pot base is also a welcome palate cleanser when served alongside a spicy broth.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-19", "author": ["Condé Nast", "Elyse Inamine"]}