{"id": "3c3fdc813c40630931ff22e1514abd95", "url": "https://www.bonappetit.com/recipe/potato-and-egg-salad-with-cherry-tomatoes-and-olives", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Potato Salad with Bacon and Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssuePotato Salad with Bacon and EggsBy Bryan FurmanMay 22, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintCan’t decide if you’re in the mood for egg salad or potato salad? We’ve got you covered, and then some, with bacon and canned black olives on top. This recipe is from B’s Cracklin’ BBQ in Savannah, GA. Read more about pitmaster Bryan Furman here.Ingredients8 servings6medium russet potatoes (about 2 lb.), peeled, cut into 1\" pieces2Tbsp. plus ½ tsp. kosher salt3large eggs4slices bacon1cup mayonnaise½cup sour cream2Tbsp. dill relish1Tbsp. Dijon mustard1Tbsp. garlic powder1Tbsp. freshly ground black pepper1cup halved cherry tomatoes½cup halved pitted black olives from a canPreparationStep 1Place potatoes in a large pot and pour in cold water to cover by 2\". Add 2 Tbsp. salt and bring to a boil. Reduce heat and simmer until potatoes are just tender, about 15 minutes. Drain, then let cool slightly (the potatoes should be warm when you dress them, which will help them soak up the dressing).Step 2Meanwhile, cook eggs in a large saucepan of boiling water 8 minutes (whites and yolks will be set). Drain; transfer to a bowl of ice water and let cool. Drain, peel, and quarter eggs.Step 3Cook bacon in a large skillet over medium heat, turning halfway through, until brown and crisp, 8–10 minutes. Transfer bacon to paper towels to drain and let cool slightly. Tear into 1\" pieces. Reserve 2 Tbsp. bacon fat in pan.Step 4Whisk mayonnaise, sour cream, relish, mustard, garlic powder, pepper, and remaining ½ tsp. salt in a large bowl. Add potatoes, eggs, tomatoes, olives, half of bacon, and reserved bacon fat and fold gently until combined and completely coated. Transfer salad to a platter and top with remaining bacon.How would you rate Potato Salad with Bacon and Eggs?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThank you Bryan Furman for sharing this amazing recipe - absolutely amazing and everyone ate it up! I made exactly as stated and think the dressing would have been enough for another potato - that’s the only thing I’d do differently. And I will definitely stop by Cracklin B’s BBQ if I’m ever in the area to taste the original. AnonymousRenton, WA7/4/2020This will be my go to Potato Salad Recipe going forward.  It has just the right blend of salt, creamy and tang. redexecAnaheim Hills CA7/17/2018Delicious! I halved the recipe and it was perfect.  Great blend of flavors. Anonymous7/4/2018Explore Bon AppétitSaladPotato SaladSouthernAmericanPotatoVegetableBaconCured MeatMeatOliveOther IngredientsCherry TomatoTomatoRusset PotatoEasySideGluten-FreeSimmerFourth Of JulyMemorial DayLabor DayJuneteenthLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}