{"id": "3c67a492fec0f51c08b742bd9b53a644", "url": "https://www.bonappetit.com/recipe/spicy-braised-eggplant-noodles", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Spicy Braised Eggplant Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueSpicy Braised Eggplant NoodlesBy Chris MoroccoJuly 6, 20213.9(69)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis weeknight noodle dish uses gochujang, miso, and tomato paste for deep flavor in no time. Long, slender Japanese and Chinese eggplant cook faster and get more tender than their globe-shaped cousins.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonColander$11 At AmazonLarge Nonstick Skillet$50 At AmazonSilicone and Stainless-Steel Tongs – 2 Pack$17 $9 At AmazonIngredients4 ServingsKosher salt12oz. dried wide rice noodles3Tbsp. gochujang (Korean hot pepper paste)1Tbsp. white or yellow miso6Tbsp. extra-virgin olive oil, divided1½lb. medium eggplant, preferably Japanese, sliced ¾” thick6garlic cloves, thinly sliced11” piece ginger, peeled, finely chopped2Tbsp. double-concentrated tomato paste2Tbsp. unsalted butter3scallions, thinly sliced¼cup chopped salted dry-roasted peanutsPreparationStep 1Bring a large pot of lightly salted water to a simmer. Remove pot from heat and stir in noodles. Let soak, stirring often, until very al dente. Drain, reserving 1 cup noodle cooking liquid. Rinse noodles under cold running water.Step 2Mix gochujang and miso in a small bowl, gradually adding 1½ cups warm water, until smooth.Step 3Meanwhile, heat 3 Tbsp. oil in a large skillet, preferably nonstick, over medium-high. Add eggplant and drizzle with another 2 Tbsp. oil; season lightly with salt. Cook, undisturbed, until golden brown, about 3 minutes. Toss; continue to cook, tossing occasionally, until most of eggplant are golden and nearly tender, about 5 minutes more. Transfer eggplant to a plate.Step 4Reduce heat to medium and add remaining 1 Tbsp. oil to skillet. Cook garlic and ginger, stirring often, until golden, about 2 minutes. Add tomato paste and cook, stirring, until slightly darkened, about 1 minute. Stir in gochujang mixture and return eggplant to skillet. Cook, stirring occasionally, until eggplant are nearly falling apart, 6–8 minutes.Step 5Add noodles, butter, and ½ cup reserved noodle cooking liquid to skillet. Cook, tossing often and adding more cooking liquid as needed, until sauce is glossy, about 2 minutes; season with salt.Step 6Serve noodles topped with scallions and peanuts.How would you rate Spicy Braised Eggplant Noodles?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleFlavor not very good. Fair amount of work. Disappointed by this recipe. It is missing something.  Anonymous1/19/2022I would really like to try this recipe. I live in Panama and Chinese/Japanese eggplant are pretty hard to come by. Has anyone made this with the domestic variety? We have lots of the here and they are generally on the smaller side.\nThanksKenPanama1/18/2022With a few minor mods, this was perfect! As per other reviewers, I added black vinegar and soy sauce (omitting miso for all the sodium). The water used with the gochujang was the noodle water, hence little needed later on. 60% of the noodles used, aubergines were roasted in advance for convenience. Not bland at all! I love spicy food, and this was max yet balanced. Squeeze of lime to serve. YUM! Also, adding in extra veg (if you wish) such as bell peppers, peas, and/or mushrooms were all happily received.NikiCalgary, AB11/27/2021Hard pass on a do over. With all the gochujang one would think the result would be spicy.  Instead, I ended up with a soggy  pile of mushy, watery noodles that had little more taste than spicy pasta sauce.  The eggplant gets completely lost, so ignore the photo.   If this is supposed to be a quick weekday meal, I shouldn’t have to “doctor” an entire recipe to enjoy it.  JenaCassDallas10/26/2021I thought this was great with some easy tweaks and will be going in my easy weeknight rotation. I would definitely use Chinese or Japanese eggplant if you don't want it to turn to mush like Italian eggplants do. Miso also varies a lot in strength so add more if you know yours is lighter in flavor. I also added 2 Tbsp each of soy sauce and chinkiang vinegar per the suggestions, and left out the extra noodle water at the end. I used an entire bunch of scallions and cooked the whites with the ginger and kept the greens out for a fresh garnish at the end. AnonymousBerkeley, CA9/17/2021Made this exactly as specified and it turned out great.  Noodles were addictively good!   Easy to customize the veg if you want but the noodles and sauce were perfect.AnonymousBurlington, ON9/7/2021OK-- my daughter and I have now made this dish twice, once as is and the second time last night with some tweaks that I will now pass on.\n1. As per the advice below, I also recommend some soy sauce and rice wine vinegar. We added these into the miso mixture. \n2. We loved the peanuts on top and wanted more of that flavor so while this may sound completely unorthodox, we added a tablespoon or two of good peanut butter to the mix, as well\n3. We also wanted a more pronounced eggplant flavor so we grilled the eggplant and then added it into the sauce.\nI would recommend all of these adjustments. I hope it doesn't sound like we took the dish too far in another direction. It was delicious! AnonymousWashington DC9/4/2021This was superb! I was amazed at the quantity we ended up with but also delighted to be able to have spicy noodles and left over roast chicken to take to work for lunch the following day. Great flavours, straight forward methods and economical. Winner!Greg KingTasmania Australia9/1/2021This was excellent, but I also modified a bit. I doubled the gochujang since it was a bit too mild and lacking spice and flavor. I also added seasoning sauce or light Soy sauce for depth of flavor before removing it from the  heat. The liquid was perfect for the amount of noodles. The eggplant was delicious and squeezing a bit of lime over the finished noodles made it perfectly balanced.\n\nThank you for this recipe. \nMayi Silver Spring, ME8/31/2021Do you always prepare with the skin on ?Bodo AlexanderSan Miguel de Allende Mexico8/29/2021This is an excellent recipe ! the only changes I made was to peel the eggplant (I’m allergic to the skin) and I used tofu noodles to cut down on the carbs. It was delicious and I will be making this for years to come. So money ! Thanks Bon Appetit !ChefRachelle NYC8/29/2021I was excited for a simple veg recipe but it was bland and a poor fusion. Imagine trying to jazz up spaghetti and prego by adding gochujang and peanuts and you'd be pretty close to this recipe.AnonymousSan Luis Obispo, CA8/25/2021I’m surprised that I also found it a little bland — maybe it depends on the quality (or age) of the miso and gochujang. A splash of rice vinegar brightened it right up, though. Next time I’ll reduce the quantity of noodles so it doesn’t feel so pasta-forward (the eggplant kind of disintegrates, in a good way) and be generous on the ginger and miso. I might also need to toss more comprehensively at the end - the bites that were stuck to the pan were much better. J DubRaleigh, NC8/25/2021Loved the simplicity and technique in this recipe. The amount of water used with the gochujang and miso seems daunting, but it cooks down and into the al dente rice noodles so they pick up the flavor. I do think it needed a bit more salt and an acidic component. We added some lime juice and a dash of rice vinegar to our individual bowls and that definitely woke it up. Will definitely use this noodle cooking/flovoring technique again and try a new spin on the vegetable/protein component.mccarrotColumbus, OH8/12/2021After reading the reviews I had my reservations but already had all the ingredients on hand so I gave it a shot. I did make a few modifications so YMMV: I subbed half a pound of the eggplant for fresh green beans which I blistered in the hot pan after the eggplant and then added back at the same time as the eggplant, reduced the amount of water to add to the miso/gochujang to around 1/2 cup, and didn't have any scallions so I used fresh basil. I also served it over rice instead of noodles as mentioned by a few others, but plan to serve the leftovers with noodles to see how that works. I cannot understand the reviews that said it was bland as it was quite spicy for my taste. I think the scallions were needed as I wanted more allium flavor, but the sauce consistency was excellent and the eggplant texture was perfect. I think next time I would replace one 1tbsp of the gochujang with 1tbsp of additional miso to moderate the heat and add a bit more savory note, and perhaps adding a bit of ground pork to boost the protein and lend a meaty flavor like you might find in Chinese eggplant with garlic sauce.ErikaMinneapolis, MN USA8/11/2021Explore Bon AppétitRice NoodleNoodlePasta & NoodlesEggplantVegetableMisoCondiments, Sauces & PastesSummerFallEasyWeeknight MealsMainVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Chris Morocco"]}