{"id": "3c9f544d6ccbd2faf60f9f1567e78e52", "url": "https://www.bonappetit.com/recipe/kimchi-jjigae", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Kimchi Jjigae Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueKimchi JjigaeBy Sohui KimJune 1, 20194.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintWhile firm tofu is traditional, any vegetable or meat would be in good company with this stew’s spicy-funky base of kimchi, gochugaru, and gochujang.Ingredients4 servings6oz. pork belly or pork shoulder or 4 oz. bacon1small onion, finely chopped2cups chopped Napa cabbage kimchi with juices2Tbsp. gochugaru (coarse Korean hot pepper flakes)1Tbsp. gochujang (Korean hot pepper paste)8oz. firm tofu, cut into 1\" pieces2scallions, thinly slicedCooked rice (for serving)PreparationStep 1Slice pork belly into long strips about ½\" thick, then thinly slice strips crosswise. Heat a small pot over medium. Add pork belly and cook, stirring often, until some fat has cooked out into the pan and meat is cooked through but not browned, about 3 minutes. Pour off all but 1 Tbsp. fat (if needed). Add onion and cook, stirring often, until translucent, about 5 minutes. Add kimchi and juices and cook, stirring occasionally, until liquid evaporates and kimchi is softened, about 5 minutes.Step 2Add gochugaru, gochujang, and 2 cups water and bring to a simmer over medium-high. Reduce heat to medium and cook, stirring occasionally, until kimchi is very tender and flavors in stew come together, 20–30 minutes.Step 3Add tofu to stew and cook until heated through, about 3 minutes. Divide stew among bowls and top with scallions. Serve with rice alongside.Step 4Do Ahead: Stew can be made 4 days ahead. Let cool; cover and chill.How would you rate Kimchi Jjigae?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis version is a tad more benign than the version in Chefs Sohui Kim’s cookbook Korean Home Cooking but for an introduction it’s still tasty and comforting.  If you like it find the cookbook.FAWNY, NyY10/26/2021I love this and I've made it so many times! Now that I've seen the comments I might try it the traditional way too.AnonymousVancouver, Canada1/14/2021Now that I see the comments will definitely try the more traditional versions.brushjlsolon, oh12/17/2020Agree with the comment below - this recipe lacks umami/seasoningAnonymousVancouver5/1/2020I love you Bon Appetit, but I’m sorry this recipe is seriously lacking. I would recommend following a more traditional approach with the broth base by adding kelp, anchovies, daikon, and green onions to help create the umami that’s missing.SylveeuhLA9/23/2019OMG, this recipe was spot on for me! Thank you, thank you, thank you Sohui Kim and Bon Appetit!!! The kimchi I used was store bought (eek!!) so the spices were already there, but this was a definitely bowl of comfort just as Sohui Kim said!!!AnonymousAcworth, GA4/26/2019So where is a recipe for the Kimchi???AnonymousTX3/10/2019Thanks for the tips. I used spicy kimchi and didn’t worry about the paste as the previous commenter recommended. A little salt was perfect. Thanks for the tip!AnonymousChicago 3/9/2019I’m not trying to be pedantic here, but traditionally, kimchi jjigae would not have any gochujang in it. Some people add dwenjang (korean miso paste?) depending on the flavor of the kimchi, but we usually don’t add gochujang. We normally use salt for seasoning. Anyways, I’m really happy to see more Korean recipes on here! I’ve always loved Bon Appetit, but I think I love it even more now. Thank you!AnonymousKorea2/16/2019Explore Bon AppétitStewSoups and StewsKoreanEast AsianAsianPork BellyPorkMeatTofuOther IngredientsWinterEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}