{"id": "3ca621403d2130271fc628de210cdb55", "url": "https://www.bonappetit.com/story/baking-powder-vs-baking-soda-difference", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Baking Soda vs. Baking Powder: What's the Difference? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBaking Soda vs. Baking Powder: What’s the Difference?Keep messing up your baked goods? This article is for you.By Claire Saffitz and Nico AvalleFebruary 18, 2022FacebookTwitterEmailChelsie CraigFacebookTwitterEmailNo matter where you are on your baking journey, at some point you’ve probably asked yourself, “what’s the difference between baking soda and baking powder?” It’s a reasonable question: They’re both plain white powders and their names certainly sound similar. We’d be lying if we said we hadn’t wondered the same thing once or twice in the past before tying on our aprons.It’s totally fair to be confused because baking powder and baking soda actually do have a lot in common: They’re both chemical leaveners, which means that they add volume to baked goods by generating gas during the mixing and baking of a batter or dough. Cakes, muffins, scones, quick breads, and basically anything you’re baking that doesn’t include yeast (a biological leavener) or beaten eggs (a mechanical leavener) rely on these compounds to produce a light texture or “crumb.”Still, while they look the same, sound the same, and do virtually the same job, they aren’t substitutes for each another—at least, not entirely.So, what’s the difference between baking soda and baking powder?Let’s start with the science: Baking soda is the commercial name for sodium bicarbonate. When sodium bicarbonate comes into contact with an acidic liquid—think buttermilk, yogurt, sour cream, molasses, coffee, citrus juice, or vinegar—it produces carbon dioxide gas, and those bubbles produce the lift that you’re looking for. (If you’re having flashbacks to the papier-mâché volcanoes you made for the science fair, you’re on the right track.)Definitely worth keeping in mind: This reaction starts as soon as the two ingredients are mixed together and weakens with time. A good rule of thumb is that if a recipe calls for leavening with baking soda only, you should get the batter or dough into the oven as quickly as you can before the reaction peters out. Otherwise you might end up with flat cupcakes or muffins, even if you did everything else perfectly.Baking powder comprises sodium bicarbonate and powdered acid—often cream of tartar. When moisture is added to baking powder, the same gaseous reaction can occur without the need to introduce a separate acidic ingredient. If you’re really in a pinch, you can make a single-acting baking powder at home by mixing cream of tartar and baking soda, although we wouldn’t recommend it for every recipe. That’s because most of the baking powder you find at the grocery store is double-acting. This means that the mix includes a secondary powdered acid and cornstarch, which acts as a drying medium. With double-acting baking powder, the first reaction begins immediately when the powder dissolves in the batter, but the second reaction (driven by that secondary acid) occurs more slowly when heated.Thanks to that delayed reaction, double-acting baking powder gives bakers a bit more flexibility. The batter or dough can sit for a little while without the baker worrying whether or not it will rise in the oven. It also allows you to bake light, airy confections in the absence of an acidic ingredient. Powder has the leavening power to puff all on its own.One other side effect of the additional ingredients in baking powder is that the mix is less concentrated (and thus less powerful) than baking soda. In fact, 1 teaspoon of baking powder has approximately the same leavening power as just ¼ teaspoon baking soda.Why do some recipes contain both baking soda and baking powder?If it’s really as simple as whether or not a recipe has an acid in it, then why all the fuss about when to use baking soda versus baking powder—and why do some recipes call for both? Well, it turns out that reality is a bit more complicated. For one, when you mix baking soda with an acid, it doesn’t just create CO2. It also neutralizes the acid, raising the overall pH and making the batter more alkaline. In practical terms, this lessens the sour flavor of ingredients like lemon juice and apple cider vinegar, meaning less tartness in your final dish. Push this too far by adding too much baking soda, and the recipe could end up with an unpleasant soapy flavor. Not good, right? The amounts of acid and sodium bicarbonate in baking recipes must work in perfect equilibrium for the baked item to reach the right level of airiness. In most cases that means soda plus powder.Buttermilk biscuits are a useful example. Buttermilk is acidic, so your impulse might be to reach straight for the baking soda. But tangy buttermilk is one of the hallmarks of any good buttermilk biscuit, so you don’t want to completely neutralize the acid in your biscuit dough. Instead, you can use a bit of soda because the immediate chemical reaction with the buttermilk gives the biscuits a big lift right out of the gate. But to get the rise you want without killing the tang (which would be the result of too much baking soda), you’ll need to incorporate baking powder as well, taking advantage of the delayed double-action to add even more levity. Combining the two leavening agents produces a biscuit that is both light and tangy. In baking as in life, it’s all about balance.Many recipes need both kinds of reactions to achieve the intended overall balance of flavor and texture, which is why you’ll often see both baking soda and baking powder in a recipe. Even though the ingredients are both adding air during the baking process, they’re complements, not substitutes.If the biscuit example doesn’t have you convinced, you should also know that baking soda enhances browning, which gives baked goods their appealing golden hue. Baking soda also weakens gluten, which helps things like cookies or pancakes spread out while keeping them soft and chewy rather than overly dense.Some recipes do call for using a single leavener and, in fact, there is a common pneumonic device to help you remember the benefits of using baking powder versus soda: “Powder puffs. Soda spreads.” As in, recipes that call only for baking soda will continue to spread in the oven following the rapid acid-base reaction, while those made with just baking powder will rise, adding lift long after baking soda has given up.So, in short: Baking powder and baking soda are discrete ingredients with the same primary objective—making your baked goods light and fluffy—that they accomplish in different ways depending on the recipe. They can’t be substituted for each another, and most of the time, they can work as a team, supporting each other. If you take one thing from this article, it should be that if you ever see both on an ingredient list and wonder if you really have to go back to the store to pick up another box of the one you ran out of, the answer is, forever and always: Yes.Explore Bon AppétitcookingRead MoreEasiest Chocolate Birthday CakecookingLight Versus Dark Brown Sugar: What’s the Deal?By Sarah Jampelrecipes47 Easy Cookie Recipes You’ll Make on RepeatGallery47 SlidesBy Alyse WhitneyshoppingWhy I’m Weirdly Obsessed with Drinking Hot WaterBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-07-25", "author": ["Condé Nast", "Claire Saffitz", "Nico Avalle"]}