{"id": "3ca9f680180d51b28e51d8849842d6bc", "url": "https://www.bonappetit.com/story/marion-nestle", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Marion Nestle on the One Thing She’d Change About the Way We Eat Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNutrition Goddess Marion Nestle on the One Thing She’d Change About How We EatWe talked to the no-B.S. nutritionist about how the American diet got so out of whack.By Alex BeggsOctober 30, 2018FacebookTwitterEmailNeilson BarnardFacebookTwitterEmailIn our series Person of Interest, we talk to the people catching our eye right now about what they're doing, eating, reading, and loving. Up next, dietitian, professor, and all around nutrition goddess Marion Nestle, whose book Unsavory Truth is out now.I recognized Marion Nestle and her halo of white curls immediately and flagged her down inside Fairfax, an all-day café with a sound decibel hovering around 75. Nutrition goddess Nestle doesn’t really do technology, except for a sound-measuring app so she can quantify how damn loud it is in here (85 is the worst in New York City restaurants, she says). It’s not atrocious, but the music could be taken a crank to the left.Nestle is the Paulette Goddard Professor and Professor Emerita at NYU, where she recently retired from teaching after 30 years. Her 2007 book Food Politics won a James Beard Award for exposing the food industry’s entrenched influence on public health. She followed it up with Soda Politics, which blew up Coca Cola’s spot for downplaying the truth about sugar. And her newest book, Unsavory Truth, explores the conflicts of interest behind food studies funded by food corporations, the proven biases they create from the get-go, and how this directly affects the way we eat now.As it turns out, Nestle doesn’t do breakfast (She’ll have a latte, though, regular milk.) And, no, don’t tell her it’s the most important meal of the day because nobody calls bullshit faster than her. “Most of the research on why breakfast matters is done by breakfast cereal companies. Big surprise!” she says. She’ll eat later, around 11, having a bowl of Mini Wheats (unfrosted). She adds her own turbinado sugar (“the brown stuff!”) and fruit. Lunch might be a salad, and dinner could be a nice piece of fish. “I eat completely normally,” she says when I pry for more details. “I follow my own dietary advice with no trouble at all.” No processed food, small portions, and plenty of fruits, vegetables, and whole grains. Well, and the occasional bowl of ginger ice cream, if she can track it down. We talked about how the American diet got so out of whack, how to think about nutrition without overthinking it, and what gives her hope in the wellness world.I find joy... in having a wonderful dinner with friends at a quiet restaurant.My rules for eating... are simple. I will say, the food industry has gone to a lot of trouble to induce distrust and confusion and to make people not understand how simple it is to eat healthfully. Don’t eat too much. Make sure you have vegetables and don’t eat too much junk food. I mean, really, that’s all there is to it.The big problem in American diets today... is that people eat too much.Everything changed... between 1980 and 2000 was when portion sizes got bigger. I remember being shocked by the size of muffins. All of the sudden, they were like this [Nestle gestures a huge muffin explosion]. They’re not good because the way that muffins bake, the outside and the inside ratio is much, much better with the smaller ones, which are delicious. The big ones, in order to make them rise, you have to use a lot of baking powder and that kind of thing, and they don’t taste as good. I never understood it, why people want them.The question that I get asked most is... “Why is nutrition so confusing?” And “What am I supposed to eat?”The thing about dieting is that... all diets work, no exceptions, as long as you follow them. Dieting is not fun. And you know, my approach to this is eat what you like. Don’t eat too much. Makes a big difference. You can get away with a lot if you don't eat too much.I just wish... everybody enjoyed what they’re eating more and stopped worrying about it.Another thing people ask me a lot... is “Who do I trust?” It’s very difficult for people who don’t have access to an online library [of scientific journals]. I tend to trust government health agencies. Mayo clinic’s not bad if you’re looking for general advice. The CDC’s health advice is pretty reliable. You go to government sources where presumably they don’t have that ax to grind, and hope for the best.The SparkNotes from my class on food activism are... first, define a goal. What do you want? If you’re going to do lobbying or advocacy, you have to have a very specific goal. Then, you develop a plan for achieving that goal. What would it take to achieve that goal? Healthy school lunches is a good example. You need to identify who the person is in that school or school district who could make that happen? And then, what kind of allies do you need? Who do you have to get to work with you on this? What kind of information do you need in order to make a strong case? That’s how you do it.I have a healthy skepticism about... looking at the food industry as a social service agency. It’s not. Food companies are businesses. Their job is to sell.Something new I’m getting into... is studying Spanish. I’m doing Rosetta Stone. I have flashcards and a grammar book.My birthday dessert is... oh I love sugar. Ice cream. I like it with fruit.To me, eating is... a normal part of the day. It’s just normal. It’s a place where I can eat something pleasurable every time.I see hope in the wellness movement… because you can get much, much better food now, everywhere, all year round. And the movement towards fresh, local, seasonal is terrific. And the food waste movement will put pressure on the production side and get people to stop producing quite so much. That would help a lot. I love it that so many people are interested in food. That’s exciting.I’m inspired by... the students I teach. Always. The students who we teach want to learn. And they want to change the world for the better. And I’d like to do everything I can to support that. I think that’s a really, really good way to spend a life.Explore Bon AppétitPerson of InterestBooksHealthyishInterviewsHealthyRead MoreLifestyleOra Wise Is Building Community Through Food and Finding Joy on the Dance FloorBy Keia MastrianniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Alex Beggs"]}