{"id": "3caaf18d2aac392601812c05d5ce5d51", "url": "https://www.bonappetit.com/story/home-sweet-holidays", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "All the Holiday Cookies You Could Ever Desire | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Time for Holiday Cookies Yet?Our December issue is off the sweet end—and I couldn’t be happier.By Dawn DavisDecember 4, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Once a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.I blame it on Ted Lasso and his pink boxes full of fresh-baked shortbread: Our obsession over holiday cookies started early this year. Case in point, the popularity of our Salted Caramel Apple Cookies online and the feverish hunt for more irresistible cookie recipes that followed. We found them in an array of new cookbooks and decided to share our favorites for the holidays. When a tray of all the cookies was brought down from our test kitchen—which has finally reopened!—I took more than my share of Dorie Greenspan’s Iced Spiced Hermits. I hope no one was counting. Also impressive was the Pink Grapefruit Sugar Cookie, pictured above, from Jesse Szewczyk’s cookbook, Cookies: The New Classics.Cookies: The New Classics$28 $23 at AmazonWe’re also drawn to cookbook author Ayesha Curry, who designed a gorgeous menu for this year’s festivities. The Prime Rib Roast With Habanero Crema is succulent, tender, and paired with an easy side of cabbage and carrots (made fancy by a boost of aromatics and allspice). A colorful salad topped with a bright citrus dressing and a sticky-sweet rum cake round out the meal.As writer Elizabeth Acevedo reminds us in her essay for our column “All on the Table,” it’s non-materialistic things like family—and who is headlining in the kitchen—that matter most this time of year. But if you are in need of some presents, check out our gift guide. I can’t stop staring at that Bloom Teapot. And speaking of tea, you’ll never guess who Jimmy Fallon is inviting to his dream party.'Tis the season:The Ultimate Bon Appétit Gift Guide For Every Food Person You KnowHand-marbled serving bowls, gift-worthy coffee subscriptions, and the platonic ideal of a panettoneView StoryExplore Bon AppétitLetter From The EditorCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-04", "author": ["Condé Nast", "Dawn Davis"]}