{"id": "3cb8cc33eb87a05fa106b44ce30cc09b", "url": "https://www.bonappetit.com/story/pipeno-post-zoom-wine", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Pipeño Is Our Post-Zoom Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePipeño Is Our Post-Zoom WineUncorking a bottle of this bright, slightly bubbly Chilean wine is our winding-down ritual.By Joseph HernandezAugust 21, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWelcome to The Pour, a monthly column about what we’re drinking right now.It was the height of late summer, just beginning to hint at briskness. That day was sticky and wet, and the grass below me was sharp, freshly cut. It had been weeks since I’d left the house, glued to my seat, one Zoom chat after another. But today was for self-care, to unplug, to feel the sun on my face.Viña Maitia Aupa is traditionally made with grapes from a 120-year-old vineyard and drinks like a full-bodied rosé.\nPhoto by LAURA MURRAYAll I brought with me to the park was a book, a wine key, and a chilled bottle of Cacique Maravilla’s Pipeño País. I’m hesitant to call pipeño-style wines natural, which now comes with a certain cool-kid baggage, but of course that’s what they are. Typically, these unfiltered wines are made of País, a native Chilean grape, farmed with low-intervention methods, and exhibit a hazy ruby color while spontaneous fermentation contributes a whisper of effervescence. But to me these descriptions and categorizations erase the work of winemakers like Manuel Moraga Gutierrez, whose family has been making País-based wines for seven generations in Chile’s Biobío region—and long before your friend in Brooklyn started crowing about natty wines.Louis-Antoine Luyt Pipeño Portezuelo is one of several pipeños the brand makes—each highlighting a different farmer. This one from Patricio Martinez is particularly juicy.\nPhoto by LAURA MURRAYAs wine importers and somms quest for the next great thing, they’re seeking out wine styles like pipeño. This category dates back to the 16th century, at least, and is kept alive by Chilean farmers. Recently, it’s gained popularity Stateside because of the demand for “honest” wines made from native grapes and ancient vines. Pipeño is meant to be drunk young, and this bottle speaks of the farmers who enjoy pipeño on the regular. It’s enormously gulpable, bright berries and crisp acidity all the way down.There’s arguably no better wine to pair with the sunset. As the burning ball in the sky started to dip below the tree line and I slowly uncorked the wine, the bottle’s gentle exhalation felt like my own sigh of relief.Explore Bon AppétitWinenatural wineThe PourRead MoreLifestyleThe New Burgundy Wines Are Not as Bougie as You ThinkBy Marissa A. RossLifestyleWe'll Be Drinking Co-Fermented Wines All Summer LongBy Marissa A. RosscultureWhere to Buy Great Wine Online By Alex DelanyLifestyleIf You Try One Greek Wine This Fall, Make It ThisBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-21", "author": ["Condé Nast", "Joseph Hernandez"]}