{"id": "3cb96805849a6ee5cf2105785b69a8d0", "url": "https://www.bonappetit.com/story/big-bean-and-tomato-salad", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "White Bean Salad with Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNow That I Know How To Cook Beans, I’m Making This Dish All The TimeFriends don't let friends hate beans.By Emily SchultzAugust 30, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Do you know Amiel Stanek? He used to edit this site right here, and he loves beans. Like, so much. They say you develop the personality traits of the people you spend a lot of time with, and after sitting about 10 feet away from him for two years, we both picked up certain things. I’d like to think Amiel learned about Instagram from me, and I definitely learned about beans from him.Ya see, we weren’t a big bean household growing up. I’m not sure if it was because my dad loved the “magical fruit” phrase or what, but legumes were not a part of our daily diet. I used to tell my parents I was sad they never enrolled me in karate, and now I tell them I’m sad I didn’t discover the magic of beans until age 25.I mean how could you resist?\nAlex LauSo thank goodness for Amiel. He showed me how to zhuzh up canned beans, crisp chickpeas, and soak lima beans overnight. He taught me how to turn black beans into a flavorful soup showered with Fritos. He told me which bags to add to my Rancho Gordo order and how to save my bean cooking liquid for later use. Recently Amiel moved upstate, and there’s now a void in the shape of Amiel holding a bag of perfect cannellinis.But then the August Simple Issue came out, and I flipped it open to a beautiful photo of big ol’ white beans and fat, juicy tomatoes in what Kelly Mariani, owner at Scribe Winery, calls Big Beans and Tomato Vinaigrette. I may have needed a lesson about beans, but I’m from New Jersey so I know about tomatoes. And I will use any excuse in August to eat them.A weekday dinner party is that excuse. And because August heirlooms are gorgeous without any effort, and you can cook the beans the day before, the only thing you’re actually doing is blitzing a few things in a blender! Ready?Assuming that you’ve made your beans the night before, you’ll drain them of their liquid (use it in place of water or stock in your next soup!), and put them in a big bowl. Then you’ll purée cherry tomatoes, and stir in garlic, vinegar, oil, and salt. After 15 minutes, you’ll pluck the garlic out. (This is to get the essence of garlic, without actually eating garlic.) Toss the vin and the beans together and spoon over sliced heirloom tomatoes that have been drizzled with salt, pepper, and oil. It’s not mandatory but it is aesthetically pleasing to slice up the heirlooms in random pieces for dramatic effect. Top the whole thing with some basil and red pepper flakes and you’re good to go!I’m a bean lover for life now, and this recipe is one that’ll stick around in my repertoire every summer.Beans, baby:Big Beans and Tomato VinaigretteThe cold bean salad you’ve been craving this summer. Buttery big beans and a garlicky tomato dressing.View RecipeExplore Bon AppétitTomatoSaladWhite BeanSummerSummer SidesNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-30", "author": ["Condé Nast", "Emily Schultz"]}