{"id": "3cee2b3ec9d35c95aa0102f6e63b31e1", "url": "https://www.bonappetit.com/story/how-to-make-round-cookies", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "How to Make Perfectly Round Shortbread Cookies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Perfectly Round Shortbread CookiesNo awkward flattened edges here.By Jesse SparksMarch 4, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.I love aesthetics. I could spend hours scrolling through Instagram admiring perfectly sculpted cookies or gloriously manicured confections.That’s why I knew the first time I saw senior food editor Molly Baz’s perfectly circular Roasty Toasty Pecan-Caramel Shortbread Cookies that I needed her secret. In the past, my own slice-and-bake cookies have come out of the oven looking more like approximations of circles than actual circles. They were wonky and smushed, like the shapes I drew when I was first learning how to use a compass (um, remember those?). I’d spent so much time chalking up the symmetrical shaping to witchcraft, so I was willing to do anything to get those platonic rounds. I asked Molly to tell me her ways.No sharp edges allowed on these rye shortbread.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensTo start, Molly prepares her cookie dough and places it in the center of a sheet of parchment paper or plastic wrap. She then folds the parchment up and over the cookie dough so she can roll it into a rough log. If the dough is too sticky at this point, she recommends putting it in the freezer for ten minutes so it can chill until it’s firmer but still malleable.With the parchment still folded over the log, she’ll use a bench scraper, ruler, or some other straight edge to press against the dough while slowly pulling on the top layer of parchment paper. This creates a rolling effect that smooths out any lumps and bumps in your cookie dough log. (You can watch Molly do this whole process on Basically’s Instagram story.) To make sure that not too much dough is slipping underneath your bench scraper as you pull, work quickly so that the dough remains chilled.Once you’ve got an even log, toss it into the fridge for 90 minutes (or the freezer for 20). This will set you up to cut cookies like a pro. In the meantime, figure out what exactly dulce de leche is, make sure your oven is at the right temperature, or whisper affirmations to yourself about how you really are great a baker (have some confidence, kiddo!).When your dough is thoroughly chilled and firm, you’re ready to slice. Molly recommends rotating the log 90 degrees after cutting two or three cookies. This limits the amount of pressure you’re putting on cookies in a single direction so that they don’t start to squish or flatten on one side. Think of it like crisis management, but for cookies.Once you have your RoundBoys™, you’re ready to get baking. But wait! Freeze the cookies for at least 10 minutes so that they hold that perfectly circular shape you’ve worked so hard to achieve.Get the recipe:Roasty Toasty Pecan-Caramel Shortbread CookiesStore-bought dulce de leche and pulverized pecans give this tender, buttery shortbread a nuttiness and depth of flavor you can’t quite put your finger on. We love the contrasting look of white nonpareil, but feel free to roll the dough in whatever sprinkles you please.View RecipeExplore Bon AppétitBasically BakingShortbreadCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-04", "author": ["Condé Nast", "Jesse Sparks"]}