{"id": "3cf9b781284bcac5c9354abc99446715", "url": "https://www.bonappetit.com/recipe/not-your-average-french-dip", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Not Your Average French Dip Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDNot Your Average French DipSponsored by Heinz® Mayonnaise FacebookPinterestTwitterEmailPhotography by Chelsie CraigMakes 8 sandwiches Are you down to dip? We’re digging this top-notch spin on a traditional French Dip, created by Jacob Dixon at Mean Sandwich. The crew created this stellar recipe that’s prepared with housemade roast beef, sauteed mushrooms and butter pickles on homemade bread with a perfect layer of NEW, deliciously creamy Heinz® Mayonnaise. And of course, it’s served with an au jus side for dipping.PrintIngredientsFor the jus2 pounds beef knuckle bonesKosher salt, freshly ground black pepperFor the roast beef 1 tablespoon kosher salt1 1/2 teaspoons sugar1 teaspoon ground black pepper1 teaspoon shichimi togarashi (found in Japanese grocery stores; substitute with 2 teaspoons orange zest, 3/4 teaspoon cayenne pepper, 1/2 teaspoon black sesame seeds)2 tablespoons olive oil1-3 pounds beef top round roast, tied and at room temperatureFor the pickles 6 Persian cucumbers, thinly sliced into roundsKosher salt1 tablespoon yellow mustard seeds1 teaspoon red chili flakes1 teaspoon turmeric2 cups distilled white vinegar1 cup sugarFor the sandwich 6 tablespoons unsalted butter1 small onion, thinly sliced1 pound oyster mushrooms, trimmedKosher saltSliced roast beef, for servingHeinz® Mayonnaise, for serving8 buns, split2 cups friséeRecipe PreparationFor the jus Preheat oven to 450°. Roast bones in oven until caramelized, turning occasionally, about 30 minutes. Transfer bones to a medium stock pot, cover with 8 cups water, and bring to a boil. Simmer bones on medium-low, uncovered, until the broth is reduced by three-quarters, about 2 1/2 hours. Season with salt and pepperFor the roast beef Preheat oven to 375°. Whisk together salt, sugar, black pepper, and togarashi in a small bowl. Rub beef with salt mixture and oil. Transfer beef roast in roasting pan and roast until an instant-read thermometer inserted into the thickest part registers 120°, 20 to 25 minutes. Transfer roast to a cutting board and let rest 15 minutes before removing kitchen twine and slicing.To slice the beef, use a very sharp slice knife or deli slicer, and cut very thin slices of roast beef. Divide sliced beef into 8 portions.For the pickles Toss cucumbers and 2 teaspoons salt in a large bowl; let stand 30 minutes. Drain and squeeze well to remove as much excess moisture as possible. Transfer salted cucumbers into a large glass jar and add mustards seeds, turmeric, and chili flakes. Bring vinegar, sugar, and 1 cup water to a boil in a medium saucepan, stirring to dissolve sugar. Remove from heat and let cool. Carefully pour into jar, filling all the way to the top. Seal jar and chill at least 1 day.Sandwich Assembly Melt 4 tablespoons butter in large skillet over medium. Add onions and cook, stirring occasionally, until onions are softened and browned in spots, 15 to 20 minutes. Add mushrooms and cook 5 to 7 minutes. Season with salt. Melt remaining butter in large skillet or on a griddle over medium. Toast buns, cut-side down, until golden brown, 2 to 3 minutesSpread Heinz® Mayonnaise on both sides of each bun, top with sliced roast beef, oyster mushrooms & onions, pickles and frisée.Sponsored by Heinz® Mayonnaise GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Heinz"]}