{"id": "3d0d4dd2ae4185c5404daf624a51edc2", "url": "https://www.bonappetit.com/recipe/pistachio-mango-sans-rival", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Pistachio and Mango Sans Rival Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssuePistachio and Mango Sans RivalBy Elaine TownsendApril 20, 20214.2(35)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintWhen Elaine Townsend of Café Mochiko was growing up, her mom would buy this multilayered Filipino dessert from bakeries in Southern California’s San Gabriel Valley for special occasions like birthdays. It’s a bit of a project—homemade meringue stacked with silky French buttercream—but the crispy-chewy-luscious texture is worth it. While the meringue is traditionally made with cashews, Townsend swaps them out for pistachios. She also adds fresh mango purée to the buttercream, normally kept plain, so that it’s fruity and tart.A few tips: The recipe calls for egg white or meringue powder, which helps to stabilize the whipped egg whites so that they don’t weep or deflate. If you can’t find it, skip it. You’ll also want to make sure your mangoes are ripe but not too ripe—if they’re too ripe, they’ll have lost their slight sourness and will be hard to shave into thin slivers for swirling on the top. Of course, you can always skip the elaborate decoration: Shingle slices of mango or simply pile up cubes instead.Once the sans rival is completely frozen (at least 2 hours), you can transfer it to the fridge for up to 5 hours for a softer, chewier texture (any longer and it will start to lose its structure). But if you prefer a crispier meringue, serve it straight from the freezer, where it will last, well-wrapped, for up to 1 week.Ingredients6 - 8 Servingsmeringue2cups (280 g) raw pistachios, divided2cups (packed; 280 g) powdered sugar6large eggs, separated½cup (100 g) granulated sugar½tsp. meringue powder (optional)⅛tsp. kosher saltassembly3large ripe but firm mangoes (such as Kent or Tommy Atkins), divided2Tbsp. (or more) fresh lemon juice¾cup plus 2 Tbsp. (175 g) granulated sugar2½cups (5 sticks) unsalted butter, room temperaturespecial equipmentA candy thermometerPreparationMeringueStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Toast 1 cup (140 grams) pistachios on a rimmed baking sheet, tossing halfway through, until golden brown, 10–13 minutes. Let cool, then coarsely chop; set aside for decorating.Step 2Reduce oven temperature to 300°. Cut 2 large sheets of parchment paper and trace three 7x3½\" rectangles with a pencil on each sheet. Turn parchment over and place each on an 18x13\" baking sheet (you should be able to see the traced rectangles through the parchment; they will be your guides later). Pulse powdered sugar and remaining 1 cup (140 g) pistachios in a food processor until the consistency of very coarse sand. Transfer to a large bowl.Step 3Place raw egg whites in the bowl of a stand mixer fitted with the whisk attachment. Beat on medium speed until frothy, about 2 minutes. With the motor running, gradually add granulated sugar, meringue powder (if using), and salt. Increase speed to medium-high; beat until stiff peaks form and meringue is glossy, about 7 minutes. Fold into pistachio mixture in thirds, folding until just combined before adding more. (It should still look fluffy.)Step 4Transfer batter to a piping bag fitted with a ½\"-wide tip (or fill a resealable plastic bag and snip off a corner) and pipe to fill each traced rectangle on prepared baking sheets. (Or, you can divide batter into 6 portions and spread to fill each rectangle all the way to the edges with an offset spatula.)Step 5Bake, rotating halfway through, until meringues are light golden brown, dry to the touch, and firm (they shouldn’t crack as soon as you touch them), 40–50 minutes. Turn off oven, prop door open (a wooden spoon works well), and let sit in oven 20 minutes.Step 6Remove meringues from oven and carefully peel away parchment while meringues are still warm. Let meringues cool completely.assemblyStep 7While the meringues cool, peel 2 mangoes and cut flesh from pits. Purée in a blender or food processor until smooth. Transfer to a small saucepan; add lemon juice. Cook over low heat until slightly thickened, 10–15 minutes. (You should have about 1½ cups.) Let cool slightly.Step 8With motor on medium-high speed, beat egg yolks in the clean bowl of a stand mixer fitted with whisk attachment until pale and doubled in volume, about 8 minutes.Step 9Meanwhile, place granulated sugar and 6 Tbsp. water in another small saucepan (do not stir) and clip thermometer to side of pan. Cook over low heat until thermometer registers 240°, about 8 minutes.Step 10With motor on high speed, carefully stream hot sugar into whipped egg yolks, avoiding whisk and sides of bowl, and beat until bottom of bowl is slightly cooler to the touch, about 4 minutes. Mixture should be very pale, smooth, and glossy with soft peaks that fall back onto themselves.Step 11Turn off mixer and add warm mango purée. Beat on medium-high just to combine. Reduce speed to medium and, with motor running, add butter 1 Tbsp. at a time, beating until incorporated and smooth after each addition. Add a little more lemon juice to make a more tart buttercream if desired.Step 12Take 1 meringue and dot a little buttercream in several spots on the bottom. Set on a parchment-lined baking sheet and press gently to adhere. Using an offset spatula, spread ¾ cup buttercream over. Place another meringue on top and spread another layer of buttercream over. Repeat process until all meringues are stacked, pressing down a bit firmly when placing each meringue to maintain even layers.Step 13Using spatula, spread buttercream around sides and top of stacked meringues. Press reserved pistachios onto sides as desired, saving some for decorating the top. (If your buttercream is very soft, chill cake 10 minutes before pressing on nuts.) Freeze at least 2 hours before serving.Step 14Slice remaining mango and arrange decoratively on top of cake. Fill in gaps with remaining pistachios. Do ahead: Cake can be made 1 week ahead. Wrap tightly once firm; keep frozen.How would you rate Pistachio and Mango Sans Rival?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI made this for a birthday cake.  Following the recipe went well until the water and sugar as the amount of water was not mentioned.  Used 1/3 cup of water and it did work but would like to know just how much I should have used.\nAlso freezing the cake for two hours before serving made it very hard to cut.  Leftovers were put in fridge and the the next day was very easy to slice the cake .\nIt will be made again!!WilmaCA6/1/2021I don't understand this recipe at all. I had way too much meringue and buttercream. The whole thing was very tall because maybe I piped the meringue too thick? It puffed up a lot. The buttercream was a disaster: way too thin, like a pudding. I've made Swiss meringue buttercreams, but not with puree, and using whites instead of yolks. I've also made zabiglone, which seems more similar. They always came out great. And as mentioned in another review, this is a VERY expensive dessert.Brianna5/24/2021This turned out so well, thanks in large part to a lot of improvisation on the part of my husband and daughter. They spent two afternoons making it for my birthday, making two batches of merengue, wayyyy too much buttercream. What made this great was adding some thinly sliced mango in with the layers. What made this not so great was not making a recommendation to find mango puree for the buttercream, following your merengue recipe, and they got the entire kitchen sticky. I would revise the recipe for the website asap, please, with some of the other reviewers' advice. And what is merengue powder anyways? AnonymousBerkeley, CA5/10/2021Made it for my friend's 30th. I would definitely classify this as a more advanced recipe, but it was easy enough to follow the instructions except the print version was missing the amount of water for the syrup (6tbsp!!!). I was surprised that the mango prevailed through all the butter in the buttercream, but it did! Huge hit. Will make again!Jess5/10/2021I hate to write a negative review but the ingredients are so expensive for this that I feel I should warn others! I'm a pretty dedicated cook but had to abandon this halfway through as it was so fiddly and nothing quite worked for me. The meringue was too runny and burned on the bottom. In the end I turned the puree into mango curd and had to junk the rest!AnonymousNew York5/8/2021\"place granulated sugar and 6 Tbsp. water\"\nWater quantity IS there even if not listed in ingredients, it is \nin Step 9 of the directions\nHaven't tried this one but made a classic sans rival\n(with cashews) It was VERY (too?) sweet. Getting\nthe meringues off the cooking paper was impossible.\nHad to jigsaw puzzle the broken ones for the inner 3 layers\nwith filling acting as glue. The top and bottom layers needed\nto be intact.\nWonder about the wisdom / consequences of freezing fresh\nmango topping/decoration, in terms of taste and\ntexture.lgf= les gâteaux fabuleuxBoston & Geneva Switzerland4/29/2021I plan to make this this weekend. Any recommendations on an aperitif pairing?EmilyBrooklyn4/29/2021I made this and had to look up how much water to add with the sugar (as other reviewer points out) it was omittted on the recipe. I found a similar recipe that added 3/4 cup of water...I don’t know if this was right or not, but I tried it. \n\nNo one in my family cared for this recipe—way too much butter and not enough flavor. Too much work for the output. And it tasted way too eggy....unfortunately I won’t try this again. DessertMakerMiami, FL4/29/2021How much water is needed for step 9 (for creating the hot sugar)? I've reviewed the recipe many times, and I don't see water listed anywhere. AnonymousChicago, IL4/29/2021This was scrumptious. Not a crumb left. Thanks!MaxB4/23/2021Explore Bon AppétitFrozen DessertDessertFilipinoSoutheast AsianAsianPistachioNutMangoStone FruitFruitBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Elaine Townsend"]}