{"id": "3d177eb8ae9080d8999283999610c772", "url": "https://www.bonappetit.com/story/making-perfect-thanksgiving-turkey", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Everything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving Turkey | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEverything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving TurkeyThe best way to cook a turkey is to break it down into parts, dry-brine it, and roast it on a wire rack in a baking sheet. Here’s why. By Alex BeggsOctober 16, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how Expertly Spiced and Glazed Roast Turkey came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamAndy Baraghani and Brad LeoneThe ChallengeMiraculously roast a turkey that is well seasoned, juicy, and—can we type this loudly enough?—PROPERLY COOKED! Every part of the bird deserves equal love and appreciation, without a dry bite in the house.The SolutionThe absolute inarguably best way to cook a turkey is to break it down into parts, dry-brine it, and roast it on a wire rack in a baking sheet.Watch Andy and Brad on their quest to make the perfect Thanksgiving turkey and cranberry sauce.\nWhy Aren't We Cooking Our Turkey Whole?You can get a near-perfect turkey roasted whole—we’ve done that in the past—but being able to guarantee both thighs and breasts are succulent? Parts make it happen, exposing every piece for even cooking. If the idea of doing surgery on a raw turkey gives you a stress rash, ask the butcher to do it (even at the supermarket, we called and asked!). Here’s your script: “Hello, talented and smart and under appreciated butcher [pause for uncomfortable laughter], I’d like to purchase a 12-to-14-pound turkey, cut into five pieces: the legs, wings, keep the breast whole, backbone removed. Yes, I’m doing that ridiculous Bon Appétit recipe. Yes, it better not suck.” Works every time.This Year Break Out the Baking SheetHigh-sided roasting pans keep the heat from directly hitting the turkey, causing some areas to brown more than others and increasing cook time. So we followed a trick that food stylists use for a beautifully browned bird by roasting on a wire rack set inside a baking sheet, which lets air circulate underneath for that crucial crispy skin.The proper layout\nPhoto by Alex LauFace Off: Dry Brine vs. Wet BrineThe salt in the dry brine (a.k.a. rub) has two effects. First off, it is abundant, which properly seasons the turkey and banishes the blandness. Second, the overnight uncovered chill helps dry out the skin, allowing it to crisp when roasted. When you use a wet brine, it’s difficult to fully dry the turkey afterward, dampening your crispy-skin dreams. Plus, drawing a turkey bath in a huge cooler is a messy nightmare and zero fun to clean. Dry brine for life.The Ingredient: Pink PeppercornBrad advocated (bradvocated) for pink peppercorns in the rub, which are pleasantly pink, floral and fruity, and offer a little something different. If you don’t have them, that’s fine, there’s still black peppercorn as well.The Turkey’s Lip-Smacking Glaze...has soy sauce, light brown sugar, sherry vinegar, hardy herbs, orange peel, and garlic, and gives the turkey that high-gloss runway look.See all that crispy skin and succulent meat?\nPhoto by Emma FishmanDrop It While It’s HotThe oven starts at 425 and immediately cranks down, which creates a nice golden color on the turkey skin without drying out the meat.How to Take the Turkey’s TemperatureEach piece has an ideal temp: Look for 150° for white meat and 170° for dark. Start with the thickest part of the thigh, directing the thermometer down. Then get into the center of the breast by inserting the tip of the thermometer horizontally from the neck end, aiming for the meatiest part of the breast. Then go in from the side to double-check. Make sure you’re hitting meat not bone.Shoppin’ TurkeyShow you’re thankful for the farmers who treat their turkeys well. Certified Humane and Animal Welfare Approved (look for those trademarks on the label) hold the highest standards for the treatment of animals, so we especially seek those out.Get the recipe:Expertly Spiced and Glazed Roast TurkeyThe absolute inarguably best way to cook a well-seasoned, juicy turkey is to break it down into parts, dry-brine it, and roast it on a wire rack in a baking sheet.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeExplore Bon AppétitThanksgivingMaking Perfect: ThanksgivingRead MorerecipesBon Appétit’s Absolutely, Positively Perfect Thanksgiving MenuGallery8 SlidesBy The Bon Appétit Test KitchenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Alex Beggs"]}