{"id": "3d2218c5044e0117485594ff3f0247be", "url": "https://www.bonappetit.com/story/yuzu-furikake", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "I'm Obsessed With This Very Specific Yuzu Furikake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI'm Obsessed With This Very Specific Yuzu FurikakeYou can sprinkle it on anything.By Rachel KartenJanuary 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI’m a serial sesame seed sprinkler. Like, I'll make a recipe just as an excuse to eat lots of sesame seeds. (Hi, grilled beef with broccoli!) But I had always stuck to plain sesame seeds. You know, heeding the advice I learned in sesame seed business school: KISS (Keep it simple, stupid). That is, until I met yuzu furikake.I wasn’t looking to upgrade my sesame seed game, but one night at Whole Foods I noticed a new addition. A sprinkling yuzu furikake from the brand From Japan. This sounded exactly like the next step in my relationship with sesame seeds.I was familiar with furikake (a seasoning that includes dried seaweed, dried fish, sugar, salt, and often MSG) pre-purchase, but not I-feel-compelled-to-buy-this familiar. However yuzu, a Japanese citrus fruit, is my jam. I go through ponzu like it’s conditioner but soy sauce like it’s shampoo. And yuzu kosho is my hot sauce soulmate. I was sold. I threw my From Japan yuzu furikake in my cart and headed out.You can sprinkle furikake on nearly everything (like hard-boiled eggs!).\nDanny KimWhen I got home I immediately threw some rice in my rice cooker so I could test drive the seasoning. It had the obvious furikake components I had seen from posting this recipe SO MANY times on Bon Appétit's Facebook page, but also mixed throughout were dried pieces of yuzu zest. I sprinkled some into the palm of my hand then poured it into my mouth like I was eating Buncha Crunch at the movies. At first you get lots of ocean vibes from the seaweed and salt-cured black sesame seeds, but then you’re hit with citrus insanity from the yuzu. Dang.I took my finished rice, and dusted it in the furikake. The furikake brought a ton of flavor (more than plain sesame seeds would), but the snack still felt clean and light. Since then I’ve experimented with sprinkling it on spicy chicken, roasted broccoli, and healthyish salads. Needless to say, my sesame seed sprinkling game has improved greatly. Buy it: Organic Sprinkling Yuzu Japanese Furikake, $11 at ChefShop.com (or at Whole Foods)Sprinkle furikake on this kombu salmon:Explore Bon AppétitJapaneseWere Into ItSpiceSeaweedCondiment/SpreadShoppingBA RecommendsRead MorecultureWe Love Ozuké's Umeboshi, a New Take on Traditional Japanese Fermented PlumsBy Elyssa GoldbergcookingThe Cooking Pot You'll Never Want to Put in a DrawerBy Amiel StanektechniquesA Guide to Easy Japanese Home-CookingBy Amiel StanekcultureThe Japanese Breakfast You Can Actually Make on a Weekday MorningBy Elyssa GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Rachel Karten"]}