{"id": "3d3b759b960fbbb20cf287343518d117", "url": "https://www.bonappetit.com/story/samin-nosrat", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Everybody Loves Samin Nosrat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEverybody Loves SaminSalt, Fat, Acid, Heat. If you’ve cooked from the book or watched the show, you love Samin Nosrat. In fact, so many people do, she went to hide out in the desert. That didn’t stop us from tracking her down.By Amanda ShapiroMarch 21, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailTo find Samin Nosrat, I drive northeast out of Palm Springs, past armies of wind turbines, sagging curio shops and Dollar Generals, cholla cacti and Seuss-like Joshua trees, and into what people here call the high desert. The Yucca Valley in Southern California is the kind of place you go if you don’t want to be bothered by, say, strangers hugging you in grocery stores, screaming your name out car windows, inviting you on dates with them and their girlfriends, or asking to get coffee so they can “pick your brain.”“People never used to look at me twice,” Nosrat says, sitting on an overstuffed, over-pillowed couch in the bungalow she’s rented for the month. “That was my superpower: When I met someone, I could decide whether to care about them based on whether they cared about me.”A lot of people care about Nosrat now. I remember soon after her cookbook, Salt, Fat, Acid, Heat, came out in April 2017, a friend pressing it into my hands like something illicit. “You have to read this.” Around the Bon Appétit office her name wasn’t Samin; it was “Samiiiin [sigh].” Then her four-episode cooking- and-travel show based on the book appeared on Netflix, and it seemed like everyone was talking about those soy-braised short ribs or that miso egg. My friends who didn’t cook were posting photos of homemade focaccia. Something was happening.Today Nosrat’s not only a James Beard Award–winning darling of the food world, she’s an internet meme (google “Samin Nosrat Golden Girls”; a think-piece subject (“‘Salt, Fat, Acid, Heat’ Is Marxist Fantasy Porn”); and a person who gets tweets from Hollywood directors (“A treat to watch you,” wrote Ava DuVernay). She’s verifiably mom-famous, as I learned when I texted mine a photo from the desert, and she texted back, oblivious, “Looks like Samin Nosrat.”I’m here with Nosrat because I want to know what it’s like to have a fairly quiet career in food for almost 20 years—never running a restaurant, never appearing on Top Chef or any of those competition shows, just taking catering and teaching gigs as they came—then, at almost 40, become a full-blown food celebrity. I want to know why so many of us have fallen so hard for her at a time when we’re saturated with food content on every platform, when, on any given night, you can binge-watch more than 100 episodes of The Great British Baking Show or tune in to Alexandria Ocasio-Cortez making soup on Instagram Live. Why Samin? Why now?”That was my superpower: When I met someone, I could decide whether to care about them based on whether they cared about me.”Full and obvious disclosure: I love Samin Nosrat as much as you probably do. I’ve watched the show and cooked the short ribs and read through Salt, Fat, Acid, Heat like it was the fifth Ferrante novel. When we meet, I feel like we’ve already spent time together. Her curly black hair is flecked with gray, her hands and forearms marked by cooking burns. The denim jumpsuit she’s wearing is missing a button; it popped off that morning while she was trying to pee.Before the trip I pictured us in her cute kitchen making some delicious braise-y or bread-y thing, but I soon learn—and this will totally weird you out and maybe annoy you—Nosrat is doing a cleanse. And not just any cleanse; she’s doing a Gwyneth Paltrow cleanse (or at least the one that Gwyneth’s doctor friend, Alejandro Junger, sells). It involves drinking these premixed shakes for breakfast and dinner, and, for lunch, eating basically vegetables and seeds, and doing all that for 21 days straight.Okay, but hear her out: December was rough. She did a ten-day press tour that took everything out of her; then the holidays hit. Physically, psychically, and digestively, Nosrat was wrecked. She decided that while she cleansed her mind in the desert she would cleanse her body too. She’s been on the diet for two weeks by the time I arrive, and she feels incredible. “I don’t even think about my digestion,” she says, awestruck.So instead of cooking, Nosrat and I drive to a date farm that she’s known about since she was 19 and working at Chez Panisse, Alice Waters’ iconic Berkeley restaurant, where these particular dates are still on the menu. From her Subaru Impreza, Nosrat tells Siri to text her literary agent, Kari Stuart: “Are we millionaires yet?” Then she laughs as only Nosrat does, like a fire hydrant bursting at full blast.Nosrat is not a millionaire yet, but she'll get a lot closer in March, when she'll sell her second cookbook, What to Cook, to Ten Speed Press for an undisclosed amount, but more than her first book. (Salt, Fat, Acid, Heat sold to Simon & Schuster in 2013 after a bidding war among virtually every major publisher. Nosrat says, “It was the biggest deal for a first-time cookbook author I’d ever heard of.” As of February the book has sold 330,000 copies, which, for what it’s worth, is more than three times what Gwyneth Paltrow’s 2016 cookbook sold.)How Nosrat roasts beets: In a cast-iron skillet with a little water and covered in foil so they steam while they cook.\nPhoto by Alex LauOn the way to the farm, we stop at a vegan café for a cleanse-approved lunch—a salad with black beans called Coachella Forever—before arriving at a driveway with a small wooden sign reading “Flying Disc Ranch.” A woman in an L.A. Angels cap comes out to introduce herself as Christina Kelso, the farm’s second-in-command.“You’re on that show, right?” she says to Nosrat, smiling shyly.We walk the grassy paths that run between rows of gnarled date palms as the late-day sun filters in, and I feel like I’m on Nosrat’s show. As she does with the Italian olive producers in the “Fat” episode and at the Japanese salt factory in “Salt,” Nosrat peppers Kelso with questions: How do you harvest? When do you drive to market? How does pollination work?We go into a packing room where hundreds of dates sit in cardboard boxes: fat, squishy Medjools; skinny, honey-colored Deglet Noors; yellow-ish Zahidis. Nosrat moans as she bites into a round, thin-skinned date, so I follow her lead. The flesh dissolves in my mouth like a caramel cloud. “It’s called a Barhi,” Nosrat tells me. Kelso glows. Nosrat buys an obscene amount of dates, Kelso undercharges, Nosrat overpays, there are hugs all around, and scene.By this point I’ve nailed down one obvious reason why you and I and my mom and your dentist all love Samin Nosrat: She really wants you to love her, and she has an uncanny, non- smarmy ability to get you to do just that. “Luckily, as a brown woman, I’ve had a lifetime of training making other people feel comfortable,” she says. For a long time Nosrat hated that she was such a people pleaser, but now she sees it as her greatest strength.It got her through high school in the richest, whitest part of San Diego as the daughter of middle-class Iranian immigrants. It got her a job that involved vacuuming the floors at Chez Panisse when she was a student at UC Berkeley. It helped her at Eccolo, the seasonal Italian Berkeley restaurant where she was first a line cook and then a sous-chef, and at catering gigs for celebrities and moneyed Bay Area families she’d met through Chez Panisse. It’s why Michael Pollan let her audit his wait-listed writing class in 2007 and then hired her to be his cooking teacher when he was writing his book Cooked in 2013. It’s why the editor who would go on to acquire Salt, Fat, Acid, Heat in 2013 wrote her a letter begging to let him publish the book after meeting her once. It’s how she managed to write about protein strands and coagulation in a way that made hundreds of thousands of people want to roast a chicken. It’s why everyone she meets on her Netflix show—even the most skeptical honey producers in the Yucatán—can’t help but smile when she’s around.And it’s why, upon learning that I have a thing for hitting up health food stores in random places, Nosrat drives me to three different ones in the Yucca Valley.“My friends in tech talk about the ‘user experience,’” she says as we drive back to the high desert with our cassava-flour tortillas and liters of kombucha in the back, the Joshua trees casting long, strange shadows across the road. “And I realized I’ve been thinking that way my whole life.”The desert gods shine fortune upon me: A photo shoot is scheduled for the next day, meaning I will get to watch Nosrat cook. When I show up at her house the next morning, she’s in black overalls and a pink T-shirt, washing beets to roast for a citrus salad. “I’ve cooked beets a million ways, but this way is the best because they steam while they roast,” she says, pouring a little water into the skillet with the beets and covering it with aluminum foil.A citrus salad with the perfect balance of, yes, salt, fat, acid, and heat.\nPhoto by Alex LauShe engages with the photographer like someone who, well, has hosted cooking shows. “Do you want me to stop plating?” she asks, spoon in hand. “Should I do that part again?” she asks, rubbing a citrus vinaigrette into sliced cucumbers.Nosrat is the first to point out that there are chefs who are much more technically skilled than she is; she’s friends with a lot of them. But most chefs aren’t as comfortable in front of the camera, nor are they good at teaching us normal people how to do what they do. She calls me over to watch how she segments a grapefruit, cutting the thin membranes aside with a tiny paring knife and letting each perfect half-moon drop to the plate. She hands me the knife so I can try. After a few botched attempts, I successfully carve out a decent slice and she cheers.Nosrat abandoned two other book projects and dozens of ideas before Salt, Fat, Acid, Heat. But, at 39, she says she wouldn’t have wanted her success to come any earlier. “I’m so glad that I’ve had so much disappointment and can see so clearly,” she says. “Twenty years ago, I would’ve been swept up.”Maybe Nosrat wasn’t ready then, but I don’t think the world was ready for Nosrat either. When Nosrat was 19, Emeril Lagasse was “BAM”-ing every which way and Alton Brown was explaining the science behind cast-iron pans on the Food Network. When she was 29, reality shows had swallowed TV, and Top Chef, Chopped, and Next Food Network Star had turned cooking into pure entertainment.“I’m so glad that I’ve had so much disappointment and can see so clearly. Twenty years ago, I would’ve been swept up.”Nosrat’s success signals a new era of food celebrity. Reality TV has been eclipsed by programming that’s weirder (see amateur bakers making horrific mistakes on Nailed It!), wilder (see Bon Appétit’s own Brad Leone pheasant hunting on YouTube), and truly real (see your friend documenting her sourdough journey on Instagram), and none of these examples are on what used to be referred to as TV. As food “television” has fractured across so many platforms, the most resonant hosts today have two things in common: They’re magnetic without seeming media-savvy, and they’re often home cooks, not restaurant chefs.Doris Cooper, a cookbook editor at Clarkson Potter for 13 years who works with writers like Alison Roman and Melissa Clark, sees a similar trend. “Cookbooks a decade ago were celebrity chefs. They were either famous because they were on the Food Network or because they helmed an important or popular restaurant,” she says. In comparison, “the books doing so beautifully right now are written by people who are exalting home cooking. They’re in a small kitchen. They don’t have four appliances.” Nosrat fits the bill: She takes press photos leaning in the doorway because her kitchen is so small. Her cookbook is a compendium of times she messed up: undersalting the polenta, cramming too many zucchini slices on a sheet tray.But if home cooking is having a renaissance, it’s not the kind that promises 30-minute meals or sings the praises of semi-homemade. Instead it feels like a return to an even earlier era, the one where Julia Child first showed Americans how to make beef bourguignon. Today our favorite cooks are again challenging us to tackle classics—sourdough, a whole roast chicken, or the perfect vinaigrette—in a totally down-to-earth, far-from-perfect way. “The best way to execute French cooking is to get good and loaded and whack the hell out of a chicken” could’ve been a quote from Nosrat if Child hadn’t supposedly said it first.Nosrat cooked sweet potatoes in the coals of an outdoor stove, then topped them with an herby, zesty chimmichurri.\nPhoto by Alex LauThe night before the James Beard Media Awards in 2018, Nosrat was at a gathering of Netflix talent at a bar in Manhattan. Her cookbook had been nominated for the food equivalent of Best Picture (it would win the next night), and she was already feeling celebratory. Nosrat doesn’t really drink, so she was feeling...emboldened after glass of wine number two, which is when she told her producers she had to go talk to a guy at the end of the table. The guy was Brian McGinn, the director of Chef’s Table, the Netflix show that Nosrat and others have been critical of for its rapturous portrayals of white male chefs. Nosrat scooted down the table and reached for his hand. “I need to say something to you,” she told McGinn. “You have to do better.”Since the 2016 election, and as waves of #MeToo allegations have crashed over the industry, chefs have become more politically vocal. But Nosrat’s been an activist for much longer, and not just on Twitter. She’s raised more than $150,000 through bake sales for various disaster relief efforts in the Bay Area. She connected restaurant employees who’d been harassed with journalists. She’s refused invitations to events that don’t include chefs of color or that relegate them to panels on “ethnic” food.“I’m literally the only brown person ever who’s been given the privilege of talking about general cooking,” she says, and she doesn’t mean just on panels. In every pocket of the food industry, from television to cookbooks to restaurant kitchens, non-white chefs have been pigeonholed into cooking only food that’s associated with their culture. When food writer Nik Sharma was trying to sell his cookbook, Season, to publishers, they’d see his name and assume it was an Indian cookbook. “There was often this notion that I should be writing about India,” he says. “And I’m like, ‘How many stories on chicken curry do you need from me?’”Maybe because she got her start at the most-well known restaurant for California cuisine, Nosrat was never branded as a Persian chef. Instead her expertise is her technique: Here’s how to salt your pasta water (heavily); here’s how to roast vegetables (spread them out!); here’s how to make focaccia (olive oil, olive oil, more olive oil). On the show she usually plays the student, eager to touch, taste, and ask questions. But rather than big-name restaurant chefs, her teachers are miso masters in Japan, literal grandmas in Mexico, her own mother. She’s endlessly curious about who they are and what they do, then she brings their wisdom home to us, the viewers, and quietly, one scene at a time, we see what a less racist, less sexist, more egalitarian food world might look like.“I’m literally the only brown person ever who’s been given the privilege of talking about general cooking.”Earlier in the day I’d admired a microfiber towel in Nosrat’s bathroom made for people with curly hair. So when the shoot wraps, Nosrat insists on taking me to Marshalls so I can buy one for myself. It’s maybe the most excited I’ve seen her in the 48 hours we’ve spent together. “It’s the best Marshalls I’ve ever been to,” she says. “You’re going to freak out.”It’s truly a very good Marshalls, well-organized and bright but not head-achingly so. She leaves me in the hair-care aisle and takes a phone call, this time about mortgages.Nosrat believes in making things happen by asking for them: the job at Chez Panisse when she was 19, the seat in Michael Pollan’s class. She even wrote a letter to the New York Times in 2013 asking to be a contributing food columnist and, okay, no one responded, but six years later she is exactly that. Just last summer she wrote in her manifestation journal (yes, she has a manifestation journal) that she wanted a house with a kitchen big enough for a film crew to shoot in, with a door leading out to a garden and a separate space for food prep. A few months later a friend told her about a house with every single one of those things. Yeah, she bought the house.Nosrat has built her career on helping people feel more comfortable in the kitchen.\nPhoto by Alex LauNosrat doesn’t have to ask for much anymore. She can do what she wants, and she has a lot of ideas: a production company that would fund brown people’s projects. A mentoring program where she helps people of color get book deals. A documentary about Edna Lewis, the legendary Southern cook. She’ll write another book, and she’ll probably shoot another TV show, as soon as she figures out what stories she wants to tell. She can hide out in the desert for another month.But right now she wants to give away popcorn. She bought a popcorn maker at Bed Bath & Beyond (Marshalls doesn’t stock them) and she’s going to set it up at La Copine, the one trendy restaurant for miles, and offer hippie toppings like nutritional yeast, and the weekenders from L.A. will eat the popcorn while they wait for a table. She’s doing it for fun but also for donations; the restaurant needs a new oven and she wants to help.I don’t know anything about professional ovens, but they sound expensive, like more than a few days of popcorn donations. Then I remember who I’m talking to. If Samin Nosrat tells people they want popcorn, they’ll believe her, and they’ll come.Explore Bon AppétitChefsCelebrity ChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Amanda Shapiro"]}