{"id": "3d4484e4d5d99664569f1ca89a77dba5", "url": "https://www.bonappetit.com/recipe/green-seasoning", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Green Seasoning Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueGreen SeasoningSeptember 22, 20203.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Rey LopezEmailPinterestPrintEmailPinterestPrintThis herby, peppery blend is used as a seasoning for many traditional dishes from Trinidad and Tobago and can be treated as both a base flavoring agent and a finisher. Broadleaf thyme is a strong herb used often in Caribbean cuisine. You’ll need a batch of green seasoning to make either the Aloo and Chana or the Curry Goat (but preferably both!) from Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast.IngredientsZest and juice of 3 limes½medium onion, coarsely chopped12scallions, coarsely chopped8garlic cloves5Trinidad seasoning peppers, Cubanelle peppers, ají dulce peppers, or Anaheim chiles, coarsely chopped1Scotch bonnet or habanero chile, stem removed1bunch chives, coarsely chopped1bunch culantro or cilantro, coarsely chopped2cups (loosely packed) broadleaf thyme (optional)½cup (loosely packed) thyme leaves¼cup coconut vinegar or unseasoned rice vinegarPreparationStep 1Working in batches if needed, pulse lime zest and juice, onion, scallions, garlic, peppers, chile, chives, culantro, broadleaf thyme (if using), thyme, and vinegar in a food processor, scraping down sides as needed, until smooth.Step 2Do ahead: Seasoning can be made 1 day head. Cover and chill, or freeze in small portions up to 2 months.How it all comes togetherStep 3Use the silky shreds of roti to scoop up all the various curries, chows, and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Green Seasoning?Leave a ReviewTell us what you thinkExplore Bon AppétitSauceTrinidadianCaribbeanChileVegetableAnaheim ChileScotch BonnetHabanero ChileEasyQuickDairy-FreeNut-FreeGluten-FreeVegetarianVeganKetoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}