{"id": "3d4733d49557f9f48948189b29ded4b9", "url": "https://www.bonappetit.com/story/portugal-greatest-place-to-eat", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "How Portugal Became the Greatest Place to Eat Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Portugal Became the Greatest Place to Eat Right NowA neurotic chef’s journey of falling in love with porto tónicos, grilled sardines, and flakey egg tarts.By Tyler KordOctober 11, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe best restaurant in Lisbon is not actually in Lisbon.It’s on the other side of the Tagus River in Cacilhas, a tiny port neighborhood you take a ferry to get to that is home to some abandoned factories and adorable feral cats who enjoy uninterrupted views of Lisbon’s very spectacular hills. There are tourists here but far fewer of them. And very few are at the best restaurant, which is a bodega-type café where a guy in a Corona hat who doesn’t speak English will ask you, “Sardinhas?” to which you will respond yes. And he will spend the next 20 minutes seasoning ten plump sardines with a wet chunky salt, grilling the sardines on a small charcoal grill on the sidewalk, asking other passersby the all-important question (“Sardinhas?”), until he disappears with the sardines inside the best restaurant in Lisbon that’s not quite in Lisbon. After several minutes he will return with a platter of grilled sardines topped with a few slices of boiled waxy potatoes, a salad of lettuce, onions, and what appear to be unripe tomatoes and which are in fact delicious and dressed with lemon and salt, and a beer if you were smart enough to ask for one, and it is amazing. There are much prettier places to eat grilled sardines in Lisbon; there are even much prettier places to eat grilled sardines right here in Cacilhas. But this place, with A Petisqueira (“The Snackery” or maybe “The Snack Shop”?) on its awning, is the best because I found it and I loved it.Looking over the city\nPhoto by Alex LauI came to Lisbon to see if I could get to the heart of why this city is the new “It” destination and why Portuguese is the new “It” cuisine that’s having such a big Moment on the world’s culinary stage. I should take this opportunity to make clear that I had no idea that Portuguese food had suddenly become so cool because I have a 20-month-old baby and I have stopped caring about most things that sound like that last sentence. But I assured the editors at this magazine that I could handle the assignment and now it’s too late for them to do anything about it. I dragged my wife, Katherine, along and we ditched our baby with the grandparents to give it our best shot.But we’re not even in Lisbon, and the guy in the Corona hat has no idea that he is the chef at the best restaurant in the city, let alone the restaurant at the epicenter of one of the most exciting food trends, because his restaurant is totally unremarkable in Lisbon. I’ll bet that if somebody told him, “Hey, an American magazine says this is the best restaurant in Lisbon!” he would probably call to his wife who works the register and is always busting his balls about how they’ll pay rent, or how they’ll keep their daughter from marrying Carlinhos the Uber driver who has no interest in working at the store, and he’ll sit down in a chair next to the grill and say, “Do you hear that? The best!” Only he’ll say it in Portuguese and then he’ll take off his Corona hat to wipe his brow, flip the rack that is holding ten plump sardines for his buddies that came in for lunch, and get on with his day.If Portugal had a national sandwich, it would be the bifana: thin slices of griddled pork on a squishy bun.\nPhoto by Alex LauLisbon is full of tiny cobblestone streets that open up to the occasional grand boulevard or ridiculously beautiful panoramic view of the river, and it might be any old European city, but Lisbon has way more graffiti, and the seafood is plentiful, and sometimes people smoke cigarettes in nice restaurants, and instead of Vespas there are tuk tuks (basically motorcycles with minivans on the back, like vehicular mullets, possibly even worse than Vespas). And I loved it. But I couldn’t shake the feeling that if many people in Lisbon are thrilled that literal exponential increases in tourists have done something good for the hospitality industry, there are just as many watching their beloved Lisbon get spruced up and sanitized at the expense of the people who actually live there. It doesn’t take long wandering around Alfama, one of Lisbon’s oldest neighborhoods, and seeing a few of the tags that say “Tourists Suck,” or some less elegant suggestions for what Airbnb should do, scrawled on the walls of adorable alleys to understand that being trendy can take a toll.But you need to walk only a little farther down that adorable alley, past all the oblivious visitors, to find an old lady sitting in a doorway selling shots of ginjinha, a sweet liqueur made from sour cherries, as if to say, “Help yourself, you are my grandson now and I love you,” to feel welcome and a little drunk and like you are exactly where you need to be at that moment. Or get a beer and petisco (which is a category of snack, often fried, cured, involving seafood, or a combination of those three things) while staring up at a castle and try to figure out how not to go back to New York City.Jeny Sulemange, the chef at Cantinho do Aziz\nPhoto by Alex LauWe hadn’t come up with an answer before we got hungry again, so we went to Cantinho do Aziz. The chef and co-owner, Jeny Sulemange, is from Mozambique, and her tiny restaurant in the Mouraria neighborhood serves food that is influenced by a few of the countries that were colonized by the Portuguese Empire. And while it’s tempting to act like a food writer and suggest I know exactly the historical gastronomic path that brought palm oil and green plantains into the sensational shrimp stew called miamba wa macua, that would be reductive. But start a meal here with makorro, a chutney-like spread of mashed onions and cilantro, and a Kingfisher beer, and everything will start to make sense, and actually, maybe this is the best restaurant in Lisbon. Though I don’t think this is the food that Bon Appétit was talking about when they asked for this article, not because it isn’t amazing, but because even I would have noticed if Mozambican-Goan-influenced Portuguese food was having a Moment since that would frankly be one of the coolest things ever.Clams with garlic sauce at Cervejaria Ramiro\nPhoto by Alex LauA lot of people would tell you that the best restaurant in Lisbon is Cervejaria Ramiro. It’s like the Peter Luger of seafood restaurants, which is to say that it is touristy, boasts a menu of extremely simple seafood preparations, and is undeniably amazing. You are invited to get drunk while you wait a long time to be seated, and then once it’s your turn, you are hustled into a very brightly lit room with long communal tables where a waiter seems surprised that you don’t know what you want to eat, and then you are brought what look like cartoon versions of the most beautiful crustaceans and mollusks you’ve ever eaten in your life: tiny shrimp sizzling in a ton of olive oil with garlic threatening to get too dark; enormous shrimp, full of bright red meat; clams, clams, clams; and rock lobsters, like in the B-52s song! We ordered a boiled lobster, and it came to the table split open, steaming hot, and with a bottle of mayonnaise that tasted more exciting than mayonnaise. A rock lobster’s tail is full of meat, and there is a middle section about two inches long that is also full of meat, and the head has some guts and a lot more meat. It’s like a lobster but with extra lobster in it! This is the kind of seafood excitement that happens at Ramiro.Alfama, one of Lisbon's oldest neighborhoods\nPhoto by Alex LauI said I didn’t realize that Portuguese food was cool. What I also didn’t realize until I got to Lisbon was how little the people in Lisbon seem to care. At Cervejaria Ramiro, they are not interested in telling you about which fisherman caught that crab or how it is prepared. That’s just not a priority. Instead it’s seeing your exuberant wife, Katherine (well, my exuberant wife, Katherine, but you should really see her), sitting next to a tank of enormous rock lobsters, and every time one is pulled out she gets splashed a little and you love her a little bit more each time even though you are also mentally reminding yourself to wash your hands if you happen to touch her beautiful hair and then your rock lobster comes out and it is so magnificent and full of extra lobster. And you just can’t write all of that on a menu.At this point I’ve drunk about 300 porto tónicos, a drink made by mixing a couple ounces of port with a few ounces of tonic, two beverages I never thought I really needed in my life but that come together to form one of my new favorite drinks. But: “They’re just for tourists” is what I was told by the owner of Nova Wine Bar as he made me the best porto tónico I had in Lisbon. We walked in while Portugal was playing Iran in the World Cup and everybody in Lisbon was in the Praça do Comércio, one of the biggest plazas in the city, watching the game on a giant screen. So Nova was empty. The owner jokingly invited us to sit in the back and watch the game with him and his cook, not realizing that for the purposes of this story, and also because I enjoy sitting and drinking in the backs of restaurants with the staff, we would take him up on his offer. He got me to try some port without the tonic and it was wonderful. As was his rendition of cod with chickpeas, which involved boiling the salt cod before giving it a good drizzle of olive oil and serving it with chickpea purée and toast. While everybody in Portugal was watching the world’s most popular sport, I was consuming Portugal’s favorite things, salted codfish and port, and I could not have felt better about it.Among the almost comically perfect crustaceans at Ramiro: these giant prawns\nPhoto by Alex LauI smiled at my wife, who smiled back, probably thinking, “I want to go back to Ramiro and eat another rock lobster,” and it was as romantic as the scene in Love Actually where Colin Firth flies to Lisbon to propose to a woman he has never spoken to, which I think we can all agree is a weird thing to do. I’ve never seen a porto tónico outside of Portugal, but by the time this story gets published you can probably get one at No. 7 Restaurant, which I run, and which is conveniently located in the heart of Brooklyn’s Fort Greene neighborhood.But honestly, it won’t be as good as the one I had at the best restaurant in Lisbon: O Magano. The restaurant had white tablecloths and different shapes of wine glasses and every customer was smoking cigarettes. The porto tónicos were big and juicy and so perfect alongside a fava bean and Portuguese sausage salad that I almost flipped the table over and walked out (does that ever happen to you?). We stayed for the grilled fish for two (we asked for a smaller portion and got grilled fish for four to six instead), and for dessert we ordered a cake-shaped thing that tasted like layers of raw egg yolk thickened with sugar and it was incredible even though it sounds a bit disgusting. But O Magano was not cool in the way that trendy things like windbreakers are cool (sorry, I just realized that I don’t have any idea what is cool!). It was deeply cool because it was not trying to be cool, and that made it the coolest.The iconic egg tarts at Pastéis de Belém\nPhoto by Alex LauAnd speaking of eggs and sugar, those egg custard thingies! Anybody who has ever been to Portugal will tell you all about them the moment you mention that you are considering going to Portugal. They’re called pastéis de nata, and they are one of the coolest pastries I’ve ever had. The pastry has a flaky crust and is filled with a sweet, eggy custard that has been baked pretty dark, almost like crème brûlée inside a croissant, and I challenge you to describe something that sounds more delicious than that.When asked what else we should try at Lisbon’s most famous old pastéis de nata bakery, Pastéis de Belém, the cashier suggested I try a pastel de bacalhau, a cod fritter that was served a little warmer than room temperature. And if a room-temp cod fritter for breakfast sounds better to you than crème brûlée in a croissant, then you are a lot more like me than you realize. We walked around and stopped at a little fruit store, and I tried to buy one perfect and tiny apricot and the lady just gave it to me because she didn’t feel like making change and I asked her to be my grandmother but she didn’t speak English and Katherine agreed that it was a very delicious apricot. But seriously, pastéis de bacalhau are exceptional and I wish that they would come have a Moment at a place near my apartment in Brooklyn.Shelling crabs at Ramiro\nPhoto by Alex LauI got a little off track, and I’m still thinking about the shrimp with the palm oil and plantains, so, apologies, I guess that means Cantinho do Aziz is the best restaurant in Lisbon, and the second best has to be Damas. We went to Damas our last night in Lisbon. It’s on a quiet street near the top of the hill in Graça. Damas felt cooler than any place we’d been on the trip, with a hip café up front and a music venue in the back. (“Hip café”? How old am I?)We ate a bowl of shell-on shrimp covered in garlic and chiles and with a lime to squeeze. We also had a dish of veal with a giardiniera-like mix of pickled carrots, cauliflower, olives, and a ton of garlic in a slightly thick, mustardy broth that knocked my socks off, which wasn’t super hard to do as I was wearing some little vacation-y ankle socks.Tinned fish at Miss Can\nPhoto by Alex LauI don’t know what I’m talking about anymore. I have no idea what the best restaurant in Lisbon is. There are so many different kinds of food experiences to be had there, just like in any city full of people from all over the world. I bought about 25 different cans of seafood from three different spots—the famous old shop Conserveira de Lisboa, an awesome restaurant specializing in canned seafood called Miss Can, and the grocery store—and brought them home. I’ve been eating one every day for breakfast, and my favorite so far was tuna in tomato sauce. It’s a neat way to bring a bit of the trip back home so I can share it with my daughter, who didn’t miss me even a little bit and didn’t seem like she even wanted to leave Grandma and Grandpa’s. But these little fish don’t taste like some hot new trend. They taste like a rad tradition that is just hanging out in Lisbon, sipping ginjinha with old ladies in the doorways of Alfama. And no one there needs you to show up and terrorize their port city with selfie sticks and seafood allergies, but if you do they will welcome you with open arms and offer a spectacular pork sandwich called a bifana and you would be wise to accept it.Explore Bon AppétitPortugalRead MorerestaurantsMy Apartment Always Smells Like Chicken Soup from the Restaurant Across the StreetBy Tyler KordcultureIn Defense of the Soggy SandwichBy Tyler KordRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Tyler Kord"]}