{"id": "3d739a7dc8aefb169e475d1142a06d46", "url": "https://www.bonappetit.com/story/nut-milk-hack", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "A Genius Nut Milk Trick So You'll Never Run Out of It Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Genius Trick So You'll Never Run Out of Nut Milk AgainSeriously, how have we never thought of this before?By Aliza AbarbanelMarch 14, 2018FacebookTwitterEmailPhoto by Alison WuFacebookTwitterEmailWhen it comes to nut milk, we're stuck between two extremes.  It's almost embarrassing how often we buy a beautiful jug of plant-based milk, enjoy a glass or two, and then forget about it until it starts to smell like pond water. And when we do finish a quart, we invariably forget to buy more, only to face the sad task of eating a bowl of dry granola.Of course, making nut milk at home is the obvious solution. But, come on: who wants to spend half a day soaking almonds in special mesh bags, only to have the stuff spoil in a couple days?  Luckily, wellness blogger Alison Wu has a tip for never running out of nut milk again, as long as you have a jar of nut butter stashed away.“I call it the lazy person's way to make nut milk,” Wu says. “There’s no soaking and no straining. It's way easier, makes less of a mess, and it’s less time consuming.”Instagram contentThis content can also be viewed on the site it originates from.Wu uses a base ratio of 1 tablespoon of nut butter per cup of water, which she adds to a high-speed blender and runs on high for about two minutes. The proportion of nut milk to water varies slightly with the base—for coconut milk, she uses 1½ tablespoons to 2 cups of filtered water.  \"I love the nut and seed butter trick for cashew, coconut, almond, sesame and walnut milk. “Senior food editor Chris Morocco tried out this technique in the Bon Appetit  test kitchen using tahini and almond butter, and both experiments produced a well-incorporated nut milk that compared to the store-bought stuff—albeit with a roasted flavor. (Use raw almond butter if you don't want the toastier notes to come through.)Once made, the nut milk keeps in the fridge for up to five days. It's a fairly short window of time, but the ability to make just a cup or two at a time makes it easy to minimize waste.  Wu uses the milk for her morning “matcha potion” and nightly moon milk, as well as a smoothie base. She’s also fond of mixing in matcha, adaptogens, warming spices, and even dates, for a more flavorful nut milk that can be sipped straight-up.This newfound ability to make milk in mere minutes—from any jar of nut butter—opens up a whole world of milk-based possibilities. Stick with classic almond butter, go green with pistachio butter, or use that artisanal chai-cashew-hazelnut butter from the farmers market. No matter what you choose, better smoothies, moon milk, and porridge are only minutes away.Turn homemade nut milk into breakfast:Brown Rice Porridge with Hazelnuts and JamView RecipeExplore Bon AppétitHealthyishNut ButterNutAlmond MilkRead Moreshopping6 Ways to Use a Nutmilk Bag That Have Nothing to Do With NutmilkBy Jamie FeldmarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Aliza Abarbanel"]}