{"id": "3d774cfb1164f24fac8b8a254ac3de29", "url": "https://www.bonappetit.com/story/instant-pot-red-bean-soup-with-taco-fixins", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "This Red Bean Soup with Taco Fixins Comes Together In No Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Dinner That Comes Together in No Time, Make Red Bean Soup with Taco FixinsWhen 5:15 p.m. hits and there’s still no plan, Deb Perelman harnesses the power of her Instant Pot.By Deb PerelmanSeptember 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Michelle GattonFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.Look, I hope this doesn't shatter any domestic-diva-type expectations you have of the people writing for your favorite food magazine, but the number of nights that dinnertime approaches and I have absolutely no idea what we’re going to eat and have done no grocery shopping is: a lot of them.In the interest of avoiding the inevitable meltdown that would ensue when my ravenous kids stumble in only to find dinner isn’t ready yet, I often rely on a few types of dried grains and beans in the pantry and the electric pressure cooker magic known as an Instant Pot. It can turn a staple like a bag of inexpensive red beans into a hearty flavorful soup in about 45 minutes—with absolutely no presoaking. A quick sauté of onion, garlic, and spices makes an aromatic base that seasons the whole pot, while quinoa adds bulk and texture.What do I do while dinner is off cooking itself? In a dream world I’d probably do as little as possible, relishing it, ideally with a glass of wine. In reality I’m helping with homework, managing some other last-minute chaos, or making the kinds of toppings that get the kids (and the adults) much more excited about a bowl of beans and quinoa. We call these taco fixins: corn tortilla strips baked into crispy chips, quick-pickled red onion, sliced avocado, cilantro, crumbled cheese, limes, and some hot sauce for the grown-ups. Everyone heaps their bowls with whatever they like. Nothing delights me more than when the reward for having no dinner plan is a delicious meal that came together without a minute of planning.Get the recipe:Instant Pot Red Bean and Quinoa Soup With Taco FixinsWhen 5:15 p.m. hits and there’s still no dinner plan, Deb Perelman makes this Instant Pot soup in 45 minutes flat.View RecipeExplore Bon AppétitPicky Eaters’ ClubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-25", "author": ["Condé Nast", "Deb Perelman"]}