{"id": "3d77808f918207e18909b2498faddbff", "url": "https://www.bonappetit.com/story/kid-friendly-beans-on-toast", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Beans on Toast Is the Secret to Converting Legume Haters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Garlic Bread Is the Secret to Converting Bean HatersHow a saucy ragù turned Deb Perelman’s two naysayers into devoted fans.By Deb PerelmanJanuary 22, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.Parents love to share war stories of the obviously delicious things their children refuse to eat (such as freshly baked apple pie in a flaky buttery crust, in my three-year-old daughter’s case). Then there are the foods they ask for (a “shandwich” the same child requested for lunch) only to flat-out decline moments later (“I no like shandwiches”). We joke about how impossible it is that we could create a human being who doesn’t like hot dogs or tater tots, but I would like for the sake of this story to boldly go where I don’t think enough essays about feeding kids have gone before: I want to own my children’s pickiness.Guys, I was a picky eater as a kid. I didn’t like meat. I didn’t like cooked green vegetables. I didn’t like eggs. I didn’t understand the purpose of cheese on things that weren’t, say, pizza. I’ve come around to all of those and then some; for me, learning to cook things the way I wanted really helped, but mostly I just grew out of it. Perhaps my kids will too.Of course, the idea that they might one day love the dinner they’re currently despondent over is little consolation when I’m wiped out on a Tuesday night. We all need a simple, efficient meal but have different ideas about what constitutes one.Before I had kids, I often turned canned beans into dinner by tossing them with pasta, making a quick soup or salad, or schmearing them on toast with a fried egg. I could still turn them into almost anything... if my kids would let me. But like their picky mom before them, they haven’t taken to beans outside of chili, and even then, hesitantly. We even ended up taking them out of the mix entirely for a while.The biggest breakthrough we’ve had in bean consumption was when I began treating them like pasta. A couple of years ago, I made a baked ziti–like dish in which I used jumbo white beans instead of pasta, cook- ing them in a vegetable-flecked marinara sauce, top- ping with mozzarella and Parmesan, and broiling until brown and bubbly. The kids were skeptical until I called them “pizza beans”—and lo, somehow this was the trick that finally got them to eat legumes for dinner.Illustration by Giacomo GambineriBut for nights when we’re short on time, I like to take the best parts of the pizza beans—white beans, tomato sauce, greens, and garlic—and give them a speedier English-style beans-on-toast treatment.A friend from the UK introduced me to this dorm-friendly delight in college. The “recipe”: Warm a can of baked beans and ladle over buttered toast. If you’re feeling extra, you can finish it with cheese.For this weeknight-friendly toast, I make a one-skillet ragù with crumbled sausage, wilted greens, lots of garlic, as many red pepper flakes as we can pull off, and then canned white beans where we might other- wise add pasta. For the toast, I use slices of buttery garlic bread (the ultimate kid bait), and we finish it with Parmesan (because we are always feeling extra). It’s a bit more elaborate than the version I learned in college—it takes 25 minutes, not five—but it’s also a more rounded meal. It’s become such a hit that it’s gone into our permanent rotation—and I get to check another ingredient off the Never Feed Us This list. I call that a triumph.Get the recipe:Weeknight Beans on ToastThis recipe will make more ragù than you need, but the leftovers can be repurposed as a quick topper for pasta on another night.View RecipeExplore Bon AppétitWhite BeanRaguToastPicky Eaters’ ClubRead MorecookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-22", "author": ["Condé Nast", "Deb Perelman"]}