{"id": "3d77d8709f1e54dd0000fdc72d8b70f4", "url": "https://www.bonappetit.com/story/mindy-kaling-dinner-party", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Mindy Kaling Would Only Have One Guest at Her Dream Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe One Guest Mindy Kaling Would Have at Her Dream Dinner PartyThe writer-producer-actor on her favorite characters from the shows she's created, the library she’d eat in, and her mom’s chicken curry.By Dawn DavisJuly 7, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Mindy Kaling's body of work may be one of the few that excites multiple generations in the same household. Teens and their parents alike have made The Office a perennial favorite. And whole families are discovering Kaling’s Netflix show Never Have I Ever, a dramedy about friendships, family, and teenage angst at its most awkwardly funny (season two is streaming July 15). Which means most of us would want Kaling at our dinner parties— but who would she invite to hers? We asked her to share.It’s your dream dinner party and you get to invite any three people, living or deceased, fictional or historical. Who do you invite?It would be Mike Nichols and nobody else because I don’t want to have to share him with anybody. As a director, Nichols is really inspiring. I was reading the biography that Mark Harris wrote about him. His career spans so many genres. He did The Graduate, which is obviously a drama-comedy. But he also did theater and came up doing improv in Chicago. He had a really interesting, incredible life.If you had to invite one character from Never Have I Ever and one from The Office, who gets the invite?I would bring Devi, the star of Never Have I Ever, although she’s such a handful that I might regret that decision. But I think she’d be the most fun because I would love to learn how teenagers are speaking and maybe she could show me how to do TikTok. From The Office it would probably be Oscar. When I was writing for The Office, I wrote an episode that included The Finer Things Club. Oscar was a founding member and so cute.Is the dinner at your house? A restaurant?I would be stressed to have it at my home. So I would take this opportunity to travel since I’ve gone nowhere in a year and a half. And I would host it at the Cinnamon Club in London, which is an incredible-looking Indian restaurant designed to look like a giant library.What do you ask the chef to make?A classic Ethiopian feast, with injera, beef tibs, and doro wat, and something Korean such as kimchi sundubu jjigae, a tofu stew. Those dishes are iconic. People might not love mixing Korean and Ethiopian food, but they’re my two favorite cuisines. I could eat them every day.I understand you love to cook. Say a friend announces she’s in town; what do you make?Probably my mom’s chicken curry, which is like a Bengali coconut chicken curry, or Bengali coconut shrimp curry.Do you set a pretty table?I’m obsessed with tableware. It’s one of my expensive, completely unnecessary habits. Right now I’m obsessed with the Tory Burch collaboration with Dodie Thayer—the lettuce stoneware is so beautiful.As a female comedic icon, who would you rather have dinner with, Lucille Ball or Carol Burnett?I’d prefer to talk to Queen Latifah. She’s so funny; she is a giant movie star; she has been the star of her own sitcom, Living Single; and now she’s the star of an action-drama. She’s an Oscar nominee. She sings and she can rap. For me, and for a lot of women who look like me, we look at Queen Latifah and think, Wow, she really broke ground. That woman can do it all.Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-07", "author": ["Condé Nast", "Dawn Davis"]}