{"id": "3d801bd66ae60413e6054c29765f9512", "url": "https://www.bonappetit.com/story/kelewele", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "If You Love Plantains, You'll Love Everything at This Brooklyn-Based Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Love Plantains, You’ll Love Everything at This Brooklyn-Based ShopAt Kelewele, owner Rachel Laryea uses plantains in every single Ghanaian-inspired dish—and even ships nationwide.By Adjoa D. DansoNovember 2, 2021FacebookTwitterEmailRachel LaryeaPhoto by Caitlin OchsFacebookTwitterEmailOn a rainy Saturday afternoon, Brooklyn’s DeKalb Market Hall is bustling with people seeking lunch. There are croissants, hummus, doner kebabs—near endless possibilities. But I’m on the hunt for something very specific. And suddenly, there it is: a mini tropical oasis, centered around a larger-than-life image of ripe yellow plantains. Behind the counter, a petite Black woman with long brunette locs scoops red red (black-eyed peas stewed in a tomato sauce) from an Instant Pot onto whole roasted plantains. This is Rachel Laryea, owner of Kelewele.Like Laryea’s, my parents are Ghanaian immigrants, and I grew up eating all variations of plantains, a starchier cousin of bananas. Kelewele (pronounced keh-leh-weh-leh, unless it’s 1998 and you’re me, a Ghanaian American child obsessed with those movies about a whale, in which case it’s “killy willy”) is a fried plantain dish often sold roadside in Ghana. In my house, it was always a favorite—but I’d never seen it at an American restaurant. Now, gazing up at Laryea’s menu, my eyes widened at the familiar ingredients: “shito,” “chichinga.” Was this place real?Laryea, born and raised in Virginia, moved to New York to attend undergrad at NYU. Fondly known to customers as the Plantain Lady, Laryea got her start just down the street from DeKalb selling plantain-based desserts at the 2018 International African Arts Festival in downtown Brooklyn. “The reception being as warm as it was, and people being really excited about the innovation and the cultural aspect, really gave me the fire to keep going and dig into this,” she says.By spring 2020, Laryea knew the festival circuit was untenable. “Oftentimes, we were selling out really quickly, within two or three hours,” she says. “There's only so much that I could bake or make out of my Brooklyn apartment kitchen.” Demand was growing and Laryea, a double Ph.D. candidate at Yale University, was already stretched thin. It was time to scale up. Laryea got to work forming an advisory board and enrolled in small business accelerators. Through board member Delroy Levy, also a co-owner of DeKalb Market’s Likkle More Jerk, Laryea found a potential home for her business. The pandemic opened the door for market ownership, allowing tenants to negotiate in new ways when it came to rent structures and relief, Laryea says. In July, she opened Kelewele’s flagship food stall—and the market’s only entirely plant-based concept.In the early days, Laryea was known for her plantain ice cream, decadent brownies, and extra-soft chocolate chip cookies. The sweets are still front and center at DeKalb, and the expanded operation allows Laryea to offer up many more dishes, in addition to online ordering of her cookies and brownie mix with nationwide shipping. The menu at Kelewele evokes Wonka-esque innovation: the signature soft-serve churned from housemade plantain milk, frozen roasted plantain pops dipped in chocolate, and “placos”—hardened plantain taco shells loaded with veggies. And, of course, there’s the kelewele.Your standard kelewele recipe calls for chopping an overripe plantain into bite-size pieces and coating it in a blend of garlic, ginger, onion, crushed red pepper, and other spices before frying it in sizzling oil. The softer the plantain, the more crispy-crunchy-caramelized bits will cling to your teeth as you chew, which is a good thing, and a delightful departure from my mom’s recipe. At Kelewele, each sweet, sumptuous bite bursts with flavor and heat as it melts in your mouth. It’ll be served piping hot, so resist the immediate urge to dig in with your hands (though no judgment here if you ultimately decide to forgo the fork).Kelewele is the first plantain dish Laryea remembers eating as a kid. With candy forbidden at home, Laryea and her sweet tooth eagerly anticipated the days when mom pulled out her big cast-iron pot. “I was obsessed because kelewele was this treat that I would get only once in a while,” she says, recalling how she’d sneak out of bed and into the fridge for an extra helping, only to be caught red-handed by her mom. “From then on she was always watching me like a hawk when it came to the plantains,” she says, laughing.Laryea infuses the African diaspora into her shop at every turn, from dish conception to sourcing ingredients directly from Ghana. Both the spice blend in her chichinga burgers and the shito, a traditionally shrimp-based pepper sauce that she uses to coat her kelewele, accompany her back to the U.S. after trips to Ghana to visit family. “We’re literally using the shito pepper from Agbogbloshie Market [in Accra] that I went and collected from Susie the Spice Lady and brought back,” she says. Though haggling is expected in market settings, Laryea makes a point to always pay Susie’s original asking price and tip her out of respect for a fellow woman entrepreneur. “Something that I love is being able to build that kind of diasporic narrative,” she tells me, “being able to take something that is her handiwork, and then apply it here in the U.S. And I think she appreciates that as well.”Laryea also makes sure to squeeze in Kelewele pop-ups on each trip, and sets up a stall annually at the Afrochella festival in Accra. The reception in Ghana, she’s noticed, tends to fall along generational lines. Plantain chips abound in Ghana. Plantain ice cream? Not so much, and older folks are more skeptical of her fantastical use of a familiar food. “It can be hard for them to wrap their head around, but once they taste, it’s like, ‘Oh, this is delicious,’” Laryea says. “We’re always at that juxtaposition of something that’s familiar yet innovative.”For Laryea, elevating Ghanaian culture to a wider audience means elevating Pan-Africanism too: solidarity and unity among Africans throughout the continent and diaspora. Ghana holds a significant place in history as the first sub-Saharan African nation to achieve independence from colonial rule. “While [Kelewele] has Ghanaian roots, we’re much more than that,” Laryea says. “I can be West African; the next person can be from somewhere in the Caribbean; the next person can be from Latin America, and we all have a shared familiarity with plantains,” she says. “Sure, the preparation or the process might look different, but the plantain remains the same.”I could have sat at Kelewele for hours, watching the lines of people alternately rediscovering a beloved food or being introduced to it for the first time. Laryea wants diners to see themselves in Kelewele’s narrative and has a special appreciation for those who, like her, experience plantains as a link to their upbringing.“Food shouldn’t just be food,” she says. “It should be cultural. It’s economic. It’s political. It’s social. When you’re able to tap into all of that in a single dish, I think you’re onto something.”Explore Bon AppétitNew YorkCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-02", "author": ["Condé Nast", "Adjoa D. Danso"]}