{"id": "3d9715631abac67f101bee165c26d0cc", "url": "https://www.bonappetit.com/recipe/lavender-grapefruit-gandt", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Lavender Grapefruit G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredLavender Grapefruit G&TAl Thompson shares his version of a classic G&T. With the combination of bright, citrusy grapefruit and lavender, this G&T becomes the perfect rooftop cocktail. Simple. Refreshing. Delicious.By BOMBAY SAPPHIRE® GINJuly 21, 20215.0(1)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire3oz. premium tonic water2lavender sprigs, for garnish2Tbsp. lavender buds½oz. lavender syrup½oz. cup water½oz. cup sugar¼red grapefruit, plus ½ wheel for servingPreparationStep 1In a small pot, combine the sugar and ½ cup water. Bring to a simmer over medium heat, stirring until the sugar is dissolved. Step 2Remove from the heat and transfer into a heatproof container. Add the lavender buds. Let cool to room temperature then transfer to the refrigerator. Strain the simple syrup into another container; discard solids. Step 3Add lavender syrup to the balloon glass and ¼ of a grapefruit with the peel on. Muddle gently to release juice. Next, add the Bombay Sapphire Gin.Step 4Fill the glass with ice and pour in the tonic. Garnish with a grapefruit and lavender blossoms. Lastly, smile and look at what you have made and enjoy!Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Lavender Grapefruit G&T?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-21", "author": ["Condé Nast", "Bombay Sapphire"]}