{"id": "3d9940f0d0021dbae35db4235ac6998e", "url": "https://www.bonappetit.com/story/ghost-kitchens", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Ghost Kitchens Might Be the Future of Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSo, What’s the Deal With Ghost Kitchens?These takeout- and delivery-only restaurants are suddenly everywhere, which is good news for some struggling food businesses and ominous for others.By Priya KrishnaApril 19, 2021FacebookTwitterEmailIllustration by Jess EbsworthFacebookTwitterEmailLuis Mota had no interest in running a ghost kitchen.When he first opened his Mexican restaurant La Contenta in Manhattan’s Lower East Side in 2015, he was actively against delivery, as “the food suffers too much,” he says. A restaurant, to him, is about “sitting, enjoying, relaxing,” none of which are possible when there’s only takeout and delivery and no dining room.But then last March the pandemic decimated business at both his restaurants, forcing him to lay off much of his staff and survive on loans from the government. He had been about to open his third restaurant. Instead, he turned that space into a ghost kitchen, creating a short menu of popular items, ponying up for the hefty fees charged by third-party delivery companies, and spending thousands of dollars on takeout containers and paper bags. He’s saved some money in staffing by making the switch, but he’s just barely covering his costs through sales.Instagram contentThis content can also be viewed on the site it originates from.Call it what you want—a ghost kitchen, a delivery-only restaurant, a dark kitchen, a virtual brand; these businesses are not new, but over the last year they’ve popped up everywhere. Many have been born out of necessity during the pandemic like Mota’s; others are part of larger tech companies and hospitality groups betting that the future of the restaurant business is digital; and some are the product of passionate cooks wanting to try a low-cost online food business. Even Guy Fieri recently announced that he was opening ghost kitchens across the country. It seems inevitable that ghost kitchens are here to stay. The most urgent question now is not whether these operations will upend the restaurant industry but how.For some independent restaurateurs, like Mota, the ghost kitchen is just a temporary solution for survival until dining rooms can fully reopen. That’s true for Jasmine Norton, owner of the Urban Oyster in Baltimore. Once the pandemic arrived she couldn’t afford to keep paying her bills while running a brick and mortar restaurant. Thankfully, the building owner released her from the lease, and a friend who works for the Hyatt offered to let her use one of the hotel’s kitchen spaces to run takeout and delivery.Being in a hotel gives Norton a new audience to market to. But it limits her customer base too: there is no signage and no front of house.“We are out of sight, out of mind,” Norton says. “You can’t just drive by and be like, ‘There are oysters there; let me make a U-turn.’” The third-party delivery companies she works with—DoorDash, GrubHub, and a Baltimore-based one called XK Courier—charge at least 15 percent in commissions. She is 90 percent down in sales from where she was before the pandemic, making on average $2,000 a week.She prides herself on being the first female and Black-owned oyster bar in Maryland, and for making Urban Oyster a safe space for the Black and LGBTQ communities. She used to host drag brunches and karaoke nights. She’s keeping the ghost kitchen running because she doesn’t want to lose what she built, and hopes to return Urban Oyster to a brick and mortar operation this summer.But others are betting on ghost kitchens for the longer run. Companies like Reef, which started in 2013 as a parking business, are leasing kitchen spaces, finding or developing restaurant concepts, and selling the food via takeout and delivery.Reef creates its own brands, sometimes partnering with local chefs. A year ago the company had 50 kitchens in 18 cities. Growth has exploded since the pandemic—there are now 120 kitchens in 21 cities.Reef’s ghost kitchens serve not to introduce customers to something new, but to give them what they already want. The company comes up with its concepts by scouring delivery and demographics data or taking an existing restaurant, standardizing the menu, and training cooks to rinse and repeat. No menus that change daily based on what looks good at the market, or ingredients sourced from a tiny spice shop abroad. For some chefs, like Mota, this sounds like the death knell of the industry. “I feel like it is so impersonal, just cooking to go,” he says. “It is like losing your soul. It is just not a restaurant.”But Alan Philips, Reef’s chief creative officer, sees the business as not only good for the future of the industry, but a way for smaller mom-and-pop restaurants that aren’t necessarily tech savvy to survive. “I see us as an enabling platform,” he says, working with these restaurants to make their concept scalable. For most of the restaurants Reef works with, he adds, there’s potential for profit margins to go up 5 to 10 percent.The company is driving what he calls “the coming creative renaissance of the restaurant industry,” where anyone with a great idea can open a restaurant without investing a million dollars and actually make it sustainable and profitable.For some independent restaurants partnered with Reef, this proposition has panned out. They’re not just surviving but growing.William Bonhorst opened Cinco TacoBar—a Chipotle-esque fast-casual restaurant—in Livermore, California, in 2018. Soon after he started a french fries pop-up called Man vs. Fries operating out of Cinco TacoBar. Man vs. Fries was immediately popular, so he started seeking out other restaurant kitchens where he could pop up. Most places turned him away, except Reef. He has now opened 15 ghost kitchens for Man vs. Fries across the country, with plans to open more. He earns a royalty percentage from total sales (he declined to specify the percentage)—and sales have grown by a factor of five since the beginning of the pandemic.Instagram contentThis content can also be viewed on the site it originates from.Reef finds the prime locations, the real estate, and the staff; all he has to do is training. Expanding outside of your local market “costs incredible amounts of money, and that is before you find the location and sign the lease,” he says. With Reef, “the risk is very minimal.”But he admits that a concept like his is uniquely suited to be a ghost kitchen—the menu is simple and flexible. There is no specialized sourcing or niche expertise required with making french fries. For a more unique or bespoke restaurant concept, this wouldn’t work. That may be what happened with Jack’s Wife Freda, a popular all-day Mediterranean bistro in New York that began that process of becoming a Reef partner but “the timing and logistics just didn’t work out,” according to a Reef spokeswoman.Working with a ghost kitchen company also requires chefs to give up a lot of control. They’re not buying the ingredients or hiring the staff. When asked if his Man vs. Fries staffers working in Reef kitchens were being fairly compensated, Bornhorst said he didn’t know and never thought to ask about pay.For Delia Simone, founder and executive chef of the high-end Los Angeles bakery Art Delectables, partnering with a ghost kitchen company has worked on a smaller scale. She pays $125 a month to rent an 8-cubic-foot shelf with CloudKitchens, a ghost kitchen company started in 2016 by ex-Uber CEO Travis Kalanick. She fills the shelf three times a week with as many baked goods as she wants and CloudKitchens sells them and fulfills the orders, taking a percentage of the sales.Her sales have stayed the same from before the pandemic, allowing her to keep the business running until she can open a brick-and-mortar bakery. She says she’s happy with her CloudKitchens partnership mainly because it allows her to get her product in front of a new customer and she doesn’t have to compromise on quality since she’s making the goods herself and deciding quantities.She may keep the partnership with CloudKitchens after the pandemic. Even with a brick-and-mortar space, she says, the extra revenue will be helpful.Instagram contentThis content can also be viewed on the site it originates from.A surprising adoptee of the ghost kitchen model is Wendy’s, a multinational fast food company that, unlike many restaurants, has done quite well throughout the pandemic. Last year Wendy’s partnered with various ghost kitchen providers (including Reef) to set up shop in big cities like Toronto, Los Angeles, and Chicago. The company already has a presence in these cities so the goal is not necessarily to increase visibility, says president and international and chief development officer Abigail Pringle, but to allow online customers to get their food faster—more kitchens in more places means more people who can fulfill orders and a shorter distance the food has to travel.But Matt Vannini, president of the restaurant consultancy Restaurant Accounting Services Inc., believes that bigger ghost kitchen companies like Reef and CloudKitchens aren’t going to be financially viable post-pandemic. Ghost kitchens that serve multiple brands are expensive, he says, and to turn a profit, business needs to be booming. Even if this may be the case now, after the pandemic, when fewer people are ordering takeout and delivery, costs could outpace revenue. And without a brick-and-mortar space, ghost kitchens won’t have the brand recognition to compete with restaurants people already love.What may stand a better chance are the online food businesses started on social media by ambitious cooks with original visions but minimal funding. These small-scale ghost kitchens do a limited number of orders and often handle delivery themselves, keeping creativity high but costs low. They may not be able to grow to the size of a company like Reef, but for a lot of them that’s not the goal.Tasting India, started by Jasmine Sheth last May, is one of those businesses. After getting laid off from her consulting job, Sheth wanted to start a business showcasing the regional diversity of Indian cuisine. Each week she unveils a new menu (Indo-Chinese, Gujarati, Goan) on Instagram and takes between 50 and 100 orders. She hired two former restaurant coworkers to help with delivery; she sells out most weeks.Instagram contentThis content can also be viewed on the site it originates from.While it would be nice to have more resources, she says, she’s unwilling to partner with a ghost kitchen company or even third-party delivery services.“The idea of my offering is for it to be a very personal story,” she says. The generic marketing that these third-party companies do “doesn’t really meet the needs of what my brand stands for.” She prefers to communicate with her customers one on one and be “endlessly creative” with menus—combining the digital savvy of a ghost kitchen with the uniqueness of a mom-and-pop restaurant. Her profit margins are in the low single digits and she’s hopeful this can grow.Sheth has no desire to open a dine-in restaurant—it’s just too much work. But she does believe that the future of the industry is a hybrid model, where a restaurant can earn revenue from dine-in service as well as takeout, delivery, classes, and even merchandise and meal kits.Instagram contentThis content can also be viewed on the site it originates from.It’s a strategy already playing out in a number of restaurants across the country, from Guelaguetza to Zahav, and even some ghost kitchen businesses. C3, another ghost kitchen company, is investing in brick-and-mortar counterparts for its ghost kitchens and looking into doing merchandise. The idea is to build brand familiarity with these concepts now as ghost kitchens, while taking advantage of the demand for restaurants that will likely skyrocketing post-pandemic, says Joey Simons, C3’s senior vice president of operations.“Pre-pandemic everyone was saying the future was digital and no one is going to talk to each other again,” he says. But Simons believes that while ghost kitchens are likely a permanent part of the dining landscape, they are never going to fully overtake restaurants: “What we have learned in hospitality is that there will always be the need for human connection.”Explore Bon AppétitRestaurantsCoronavirusChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-19", "author": ["Condé Nast", "Priya Krishna"]}