{"id": "3d9b50f6a5ae53763d4d77e063354824", "url": "https://www.bonappetit.com/story/pick-wine-store-become-regular", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "This One Thing Makes Buying Wine WAY Less Overwhelming | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One Thing Makes Buying Wine WAY Less OverwhelmingI used to be an anxious, freaked-out wine shopper. And then everything changed.By Amiel StanekMarch 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI used to hate shopping for wine. Five years ago, when I knew even less about wine than I do now, the\nsimple process of going into a liquor store and selecting a bottle filled me with feelings of dread and inadequacy. Staring down the wall of unfamiliar bottles at whatever random store happened to be in between the train and the house of whoever was hosting a dinner party that night, I'd hem and haw and fret endlessly. Did I recognize that bottle of Pinot Noir? Was it was actually Pinot Noir I liked or...something else entirely? Wait...what is Pinot Noir?? The process would usually end with me grabbing a random bottle that was vaguely in my price range, paying, and leaving feeling like a clown. (A clown with wine, but still, a clown.)But then I made one small modification to my wine-buying routine that changed everything. That is to say, I created a routine: I stopped shopping at whatever random store happened to be closest when I needed to purchase wine. I picked a wine store and became a regular. And in doing so I learned so much more about wine and, more importantly, about what I like to drink. When I became a regular, buying wine became a pleasure. And I can't recommend it highly enough.By picking one store—ideally one that's small and serious about wine, and carries stuff made by independent producers—and sticking with it, you're really just solving a math problem. If there are a gazillion different bottles of wine in the world, what are your chances of going into a rando liquor store and finding something you've had before and know you'll like? Right: a gazillion to one. (I'm pretty sure that's how math works?) But if you walk into the store you go to twice a week, the one that has more like 100 different bottles on offer? Then your chances are... Alright, enough with the math: You're going to see something you've had before, maybe a few different things, and picking a bottle that you like is going to be a hell of a lot easier and more relaxing. You've narrowed the field, rendered an impossibly vast expanse knowable. And that is major.But that's just one of the benefits. Believe it or not, when you start going to the same wine store all the time, the people who work there start to...recognize you. And you start to recognize them, too. And that means you'll probably feel a lot more comfortable asking them questions like, \"Wait, what is Pinot Noir, anyway?\" Or: \"I got a wine here a couple of weeks ago that was...kind of fizzy? And pink? And from Italy (I think)? Do you have...that one??\" And actually get a helpful answer! And they'll probably feel a lot more comfortable saying things to you like, \"Hey! Good to see you again!\" Or: \"Did you like that sparkling wine from Australia you got last time? Then you're going to LOVE this!\"All my friends are here!\nPhoto by Alex LauAnd suddenly, before you know it, buying wine becomes fun. You can get in and out of the store quickly, confidently, and with a bottle in hand that you know you're going to enjoy. Or you can linger and have a conversation about wine with someone who knows a lot more about it than you do—who is literally getting paid to talk to you about wine—and maybe learn something you didn't know before. And that's a win on all fronts.So the next time you want to buy wine, try this: Find an appealing-seeming shop that's relatively convenient to you—near your house or your work or your gym—and walk in. When somebody asks you if you need some help, say \"You know what, I don't really know anything about wine, but I like drinking it. And I'm going to start shopping here more often. If I tell you about some things I've liked before, can you help me find something similar in this price range?\" And they're going to do just that.And that, my friend, is the start of a beautiful friendship.Some cheese to go with that wine?Adult Mac and CheeseOur creamy stovetop mac and cheese is about as easy as opening a box—and a whooooole lot more delicious.View RecipeExplore Bon AppétitBasicallyWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-11", "author": ["Condé Nast", "Amiel Stanek"]}