{"id": "3da640b29dcfdb1eb29fbd77ac0290c1", "url": "https://www.bonappetit.com/story/never-fail-iced-coffee-shakerato", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "It's Iced Coffee Shakerato Season, People! Look Alive! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You're Not Here for Iced Coffee Shakerato Season, What Are You Here For?Frothy and foamy, cold, sweet, and caffeinated. The time is now.By Carla Lalli MusicMay 25, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.When people talk about the seasons of the year, they always mention the same old predictable ones. Winter, spring, rosemary, and thyme, blah blah blah. You may like the changing of the leaves; you may look forward to lounging on the beach. You’re entitled to your opinions. But if you’re into facts, chew on this: The most wonderful time of year is Iced Coffee Season, and the most wonderful iced coffee in all the land is Chris Morocco’s Iced Coffee Shakerato, a frothy, ice-chippy, sweetened coffee concoction that has gives us all one more reason to enjoy being on this earth.Friends, we are on the cusp of the chilled caffeine solstice exactly right now. And just so you know, iced coffee season doesn’t fall on a particular day every year. This isn’t baseball season—there’s no opening day. Iced coffee season starts with a feeling, the kind of feeling that makes birds haul ass back up north and tricks grown men into thinking it’s a good idea to leave the house with a little bit of ankle showing. It’s usually official sometime in mid-spring, after the cherry blossoms have dropped pink snow everywhere, but before it’s safe to go outside in a tank top.I know I’ve got The Feels when I end up in my local bodega’s baking aisle for no apparent reason and then, trancelike, watch my hand reach out to liberate a can of sweetened condensed milk from the shelf. That’s right: the shakerato has sweetened condensed milk in it; trust me and just surrender to that right now. It’s only a tablespoon, and the contents of that little can will probably get you through the entire summer.I’m not going to sit here and tell you that you need a double shot of espresso to make this shakerato, even though the recipe recommends exactly that. Store-bought cold brew coffee will work just fine, so pick that up when you’re getting the sweetened condensed milk. In a cocktail shaker, combine 3 ounces of cold coffee with 1 tablespoon of sweetened condensed milk and 1½ teaspoons of simple syrup. (You can tell that Chris Morocco has an expert palate by the precision called for here, and I respect that.) But there have been times I didn’t have simple syrup and didn’t feel like investing the 8 seconds it takes to make it. I have used maple syrup instead, and it was great. And if you don’t have a cocktail shaker, use a large lidded jar, or airtight cold beverage container, or quart-sized container. I’ve used all three with much success.Theeeeeeeere it is.\nAlex LauCoffee, sweet milk, and liquid sweetener. All together now. Could you wimp out now and just pour this over a glass of ice and drink it? Sure, I guess—but that would be missing the point, and it wouldn’t be a shaker-anything. Stop asking silly questions. You add ice to this mixture, and you cover the container, and you shake like hell for 30 seconds or until you think your hands will freeze-burn off, and that's when the magic happens. The mixture becomes chilled, duh. But the friction and repeated impact of ice smacking against ice batters the coffee this way and that, until it begins to aerate and froth up. As you continue, the ice breaks into smaller and smaller pieces and cleaves off little chips of ice, and those add even more texture and weight to the liquids. When you open that container up, the iced coffee will be crowned by a pale beige tower of foam, and you’ll hear sweet coffee bubbles gently plinking and popping on top.This is the content I’m here for. Pour the shakerato through a strainer positioned slightly off-center, so the foam and some of the smallest chips of ice floweth through. Are you salivating? I am. Can you even feel the lofty coffee mustache you’re going to have on your upper lip after you dip your face into this masterpiece? I can! Do you even realize how delicious that slightly thickened and yet fluffy sweet sweet coffee is going to taste? Yowzers. Season’s greetings, guys. It’s shakerato time.Get the recipe:Iced Coffee ShakeratoWhen shaken with a lot of ice and a splash of sweetener, espresso forms a creamy froth on top and becomes infinitely more exciting.View RecipeExplore Bon AppétitNever FailBasicallyIced CoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-25", "author": ["Condé Nast", "Carla Lalli Music"]}