{"id": "3dae2b662cb847e0bbe162599236d731", "url": "https://www.bonappetit.com/story/best-things-whole-foods-olive-bar", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "The 8 Best Things at the Whole Foods Olive Bar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 8 Best Things at the Whole Foods Olive Bar...aren’t all olives!By Alyse WhitneyMarch 19, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailBuying by the pound is a dangerous game. If you’ve ever been confronted by the Whole Foods antipasto bar, full of olives and broken promises, you understand what we mean. With dozens of choices from cheese-filled peppers to pickled okra, assembling a perfect container of things you’ll love and not regret spending $9.42 on is tricky. We’ve been around the olive block many times, and eight Bon Appétit staffers went to bat for their favorite items on the briny bar. Check out our ultimate lineup below—based solely on what we can find in NYC, but these are all available nation-wide at Whole Foods—so you can go in with a solid game plan.Peppadew Peppers“Peppadew—fun to say and eat! These pickled peppers are barely spicy and add what interior design blogs call a POP of color to your monotonous orange cheese board. Or pep of color? Pep in your step? The dad jokes come from every direction. Pick up some peppadews the next time you’re idling in the antipasto bar dept. See how it goes. You can also chop them up and use them in place of pimientos in pimiento cheese, or artichoke dip, or in this awesome saucy chicken scarpariello recipe. There’s no such thing as a peppa-don’t.” —Alex Beggs, senior web editorCaper Berries“Caper berries are hard to come by, so when you do find them, buy them. I slice them crosswise into little rounds, fry them in olive oil until crispy and then sprinkle over salads, sautéed greens, or roasted potatoes. They also make a great alt breadcrumb on pasta. They get crispy AF but are also quite salty, so deploy with restraint.” —Molly Baz, senior associate food editorPhoto by Chelsie CraigCastelvetrano Olives“Castelvetranos are the best olives. They taste like no other olive. The flavor is sublime, mild in a way that feels more like a warm ray of sunshine or the first breath of fresh air after a day in the office. They’re creamy, as if someone injected it with little hits of butter that melt on your tongue. I’ll throw a bunch of them in a bowl for parties, warm some in olive oil and serve them with feta and bread for a more refined appetizer, or just keep a tub in the fridge for when that weeknight Castelvetrano itch comes a knockin’. And in a 5-minute olive sauce over chicken thighs or seared fish? Game over.” —Alex Delany, associate web editorMarinated Gigante Beans“I’ve waxed poetic about my my obsession with gigante beans before, and I’m not planning on stopping anytime soon. The marinated gigantes at the antipasto bar were my gateway bean: an impossibly creamy, slightly tangy legume that made every (admittedly overpriced) salad bar lunch feel special. I’ve since moved on to marinating my own big beans, but if I spot these babies at the antipasto bar, they’re destined for my basket. Spooned onto an antipasto platter, mixed into a salad, or eaten straight-up as a high-protein snack, gigante beans are perfect.” —Aliza Abarbanel, editorial assistant, HealthyishPhoto by Chelsie CraigCornichons“Not to brag, but if there were some sort of mayor or ambassador of the Whole Foods antipasto bar it would be me. And, look, you’re not going to the antipasto bar to just get one thing—ask me about my Layering Technique—but if I had to nominate a single item it would be cornichons. They are tiny and cute. Sour and crunchy. And the exact snack I am looking for while I throw together dinner.” —Rachel Karten, social media managerDolce K Mt. Athos Olive Mix“An unexpectedly sweet item in the salty sea of the antipasto bar, I first tried this item on accident. I scooped a pile onto a warm piece of seeded bread, thinking the white hunk was garlic and the small, dark thing was a caper. But no—the mix, marinating in oil, is full of blanched marcona almonds, raisins, golden raisins, currants, little hunks of citrus rind, a hint of spice, and mixed olives. I enjoy the combo with a hearty bread and soft cheese (ciabatta and goat cheese, a crusty baguette and Gournay cheese). I even like it on top of a salad, where it serves as a makeshift dressing.” —Zoe Sessums, e-commerce editorial assistantPhoto by Chelsie CraigGrilled Artichokes“Grilled artichokes are amazing because I would never spend the time to cut up, grill, and marinate artichokes on my own—who do you think I am? They’re meaty, which makes them a pretty perfect addition to a lazy meal. I love to put them on top of pasta with Parm and breadcrumbs, or if I’m feeling really lazy, I’ll fry bread and spread on some ricotta, honey, and artichokes for the ultimate couch dinner.” —Emily Schultz, associate social media managerMarinated Mixed Mushrooms“Raw mushrooms somehow always end up sitting in my crisper drawer for a few days too long and get soggy, but marinated mixed mushrooms get eaten in 24 hours or less. I use the garlicky ‘shrooms as a sauce for rotisserie chicken after weeknight grocery shopping, and then top scrambled eggs and toast with them the next morning. All of the pieces are small enough to be tender and chewy at the same time, and it gives me a selection—usually oyster, enoki, chanterelle, and shiitake—of wild mushrooms to try all at once instead of buying each individually and maybe forgetting about them in the fridge.” —Alyse Whitney, associate web editorHey, another way to use antipasti...Explore Bon AppétitAntipastoGroceryShoppingRead MoreSweet and Spicy Antipasto SaladAntipasti Hand Saladculture13 Whole Foods Product Deals on Amazon Right NowBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-19", "author": ["Condé Nast", "Alyse Whitney"]}