{"id": "3db89c985c314dbdc4bc6244e2bd4e01", "url": "https://www.bonappetit.com/recipe/chicken-soup-with-caramelized-ginger", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Chicken Soup with Caramelized Ginger Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Soup with Caramelized GingerBy Andy BaraghaniMarch 24, 20183.8(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintA ginger-forward chicken tonic soup that will provide some much-needed relief when you’re not feeling too hot.Ingredients4 servings½bunch cilantro, divided2Tbsp. sugar16\" piece ginger, peeled, thinly sliced into rounds3garlic cloves, thinly sliced4scallions, pale-green and white parts left whole, dark-green parts thinly sliced lengthwise1½lb. boneless, skinless chicken thighs1Fresno chile, halved, seededKosher salt2Tbsp. low-sodium soy sauceFreshly ground black pepperPreparationStep 1Gather half of cilantro into a bundle and tie together with kitchen twine. Coarsely chop remaining cilantro (stems and all); set aside for serving.Step 2Heat sugar and 3 Tbsp. water in a large saucepan over medium. Cook, stirring often, until sugar dissolves, about 2 minutes. Continue to cook, swirling pan occasionally, until syrup is golden amber, 4–6 minutes.Ready for ginger.\nAlex LauAdd ginger and cook, stirring occasionally, until ginger is softened slightly, about 5 minutes. Add garlic and pale-green and white scallion parts and cook, stirring often, until garlic is fragrant, about 2 minutes. Stir in cilantro bundle, chicken, chile, and a big pinch of salt. Pour in 8 cups cold water and bring to a boil. Reduce heat to medium-low, bring to a bare simmer, and cook, stirring occasionally, until chicken is cooked through, 10–12 minutes. Discard chile and scallions. Keep soup warm over medium-low heat.Step 3Transfer chicken to a plate and let cool slightly. Shred chicken and stir back into soup. Add soy sauce and stir to combine. Remove pot from heat; taste and season with salt, if needed.Step 4Serve soup topped with dark-green scallion parts, reserved chopped cilantro, and a few turns of pepper.Step 5Do Ahead: Soup (without scallion greens or cilantro) can be made 3 days ahead. Let cool, then cover and chill.How would you rate Chicken Soup with Caramelized Ginger?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleI think this recipe is a little trickier to get right then the instructions imply, but if you spend some time tweaking MAN it is delicious. I agree with whoever recommended skin-on thighs. And absolutely use broth, homemade made a huge difference. The caramelization part is still fuzzy to me..don’t think I did that right and I think the amount of sugar is too much. I am going to try less sugar next time around. But I balanced it out with plenty of lime juice and sriracha - a hotter pepper would do the trick too. \n\nWould recommend adding vermicelli noodles, shiitake mushrooms, bok choy. Nothing else is really needed as I think this is meant to be a simple soup. Want to try adding miso next time too! Really delicious flavors!EEMSeattle8/27/2021I messed up the recipe, but it still turned out great! I undercooked the ginger, and despite trying to salvage it, the ginger was inedible. I strained the entire soup before adding shredded chicken back and it worked out just fine! As is, I think this recipe is perfect for sick days or a light meal. Anonymous10/18/2020This was delicious, with a few tweaks. Great ginger flavour. I used chicken broth instead of water, and also added celery, carrot, peas, and noodles. A squeeze of lime juice before serving. I liked this recipe because it used ingredients that I normally have on hand, and it's a good base for various combinations of veggies.canada4/27/2020This soup just got me through Covid-19. I doubled the ginger because I was trying to kill a virus, but damn I can’t thank you enough. Super tasty!AnonymousPlaya del Carmen, Mexico3/30/2020I wish I could personally thank Curesti for the advice, caramelizing the ginger in chicken fat was ridiculously good. Kept the serrano peppers and added some fresh mystery mushrooms I picked up at my local Asian market. I’m sick and needed some brothy comfort food and this did the trick. I can’t taste all too well but my husband loves it. Stay healthy folks!Athens, GA3/14/2020Okay so here's the tea on this soup. I've made it about three times now and found a perfect process for this whole thing. So, get bone-in, skin-on chicken thighs for sure, it's necessary for a nice bodied soup. Now, instead of starting with caramel in your pot, start with a cold pot (dutch oven preferably) and place the thighs skin down. Turn the heat up medium high and leave the thighs alone to get a nice crisp outside and render a bit of fat. Take them out once you've got both sides browned and use the fat that's left over to help with caramel. I always thought caramel needed a fat to make it not just melted sugar but something rich. This way you'll also get a larger amount of caramel base and the soup won't just taste like chicken water and will have some depth to it. Once you get the caramel going, continue on with the recipe as instructed. I also added to pieces of lemongrass and subbed serrano pepper for the fresno chile cause I wasn't a fan. Also serve it with some fresh slices of pepper for extra heat to taste. Going to try and make this again tonight but with some added fresh turmeric for extra healing benefits!curestiAustin. TX12/8/2019This soup is AMAZING. We substituted 4 cups of chicken broth and 4 cups of water instead of the 8 cups of water that the recipe calls for. Also added some red chili flake for heat. This was so delicious and really easy to make. Highly recommend!AnonymousBoston11/6/2019I swapped out the Fresno for a dollop of gochujang! Was delish. :)lamojeruEvanston10/3/2019I am totally baffled by this recipe. I pulled it from the print magazine.  I bought skinless/boneless chicken as the recipe ingredients call for.  However, in the print version it states to 'discard skin and bones from chicken' which makes more sense.  Usually this is where a lot of the stock flavor comes from.  Also, I have never heard of a soup simmering for only 12 minutes.  Isn't it usually a couple hours so the flavor develops?   I made it exactly according to the directions and it was so lacking in flavor.  I feel like the directions were not edited/vetted correctly.  Do not recommend in its current iteration.jjfontanillaCalifornia4/9/2019Maybe BECAUSE I’m sick this recipe feels like a miss for me? Husband is a fan. I agree with the comments that the amount of water to make the caramel in the beginning is problematic because it doesn’t feel like enough to cover the bottom of the pan large enough to fit the rest of the ingredients later - which left me just making more caramel so I had enough to coat the ginger - the issue then is that it basically becomes caramel soup. I could use some guidance here! We ended up using chicken stock instead of water and adding lime juice and extra soy sauce but it still tastes too sweet for me. Love the idea of a ginger-heavy chicken soup but I feel that this one needs tweaking. danaantoniaPoughkeepsie, NY3/8/2019Loved this chicken soup! Definitely add 8 cups chicken stock instead of cold water. I also added carrots, celery, and egg noodles - very filling & tasty.Anonymous2/20/2019I followed the advice of the comments and actually used chicken bone broth instead of water. I also roasted sweet potatoes and poured the broth on top. It needed heat to me- I garnished with chili oil. SO good for a cold and rainy day. AnonymousSan Francisco1/8/2019Doubled the garlic, doubled the chiles, used stock instead of water and added chopped carrots and celery just after adding the chicken - result was the most flavourful quick chicken soup I've made in a while (don't skip the soy sauce and the fresh greens, they really balance out the sweetness of the caramelised ginger)AnonymousAustralia6/4/2018After reading the comments, I made this with chicken stock instead of water (would have made a homemade broth but I made it after work), and it was really fantastic. It definitely would have been too bland without the stock, but after that small adjustment, the ginger flavor was really special. This will become a favorite method from now on! I just realized I forgot to add the soy sauce, but I didn't miss it.Rochester4/30/2018I also found this recipe was lacking something.  Without stock of any kind it seemed to be kind of watery and lacking depth.  I added a lot of fish sauce at the end along with the soy but I agree that some mushrooms or other veg would help.  Also problematic was the caramelizing part. The scant amount of water and sugar didn't seem enough especially in the large pot I was using to accommodate the later 8 cups of water and soup ingredients. Good idea and turned out pretty ok but it needs some tweaking. Anonymous4/12/2018Explore Bon AppétitSoupSoups and StewsChickenPoultryChicken ThighGingerHerbs & SpicesMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-24", "author": ["Condé Nast", "Andy Baraghani"]}