{"id": "3dbe3ab2054e7b3115b80ecd92512185", "url": "https://www.bonappetit.com/story/turkey-hotline-tips", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "I’ve Worked the Turkey Hotline for Seven Years. Here’s My Best Advice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’ve Worked the Turkey Hotline for 7 Years. Here’s My Best AdviceHint: Thanksgiving dinner is never really about the turkey at all.By Chris Anderson, as told to Pamela VachonNovember 22, 2021FacebookTwitterEmailIllustration By: Liana FinckFacebookTwitterEmailHi. This is Chris with the Jennie-O Turkey Hotline. So you’re calling with a question about the turkey for your Thanksgiving dinner—oof, are those your kids screaming in the background? Or your in-laws? I get the sense we’re not just talking about the turkey. It’s about the whole event, with the cooking, the cleaning, the family dynamics….So I’m not going to make this too transactional, like, “This is the cooking time; this is the thawing time.” I’m going to take a minute to connect with you. You’re not alone here. People are going through this.Illustration by: Liana FinckTake a deep breath. If it’s your thing, have some wine. Often, what’s a difficult experience now turns out to be a fun family story later, and I love it when people call back to share how it worked out. It might take a few years for it to become a funny anecdote and not a source of stress and shame, but hopefully it’s something down the road you will laugh about. And there are work-arounds for just about everything. Even if you realized you forgot to pull the turkey out of the freezer until Thanksgiving morning there’s very little that can’t be managed with a sense of humor and an improvisatory spirit.Illustration By: Liana FinckHere are the most common questions I get as a turkey therapist: How much turkey do you need for your family? One to one and a half pounds per person, but feel free to go bigger if you’ve got ambitious plans for leftovers! How can you tell if the turkey is fully cooked? Three things: meat thermometer, meat thermometer, meat thermometer. You want the temperature to reach 165 to 180 degrees in the thickest part of the thigh. How much time does that take? Depends on the size of your turkey, but it ranges from about three and a half to five and a half hours. And the big question: How do you thaw it in time? The best way is to plan ahead and thaw it in the refrigerator between two and five days depending on the size of the turkey. But you can utilize a day-of cold-water method if necessary and still be sitting down for dinner before midnight. And no, your grandmother’s time-honored trick of rolling turkey in dirt is not a food-safe way to thaw it. Neither is utilizing your car’s heated seats. Yes, those are both questions I have fielded on the line.Illustration By: Liana FinckAt the root of all these questions is a deeper one, and that's How do I do this right? And I’m here to tell you: Cut yourself some slack. It’s difficult to perfect a giant meal that you only get to practice making once a year. There’s a performative aspect to Thanksgiving dinner that makes people especially vulnerable. Even as a turkey crisis counselor, I become extremely stressed out when I have multiple things that all need to be done at the same time. And if something doesn’t turn out perfectly, it’s doubly frustrating. But don’t judge the whole dinner experience based on these scorched-earth sweet potatoes! Were they harmed? Yes. Do they represent my skill? No.Sometimes unforeseen events will cause you stress. I remember speaking to one lady whose mom had recently passed away, so the Thanksgiving torch had been passed to her. She was putting a lot of pressure on herself trying to make sure everything went perfectly in order to carry on her mom’s traditions.Illustration by: Liana FinckBut you can create unconventional traditions from difficult circumstances too. One family always has canned stew for dinner on the night before Thanksgiving to pay homage to the year they got caught in a blizzard on the big day and had to eat microwaved stew in a motel room. Another woman always includes a meat-and-cheese tray on her Thanksgiving table—not a fancy charcuterie board, just grocery-store cold cuts and Colby Jack—because one year she had to abandon Thanksgiving altogether to meet her husband who got a last-minute pass before his military deployment and that’s what they ate. Now that meat-and-cheese tray is always on the Thanksgiving table, and that’s the tradition they’ve passed down to their kids, like, “Hey, this meat-and-cheese tray is part of this now.” Those unique elements are what make your Thanksgiving special. Not whether the turkey skin is perfectly browned and Instagrammable.Illustration by: Liana FinckAs for me, after weeks of working the Turkey Hotline every year, my favorite way to spend Thanksgiving is when I get to travel to someone else’s house, take a side, and not worry about the turkey at all. I’m not going to ask how you thawed it; I’m not going to look at the meat thermometer you used; I’m just going to enjoy the meal. But I’m here if you have any questions.Chris Anderson is a consumer response specialist for Hormel Foods—and a stand-up comedian—who has worked the Jennie-O Turkey Hotline the past seven years.Explore Bon AppétitCultureLifestyleThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-22", "author": ["Condé Nast", "Chris Anderson", "As Told To Pamela Vachon"]}