{"id": "3dcf0cdab622f454ca0a44c0dab0f74c", "url": "https://www.bonappetit.com/story/spicebox-kitchen-cookbook", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "In Spicebox Kitchen, This Doctor-Turned-Chef Finds Medical Wisdom in Her Spice Cabinet  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Doctor-Turned-Chef Finds Medical Wisdom in Her Spice CabinetIn her new cookbook, ‘Spicebox Kitchen,’ Linda Shiue, MD swaps her stethoscope for cinnamon.By Ali FrancisMarch 16, 2021FacebookTwitterEmailPhotograph by Michelle K. MinFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Patients visiting physician Linda Shiue’s exam room are just as likely to leave with a recipe for kale chips or frozen banana ‘nice cream’ as they are a prescription. For more than a decade, the practicing internist, culinary medicine teacher, travel blogger, and San Francisco Cooking School–trained chef has been bridging the gap between food and medicine. In her new cookbook, Spicebox Kitchen, Shiue shows us how a stash of spices can act as the cook’s equivalent to a doctor’s bag.Her Taiwanese roots and love for travel yield pages of globally-inspired recipes, taking readers on a journey through California (where she lives), Asia, Trinidad (where her husband grew up), the Mediterranean, and the Middle East. From whole wheat scallion pancakes laced with Sichuan peppercorns to coconut-creamed callaloo, Shiue proves that eating healthy can, and should, be delicious.Of course, the healing potential of food and spices is nothing novel; this philosophy underpins the way many cultures have eaten for millenia, long before mass production lines left us with sugary cereals and over-processed ingredients. By highlighting dishes from around the world, Shiue’s cookbook nudges us back to the origins of wellness. As she sees it, there are more definitions of nutritious eating than the modern health industry might have us believe. “We have to embrace what other cuisines bring to the table, literally,” she says. “This is how we’ll help everyone get well.”Just before the Spicebox Kitchen launch, I called Shiue to chat about her journey from clinic to kitchen, what’s missing from Western medicine, and why joy is an essential ingredient.I grew up surrounded by international visitors… in eastern Long Island near the major national laboratory where both my parents worked. We would have these potlucks at our house periodically where people from all over the world would make a dish they loved; those dinners really opened the world for me.I thought cooking had nothing to do with medicine… and that being a chef was a nice diversion from being a doctor. My practice was, I think, very similar to most doctors’ practices in the Western world. I would see patients, figure out what their problem was, and then prescribe a pill. Unless you have a medical condition, insurance doesn’t cover preventative treatment.My light bulb moment happened… at a Harvard Medical School conference in 2012. The event brought together chefs and doctors and dietitians to talk about the latest updates in nutrition science and how we could help our patients integrate them into cooking practices. I’d often felt like I wasn’t doing enough for my patients; that they weren’t able to make the lifestyle changes they wanted to. In that moment I realized food could be a really great, creative way of guiding them towards healthier choices. I literally taught my first cooking class for patients a week after that, and have been doing so at my clinic since.I started writing recipes for my patients… on my prescription pad, which felt very radical. I would ask people what they’re eating, where they got tripped up, and what they thought was their downfall. I thought, Okay, how can I take what they like and make it a little bit more nutritious? And so my first two recipes were for kale chips and banana and ‘nice cream’ (where you take frozen bananas and whip them up in a food processor or blender). Even with all the kind of highfalutin medical training I’ve had, those recipes were what earned me the most passionate letters of gratitude from patients.Traditionally there’s not really a negotiation about treatment… in a doctor’s office. But that doesn’t work for most people. I mean, people will maybe take the pills if you prescribe them, but you can’t actually tell them what to do. With food, I found that I could give my patients more choices and agency to forge their own paths to health.The proliferation of processed food… in the ’60s has maybe everything to do with why we’ve moved away from the idea that food is medicine—while plenty of other countries still acknowledge that. America has a diverse population, with many cultures that share that perspective, and while we love and eat their cuisines, the message didn't seem to translate.A major problem with how we eat in this country… is that there’s kind of a monoculture around wellness in general. Like, I love kale and quinoa, but that’s what people think you have to eat to be healthy. And if you come from a culture where that doesn’t taste good to you, or it doesn’t make sense to you, you might feel like, Well, I can’t be healthy, then. My reason for featuring different parts of the world in my cookbook is that I wanted to give options that were more culturally inclusive.Spices were our first medicines… and they also add a lot of flavor. When making a curry, you also get the anti-inflammatory power of turmeric—especially when combined with black pepper, which increases its bioavailability. When you cook with ginger, you're not only adding a flavor you might associate with Asian food, you’re also getting digestive benefits.I don’t want to be part of diet culture… in a weight loss way, and I think joy is an essential part of eating. My goal is really to get people to enjoy vegetables more, by making them super delicious. I just want to be about good health and enjoying your food.Spicebox Kitchen$32 $26 at Amazon$29 at Bookshop.orgExplore Bon AppétitHealthyishSpiceTrinidadianAsianMiddle EasternMediterraneanCaliforniaShoppingInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Ali Francis"]}