{"id": "3dde8a37947809b4858534b116b05b6d", "url": "https://www.bonappetit.com/story/momoko-nakamura", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "This Rice Subscription Service Is Preserving Japan's Rich Rice Traditions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Woman Who's Obsessed With Getting People to Eat Better RiceWith her rice subscription service, Momoko Nakamura is trying to change the minds of both rice farmers and consumers.By Lisa Wong MacabascoMarch 14, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailMomoko Nakamura swirls brown rice clockwise, always clockwise, in a pot with her hands, dressed in a blue yukata (a traditional cotton robe), tabi socks, and zori sandals. She’s a striking sight at the Museum of Food and Drink in Brooklyn, where she’s demonstrating how to make perfect brown rice.“I wish there were more words to describe rice in Japanese,” she says. “Wine has this brilliant vocabulary. Rice is just this common thing that you don’t give attention to, unfortunately.”Nakamura is hoping to make people more discerning about an ingredient that’s often considered a blank canvas against which the rest of a meal shines. For her brown rice subscription service, Kiki Musubi (in Japanese kiki refers to “season” and “memory,” while musubi is a nod to both “connections” and “rice ball”), Nakamura roves the Japanese countryside, meeting small farmers and hand-selecting from the country’s 300 varietals. Every 15 days she dispatches a seasonally appropriate blend, free of chemicals and pesticides, in 500-gram packets or 1 or 2 kilos. In summer, she chooses varietals that are more nutty, light, and toothsome. In winter, they’re dense and chewy, with large grains similar to mochi.Momoko Nakamura provides 100 subscribers across the world with seasonal rice blends.\nPhoto by Waki HamatsuThese tiny grains of rice represent Nakamura’s large ambitions. She’s trying to change the minds of both Japanese farmers (who prefer the easier and more lucrative work of farming with pesticides) and consumers (who see brown rice as more expensive and harder to cook than white rice), in the face of a half-century of plummeting rice consumption in Japan; the average person now eats less than half the amount of rice annually as in 1962.The steep decline dates back to the 1950s, when the U.S. government provided flour as food aid after World War II. Japan subsequently served bread in school lunches; this generation was the first to eat bread for at least one daily meal. A Western diet centered on bread, meat, and dairy was promoted as essential to strong bodies. It was even advertised that eating rice made one less intelligent.In 2011, for the first time, Japanese families spent more on bread than on rice. Today’s turn away from rice is due to, among other factors, a growing preference for fast meals (noodles or bread take mere minutes to prepare) and an increasing trend of family members living separately instead of several generations under one roof—traditional meals of rice, miso soup, and a coterie of side dishes might seem like too much work for solo diners or small families.Preservation is at the core of Nakamura’s work. She maintains that a love for rice remains ingrained in the Japanese. “Every child in Japan has fond memories around rice,” she says (hers is the smell of rice cooking). And she’s deeply concerned about both the environmental damage wrought by commercial farming, and the way in which it has stripped rice of its taste, texture, and terroir. She even wears a yukata daily out of support for the artisans who make the apparel, an extremely rare fashion choice for someone her age. “Even my mom thinks it’s a bit strange,” she laughs.Nakamura, 37, grew up between the United States and Japan. She worked as a TV food show producer in New York for many years before settling in Tokyo three years ago. It struck her that the Japanese tend to be “incredibly discerning” in taste, from decor to wine to coffee, but that rice—a thing people ate three times a day or more—was “a bit of an ignored topic.” And people are loathe to invest in it. “The masses want the cheapest rice even though they'll spend lots on their daily coffee,” she says, estimating that her rice, which starts at $290 for a single season, up to $2,300 for a year, comes out to 25 cents a bowl. Refrigerated, the dry rice will last a year or longer.Now a year old, Kiki Musubi has about 100 subscribers across Japan, the U.S. (mainly New York and Los Angeles), Europe, Singapore, and Hong Kong; most come from word of mouth or Instagram. She characterizes her clientele as “mothers with young children, health fanatics, and grandmothers who wonder why rice doesn't taste the same anymore.”Yoko Iwaki, one of Nakamura’s subscribers in Manhattan, grew up in California preferring brown rice, which she concedes was unusual. “My grandparents’ generation doesn’t eat brown rice because during the war they had to eat it to survive.” Brown rice was perceived as less luxurious. “But there was a sweetness and texture to it that I liked.”Through the rice subscription, she’s explored a Japanese heritage she’s long been interested in but finds hard to approach. “I realized how disconnected I was from tradition and culture, and the way our ancestors used to eat,” says Iwaki, 37, who comes from a line of rice farmers. “My peers in Japan and Japanese Americans I speak to are curious about those things but we don't know where to start. Finding people like Momoko who make that accessible is a game-changer.”Nakamura includes a small gift to cook with the rice—glass noodles, hijiki, kombu, potato starch, glutens for miso soup—and Iwaki sometimes asks her mother to explain an unfamiliar ingredient (mochi awan, for example, a foxtail-like grain that’s added to rice): “It's been a special connection for us.”Nakamura’s ultimate goal, whether through Kiki Musubi or other means, is to try to preserve Japanese rice farmed in a traditional natural way and ensure it continues into the next generation. “I want people to know how brilliantly diverse it is,” she says. This spring, subscribers can expect to receive soft and light blends with names like “Rain Water” and “Insects Awaken.” The summer will bring light and firm varietals meant to be cooked on high heat. And she's always looking for new farmers and new varietals to supply. As Nakamura puts it, “I'm a little bit of a crazy when it comes to rice.”Subscribe to Kiki Musubi here.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishRiceJapanJapaneseShoppingInterviewsRead MorecultureCult Hairstylist Masami Hosono Just Wants to Be a ChefBy Jasmine LeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Lisa Wong Macabasco"]}