{"id": "3de27bb946e25c060dca2a8c51df6e35", "url": "https://www.bonappetit.com/story/pigs-in-a-blanket-feud", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "My 2019 “Keeper” Recipe Is Never Leaving My Side | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy 2019 “Keeper” Recipe Is Never Leaving My SideNow tell me yours!By Alex BeggsDecember 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Who is your favorite childYou know you have one. We’re updating this list of our reader’ keepers, as in, the Bon Appétit recipes you make over and over again. I want to know yours!! This year, mine was Chris Morocco’s “sambalognese” (pictured above). The spicy sauce made all other red sauces pointless to me. I need the HEAT. Heat that’s perfectly balanced by a little sugar, a lotta garlic, plus ginger, soy sauce, and rice vinegar.So please, tell me your “keeper”—new recipe or old!—by emailing staff.bonappetit@gmail.com. Oh! I’m also looking for etiquette questions about hosting dinner parties; send ‘em if you got ‘em.Get the recipe: Spicy-Sweet Sambal Pork NoodlesWant this letter before it hits the website? Sign up for our newsletter!Marcus NilssonThe end is nearOf the year, sheesh! Don’t be so morbid. And as we close out 2019, Google sent out a round-up of the year’s top trending searches, a sweet little reminder that you’re always being watched. Google’s a lot like Santa in that way. They see you when you’re searching, they know when you’re awake, they know if you’ve been incognito so be incognito for goodness’ sake! Ohhhh the top trending recipe search was “shepherd’s pie”??? Why??? But more intriguing was the top cocktail search: “pornstar martini.”What. the. Heck. Is. That.Actually, it sounds amazing. It’s a frothy orange drink that’s super popular in the U.K. (and was invented there, according to stevethebartender.com.au, in 2002). Delish has a simplified recipe: 4 oz. vanilla vodka, ½ cup passionfruit juice, and prosecco. But wait, the prosecco is served in a shot glass like a sidecar. This is confusing!!! Why not make it a spritz? That would be so good! I guess the prosecco shot is hyperbolic on purpose, it’s over-the-top, like [unprintable thoughts].Get a great shepherd’s pie recipe here.Photo by Ted + Chelsea CavanaughCookie weekIt was Rick Martinez COOKIE WEEK at BA this week and while the fashionable tie-dye cookies and minty black-and-whites got a lot of aesthetic attention, my favorite is the butter pecan skillet cookie. It’s a giant, nutty, buttery cookie with a simple vanilla glaze and maple syrup-roasted pecans on top. I die. Rick, who developed these recipes in the middle of his summer vacation, told me they were inspired by “Fire Island queens—all they wanted to eat was Butter Pecan Talenti gelato.” Yesssss.They were the shining maple star of Emma Wartzman’s Thanksgiving and were “a real accomplishment in texture,” she said. Kate Fenoglio reports that they got even better a few days after baking—and are exceptional with coffee for breakfast. “My aunt-in-law made them and they were a huge hit,” said cookie editor Hilary Cadigan. Priya Krishna tried nearly an entire skillet-full during tastings: “Truly they are one of the best cookies I have had in a long long time,” she said, “and I eat a lot of cookies.”Get the recipe: Butter Pecan Skillet CookiesRead: A nice story about Rick “Sugar Man” Martinez at SlatePhoto by @constellationinspirationSpeaking of cookiesAmy H. made ALL of the cookies from our December issue—cool!!!Speaking of Rick and cookiesRick got a COOKIE MANICURE by the mega-talented @jmoneynails!!!!Listen upThey roped me into recording a mini-segment on the Bon Appétit Foodcast called “Cook/Marry/Kill” where I pick a recipe to make, a food story I love, and a food thing I want to gently murder every week. It’s fun, I swear. Listen here if you want some musings on the $120,000 banana and KFC’s fried chicken-scented firelog. Or not! Carry on with your day. I’ll never know.Unnecessary food meme of the weekUnnecessary food feud of the weekJarren Vink“Do you make or buy pigs in a blanket?” was a question Christina Chaey posed to our Slack group. The replies BLEW UP. “If by ‘make,’ you mean buy the Pillsbury crescents and wrap them around cuts of sausage/hot dogs/kielbasa, then yes,” said Jesse Sparks. “But that’s as far as I’m going for Notorious P.I.B.’s.” Incredible abbreviating. “Hebrew national baby!” cheered on Molly Baz. Aliza Abarbanel roots to Trader Joe’s P.I.B.s. And you know it’s an important discussion when Adam Rapoport chimes in: “Buy. But—and this is a real [redacted] thing to say, says the guy in a turtleneck and a blazer, looking like Tom from Succession—but the ones at Polo Bar are REALLY good.” To which Chaey replied: “Do they have a freezer section or…”Pretzel blankets anyone?Explore Bon AppétitBeggs NewsletterRead MorecultureShrimp Scampi Pasta for the Hesitant Home CookBy Alex BeggscultureWhat to Cook When It’s Dark at 4 p.m.By Alex BeggscultureMore Prunes! More Prunes! More Prunes!By Alex BeggscultureBroc-Bolo: Easy to Say, Easy to LoveBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-14", "author": ["Condé Nast", "Alex Beggs"]}