{"id": "3de7edd576305488959f5933f631fa66", "url": "https://www.bonappetit.com/recipe/sweet-potatoes-with-tahini-butter", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Sweet Potatoes with Tahini Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSweet Potatoes with Tahini ButterBy Carla Lalli MusicJune 1, 20194.7(57)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintSteaming offers extreme speed and high hydration, which means that whatever you cook—from seasonal vegetables to proteins—will be done quickly and always moist. Sweet potatoes in particular benefit from this treatment, which makes their flesh pudding-like and fluffy. And you may think the tahini and butter will never combine with the liquids. Don’t give up; it will happen. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients6 servings3lb. sweet potatoes, any color (6 small or 3 large), scrubbed6Tbsp. unsalted butter, room temperature¼cup fresh lime juice2Tbsp. tahini1Tbsp. soy sauce2tsp. toasted sesame oilKosher salt, freshly ground pepperFlaky sea saltToasted sesame seeds and lime wedges (for serving)PreparationStep 1Bring a few inches of water to a boil in a medium pot fitted with a steamer basket. Halve sweet potatoes crosswise if large and place in steamer. Cover, reduce heat to medium, and steam until fork-tender, 25–30 minutes.Step 2Meanwhile, smash together butter, lime juice, tahini, soy sauce, and sesame oil in a small bowl with a fork until smooth, about 3 minutes. Season tahini butter with kosher salt and lots of pepper.Step 3Arrange sweet potatoes on a platter or a large plate. Let cool until you can just handle them, then split open and generously spread tahini butter over. Season with sea salt; top liberally with sesame seeds. Serve with lime wedges (this dish really comes alive with lots of bright citrus).How would you rate Sweet Potatoes with Tahini Butter?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleMade these for thanksgiving. Nobody liked it, especially the lime. I may try the recipe again without it. LoriSalem, OR11/29/2021So easy to make and sooo delicious.  A new taste treat using sweet potatoes, one of my favorite starches, this is a healthy, scrumptious recipe that deserves to be made again and again.Mary EllenPortland, OR4/26/2021Wow, so good -- a total keeper. A weekday dinner, I served this with some Italian sausages and these flavor bombs were a fantastic complement. TerrySan Francisco3/25/2021This is so much tastier than it has any right to be. I added in some caramelized Brussels sprouts and chickpeas roasted with smoked paprika and sumac. Party in the mouth!Corey-JanRoswell, GA2/19/2021The sauce is absolutely fantastic. I only had regular potatoes but it still paired nicely. I boiled my potatoes & smashed & tore them, then roasted at 425 degrees for ~25 min. I also did not have sesame oil so I used olive. I will definitely be making this sauce again & I can only assume sweet potatoes would be even tastier! Anonymous2/6/2021It’s SO TASTY!\nMaking it for Thanksgiving dinner. The sauce is to die for. Very flavorful and unique taste. Saltiness works  great with sweet potatoes. Natalia KDenver, CO11/26/2020This tahini butter is insanely delicious!! I will definately be making it again and again and again.   Thank you!EhookLos Angeles 11/14/2020This is my third time making this and it's just so damn delicious. I usually roast the potatoes, chop them up vs the halves and melt this on top by the dollop. The lime cuts the tahini so nicely and gives it a really unique and lovely flavor. Its my favorite way to make sweet potatoes now. Highly recommend! AnonymousSanta Monica, CA 9/11/2020Delicious! I admit to trying the tahini butter with roasted sweet potatoes - that was a bust. The second time I followed the recipe. Go steamed or don’t bother!AnonymousCalgary, Ab9/5/2020Totally delicious... like a restaurant gourmet meal. We paired it with some spiced marinated chickpeas and salad for a delicious, healthy meal. The first time definitely took longer than expected.... the sweet potato took double the time to cook (about an hour) and I struggled for 20min trying to mash the room temp butter with a fork till I finally whipped out the mini food processor. Next time I plan on baking in foil (like a jacket potato) instead of bothering with the steamer, and will just use the food processor to begin with. Also, watch out with the lime juice. It was slightly too sour and I had to add extra tahini & sesame oil to compensate... will start with 3 tbs then adjust to taste. Overall, an EXCELLENT dish and will go into our regulars. Anonymous6/8/2020Simple ingredients, complex flavor! I added the tiniest bit of agave nectar to the tahini butter. I kept tasting the tahini butter thinking to myself \"....really?\". But, like so many of Carla's recipes and videos, I just had to have a little faith. Absolutely delicious. Steaming sweet potatoes is the way to go - the creaminess of the flesh and tender skin will not be replicated by roasting. This would be a great meal prep recipe! AnonymousSeattle6/6/2020My new go to meal. As others have said, deceptively delicious. The steaming part did not seem better than when I roast, though, so I am sticking with my usual method there. Used ghee instead of butter. Perfect.eggeChicago 6/2/2020So dang good! The only thing is it can be a little rich, so don't hold back on the citrus. If you're using vegan \"butter\", I'd recommend using chilled stuff, otherwise it just kind of melts on contact with the sweet potatoes. So good though and really filling :)AnonymousMassachusetts5/18/2020The simplicity of this recipe is deceptive, as it offers a very complex flavour. We had a number of aging limes in our fruit bowl and some sweet potatoes in our new pandemic-inspired basement cooler when I came across this recipe. I've now made it twice and can't wait to share it with friends once we're able to interact again. I think about the tahini butter every day... Thanks, Carla. JFonzSaskatoon, Canada5/1/2020This was so so delicious!!!   The tahini lime butter ..... I want to put it on EVERYTHING.  I overcooked the sweet potatoes (in the Instant Pot, still learning how long to cook things), but it was still so delicious. This was such a satisfying breakfast. hdog35Orinda, CA4/29/2020Explore Bon AppétitSweet PotatoPotatoVegetableTahiniCondiments, Sauces & PastesEasySideMainVegetarianHealthyishSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}