{"id": "3def5cd245a3231ae7e3c73a5dfe927f", "url": "https://www.bonappetit.com/story/silk-and-sonder", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "This Monthly Journal Gives Some Structure to A Very Strange World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Monthly Journal Gives Some Structure to A Very Strange WorldThe mix of prompts, planners, and empty pages offers a helpful framework for feelings.By Flora TsapovskyFebruary 5, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!I’ve been journaling since I was 14, always using a Pilot Precise V5 pen to scribble in a hardback lined notebook (a couple dozens of which are stored at my parents’ house). In the uncharted territory of empty pages, journaling is an in-the-moment, chaotic task. Sometimes I unleash a stream of consciousness onto the page. Other times, it’s organized lists, goals, and promises I make to myself. Either way, after the writing is done, it’s virtually impossible to go back and locate entries from a particular time period. Where were those New Year’s resolutions I made in 2020? Gone into the abyss, along with the list of my favorite parties from 2018.Not so since I signed up for Silk + Sonder’s monthly journal, a subscription service founded in 2019 by entrepreneur Meha Agrawal. Lightweight and good-looking without being too cutesy, this part-planner, part-journal dedicates one third of its pages for free-flowing writing and two thirds for structured prompts, which caters to my internal control freak and musing philosopher in equal measure. Each month’s delivery focuses on a single theme with prompts designed to illuminate the concept from different angles. In September, the month of Observation, I was instructed to note daily descriptions of my mood. October, themed Tranquility, paired journaling with lists of five things that calmed me. In January, themed Ambition, I filled out an ikigai questionnaire (named after the Japanese term of “finding one’s reason for being”) designed to clarify career goals and marry them with purpose.Sure, Silk + Sonder journals are a bit of a commitment if you fill out absolutely all of the monthly lists, mood trackers, and more. But, as my thoughts grew increasingly erratic over the course of 2020, I found the structural support of the journals soothing and reassuring. Filling them with small, simplified details about my daily life has been just as therapeutic as pouring my heart out on the page unprompted; while the big picture of my life feels totally obscure (anyone else?), at least I got the little bits covered. I might go back to the vast freedom of blank notebooks someday, but while the world continues to make little sense, I’ll be sticking with a journaling ritual that does.Silk + Sonder Journal$20 at Silk + Sonder (Monthly)$54 at Silk + Sonder (Quarterly)Explore Bon AppétitHealthyishHealthyish Loves ItShoppingSelf CareRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-05", "author": ["Condé Nast", "Flora Tsapovsky"]}