{"id": "3df25a762cf408a88d0365d5afb8b1bd", "url": "https://www.bonappetit.com/story/most-popular-trader-joes-products-2017", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "The 16 Most Popular Trader Joe's Products of 2017 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 16 Most Popular Trader Joe's Products of 2017See what products customers voted as their favorites—and then add them to your shopping list.By Alyse WhitneyJanuary 16, 2018FacebookTwitterEmailTrader Joe'sFacebookTwitterEmailTrader Joe's has tons of new products every month, but we'll always come back to the classics. So we weren't surprised when the winners of Trader Joe's annual Customer Choice Awards were... mostly the same as the ones in 2016. The reign of frozen food favorite Mandarin Orange Chicken continues, but a few new products like the Everything But the Bagel Seasoning snuck into the running. Check out the top five overall products below, plus the other 15 customer-voted favorites.Top 5 Favorite Overall1. Mandarin Orange Chicken2. Everything But the Bagel Seasoning3. Unexpected Cheddar4. Dark Chocolate Peanut Butter Cups5. Cookie ButterCourtesy of Trader Joe's.Favorite Cheese: Unexpected CheddarThis isn't our favorite cheddar at Trader Joe's—that goes to English coastal—but this Parm-cheddar hybrid is great shaved on a salad or melted into grilled cheese.Favorite Bakery: Almond KringleKringle is a Danish pastry that, according to internet superfans, tastes like a croissant filled with marizpan and topped with icing. There is no photo on the Trader Joe's website, because it is probably so beautiful it would make you weep. Buy it if you can find it—it's super limited edition and usually only around during the holidays. Second runner up was the sliced French brioche, which is a lot easier to find, and almost as buttery.Favorite Candy: Dark Chocolate Peanut Butter CupsThe candy you dug out of your pillowcase on Halloween, but for adults with more refined palates.Courtesy of Trader Joe's.Favorite Condiment: Organic KetchupThe other top five were Green Dragon Hot Sauce, Sweet Chili Sauce, Everything But the Bagel Seasoning, and Organic Sriracha & Roasted Garlic BBQ Sauce. Ketchup is the most boring No. 1 on this list.Favorite Coffee: Cold Brew Coffee ConcentrateFun fact: you can heat the concentrate up if you want hot coffee but are too lazy to brew a pot.Favorite Beverage: Spiced CiderAnother seasonal favorite that's more crisp a pile of leaves on a fall day.Trader Joe's Cold Brew Coffee Concentrate. (Say that three times fast!)Courtesy of Trader Joe'sFavorite Frozen Dessert: Hold the Cone! Vanilla Ice Cream ConesIt's like the ice cream truck from your childhood took up permanent residence in your freezer.Favorite Frozen Entrée: Mandarin Orange ChickenThere were also two types of frozen mac and cheese in the top five frozen foods. But almost-as-good-as-takeout orange chicken won again.Favorite Frozen Appetizer: SpanakopitaSo. Flaky. Perfect for your next party or dinner on the couch tonight.Photo by Alex LauFavorite Pumpkin: Organic Canned PumpkinBecause making the homemade stuff is never, ever worth it.Favorite Produce: BananasOh, the key ingredient in our new favorite dessert: BLACKOUT CHOCOLATE BANANA BREAD.Favorite Holiday: Candy Cane Joe-Joe'sViral sensation Jingle Jangle (not named after the drug from teen show Riverdale) was bested by candy cane-flavored fake Oreos.Trader Joe'sFavorite Meal on the Go: Black Bean & Jack Cheese BurritoJust don't microwave it at the office. You're better than that.Favorite Meat(less): Soy ChorizoWe also have a recipe for vegetarian chorizo tacos, FYI.Favorite Snack: Peanut Butter PretzelsIf you eat a bag of these and close your eyes, it's like you're a kid again and the world isn't so bad.It's peanut butter pretzel time.Courtesy of Trader Joe'sHere's a way to use that everything seasoning:Explore Bon AppétitTrader Joe'sTrends + NewsTrendsRead MorefeaturesTrader Joe’s Newest Products in 2018, ReviewedBy Alex BeggscookingThe Best Thing to Do to Your Trader Joe’s Cheese? Marinate ItBy Tommy WernercultureThe Best Frozen Trader Joe's Apps for Your New Year's Eve PartyBy Alex DelanyshoppingTrader Joe's Butter Is as Good as the French StuffBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Alyse Whitney"]}