{"id": "3df3a53dd81abb11012145d905a6e202", "url": "https://www.bonappetit.com/story/brandon-go-hayato-los-angeles", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "The Bento Boxes from Chef Brandon Go of Hayato in Los Angeles Totally Blow My Mind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIt’s Been Six Months, and I Still Can’t Get Over Brandon Go’s Bento BoxesI mean, just look at them.By Elyse InamineMarch 13, 2019FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailBrandon Go works from 8:30 a.m. to 1 a.m., five days a week. He starts his mornings peeling shrimp for bento box lunches and ends the night washing stacks of dishes from his elaborate multicourse kaiseki dinners. On a sunny day last fall, I watch as Go emerges from the kitchen of his seven-seat restaurant Hayato, situated in Downtown L.A.’s mega food hall Row DTLA. He carries a tower of wooden boxes; he has only 45 minutes left to assemble the 16 elements that go into each lunch before customers arrive to pick them up.Wearing the typical Japanese professional uniform of a white lab-like coat with a button-down shirt and black tie, Go quietly and methodically grills skewers of miso-shellacked black cod. In between turning the skewers, he plunges a bunch of greens into cold water, then slices jelly-roll-like logs of egg into perfect chubby rounds. As another cook fries lima beans and pulls vegetables from their marinades, Go starts packing everything into the laptop-size containers—not a strand of his slicked-back hair out of place.Go preparing for service at Hayato\nPhoto by Dylan + JeniInside there’s a curl of custardy datemaki tamago (omelet). A cube of sweet potato cooked in water, then light shoyu (soy sauce) and brown sugar to balance its honeyed sweetness. Smoky grilled Hokkaido scallops. A pile of herbal chrysanthemum greens zapped with a squeeze of sudachi citrus. A fat slice of Japanese eggplant simmered in dashi, shoyu, sake, and mirin. Sweet snow crab transformed into curdy, meaty tofu. Crunchy-tender pickled vegetables. Hunks of winter melon, bloated with a gingery dashi.It’s is a full-on tasting menu and the most delicious bento I’ve ever had. It’s also the most beautiful with colorful bite-size pieces huddled together in a simple blond box, almost overwhelming to behold.As I eat, Go takes a break from his prep to explain the difference in the cooking methods, lighting up as he describes each approach. “Once you start teaching people and they see all the techniques and all the special ingredients, they get more interested. It’s like stepping into this whole new world. You want more. You want to learn more. You want to eat more,” he says. “That’s what happened to me.”Go’s raw materials: black cod and lots of kombu\nPhoto by Dylan + JeniGo has been cooking since he was 15 years old, making sushi at his dad’s restaurant, Koi, in Seal Beach in Southern California. He would come home after dinner shifts and practice making rice and cutting fish. “When I’m interested in something, I just go nuts. I don’t do anything halfway,” Go tells me. “My dad says I go too far, like why can’t I just make a normal bento with grilled fish, a few pickles, and rice? My mom says I was born like this.”He didn’t think of cooking as a possible career choice—his family wanted him to become a doctor—so he went to UCLA to study medicine, all the while returning to the restaurant to cook. After being rejected from medical school (“If I worked as hard at my premed stuff as I do at my restaurant, I would be a doctor right now,” he says), Go decided to go straight to the source of his obsession: Tokyo. He stayed with family and friends and worked at a nearby izakaya. “I thought I knew Japanese food after I had been at Koi for 10 years,” Go says. “Bit by bit, I started to realize I didn’t know anything. There was so much to learn.”For the next four years, he staged under some of Tokyo’s most revered chefs, including detail-oriented Takeshi Kubo of Goryukubo and whimsical Hideki Ishikawa of Ishikawa. He remembers how Kubo rejected his sliced myoga (Japanese ginger) because it wasn’t thin and translucent enough. He remembers bringing the suimono (clear soup) to Ishikawa as he stood outside in the rain bidding a guest goodbye, needing his boss’s approval before serving.  And he remembers all the beautifully boxed and packaged osechi he had to make one holiday season and how they were far tastier than the department store versions he had eaten before. Soon he had the idea for Hayato.Go sold very few bentos (and on some days, none at all) for about three months after he opened the restaurant a year ago. But he pressed on. He’s now selling his maximum lunch order of 16 bentos a day, booked a month in advance for $47. Last summer he launched his kaiseki dinners at the restaurant; the seven seats started selling out almost immediately at $200 a head.Evan Kleiman, radio show and podcast host of Good Food on KCRW, can’t remember exactly how she stumbled upon Hayato—either Instagram or wandering around Row DTLA—but she recalls the moment she understood how exceptional it is. A young Japanese woman was staying with her as part of a student exchange, and Kleiman brought back a bento to share with her. The student burst into tears, blown away, she explained, by each item. “It made her feel at home, and I can’t think of a higher compliment than that,” Kleiman says. “I was astounded by every bite. Each was so distinct and yet so harmonious,” she says. “As you’re eating, you’re already worrying that it’s going to end.”Outside Hayato\nPhoto by Dylan + JeniI visit Los Angeles about three times a year, and I always bring with me a very long list of restaurants to try. I cull my spots with help from friends in the publishing industry, chefs I know, locals I trust. For all of its aesthetics and deliciousness, Hayato is barely on the radar. I first learned of it through photographers Jeni Afuso and Dylan Ho, my go-to eating buddies when I’m in town. They emailed me out of the blue early in 2018: “You have to see what Brandon is doing.”For his part, Go has decided to eschew any kind of public relations. He says he just can’t afford it, but also that he wants to grow his customer base organically. “People that come in after seeing press releases are usually coming in just because they want to keep up with the L.A. food scene, not because they have a huge interest in how we cook,” he says. A small amount of coverage has found him without it—the bento appeared on the cover of Time Out Los Angeles last year and Hayato earned a spot on Los Angeles Magazine’s best new restaurants list at the end of 2018—but Hayato still continues to lay low, for the most part outside of the critics’ profile and review circuit and beyond food-flooded social media feeds.Go isn’t concerned. He’s fine just making the bentos in the almost masochistic way he does and serving the kind of kaiseki he admired in Japan.“Many of the things we make take a long time for people to appreciate. Even for me, when I was in Japan, it took a long time before I realized how special it was that someone was going to the trouble of making these things,” Go says. “Honestly, I feel like the people who really care about Japanese food find me without me having to find them.”Explore Bon AppétitRestaurants + TravelChefsJapaneseLos AngelesRead MoreseattleWhy Seattle Is One of the Most Exciting Places to Eat Japanese Food Right NowBy Elyse InaminecultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenWhere to eatThese Kyoto Coffee Shops Will Turn You into a “Coffee Person”By Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-13", "author": ["Condé Nast", "Elyse Inamine"]}