{"id": "3dfecb7cae8bc80cd3e5498d20889b9e", "url": "https://www.bonappetit.com/story/stadium-etiquette", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Is It Ever Okay to Spend the Entire Baseball Game in Line for Nachos? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Spend the Entire Baseball Game in Line for Nachos?Questionable etiquette on surviving game day from semi-pro stadium snacker Alex Beggs.By Alex BeggsFebruary 19, 2022FacebookTwitterEmailIllustration by Zak TebbalFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com. Do sporting events have veggie dogs yet? I’d probably go to more of them if they did. —Veggie VaraThere are Beyond sausages, Impossible burgers, Chik’n nachos, and other meatless options (including a curious amount of vegan chili) at most stadiums now, but you have to research where to find them before you go because they aren’t at every concession stand the way “regular meat” is. This is small progress, but we’ll take it.I don’t enjoy sports. Can I use food runs as a time killer? —Not-Into-It NicoDepends on where you’re sitting. Aisle? Go blow your entire paycheck at Hungry Howie’s. But if your beautiful butt is going to be in my face more than five times this game, you risk the silent steaming fury of a stranger who’ll never, ever confront you. Just…think of others!Illustration by Zak Tebbal Why don’t all American stadiums serve poutine at sporting events when it’s the best stadium food? —Canadian CoreyFor the same reason we’ll never get universal health care. We know it’s good for us, but we’re so far gone now it’d be embarrassing to start over. However, I’ll never give up hope!Illustration by Zak TebbalWhat’s the move in terms of taking home that souvenir helmet after you eat all the nachos out of it? —Souvenir Stacy As someone who has written extensively about the sanctity of souvenir helmet nachos, I can tell you what I do. Wipe the bowl out with dry napkins (water complicates things) and wash it more thoroughly when you get home. Like the Detroit Tigers, you’re just going to be happy with good enough for now.Illustration by Zak TebbalWhat’s appropriate to eat/ drink out of the Stanley Cup? —Hockey HendrickThe Cup is for liquids and snacks only. Require a utensil? Find another trophy. The thought of spoons scraping the silver-and-nickel-alloy bowl makes me want to be preserved in the ice at Little Caesars Arena while the Red Wings skate over my bones.Yea:Champagne/beerSprite Cherry would be niceBuglesLucky Charms milk after you ate the cereal out of a different bowlBone brothNay:Any chunky soupCollagen smoothieCocktails with ice, like a spritzOatmealIllustration by Zak TebbalWhat are the best stadium drinks that aren’t beer? —Dehydrated DoreenI think that the flavor of $15 bottled water is extra refreshing on a summer afternoon at the ballpark, but maybe that’s resentment I’m tasting. The answer varies, depending on what stadium you’re at, but if you see someone carrying a drink you want—Is that a frozen daiquiri in a two-foot plastic souvenir cup? Need!—ask them where they got it. Otherwise you’ll circle the park and never, ever find it. There’s a taco spot in Comerica Park in Detroit where I like to get a $17 margarita, but the only way to find it is to follow me; it’s over here somewhere....Illustration by Zak TebbalWeirdest but best hot dog toppings? I need inspiration. —Zany ZooeyAn inside source told me they get nacho cheese and pickled jalapeños on their hot dogs, and at that moment the world’s possibilities opened up to me like never before. See also: crab dip and mac ’n’ cheese. Then there’s beer spilled by the person behind you, which adds unexpected yeasty barley notes and helps the dry bun go down easy.Explore Bon AppétitIs It Ever OkayCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-19", "author": ["Condé Nast", "Alex Beggs"]}