{"id": "3e037a5d0cfc2b7abfe2a38b67e8742e", "url": "https://www.bonappetit.com/story/jenis-splendid-ice-creams-honey-vanilla-bean", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "I Make My Own Ice Cream, But I Fully Endorse Pints of Jeni’s Splendid Ice Creams  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Make My Own Ice Cream, But I Fully Endorse Jeni’s PintsSpecifically the floral, creamy honey vanilla bean flavor.By Sohla El-WayllyApril 15, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My parents own an ice cream store, so my first job title (at the tender age of eight) was Soft-Serve Swirler. I’d stand on a milk crate in front of the soft-serve machine, filling up cones and making sure each one had that perfect peak. Later on, I became a pastry chef, whipping up 15-gallon batches of ice cream at a time and churning upwards of eight flavors a night before each service. What I’m trying to say is: I know and love ice cream, so you should believe me when I tell you that Jeni’s Splendid Ice Creams is the best.It doesn’t matter what your favorite ice cream flavor is, Jeni’s has you covered. If mint chip is your thing—lookin’ at you, Chris Morocco—Jeni’s mint chip is worth throwing your spoon across the kitchen for. I foolishly thought vanilla was my favorite flavor. Then I tried  Jeni’s honey vanilla bean and realized that is actually my favorite flavor.Jeni’s is a premium Philadelphia-style ice cream, which means it doesn’t contain any eggs or yolks; all the richness and body comes from high-quality, grass-fed milk and cream. Without eggs getting in the way, the flavors of the dairy, honey, and vanilla really shine through. It’s creamy and decadent but still finishes so clean and light on the palate that I can easily eat a whole pint in one sitting. And because it’s lighter than French-style, custard-based ice creams, this vanilla ice cream is made for à la mode. There’s nothing better to top a warm slice of blueberry pie with, or sandwich between a couple of BA’s best chocolate chip cookies.The Jeni behind Jeni’s was also a pastry chef, and it shows in the way she balances the delicate floral flavors of honey and vanilla with just the right amount of salt. Don’t worry: This isn’t a salty ice cream by any means, but it’s seasoned just enough to enhance the musky, sweet aroma of vanilla. This vanilla bean-speckled pint hits me hard in a way other vanillas never have. It wakes up my old ice cream shop memories and makes it almost impossible for me to stop eating once I pop open a pint. I’m not kidding: This past Valentine’s Day, in lieu of flowers, my husband surprised me with a six-pack of Jeni’s ice cream. I think you know which pint I spooned my way through first.Buy it: Honey Vanilla Bean Ice Cream, $12 for a pint at Jeni’sAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingIce CreamRead MorecookingThe Only Thing Better Than Ice Cream...By Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Sohla El-Waylly"]}