{"id": "3e08497ad13b55ae0bd3de64455b4706", "url": "https://www.bonappetit.com/recipe/skillet-roasted-chicken-afritada", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "Skillet-Roasted Chicken Afritada Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSkillet-Roasted Chicken AfritadaBy Melissa MirandaDecember 30, 20214.7(49)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintChef Melissa Miranda’s version of chicken afritada, a popular Filipinx stew, isn’t her lola’s afritada—and that’s totally okay with her. The chicken and hearty vegetables that comprise afritada are often stewed together, but here Miranda cooks each element of the dish separately and then combines them in a skillet. The reward for all your effort is a sublime mixture of textures in every bite: crispy-skinned chicken, tender-but-not-mushy vegetables, and velvety stewed tomatoes. “This is a dish I grew up eating and is one of my go-to comfort foods,” she says. “Although it’s not as recognizable as chicken adobo, it’s definitely close to the hearts of my team and myself.”Watch Melissa make this recipe on our YouTube channel.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonTongs$13 At AmazonIngredients4–6 servings 2lb. skin-on, bone-in chicken thighs (4–6)Johnny’s Seasoning Salt or kosher saltFreshly ground black pepper (optional)1Tbsp. extra-virgin olive oil1½medium red bell peppers, ½ finely chopped, 1 cut into 1\" pieces1medium onion, finely chopped3medium carrots, peeled, 1 finely chopped, 2 sliced on a diagonal 1½\" thick2celery stalks, finely chopped5garlic cloves, coarsely chopped3bay leaves114.5-oz can diced tomatoes1cup low-sodium chicken broth1Tbsp. fish sauce1Tbsp. soy sauce12oz. heirloom or regular baby potatoes, scrubbed, halved3Tbsp. vegetable oil, divided½cup frozen thawed peas½cup pitted mixed olives, preferably Castelvetrano and KalamataPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 425°. Season chicken all over with seasoning salt (or kosher salt and black pepper). Heat olive oil in a large deep ovenproof skillet over medium-high. Cook chicken, skin side down, until skin is golden brown, 5-7 minutes. Turn chicken over with tongs and cook until lightly browned on the other side, about 2 minutes. Remove to a plate.Step 2Add chopped bell pepper, onion, chopped carrot, and celery to skillet. Cook, stirring often, until vegetables are softened but not yet browned, about 5 minutes. Add garlic and bay leaves; cook, stirring often, until fragrant, about 2 minutes. Stir in tomatoes, broth, fish sauce, and soy sauce. Taste and season with seasoning salt if needed. Return chicken, skin side up, to skillet in a single layer and transfer skillet to lower rack in oven. Roast until sauce is thickened and chicken is cooked through and deep golden brown on top, 40–45 minutes.Step 3Meanwhile, place potatoes and sliced carrots in a large bowl; drizzle with 2 Tbsp. vegetable oil and season with seasoning salt. Toss to coat. Transfer potatoes and carrots to a large rimmed baking sheet and spread out in an even layer. Roast on upper rack 10 minutes. Toss bell pepper pieces with remaining 1 Tbsp. vegetable oil in bowl; season with seasoning salt. Remove baking sheet from oven and add pepper pieces in an even layer. Return to oven and continue to roast until vegetables are browned and tender, 10–15 minutes more.Step 4Remove chicken to a platter. Stir roasted vegetables, peas, and olives into sauce in skillet. Nestle chicken, skin side up, back into skillet. Serve with rice.How would you rate Skillet-Roasted Chicken Afritada?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleWould omit the fish sauce next time didn’t like flavor of the fish in the chicken dishAnonymousNew Jersey 3/18/2022Absolutely delicious. The olives are a great touch and the end. We didn't change anything and it turned out really really well. R SalasDenver, CO 3/16/2022Amazing. Dabbed some sour cream into some spoonfuls and it was a really nice complement.AnonymousPhiladelphia2/9/2022My wife and I made this last night for Sunday evening dinner. It was absolutely fantastic. The flavors kind of reminded me of a cross between paella and ratatouille. The flavors come together very nicely and it's not too difficult of a recipe.Phil ShryockSeattle, WA1/31/2022Tried this recipe last night and the wife and I both loved it.  I made one major omission and left out the rice - just let the potatoes provide sufficient starch for the meal.  Next time, I plan to leave out the potatoes and served it over rice.  We highly recommend this one.AnonymousFair Oaks, CA1/27/2022keep wokeness out of food.filipina eldernew haven, ct1/24/2022Loved the great flavor!  I used boneless skinless chicken breasts because that's what I had on hand.  It was delicious, but I think thighs would have even more flavor.  So I'll try that next time.   It takes a bit of time prepping veggies and roasting, not at all difficult but better for a weekend when I have more time to cook.  OllieArlington VA1/23/2022Depth of each layer is delicious! Easy, fun, and Quick! Can’t miss with this recipe…excellent tasty dish.SkyePhoenix 1/23/2022One of the best recipes I have ever made. I had to make it again for my brother's family. Leftovers are even better. Didn't even need rice.    Merry BrownPacifica1/19/2022Stunningly delicious, and each step adds incredible layers of flavor.  Made it exactly as stated and was actually fun !\nD. GaleIrvine , CA1/19/2022Delicious! I will be adding this to my rotation of fantastic, flavorful chicken dishes.Anonymous Phoenix, Az1/10/2022No changes to recipe. The olives are such a great addition. Delicious and super easy. Can’t wait to make again! JennaColumbus, OH1/4/2022sooooo yummy!\nAnonymous1/3/2022Explore Bon AppétitDinnerMainEasyWeeknight MealsOne-Pot MealsFilipinoSoutheast AsianAsianChickenPoultryChicken ThighRoastVegetableBell PepperPotatoPeaCanned TomatoTomatoNut-FreeGluten-FreeDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-30", "author": ["Condé Nast", "Melissa Miranda"]}