{"id": "3e0c9ddffd7854ac4b4dd51860e8564f", "url": "https://www.bonappetit.com/recipe/lemon-pistachio-loaf", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Lemon-Pistachio Loaf Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueLemon-Pistachio LoafBy Ochre Bakery, Detroit, MISeptember 17, 20194.0(62)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintThis mega-moist olive oil cake from Ochre Bakery in Detroit (No. 4 on our 2019 Hot Ten list!) is bright and lemony, buttery and nutty. Don’t even think about lifting it out of the pan before it’s completely—and we mean completely—cool. Because it’s vegan, with no eggs for structure, its delicate crumb needs time to rest and firm up.IngredientsMakes one 9x5\" loaf⅓cup vegetable oil, plus more for pan¾cup (100 g) raw pistachiosZest of 2 lemons1¾cups (220 g) all-purpose flour1cup (200 g) granulated sugar2tsp. baking powder¾tsp. kosher salt5Tbsp. extra-virgin olive oil7Tbsp. fresh lemon juice, divided2cups powdered sugarPreparationStep 1Place a rack in middle of oven; preheat to 325°. Grease a 9x5\" loaf pan with vegetable oil, then line with parchment paper, leaving overhang on long sides. Oil parchment paper (for insurance and an easy release).Step 2Pulse pistachios in a food processor until finely ground (it’s okay if some of the pieces are a bit larger). Set aside a heaping tablespoonful.Step 3Whisk lemon zest, flour, granulated sugar, baking powder, salt, and remaining pistachios in a large bowl. Whisk olive oil, 2 Tbsp. lemon juice, remaining ⅓ cup vegetable oil, and ½ cup water in a small bowl to combine. Pour oil mixture into dry ingredients and fold with a rubber spatula to combine. Be very careful not to overmix: This batter contains a high ratio of liquid, which means it can get gummy if overworked. Transfer to prepared pan and use a spatula to distribute batter; batter should come halfway up the sides.Step 4Bake cake until golden brown all over, it springs back when gently pressed, and a tester inserted into the center comes out clean, 50–60 minutes. It's okay if your cake has dipped a little in the center. Transfer pan to a wire rack and let cake cool completely in pan, at least 2 hours. Using parchment overhang, lift cake out of pan and place on rack. Peel away parchment.Step 5Whisk powdered sugar and 3 Tbsp. lemon juice in a medium bowl, drizzling in remaining 2 Tbsp. lemon juice as needed until you have a thick but pourable glaze. Pour glaze over cake, letting it drip down the sides (if your cake has dipped, you can always glaze the flat underside instead of the top). Immediately top cake with reserved pistachios, then let sit until glaze is set, at least 30 minutes.Step 6Do Ahead: Cake can be made 3 days ahead. Store airtight at room temperature.How would you rate Lemon-Pistachio Loaf?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleThis was delicious and my non-vegan sister loved it as much as I did. It crumbled a little though so next time will process the nuts a little bit less and add the xanthan gum suggested. TannisToronto, Canada3/9/2022Read all the reviews, and I was worried about the delicateness of this loaf. SO I added 1/4 tsp xanthan gum to the dry ingredients! Totally worked like a charm. Loaf held together and had a lovely texture. Did not sink. I did however use a fraction of the glaze it called for. Already very sweet. I followed the rest of the recipe to a “T” — including the 1/2c water that’s not in the ingredient list!!! Follow this recipe perfectly and you prob won’t be disappointed!TrinaOntario10/4/2021I just made it this morning, following directions carefully.  It baked for 60 minutes and after 1 hour out of the oven the whole middle sunk in and it was raw.  Will not be attempting this recipe againAwfulGeorgia8/16/2021Made this into mini loaf cakes, using toasted pistachios (instead of raw), reduced the sugar by 25% and also replaced some water with soy milk. It's my fave vegan cake so far in terms of taste and texture. WawaVancouver, BC5/13/2021Given the reviews I had low expectations but I thought this came out great! I think the biggest variable that might make the cake very dense is how much you process the pistachios. I pulsed them into a mix of a sandy texture with plenty of larger bits - if you kept processing them to try to get all of it to a finer texture, I can see that weighing the cake down. I also followed the advice of others and halved the sugar for the icing and thought that was the perfect amount. This is a nice little cake and super easy to make.SoapnanaChicago5/4/2021I'm vegan and I do a lot of vegan baking. This recipe is a decent substitute for my prior favorite lemon cake but I feel like the recipe needed one more round of testing.  Specifically, something is off with the leavening. My cake dipped really badly and the recipe mentions this too. It still tastes good but it doesn't look good enough to serve to other people.CPBoston, MA3/1/2021Followed the recipe exactly but found the batter to be a bit dry so added a splash of water and baked for 55 mins....Came out amazing 🤩 Rhea Zambia Africa 1/29/2021I made this for the first time today and worked great and had no issues but I did have to re-read the recipe multiple times to make sure I didn't miss anything. The recipe itself needs to be clearer that's for sure. For those interested, this is how I'd written it down so it's clearer: \n\nDry:\n¾ cup (100g) raw pistachios\nzest of 2 lemons\n1¾ cups (220g) all-purpose flour\n1 cup (200g) granulated sugar\n2 teaspoons baking powder\n¾ teaspoon kosher salt\n\nWet:\n5 tablespoons extra-virgin olive oil\n1/3 cup vegetable oil\n1/2 cup water \n2 tablespoons fresh lemon juice \n\nFrosting:\n2-3 tablespoons fresh lemon juice\nzest from 1 lemon\n3/4 cup powdered sugar\n1 tablespoon reserved ground pistachio \n\nNotes:\n1. I didn't have raw pistachios so instead, I used Kirkland's Pistachios (roasted and salted) and they worked perfectly.\n\n2. Fold the wet into dry, only until the dry areas are covered. Much like you would pancake batter, don't overwork them. I did about 6-8 turns folds and it was enough. \n\n3. As with any powdered sugar coating, I always use 1/3 of the suggested recipe. I also add zest into the pistachio topping because, why not? \n\n4. Mine baked at exactly 60 minutes. AnonymousPhilippines8/23/2020Ochre Bakery is two and a half hours from where I live, but the drive is immensely worth it. This lemon pistachio loaf (along with the country sourdough bread) are two of my favorite things. Unfortunately, with the pandemic in full-swing, I can't get out to Detroit, so I'm trying this recipe. Wish me luck!Saint_____ChristopherGrand Rapids, Michigan7/22/2020I made this recipe exactly as the instructions said and the results could not have been better! All of my friends were incredibly impressed. Everything about this is great. As other comments noted, making 1/3 less icing would suffice. I think that if you only add 3 Tbsps of lemon juice to the icing, while it may seem too dense in the bowl, since the icing is still going to slough off as it sets that is actually the right amount of liquid to keep the icing on the loaf as thick as possible. (once you make it this makes sense haha)AnonymousCalifornia6/21/2020This was so good! Followed the recipe to a T. Don't forget to include the 1/2 cup of water as it's not included in the ingredients list, almost missed that one out! I had some rose water in hand so I added 1tbsp to the wet ingredients and 1 tbsp to the icing. Turned this into a lovely rose-pistachio loaf. Amazing that this is vegan!!makanwithmiloLondon6/1/2020Was really looking forward to eating this all day since I love pistachios. I used a total of 4T lemon juice (2T in batter and 2T in glaze with 1cup powdered sugar). Couldn't taste pistachios at all. Perhaps if recipe gave a specific amount of zest it might be better. I baked for an hour. It is moist and got a nice rise but given price of pistachios not worth my time and money. Disappointing.  Would try it at bakery if ever in town.AnonymousWI5/24/2020Very tasty! I didn't have enough pistachios so I used almonds and put a dash of almond extract in. After reading reviews I was very aware of how much I mixed my wet/dry ingredients. It took a good amount of stirs to combine, but I did get a nice rise with no tough or gummy texture. Very adaptable with the nut flavors - I can't wait to get pistachios and try as written. rfusSeattle5/5/2020I was hesitant about trying this given the reviews but I really enjoyed it! I followed the recipe exactly (although didn't end up putting the glaze on because I found the sweetness level to be good without it) — while it did sink a touch, it was very delicious nonetheless and had a lovely texture. Would make again.AnonymousSan Francisco, CA4/20/2020In response to the latest comment -- you might have forgotten to add water. It's not listed in the ingredients but is included when explaining how to mix the wet ingredients. I didn't see that and was wondering why the dough looked like wet sand, then noticed it was missing an ingredient I didn't set up for because it wasn't listed. Made all the difference after that.\nMaybe that was it?C.ToscanoDetroit, MI4/20/2020Explore Bon AppétitLoaf CakeCakeDessertLemonCitrusFruitPistachioNutSnackVeganVegetarianDairy-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}