{"id": "3e0e298c26431c7778ec5e5df3a72c28", "url": "https://www.bonappetit.com/story/best-kitchen-shears", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "The Best Kitchen Shears for Snipping Herbs and Spatchcocking Chickens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Kitchen Shears for Snipping Herbs and Spatchcocking ChickensA good knife can do it all—but there are some things a pair of kitchen scissors can do better.By Tiffany Hopkins and Alex DelanyMarch 16, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.It’s not that kitchen scissors can necessarily do things your chef’s knife and paring knife cannot. But the best kitchen shears will make certain tasks like snipping herbs, breaking down a whole chicken, or cracking lobster shells a lot easier. Although shears are often referred to as an “optional” kitchen tool, the home cooks who get it, get it. And lucky for you, a quality pair of kitchen shears is generally much cheaper than a fancy knife. See below for our favorite pairs and ways to use them.What are the best kitchen shears?If you’re looking for a solid pair of multipurpose kitchen shears (with comfortable handles) that do more than just snip, these Zwilling Henckels take-apart kitchen shears are among the most sturdy heavy-duty kitchen scissors we’ve used. The 3\" stainless-steel blades are high-quality, corrosion-resistant, and micro-serrated for easier, more efficient cutting. These shears can also replace several of your kitchen gadgets in a pinch; that jagged-toothed section of the handle can be used as a bottle opener or nutcracker. Can your knife do that? But mostly, we like that the blades come apart, which makes for easy cleaning after dispatching raw poultry. Hand-washing is recommended.Photo by Chelsie CraigJ.A. Henckels Take-Apart Kitchen Shears$16 at Zwilling$16 at AmazonLooking for more options? These are our other top picks.Small, strong, and precise, these humble ​​Joyce Chen Unlimited Scissors are a cult favorite among food stylists and have been popular among BA staffers for years. Don’t let their teeny size—just 6.5’ long—fool you. These things are perfect for precision cutting, and they “work almost as super-sharp extensions of your fingers,” says senior cooking editor Sarah Jampel. While the blades are small, the handles are roomy and can accommodate nearly any grip—right- or left-handed—making the scissors comfortable to hold and easy to maneuver.Joyce Chen Unlimited Kitchen Scissors$30 $18 at AmazonIf you’re looking for a pair of scissors that have sharp blades, a super comfortable grip, and a chic look and feel, there’s no better pair than the Good Shears by Material Kitchen. Senior commerce editor MacKenzie Chung Fegan likes their minimalist take-apart design because “there aren't a lot of nooks and crannies where gunk and germs can hide.” The soft grip handles also have silicone bumpers, so even for kitchen tasks that requires a lot of force, like cutting through chicken bones, your hand is cushioned. They’re so sturdy that Natasha Li Pickowicz keeps a pair outside in her garden for both pruning and harvesting fresh herbs. The shears have detachable, micro-serrated blades that are dishwasher-safe. Did we mention they come in GOLD?!The Good Shears$35 at MaterialWant a pair of high-end professional-grade shears that’ll last forever? The Yoshihiro All Stainless Steel Shears are your answer. The brand specializes in handcrafted, premium Japanese kitchen knives, and their shears are made with ergonomic stainless steel that’s designed to conform to your hand (no plastic handles here). This factor, along with the ultrasharp, micro-serrated edges, offers greater stability while cutting. Whether you’re using them as poultry shears, herb scissors, or as a nutcracker, they’re built to last. To keep them in tip-top shape, detach the blades for thorough cleaning shortly after using them (especially when working with acidic ingredients).Yoshihiro Pull-Apart Japanese Kitchen Shears$86 at AmazonWhen should I use kitchen shears instead of my knife?In many cases kitchen shears are far superior to a knife, making quick work of a clamshell full of chives and swiftly trimming excess pie dough. They're ideal for cutting pizza and other soft breads like focaccia, pita, and naan or for snipping strips of bacon into lardons. Chopping canned whole tomatoes is suddenly a mess-free proposition, and they’re also one of the best tools to use for peeling and deveining shrimp. Where kitchen shears truly shine, though, is in the poultry department. If you need to cut through poultry bones or spatchcock a turkey, kitchen shears are the easiest way to get the job done. Here’s the real pro tip: Use kitchen shears whenever you don't want to dirty your cutting board.Look at those Joyce Chens in action!\nHow do I sharpen my kitchen shears?Similar to knives, the best way to sharpen kitchen shears is with a whetstone, or sharpening stone. Here’s how it’s done: First, take the blades apart, if possible. This will ensure you’re able to sharpen the entire length of each blade. If your shears don’t come apart, this same technique applies, but it’ll be a little more difficult to get a sharp edge on the part of the blades nearest to the handle.Once the blades are separated, soak the whetstone (if your stone’s instructions call for it) and place it coarse side up on a non-slip surface. Then place one of the blades, flat-side down, on one end of the stone and gently drag it to the opposite end. You’ll need to do this about 10 times until this side of the blade is sharp. To sharpen the blade’s bevel, flip it over and drag it (at about an 80-degree angle) from one end of the stone to the other until you notice a burr. At this point, you can turn your whetstone fine side up, and run both sides of the blade over it a few times to polish and remove the burr. Repeat this process for both blades before putting your shears back together.This piece was originally published in 2018 and updated in 2022.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-16", "author": ["Condé Nast", "Tiffany Hopkins", "Alex Delany"]}