{"id": "3e0fe8f383c30af9be90f3777198027d", "url": "https://www.bonappetit.com/story/local-kombucha", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Local Kombucha Is Our Must-Buy Travel Item | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureForget Keychains, Local Kombucha Is Our Must-Buy Travel ItemWhenever we’re checking out a city, we keep one eye on the fridge.By Aliza AbarbanelAugust 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWe’re not sure exactly when kombucha crept onto brewery tap lists or “gut health” became acceptable to say in casual conversation, but the probiotic invasion of the refrigerated aisle is clear: We’re living in a funky, fermented world. While big-name brands dominate the grocery store, it’s the small-batch breweries across the country that capture our hearts—and soothe our stomachs after going too hard on that taco crawl. But it’s not just about the probiotics: Just like craft beer, kombucha is a great representation of regional tastes and quirks. The best bottles expertly balance acid and funk, pulling in heritage fruits (like Georgia peaches) and ceremonial-grade teas for a vibrant drinking experience unlike anything we can find at our usual bodegas. And yes, the whole gut health thing comes in handy after a long day of travel too. These are some of the many regional kombuchas we dream of sneaking past TSA.Photo by Chelsie CraigYesfolk Tonics: Troy, NYWhy we like it: This family-run microbrewery is helmed by trained herbalists, who use single-origin teas and ceremonial plants like palo santo and yaupon. One sip of their aromatic, wild tonics will forever make mass-produced kombucha taste like one-note apple cider vinegar.Favorite flavors: Yaupon, burdock-and-cardamom-laced Crystal Falls, or whatever you can get your hands on.Hex Ferments: Baltimore, MDWhy we like it: This Maryland-based fermentory is committed to doing things differently...like using wind power to turn local produce into kimchi, krauts, and kombucha with technicolor hues and tripped-out names.Favorite flavor: Butterfly Lime, which gets its shocking lavender hue from sweet pea flowers.KTonic: Austin, TXWhy we like it: This is the aggressively bubbly kombucha we crave on a hot afternoon. Instead of adding fruit juice, KTonic uses a single-fermentation approach that embraces herbaceous, almost-savory flavors.Favorite flavors: Original, a punchy mix of ginger and lemongrass anchored by deep tea flavor, and delicate Cherry Blossom.Baba’s Brew: Phoenixville, PAWhy we like it: Made from a Siberian family recipe, these nuanced kombuchas are made with whole fruits, not sugary juices or concentrates. And yeah, that squirrel on the label is pretty damn cute.Favorite flavors: Purple Rain, with blueberries and ginger root, and Believe, a mossy green tonic supercharged with lemon balm, juniper berries, and chlorella.Blue Ridge Bucha: Charlottesville, VAWhy we like it: A full-bodied base blend of green and black teas acts as a foundation for juicy fruit flavor without veering into soda territory. This might be the smoothest kombucha we’ve ever had.Favorite flavors: Bluegrass Bucha and Elderflower Sunrise.Revive Kombucha,: Sonoma, CAWhy we like it: Revive serves up clean, straightforward flavors with just the right amount of fire and funk. They’re all about balance and nuance, giving traditional kombucha flavors a boost of the unexpected.Favorite flavor: Yerba Mate Ginger is laced with vanilla and almond extract for cream soda vibes, and Turmeric Ginger Citrus brings the heat with a boost from black peppercorns.Photo by Chelsie CraigHoney Jun: Leavenworth, WAWhy we like it: Jun Kombucha is traditionally made with green tea and honey (instead of black tea and sugar), and cold brewed to reduce bitterness. The result? Light-bodied, aromatic probiotic drinks that go down easy—and are spiked with adaptogenic herbs for an added good-for-you boost.Favorite flavors: Pear Lime Nettle and Jasmine Rose.Kickin’ Kombucha: Houston, TXWhy we like it: If pressed juices and kombucha had a baby, they’d taste like this. These colorful bottles aren’t just filled with your standard SCOBY strings, but botanicals and juice pulp too. Shake at your own peril!Favorite flavors: Blueberry Mojito and The Goodness, a bracing blend of lemon, matcha, wheatgrass, spirulina, and kelp.MOR Kombucha: Denver, COWhy we like it: Familiar cans and less-familiar flavors join forces to create slightly sweet, intentionally accessible kombucha that drinks like a happy hour cocktail.Favorite flavors: Mojito, Ginger Grapefruit, and Cactus Fruit.Big Easy Bucha New Orleans, LAWhy we like it: This stuff is one hell of a NOLA hangover cure. The large format, low-sugar kombucha is ultra dry and tart, with fruit-forward flavors that celebrate the city’s culture and palate.Favorite flavors: Bayou Berry, with strawberry and honeysuckle, and Street Car Sipper, which uses the tiny, tart satsuma oranges that grow across Louisiana in winter.Explore Bon AppétitKombuchaRead MoreLifestyleYesfolk Tonics Makes Kombucha Like You've Never Seen—Or Tasted—BeforeBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-28", "author": ["Condé Nast", "Aliza Abarbanel"]}