{"id": "3e11c9e95dd7517960c7b2de2a796660", "url": "https://www.bonappetit.com/recipe/seared-short-ribs-with-mushrooms", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Seared Short Ribs With Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueSeared Short Ribs With MushroomsBy Molly BazFebruary 11, 20213.7(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintWhen we crave beef but don’t want a capital-S steak, we opt for a smaller cut (hello, short ribs!), then pile on lots of meaty mushrooms. These pickle-y mushrooms would also be delicious piled on top of toast. Just sayin’.Ingredients4 Servings1lb. 1½\"-thick boneless beef short ribs1tsp. kosher salt, plus moreFreshly ground black pepper½cup finely chopped hot cherry peppers or other hot pickled chiles, plus 3 Tbsp. brine1½tsp. honey5Tbsp. extra-virgin olive oil, divided1¼lb. mixed wild mushrooms (such as maitake and/or oyster), stems removed, torn into 1½\" pieces1large shallot, thinly sliced crosswise5garlic cloves, thinly sliced½cup finely chopped dillFlaky sea saltPreparationStep 1Pat short ribs dry with paper towels; season all over with kosher salt and pepper. Let sit at room temperature at least 10 minutes and up to 1 hour (go the full time if you can).Step 2Whisk hot cherry peppers, brine, honey, and 1 Tbsp. oil in a small bowl to combine; season vinaigrette with kosher salt.Step 3Heat a large heavy skillet over medium-high 5 minutes. Pat meat dry again and rub all over with 1 Tbsp. oil. Cook meat, turning occasionally, until deeply browned and crusty, 6–8 minutes. Transfer to a cutting board and let rest while you cook mushrooms.Step 4Wipe out skillet and return to medium-high heat. Add mushrooms and remaining 3 Tbsp. oil and toss well to coat. Sprinkle in 1 tsp. kosher salt, toss to incorporate, and cook, undisturbed, until mushrooms are golden brown and crisp underneath, about 5 minutes. Stir mushrooms and continue to cook until golden brown all over, about 5 minutes longer. Remove skillet from heat and add shallot, garlic, and dill; stir until shallot is softened, about 1 minute. Season with more kosher salt if needed.Step 5Slice short ribs against the grain; transfer to a platter. Pile mushrooms on top, spoon vinaigrette over, and season with sea salt.How would you rate Seared Short Ribs With Mushrooms?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWe...were not a fan of this recipe. I was encouraged by the many positive reviews, but ended up finding the flavor combinations were just not to our taste. The elements on their own were delicious. The elements combined over-powered the steak flavor. I can't help but wondering if this would maybe be better with a pork sausage or chicken?  I'm not sure I'm interested enough to find out.ErikaMichigan3/17/2021I made this with bone in short rib steak and it turned out delicious. I cooked it a little longer than the recommended times, just using a thermometer to make sure I got it up to medium rare/rare. Very simple but high impact flavor combination. Had it with a side of escarole salad, would have also liked broccolini or some dark green. Jane E.Minneapolis, MN3/1/2021My New Year resolution was to try a new recipe each week, and this made it to the menu tonight. It was so easy (although next time I will add cook time to the beef) and so delicious! We usually make seared mushrooms for steaks, and this was a great upgrade. My husband boldly declared ownership of the leftovers...Ha!Joann F.Waterford, CT3/1/2021I made this with Cod instead of ribs.\nIt was a really enjoyable dish.\nAnd there are so many ways to play with it.  I.e. Cod.  :-)\nAnd also what peppers you use in the \"sauce.\"  And what fresh herb you add at the end.  I did parsley sparsely.\nI sautéed the alliums for a minute because i'm not that keen on raw garlic.\n\nI'll def make this again.  in some from.Clay PATL2/26/2021Loved this dish, I find myself thinking all day about how I can't wait for dinner, even if it is reheated. The heat from the vinaigrette is excellent and the mushrooms go very well with the short rib. I will be making this again soon, very delicious and super east to make. E KingRaleigh, NC2/24/2021I used a different cut of steak, and also subbed parsley for dill. Nevertheless, this recipe rocked my world. The vinaigrette and shroom topping gave this dish a little kick, a bit of sweetness, and some extra texture. P.S. give that salt the full amount of time to penetrate the meat!!LeighBaltimore, MD2/24/2021Can this be done with bone-in short ribs as well? How much longer would they have to cook?Marianne Norway 2/21/2021The dill and sweetness from the honey was delish. And the mushrooms were too! I cannot wait for the leftovers on top of salad. Charlie B Portland, ME 2/13/2021Explore Bon AppétitShort RibBeefMeatMushroomVegetableEasyWeeknight MealsOne-Pot MealsMainNut-FreeGluten-FreeDairy-FreeKetoSearPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-11", "author": ["Condé Nast", "Molly Baz"]}