{"id": "3e171f2ee4305c195361b02b5335c948", "url": "https://www.bonappetit.com/story/scribe-winery-sonoma", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Okay, Fine, California: You Win at Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOkay, Fine, California: You Win at EverythingI went all the way to California for these recipes.By Carla Lalli MusicJuly 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.For this jaded New Yorker, the idea of cooking in California kicks off an amber-hued fantasy of palm trees, big sunny kitchens, postcard sunsets, and envy-inducing produce (they have it all—even in winter!). But the first time I drove up the half-mile long, palm tree-lined driveway at Scribe Winery in Sonoma, I realized my corny fantasies didn’t even come close.I was there to follow Kelly Mariani, who runs the culinary program at her family’s winery, for a couple of days while she showed me how to make a bunch of her pared-down recipes, each of which seemed designed to highlight some spectacular piece of produce she happened to have lying around. What I didn’t realize was that we’d be doing it in the hacienda’s light-filled kitchen, which opens onto a giant patio filled with rustic picnic tables and functions as the winery’s dining room, complete with a custom wood-fired grill. I looked out onto Scribe’s working garden, where frisky quail hopped among edible flowers (that’s a real thing that I saw with my eyes). In the kitchen there were stacks of Heath ceramics, shelves of cookbooks, and a massive walnut wood-topped island piled high with produce. Actual breezes were coming through—a thing I have experienced zero times in other professional kitchens. Breezes, I tell you!Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex LauEvery year Mariani feeds the thousands of day-tripping, wine-sipping millennials who flock from the Bay Area to her family’s winery—and she uses only the most common of tools: cast-iron pans, mortar and pestles, and hot ovens. She has access to any seasonings she wants, but turns reflexively and reliably to olive oil, lemon juice, good vinegar, fresh herbs, and fat pinches of salt. She could import anything in the world, but with the exception of Parmesan, all the cheeses on her menu are made in California. Her food is seasonal, healthy-ish, Italian-influenced, and insanely good.On this particular August day, Mariani transformed tomatoes, cucumbers, exquisite peaches, and humble dried beans into high-summer salads, proving that if it grows together, it really does go together. She grilled richly marbled lamb chops gently so that their fat would slowly render and brown, and pressed dark-meat chicken cutlets under a heavy skillet until their skin was as crisp as cracklin’s, then doused them in a five-ingredient homemade chile oil. She threw corn into a pot of steamed clams and studded a potato-and-egg frittata with juicy roasted red peppers. We washed everything down with Scribe wine, glasses of which seemed to appear like magic at golden hour (and disappear just as fast).Photo by Alex LauBest of all, she made it look easy. Unlike chefs who want to be known for their “restaurant food,” Kelly Mariani cooks the way all of us should, and also the way we could. I hope these recipes give you plenty of reasons to enjoy her very dreamy and less complicated way of eating. If you need more convincing, you could always book a table at Scribe and see for yourself.Find all of the Scribe recipes here:1 / 6ChevronChevronCucumber and Peach Salad with HerbsView RecipeExplore Bon AppétitCarla NewsletterSummerRead MorecultureIt Never Occurred to Me to Have Cooking Shoes, Now I Can’t Cook Without ThemBy Alex BeggscookingWhy Aren't We Grilling More Pork Shoulder Steaks?By Adam RapoportcookingZucchini Doesn't Have to Be Watery and SadBy Adam RapoportcookingWhy I Never “Man” the GrillBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Carla Lalli Music"]}