{"id": "3e3166325e08a38378ae5f6d75c7cd7e", "url": "https://www.bonappetit.com/story/what-you-need-to-know-feel-good-food-plan", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "What You Need to Know About the 2020 Feel Good Food Plan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat You Need to Know About the 2020 Feel Good Food PlanAn introduction to this year's Feel Good Food Plan from Healthyish editor Amanda Shapiro.By Amanda ShapiroJanuary 2, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Well, we made it to 2020—a nice, symmetrical year that I as a Virgo find quite pleasing. We got to wear double-zero sunglasses for the first time since 2010. We can stop saying “the teens” because it’s now the twenties, though not the Roaring ones...though I would not be mad if drop-waist dresses had a comeback sometime soon.Before you roll over and go back to sleep, let’s talk food. Maybe you’d like to eat a little healthier this year, or cook more, or spend less money on eating out. Maybe you already feel great about your food habits and just want some weeknight dinner inspiration for the new year. Maybe you like a good ten-day challenge. Maybe you’re too hungover to think about food right now.Wherever you’re at, the 2020 Feel Good Food Plan will meet you there. For the third year running, we’re kicking off January with ten days of delicious, healthy dinners, and I have to say we really nailed it this time, from tomorrow’s (vegan!) taco night to this squash salad with crispy chickpeas. Every recipe takes under an hour and uses no added sugar or artificial ingredients. They maximize your veggie intake without you really noticing (like this whole-wheat pasta that involves an ungodly amount of kale). They’re adaptable for vegetarians, vegans, and gluten-free folks. And they’re probably going to make enough for you to have leftovers for lunch the next day.Healthyish superstars Chris Morocco and Andy Baraghani developed these recipes, and I love all their children, but I’m especially proud of Chris’s chicken and rice meatballs, and Andy’s turmeric salmon over a pile of wilted chard. And of course it wouldn’t be the Feel Good Food Plan without dessert, which is where Healthyish columnist and Basically editor Sarah Jampel came through with these impossibly easy and snackable chocolatey date caramels (they’re also vegan as long as your bittersweet chocolate is).If you’re starting the ten-day plan with us tomorrow, hell yes! Here are your grocery lists for week 1 and week 2. We’ll be highlighting the recipes every day on our Instagram Story, and I hope you’ll tag #feelgoodfoodplan so I can see what you’re making too. I also highly recommend doing the FGFP with a friend, so sign them up for the newsletter and you’ll both get every day’s recipe first thing each morning. And, lastly, email healthyish@condenast.com with any questions or feedback. We’re here to help.So go back to lounging, and I’ll see you in the kitchen tomorrow.Until then,Amanda ShapiroHealthyish EditorExplore Bon AppétitFeel Good Food PlanHealthyishessayRead MorehealthyishThe Healthyish Feel Good Food PlanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-02", "author": ["Condé Nast", "Amanda Shapiro"]}