{"id": "3e34f53e648485e54e7aec897308f23b", "url": "https://www.bonappetit.com/story/isla-vida-san-francisco", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Best Thing at Isla Vida in San Francisco is the Jerk Chicken—And Everything Else | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Thing at Isla Vida is the Jerk Chicken…and the Ribs...and the Mango Hot Sauce...and...At the heart of San Francisco’s rapidly gentrifying Fillmore neighborhood sits a delightful new Afro-Caribbean grill.By Hilary CadiganMay 7, 2019FacebookTwitterEmailPhoto by Melissa de MataFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are some restaurants you fall in love with before you even go. Maybe it’s the chef, or the concept, or the fact that you’ll soon have [INSERT FAVORITE FOOD HERE] one block from your apartment. For me, in the case of San Francisco’s new quick-service Afro-Caribbean grill Isla Vida, it was what the place stood for: a clearly stated attempt to push back against the relentless tidal wave of gentrification hitting the historically black Fillmore neighborhood. As rents go up and communities get displaced across the country, the intentions of chef/owner Jay Foster (who ran erstwhile Tenderloin soul food joint Farmerbrown for 13 years before it shut down for this very reason) felt bigger than just one neighborhood, and imperative to the preservation of good food in this country.Of course, falling in love with a place sight-unseen/food-untasted is a dangerous game, especially with lofty notions like the ones stated above. But I got lucky. Juicy chicken spun 50 abreast on a massive rotisserie, jerk-seasoned or Cuban-style; tender spare ribs doused in a smoky-sweet guava barbecue sauce; a thick meaty Cuban sammie with manchego served on crusty bread; housemade mango hot sauce with a finishing slap of habanero. As the jaunty, joke-cracking server piled dish after steaming dish onto my already crammed table, it became clear that Isla Vida was not just here to meet expectations, but to exceed them. From the crispy ribbon-shaped fries to the crackly blooms of churro sitting in a pool of chocolate, eating at Isla Vida was a just-about-perfect dining experience. The kind that feels good in your belly and your soul (and your wallet)—even when your belly is full to the point of maybe-bursting and you have to cancel all your post-dinner plans and go to sleep. Although, to be perfectly honest, I was totally cool with that part too.Go There: Isla VidaExplore Bon AppétitHighly RecommendRestaurantsSan FranciscoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-07", "author": ["Condé Nast", "Hilary Cadigan"]}