{"id": "3e4351736eeb5e103aeba50b8ddf0bed", "url": "https://www.bonappetit.com/story/never-fail-raspberry-ricotta-cake-recipe", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "The Ricotta Cake I—and Apparently Every BA Reader Ever—Can't Get Enough Of | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Obsessed With This Raspberry-Ricotta Cake (And So Is Every Other BA Reader, Apparently)Before Alison Roman made The Cookies, she made The Cake.By Rachel KartenAugust 31, 2018FacebookTwitterEmailNicole FranzenFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.The comments section attached to anything on the Internet is a notoriously Bad Place. But there’s one comment section that’s pure and good: the one for this Raspberry-Ricotta Cake recipe from Alison Roman. Regardless of whether or not you intend to bake anything at all ever, reading it is enough to restore your faith in humanity. (Or at least, you know, cake.)“My husband says it is one of the best cakes he has ever eaten. And I am a pretty good baker....So easy and so delicious!!” —Anonymous, Santa Barbara“This is an easy, no-fuss way to make a great dessert. It's more of a European-style cake, with a denser texture and restrained sweetness. Which I loved!” —Like_To_Cook_Plants, San Francisco“I love this cake, my friends love this cake, my friend's adult children love this cake her daughter says it is her very favorite cake in the world!” —Anonymous, GeorgiaYou get the idea. The recipe has a total of 1,148 ratings (the 8th most-rated recipe on BonAppetit.com!) and almost all reviewers give it a glowing five stars. So, what the heck makes this cake so damn good? I made it to find out.First off, it’s got a super approachable ingredient list. That's where most baking recipes lose me—and a lot of other people, I would imagine. The only things I needed to buy were eggs, ricotta, and raspberries. Everything else I had in my pantry. It calls for a 9” cake pan (I bought mine at Whole Foods that day since I didn’t have one) and that’s about it in terms of kitchen equipment. Oh, and parchment paper. Which I learned how to cut into a circle using this Martha Stewart tutorial. To which video commenter “stinky242” points out “or you can use a pencil and trace it and save 10 minutes. duh﻿.” Alright, Stinky.The parchment circle in question.\nOnce you’ve got all your equipment, all this recipe takes is a few measurements and some arm strength. Whisk your dry ingredients. Whisk your wet ingredients. Combine. Fold in melted butter and some of your raspberries. Easy.(I interrupt my own programming for an important message from myself: I personally used fresh raspberries here. I know the recipe calls for frozen, which I think would work great when berries aren’t in season, but the freshies were calling my name. I stuck mine in the freezer for a second when I got home, just so they’d be less likely to break up when mixing them into the batter.)Okay, back to the recipe. Scrape your batter into your parchment-lined cake pan and then top with remaining raspberries. I think I was a little light-handed on my topping, and next time would do a little more than ¼ cup. But that’s just me!Finally, bake the cake at 350°F until it’s golden brown, about 50–60 minutes. Then let it cool at least 20 minutes before taking it out of the pan.What I ended up with was a moist (thanks ricotta!), berry-speckled, not-too-sweet cake that tasted like I had spent the whole day working on it. And, like any good senior social media manager, I immediately posted it to my Instagram. And then the comments came in.nikkirap: I made this last weekend. It’s amazing! ❤️cclarktine: Agreed! That recipe is so good (and perfect for a weekend breakfast)hilaryallard: I made this recently- it was fantastic and easyYep, turns out that a simple raspberry-ricotta cake can make almost any comments section a Good Place.Get the recipe:Raspberry-Ricotta CakeThere’s nothing like a moist, fluffy, berry-streaked cake to make any weeknight (or, um, weekday morning) feel special.View RecipeExplore Bon AppétitNever FailRaspberryRicottaCakeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-31", "author": ["Condé Nast", "Rachel Karten"]}