{"id": "3e43662cfd9be8b78038c5e2ac2953c2", "url": "https://www.bonappetit.com/story/chinese-steamed-pork-patty", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "How to Make Chinese Steamed Pork Patty (Yook Baeng) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Crave Simplicity, I Make This Chinese Steamed Pork PattyYook baeng is my most consistently delicious recipe.By Kate KassinJuly 24, 2020FacebookTwitterEmailPhoto by Justin Bridges, Food Styling by Tyna Hoang FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.For me, all the braised short ribs, biscuits, and rice and beans in the world pale in comparison to yook baeng. This simple Chinese dish, a Cantonese steamed pork cake that hails from the southern provinces like Guangdong, embodies the feeling of home.Quick to make (a sub-thirty-minute dinner) and with a minimal ingredient list— ground pork (usually from a market in Chinatown where the meat boasts a higher fat content), egg, soy sauce, and water—it can accommodate whatever mix-ins one desires.My great-grandfather, or gong gong as I called him, would make his with water chestnuts. My mom, a certified egg-head, likes to crack an additional egg on top and she eats hers alongside fermented bean curd. Chef Wilson Tang of Nom Wah Tea Parlor in New York’s Chinatown tops his with Thai bird chiles, scallions, fried shallots, and preserved radish. Some mix in salted duck egg, dried shrimp, fermented black beans, or a splash of Shaoxing wine. Over the years, I’ve started to add in ginger and minced scallions.In my family, the one constant in our making of yook baeng is the bowl we prepare it in. Every generation has cooked this dish in the same kind of blue and white painted fish bowl which we place on a round metal steaming rack.As someone who is half-Chinese, I grew up eating a handful of these simple meals, which my great-grandfather taught us to make in his tiny un-air-conditioned apartment on Fulton Street, only steps away from what is now the trendy South Street Seaport area. Cooking Chinese dishes like this one is a way for me to connect to my Chinese-American identity. It is one of the very first dishes I learned how to cook, as it doesn’t even have much of a recipe.Here’s how it’s done: Combine all of the ingredients in a shallow heatproof bowl with a fork (my utensil of choice)—1½ lbs. ground pork, 1 egg, a few teaspoons of soy sauce, and a couple tablespoons of water. Place a round metal steaming rack in a large pot and add enough water to reach the top. Set the dish on the rack, turn the heat to medium-high, and cover the pot until you can hear the water boiling, at which point you lower the heat to medium and set a timer for twenty minutes.Photo by Justin Bridges, Food Styling by Tyna HoangWe serve the pork right out of the bowl with a spoon to ladle the meat and juices over steamed jasmine rice and alongside a leafy Chinese green like baby bok choy or gai lan. Sometimes we garnish it with scallions and cilantro and chili crisp, if we’re feeling fancy, and sometimes with nothing at all. We eat it with both chopsticks and a tablespoon to scoop out the leftover rice bits that cling to the bowl.Every culture has dishes that are inseparable from the idea of home cooking that rarely appear in restaurant cooking but encapsulate simplicity and a feeling of home. To me, yook baeng is a dish that feeds the soul as much as it feeds the stomach, a dish that connects me to my Chinese ancestors who forged a culinary groundwork I continue to build upon, and a dish that provides the simplicity I need in this non-simple world we live in.When someone in my family asks what’s for dinner and my mom or I respond with yook baeng, the response is usually a satisfied mmmmm noise, anticipating the unchanging and consistent deliciousness that night’s meal will hold.Kate Kassin is a freelance writer based in New York. She loves to explore the intersection of cuisine, culture, history, and diplomacy.Explore Bon AppétitIt's That SimplePorkChineseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-24", "author": ["Condé Nast", "Kate Kassin"]}