{"id": "3e4ff4f63c1d098f74f19dc1204cdda7", "url": "https://www.bonappetit.com/recipe/fried-fish-with-piri-piri-sauce", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Fried Fish With Piri-Piri Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueFried Fish With Piri-Piri SauceBy Torrey PetersJanuary 4, 20224.3(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah MortonEmailPinterestPrintEmailPinterestPrint“My last dinner as a husband—and arguably, as a man—was a fried tilapia,” writes Detransition, Baby author Torrey Peters (read her essay on this final meal with her ex-wife in Uganda). This recipe, inspired by that meal, features a whole fish rubbed with a spice blend reminiscent of mchuzi mix, a seasoning popular in Kenya and other parts of Africa, then fried and served with peppery piri-piri sauce. Whole fish, while dramatic in appearance, are actually a lot more forgiving to cook than boneless fillets, which can overcook and dry out easily. Look for a fish around 2 lb. so it will fit into a wok or skillet and cook through relatively quickly.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMortar and Pestle$25 At AmazonBlender$32 At AmazonCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksFish Spatula$14 At AmazonTongs$13 At AmazonWire Rack$23 At BA MarketIngredients4 servingsSauce1Tbsp. vegetable oil1large red bell pepper, ribs and seeds removed, cut into 1\" pieces1large shallot, coarsely chopped2garlic cloves, coarsely chopped1habanero chile, halved11\" piece ginger, peeled, coarsely chopped1Tbsp. (or more) distilled white vinegar1tsp. dried thyme1tsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFish and assembly1Tbsp. coriander seeds1Tbsp. fennel seeds2tsp. cumin seeds1tsp. fenugreek seeds2Tbsp. garlic powder1Tbsp. paprika1Tbsp. sugar1tsp. ground turmeric1tsp. MSG (optional)4tsp. Diamond Crystal or 2½ tsp. Morton kosher salt, plus more2Tbsp. distilled white vinegar21½–2-lb. head-on whole fish (such as tilapia, porgy, or black sea bass), cleaned½cup rice flour4cups vegetable oilLime wedges (for serving)Special equipmentA spice mill or a mortar and pestlePreparationSauceStep 1Heat oil in a large skillet over medium. Cook bell pepper, shallot, garlic, chile, and ginger, stirring occasionally, until softened and golden brown in spots, 5–8 minutes. Transfer to a blender. Add vinegar, dried thyme, sugar, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; purée until smooth. Season sauce with more vinegar and/or salt if needed. Transfer to a small bowl.Fish and assemblyStep 2Grind coriander, fennel, cumin, and fenugreek seeds in a spice mill or with a mortar and pestle to a fine powder (it won’t be as fine with mortar and pestle); transfer to a small bowl. Mix in garlic powder, paprika, sugar, turmeric, MSG (if using), and 4 tsp. Diamond Crystal or 2½ tsp. Morton kosher salt, then stir in vinegar to make a paste.Step 3Place fish on a cutting board; pat dry. Using a knife, make slashes crosswise every 2\" along body of fish, cutting all the way down to the bones. Turn over and repeat on other side. Season fish all over with salt, including inside cavity and slashes. Rub spice paste over fish, tucking some into slashes. Pour rice flour onto a rimmed baking sheet. Coat fish evenly in rice flour, shaking off any excess.Step 4Heat oil in a large wok or cast-iron skillet over medium-high until an instant-read thermometer registers 365°. Grip a fish by the tail and carefully lower, head first, into wok, making sure to lay it down away from you and releasing gently. Fry until cooked through and skin is deeply browned and crisp, about 4 minutes per side (use tongs and a fish spatula to turn). Transfer to a wire rack. Repeat with second fish. Sprinkle lightly with salt.Step 5Serve fish with sauce and lime wedges.How would you rate Fried Fish With Piri-Piri Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglesurbhi reviewAnonymousindia1/20/2022Explore Bon AppétitDinnerMainSeafoodFishTilapiaBassAfricanEast AfricanFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Torrey Peters"]}