{"id": "3e54140db390091c79b98d057916480d", "url": "https://www.bonappetit.com/story/kitchen-cleaning-guide", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Kitchen Cleaning Tips: How to Clean Your Oven, Refrigerator, Vent Hood, and More | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStop Being Gross and Learn How to Clean Your KitchenThings are getting pretty gnarly in there.By Jolie KerrOctober 23, 2018FacebookTwitterEmailIllustration by Simon LandreinFacebookTwitterEmailIt's Get Organized week! Over the next few days, we'll be highlighting the products and methods we use in, out, and around the kitchen to get our lives together.If you cook regularly, chances are you probably clean regularly too: counters get a rub down, stovetops a quick wipe, dishes a thorough sponge bath after every meal prep. But there are plenty of spots in the kitchen that you probably aren’t cleaning that often, leaving you with inexplicably sticky cabinets or a refrigerator drawer with a head of liquified lettuce. That’s hella gross. Don’t be gross. We’re here to help you not be, with a guide to tackling all those overlooked spots in your kitchen.OvenYour oven’s greasy patina is not a good look, and no, it doesn’t need to retain the memories of everything you’ve cooked the last three years. So clean it! Start with an oven cleaner formula like Easy-Off. You just spray the entire interior of the oven, including the racks, then close the oven door and allow the cleaner to penetrate for 10 minutes. Then, remove the racks, transfer them to the sink, and wipe them with a sponge (not the one you use for your dishes!) and clean water; set them aside while you wipe the interior of the oven. For this, it’s helpful to have a small bucket filled halfway with clean water and a scrub sponge like a Scotch-Brite. Definitely make sure to wear rubber gloves, and up the ventilation anyway you can—turn on the hood, open a window, run the fan.If you’d rather not use a heavy-duty oven cleaner, there are alternatives, like using soap-impregnated steel wool. Just know that it’ll require more elbow grease.When to do it: At least twice a year.Illustration by Simon LandreinRefrigeratorCleaning your fridge is also a good excuse to clean out your fridge, so start by removing absolutely everything—all groceries, condiments, that box of baking soda in the back (it probably needs to be replaced anyway). Check the dates and toss what needs to go. Then pull out any removable shelves, drawers, or door inserts, and give those a good wash with hot, soapy water.For the rest of the refrigerator, try diluted bleach or white vinegar (but please, never never mix the two), an all-purpose cleaner like Formula 409 Multi-Surface Cleaner, or a simple solution of diluted dish soap. A Dobie Pad will scrub off any sticky food or spills without scratching your fridge’s surfaces. A Mr. Clean Magic Eraser can help remove any tough stains.For really tough spills—you know, the ones left there for who knows how long—wet a sponge or rag with very hot water, wring it out, and press it onto the congealed leakage. The combination of heat and moisture will make it more pliant and easier to wipe away, essentially by reconstituting it.When to do it: Quarterly (or more, if you’re known to hoard).Illustration by Simon LandreinVent Hood and CabinetsEver wonder how your cabinets get so sticky? Airborne cooking oil is the primary culprit. A degreaser like ZEP Heavy-Duty Citrus Degreaser or diluted ammonia, paired with a Dobie Pad, will make short work of removing cooking residue. These are heavy duty products, and you should wear protective gloves and ventilate your space when using them (note, too, that many commercial degreasers can’t be used on marble, granite, or other natural stone surfaces). For a gentler cleaning agent, Simple Green is an excellent choice, and is safe to use on natural stone.When to do it: At least once a year.Illustration by Simon LandreinSponge Holder and Drying RackFunny how the things that help us clean our kitchens are often the biggest, baddest breeding grounds for bacteria themselves. A toothbrush (but not the one you use in your mouth) combined with a product like Lysol Antibacterial Kitchen Cleaner is perfect for scrubbing away mold, mildew, and other bacteria that build up on sponge holders and drying racks. Afterward, wash them down with hot, soapy water.When to do it: Once a month.Illustration by Simon LandreinFaucets, Soap Dispenser, Refrigerator HandleHigh-touch areas, like light switches and doorknobs, are often overlooked during routine cleaning sprees, leaving germs and bacteria ready and waiting for the next hand that touches them. Nowhere is this more true than in the kitchen. The sink, especially the faucet, should be regularly wiped down with an all-purpose cleaner to remove bacteria and food particles left behind in the course of meal prep. The same goes for refrigerator door handles and soap dispensers, which are often touched after you’ve handled raw meat and poultry.When to do it: Way more often than you think! (So at least once a week.)Illustration by Simon LandreinSmall AppliancesSmall appliances that sit on kitchen counters will, like cabinet fronts and vent hoods, develop a patina of airborne grease, dust, and splatters from cooking. The exterior of small appliances like toasters and coffee makers, and any other items that are stored in the open, should be wiped off frequently with an all-purpose cleaner and a rag or paper towels.When to do it: Add this job to your regular kitchen cleaning routine—it’s easy and fast, so make it a habit.Never underestimate the power of white vinegar:18 Places You Should Be Cleaning with Vinegar in Your KitchenFinally get the grease off your stovetop, make stainless steel pans sparkle again, and more.View StoryJolie Kerr is a cleaning expert, advice columnist, and host of the podcast, “Ask a Clean Person.”All products featured on Bon Appétit are independently selected by our editors. However, if you buy something through our links, we may earn an affiliate commission.Explore Bon AppétitShoppingCleaningGet OrganizedRead MorecultureIt’s Time to Embrace the Granny CartBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Jolie Kerr"]}