{"id": "3e57cfca348d4204d0862e3de2b30d2a", "url": "https://www.bonappetit.com/recipe/ginger-raspberry-icebox-cake-with-caramel-cream", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Ginger-Raspberry Icebox Cake With Caramel Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGinger-Raspberry Icebox Cake With Caramel CreamBy Samantha SeneviratneJuly 6, 20213.6(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrint“This icebox cake is perfect for summer because you don’t have to turn on your oven,” says baker and recipe developer Samantha Seneviratne. Store-bought ginger cookies soften into layers of tender cake surrounded by loads of raspberries and lofty caramel cream. We prefer thin ginger cookies, but almond cookies or thicker shortbread would be just as tasty.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonPotato Masher$15 At Amazon8x8\" Baking Dish$15.99 At AmazonMedium Saucepan with Lid$36.99 At AmazonIngredients8 Servingsraspberry sauce4cups fresh raspberries5Tbsp. (63 g) sugar1Tbsp. finely chopped crystallized ginger2Tbsp. cornstarchCaramel cream and assembly1cup (200 g) sugar3cups heavy cream, divided35–40thin ginger cookies (such as Anna's Ginger Swedish Thins)2¼cups fresh raspberries, plus more for servingAssorted fresh currants (for serving; optional)Preparationraspberry SauceStep 1Cook raspberries, sugar, and ginger in a medium saucepan over medium heat, crushing with a potato masher, until softened and some of the liquid evaporates, 6–8 minutes.Step 2Transfer 3 Tbsp. cooking liquid to a small bowl and whisk in cornstarch. Stir slurry into sauce in pan and cook, stirring, until thickened to about the consistency of jam, about 2 minutes; let cool.Caramel Cream and assemblyStep 3Cook sugar and 3 Tbsp. water in a small saucepan over medium heat, without stirring, until mixture starts to darken in spots. Carefully swirl pan to evenly cook sugar but do not stir it. Cook, swirling occasionally, until caramel is a deep amber, about 8 minutes. Immediately stir in 1 cup cream. Cook until no streaks remain, about 30 seconds. Let cool.Step 4Using an electric mixer on medium-high speed, beat remaining 2 cups cream in a large bowl to medium peaks. Add cooled caramel and beat to stiff peaks (a few swirls of caramel are okay).Step 5Line an 8x8\" baking dish with 2 sheets of parchment paper, leaving a 2\" overhang on all 4 sides. Cover bottom with a single layer of cookies, breaking to fit as needed. Top with about ½ cup raspberry sauce and spread evenly to corners and edges. Top with ¾ cup raspberries, then spread 2 cups caramel cream over berries. Repeat layers with remaining ingredients. Cover and chill at least 6 hours.Step 6To serve, top with more raspberries and currants (if desired) and slice, wiping knife between cuts.Do ahead: Icebox cake can be made 2 days ahead. Keep chilled.How would you rate Ginger-Raspberry Icebox Cake With Caramel Cream?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis mess of a dessert was delicious. Somewhat time-consuming, but worth it. When I used the called-for amount of caramel cream in the first layer, I had to skimp on the other layers - so beware. Also,my whipped cream really deflated when I added the caramel, but I think that was my mistake.\nWill make again, for a special occasion.JudyWLouisville KY9/13/2021love this cake. making my second one today but how do you remove the parchment paper when placing the cake onto platter to serve\nSandy BertuccelliHayden Lake, Idaho9/10/2021A wonderful summer dessert. I found all the individual steps to be very straightforward. I used a whole box of Nabisco Gingers Snaps and wish I had more. I was able to remove one piece of the parchment, but not the other. I just cut it off to conceal the edge. I was hoping it would firm up more but it remained fairly soft, even after a day in the fridge. Next time I'll try to get stiffer peaks with the cream. GinaGDenver, CO8/8/2021Great Summer Dessert!  Made once as written and had no problems with the recipe at all.  Made it again just now with blueberries, subbing purchased Fat Toad Caramel and local blackberry jam for the homemade in the recipe-and although the recipe is better, the shortcut version is really delightful.  This one’s a keeper!!!greenmtgirlStowe VT8/7/2021Watch the video. It totally helps. Some of the questions people had in other reviews were answered there. I had extra so after making the 8x8 I made a 4x4. Whip looks good. Tomorrow I’ll take it out of the pan so I’ll see how it holds up. Tastes amazing. Carmel came out nice, I was nervous. JennPalmer, Ak8/3/2021I’m also wondering about where I put it to chill? I’m going to go with fridge and will keep you posted! I also agree with temporarily removing from heat before adding the 1c. Cream then putting it back on the heat. The jam needed more than 6 minutes too - i would say 10 or so, but likely depends on a lot of factors such as stove temp and ripeness of raspberriesAmyBerkeley7/23/2021Silly question… chill in the fridge or the freezer? I’ve never made icebox cake before.Anonymous7/19/2021Totally agree with the other review. This is a really poorly written recipe. I’m on my second go of trying to make it so we will see how it turns out. Anonymous7/17/2021Really lovely recipe that I ended up having to make several times due to hiccups. When adding the cream to the caramel, I found it significantly easier to remove it from the heat and in a very slow dribble whisk in the cream. This will stop it from seizing. You can add all of the cream for the whipped cream at this stage as whipping part of it and then adding the caramel cream disrupts the aeration and leads to deflated cream. Adding a ½ teaspoon of salt went a long way. I find occasionally the way recipes are written here omits crucial information for the sake of brevity and I can't say I appreciate it. More through information is always better.Anonymous7/16/2021Explore Bon AppétitCakeDessertFrozen DessertAmericanRaspberryBerryFruitSummerEasyNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Samantha Seneviratne"]}