{"id": "3e57d8c565534144a3e12b6ebeaab4b1", "url": "https://www.bonappetit.com/story/i-had-a-cooking-plan", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "I Had a Cooking Plan, Then This Week Happened | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Had a Cooking Plan, Then This Week HappenedThat’s what takeout is for.By Christina ChaeyNovember 8, 2020FacebookTwitterEmailFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,In an attempt to stave off quarantine boredom, shave a few bucks off my monthly grocery bill, and use up the growing stockpile of dried beans in my pantry, I gave myself a cooking challenge for the month of November. The idea was to cook all my meals using only pantry staples, condiments, and a modest amount of fresh produce. I reorganized and relabeled everything in my pantry and made a list of all the recipes I wanted to cook.And then this week happened, and my plans of eating nothing but lentils and oats and eggs galore promptly went to shit. I ordered takeout multiple days in a row, living in a blur of anxiety, carbs, the news, stress, and more carbs. When I did cook, I barely did more than heat up a tortilla and melt a blanket of cheese on top. There’s a mountain of kale in the fridge that I can’t bear to look at (much less cook), and I know it’s dying a slow, wilty death.I'm putting the beans (and the eating plans) aside for now.\nInstead of guilting myself for letting the kale go bad or stressing about spending money on takeout, I’m trying to give myself a pass on life this week. Since this whole thing began, I’ve noticed I often try to uphold my pre-pandemic standards—of cooking, living, working, and being. I have to fight to remember that the nonstop pace of that life is no longer realistic in a world where compounded stress, anxiety, and fear of the unknown are the new normal. And as someone who uses cooking and diet as a means of coping with anxiety and creating order from chaos, I’m trying my damndest to convince myself that, when my food plans don’t work out, that doesn’t mean I’ve failed. It just means I needed to go in a different direction. And that’s...okay. So about that ill-fated November pantry challenge: I’ve scrapped that plan, at least in its original iteration. I’m still going to try to cook out of my pantry when I can (more on how that’s going next time), but I won’t try to force it on the days when all I want is khao soy from my favorite Thai spot. The only plan I have is to stress less.I hope you give yourself a pass too,Christina ChaeyAssociate editorP.S. When you're ready to make beans, here's a recipe:Brothy Heirloom Beans with CreamThe simple joy of vibrant beans cooked in fragrant broth with a splash of cream.View RecipeExplore Bon AppétitHealthyishWhat's Chaey Cooking?Read MoreLifestyleOne Pot, One Million(ish) OptionsBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-08", "author": ["Condé Nast", "Christina Chaey"]}