{"id": "3e6c584056b8642b62b220c123137ef4", "url": "https://www.bonappetit.com/story/tarla-dalal", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Tarla Dalal's Cookbooks Taught My Mother—And Millions of Indians—How to Cook Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTarla Dalal's Cookbooks Taught My Mother—And Millions of Indians—How to Cook EverythingThe widely prolific cookbook author was famous among Indian cooks, but her name has disappeared from culinary conversation.By Priya KrishnaAugust 23, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailThe first cookbook my mother bought for herself was The Pleasures of Vegetarian Cooking by Tarla Dalal, a faded, tan-colored volume of comic book thickness with tattered edges. It was 1980, she’d just gotten married in Delhi, and she hadn’t yet learned how to cook. In India, “Finding any cookbook back then wasn’t easy,” she told me. Her mom hated cooking and hadn’t bothered to teach her, so she was on her own.Dalal taught my mom how to make a fluffy, eggless pineapple cake, biryani, sweet and sour vegetables, and roasted cauliflower topped with tomato sauce and peas. Her recipes were simple, easy-to-follow, and “catered to Indians living in India,” my mom said, with temperatures in Celsius, measurements in teacups, and ingredient lists adapted for her local grocery stores and spice-coated palate.If you’re not from India, you may not be familiar with Tarla Dalal. But to Indians, she is one of the most influential culinary figures of all time. From the ’60s onward, Dalal upended the Indian cooking industry before one even properly existed. She taught cooking classes, authored over 100 books and sold more than 3 million copies, hosted television shows, and became India’s go-to resource for cooking dishes from all over the globe, from Gujarati stews to lasagna verdi.Chelsie CraigDalal was born in Pune, in the western part of India, and moved to Bombay (now Mumbai) in 1960 when she got married. Looking to expand her cooking horizons, she purchased dozens of international cookbooks and “started trying different recipes, converting non-vegetarian gravies to vegetarian gravies, and making Mexican rice and Thai curry,” recalls her son, Sanjay Dalal, who runs the Tarla Dalal website. “Nobody knew how to cook that in India.”For extra money she started teaching cooking classes out of her house. As Sanjay remembers: “It started with a small pocket of housewives around the neighborhood,” most of them vegetarian and eager to learn new dishes to add to their repertoire. Soon classes of three people turned into classes of 50, with requests for Dalal to write down all her recipes. The popularity of her classes caught the eye of Vakil and Sons, one of the bigger publishing companies in Bombay. That’s how Dalal ended up writing The Pleasures of Vegetarian Cooking in 1974, which would become her signature work.“It is not as if vegetarians are problem people,” she muses in the opening lines of the cookbook. “Yet the non-vegetarian hostess when confronted with the task of entertaining vegetarian guests has known and felt the absence of a suitable cookbook designed to help her. And the vegetarian family who wants to discover new horizons in good eating…can derive little guidance or solace from available books.”Chelsie CraigIn her friendly, down-to-earth tone, she lays out a set of rules for the recipes that follow: They must be simple, quick, reproducible, and economical. “You see, good cooking is not difficult technically,” she reassures. “With some guidance and encouragement, any person with a liking for food, interest in cooking, and a little patience can, instead of being just an ordinary cook, become an excellent one.”The book contains at least 200 recipes, from Indian dishes like potato paratha (a type of bread stuffed with potatoes) to salads (including a recipe for Thousand Island dressing) to Chinese fried rice and Italian dishes like lasagna and risotto, as well as a section on ice cream and miscellaneous desserts (apple pie! chocolate soufflé! Baked Alaska!). The soufflé has no eggs (eggs are considered non-vegetarian to many Indians); the lasagna calls for tomato ketchup instead of tomato paste for the sauce; and the risotto is cooked with ghee instead of regular butter.Inside The Pleasures of Vegetarian Cooking\nChelsie CraigMy earliest memories of my mom’s dinner-party prep involve her flipping through a Tarla Dalal book, trying to come up with a showstopping vegetarian main course that would impress even meat eaters. That’s how she found the roasted cauliflower with tomato sauce and green peas, which she eventually modified into a whole roasted cauliflower with a verdant chutney made of green peas, fenugreek, and onions. (That’s the other thing about Dalal’s recipes: They are endlessly adaptable.)Throughout her early books, the photos are few and interspersed with color inserts showing retro still-life spreads of food served on silver platters, often decorated with flowers and figurines of Indian deities. An image of Mexican food includes a Mayan calendar, a parrot-shaped bowl, and a platter of hard-shell tacos that bear a very close resemblance to the ones in Taco Bell commercials. There’s an adorable photo of a children’s birthday party for the section on kids’ desserts; it depicts biscuits imperfectly molded into fish and birds, a DIY candy house with a gumdrop roof and icing shakily drawn onto windows, and some kind of Pepto Bismol–pink frothy drink.At this point in time in India, writing down recipes was itself revolutionary. “Indian food is notoriously undocumented,” says Anita Jaisinghani, chef-owner of Pondicheri in Houston and New York. Recipes were typically passed down orally through generations, and rarely did people exchange recipes between friends. “You can make makhani dal ten different ways and none of them are wrong.” Dalal “took the food and started putting some kind of order to it.”Even more radical was that in this age before airplane travel was widespread, Dalal’s recipes reached multiple regions of India and other parts of the world. Nilanjana S. Roy, the Calcutta-born author of A Matter of Taste: The Penguin Book of Indian Writing on Food, remembers having an “odd collection of ‘foreign’ cookbooks ranging from Larousse to Elizabeth David,” she says. But “Tarla Dalal was far more useful in a country that had paneer and no mozzarella cheese, where Steakhouse and Pigpo were the only places in Delhi that had cold cuts, and at a time when olives were treated with respect, as rare.”Also, in a culture of mostly male professional Indian chefs, Dalal was “one of the first few who came across as a woman relating to a woman,” Sanjay says. Quickly she became a prolific author and a nationwide icon among home cooks, her popularity spanning both class and geography. The classic image of Dalal—with her jet-black hair, heavy red sari, gold bangle, and yellow apron—was recognizable to everyone in India. She wasn’t someone to aspire to, but rather someone you might recognize in your own neighborhood: a chatty friend with endless tips.Dalal’s empire eventually expanded into health-oriented cookbooks like the Pregnancy Cookbook and Delicious Diabetic Recipes. She hired nutritionists and partnered with pharmaceutical companies to produce Indian-friendly recipes translated into the various local dialects. There was also a recipe website, launched in 1999; two television shows; a line of ready-to-cook mixes; and a bimonthly magazine called Cooking & More, started in 2003. My mom and I agree: None of these completely capture the joy that exhales through the pages of a Tarla Dalal cookbook—the words of encouragement, the pragmatism of Dalal’s voice, the feeling that she is right there in the kitchen with you, chopping up vegetables and rinsing lentils.Chelsie CraigIn 2007 she was awarded the Padma Shri, one of the highest honors given to a civilian in India, for her contributions to cooking. Sanjay remembers the night his mother was nominated for the award. They were at an event, and “some lady came up to her and said, ‘My husband loves your food, we love your food!’” That woman turned out to be Gursharan Kaur, the wife of then Indian prime minister Manmohan Singh.When Dalal passed away from a heart attack in 2013, “people said they felt like their mother had passed away,” Sanjay says. Still, most Indian cooks who grew up in ’70s through the ’90s have a standby Tarla Dalal book or recipe.“The first dosa I ever made in my life was from Idlis & Dosas,” says Meherwan Irani, chef and co-owner of Chai Pani in Atlanta and Asheville. She “was what we called ‘solid yaar’. The closest we had to The Joy of Cooking. Just classic you-can’t-screw-it-up recipes, and often when me or any of my team needed a straightforward guaranteed-to-work recipe, Tarla was our first go-to.”Other Indian cooks, like Madhur Jaffrey, Julie Sahni, and Vikas Khanna, are famous for making Indian food accessible to a Western audience. They moved to the United States and became ambassadors abroad but weren’t as well known back home.Dalal, however, will be remembered for bringing the rest of the world to India. Her audience wasn’t Americans who’d just discovered curry powder and yoga during the hippie era. It was the home cook in Bombay who literally lived next door to her; the people who couldn’t afford to travel or buy luxury Italian ingredients but wanted to expand their culinary horizons all the same.But perhaps her most important reader was, and remains, the people who no longer live in India. Those, like my mother, who had immigrated to another country and longed for dishes redolent with spices that they could make in their new, unfamiliar surroundings.My mom’s cookbook collection has expanded significantly since she first purchased The Pleasures of Vegetarian Cooking. She’s got a whole shelf of books that she keeps in the kitchen, but she still keeps her Tarla Dalal books separate from the others. Probably because Dalal’s works provide her with the deepest sense of comfort. When she was in her 20s, newly married, and with no one to teach her how to take care of herself—Dalal was there. And she still is.Related: Inside Patel Brothers, the Most Beloved Indian Grocery Store in AmericaExplore Bon AppétitCookbooksIndianPeopleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Priya Krishna"]}