{"id": "3ea1bde68bc732d47b5e0697202d3ac4", "url": "https://www.bonappetit.com/recipe/use-it-up-frittata", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Use-It-Up Frittata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueUse-It-Up FrittataBy Claire SaffitzJanuary 11, 20184.7(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, styling by Molly BazEmailPinterestPrintEmailPinterestPrintKitchen economy: Use any leftover cooked vegetables, grains, or herbs in your fridge for this frittata, then use any leftover frittata for a sandwich the next day.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonLarge Nonstick Skillet$50 At AmazonPlate$55 At Bon Appétit MarketIngredients4 servings6large eggs6ounces leftover roasted vegetables, cut into ½-inch pieces (about 1½ cups)½cup leftover cooked grains1ounce coarsely grated or crumbled cheese1tablespoon finely chopped tender herbs, such as thyme, basil, and/or chivesKosher saltFreshly ground black pepper2tablespoons extra-virgin olive oil, dividedPreparationStep 1Vigorously whisk 6 eggs in a medium bowl until streak-free.→  Here's how to buy the best eggs possible.Step 2Add 5 oz. vegetables, ½ cup grains, 1 oz. grated cheese, and 1 Tbsp. herbs; season with salt and pepper. Mix with a rubber spatula to combine.Step 3Heat 1 Tbsp. oil in a medium nonstick skillet over medium; swirl skillet to coat with oil.Step 4Add egg mixture and cook until edges are set, about 30 seconds.Step 5Using spatula, agitate eggs by scraping bottom of skillet in a small circular motion and bringing edges toward center of pan to form large curds, then let mixture sit undisturbed until edges are set again, about 1 minute.Step 6Reduce heat to low and continue to cook, tilting skillet and lifting edges up with spatula to allow uncooked egg to flow underneath and around sides, until surface is wet but center is mostly set when you shake the pan, about 5 minutes.Step 7Shake skillet to loosen frittata. Place a large plate over skillet and invert frittata onto plate.Step 8Heat remaining 1 Tbsp. oil in skillet over medium, swirling to coat. Slide frittata back into skillet; reduce heat to low. Cook until set all the way through, about 3 minutes.Step 9Let frittata cool in skillet 5 minutes, then invert onto a cutting board.Step 10Season frittata with salt and pepper. Cut into wedges to serve.Step 11Do Ahead: Frittata can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.How would you rate Use-It-Up Frittata?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI followed the recipe to the letter (except I sauteed fresh veg - mushroom, onion and baby marrow) and it was perfect. Flipping it over creates lovely layers. I didn't get as much colour as the pictures but it wasn't over or under done. Will definitely be making on a regular basis!KayeCape Town, South Africa9/15/2021this recipe is much like the tortilla a la Espanola.  We do not bake it but use the inversion  trick,.\nJust fine.  However you must cover this while it cooks.   Also, show the veggies, and the cheese.  \nAnother way to cook while in the wilds.....SelSFC7/7/2021Sorry Claire - if your frittata is brown you’ve already failed cooking school.AnonymousSt.Louis3/7/2021Love this idea! My approach was a bit minimalist, I didn't use grains and just used a few added ingredients. I used 1 tomato, half a small shallot, and a few sprigs of sage I had leftover. I didn't bother with the flipping, just agitated the curds enough that it cooked through. I like my eggs on the softer side anyway.AnonymousColumbia, SC8/27/2019You don’t need to flip the frittata. I simply cook the veggies, add scrambled eggs with a few tbsp of cream, pour, and cover on low-med heat. Covering allows the eggs to cook through. It comes out perfectly in 10 minutes!AnonymousPhiladelphia, Pa7/9/2019This recipe doesn’t call for any milk or creme fraiche despite other BA guides vigorously talking about perfect ratios in your frittata... anyway, mine was a failure. Don’t add too many greens and don’t forget cream!AnonymousBrooklyn7/1/2018Love this waste-free recipe! Thanks for the tip. #newyearnowasteemily@imperfectproduce.comSan Francisco1/11/2018Explore Bon AppétitFrittataItalianEuropeanEggQuickEasyOne-Pot MealsWeeknight Meals5 Ingredients or FewerStarterNut-FreeVegetarianSautéBreakfastLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-07-18", "author": ["Condé Nast", "Claire Saffitz"]}