{"id": "3eb27c128ce837f51004ee60462d7ec2", "url": "https://www.bonappetit.com/story/spinach-artichoke-melts", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "These Spinach Artichoke Melts Are Where Dip Meets Grilled Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Spinach Artichoke Melts Are Where Dip Meets Grilled CheeseDeb Perelman piles vegetables under a blanket of cheese for a kid- and parent-approved dinner.By Deb PerelmanApril 3, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Alison AttenboroughFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.When my first kid was born, I lived in fear of him being one of those toddlers who eats only boxed macaroni and cheese and chicken nuggets. I got it in my head that if I never served these foods, this would not happen. I am here to tell you this backfired spectacularly. In not wanting to get sucked into a tater-tot-and-PB&J vortex, I inadvertently ended up depriving myself of, well, all my favorite childhood foods, which I still enjoy in periodic doses. I tried to fix this by introducing him and his younger sister to cheese-sauced elbows and crispy bite-size chicken, which were soundly rejected. What kind of children have to be talked into eating chicken tenders?Meanwhile, the “kid food” they love and request the most often—grilled cheese sandwiches—just happens to be the one I consider the least interesting: completely bland, with waxy insides and greasy outsides. So in our usual push-pull of family meals (me trying to nudge them to try new things that aren’t so scary-new that they flee the table in protest), I started creating open-face vegetable melts: toasts piled high with chopped cooked vegetables, topped with cheese, and broiled until bubbly. I’ve made these with garlicky broccoli and Parm and sautéed mushrooms with béchamel, but this spinach-artichoke-dip-inspired version is the only one we were still talking about a week later. They get their cheesy bread fix, while I can rest assured they eat some vegetables—all in a grilled cheese sandwich I actually like.Get the recipe:Spinach and Artichoke MeltsYour favorite creamy dip—but in a form you (and your kids) can happily eat for dinner.View RecipeExplore Bon AppétitWeeknightCooking For KidsArtichokePicky Eaters’ ClubRead MorecookingThis Garlic Bread Is the Secret to Converting Bean HatersBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-03", "author": ["Condé Nast", "Deb Perelman"]}