{"id": "3eb97e16a249df8d010d7b1a31726311", "url": "https://www.bonappetit.com/recipe/spiced-snapper-with-mango-and-red-onion-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Snapper with Mango and Red Onion Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Spiced Snapper with Mango and Red Onion SaladBy Andy BaraghaniMay 22, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintGrilling a whole fish doesn’t have to be daunting, especially if you use this turning method to minimize the risk of tearing the skin. Lay the fish horizontally across the grill grate with the top fins toward you and cook. When it’s time to turn, wedge two metal spatulas under the fish—one near the tail and the other at the head—then quickly and confidently roll it away from you onto its other side in one fluid motion.Ingredients4 servings15-lb. or two 2½-lb. head-on whole fish (such as red snapper or black sea bass), cleanedKosher salt⅓cup chaat masala, vadouvan, or tandoori spice⅓cup vegetable oil, plus more for grill1ripe but firm mango, peeled, cut into irregular 1½\" pieces1small red onion, thinly sliced, rinsed1bunch cilantro, coarsely chopped (leaves and stems)3Tbsp. fresh lime juiceExtra-virgin olive oil (for drizzling)Lime wedges (for serving)PreparationStep 1Place fish on a cutting board and pat dry thoroughly with paper towels. With a sharp knife, make slashes crosswise on a diagonal along the body every 2\" on both sides, cutting all the way down to the bones. Season fish generously inside and out with salt. Coat fish with spice mix, packing on more if needed (it should cover the entire fish, head to tail). Let sit at room temperature 20 minutes.Step 2Meanwhile, prepare a grill for medium-high heat. Clean and oil grate.Step 3Drizzle both sides of fish with remaining ⅓ cup vegetable oil to coat. Grill fish undisturbed, 10 minutes. Lift up slightly from one edge to see if skin is puffed and lightly charred and easily releases from grate. If not quite ready, leave alone for another minute or so and try again. Once it is ready, gently slide 2 large metal spatulas underneath and turn over.Illustration by Joe WilsonStep 4Grill fish until the other side is lightly charred and skin is puffed, 8–12 minutes, depending on the size of the fish. Transfer to a platter.Step 5Toss mango, onion, cilantro, lime juice, and a big pinch of salt in a medium bowl. Drizzle with a bit of olive oil and toss again to coat. Scatter mango salad over fish and serve with lime wedges for squeezing over.How would you rate Grilled Spiced Snapper with Mango and Red Onion Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSnapperFishSeafoodMangoStone FruitFruitRed OnionOnionVegetableBassEasyWeeknight MealsMainGluten-FreeDairy-FreeNut-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}