{"id": "3eba43e41734acd9a56dea168d7d6a91", "url": "https://www.bonappetit.com/story/chiquilin-smoked-paprika", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "This Smoked Paprika Brings Out Flavors I Didn’t Know Existed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Smoked Paprika Brings Out Flavors I Didn’t Know ExistedSpice your chicken to the heavens with this deep red Spanish seasoning.By Jeremy GlassMay 23, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailI’m a huge believer in the secret ingredient. You know, the glaze based on a 200-year-old family recipe or the frosting that makes eating cupcakes a religious experience. My little secret comes in the form of a 2.64-ounce tin of smoked paprika. It’s made by a brand called Chiquilin, and there is no piece of food I won’t cover in this stuff. Scrambled eggs, chicken thighs, seafood stew… heck, I even pinched a dusting of this stuff on my chocolate ice cream to see if it would fly and baby it took off at a thousand miles-per-hour. It is, as the kids say, next-level.This particular variety of paprika originally comes from Spain and is part of Luis Penalva, SL, a family business that has specialized in herbs and seasonings since 1909. What separates it from the basic paprika you’d find in a run-of-the-mill grocery store is the method by which it’s prepared. The peppers are dried over a fire containing oak, allowing a deeply smoky flavor to come through without any preservatives or unnatural flavors.I’ve always been a proponent for heavy paprika use and this innocuous little tin has helped me convert non-believers into paprika evangelists. It’s bold without being overpowering and memorable without leaving a lasting taste in your mouth. When you bite into a piece of chicken spiced to the heavens with the deep red seasoning, you see your meal in a totally different light. Flavors you didn’t know existed come out to party. It’s the smokiness that really gets me though, making it a barbecue must-have.My shining achievement with Chiquilin happened just the other night when I made chicken marsala. Most recipes have you dredging your chicken in flour with a little bit of salt and pepper. I loaded my flour with two tablespoons of this paprika and dredged my chicken until it looked like an abandoned car after a blizzard. After frying up the meat and making the sauce, I began to worry about the smoky taste overpowering the sweetness of the marsala flavor. I was wrong. Dead wrong. What followed was one of the most delicious meals I have ever made in my life. I’m not one for hyperboles, but this meal almost put me in a coma. And to think, I only bought this paprika because I like the way the tin looks.Forget everything you ever knew about spices and toss out your mild paprika in lieu of Chiquilin, or I will personally come to your house and raid your spice cabinet. My one constructive criticism is that the tin is hard to open, but I don’t have any fingernails, so that may be why.Buy it: Chiquilin Smoked Paprika, $6 on AmazonSpeaking of chicken, here’s a recipe that works every time:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitShoppingPaprikaSmoked PaprikaRead MorecultureThe Indian Spice Mix I Put on Almond Butter Toast, and Everything Else HonestlyBy Priya KrishnacultureThese Jarred Sour Cherries Should Live In Your PantryBy Emma WartzmancookingThis Is the Best Jarred Pasta Sauce There Ever WasBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Jeremy Glass"]}