{"id": "3ebefab988376a87e7c3d9c2491690e9", "url": "https://www.bonappetit.com/recipe/vegetarian-reuben", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Vegetarian Reuben Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKale ReubenBy Chris MoroccoMarch 19, 20194.6(42)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea KyleEmailPinterestPrintEmailPinterestPrintSkipping the corned beef in a cooked greens-packed Reuben shouldn’t feel (or taste) like a bummer. Happy to say this one doesn’t.IngredientsMakes 22Tbsp. extra-virgin olive oil4garlic cloves2bunches Tuscan kale, center ribs and stems removed, leaves coarsely torn1cup sauerkraut, drained¼cup whole-milk Greek yogurt1tsp. hot sauceKosher salt4slices rye or whole wheat bread2slices Swiss cheese (about 3 oz. total)¼cup finely grated Parmesan2Tbsp. unsalted butter, room temperature, dividedPreparationStep 1Heat oil in a medium saucepan over medium-low. Add garlic and cook, turning occasionally, until lightly browned, about 2 minutes. Add kale in handfuls, stirring often and letting each addition wilt before adding the next. Stir in ½ cup water. Increase heat to medium-high and bring to a simmer. Continue to cook, tossing occasionally, until kale is tender and pan is dry (add more water as needed if kale needs more time), about 5 minutes. Transfer kale to a medium bowl; discard garlic, if desired. Stir in sauerkraut, yogurt, and hot sauce; season with salt. Wipe out skillet.Step 2Divide kale mixture between 2 slices of bread. Top kale mixture with both cheeses. Close sandwiches with remaining bread, then spread 1 Tbsp. butter on top slices.Step 3Heat reserved skillet over medium-low. Add sandwiches buttered side down and press down gently with a pan lid. Butter top sides of sandwiches and cook, turning sandwiches once, until golden brown and crisp and cheese is melted, about 4 minutes per side. Transfer to a cutting board and cut in half before serving.How would you rate Kale Reuben?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleI've never actually had a \"real\" reuben before so take this review with a grain of salt...that said, I loved this sandwich! Definitely will try the real thing now, but will turn to this for a quick and (relatively) \"healthy\" lunch. Only change is I think I'd add a true Russian dressing next time. \nIt's also easily modified for different dietary preferences. I'm an omnivore partnered with a vegan so this dish was an easy and delicious middle-ground meal. Simply sub in vegan mayo, cheese, and butter for half the batch. \nLastly, I'm also not a big fan of kale, but really liked it in this dish. Perhaps you've made a (kale) convert out of me, Chris! SAArlington, VA7/7/2021This sandwich is amazing.  Thank you!  We are vegan, so I skipped the cheese and put a little marinated tofu on instead, and grilled the whole thing on olive bread.  So tasty, love bonappetit.com so much.Amy Elvis KiehlLos Angeles6/9/2021This sandwich far exceeded my expectations!  Not a big fan of kale here, but get it in my farm boxall the time! It is creamy and tangy and just the right texture! Definitely will make again and a again.StepanlOlympia, WA12/22/2020This is one of my go-to recipes now.  I make it about once a week just because it's so quick and easy and tasty!\nI like to make it with a mixture of mayo and greek yogurt.  Less healthy I guess, but gives it a better flavor imo (especially since I don't use a lot of cheese on mine).  \n\nIt's a really stellar recipe that I've recommended to a lot of my friends-- with the caveat that it's not really gonna hit the spot if you want an actual reuben.  I consider it entirely its own thing. AnonymousChicago10/6/2020Worked very well! I skipped the yogurt and put Thousand Island dressing on top after it came off the heat. (Could also put mustard if that's how you like your Reuben.) I also made one using butter and another with a thin layer of mayo (like I do with grilled cheese), and the mayo browned more evenly (no mayo taste - try it!) than the butter version.Dan from CT8/15/2020This is so yummy! It kind of feels like a fancy, veg-forward grilled cheese? But sauerkraut is a total comfort food for me and it's SO GOOD with the Greek yogurt, hot sauce, and kale. It isn't that fancy, but it sure is delish.\n\nDropping 1 star because (1) I wouldn't really call it a reuben, and (2) we were MORE THAN FINE with only one bunch of kale.mrs.vinegarChesterton, Indiana6/18/2020This sandwich is easy and very tasty. I don't eat reubens so I won't involve myself in that discourse, but this is a flavorful and filling melty treat.Anonymous5/29/2020Good! I echo the other reviewer: This isn't reminiscent of a reuben, but is a good sandwich on its own merits.AnonymousCalifornia5/25/2020A really good sandwich! Although it didn't really scream \"rueben\" to me while I was eating it, and it's more good despite the kale, rather than because of it. It felt like a delicious fancy grilled cheese with some greens added to downgrade the cheese/hot sauce/more cheese guilt factor. I'd eat it again, but it's not the first recipe I'd reach for. Anonymous4/3/2020This sandwich is great. I didn't miss the meat at all. My housemate added a fried egg which I will surely do next time around. I don't know how big the bunches in the recipe calls for, however, I found 1 bunch to be sufficient (it was a large bunch). I also used smaller bread however still had an excess of filling (though I will happily use it tomorrow for another sando.  Super quick and easy to make with impressive flavors. BingoBronson8/28/2019Love this sandwich concept! Admittedly, I am not a sauerkraut fan and ended up using more of a soy sauce, garlic, sriracha approach (plus some pre-roasted mushrooms). So no, I didn’t make this exact recipe, but it just goes to show that this is a very riff-able sandwich that is so easy to throw together in just a few minutes! AnonymousBoston, MA7/30/2019Delicious!! Came together very easily, works well as a weeknight dinner. Thanks Chris! Abigail Knight6/12/2019For another reuben variation check www.connoisseurusveg (dot) com/vegan-seitan-and-mushroom-reubensAnonymousNYC6/11/2019This sandwich looked so good in the picture, I just couldn't wait.  I didn't have any yogurt on hand so I substituted mayo.  It was incredible!  Super easy to make and to be honest, I didn't miss the pastrami one bit.  I will definitely make this again.   AnonymousNorman, OK4/11/2019I LOVE this sandwich! Made it multiple times and keep coming back to it as I daydream about dinner. In fact, I'm going to go make it right now. So tangy, so yummy. Thanks, Chris!aniborfyIreland4/10/2019Explore Bon AppétitSandwichKaleLeafy GreensVegetableSwiss CheeseCheeseNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Chris Morocco"]}