{"id": "3ec4c76a8718b8c799d31154bec7ad21", "url": "https://www.bonappetit.com/story/elise-mcmahon", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Elise McMahon Is the Designer Making Restaurants Way More Fun | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBask in the Psychedelic Glory of Restaurant Designer Elise McMahonIf McMahon designed it, we want to move in.By Elyse InamineJanuary 17, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.Trendy interior designers seem to have the same checklist: Mid-century modern furniture? Check. Tropical wallpaper? Check. Rose gold accents everywhere? Check.Not Elise McMahon, the brains behind LikeMindedObjects, a furniture and design studio based in Hudson, New York. She’s got decidedly different priorities A pink-highlighted, hexagon-ish-shaped table that bends the rules of geometry? Check. It anchors Relationships, a breezy cafe in New York City. Hanging fixtures that project kaleidoscopic light from floor to ceiling? Check. You bask in that psychedelic glory at the newly redesigned Lil’ Deb’s Oasis in Hudson, New York, which she just recently finished up. “It feels more like an installation than a basic eating space,” McMahon explains to me over the phone. “The chefs were up for a wild design, so of course I love to be as wild as a client will allow.”Untethered creativity has been a constant in McMahon’s life. Growing up in the suburbs of Chicago, she lived in a house filled with hexagonal rooms designed by architect Edward Humrich. Her artist parents worked from home—sculpting, metalworking—so she had a front-row seat for the life ahead of her. “It was a very experimental household,” McMahon says. “Their work put the small-business mentality in me, and now I’m following that same lifestyle.”Eventually, she went on to study furniture at the Rhode Island School of Design in Providence, Rhode Island, where she met Hannah Black, one of the chefs at Lil’ Deb’s Oasis and at that time a painting student. At school, Black threw elaborate, epic dinner parties and commissioned McMahon to set the scene, with floral arrangements, lighting, and furniture.“Food is such a equalizer of enjoyment,” McMahon reminisces. “I love making beautiful, fun furniture because it enhances the experience.”After graduating from school—and brief stints teaching furniture classes, carving pumpkins, and designing small-scale farming equipment—she reconnected with Black when she moved to Hudson. Soon they were back to throwing experimental dinner parties—but this time at Lil’ Deb’s Oasis, Black’s kitschy, vibrant restaurant with co-chef Carla Perez-Gallardo. Since opening in 2016, it’s garnered a cult following—not just as a gathering place for Hudson’s queer community or the bright, tropical-y comfort food but for the funky, fun atmosphere McMahon has helped conjure in the space. Now, with the recent renovation of Lil’ Deb’s Oasis, she’s channeled more of an '80s ski lodge for the brand-new upstairs lounge filled with furniture she’s designed as well as local artisans she wants to support.“I know that furniture isn’t exactly solving world issues, but being a small business that can create spaces I support in a social way is a noble pursuit for me,” McMahon says. “By making these interiors, I feel like I can actually directly affect my community.”Wondering what comes after millennial pink? McMahon has a few ideas.Explore Bon AppétitHealthyishNew YorkDesignThe Healthyish 22TrendsRead MorerestaurantsThis Restaurant Is Basically an Art Installation with Knockout FoodBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Elyse Inamine"]}