{"id": "3ec46f5e0b396cc280022ee5a97521c6", "url": "https://www.bonappetit.com/story/vanlife", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Van Life Culture Is Changing  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhatever Happened to #Vanlife? Well, Things Are ChangingMeet the women driving the social media movement into a more inclusive future.By Allison GibsonJune 20, 2019FacebookTwitterEmailPhoto by Peter and Shruthi LappFacebookTwitterEmailWhen our Instagram feeds first became filled with vintage Westfalias and souped-up Sprinters around seven years ago, the earliest #vanlife posts showcased a certain demographic, mostly white men who grew massive followings at the start of the social media movement. They were photographers and surfers, often who’d left comfortable corporate jobs to practice one (or both) of those pursuits on the road. As the influencer economy picked up speed, images became more polished and captions more aspirational, although light on the details of what made such a beautiful life possible.Now, the hashtag has over 5 million contributors, including a growing number of women with experiences as diverse as their rigs, candidly documenting the way they camp, cook, and manage self-care. They’re proving that a life of tiny living and big adventure isn’t limited to digital nomads, the independently wealthy, or paid influencers—and they’re driving vanlife culture toward a more inclusive future.Laura Hughes has been traveling by van full or part-time since 2014, now in a Sprinter she converted herself. “It was a very male-dominated environment,” Hughes says of her early days traveling with her former partner before hitting the road on her own. “There was such limited representation online for women doing road travel, let alone doing it solo, or as a woman of color, or a woman with a different level of ability.” In response, she began to build a vibrant community through her Women On The Road podcast, Instagram feed, and Facebook group, where women discuss everything from safe solo travel to van repair.One guest featured on the Women On The Road podcast is Bionca Smith. Two years ago, feeling crushed by debt and exhausted by a corporate sales career, Smith sold her belongings and left her job and expensive San Francisco apartment to travel abroad with her 10-year-old son. They eventually returned stateside and continued their roving lifestyle in a 1989 Ford Econoline. In her Off The Grid With A Kid Instagram account and thriving YouTube channel, Smith documents building her own motivational speaking business, facilitating her son’s satellite education, planning an anti-bullying non-profit, and cooking healthier than she’d previously had time or energy for.“Our journey is really transparent: I’m not a wealthy person,” says Smith. “We’ve had to sell items in the van to put gas in it.” She’s also faced occasional criticism by those who don’t approve of her lifestyle change. “You’re a single mom, you can’t travel,” “You shouldn’t be on the road, that’s what white people do,” she’s heard them say. But her joy is steadfast and infectious. “Women of color started reaching out to me and saying, ‘You’ve inspired me’,” she says. “Because I see you doing it, I know that I can do it too.”But inspiration and aspiration can also cloud reality on social media. “People who over-glorify vanlife create an unrealistic expectation for the average person,” says 20-year-old Jennelle Long, who’s lived for two years in her baby blue 1995 GMC Vandura Explorer with her ball python named Alfredo, sharing it all on Instagram. She found her van on Craigslist and built out the interior while sleeping on a yoga mat to save money from her full-time job.Instagram contentThis content can also be viewed on the site it originates from.Long still works two days a week at a sporting goods store in Silicon Valley, and sells thrifted vintage clothes as a side hustle on the road, but she spends most of her time cruising around California with her snake in search of good food and direct sunlight for her rooftop solar panel. She’s upfront with her followers about the less glamorous parts of van life, like surviving off peanut butter sandwiches and peeing into a sparkly pink Nalgene bottle while street camping. “All I want to do is take a bubble bath in a nice heated home,” she told her followers when she was sick earlier this year. Below a photo of herself last winter wearing rollerblades on the Venice Beach boardwalk, she wrote “I’m broke af and have no idea what I’m doing with my life, but I’ve never been happier and wouldn’t change a thing.”While the financial realities of van living can be challenging, well-followed Instagram accounts often find supplemental income through brand partnerships. More of those influencers encompass a wider range of experiences, including more women and women of color, who spark engagement through their unfiltered honesty, and yes, dreamy aesthetics.Shruthi Lapp, who is currently traveling with her husband Peter in their ‘87 Volkswagen Westfalia, recently began working with Hydro Flask. Each month, she sends the company a handful of what she calls “natural” images of their products in use and posts one photo and story on her own Instagram feed. A longer-standing partnership with parts-supplier GoWesty provides the couple with discounted parts and mechanical support in exchange for photos of the van in action to be used in the company’s promotional materials.Instagram contentThis content can also be viewed on the site it originates from.Initially, Lapp was skeptical about entering into brand ambassadorships because of what she has seen as a surplus over the past few years of staged, sponsored photos that promote an out-of-touch illusion of van living. Lapp’s own feed features images enviable as those of any legacy travel publication. Their recent two-year-long trip across South America was full of dreamy pastel shots of camping in the Chilean desert. Now, as they drive through the American West, we see the sunrise-painted dunes of White Sands and mate breaks on grassy plains. But Lapp is careful to share less glamorous moments too, like digging the van out of mud and nights when dinner is a bowl of popcorn.Ultimately, her mission is to prove that there’s no one right way to pursue #vanlife. “It’s not really about how our van looks, it’s just where it takes us,” she says.Explore Bon AppétitHealthyishTravelTrendsRead MorecultureThe L.A. Skater Sisters Who Take Their Ashwagandha With a Side of BaconBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-20", "author": ["Condé Nast", "Allison Gibson"]}