{"id": "3ec8f03f064275402513d1cf3914a61d", "url": "https://www.bonappetit.com/story/salsa-formula", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "How to Make Salsa Out of Anything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MoreTaco NationHow to Make Salsa Out of AnythingStrawberries? Tarragon? Rick Martinez shows us the way.By Rick MartinezFebruary 13, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailNo taco is complete without a stop at the salsa bar, and we’re always down with the classics: mild-yet-smoky salsa molcajeteada, deceptively spicy jalapeño verde. But why stop there? You can make a salsa out of just about anything—as long as you get the ratios right. Use this handy formula to select by the seasons, the flavors, or just whatever you have hanging out in the back of your fridge. The possibilities are infinite.1. Pick a fruit, veg, or bothStart with 3 cups of your favorite fresh produce, or mix a few together.TomatoTomatilloStone fruitTropical fruitMelonCucumberJicamaBerries2. Choose your heatAdd 1 of the following chiles—fresh or dried work fine.JalapeñoSerranoHabaneroChipotleÁrbolCascabelFresnoThai3. Throw in some herbsOne handful should do it; just make sure they’re nice and fresh.CilantroMintParsleyTarragonBasil4. Add the non-negotiablesThese ingredients always have your back.1 cup chopped onion1 chopped garlic clove1 Tbsp. lime juice1 tsp. kosher salt5. How much time you got?10 minutes: Throw all your items into a blender.20 minutes: Chop everything into cute little cubes for a pico de gallo vibe.30 minutes: Char everything but the herbs on a grill or broiler to maximize smoky flavors, then toss it all in the blender.Get more salsa recipes...1 / 25ChevronChevronSalvadoran Salsa RojaView RecipeWant More Stories From Taco Nation? Right This Way...It’s Time We Give the Mexican Combo Platter the Credit It DeservesWhy Are H-E-B’s Flour Tortillas So Dang Good?There’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywaySandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsWhy Korean Tacos Are Margaret Cho’s American DreamAnd so much more!Explore Bon AppétitTaco NationSalsaMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Rick Martinez"]}