{"id": "3ec8f4447f58738c2bcb5a8d9277010c", "url": "https://www.bonappetit.com/story/desi-omelette", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "How to Make a Desi Omelette, Also Called Masala Omelette | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Don't Love the Desi Omelette, Tell It to My MotherI've taken her template for these eggs with me no matter where I've lived.By Shayma Owaise SaadatAugust 28, 2020FacebookTwitterEmailPhoto and Food Styling by Shayma Saadat FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.On nights when my mother was too tired to cook, Ami would make a desi omelette in just a few minutes, and we would eat it with crisped-up Sahara pita bread, which she always kept in the freezer. This one-layer unfolded omelette with crispy, bronzed edges and a soft middle is a typical homestyle dish. A spicy, salty mixture of egg, onion, tomato, cilantro, green chile, and turmeric, it’s made across the Indian subcontinent and also called a masala omelette depending on where you are. While the ingredients vary across homes and kitchens, my Lahore-born mother’s recipe is the template I know, love, and have followed no matter where in the world I’ve lived.Before moving to Toronto in 2009, I lived and worked in Rome for several years, where cilantro was not so easy to source (this was 2003). My coworkers at the UN often invited me to join them on weekend trips to the market at Piazza Vittorio, where I could get the ingredients that a Pakistani-Afghan-Persian like me was looking for: lentils, basmati rice, cumin, cardamom, and more. Over the years I discovered a stall owned by three Bangladeshi-Italian brothers, who kept bunches of cilantro, as well as tiny fiery green chiles, hidden behind the stall for special customers (I became a regular). I initially spent many Sunday evenings alone in my apartment overlooking the bitter orange trees in Aventino. Making my Ami’s desi omelette with my market ingredients was a small way of re-creating home in a new kitchen and country. I scooped up the omelette with my hands, using morsels of pizza bianca in the absence of pita bread.To make a desi omelette that serves two, start by gently smashing ½ tsp. cumin seeds with a mortar and pestle (if you don’t have one, don’t worry—you can use a flat object, such as the bottom of a heavy pot, to crush the seeds on a cutting board). Transfer seeds to a medium mixing bowl. To the bowl, add ½ tsp. ground turmeric and ¾ tsp. salt. Next, finely chop ½ small white onion and 1 plum tomato and add to the bowl. Take ½ bunch cilantro and roughly chop (use the leaves as well as the sweet stems). Throw that into the bowl too, setting aside a few sprigs for adorning your omelette in the end. Take 1 Thai green chile and, using your kitchen shears, finely chop all of it directly into the bowl (if you like less heat, devein and seed the chile first). You can also use ½ jalapeño or serrano if you can’t find Thai chiles. Give all the ingredients in the bowl a good mix. Crack in 4 eggs and whisk well.Place a small skillet or nonstick frying pan, preferably 8\", over medium-high heat, and add 1 Tbsp. neutral oil (I like to use grapeseed). Give it a swirl so it coats the entire surface of the pan. When the oil is shimmering, pour in half of the egg mixture, ensuring it is evenly distributed in the pan. Lower the heat to medium. After a few minutes you’ll see the edges start to bubble and crisp up—that’s when you know it’s coming along nicely. Lift up the edges of the omelette, allowing any runny egg to spread underneath. Once it is brown around the edges and appears to have set, you have two options: Carefully flip with a spatula and allow it to cook on the other side for 2–3 more minutes; or, if you’re like me, flash it under your broiler, while keeping a vigilant eye on it, for 2–3 minutes.Repeat the process with the second half of the mixture. Place desi omelette on plates. Roughly chop reserved sprigs of cilantro and sprinkle on top. Enjoy morsels of it, eaten by hand, with a paratha, or white buttered toast with a slick of Maggi Chili Garlic Sauce on the side. When I am home in Lahore, I like to fold it up and enjoy it between two slices of soft white bread, with a slather of Shezan ketchup.A desi omelette makes a great breakfast, but it’s also perfect for any meal when you need some nourishment. For those of you who don’t like the idea of breakfast for dinner, try this just once. And if you don’t love it, you can talk to my mother.Shayma Owaise Saadat is a Toronto-based writer whose work focuses on food, culture, and identity. She is also a food stylist, photographer, and recipe developer.Explore Bon AppétitIt's That SimpleTurmericOmeletEggChileRead MorecookingI'll Take a “Chaat Treatment” Over a “Spa Treatment” Any DayBy Priya KrishnacookingI’ve Been Making Roti Jala Since I Was 10. You Can TooBy Mehreen KarimcookingIf It's Not Spicy Enough to Make You Sweat, It's Not ChowBy Lesley EnstoncookingSteamed Eggs Might Be For Actual Babies But I'll Never Stop Making Them For MyselfBy Cathy ErwayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-28", "author": ["Condé Nast", "Shayma Owaise Saadat"]}