{"id": "3ecd5638613a0c1b1c47365281a349d7", "url": "https://www.bonappetit.com/story/smashed-green-beans", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Raw Green Beans Are the Best Green Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRaw Green Beans Are the Best Green BeansIf you're as tired of limp, oily green beans as much as I am, then you'll love this no-cook technique. Raw green beans, FTW.By Molly BazMay 29, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI have officially had enough of limp, overcooked, under-seasoned green beans. You know the type—the one’s your aunt brings to Thanksgiving covered in un-toasted slivered almonds in an attempt to make them slightly more intriguing. And while I am well aware that they don't have to be overcooked—they can be quickly charred to great effect, or blanched delicately so that they're still bright and crunchy—I'm kind of in recovery mode at the moment, and think I'm going to pass on cooking them altogether for a while.Enter bag-smashed raw green beans—your newest, truest party trick. Green beans are naturally fairly tough, fibrous, and stringy, which is why they're usually dunked in a pot of boiling water or heated in a pan with fat to take some of that edge off. But with this new-fangled technique, you can enjoy them without any cooking—and the only piece of equipment you’ll need is a resealable plastic bag and something heavy to whack them with (a wine bottle, rolling pin, or heavy jar will do the trick). Here's how it goes down.First, trim off the stem-y bits from the ends of the green beans. This is kind of annoying, but non-negotiable—those tops, the parts that connected the green beans to the plant, are tough and woody and not nice to eat. Throw all of your trimmed green beans into a sturdy, resealable plastic bag, squeeze most (but not all!) of the air out, and seal it. Now comes the fun part: smashing the HELL out of them with the tool of your choice so that they burst open at the seams but remain somewhat intact. This is a great way to get out some pent-up aggression, so really GO. FOR. IT.That felt good, right? Now, open the bag up, spoon in either a couple tablespoons of salad dressing—a shallot-y, mustardy vinaigrette sounds about right—or simply hit them with a splash of lemon juice or vinegar and a good drizz of olive oil. Reseal the bag and work the green beans with your hands until they looks glossy and married with the dressing. Taste, season with salt if you need—and you definitely will if you went the oil and vinegar route—and work a bit more until they're crunchy-tender and super deliciously seasoned.EAT. AND. REPEAT. ALL. SUMMER. LONG.It’s as simple as that. Whacking and marinating the raw green beans eliminates the need to cook them by breaking down any tough fibers inside, exposing their flesh which can then act as a sponge for salt and dressing. What you are left with is a perfectly seasoned, pleasantly crunchy bag of beans that’s just delightful as-is and even better when added to this big beautiful Spring Chicken Salad. So, welcome to the club. And best of luck to you—you’ve got six months to convince that aunt to let you do the green beans this year.About that salad:Spring Chicken Salad with Smashed Green BeansProperly-poached chicken breast is truly a thing of beauty—juicy, tender, and a blank canvas for big flavors.View RecipeExplore Bon AppétitBasicallyGreen BeantechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Molly Baz"]}