{"id": "3eda41a2cfe5945cfba427f199047780", "url": "https://www.bonappetit.com/story/ramadan-iftar-nostalgia", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Everything About Ramadan Is Different This Year, But We Need It More Than Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEverything About Ramadan Is Different This Year, But We Need It More Than EverBreaking fast alone is hard, but I’m finding solace in nostalgia.By Fariha RóisínApril 24, 2020FacebookTwitterEmailPhoto by FiordalisoFacebookTwitterEmailIn Islam, emphasis is placed on showing up for your brethren: We come together in communion, but more generally, we come together to share food. For me, the experience of growing up Muslim has made me crave community, especially when it’s time to break bread. I long for chicken roasts with friends on Sundays, or seeing multiple forks digging into a giant bowl of homemade anchovy pasta. Whatever the meal, I want to eat it together.Ramadan—a fast that lasts 30 days, from dawn-to-dusk, and that begins today—is a hardship eased by moments shared with others. Whether it’s praying shoulder-to-shoulder at the mosque or taking the first bite of iftar with loved ones after the sun has set, there’s a sense of fortifying togetherness; a reprieve that’s rooted in tangible connection.This year, however, the worldwide rampage of Covid-19 is erasing that gift of togetherness. Like me, many may be quarantined at home, and fasting alone. It is likely to be the strangest Ramadan I have experienced in all my 30 years. Knowing I wouldn’t get to be with my chosen family of queer Muslims, with whom I’ve spent the last few Ramadans in New York, or listen to the Eid khutbah in a crowd in Washington Square Park, has left me feeling a deep, heavy sadness. But, also, nostalgia for the iftars of the past—the things my parents prepared, the way they tasted, and the transcendent joy that comes from eating after a day fasting as a child.Growing up in Sydney, Australia, I was taught that this month was meant to be a reminder of all we take for granted. It was a time to take stock of our fortunes, even the small ones. My parent’s approach to choosing how we broke fast was almost ascetic: The foods we put into our bodies had to be special and aspirational, but simple.It always started with a date, so sticky it was almost like caramel. Chewy, like stretched-out toffee, the fruit eventually gives way to a hard-as-granite seed, which, if maneuvered right, would fall out of my mouth with a soft plop, and into the palm of my hand. The whole ordeal was a brief, sacred rite. During this holy month, a date becomes a metaphor for life: for its richness but also its tenacity. Just one can restore you after an entire day of fasting. It is nothing short of a miracle.The date bears immense significance in the Muslim world. It’s known as sunnah—words and teachings of The Prophet Mohammed. According to him, the Ajwa date—grown in the Madinah region of Saudi Arabia—are from paradise. Within the Quran, a date is mentioned more than 20 times. It bears the mark of the mystical, and is known as a Godly fortifier. It is said that the Prophet used to break fast during Ramadan with a date accompanied by a glass of milk.Perhaps my parents took this to heart. We always honored dates in our household. But instead of milk, we paired these nature-candies with two kinds of pulpy lemonade: either salty or sweetened with molasses. After a day of fasting, it was perfect—tangy, refreshing. I loved the blend of acidity and salt, the way it activated every gland on my tongue.A few times my family tried to substitute lemonade with the South Asian favorite, rooh afza. Made from “concentrated squash” it’s served with tons of crushed ice and milk and looks like slimy maraschino cherry syrup. It was just too sickly sweet for our liking. Lemonade it was.Then came the overnight kaali daal, served raw with copious amounts of fresh, bluntly chopped ginger, and salt. Alarmingly easy, nutritious, and satisfying, it was a salty elixir with a spicy zing.And that was iftar: dates, lemonade, and kaali daal. The holy trinity of breaking fast. The sweetness of the date, the fullness of the lemonade, the protein-packed crunch of the lentils. Savored and devoured. Simple but potent.Looking back, it’s moving how much I loved such seemingly mundane morsels. But, the thing is, after a whole day not eating, you’re able to appreciate just what a miracle food really is. Which is what Ramadan teaches you: gratitude for all we have, in spite of hardship. A worthy reminder during this very challenging time.God these days, for me, feels everywhere. In articulating my nostalgia, I invoke the spiritual and emotional closeness that will have to stand for physical proximity this year. And it brings me great solace. As we watch our world change, rapidly, collectively we grieve. Let us all take comfort in remembrance, and in the beauty of something so simple as a date.Explore Bon AppétitCoronavirusRamadanFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Fariha Róisín"]}