{"id": "3ee14375fc5567deda500243169a19ec", "url": "https://www.bonappetit.com/story/just-buy-it-microplane-grater", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "You Need a Microplane Grater If You Love Garlic Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Need a Microplane Grater If You Love Garlic BreadParm, citrus zest, and ginger lovers should also listen up.By Alyse WhitneyFebruary 7, 2018FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.For years, I had a four-sided box grater than I only used one side of. It was great at shredding cheese or potatoes, but anything smaller than that put me at risk of almost taking off part of my finger.Then I remembered that my beloved Ina Garten was always zesting her citrus and grating garlic with something smaller, flatter, and handheld: a microplane grater, the internet told me. So I went out and bought one, and I've had the same one for the better part of a decade. It's less sharp now, but it gets the job done to grate garlic into yogurt sauce, zest a lemon for vinaigrette, or make it rain Parmesan on top of pasta.Microplane Gourmet Series Fine Blade Grater$17 at AmazonThe magic of a microplane is that it turns anything into fine pieces that can disappear into a sauce, preventing you from biting into a huge piece of garlic or ginger in a dressing. (They also come in varying sizes to make larger ribbons or even finer pieces.) Whenever I get a random craving for garlic bread, I grate some garlic into softened butter and schmear it on toast. If I have parsley, great. If I have cheese, that can be microplaned too. If I have my act together, I can combine it all for garlic bread grilled cheese. But at the end of the day, I just want to get garlic distributed evenly through butter so it can melt and make bread toasty and comforting. If the only reason you buy a microplane is to make garlic bread, I support you.Microplaned garlic + butter + parsley on bread = garlic bread. Add cheese and you have GARLIC BREAD GRILLED CHEESE.\nPhoto by Josephine Schiele, styling by Ali NardiSince garlic is the No. 1 reason that I use my microplane, I had to learn how to clean it carefully. Make sure to only move the sponge in the opposite direction that you'd shred in—i.e. never bring the sponge down against the blades or it will shred into a million pieces! Be careful when using it and cleaning it so you don't slice your fingers, and always clean it immediately or stuff gets stuck in it. I like to let water pressure do most of the cleaning, then run a sponge one direction over it on the front and back to make sure it doesn't reek of garlic before I use it to shave chocolate on top of the tiramisu that I'm definitely making for Valentine's Day. For myself. You may not find love this year, but at least you found a microplane.Now, grate some garlic into yogurt sauce:Explore Bon AppétitParmesanGarlicZestCitrusGingerBasicallyShoppingBA RecommendsRead MorecookingWhat's the Point of the Other 3 Sides of Your Box Grater, Anyway?By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Alyse Whitney"]}