{"id": "3eec46d755b12022b408cf504887f8c8", "url": "https://www.bonappetit.com/recipe/sake-and-black-sugar-braised-pulled-pork-sliders", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Sake-and-Black-Sugar-Braised Pulled Pork Sliders Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSake-and-Black-Sugar-Braised Pulled Pork SlidersBy Jessie YuChenMarch 10, 20224.1(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano. Prop Styling by Maeve Sheridan EmailPinterestPrintEmailPinterestPrintThis rich, shreddable pork shoulder soaks up all the flavors of the braising liquid as it becomes tender, absorbing the mixture of sake, light soy sauce, ginger, hon-dashi and black sugar. You can pile the shredded meat on squishy buns along with quick-pickled daikon, as shown here, but it would also be great on any kind of bread or over rice.Black sugar gives this pork a robust, molasses-like sweetness that stands up to the savory flavors. It’s commonly used throughout East Asia (Okinawa is specifically known for its black sugar, or kokuto, production). It’s typically made by boiling sugarcane juice until it turns into a dark syrup; it’s then cooled and forms dark brown-black blocks of sugar. Unlike many brown sugars made from combining refined white sugar with molasses, black sugar preserves all the minerals, impurities, and natural molasses character inherent in the sugar. Its deep flavor is ideal for savory dishes like rafute (Okinawan braised pork belly) or Japanese curry. Black sugar is available at well-stocked Asian markets and online, but you can use dark brown sugar instead if you can’t find it. —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonBenriner Mandoline Slicer$80 At AmazonVegetable Peeler$10 At AmazonTongs$13 At AmazonMedium Skillet$60 At AmazonIngredients4–6 servings2Tbsp. vegetable oil3lb. boneless pork shoulder (Boston butt), patted dry13\" piece ginger, scrubbed, thinly sliced1cup dry sake¾cup light soy sauce (such as Kimlan)½cup (packed) plus 1 Tbsp. ground black sugar or dark brown sugar2tsp. hon-dashi (bonito stock powder)2red Thai chiles, thinly sliced1cup distilled white vinegar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more to taste½daikon (about 12 oz.), peeled, cut into 4\" pieces2Tbsp. (or more) unsalted butter4–6Hawaiian or other soft hamburger bunsCilantro leaves with tender stems (for serving)PreparationStep 1Place a rack in bottom third of oven; preheat to 300°. Heat 2 Tbsp. vegetable oil in a large Dutch oven or other heavy pot over medium. Cook 3 lb. boneless pork shoulder (Boston butt), patted dry, until golden brown on all sides, 5–8 minutes. Add one 3\" piece ginger, scrubbed, thinly sliced, 1 cup dry sake, ¾ cup light soy sauce, ½ cup (packed) ground black sugar or dark brown sugar, 2 tsp. hon-dashi (bonito stock powder), and 2 cups water and bring to a boil. Cover pot and transfer to oven. Braise, turning pork every hour, until meat is very tender and easily pulls apart, 3–4 hours.Step 2Mix 2 red Thai chiles, thinly sliced, 1 cup distilled white vinegar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and remaining 1 Tbsp. ground black sugar or dark brown sugar in a small bowl until sugar and salt are dissolved.Step 3Using a mandoline or vegetable peeler, slice ½ daikon (about 12 oz.), peeled, cut into 4\" pieces, into thin ribbons. Add to bowl with vinegar mixture and toss to coat (daikon should be submerged); set aside.Step 4Melt 1 Tbsp. unsalted butter in a medium skillet over medium heat. Working in batches and adding at least another 1 Tbsp. unsalted butter halfway through, toast 4–6 Hawaiian or other soft hamburger buns, cut sides down, until golden. Transfer to plates. Mound some pulled pork onto each bottom bun and top with drained pickled daikon and cilantro. Close up sliders.Do ahead: Pork can be braised and shredded and daikon can be pickled 1 week ahead. Transfer meat to an airtight container; cover and chill. Cover daikon and chill separately.How would you rate Sake-and-Black-Sugar-Braised Pulled Pork Sliders?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was fantastic and a huge family hit! I thought it was perfectly seasoned. I removed the pork from the braising liquid and shredded it on a plate. I also discarded the ginger after braising since I like the flavor the ginger provides, but don’t necessarily like to eat ginger. This takes a long time to make, but it’s pretty easy and totally worth it! I’ll definitely be making this again!StephanieCA3/22/2022Delicious! I did not find this salty in the slightest. I used dark brown sugar, and because I'm gluten free, used tamari. I only had a 1/4 cup light tamari, so I put in 1/2 a cup of regular tamari with that (for a total 3/4 cup of soy sauce), and it turned out great. \n\nI think it's worth noting that I took the pork out of the braising liquid, shredded it a separate bowl, and added a small amount of the braising liquid to the shredded pork (leaving behind the ginger) to season to taste at the end. This is not written out in the recipe, but I've made enough braised pulled pork dishes that I knew to do this. \n\nThis was great as a sandwich, but I'd also gladly eat this with rice, but may cut the pickles into smaller pieces if I did so. Highly recommended! The Morning Star3/21/2022This was pretty awful. I followed the recipe precisely, only substituting dark brown sugar.\nIt was far too salty. The large slices of ginger were off-putting in texture and dominated every bite. The hon dashi was lost in the mix as there was very little umami present.\n\nNot recommended.StevenMaryland3/18/2022Explore Bon AppétitDinnerMainSandwichPork ShoulderPorkMeatNut-FreeDairy-FreeBraiseSakeAlcohol & Other DrinksDaikonVegetableAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-10", "author": ["Condé Nast", "Jessie Yuchen"]}