{"id": "3f0f3d57240fe387b1818eb3cffb2a58", "url": "https://www.bonappetit.com/story/creamy-cream-free-soup", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Tahini is the Key to Creamy Cream-Free Soups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Key to Creamy Cream-Free Soup Is Hiding in Your PantryHow to get that creamy goodness without the dairy.By Mehreen KarimMarch 1, 2022FacebookTwitterEmailPhotographs by: Emma FishmanFacebookTwitterEmailI’ve never met a creamy soup I didn’t like. My stomach, on the other hand, isn’t always down for the glugs of dairy. It wasn’t until I was slurping a bowl of tantanmen, however, that I realized the answer to creamy soups that skip the cream lies in the nuts and seeds section of my pantry.Tantanmen, a spicy Japanese noodle soup based on Sichuan dandanmian (dan dan noodles), gets much of its luscious texture and flavor from a combination of toasted sesame paste and chili oil. To re-create something similar at home, I added a dollop of tahini (the sesame paste I had on hand) into a pot of alliums and curry paste and let it all meld together until my apartment was fragrant with a deeply nutty and savory aroma. I slowly added a carton of stock to the soup base and watched as the tahini-curry paste dissolved into a lagoon of rich, orangey broth. And so my very divergent take on tantanmen was born: Creamy Curry Egg Noodle Soup.Considering its high fat content and nutty flavor, it makes sense that tahini is excellent at smoothing out the mouthfeel and toning down the flavors of any bold soup or stew. And while dishes like tantanmen typically employ Chinese sesame paste, which is made from deeply toasted sesame seeds for unmistakable notes of deep nuttiness, tahini confers an equally delicious and creamy quality, albeit with a slightly different flavor. (For even more plant-based creaminess, you can also add soy milk, like in Jessie YuChen’s Creamy Sesame Noodles With Yuba.)I consider seed butters and pastes the higher-density versions of my other favorite vegan dairy stand-in: cashew cream. While you need to blend a ton of cashews into a smooth oblivion to achieve a creamy sauce for pasta, you only need a few spoonfuls of tahini in a soup or dressing to achieve a similar effect. Seed and nut butters and pastes simply provide more bang for your buck. You can incorporate a spoonful or two of any store-bought nut butter into your soup, but make sure to take their taste into account. Some options, like peanut butter, don’t blend into the background of a dish and function better as the star flavor (think satay). Sesame seed paste, on the other hand, fortifies a soup with mellow, unnameable notes of earthiness rather than overpowering it with potency or sweetness.The next time I’m tempted to round out a soup or sauce with something creamy, I’ll leave the sweet coconut milk and the tangy sour cream in their place and place my trust in the rich, fatty magic of tahini.Get the recipeCreamy Curry Egg Noodle SoupWard off the winter blues with this dreamy, creamy, umami-packed noodle soup flavored with red curry paste and chock-full of chewy egg noodles and kale.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-01", "author": ["Condé Nast", "Mehreen Karim"]}