{"id": "3f5d1255cf92a3a4bdc39575a0450563", "url": "https://www.bonappetit.com/story/the-ultimate-stay-in-bed-weekend-and-the-recipes-to-make-it-happen", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "The Ultimate Stay-In-Bed Weekend and The Recipes to Make It Happen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Ultimate Stay-in-Bed Weekend and the Recipes to Make It HappenThe secret to the most restful, relaxing, and self-care-fueled weekend of your life? Your bed.By Tempur-PedicSeptember 11, 2019FacebookTwitterEmailFacebookTwitterEmailSince Monday morning at 8:00 a.m., you’ve been dreaming of Friday at 6:00 p.m. It’s been a long week––scratch that, a long month––and this weekend is yours. Your place is about to become Self-Care Central, with you as the ruling monarch, and all you need are your shows, your bed, recipes you can whip up in a flash, and then: the sleep you’ve been waiting for.The secret? The TEMPUR-breeze° mattress. It helps you to sleep deeper, fall asleep faster, feel cooler, and sleep longer throughout the night. Models are designed to feel up to eight degrees cooler*. (*Based on average heat index of TEMPUR-LUXEbreeze compared to TEMPUR-PROAdapt models measured over 8-hour period.) Imagine: As you drift into dreamland, a thermodynamic mattress that activates at 80 degrees to absorb heat. From the moment you lie down, it delivers a cooling sensation up to 30 percent more intense than non-cooling models––and keeps going. All night long it absorbs heat, continually feeling as you roll over and adjust, even channeling humidity away from your body.With feels ranging from Soft to Medium to Firm, this mattress is a product of more than years and millions of hours of testing by Tempur-Pedic’s thermal, material, and textile engineers. Now you + the bed = ultimate comfort, right down to the perfect temperature. With that, we’ve got your all-weekend strategy for staying in bed. So who’s ready to tuck in?FRIDAY: SORRY NOT SORRY, CAN’T COME OUT TONIGHTA night propped up on pillows finally catching up on Season 2 of your favorite show is just within reach, but first, a plan must be put into place. Need wine? Hot chocolate? Fish or fresh veggies? Stock up on your way home. The goal this weekend is to stay. in. bed.Then, in just a few easy steps, whip up this cauliflower soup with hazelnuts and bacon. It's the perfect stay-home-in-your-sweats dish that won't take too much time. Your shows are calling! This creamy puréed bowl of goodness is made event better with crunchy, salty bacon and toasted hazelnut halves. Bonus: this cruciferous veggie will fill you up and won't make a mess when you're all piled up on top of the covers...but even if you do spill, TEMPUR-breeze° mattresses feature a removable, washable cover for quick, easy cleanup.SATURDAY: BRUNCH IN BED SOUNDS NICEA lazy Saturday morning is nothing without coffee and breakfast that’s just the right amount of indulgent. This anything-but-ordinary egg and merguez wrap gets its tang from red onion, dill pickles and mint inside a flour tortilla crisped up with sausage fat. More of a sweets-for-breakfast person? Treat yourself to these ricotta pancakes with blueberry-lemon compote. The secret to the light, fluffy consistency is whipped egg whites, and the ricotta gives these morning mainstays a tangy finish.If your home is Self-Care Central, then an unbeatable night’s sleep––or a midday nap––is at the top of the to-do list. Afterwards, consider a gentle, late-afternoon yoga session, bike ride, or leisurely walk to get your blood flowing. It will make leaping back into bed that much more satisfying when you trade your social Saturday night plans for the company of a good book. Round out the night with this fried chicken sandwich, made complete with seasoned mayonnaise, pickles, slaw and hot sauce. It tastes like having a picnic for one, but in bed.SUNDAY: TOO MANY SUNDAY SCARIES, GOTTA STAY INCongratulations, you’ve officially made it to Sunday on some of the best sleep of your life. Less wake-ups, less tossing and turning, and more falling into a deeper sleep, leaving you feeling like you could conquer the world. Shall we consider this mission accomplished? Not so fast, super hero.It’s easy to want to jump back into action after a couple of days of rest, but Monday will be here any minute. Take Sunday to treat yourself to your own Sunday Funday from the comforts of home. The one thing you haven’t made this weekend––the ultimate stay-in, eat-from-bed, feel-good comfort food––is dying for a slot on your weekend menu: pizza. Get in the kitchen, turn on a podcast or a playlist, and get to work making this perfect pie. By the time you’re done, a well-deserved rest will be waiting for you. Piping-hot pizza on a cozy, cool bed sounds like a recipe for perfection.Explore Bon AppétitWeekendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast"]}