{"id": "3f62b1f1dfad1226075332e9e124ee5e", "url": "https://www.bonappetit.com/story/in-canadas-niagara-region-sommelier-ashley-ragovin-hunts-for-great-wine", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "In Canada’s Niagara Region, Sommelier Ashley Ragovin Hunts for Great Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredIn Canada’s Niagara Region, Sommelier Ashley Ragovin Hunts for Great WineBy Destination Canada/Tourism Partnership of NiagaraOctober 15, 2018FacebookTwitterEmailPHOTOS BY SUECH + BECKFacebookTwitterEmailAshley Ragovin is on a hunting expedition. Not for big game in the traditional sense, but for bottles of rarified vino, which today has lured her from Los Angeles to Canada’s lush Niagara Region. A longtime sommelier, Ragovin has honed her palate to seek out the distinctive and uncommon—wines that convey a point of view, a place in time.“I’m always inspired by small family vineyards that make wine the local people are proud of,” Ragovin muses from the passenger seat of a rented Jeep. She returns her gaze to the window, through which a mesmerizing display of thick, curled grapevines flick past in neat rows that stretch to the horizon. “You won’t find out the nuance of that if you don’t come.”Her plan is to unearth gems within the area’s still nascent wine scene; perhaps she’ll find vintages to pour in her all-day cafe All Time, or to feature in her highly curated online bottle shop Pour This, which offers rare and highly sought-after wines you won’t find in your average liquor store. The air, cool and moist, is full of possibilities.Niagara’s unique geology and climate have long stoked Ragovin’s curiosity about the area, which has an agricultural heritage going back centuries. For years now, she’s heard tales of the area’s temperate climate, where summers aren’t too hot and winters aren’t too cold. The year-round rainfall is especially kind to agriculture, and true to form, it’s been raining off and on since early this morning. Indeed, puddles fill the vine-filled countryside.Farmers have grown fruits like peaches, cherries, plums, and pears here since before anyone can remember, Ragovin says, but grapes have dominated the scenery since the 1980s. Thanks to the natural erosion that’s carved the landscape over a millennia—the same geological phenomenon that created Niagara Falls, she notes—the soil here is wonderfully rich and fantastically varied, with pockets of different minerals and nutrients in each field. “It’s perfect for growing grapes that burst with character and originality,” Ragovin says.Today promises to be action-packed. We plan to hit up six wineries in a single day, each chosen for its individual way of expressing the Niagara Region in a glass. That may be through the grapes it chooses, the types of wine it makes, or its winemaking methods, Ragovin says. Even the personalities of the winemaker him or herself can affect one’s perception of a wine.The car comes to a halt. First up is Megalomaniac, which rises magnificently above the 80 acres of vines that surround it. “You can tell this isn’t a scrappy operation,” Ragovin says, eyeing the fields. The varieties of grapes grown here are ones we’ll see all day long: Riesling, Pinot Noir, Merlot, Cabernet Franc, Cabernet Sauvignon, and Chardonnay. They’re Old World grapes that have proven themselves here in the New World, and in the Niagara Region in particular.We’re met by the winery’s founder, John Howard. “On a clear day, you can see the spray coming off Niagara Falls from the second-floor patio,” Howard tells us as we enter a chandelier-dotted tasting room. The name of the operation, he continues, is meant to poke fun at the more sober-faced, inward-facing types prevalent in the wine industry. In contrast, Megalomaniac gives its wine fun names like Selfie, Narcissist, Bigmouth, and Bravado. But don’t mistake playfulness for frivolity, Howard cautions. “We take our vineyards and our wine very seriously,” he says. The vineyard’s winemaker Sébastien Jacquey appears; he pours several vintages, including a 2016 “Frank” Cabernet Franc.“I think Cab Franc does really well in the Niagara Region, based on the wine and the soil,” Ragovin says between sips. “With Cab Franc, there’s an earthy complexity that lends notes of smoke and pepper and wet rocks,” she explains. “It’s exciting to witness the focus on that grape,\" she explains. \"I think Megalomaniac represents an affordable, accessible starting point for most people.”Next up is Hidden Bench, a short drive away through winding vineyards, orchards, and rolling fields. Owner and winemaker Harald Thiel runs out to meet us in front of the main building, a handsome, green-roofed country house lined with dark, weathered wood. The whole operation spans 84 green acres and is certified organic, Thiel says. It’s also heated and cooled with environmentally friendly geothermal energy, and a massive solar panel helps reduce the winery's reliance on the electrical grid.“We’re also experimenting with natural wines,” Thiel tells us with a wide grin, pointing toward a pair of hulking wine-filled concrete “eggs,” which have grown in popularity in the nature winemaking world. In the tasting room, we sample the Estate Riesling, which packs a floral nose with notes of white peach, orange rind, and wet stone. There’s a major Austrian influence at play; Thiel’s mother is Austrian, and he speaks fluent German.“The Riesling’s juicy and fresh on the palate,” Ragovin says as we leave. “They just tasted really true to what they were, really focused and pure and unmanipulated.” The eggs were encouraging, too, she adds, explaining that the ovular shape is thought to create a continuous flow of wine within the vessel, naturally producing a more homogenous liquid. “His approach was rooted in tradition and he wasn't trying to be too experimental, but he was open-minded, which I thought was cool.”We pile in the car and head to Thirty Bench, our halfway point for the day. The winemaker, Emma Garner, meets us out in the vines. “For me, it’s about listening to what the grapes have to say,” Garner tells us. Minimal intervention is key, she continues, and creating a tantalizing wine is “about that balance between art and science.” In the light-filled tasting room, which looks out onto verdant fields, we sample an exquisite, fruit-forward Cabernet Franc with just the right amount of dryness.“Their Cab Franc was so impressive to me,” Ragovin says on our way out. “It was developed and thoughtfully made. It tasted very Niagara. Just a nice drinking wine.”We soldier on to Cave Spring Cellars, which is nestled in a historic winery building in the quaint village of Jordan. The structure dates back to 1871, making it the oldest functioning wine cellar in Ontario. Cave Spring Cellars itself plays a significant role in local history: More than three decades ago, its founders helped to pioneer the cultivation of noble European grape varietals on the Niagara Peninsula.Winemaker Angelo Pavan and his protégé, Gabriel Demarco, join us with bottles in hand. “We’re cutting back on the number of varieties we work with, we’re not expanding,” Pavan says. The idea, he continues, is to hone in on a few grapes and guide them toward perfection. “We make sparkling wine as good as anywhere in the world, with the exception of Champagne in France because they have all that history,” he says, eyes bright. “But we’ll catch up.” Ragovin raises a glass of 2009 Blanc de Blancs CSV to her lips, and nods with approval.“The wine was clean and thoughtfully made,” she says as we head back to the car. “It just tasted good, and it wasn’t manipulated and overproduced.” It’s encouraging to see younger winemakers like Demarco joining the fray, too, she adds. “It represents a new generation of good winemaking,” Ragovin says.Back in the Jeep, we follow a mud-packed road to Pearl Morissette, the imaginative outfit from non-interventionist winemaker François Morissette. Its fields go as far as the eye can see here, with creeping vines in one direction and pastures dotted with cows, sheep, and chickens in the other. The twinkling sound of birdcalls permeates the air, punctuated by loud cannon booms that echo across the landscape.“It’s a recording of birds in distress, to keep birds out,” explains Svetlana Atcheva, a former Toronto-based sommelier who’s since become Morissette’s collaborator. The booms scare away other predators, protecting the grapes without forcing the winery to use harsh chemicals. It’s reflective of the overall ethos at work at Pearl Morissette, where traditional winemaking methods are more evocative of a farmhouse than a chateau.“It’s interesting to work with something living,” Morissette says, stepping out from behind a hulking fermentation vat. Using natural yeasts and as little added sulfur as possible results in wines that are funky and playful, he says. We sample a handful of still-in-the-works vintages: complex Chardonnays, Rieslings, and others.There is no tasting room at Pearl Morissette, but those who want to taste the wines near where they were made can sample them at the on-site restaurant. Dinner here means a sprawling multicourse meal in a modern farmhouse setting; the airy dining room is hemmed in by glass walls on either side and finely burnished wooden floors are made with planks culled from the 200-year-old barn that once stood on the premises. The seasonal French menu changes constantly, but is always inspired by local ingredients, from rare bluecap and lobster mushrooms to petite wild pigeons.“Francois represents the future in winemaking to me, and he has a very irreverent approach,” Ragovin says, clearly impressed. “He’s not making wine for the masses. He’s making wine with a higher goal in mind, which is to express a place and stay out of the way, but guide it in the best possible way. I find it noble and sort of altruistic.”It’s late afternoon as we depart, and the sky threatens rain. We step inside our final destination, Big Head, just as a sudden downpour begins to pelt the warehouse-like space’s metal roof with furious intensity. We’ll be here for awhile. Good thing that Jakub Lipinski, the head of operations and the son of Big Head’s head winemaker Andrzej Lipinski, has plenty of wine for us to try.“Dad and I, we butt heads, but it’s never violent,” the younger Lipinski says with a laugh. The pair have markedly different wine philosophies; Andrzej favors big and bold flavors, while Jakub goes for profiles that are more complex and unconventional. Jakub is the guiding force behind the winery’s latest Syrah, a wild fermented wine packing notes of black pepper and smoked meat. It’s something of an “acquired taste,” he admits, but his father is on board.“It’s my first time getting involved in the winemaking,” he says. “I need something dirty and funky to get my brain going. For me, that’s beautiful.”Ragovin sips, and her eyes brighten. “How do I get a case of it?”“Just leave me your address,” Lipinski replies, smiling.Ragovin steps outside, her tour complete. The sky is clear for the first time today, and paddles soak up the last of the late afternoon sunshine. “For such a young region, I think there’s more going on here than even I expected,” she says, piling into the car one last time. Interesting things, particularly at Pearl Morissette and Big Head, where an emphasis on natural fermentation—which relies only on yeast present in the air—results in flavors that are intensely specific to this region, from dry and tangy to earthy and flinty. It’s exactly what Ragovin is looking for. She’s already trying to figure out how to get some of their bottles into Pour This.“There’s a lot of energy and a lot of pride,” Ragovin continues. “Everyone really wants to capture Niagara in their winemaking, as opposed to making it like the Finger Lakes or California,” she says. “There’s already a lot of exciting wine being made here and it’s only going to get better.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-15", "author": ["Condé Nast", "Destination Canada Tourism Partnership Of Niagara"]}