{"id": "3f63717120ad783aee1d6b9240bb62ce", "url": "https://www.bonappetit.com/story/wine-industry-culture", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "To Make the Wine Industry Less Toxic, We Need to Get Loud | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleTo Make the Wine Industry Less Toxic, We Need to Get LoudThe sexual assault allegations against sommelier Anthony Cailan make clear that the wine world has work to do. But how do you change the culture of a business that is built on drinking?By Marissa A. RossNovember 5, 2019FacebookTwitterEmailPhoto by Michael Graydon & Nikole Herriott FacebookTwitterEmailScrolling Instagram one morning this fall, between posts of my friends leaf peeping and last night’s dinner plates, I saw the October 2019 Wine & Spirits cover, which the magazine has since removed. Big, in a pretty serif font, it boasted “Best New Somms” with a portrait of sommelier Anthony Cailan of the New York City restaurant The Usual with hundreds of congratulatory comments. I burst into tears.I’d heard rumors about Cailan’s sexual misconduct when he left Los Angeles to work with his brother, chef and restaurateur Alvin Cailan, in New York in 2018. Everything I had heard was secondhand, not enough to speak publicly about, but enough to make me want to know more.I posted on Instagram the same day, September 10th. I was vague and didn’t name names, just mentioned that I’d heard “a prominent sommelier (both LA & NY)” had assaulted multiple women and that I would like to talk off the record to anyone who was open to it. I’d been using my platform as a wine writer to speak publicly about sexual assault—and my own experiences with it—since 2016, and I hoped that people would feel safe coming forward to me. Within 20 minutes of posting, I had messages from four people relaying personal stories of sexual harassment involving Cailan—and over the next two weeks, dozens of other assault survivors contacted me. I reached out to New York Times reporter Julia Moskin, who’d heard rumors herself about inappropriate behavior among sommeliers and other wine professionals, and put her in contact with these sources. After a month of reporting and legal vetting, Moskin’s piece on the allegations against Cailan and broader issues of abuse and complicity in the wine industry ran on Friday.In the piece, multiple women recount how Cailan invited them to his house and pressured them to drink, take drugs, and give in to his sexual advances despite them verbally saying no. She also writes about how pervasive this behavior is in the world of wine, especially when it comes to young women who are just starting their careers, and how, despite being aware of his inappropriate behavior, people who knew Cailan failed to speak out about his actions.Moskin’s story—and my experience talking to survivors—makes clear that sexual harassment and assault in the wine world has all the notorious hallmarks we’ve become familiar with in the food and beverage industry and beyond: a culture of drinking, abuses of power, and the constant excusal of bad behavior. Except, when it comes to wine, one of those hallmarks is the foundation that the business is built on.I’ve been in the wine world professionally for almost five years now, covering natural wines and the culture of winemaking, and it did not take me long to realize that, if you work in this field, you can’t “just say no” to wine. Talk all you want about tasting and spitting, but drinking wine is not just part of the job, it’s part of your education, and it often becomes your social life, too. You can read all about Barolo, but you won’t know what it tastes like until you try it. And if you’re lucky enough to get to try a $500 bottle of ’99 Giuseppe Rinaldi, can anyone blame you for not wanting to spit it out? Even if you politely decline, the bottles will still be opened, and your glass will most likely be filled.Consider who’s filling your glass: Maybe it’s the buyer you need to make happy so he takes an extra case. Or the boss you need to have another round with for a chance at a promotion. Or your favorite winemaker who begged you to stay at the table to keep him company. The natural wine world in particular has a reputation for celebrating the freedom and pleasure of wine, while “freedom” and “pleasure” have often been excuses for inappropriate behavior.And most insidiously, as the Times story makes clear, if you come forward with allegations, you’ll most likely be told that it’s your fault or given one of a million excuses, from “he was drunk” to “you just don’t understand European culture.” Raquel Makler, who worked for Cailan and who, Moskin reports, was sexually assaulted by him in his Manhattan apartment, emailed the notable wine writer Alice Feiring in June 2019 for advice, writing that Cailan had assaulted her but not giving further details. According to the Times Feiring advised her not to go public, writing, “It is up to us to learn to say no to unwanted sexual advances.” If we can't go to our community leaders for help, who can we rely on?When you’re abused, whether verbally, physically, or emotionally, it’s common to blame yourself, to feel humiliated and alone. But we’re not alone, and the only way to know that is to talk about it.I can’t believe I still have to say this in 2019, but we have to do better at talking publicly about sexual harassment and assault in the wine industry and beyond. So many people have rolled their eyes and told me to \"stick to wine\" every time I'd speak about sexual assault. But if I hadn’t been consistently vocal, Cailan’s survivors—and the many others who’ve contacted me over the years—may not have felt safe or comfortable reaching out to tell their stories. When you’re abused, whether verbally, physically, or emotionally, it’s common to blame yourself, to feel humiliated and alone. But we’re not alone, and the only way to know that is to talk about it.It is vital that conversations about harassment and assault happen not just among survivors but within their communities and beyond. But how do those conversations start? On an individual level, “showing up” can literally mean just showing up—whether it’s your physical body on the couch or a conversation over text—being present, and genuinely listening. As a survivor myself, and as someone who deals with anxiety and depression, one of the kindest things people have done for me is to simply let me know that they are there. And if I’ve wanted to talk, they’ve listened. And if I didn’t want to talk, they respected that, but it still reminded me that I wasn’t alone because, damn, it’s so easy to feel that way even when you’ve put in the work to know you’re not.We also need to show up in more public ways. If you witness someone being mistreated at a bar, restaurant, wine event, or anywhere, don’t excuse it as \"just part of this culture\" or ignore it because you don't know what to do. If you're in a position to do so, tell a manager or owner, and consider intervening if it feels safe.But it often doesn't feel safe, and we need to be more proactive about changing the culture so that sexual harassment stops happening, period. Those of us in leadership positions—shop owners, importers, event organizers, winemakers—need to ensure that our bars, restaurants, wineries, festivals, and other events are inclusive and safe for everyone. That means creating zero-tolerance policies for toxic behavior—then clearly stating and enforcing those policies. It means using tools like The Color Code of Conduct, a simple system for calling out sexual harassment in restaurants, created by the women-led team at Homeroom in Oakland. Or adopting programs like Safe Bars, a D.C.-based program that trains bar staff to handle sexual harassment and assault. These types of policies empower people by giving them the tools they need to respond when something doesn't feel right.In light of this most recent story, and all the told and untold stories that have come before, this should be our mission: to be inclusive and safe for everyone, and to allow people to learn about, experience, and enjoy wine without worrying about what they may have to give up to get it. The Times piece isn’t going to change anything unless we get louder about changing our own community. And if we can do this in an industry that’s built around drinking, we can do it in the rest of the world too.Explore Bon AppétitHealthyishWineessayRead Moreculture\"You’re in a World Where the Rules Are Made by Men\"By The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Marissa A. Ross"]}