{"id": "3f6ecffd462fc458c23515737ed79cdb", "url": "https://www.bonappetit.com/recipe/bombay-sandwich", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Bombay Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBombay SandwichBy Preeti MistryMarch 16, 20214.2(30)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis “grown-up grilled cheese,” as chef Preeti Mistry calls it, is inspired by both the street food classic found in Mumbai and versions found at some of their favorite Bay Area restaurants. Mistry’s Bombay Sandwich is made with onions cooked down into jam, plus potatoes, two kinds of cheese (Monterey Jack for meltiness and tangy cheddar to cut the spice and richness of the onion), and Scallion Chutney (you’ll have plenty extra, and we suggest you use it on everything). For the bread Mistry says to use a really good sourdough for structure and nuance in texture and flavor—and a steak press or fish weight, if you have one, to get a really good sear.Find more of chef Preeti Mistry’s Holi party recipes here.IngredientsMakes 8Onion jam¼cup vegetable oil1tsp. brown mustard seeds1tsp. ground turmeric2onions, thinly slicedKosher saltScallion Chutney1bunch scallions, dark green parts only, coarsely chopped1serrano chile, coarsely chopped1garlic clove, crushed11\" piece ginger, peeled, coarsely chopped2½cups coarsely chopped cilantro1cup mint leaves3Tbsp. fresh lemon juiceKosher saltpotatoes and assembly2lb. medium Yukon Gold potatoesKosher salt16½\"-thick slices sourdough bread12oz. Monterey Jack, coarsely grated (about 4 cups)12oz. sharp cheddar, coarsely grated (about 4 cups)¼cup chaat masala4Tbsp. (or more) ghee or unsalted butter, room temperaturePreparationOnion JamStep 1Cook oil, mustard seeds, and turmeric in a large skillet over medium-high, stirring occasionally, until seeds begin to pop, about 1 minute. Add onions and season with salt. Cook, stirring occasionally, until onions are beginning to soften, about 4 minutes. Reduce heat to medium-low and cook, stirring occasionally, until onions are softened and jammy and starting to brown around the edges, 15–20 minutes. Set jam aside.Do ahead: Jam can be made 1 week ahead. Transfer to an airtight container; cover and chill.Scallion ChutneyStep 2Purée scallions, chile, garlic, ginger, cilantro, mint, lemon juice, a big pinch of salt, and ⅔ cup water in a blender until smooth. Transfer to a small bowl. (Makes about 2 cups. Store leftovers in an airtight container; cover, chill, and use within 3 days.)Potatoes and assemblyStep 3Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny) and bring to a boil. Reduce heat; simmer until potatoes are very tender but not falling apart, 30–35 minutes. Drain and let sit until cool enough to handle. Peel potatoes and slice ¼\" thick. Let cool completely.Step 4Slather one side of bread slices with scallion chutney. Distribute half of Monterey Jack and half of cheddar over 8 slices. Top with some reserved onion jam, followed by 3–4 potato slices. Sprinkle with chaat masala, then top with remaining cheese; close up sandwiches.Step 5Heat 1 Tbsp. ghee in a large nonstick skillet. Place 1 or 2 sandwiches (as many as will comfortably fit) in skillet, lay a baking sheet or skillet on top, and cook, pressing, until bottom sides of sandwiches are golden brown, about 4 minutes. Turn sandwiches over and add a bit more ghee to pan if needed. Cover again and cook, pressing, until other side is golden brown and cheese is melted, about 4 minutes. Transfer to a cutting board and cut into quarters. Repeat with remaining ghee and sandwiches.How would you rate Bombay Sandwich?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleSuper delicious and the sliced potatoes make a great stand-in for a meat filling typically found in a sandwich. The flavors meld into a pleasant gestalt with a contrasting set of textures I found really compelling. I used a pair of extra hot cast iron skillets to cook and press these sandwiches into Elysian fields of golden brown. My only beef with the recipe is the potato prep: why the heck are we cooking whole potatoes for 45 minutes and waiting another 15 for them to cool to peel and slice? Next time around, I'll slice them first and then cook them: they should be done in 10 minutes by then.Sean KellyDallas5/1/2021Made these again and wanted to add one more note (also Bebe Von Bernstein from Brooklyn, if you ever see this - can we be friends? We have the same pet peeve :) My instagram is fatima0203). These stay crunchy for a while, but if for some reason you want to keep them crunchy + warm, I kept them in a 225 oven for 1.5 hours on a foiled tray (do not cover though!) and they were still perfect. And on the subject of ghee + breakfast-y foods, if you're not already cooking your eggs in ghee, try it!FatimaChicago4/17/2021These sandwiches are so, so good!  I made them as directed in the original recipe for dinner, and then made them again the next morning for breakfast with scrambled eggs instead of the potatoes, and it was just as delicious!  AdrienneGig Harbor, WA4/11/2021made these this weekend and WOAH! wouldn't change a thing, I did have some onion jam leftover (which some of my family did say they wanted even more of on their sandwiches), and have been using them as toppers on all sorts of things. it did make for a super indulgent sandwich but one that every vegetarian dreams of. AnonymousNew York, NY4/5/2021Wow, just wow. These are AMAZING! I made a bunch for a weekend gathering and holy guacamole, these were delicious! I had friends buzzing around me while I made the onions, they were all excited by the smell of caramelizing onions. I doubled the onions and had none left over but I did use generous portions of them on the sandwiches. The flavor was complex, the ghee fried the bread perfectly and like someone else said, they stayed crunchy for much time after making them. I highly recommend making these! Laura Portland, OR4/5/2021Have not made this recipe yet , but want to give mad props to Fatima in Chicago, who may have written my favorite — and most helpful — recipe review of all time.  \n\n(And one of my pet peeves is people who weigh in on recipes they haven't made, but tbh, Fatima makes me want to make this recipe as much as the original recipe).  \n\nBA:  Any way to follow specific reviewers?  That would rock, as I'd like to follow Fatima . . .Bebe Von BernsteinBrooklyn4/1/2021This is a lot of work if you think of it like a grilled cheese but if you think of it as a fancy snack at a picnic or as an addition to eggs at brunch then they are SO worth it. I did everything according to the recipe except: I swapped Monterey Jack for Gouda because it's all I had, and I did not use chaat masala because I always hate the sulphury smell I feel like it has. I think I would try it next time though. I used a ton of ghee in my pans and the sandwiches were so perfect that even after sitting for 30 minutes, then getting transferred to a park and sitting another 30 minutes, you could still hear crunching. I will use ghee forever now as the fat to cook grilled cheese in. My accidentally over-boiled potatoes were between a slice and mush, but honestly the slightly mashed potato was a great contrast to the crispy bread, so I wouldn't mind making the same mistake next time. A lot of leftover chutney so whenever I make these again I would double the jammy onions in order to make/eat these sandwiches for days afterwards!Fatima Chicago3/24/2021Explore Bon AppétitSandwichIndianSouth AsianAsianPotatoVegetableMonterey JackCheeseCheddarYukon Gold PotatoMainVegetarianFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}