{"id": "3f763b9e82aa2ab964ae3a406613b1e0", "url": "https://www.bonappetit.com/story/the-only-green-pepper-i-love", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Poblanos Are the Only Green Peppers I Can Fully Get Behind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Only Green Pepper I Can Fully Get BehindPoblanos are earthy, fruity, and 100% more interesting than green bell peppers.By Amiel StanekOctober 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailPeople hate green bell peppers. Not everybody, obviously, but certainly enough people with enough intensity that a distaste for this particular fruit isn’t exactly a niche position. For the record, I wouldn’t say I hate green bell peppers, but I certainly don’t seek them out. More than anything else, I think they taste, well, kind of boring—unripe (which they are), a bit bitter, watery. But I’m not here to trash green bell peppers; I’m a solutions-oriented person. Instead, I’m here to talk about a green pepper I do like, one I think tastes simply marvelous and deserves as much adulation as the aforementioned pepper gets vitriol: the poblano.I love poblano peppers! To me they taste like everything a green bell pepper aspires toward, as different as a ruby-ripe heirloom tomato is from the wan simulacra you’ll find at a New York supermarket in December. Poblanos are deeply earthy, dense, and meaty, with an appealing balance between fruitiness and bitterness that lends complexity to so many dishes. And because they deliver the suggestion of chile heat—green poblanos usually clock in at 1000–1500 units on the Scoville scale, around half that of the mildest jalapeño—they keep you on your toes without delivering a sucker punch. They pair especially well with cream (as in rajas con crema), melty cheese, and other rich, fatty elements. (It’s worth noting that green poblanos can turn red and ripen, at which point they’re spicier. They’re typically dried and referred to as anchos.)Cheese, please!\nPhoto by Molly BazAdding a few to this corn pudding recipe was a no-brainer to me—they lent just the right amount of warmth and intrigue to an otherwise one-note dairy party. And I also loved them in this recipe for garlicky smashed chickpeas from Abra Berens’s new cookbook, Grist, where they play nice with the earthiness of the legumes and the sweetness of fresh corn. I’ve had success subbing them in whenever cooked green bell peppers are called for, like in gumbo, and I bet they would taste absolutely smashing on a pizza alongside rings of white onions and nubbins of sausage.Which is all to say, for the green bell pepper haters out there, enough is enough. Stop wasting your time fixating on a fruit you don’t like—a better pepper is just around the corner.Put some pepp in your step:Garlicky Smashed Chickpeas With CornThese aren’t your average crispy chickpeas–here, garlicky garbanzos get lightly smashed before frying, creating layers of texture.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-22", "author": ["Condé Nast", "Amiel Stanek"]}