{"id": "3f8347398bb30561c2b61f5297017b70", "url": "https://www.bonappetit.com/recipe/plum-salad-with-black-pepper-and-parmesan", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Plum Salad with Black Pepper and Parmesan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssuePlum Salad with Black Pepper and ParmesanBy Chris MoroccoJuly 10, 20184.8(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintDon’t bother trying to halve and pit the plums before slicing them for this plum salad recipe. Instead, cut off slices, working your way from the outside to the pit.Ingredients4 servings2Tbsp. sherry vinegar or red wine vinegar1Tbsp. honey½tsp. cracked black pepper, plus more6ripe red, black, and/or green plums, some thinly sliced, some cut into wedges¼cup shaved Parmesan or Pecorino, plus more for serving2Tbsp. extra-virgin olive oilFlaky sea saltPreparationStep 1Stir vinegar, honey, and ½ tsp. pepper in a medium bowl until honey is dissolved. Add plums to dressing and toss until coated. Add ¼ cup Parmesan and gently toss again just to evenly distribute throughout salad.Step 2Transfer plum salad to a shallow bowl. Top with more Parmesan, drizzle with oil, and season with salt and more pepper.How would you rate Plum Salad with Black Pepper and Parmesan?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI used about 10 small Italian Prune plums and 3/4 of a Bosc pear. I shaved some cheap Parmesan with a potato peeler. I used 1 tbsp raw honey, 1 tbsp sherry vin and 1 tbsp red wine vin and lots of black pepper.  I thought it was good, my mom thought it was fantastic. The pear was a good touch. Next time I'd use a higher quality Parmesan and an herb - mint or basil. EllyHood River, OR10/7/2021A friend gave us a bag of freshly picked plums from her garden, so made this salad for lunch. Surprising and delicious! SusanVictoria, British Columbia9/6/2021WOWZA!  I took this to my book club without testing it first.   IT WAS A HIT!\nHow can something so simple to make be so delicious!   The deliciousness way out of proportion to the time it took to prepare! From now on I will be eager for plum season! \nAnonymousLynnwood, WA8/21/2019Amazing flavor combination! Super easy and great way to use a glut of CSA August plums. Don't forget the flaky salt. AnonymousBrooklyn, NY8/18/2019Made this tonight - the combination is amazing. Sweet, sour, spicy, salty. Perfect summer salad, took less than five minutes to make. AnonymousLos Angeles 8/12/2019Was pretty skeptical about the plum + zippy peppery combo, but this was a damn good refreshing summer salad!  AnonymousHouston8/19/2018Explore Bon AppétitSaladPlumStone FruitFruitParmesanCheeseSummerEasyQuickSideGluten-FreeNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Chris Morocco"]}