{"id": "3f8e2bf1cddab2fbf4bf778d4a1c7875", "url": "https://www.bonappetit.com/story/claudette-zepeda-border-kid", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Claudette Zepeda Is a Border Kid. This Is How She Cooks. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureI’m a Border Kid. This Is How I Cook.For much of my career, I resisted making tacos. Then I realized they’re the clearest expression of who I am. By Claudette Zepeda, as told to Hilary CadiganFebruary 13, 2020FacebookTwitterEmailPhoto by Brandon HarmanFacebookTwitterEmailMy parents are from Tijuana, right near the border, but I was born in San Diego. It was a fight between them. My dad wanted me to be born a Mexican citizen and my mom wanted me to be an American citizen, to have all those rights and privileges. So she ran away, crossing the border to have me. My dad showed up at the hospital with KFC in hand. He lost the fight but was just impressed she had the gumption.All of my strongest food memories are from Mexico. One of the most vivid is eating a freshly made tortilla with nothing but salt in it. We called it a pellizcada, which means “pinched”—a taco in its simplest form.Growing up in Tijuana was fun. Mexico was safe for me. Mexico was everything I wanted. We were poor kids, so we’d amuse ourselves by wrapping twine around beetles and using them as helicopters. My brother fractured his neck jumping off a three-story building. We were playing Batman and Robin and he got stuck between clotheslines. When my uncle caught him, I said, “He just ran in front of me. I was going to jump with him!”Zepeda’s carne asada taco.\nPhoto by Brandon HarmanI didn’t know we were different until we moved to San Diego when I was eight. Our house was in the hood, just across the border, and we still went back and forth to Tijuana all the time. I was living two different lives. Every time we came back to San Diego, it was like a giant slap in the face: “You don’t belong here.” At that time white supremacy was a big thing in the town we lived in. I remember seeing skinheads, and I didn’t understand what they were. My brother was called a bunch of racist slurs. I learned the word “beaner” in elementary school.I spent summers with my aunt in Guadalajara. Ever since I was about three months old, my parents would put me on a plane. At that time you could just walk up to the gate and hand the baby carrier to a stewardess. My aunt would pick me up in Mexico and take me to her restaurant, Las Calandrias. She was a single mother of six and used that restaurant to put food on her table and send all her kids to university. She was there morning, noon, and night, making posole, sopes, all kinds of homey Mexican food. That restaurant was her identity.The second I could reach a table, my aunt put me to work. If I could see over the counter, I was cutting lettuce and radishes, filling up to-go bags. I loved it. My aunt was the first businesswoman I saw. She’d walk around the restaurant and everybody knew her name. I was like, I want to do what she’s doing.In high school, I worked at a Chicago-style pizza joint at the mall in San Diego. Everybody in that kitchen was Mexican too, and there I found the community I didn’t even know I was craving. For family meal, we’d make Mexican dishes with whatever we had on the menu. There was this steak tip thing, and the cook would top it with Worcestershire sauce and serranos and lime and cilantro, a ton of acid and salt. It had all of those flavors I loved from my mom’s cooking.Zepeda plating a beef shank taco.\nPhoto by Brandon HarmanWhen I became the chef at El Jardín in San Diego, I resisted putting tacos on my menu at first because I didn’t want to distract from the rest of the narrative. People expect Mexican food to be cheap and simple, but I was trying to show the country’s diversity. So when I did finally put a taco on the menu, it had to be the best damn taco in the world: a birria taco, which was a tribute to the stand right outside of the market in Tijuana. I made my version of it, a twist between a taco and an au jus sandwich. The tortilla was crispy fried and on the side was a broth of beans and lime and cilantro and onions for dunking. In Mexico the consomé is supposed to be sipped separately. People would look at you odd if you dunked the tortilla in the broth. But at El Jardín we put the broth in these small bowls I’d gotten in Oaxaca and laid the taco on top—and this dish became a staple for the restaurant.Still though, I had to explain myself every single day. Defend our food. Apologize for our prices. People said, “Oh, this isn’t Mexican. The chef’s not Mexican enough.” It starts to wear on your creative side. We eventually closed down because my own business partner called my food too pretentious. He let all of our staff go and reopened as a “cantina” with hay-stuffed jeans to imitate field workers because it’s all we got reduced down to: field workers.But my mission doesn’t end just because I don’t have walls to hold me. Now I’m a traveling chef: London, New York, Oaxaca. And tacos are a vehicle for my creativity.At a recent dinner I hosted in Paris, I made a fish taco with seared sea bass and al ajillo beurre blanc. It was a very Frenched-up sauce with beautiful local ingredients, but a lot of the flavor came from my memories of Mexico. At another event, I cooked enfrijoladas, which is literally just tortillas and beans. I met a chef there who had been cooking in Berlin for the past 13 years, but he’s from Mexico. He said, “I ate those and I wanted to f*#%ing cry. They reminded me of my grandmother.” I was like: That’s it, right there. That’s the reason why I cook. I’m just trying to talk through food.Zepeda at the stove in her home.\nPhoto by Brandon HarmanWhen I travel, I see commonalities. A taco in Ethiopia is injera with a bunch of braises and vegetables and chutneys. In the Middle East, you put things in pita bread. Is that a taco? Well, technically, right? Every ethnicity has a taco. Colonization has its ugly side but also its beautiful side: bringing ingredients to a place they weren’t before.Borders are just man-made parameters that close people in. I don’t like parameters around my life or my food. That’s why the word fusion doesn’t mean anything to me; everything is fused together already. Instead, I like to think of my food as “a tribute to,” like that birria taco from the stand in Tijuana. I do tributes wherever I go. Like, “I see you. You have this? Well, we have this. Let’s make something beautiful.”Claudette Zepeda is the former executive chef at El Jardín in San Diego and an alumni of Top Chef and Top Chef Mexico. She is now a traveling chef and caterer but her home base is San Diego, where she lives with her son and daughter.Want More Stories From Taco Nation? Right This Way...In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceWhy Are H-E-B’s Flour Tortillas So Dang Good?How the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalWhy Korean Tacos Are Margaret Cho’s American DreamAnd so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Claudette Zepeda", "As Told To Hilary Cadigan"]}