{"id": "3f9ad430c9e723560b745606cdbe5eed", "url": "https://www.bonappetit.com/story/changed-since-college-la-viola", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I’ve Changed Since College, But Thank Goodness La Viola in Philadelphia Hasn’t | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ve Changed Since College, But Thank Goodness La Viola Hasn’tWelcome to a night at Philly’s prime spot for carb-loading, reckless drinking, and trying on adulthood.By Brette WarshawApril 16, 2019FacebookTwitterEmailCourtesy of Katie PossageFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.The Phi Delta boys are doubled over, pulling naked bladders of boxed wine and bright-yellow handles of god-knows-what out of their gym bags. Caught somewhere in the time zone of their sweet 16s, with boyish faces and floppy hair and button-downs they don’t quite fill out, they arrange a constellation of booze across their table of ten. It’s 9:30 on a Thursday night, and things are about to get rowdy.It’s been six years years since I last visited La Viola, a small BYOB Italian restaurant in Center City, Philadelphia. But things look just as I left them. The menu, which has more cursive curlicues than a head of ringlets, serves the same vitello carciofi, pollo rollatini, and green spinach-and-ricotta gnocchi that it did when I was in college. The staff is just as jovial and eager, reciting the daily specials with all the pomp and pride of a royal court’s MC. The clientele is still that quintessentially Center City mix of older well-to-do couples, middle-aged women, and of course, large groups of UPenn students making their first stop on what will be a long night of drinking and dancing ahead. Thank goodness some things never change.La Viola is not a normal place for college kids to pile into, but Philadelphia is not a normal city. The state’s strict laws make liquor licenses difficult to come by, so many restaurants are BYOB. This means that students can drink college-level quality and quantities in the same restaurants that normal people go to for family dinners and special date nights. They can get their pastas Parmesan-ed and salads black-peppered by jacketed waitstaff while taking jugs of Carlo Rossi to the face. They can accompany their penne alla vodka with shots of Svedka chased with Diet Coke, and then spill that Diet Coke all over the white tablecloth. They can shout across the restaurant to their friends at another table. The staff is completely unflappable through it all, which makes it the best place to stick around and get sloppy.I remember it as a taste of adult life without actually having to be an adult, a fancy-feeling, candlelit world where it didn’t just feel okay to be loud and rambunctious but somehow even encouraged. It was where my friends and I could put on our highest heels and our best bandage skirts, cram ourselves together, and eat a responsible base of carbohydrates while getting just the right amount of drunk—not in a frat house, but in a real nice restaurant. It was exhilarating to be able to try on a version of adulthood for one night a week, to pop into “real life” and make a mess of it and not have to clean up the aftermath.And so as the night gets later and the Phi Delta boys get louder and the bladders of wine get emptier and the last remaining couples clear out, I pay my check and head home. The Penn kids’ night might still be young, but I’m not anymore.Brette Warshaw is a writer living in New York City and the author of the weekly newsletter What’s the Difference?Explore Bon AppétitRestaurantsItalian AmericanRed SaucePhiladelphiaRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Brette Warshaw"]}