{"id": "3f9bdc475b7e20190d7dd42af68cd4a1", "url": "https://www.bonappetit.com/story/adrienne-maree-brown", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Adrienne Maree Brown on Why Joy Is a Form of Resistance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAdrienne Maree Brown on Why Joy Is a Form of ResistanceThe author and social justice activist finds pleasure in slightly melted ice cream and a good solo dance party.By Maggie LangeMay 20, 2019FacebookTwitterEmail2015 Kresge Arts In DetroitFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is adrienne maree brown, author of Pleasure Activism.We’re lucky to have adrienne maree brown and her bold new book, Pleasure Activism: The Politics of Feeling Good. I came across it in an activist reading group in L.A., and I want to press it into the hands of every bleary-eyed, burned out radical I’ve ever met.adrienne maree brown is an author, black feminist, and social justice activist in Detroit, Michigan. She’s an Octavia Butler scholar who uses science fiction as a framework for activism. In her deeply heartening first book, 2017’s Emergent Strategy, she argues that organizing for social justice is speculative fiction: it imagines new, possible futures and builds a transformative world. Pleasure Activism deepens brown’s ideas about activism as she argues that joy can be a form of resistance that is empathetic, fierce and critical.In the book, brown hunts down pleasure in all its forms: love, great sex, nourishing community, amazing food, but also the quiet satisfaction of being organized. She persuaded me quickly that it’s possible to be both a warrior and a hedonist; that forging more space for your pleasure takes space away from repression/oppression and creates a reverberating effect that encourages others to do the same.brown, I learn, is a direct, tender, critical yet rigorously nonjudgmental teacher, who also happens to love dancing to Prince. Here she tells us about \"relationship anarchy\" and why she doesn't want to see any photos of your pets.The pleasure I have to fight for is... time away.I find new pleasures by... listening to my delight. I like the pleasure of the familiar, so when something new truly delights me in a tangible way, I chase the white rabbit down the hole. I say “yes” to coincidence. I remind myself I can't be good at something I'm doing for the first time, and that reminder helps me humble into learning mode.I don’t understand... people’s love of avocados. It’s the texture of a chalky slime mold, so I guess avocado toast is a mystery to me? And most pets are devolving captives subsisting on dregs of human attention in place of vibrant wild community, so most super cute pet pics/videos on social media just make me dream of liberation.I’m listening to... Beyoncé’s Homecoming. Maggie Rogers’ Say It. Tierra Whack. Dan Kye. Cardi. Fever Ray.My pleasure icons are... Marla Stewart of Velvet Lips. Rihanna, obviously. Lizzo too, the pleasure she gets from just confronting the world with her excellence and then laughing.I get major joy from activist communities like... Black Organizing for Leadership and Dignity and the Emergent Strategy Ideation Institute. They are two bodies of dynamic brilliant incredible humans who make me laugh and feel seen and valued… I am deeply content in those spaces and in Detroit.Staying organized is satisfying, but... I appreciate the chaos of unplanned time. I find unorganized human time particularly intriguing.I’m reading... Octavia, Ursula. Kiese Laymon. Mary Oliver. James Baldwin. China Mieville.I cultivate great relationship anarchy by working to... stop assuming ownership/belonging is a part of true love.My favorite drug is... pure MDMA.The drug I take to heal is... marijuana. Quiet solo time in the ocean.My favorite food textures is... cold, slightly melted ice cream with some kind of hard chocolate in it. Or a warm gooey cookie-brownie-thing under.My most subversive joy is... that internal knowledge that I am not inferior to a man who is simultaneously thinking that he is superior to me. And any indulgence of tobacco.I don’t avoid the “activist guilt” that’s tied to devoting yourself to justice, but... I certainly examine it. I believe it's tied to the truth that, as an individual, I can never do enough in the face of all the intersecting injustices of my life and time. But I sometimes look at how far I've come, in my lifetime, in my lineage. How much repression I have cast off, how much oppression I have negated, how I went from homophobic to pansexual, from military brat to post-nationalist/post-capitalist. I feel free a lot, I surround myself with good revolutionary people...and I think, ok padawon. This may be an insignificant life in some grand epic scape, but in the scale of my life, I am doing my best and really getting a lot done for a lazy weed lover.The last things to bring me peak glee are... when communities I love act in solidarity with each other. The BOLD Harlem Renaissance costume party. Getting lost in a baby's eyes, or a child's plans for the day. Dancing, like private music-video emo dancing. The last thing was looking at myself naked in the mirror and feeling aroused. I had to surrender so many wrong thoughts to begin to see.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyle‘Nap Bishop’ Tricia Hersey Is Spreading the Gospel of RestBy Melissa Pandika Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-20", "author": ["Condé Nast", "Maggie Lange"]}