{"id": "3fb7d544cd0b8d203f2b2d4f399637d7", "url": "https://www.bonappetit.com/recipe/jammy-pepper-pasta-salad", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Pepper Pasta Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJammy Pepper Pasta SaladBy Molly BazJune 12, 20194.7(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThis spicy, sweet, and punchy pasta salad is perfect for a hot summer picnic when mayonnaise just doesn’t feel right. If you aren’t a big fan of heat, skip the chiles in favor of all sweet bell peppers­—it will still be bright and delicious, and perfect at room (ahem, air) temperature.Ingredients6 servings1cup nuts (such as hazelnuts, almonds, walnuts, or pistachios)3lb. mixed bell peppers (baby, regular-size, or a mix of both)2red Fresno chiles1cup extra-virgin olive oil1head of garlic, cloves separated3large sprigs thyme2½tsp. kosher salt, divided, plus more3tsp. sugar, divided½cup plus 3 Tbsp. red wine vinegar½red onion1lb. rigatoni6oz. ricotta salata (salted dry ricotta), cut into very thin planks, or crumbled feta1cup basil leavesPreparationStep 1Preheat oven to 350°. Toast nuts on a rimmed baking sheet, tossing halfway through, until golden brown, 5–10 minutes depending on type of nuts. Let cool, then coarsely crush; set aside.Step 2Meanwhile, cut bell peppers in half lengthwise through their stems. Remove and discard any seeds and white ribs. Cut large bell peppers into 1\"-thick strips and baby bell peppers in half lengthwise. Thinly slice chiles crosswise into rounds; discard stems.Step 3Heat oil in a large Dutch oven over medium-high until shimmering, about 3 minutes. Add peppers, chiles, garlic, thyme, 2 tsp. salt, and 1 tsp. sugar and cook, stirring occasionally, until peppers begin to soften and are golden brown in some spots, 10–15 minutes. Reduce heat to medium-low and add ½ cup vinegar. Partially cover pot and cook, stirring every 5–10 minutes, until peppers are very soft, jammy, and browning in some spots, 35–45 minutes longer. Remove from heat. Pluck out and discard any shriveled thyme stems.Step 4While peppers cook, thinly slice onion and transfer to a small bowl. Add ½ tsp. salt and remaining 3 Tbsp. vinegar and 2 tsp. sugar, then toss to combine. Let sit to lightly pickle until ready to use.Step 5Cook rigatoni in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and add pasta to pot with peppers. Add pickled onions and their pickling liquid, then toss well to evenly coat pasta. Let cool to room temperature.Step 6Crumble ricotta salata into pot, then stir in reserved nuts. Tear basil into coarse pieces, add to pot, and stir until combined.Step 7Transfer to a large bowl and serve at room temperature, or cover and chill if you prefer to serve salad cold.Step 8Do Ahead: Pasta salad can be made 3 days ahead. Let cool to room temperature, cover, and chill.How would you rate Jammy Pepper Pasta Salad?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleI first made this 2 years ago. We loved it so much, I've made it several time since. I've found that I like it with crumbled Goat Cheese the best, but otherwise, stick to the recipe. An incredibly flavorful dish that has been a 'dinner winner' with everyone, and can be adjusted to meet vegan standards (omit Pasta and cheese... easily done!)Mark in Bee Cave TX12/25/2021I loved this recipe. I doubled it, which I do not recommend because it was A LOT of peppers and took longer to cook down but the results were amazing. It was delicious. I made it for a picnic a year ago and I people still talk about it. That’s a sign of good meal! DthompSan Francisco 10/16/2021i didn't love this. i found the flavor to be way too vinegar-y and rich, and not in a good way. it gave me a bit of a stomach ache. it's definitely better on day 2. i read some other comments and went w/ 3/4 cup oil rather than a cup, which was a perfect amount of oil- however next time i might half the vinegar. do not skimp on the walnuts, basil, or cheese- this really needs it, otherwise, a bit one note. Anonymousnew york7/12/2021Yum! This is a good one. Like others suggested, I cut the amount of oil in half and it was still plenty. I think next time I might use a bit more red onion, but otherwise this was great. Super flavorful! I’m not sure I’d consider it a pasta salad, but it’s definitely a versatile dish. I had it room temperature which was good, and then it was even better cold out of the fridge the next day!JudyJamWashington, DC9/10/2020We just made this and it’s a lovely summer recipe. I’d agree with the other comments saying that it’s too oily, next time I’d either reduce the amount a bit or drain the peppers. Otherwise, it’s very good and I’d definitely make again.AnonymousIthaca, NY9/8/2020I also used way less oil (3TBS) and it was still plenty rich and jammy.\nVermont7/10/2020Made this with cavatappi and feta and pine nuts and blistered baby zucchini rounds and chopped snow peas, basil and parsely. So good! Often pasta salads are bland but this one sings!!Vermont7/10/2020So I just made this and ate it warm because I was impatient. It is totally PACKED with flavor, it's so delicious and rich but in a way that works for summer (if that makes sense lol). I'm sure it won't taste as super-rich once it's cold/room temperature. Per other commenters' recommendations, I removed 1/2 cup of oil, except I just spooned it out of the peppers after they'd cooked and saved for other uses. Can't wait to make this again for a picnic/party and impress everyone there ;)amandoBrooklyn, NY6/28/2020Flavors are great, but man this is way too oily and heavy! Second time I made it, I made a few changes: -1/2 cup of oil (instead of 1 cup) \n- Additional 1/2 cup of basil\n- Additional 1.5 tablespoons of red wine vinegar. \nThat definitely helped with the richness!Anonymous6/13/2020Just made this last night for my boyfriend and I and it seriously was one of the best things we’ve ever tasted!! So many incredible flavours going on, I didn’t want to stop eating it. I would highly recommend using a good quality pasta and ricotta salata as I think that really made the dish. Thank you Molly!! MNDZA4/27/2020I can't believe I haven't reviewed this recipe yet! We love this dish. I first made it this summer before going to a picnic and it was perfect. It was still warm and everyone agreed that it was excellent that way. The next day it was good cold with sandwiches for lunch.  Since then I have made it several times and what I really like about it is how flexible it is. If I don't have every ingredient on hand but have the core ones: the peppers, onions, garlic, nuts, and salty cheese I can make the recipe work and it will still be delicious. AnonymousBaltimore, MD 1/22/2020Ok, the ingredients for this recipe are just crazy, or at least that's what I thought the first time I read it. I gave it a try anyway and it's amazing! So yummy and completely unexpected. The garlic (yes a whole head!) dissolves into the oil, the pickled onions pair perfectly with the almost candied peppers. I've never found ricotta salata, but feta works perfectly. Love, love this recipe!AnonymousEl Salvador12/16/2019This was fantastic!! Would 10/10 make it again this summer AnonymousNew Zealand11/10/2019Omg Molly you nailed this!!! This was amazing. Had a mish mash of noddles, so threw those in and used Asiago instead for the cheese because that’s what I had. Didn’t matter at all. Delicious delicious delicious!!charlottemzimmermanSt. Paul, MN9/2/2019Fantastic recipe! I didn't use enough peppers and rushed cooking them a little bit but it still turned out delicious! I didn't have chiles and subbed feta for ricotta. Enough for leftovers :)funkadelicToronto8/14/2019Explore Bon AppétitPastaSaladBell PepperVegetableRigatoniPasta & NoodlesFresno ChileChileRicotta SalataRicottaCheeseSummerQuickEasyWeeknight MealsMainVegetarianFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Molly Baz"]}