{"id": "3fc48929e373f0d054fb423def210c03", "url": "https://www.bonappetit.com/recipe/grilled-butterflied-chicken-with-lemongrass-sauce", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Grilled Butterflied Chicken With Lemongrass Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueGrilled Butterflied Chicken With Lemongrass SauceBy Yia VangApril 14, 20204.9(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintButterflying or spatchcocking the chicken speeds up the cooking process and helps the meat cook more evenly on the grill. (You can also use skin-on, bone-in parts—just make sure they add up to the same weight.) This recipe is from Union Hmong Kitchen, a regular pop-up restaurant in Minneapolis where chef Yia Vang works his wood-fired magic.Ingredients4 servings Sauce6scallions, thinly sliced3lemongrass stalks, bottom third only, tough outer layers removed, finely chopped12\" piece ginger, peeled, finely chopped2garlic cloves, finely chopped½cup vegetable oil½tsp. Aji-No-Moto umami seasoning (MSG; optional)Kosher saltChicken and assembly2Tbsp. coriander seeds1Tbsp. cumin seeds13½–4-lb. whole chicken, backbone removedKosher salt3Tbsp. vegetable oilPurple Sticky Rice (for serving)Special Equipment:A spice mill or mortar and pestlePreparationSauceStep 1Mix scallions, lemongrass, ginger, and garlic in a medium bowl. Heat oil in a small saucepan over high until hot but not smoking, about 2 minutes. Pour over scallion mixture. Let sit, stirring often to keep aromatics from burning, 5 minutes (scallions will sizzle, turn bright green, and wilt almost immediately). Mix in Aji-No-Moto seasoning (if using) and season with salt.Step 2Do ahead: Sauce can be made 2 days head. Cover and chill.Chicken and assemblyStep 3Toast coriander seeds and cumin seeds in a dry small skillet over medium heat, shaking often, until spices are very fragrant and slightly darkened in color, about 3 minutes. Transfer to a spice mill or mortar and pestle and let cool. Finely grind, then transfer spice mix to a small bowl.Step 4Place chicken, skin side up, on a cutting board. Using your palms, press firmly on breastbone to flatten breast; you may hear a crack. This means you’re doing it right. Set chicken, skin side up, on a large rimmed baking sheet. Season generously on both sides with salt, then sprinkle spice mix all over, getting in every nook and cranny. (You may have a little spice mix left over.) Tuck wings underneath the breast. Chill, uncovered, at least 4 hours and up to 2 days.Step 5Let chicken sit at room temperature 1 hour before grilling. Drizzle with oil and pat all over.Step 6Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Place chicken, skin side down, on grate over indirect heat. Cover grill, placing vent (if your grill has one) over chicken so it draws heat up and over it. Grill until skin is lightly browned, 15–20 minutes. Turn chicken over and cook, still covered, until skin is deep golden brown and crisp and an instant-read thermometer inserted into the thickest part of breast registers 160°, 20–25 minutes. Transfer chicken to a cutting board and let rest at least 15 minutes before carving. Serve with lemongrass sauce and rice.How would you rate Grilled Butterflied Chicken With Lemongrass Sauce?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI've enjoyed all of the Hmong recipes, and this chicken is no different.  Plus the scallion-lemongrass mixture is a fantastic condiment for ramen!MelindaUDetroit MI8/6/2021This was AMAZING!! Had to use pre ground coriander and cumin, but they were new ish bottles so all the flavor was def there. The sauce was sooo good and super addictive, wish I made extra!! I’ve found from experience that spatchcocked chickens cook even better in the oven, so did it that way. Elle CamilleLA8/2/2021100% loved the chicken! I placed the rub both underneath the skin as well as on top of and did this with the salt too and the results were great! \n\nI don’t think I loved the sauce bc of the MSG (which I have nothing against). I just thought that it was a bit much for the delicate flavors of the chicken. The garlic was very strong and I love garlic, so I may try to leave out the MSG and reduce the garlic and maybe try to see if I can make my own version of a sauce.\n\nThe chicken though with the toasted coriander and cumin was superb! Easy to cook as well when you spatchcock it. AnonymousMichigan 9/1/2020This was so good! We used chicken drumsticks instead of a whole chicken, and they were juicy and delicious. Anonymous8/15/2020The chicken and sauce on their own were good, but together were amazing!  Made everything according to directions except:  no MSG, and used dried lemongrass + lemon rind in place of the stalk. Served with simple roasted brussel sprouts and brown/wild rice to not compete with the rest of the dish - perfect!wendys16south lake tahoe6/15/2020This dish is easy & flavorpacked-i'd ladle that sauce everyday on rice or any protein. We only had pre-ground cumin and coriander and didn't have MSG. Still was awesome. Definitely a keeper-make it!chapstickAtlanta, GA6/1/2020This was so delicious. I've never spatchcocked a chicken before, much less grilled a whole chicken, and the results were amazing. I'm not the biggest fan of cumin so I only did a teaspoon along with the coriander and thought it was perfect. I wish I'd had the MSG, but in these times I couldn't get my hands on any. I also couldn't find black sticky rice to make a proper purple sticky rice, so I just made plain sticky rice and it was great anyway. I feel fortunate to have any rice at all, as my local markets have been out for weeks. The lemongrass sauce was so good, and I feel lucky that I had a bunch of lemongrass stashed in my freezer so that I could make this. Next time I will definitely make it with the Aji-No-Moto.lifeis_shortLos Angeles, CA5/21/2020The sauce was incredible. I ended up mixing it in with the rice and made fried rice the next day. 100% doing that on the regular.AnonymousSeattle5/11/2020Delicious! Used a whole cut up chicken instead of butterflied chicken. The sauce is a must. AnonymousTexas5/7/2020So delicious and 100% unique. We make roast chickens every couple weeks, and this was totally different from anything else we've made before. The MSG is definitely essential to the sauce - gave a salty umami flavor without making the whole thing a salt bomb. \nWe forgot to take the chicken out of the fridge in advance, so it took about 90 minutes to cook on indirect heat (instead of the 45 mins in the recipe), but it was still incredibly juicy and tender. Also love that we didn't to blend or food process the sauce. Will definitely be making this again! AnonymousLos Angeles, CA5/5/2020Explore Bon AppétitAsianChickenPoultryLemongrassHerbs & SpicesScallionOnionVegetableGingerSummerMainNut-FreeDairy-FreeGluten-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Yia Vang"]}