{"id": "3fcee6da7155e83985e060e228c8b4ab", "url": "https://www.bonappetit.com/recipe/torched-banana-cake", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "Torched Banana Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTorched Banana CakeBy Devonn FrancisNovember 29, 20214.7(30)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrint“Think of this as banana bread but seriously leveled up. This cake is inspired by the pineapple upside-down cakes my mother always made around the holidays. Here, I replace the pineapple with ripe bananas and finish the top with a glossy, crackling sugar crust that shatters with the back of a spoon. Yes, it requires a kitchen torch to make (a broiler won’t fully melt the sugar and will instead adhere the cake to whatever baking sheet or pan it is on), but that’s a tool well worth adding to your kitchen tool kit. The batter itself makes the most of easy-to-find ingredients, with coconut milk, olive oil, and almond meal bringing extra flavor and rich texture to the party.” —DeVonn Francis Watch DeVonn make this banana cake on our YouTube channel.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronJo Chef Butane Kitchen Torch$38 $32 At Amazon9\" Springform Pan$17 At AmazonCake Tester$3 At AmazonWhisk$10 At AmazonSmall Saucepan$155 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients8–10 servings4Tbsp. unsalted butter, cut into pieces, plus more for pan¼cup (packed; 50 g) light brown sugar1tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided3–4ripe bananas, halved lengthwise1½cups plus 1 Tbsp. (195 g) all-purpose flour⅓cup (35 g) almond meal1½tsp. baking powder1large egg1large egg yolk1cup unsweetened coconut milk½cup extra-virgin olive oil2tsp. vanilla extract1¼cups (250 g) granulated sugar, dividedFlaky sea saltSpecial EquipmentA 9\"-diameter springform pan; a kitchen torchPreparationStep 1Place a rack in middle of oven; preheat to 325°. Generously grease bottom and sides of springform pan with butter. Melt 4 Tbsp. butter in a small saucepan over medium heat until bubbling, about 2 minutes. Add brown sugar and ¼ tsp. Diamond Crystal or Morton kosher salt; cook, stirring constantly, until brown sugar is dissolved and butter is copper colored, about 30 seconds. (It’s okay if mixture doesn’t come together at this point.) Pour caramel into prepared pan.Step 2Carefully arrange bananas, cut side down, in pan, cutting them to fit in an even layer.Whisk together flour, almond meal, baking powder, and remaining ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl. Whisk egg, egg yolk, coconut milk, oil, vanilla, and 1 cup granulated sugar in a large bowl to combine. Add dry ingredients and mix with a rubber spatula until just combined. Pour batter over bananas and gently tap pan on counter to release any air bubbles.Step 3Place pan on a foil-lined rimmed baking sheet and transfer to oven. Bake cake, rotating pan halfway through, until golden brown and a tester inserted into the center comes out clean, 45–60 minutes. Immediately run an offset spatula around edges of pan to loosen cake. Transfer pan to a wire rack and let cake cool in pan 20 minutes; reserve baking sheet.Step 4Invert baking sheet over top of pan, then flip cake over onto baking sheet. Remove ring from pan; carefully lift away pan bottom, running offset spatula between bananas and bottom to release (don’t worry if some of the caramel sticks).Step 5Sprinkle remaining ¼ cup granulated sugar evenly over cake. Using kitchen torch, melt sugar until deep amber. Sprinkle cake with sea salt.How would you rate Torched Banana Cake?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIt was good! We couldnt find coconut milk so I used half full fat yogurt and half milk and it turned out well. Might make again. I ate half of it to myself tonight, so clearly I enjoyed it! TylerNova Scotia1/30/2022Very good flavors and moist cake!  My springform pan leaked and I had to take it out after 10 minutes to line with foil.  I also dont have a torch so I melted the sugar in a saucepan and poured it on top.  I will give it another try and top it with walnuts!SunchaserLaguna Niguel, CA1/3/2022Amazing! loved every bite! and so did my peops. small group -  2022 new year celebration. I tried the small tropical bananas too\n(I  think they're called lady finger bananas) ? it's a smaller banana , about 4 \" compared to conventional bananas - flavor is citrusy, vanilla-ish and sweet.  So liking this AP app, new recipes to test.! And hey reviewers - stop h8ting on those peops that have issues with tech..\nLove and be kind to all. Anonymous1/2/2022Although the video says to let this cake sit a while after torching the top, my experience was that this cake became progressively soggier as it sat.  After 8-9 hours there was a layer of moisture on top and the interior was wet like it was undercooked, even though I checked with a toothpick when it came out of the oven.  If served shortly after allowing it to cool and torching the top, I think this cake has an amazing flavor.  JenniferColorado1/1/2022This cake is delicious. I made it for a birthday party and everyone liked it better than the fancy birthday cake (blush). \n\nI didn’t have a torch yet, so I put the cake under a broiler that had a flame to finish it. I had to hold it close to the flame and watch it very closely, but it worked… OKish. \n\nI just made it again and this time I had a torch… What a huge difference the torch made for Caramelizing the sugar on top. \n\nSome minor tweaks, I used small tropical bananas instead of conventional bananas. I feel like the small tropical bananas have a slightly brighter sweetness, like passionfruit or mango, and I like how tropical bananas hold up to cooking better. However, the first time I tried the recipe I used half conventional and half tropical just so I could experiment. Conventional bananas were still really yummy.\n\nAlso Because I always love to honor my Caribbean roots, I put a table spoon of rum in the Caramel sauce in the beginning.\n\nLastly a note on taste… while I like banana bread OK, I am not a huge banana bread fan. This is nothing like banana bread. It’s a lovely yellow almond cake (like a light Spanish almond cake version), with a tropical leaning buttery Carmel/banana topping. It’s like bananas fosters with ripe plantains, meets almond cake. \n\nNotes on flour - this second version I’ve tried the 1:1 gluten-free flour. I haven’t eaten it yet but it has baked nicely and the crumbs I tasted were yummy. \n\nHope this is a helpful review about cooking this cake. \n\nWould love to know if anyone stored this in the fridge after making the topping or is the fridge condensation softens it?\n\nD2Los Angeles, CA12/30/2021Its embarrassing that you cant even find a relevant review for this recipe because these boomers cant figure out how to print something, or even better they become frustrated with the fact that they are antiquated. AnonymousLong Island, NY12/30/2021The print options works for me. Just a tip if you don’t know: you can “remove” background images in the print settings before you print. This removes the ads. Additionally, you can reduce the size of the overall scale or simply “fit to page” and have it print on all one page. AnonymousJersey City, NJ12/9/2021Hello Jesse - RELAX.  Take a photo with your phone.  Stop living in the 70's.  no one prints anything anymore.  AnonymousNew Mexico12/5/2021What can you substitute for almond meal for added flavor? I have an almond allergy. \nThanks!AnonymousChicago 12/4/2021How about the new Epicurious recipe box - beyond dumb. \nMFBEarth12/4/2021I also hate the print function.  To use two sheets of paper for one fairly simple recipe is absurd - wasteful, inefficient, and unnecessary.  I have to copy, paste, edit, re-format separately for any recipe I might wish to try.  I won't bother to try this recipe because of the time to do all that. I do not take my laptop into the kitchen and work from it and don't assume that everyone will.  Bon Appetit, get your act together or I, too, will cancel my subscription.JesseNew Mexico12/4/2021Yes!!!! The print functions sucks! I can only copy and paste and that too is a hassle, Also another reason why I canceled my subscription is because I couldn't keep a file of my favorite recipes. And TOO MANY pop up ads. :(Anonymous12/4/2021I canceled my subscription because this magazine can’t figure out to have a print option that works. It “works” but this recipe spans 3 pages with extraneous info (ads!) and white space. It’s irritating and I’m going to keep coming here to tell you that because it’s not rocket science and I’ve paid a subscription fee for the past 10+ years. Why can bloggers figure this out and you can’t? AnonymousPortland OR12/4/2021Print function works for me! Haven't made this yet but planning to, sounds delicious, and I always have ripe bananas.AnonymousPort Townsend, WA12/4/2021I so agree on the print function of the new way recipes are put out for us.  I so miss the old way, you could so easily print the recipe. A good cookSpringville, CA12/4/2021Explore Bon AppétitDessertBakingCakeBananaFruitCoconut MilkOther IngredientsAlmond FlourFlourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-29", "author": ["Condé Nast", "Devonn Francis"]}