{"id": "3ff4dca81b5d9742b2e8c696a6d74a1a", "url": "https://www.bonappetit.com/story/tequila-coffee", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Tequila + Coffee: A Cocktail for People Out Later Than They Want to Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTequila + Coffee: A Cocktail for People Out Later Than They Want to BeYou’re out late. You’re getting tired. But you need to keep going. It’s time for a tequila coffee.By Amanda ShapiroMarch 15, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou know when you’re having one of those nights, usually a couple drinks in, and a sort of magic takes over and the momentum starts building, and it’s clear that you’re going to have increasing amounts of fun for the rest of the night and maybe forever? And every decision you make is brilliant and inspired, including putting tequila in your coffee? That’s what happened to me.It was a Saturday, and I was still at an age when going to three parties in a night sounded like a reasonable and totally normal idea. I’d had a great time at the first one (a disco party hosted by the too-cool-for-me guy I’d just started dating) and was en route to the second (a birthday in a basement bar) with aforementioned too-cool guy when I realized I'd made a rookie mistake.As everyone knows, when you’re running the party marathon, the worst thing you can do is let your drinking outpace your partying,  but that’s exactly what I’d done. I’d peaked too early; now I was thinking about bed. Normally I would've ghosted, but the too-cool guy seemed to want to keep hanging out. The stakes were too damn high.There are many ways to stay awake in this world. I usually rely on stress, but when that’s not doing it, I go for the harder stuff. Let me amend that: The legal harder stuff. I walked into a corner bodega and poured a cup of coffee from the diner-style pot in the corner. By the taste and texture, I’d guess it had been there a day, maybe two.I still can’t remember why I had a tiny bottle of tequila on me. Tiny bottles of liquor are not things I tend to carry around like Chapstick. All I know is that one minute I was putting shelf-stable creamer in my coffee under the harsh store lights, and the next minute I was standing curbside, pouring the tequila in.It’s been years, but I remember exactly how it tasted: Creamy, bracing, and not at all like tequila. Somehow, the coffee completely masked the liquor, and the liquor completely masked the burned coffee, and all that was left was a gentle, warming, sweetness and a waft of booze on the nose. It was so delicious, so easy to drink, and total rocket fuel.There’s a lot of unscientific, totally anecdotal stuff online about how tequila is an “upper.” I’m not saying I believe any of that, but this drink gave me such a smooth, no-jitters lift that I made it to all the parties and chaperoned a friend home to bed.I’ve seen variations of tequila and coffee on bar menus listed as “Mexican coffee” with kahlua, sugar, whipped cream. You could certainly do it with your favorite pour-over blend and that black-label Espolón. But let me assure you that you don’t need any of that stuff. Even the creamer is optional (though it’s helpful if you’re masking old-coffee taste). Tequila coffee is about two things only, in whatever proportions feel right. It’s a drink for night owls and party kids and people without budgets for 5-ingredient cocktails. It’s for those years when it feels like any random Saturday could be the best night of your life.Or try this caffeinated cocktail:Explore Bon AppétitTequilaCoffeeCocktailTrendsRead MorecultureThe Cocktail Formula That You Need to Memorize NowBy Chris MoroccoPhotography by Ted CavanaughRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Amanda Shapiro"]}