{"id": "3ffb8f381a14d053c41c29645a071fbb", "url": "https://www.bonappetit.com/story/takenaka-bento-box", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "This Bento Lunchbox Finally Convinced Me to Bring Leftovers to Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Bento Lunchbox Finally Convinced Me to Bring Leftovers to WorkI thought I hated packing lunch, but maybe I just hated ugly lunchboxes.By Elyse InamineAugust 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Rebecca JurkevichFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Let me share my shameful tale: In the Before Times, despite being someone who works at a food magazine, I never brought my own lunch to the office. At home, I mostly cooked to satisfy my cravings, so I rarely had leftovers and didn’t meal-plan. Come lunchtime, I resorted to picking up a very overdressed salad from the nearest bougie fast-casual chain (sad) or prowling the test kitchen for room-temp leftovers from recipe developing and cross-testing (less sad).But now I’m back in the office a few times a week, and I’m bringing my own lunch. Not because I finally figured out how to cook at scale for myself, but because of VANITY. One of my few pandemic purchases was an absolutely delightful bento lunchbox from Takenaka, a Japanese company that’s nearly 100 years old. The stackable rectangular compartments are made of sturdy, recycled PET (polyethylene terephthalate) that are safe for both dishwashers and, crucially, microwaves. The bottom container comes with a grippy lid, which keeps even the sauciest leftovers from leaking all over my workbag. I snapped up this red-and-bubble-gum-pink bento with a matching furoshiki, a limited-edition (and sold-out) collab with Poketo, but you can choose from a variety of pretty hues, from raspberry to pale mint green.Takenaka Bento Nibble Box$30 at AmazonThe moment I saw Takenaka’s bentos on Instagram, I imagined how I would pack the bottom with white rice and the top with Christina Chaey’s dubu jorim, which I make every week at this point. Or maybe Andy Baraghani’s marinated lentils on the bottom and a few oranges and cashews for snacking later on top. Suddenly, I was...meal-planning. So, apologies to all the salad spots within 100 feet of my office—I’ve moved on. I’m good. My sunny little bento lunchbox is both form and function, and it makes bringing my lunch a delight rather than a chore. You eat with your eyes, my mom always says. Vanity runs in the family, I guess.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Elyse Inamine"]}