{"id": "400cbde3dead470fb9c21188ac0ff947", "url": "https://www.bonappetit.com/recipe/shrimp-and-ramp-scampi", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Shrimp and Ramp Scampi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueShrimp Ramp-yBy Andy BaraghaniMarch 17, 20205.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThe name says it all. Shrimp with a garlicky, pungent, buttery scampi sauce. The combination of garlic and ramps may seem like overkill, but we promise it’s not. The garlic will mellow as it cooks while the ramps stay pungent. We tried it without the garlic and it just wasn’t as good. Sometimes more is more.Ingredients4 servings3Tbsp. extra-virgin olive oil, plus more for drizzling1bunch ramps (about 6 oz.), bulbs and greens separated, bulbs halved lengthwise, greens torn into 2\"–3\" pieces3garlic cloves, thinly sliced½tsp. mild red pepper flakes (such as Maras, Urfa, or Aleppo-style), plus more for serving½cup dry white wine1¼lb. large shrimp, peeled, deveined, preferably tails left on4Tbsp. unsalted butterKosher salt½lemonPreparationStep 1Combine 3 Tbsp. oil and ramp bulbs in a large skillet. Set over medium heat and cook, tossing occasionally, until bulbs are softened but have not taken on any color, 6–8 minutes. Add garlic and ½ tsp. mild red pepper flakes and cook, tossing occasionally, until garlic is softened, about 3 minutes. Add wine and increase heat to medium-high. Let cook, stirring occasionally, until wine is reduced by half, about 2 minutes. Add ramp greens, shrimp, and butter to pan. Season with salt and cook, tossing occasionally, until ramp greens are wilted, shrimp turn pink, and butter is melted, about 3 minutes. Remove skillet from heat. Finely grate zest from lemon half over shrimp, then squeeze in juice.Step 2Transfer shrimp to a platter. Sprinkle with more mild red pepper flakes and drizzle with plenty of oil.How would you rate Shrimp Ramp-y?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleFor Sandi: Part of the answer is in the response to the person in Australia.  Ramps grow wild, and when gathered, take 5-7 years to regrow, so they are considered a threatened or endangered  plant and Québec’s prohibition is to protect them.AnonymousCanada1/26/2022Can’t make this as I believe it is illegal to sell ramps in Quebec.  I’m not sure if you are allowed to dig them up if you find them.  Why????\nSandi KramerMontreal, Quebec Canada3/17/2021This was fantastic. I don't think I will ever make scampi again without ramps. I too doubled the recipe, since I'm lucky enough to live somewhere where I can go dig as many as I want for free.\nFor the person from Australia, I bet they would grow there, however, there really is no substitute that I know of - the flavor is that unique. Perhaps you could get someone to send you seeds or bulbs. They do take a *long* time to mature, but they are an easy, set it and forget it kind of plant.SarafinaThe hills of PA5/17/2020This is delicious! Doubled the ramps and would definitely recommend you do so too. Definitely one of the best things I've made in quarantine and I've been no stranger to Bon Appétit! AnonymousBoston, MA5/3/2020Quick and delicious dinner! I was lucky enough to get five bunches of ramps at the farmers market and this was the first recipe I made. The Aleppo pepper was a nice touch especially since I almost always use Calabrian chili flakes.AnonymousNew York4/29/2020Good god this way delicious. I was just lamenting the fact that I wouldn’t be able to have a single ramp dish this year because of the quarantine, but then a local hero started selling some out of his driveway after a foraging trip to North Carolina.\n\nI’d recommend serving this with focaccia or another dipping vessel to sop up the delicious sauce.lauren trudellBirmingham, AL4/27/2020Ramps are not a thing we have in Australia – I'd never heard of it before and after some googling it seems they only grow in North America / Canada! This sounds delish though – what could I substitute ramps for?LaraCBMelbourne, Australia4/14/2020So good! I made it with two bunches of ramps because I'm LIVIN' LARGE. Then I tossed with spaghetti, for the same reason. alexbeggsBon Appétit 4/8/2020Explore Bon AppétitShrimpShellfishSeafoodRampsOnionVegetableGarlicSpringQuickEasyWeeknight MealsOne-Pot MealsMainGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Andy Baraghani"]}