{"id": "4017a64d6647e679bd7d89b58fea2d75", "url": "https://www.bonappetit.com/recipe/turmeric-salmon-with-coconut-crisp", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Salmon With Coconut Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueTurmeric Salmon With Coconut CrispBy Andy BaraghaniDecember 26, 20194.8(75)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe coconut crisp brings texture and heat to this simple stewy dish. Make a double or triple batch and use it as a topping for savory oatmeal, hearty soups, or roasted winter vegetables. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings5Tbsp. extra-virgin olive oil, divided2bunches Swiss chard, ribs and stems removed and finely chopped, leaves coarsely chopped (keep separate)1large shallot, thinly sliced13\" piece ginger, peeled, thinly sliced lengthwiseKosher salt½tsp. ground turmeric11½-lb. skinless salmon fillet, preferably center cut3garlic cloves, thinly sliced½serrano chile, thinly sliced½cup unsweetened coconut flakesFreshly ground black pepperPreparationStep 1Preheat oven to 300°. Heat 2 Tbsp. oil in a large ovenproof skillet over medium-high. Add Swiss chard ribs and stems, shallot, and ginger and cook, stirring occasionally, until shallot is softened but not browned, about 3 minutes. Add Swiss chard leaves and cook, stirring, until partly wilted, about 3 minutes. Remove from heat and season with salt.Step 2Combine 2 Tbsp. oil and turmeric in a small bowl. Place salmon, flat side down, on top of greens in skillet. Season salmon with salt and coat with turmeric oil. Transfer to oven and bake until fillet is just opaque in the center and flakes easily and greens are tender, 25–30 minutes.Step 3Meanwhile, heat remaining 1 Tbsp. oil in a small skillet over medium. Add garlic, chile, and coconut flakes and cook, stirring often, until garlic and coconut turn golden, about 5 minutes. Transfer coconut crisp to a small bowl and season lightly with salt.Step 4Season fish and greens with pepper; serve with coconut crisp for topping.How would you rate Turmeric Salmon With Coconut Crisp?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleQuite surprisingly delicious.  Cooking the salmon low and slow on a bed of greens kept it moist and meaty. The topping is meaty too, again surprisingly, not sweet but nicely savory.  I had to add some book Choy greens because I only had one bunch of Swiss chard but they blended in beautifully. My only complaint is the burping I am destined to endure because of the roasted garlic.  That said, worth it!EssieDee Stamford ct1/18/2022This was quite delicious, different and easy. The coconut topping is worth trying. A perfect winter dish when you want something that says “restaurant” but you want to stay in your warm house.KathyDSaratoga, CA12/15/2021Absolutely fantastic!  I've made this multiple times for myself and for company.  It makes a great presentation, has lots of flavor, texture with the crunchy coconut and umami with the turmeric/ginger combo.  Highly recommend this recipe.  Fun to watch Andy make it too!Anonymous9549212/2/2021This is a fantastic dish. I made some minor changes, like the type of greens and added some cherry tomatoes because they were in season. Even my seven year old son, without the coconut crisp (he is very picky), loved this dish. He said it is the best salmon he has had. Way to go Andy!C.W.Milton, WV7/31/2021I found this recipe right before the pandemic and it has been our go-to comfort food for the past year.  The coconut crisp is also versatile and we use it to garnish other proteins.  I would appreciate if nutrition information could be added along with the recipes.NancyBradenton, FL4/30/2021Fabulous recipe, to the point where I was making it at least once a week. I cooked the garlic low and slow, stirring in the chili and coconut and finishing the crisp in the oven for the last 5 minutes of cooking the salmon. Rainbow chard, or at least some red chard creates a lovely plate. DianeBoston, MA12/5/2020The spicy coconut crisp is the bomb! This dish presented beautifully and was excellent and easy to prepare. I’ll use less ginger next time because I found it a bit overpowering. I agree that it’s better to keep spice simple when cooking salmon. The turmeric and oil was good but didn’t mask the natural flavor of the fish. Watch the cooking time because it may vary significantly depending on the thickness of your fish (I started checking mine at 15 minutes and it was done in 20) I found the salmon and greens was adequate for a satisfying and healthy meal. Will definitely make this again!Dan Albuquerque 11/18/2020Made this again and putting the garlic in at the end really helps the crisp.  Also, use as little oil in the crisp as you think you can get away with, needs to cook the coconut but not end oily.  Finally, really watch the salmon cooking time, I like mine just cooked, the edge of not-raw.  The full 25-30 minutes was too much, maybe I have thinner steaks.  I pulled it out around 17 minutes and it was done.  This recipe stays on the A-list for us!Pjay99Clifton, VA11/17/2020I made this the other night and it was great!  I would second the note that when cooking the crisp, put the garlic in at the end so it does not burn.  Making it again this Friday!  Pjay99Clifton, VA11/12/2020Super Dank salmon! My boyfriend and I decided to make this because we wanted to try something new. This is our favorite salmon recipe hands down. Definitely try it and it’s super easy to make too!! romeeli11Northern Virginia 9/10/2020I was directed her by a NYT article about Dawn Davis.  Apparently this is her current favourite recipe. I’m going to make it tomorrow night.  Video was really helpful.  Andy is very engaging...although I did find the unkempt hair on the  chefs In the background to be particularly disturbing.    Oono8/28/2020Made this last night for guests and it was a hit! Great recipe! Was wondering how long you would say the Coconut Chile flake mix would be good to keep and store, I made way too much and not sure how long it will stay fresh or fine, any thoughts? Thank you ! CKLA 8/1/2020This was phenomenal. Next time, when making the coconut crisp, I will add the garlic last to avoid burning. Only a couple pieces burned, but it creates such an acrid flavor. Can’t wait to make this again! Totally adaptable as other reviewers mention; it’s a great template and would work well with other combinations of greens/seafood. Thanks, Andy!AnonymousMarblehead, MA6/8/2020Really really good! I used trout + kale because it's what the store had. I think this is great template of a recipe--use any fish, use any green--it will turn out great! The ginger is the real star of the dish here.AnonymousChicago6/6/2020The coconut crisp and greens are totally delicious, but the cook time seems way too long. I took the fish out at 25 mins and it was so overcooked it was almost powdery. Very sad to have wasted an expensive piece of salmon! I'd try this again, but check it around 18-19 minutes. rmozToronto5/25/2020Explore Bon AppétitSalmonFishSeafoodTurmericHerbs & SpicesLeafy GreensVegetableCoconutFruitSwiss ChardMainDairy-FreeGluten-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Andy Baraghani"]}