{"id": "401aca66e84caaa1b770e0da2a43d7f6", "url": "https://www.bonappetit.com/recipe/cheesy-charred-green-beans", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Cheesy Charred Green Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCheesy Charred Green BeansBy Rachel GurjarJuly 6, 20214.4(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintPaneer holds up well to the high heat of the grill, forming a charred layer on the outside and staying perfectly soft on the inside without oozing through the grate—another reason why it is so popular in tandoor cooking. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonStainless Steel Quarter Sheet Wire Rack$17 $14 At AmazonHeat Resistant Leather Gloves$22 At AmazonStainless-Steel Fish Spatula$9 At AmazonIngredients4 ServingsSpice rub1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1Tbsp. garlic powder1Tbsp. onion powder1Tbsp. paprika2tsp. ground cumin½tsp. cayenne pepper½tsp. sugarBeans and assemblyJuice of 1 lemon4Tbsp. extra-virgin olive oil, divided1lb. mixed summer beans (Chinese long, green, wax, or purple), trimmed26-oz. slabs paneerCoarsely chopped unsalted roasted pistachios (for serving)PreparationSpice rubStep 1Mix salt, garlic powder, onion powder, paprika, cumin, cayenne, and sugar in a small bowl to combine.Do ahead: Spice rub can be made 1 month ahead. Store airtight at room temperature.Beans and assemblyStep 2Whisk lemon juice, 1 Tbsp. oil, and 1 Tbsp. spice rub in a large bowl to combine. Set dressing aside.Step 3Place beans in a large bowl, drizzle 2 Tbsp. oil over, and toss to coat. Sprinkle with 1 Tbsp. plus 1½ tsp. spice rub and toss again to coat.Step 4Place paneer on a plate, drizzle with remaining 1 Tbsp. oil, and rub all over with your hands to coat. Sprinkle 1 Tbsp. spice rub over paneer and gently toss to coat evenly.Step 5Prepare a grill for medium heat. Grill paneer, turning halfway through, until grill marks are golden brown, 6–8 minutes total. Using a metal spatula, transfer to a cutting board and slice ¼\" thick with a serrated knife. Transfer paneer to a platter.Step 6Place a small grilling rack on grate and heat 5 minutes. Arrange beans in a single layer on rack and grill, turning occasionally, until tender and blistered in spots, about 3 minutes per side for runner beans and about 5 minutes for Chinese long beans. Transfer beans to platter with paneer.Step 7Drizzle beans and paneer with reserved dressing; top with pistachios.How would you rate Cheesy Charred Green Beans?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis recipe wasn't my favorite. I love paneer, and I love green beans. And I love grilling those things. But the vinaigrette just wasn't punchy enough to carry the dish as the primary flavor component. Everything pretty much just tasted like garlic powder. And unfortunately, the recipe has you make way more spice rub than you need, so I just wasted a ton of spices on a blend that's going to sit in the back of my spice cabinet for years. Search the recipe \"paneer with burst cherry tomato sauce\" on BA and replace the peas with green beans—so much better than this one!lasagnaqueenPortland, Oregon9/15/2021Step 3:\nSprinkle with 1 Tbsp. plus 1½ tsp. spice rub and toss again to coat.\nWhat is the 1 Tbsp.? Spice rub, making a total of 2-1/2 Tbsp.?TexasQEDSan Antonio, Texas7/28/2021This was GREAT! They ran out of paneer at my local so just used haloumi and served it with BAs' buttered tomato rice! ScarlettSydney, Australia 7/12/2021Explore Bon AppétitGreen BeanVegetableChinese Long BeanPaneerCheeseEasySideGluten-FreeVegetarianGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}