{"id": "401e74f6904b811861b9eeef3d7b8908", "url": "https://www.bonappetit.com/story/the-ultimate-italian-hoagie-meat", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "The Best Meat to Put on an Italian Hoagie  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTHIS is the Ultimate Italian Hoagie Meat LineupIt's called the Ideal Meat Formula. Look it up.By Alex DelanyJuly 3, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI think about sandwiches a lot. Definitely more than the average human and maybe even more than the average sandwich enthusiast. The layers of sliced meat! The shredded lettuce! The spreads! The cheese options! The thinly sliced onions and the peak-season tomatoes and the fresh black pepper that gets cracked on top! The architecture! The portability! Pickles! Oh, the beauty and the wonder! What a fantastic format! What a magnificent way to eat a bunch of foods at the same time!But my enthusiasm isn’t all recreational. I’ve also put thought and time into the topic of sandwiches for the serious advancement of the category. I’m here to help sandwiches and sandwich eaters alike. And that’s why after all these years of loving and appreciating and studying sandwiches, I am here to deliver you with a seriously profound piece of sandwich information, something I call the Ideal Meat Formula.The IMF (not to be confused with the International Monetary Fund) is a combination of meats that makes for the best hoagie (or sub or hero or grinder or whatever you choose to call it). It is best applied to the Italian hoagie, but it can be utilized in any and all sandwiches containing meat.The IMF states that in order to achieve the ultimate variety of texture and flavor on a sandwich, you need to incorporate one cooked, one cured, and one emulsified meat. Allow me to explain the distinctions.A cooked meat is something that has been roasted, steamed, or baked. Think of ham (prosciutto cotto), turkey, or roast beef. These meats provide substantial texture and heft to a sandwich.A cured meat is a meat that has been preserved by salting, smoking, aging, or brining. This meat category includes (but is not limited to) soppressata, prosciutto, speck, capicola, and any kind of salami. Cured meats will bring a saltiness and, usually, a tang to the flavor of a sandwich. Texturally, they supply some chew.And finally, there are emulsified meats. These proteins are made by mixing a meat slurry (I know, yuck) with spices and chopped fat. Prime examples of emulsified meats include bologna and mortadella. The main purpose of this meat category is to offer creamy richness.Create whatever type of combination you’d like for your sandwich, just so long as you use one meat from all three categories. Ham, soppressata, and mortadella? Perfect. Turkey, speck, and bologna? Not quite as traditional, but I like your ingenuity. The point is, if you want a sandwich with the full range of flavor and texture, you have to abide by the IMF. Anything else will be inferior. And if you’re anything like me, that just won’t do.Because the search for a better sandwich isn't just a hobby. It’s a way of life.And here's a recipe, in case you want to get involved immediately:Big Ass Beach HoagieYour answer to the age-old question \"What can I make ahead of time and throw in my bag to feed myself (and, okay, my friends) when we finally make it to the beach/park/festival/fireworks?\"View RecipeExplore Bon AppétitBasicallySandwichMeatHamSalamiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Alex Delany"]}