{"id": "4025135be12a5af4ba8965f872fcc598", "url": "https://www.bonappetit.com/story/cook-your-vegetables-forever", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "The Magic of Overcooked Vegetables | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Case for Cooking Vegetables Way Past the Point of Just TenderWhere others see overcooked vegetables I see perfectly cooked vegetables.By Megan LittMarch 9, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat BoytsovaFacebookTwitterEmailThere is a time and a place for snappy green beans, for just-tender broccoli, for crunchy cabbage slaw, and for bitter greens that get a quick blanch and a flash in hot garlic oil. But we underestimate vegetables cooked into oblivion. I’m talking about vegetables braised so long that they surrender their texture and color to yield ugly but totally luxurious magic. What if we stopped thinking of vegetables cooked to the state of mush as overcooked and started thinking of them as well cooked?I have my boyfriend’s Southern Italian family to thank for teaching me to cook the hell out of vegetables, and broccoli rabe in particular. In their region of Salento, it’s traditional to cook the indigenous cime di rapa in abundant olive oil so that it moves well past vibrant green and al dente and into army-green, fall-apart-silky territory. The dish is actually referred to as rape ’nfucate or “drowned broccoli rabe,” and since I’ve started drowning mine, I’ve never looked back.The method is simple. In a large pot or Dutch oven, sizzle some whole smashed garlic cloves and crushed red pepper flakes in A LOT of olive oil (like, almost ½ cup olive oil per pound of broccoli rabe). When the garlic is fragrant and just beginning to brown, add rinsed and roughly chopped broccoli rabe and cover the pot. (You’ll want to add it in one decisive drop and cover it quickly to avoid oil splatter.) Lower the heat to medium-low, let the pot quiet down for a moment, and then add a hefty pinch of salt and a splash of water. Stir to combine, return the lid, and let cook. Stir the greens every 20 minutes or so, adding a splash of water if the pot dries out, and braise until even the stems are silky and the florets are falling apart, an hour at the very least. Finish with a splash of vinegar (white wine or red wine, white balsamic, and distilled all work well), a drizzle of fresh olive oil, and salt to taste.There is nothing glamorous about this preparation—the final product is decidedly soft in texture and dull in color. But what it lacks in beauty it makes up for in flavor—the broccoli rabe practically melts into a luscious condiment that is simultaneously punchy, intensely savory, and slightly sweet. Feel free to play around with the first step: While the garlic sizzles, you can add anchovies, sliced fresh chiles, spices like fennel seeds, cured pork products, or strips of lemon zest. The finished product is super versatile too: Enjoy it hot or at room temperature as a side dish, tuck it into sandwiches, or toss with short pasta.If you’re not a fan of broccoli rabe’s bitter bite, I feel sorry for you because it’s one of my very favorite vegetables, but also, fear not—it’s hard to think of a green vegetable that doesn’t thrive when cooked this way. Green beans, kale, broccoli, Swiss chard, and cabbage are all excellent candidates (though take note that the heartier brassicas like broccoli and cabbage may need to braise for up to two hours to reach overcooked perfection). Whoever decided “overcooked” was a bad thing was sorely mistaken—well cooked vegetables forever!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-09", "author": ["Condé Nast", "Megan Litt"]}