{"id": "402b73f8fbac834ee2bf378dfcfbef6d", "url": "https://www.bonappetit.com/story/zojirushi-electric-griddle", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "My Electric Griddle Is the Best Dinner Party Appliance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Electric Griddle Is the Best ’90s ThrowbackUntil I can have parties again, this griddle is how I’m throwing down.By Hana AsbrinkMarch 25, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There are few ’90s relics that hold their weight in 2021. Fanny packs and Viennetta make the cut, and I’m here to add one more for your consideration: the electric griddle.Growing up, if I saw my mom covering the dining table with newspaper, I knew something good and messy was coming. I knew the next meal would be cooked on one of our trusty electric appliances: the electric hot pot, or—my favorite—the electric griddle.While the hot pot was used primarily for soup-based dishes like shabu shabu or sukiyaki, the griddle tackled everything from galbi and bulgogi to stir-fried spicy dakgalbi, bokkeumbap to gyoza. The griddle held greater promise for all of my favorite dishes, so when my mother ultimately passed it down to me as a young adult, I treated it like the family heirloom it was.The vintage Zojirushi electric griddle has served me well into adulthood. When I was cramped for space in my first studio apartment, it acted as a central point for my gatherings. When I moved into my current apartment, I used an extension cord to bring the griddle outside onto our sliver of a balcony. It recreated the convivial atmosphere of a Korean BBQ restaurant (minus the burning hot coals), forcing my guests to scoot closer together to both cook and eat their meal.While the griddle of my childhood was still going strong in the early aughts and 2010s, I started noticing small details that took it off its A-game. The dial used to regulate the heat (which, incidentally, only showed the temperature in Celsius) wasn't as exacting as it was in the past, creating more opportunity for hot spots, even at its lowest setting. I also started realizing that having the hot plate embedded within its non-removable frame made washing it tricky in my small kitchen sink.Alas, even good things have room for improvement, and while my old griddle was still rockin' on after all the years, I decided to retire it and treat myself to an upgrade. The newer Zojirushi Gourmet Sizzler Electric Griddle retains everything I loved about my retro griddle (large cooking plate, lid) with some obvious technological and material advancements made over the last 30 or so years.Instead of a round shape, the current model is oblong, making storage more convenient. The nonstick cooking surface is enhanced with a triple titanium and ceramic coating, as well as a slightly raised diamond pattern, which helps keep food from sticking. The biggest upside of the newer model for me is that it’s much easier (and safer) to clean as both the cooking plate and body guard (the frame in which the cooking plate rests) can be fully immersed in water. The temperature control dial is still easy to use and now denotes degrees in Fahrenheit. There’s also a compatible takoyaki plate accessory, which I’m sure would take any dinner party’s fun level to 11.Whether it’s yakisoba, okonomiyaki, or weekend pancakes and bacon on the menu, this Zojirushi griddle turns everyday cooking into a joyful affair—something we can all use some more of these days.Zojirushi Electric Griddle$116 at AmazonExplore Bon AppétitShoppingHighly RecommendToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-25", "author": ["Condé Nast", "Hana Asbrink"]}