{"id": "403c07e5377548ca52d3b30960037ca8", "url": "https://www.bonappetit.com/story/chelsey-luger", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Chelsey Luger Is Giving Ancestral Native American Practices a 2019 Reboot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleChelsey Luger Is Giving Ancestral Native American Practices a 2019 Reboot\"Holistic wellness has been part of our culture for thousands of years.\"By Priya KrishnaJanuary 17, 2019FacebookTwitterEmailPhotograph by Thosh CollinsFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.Chelsey Luger was working as a personal trainer when she realized that a lot of the practices that the health world was preaching were similar to things she’d grown up with, but no one was addressing that. Meanwhile, much of the Native-American population has suffered from health issues like diabetes, alcoholism, and drug use, resulting from forced displacement and poverty. These challenges turned into stereotypes, and many Native Americans fell out of touch with indigenous wellness practices.“We wanted to reclaim our power, health, and food sovereignty, because holistic wellness has been part of our culture for thousands of years,” says Chelsey Luger, who’s of Ojibwe and Lakota descent and grew up in North Dakota, spending parts of her childhood on a reservation surrounded by the holistic learnings of Native-American culture. She founded Well for Culture, a company devoted to helping the next generation of Native Americans rediscover the wellness practices of their ancestors.Well For Culture is a decidedly millennial brand, a hub for the people who are defining the next era of their tribes. The website features short, sleek workouts that take place in “Earth Gym” (a.k.a. outside), recipes using indigenous ingredients (think tepary bean hummus), and gorgeous photography by co-founder Thosh Collins. There are Facebook Live sessions about ancestral food systems, and the Instagram touts colorful bowls and stunning shots in nature. “We want to communicate the wellness message in a fun and exciting way,” Luger explains.Ultimately, the goal is to make traditional wellness practices feel accessible to young people (not just young Native Americans) in today’s world. Not everyone can harvest and hunt, “but you can follow certain ideals,” Luger says, like buying organic and local and showing gratitude toward your food. And while the company is only three years old, it is already gaining traction among young people and enhancing the understanding of Native-American culture’s influence on the wellness world: Luger and Collins have run countless workshops for tribes, traveled to colleges across the country to talk about their methods, and partnered with Nike to train employees on indigenous fitness routines.“These practices have always been who we are,” Luger says. “It comes down to the future generations.”Explore Bon AppétitThe Healthyish 22HealthyishNative AmericanprofileRead MoreLifestyleFrom Acorn Bread to Chia Cake, This New Cafe Serves Only Indigenous FoodsBy Flora TsapovskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Priya Krishna"]}