{"id": "40437d29de0393f0b1c6e6e5c3375cd0", "url": "https://www.bonappetit.com/recipe/grilled-corn-salad-with-hot-honey-lime-dressing", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Corn Salad with Hot Honey-Lime Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Corn Salad with Hot Honey–Lime DressingBy Bryan FurmanMay 22, 20184.9(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintBright and light, this grilled corn salad with avocado will go with everything else at your summer barbecue. This recipe is from B’s Cracklin’ BBQ in Savannah, GA. Learn more about pitmaster Bryan Furman here.Ingredients8 servings 3ears of corn, husked2Tbsp. unsalted butter, melted1½tsp. kosher salt, plus moreFreshly ground black pepper3Tbsp. fresh lime juice2Tbsp. honey1½tsp. Sriracha1tsp. granulated garlic or garlic powder1½avocados, cut into ¾\" pieces1serrano chile, thinly sliced½cup cilantro leaves with tender stemsPreparationStep 1Prepare a grill for medium-high heat. Brush ears of corn with butter; season with salt and pepper. Grill, turning occasionally, until kernels are very tender and charred in spots, 10–12 minutes. Let cool slightly, then cut kernels from cobs.Step 2Meanwhile, whisk lime juice, honey, Sriracha, granulated garlic, and 1½ tsp. salt in a large bowl to combine. Add corn, avocados, chile, and cilantro to vinaigrette and toss to combine; season with salt and pepper. Cover with plastic wrap, pressing in direct contact with salad to prevent avocados from turning brown. Chill at least 2 hours.Step 3Do Ahead: Salad can be made 1 day ahead. Keep chilled.How would you rate Grilled Corn Salad with Hot Honey–Lime Dressing?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleThis recipe is so easy, delicious and tasty! I made it for dinner last night and didn't give it time to chill, so I found it needed a little extra dressing but it was still easy and delicious! We ate heaping portions of this salad with flatbread on the side and it was a great summer dinner.MadisonToronto, Canada9/16/2021This is one of the best BA recipes that I've made, and that's sayin' something! Such a wonderful mix of ingredients that everybody just  loved. The only two changes I made were seeding the serrano as the one I chose ended up being super hot, and substituting Adobe Milling Chipotle-Habanero sauce for the Sriracha. This is definitely going on at least a monthly rotation. Thank you, Bryan!!John M.Colorado9/5/2021This recipe is a winner 100% of the time. It's the perfect mix of fresh, spicy, sweet, creamy and crunchy. Everyone loves it. Kim LCSan Diego, CA9/3/2021I have probably made this 10 times, can't believe I've never left a review. This is SO GOOD. It's my go-to thing to bring to a BBQ, I usually bring a bag of those like scoop-style tortilla chips to serve it with. Every time people rave about it and ask for the recipe. Favorite summer thing to eat!!kmarxmarxchicago, il5/31/2021I have made this recipe twice in three days since I found it. THANKS FOR THE KEEPAH!\n\nI’ve made a few other corn salad recipes and this one makes them taste like garbage. \n\nI used seven ears of corn, grilled them right in the husk without butter (soaked in water for ten minutes first) and grilled two jalapeños right at the end of the corn time (20 mins)\n\nThe flavor of the dressing is SO GOOD! I doubled that, as well, because so much corn. I wanted it to be a little creamier so I added some mayo and sour cream to the dressing and whisked it all up. Instead of dried garlic I used minced fresh from the garden with the cilantro. \n\nI’ll be making this every summer for the rest of my life. Jackie PIpswich, MA7/28/2020Thank you Bryan Furman & Cracklings B’s BBQ for sharing this recipe with Bon Appétit! Hands down the best dish at the bbq - even the picky eaters reached for seconds. I made with jalapeños since they were fresh. Possibly the best use for summertime corn on the cob...AnonymousRenton, WA7/4/2020Delicious and bright summer salad! Grilling the corn provides a deep flavor balanced with the lime and honey. I used a poblano pepper and grilled it too. This recipe is a keeper.AnonymousNewport, PA6/21/2020Wow this is really good. Made it today and served it tonight with fish. Only sub was that I could not get a serrano chile so used a jalapeño (which has less heat.) Absolutely delicious, a great addition for a summer meal. Washington DC5/30/2020HECK YA!! Just made this salad and it’s everything I wanted and more!!! Perfect balance of sweet and spicy 🌶 AnonymousAustin, TX 5/26/2020This recipe absolutely slaps! I don't use the butter and due to living in a condo just char the corn on our gas burners. It's absolutely a star on its own or as a summer side. I wait for corn to show up at the farmers market to make this salad.AnonymousCalifornia5/19/2020This turned out amazing. Easy to sub out whatever spicy peppers or hot sauce you have on hand. Fresh, tangy and an excellent texture.ArpattersonNew Zealand1/9/2020This is absolutely phenomenal!  So delicious, but I used a jalapeño because I had one and I used Tabasco (don’t like sriracha)!  Taking this to a birthday party dinner. The menu is ribs and pulled pork. Thanks for this find of a recipe. AnonymousAlabama 9/7/2019Easy to make and SO DELICIOUS. I timed my grilling wrong so ended up eating this as a hot salad, but I have no complaints. It’s just as good cold the next day too. Can’t wait to make this all summer. AnonymousBoston, MA7/8/2019So easy. SO GREAT.\nUsed this as a side for some beer braised short rib tacos.\nIt was nice to have something acidic and pretty light to go with some seriously rich tacos. \nI want to be eating it all again, RIGHT. NOW.AnonymousDetroit, MI7/1/2019This recipe is a great find!  Simple and delicious.  I suggest starting out with much less salt and see what you think.  I'm a fan of salt, but the recipe as written is way too salty for me.AnonymousNewport Beach, California6/28/2019Explore Bon AppétitSaladCornVegetableLimeCitrusFruitSerrano ChileChileSummerEasySideGluten-FreeNut-FreeVegetarianHealthyishGrillingFourth Of JulyMemorial DayLabor DayJuneteenthLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}