{"id": "4055011b2fdba6a2efbf67211e2c8142", "url": "https://www.bonappetit.com/story/staff-opinions-highly-recommend", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The Bon Appétit Staff Is Highly Opinionated | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe BA Staff Is Highly OpinionatedAnd these are the things they highly recommend.By Adam RapoportMay 14, 2019FacebookTwitterEmailPhotograph by Dylan + JeniFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A bunch of us were out west last week for our annual Vegas Uncork’d by Bon Appétit food festival and by the time I woke up Friday morning, ordered my room-service coffee (hot whole milk on side, please), and turned on SportsCenter, Alex Delany was already long gone.I know this because Delany, like so many staffers at BA, broadcasts his every eating adventure on his Instagram account. And it is this intrepid, always-be-sharing spirit that fuels our latest digital series, Highly Recommend.Like some Ron Burgundy Channel 4 News Team feature, wherever our editors go, we take you there! Like, literally.Want this letter before it hits the website? Sign up for our newsletter!Isn’t that long list of wines at The Ten Bells romantic?\nPhoto by Charles BillotEvery weekday, another Highly Recommend post drops on bonappetit.com. It could be our social media director Rachel Karten tipping you off to the best first-date spot in New York City (hint: it features A+ lighting, plenty of natural wine, and optional food). Or maybe it’s colleague Christina Chaey, who didn’t know she loved pie until she loved the chocolate chess pie at Fiona in West Hollywood.Whatever the subject of that day’s post, you can expect concise, to-the-point recommendations infused with a healthy amount of attitude and personality—like you’re hanging out with our editors at the bar and they’re telling you what they’re digging on these days.You’ll never fly the same way again.\nPhoto by Chelsie CraigIn fact, it doesn’t even always have to be a restaurant or a bar. Basically editor Amiel Stanek shares what airline he flies just for the small-batch margarita mix it carries, which he marries not with tequila, but whiskey. While senior staff writer Alex Beggs lets you in on the pair of clogs that’ll make you feel like a test kitchen professional.Inspired by BA’s own Carla Lalli Music.\nPhoto by Chelsie CraigOh, and Alex Delany? He snuck off to Vesta Coffee in Vegas for his daily cortado fix, and then to Makers and Finders for crispy breakfast empanadas, which made the rest of us mighty jealous. They’re exactly the kind of spots you can expect our editors to write up for Highly Recommend. (Got that, Delany?)Explore Bon AppétitAdam NewsletterRead MorecultureI Bring This Liter Bottle of Wine to Every Dinner PartyBy Emily SchultzrestaurantsA Killer Chopped Liver Sandwich in Savannah, Georgia? Yes, ReallyBy Hilary CadigancultureOne of My Most Prized Possessions Is an Ice Cream Sandwich Brand's SwagBy Zoë SessumscultureI Won’t Grill Without My Trusty HeadlampBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Adam Rapoport"]}