{"id": "406bdfce2c1dca941c1c63bf56c669e1", "url": "https://www.bonappetit.com/recipe/bigos-hunters-stew", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Bigos (Hunter’s Stew) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueBigos (Hunter’s Stew)By Kat BoytsovaOctober 23, 20184.5(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintBigos is an Eastern European stew that has many adaptations; some versions incorporate rice and/or a variety of vegetables and meats, so you can use whatever you have on hand. This version is a Polish hunter’s stew that features kielbasa, smoky bacon, melty cabbage, and lots of delicious broth that can be sopped up with bread.Ingredients12–14 servings1lb. double-smoked slab bacon, cut into 1\" cubes1½lb. kielbasa sausage, sliced on a diagonal ½\" thick8garlic cloves, crushed3Tbsp. double concentrated tomato paste1Tbsp. paprika1tsp. ground coriander1tsp. ground cumin¾tsp. cayenne pepper2medium onions, thinly sliced1cup dry white wine2Tbsp. kosher salt1small head of green cabbage (about 2 lb.), cored, thinly sliced2large carrots, peeled, sliced 1½\" thick1Pink Lady apple, cored, grated on the large holes of a box grater2lb. Yukon Gold potatoes, scrubbed, cut into 1\" pieces1lb. sauerkraut (not drained; about 2 cups)4cups homemade beef stock or waterSmall dill sprigs, dark rye or pumpernickel bread, and unsalted butter (for serving)PreparationStep 1Cook bacon in a large Dutch oven or other heavy pot over medium heat, stirring often, until brown and crisp, 10–12 minutes. Transfer bacon to a small bowl with a slotted spoon; set aside. Cook kielbasa in bacon fat in pot, stirring occasionally, until golden brown, about 10 minutes. Transfer to a medium bowl with tongs; set aside.Step 2Reduce heat to medium-low, add garlic to same pot, and cook, stirring often, until just beginning to turn golden brown, about 3 minutes. Add tomato paste and cook, stirring constantly, until paste darkens slightly in color and begins to stick to pot, about 2 minutes. Add paprika, coriander, cumin, and cayenne and cook, stirring constantly, just until fragrant, about 30 seconds. Immediately add onions and turn to coat. Increase heat to medium-high, pour in wine, and cook, scraping up browned bits from bottom of pot, until smell of the alcohol cooks off, about 3 minutes. Stir in salt, then add cabbage, carrots, apple, potatoes, sauerkraut, stock, and reserved bacon. Bring to a simmer. Cover, reduce heat, and simmer gently, mixing well halfway through, 1 hour. Mix in reserved kielbasa. Cover and cook until bacon is tender, cabbage is meltingly soft, and potatoes are cooked through, 30–60 minutes.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 3Divide stew among bowls. Top with dill. Serve with bread and butter alongside.Step 4Do Ahead: Stew can be made 1 week ahead (flavor will improve as time goes on). Cover and chill.How would you rate Bigos (Hunter’s Stew)?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThe recommended seasoning left something to be desired. At the end of the cooking period (2 hours in total), I added two additional teaspoons of paprika, one additional teaspoon of salt, one teaspoon of white pepper and the juice of half a lemon. That brightened things up considerably. I would recommend making this at least two days in advance, as the flavors deepen and develop over time.CameronPhiladelphia, PA12/15/2021A keeper. Agree with comments regarding the salt. If you use bacon and kielbasa you won't need more than a t or so of salt. I also left out the potatoes but they'd be great, I just didn't have any on hand. I've made this several times, and friends/family who aren't cabbage and sauerkraut fans loved it. I always freeze several single/double portions (freezes beautifully) so I usually have some on hand for those days/nights when you need a hug from a warm bowl of soup.JenChicago, iL10/16/2021Excellent recipe, especially on a cold rainy night. I followed the recs and cut the salt by 2/3. AnonymousSeattle 11/16/2020sounds like \"korean army soup\". throw salty meats together with fermented cabbage. audhumlaoregon10/13/2019This stew is absolutely delicious! I think the salt in this recipe is a typo and should be 2 tsp instead of 2 tbsp. With the saltiness from the bacon, sausage and broth it doesn’t really need much more added salt. I would salt to taste. SonyalwSeattle 10/13/2019This is a wonderful recipe. I made some adjustments based on what I had (not crazy). Instead of tomato paste I had actual tomatoes from my garden so I chopped them and cooked then for 15-20 in the bacon fat with garlic until they darkened. I used beer instead of wine, no potatoes, and added some orange bell peppers just for fun. Oh also I just chopped up sliced bacon instead of cubing slab bacon. Even with all my shenanigans this is amazing and wonderful #highlyrecommend. Anne StowellNew York10/6/2019This stew was so delicious! I made a big pot for a group of 5 friends and there wasn't a single bit left at the end of the night! The cabbage gets so melty and soft,and the big chunks of bacon and sausage are delicious to be sure, but the broth is the best part! It's so flavorful and rich, and totally worth the effort.AnonymousKansas12/28/2018This was just ok.  One should really love cabbage and sauerkraut before making this.  The dish seemed to be 85% those 2 ingredients. Even if it wasn't statistically that lopsided, the taste and abundance of those ingredients totally dominated (and I do like sauerkraut or cabbage).  stevehn11/13/2018Delicious for a cold evening. I halved it without any issues. I love salt, and as written this recipe does come out pretty salty. So next time I'll salt to taste vs. just throwing in the amount suggested. Kathleen SouderTN11/6/2018I don't get the bad ratings, this was AMAZING! We ate it three nights in a row because it was so good. I made a few tweaks: \n- Served it over mashed potatoes (Tasted amazing but it was kind of potato overload so in the next round I might just take out the potatoes from the Bigos and serve over the mashed ones)\n- Used turkey bacon instead of regular bacon (That was what I had on hand - maybe it helped it not be too salty?)\n- Didn't put the apple in cause I didnt have one - still tasted greatzizi jeanmairePA11/2/2018Not a do over for me. Thought I would love it because I like all the ingredients. Ended up putting most of it in the trashAnonymousCA10/31/2018Too salty for my tasteAnonymousVermont10/29/2018Explore Bon AppétitStewSoups and StewsPolishEastern EuropeanEuropeanKielbasaSausageMeatBaconCured MeatCabbageLeafy GreensVegetablePotatoGreen CabbageYukon Gold PotatoFallWinterOne-Pot MealsMainDairy-FreeGluten-FreeNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Kat Boytsova"]}