{"id": "40756d13b620fdb7997ecde94125ac2f", "url": "https://www.bonappetit.com/story/apple-cheddar-pie", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "This Apple-Cheddar Pie Brings the Sweet, Savory, and Cheesy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Apple-Cheddar Pie Brings the Sweet, Savory, and CheesyYour apple pie should have cheese in, on, and around it at all times.By Alex BeggsOctober 4, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailAs predictable as the moment you reach into your coat pocket and discover only one glove, we’ll be here to deliver fall’s first apple pie recipe. Well, not physically. You’ll have to make it. We were reminiscing recently about a fat slice of diner apple pie, served with a drooping square of cheese on top that doesn’t quite cover the crust, like a throw blanket on a king-sized bed. How could we recreate that savory-cheesy-sweet idea and transform it into something new and thrilling? Molly Baz was up to the challenge. Her recipe scatters finely grated sharp cheddar in the buttery crust, amps up the spices in the apples, and is served with a chunk of cheese à la mode. I don’t speak French but I think that checks out.Let’s break it down in three parts.Part I: The Apple Filling“I don’t want to say...Yankee Candle…” Molly begins to tell me in a hush, “but the spices in the pie are very fragrant. If it were [a candle! shh!], it’d be called ‘Christmas by the Fireplace’ or some sh*t like that.” (Would purchase in every size, including the little car fresheners.) There’s a heaping load of cloves, cinnamon, and allspice in the apple mixture to balance the savory cheddar crust. A splash of whiskey in there really brings the fireplace, if ya know what I mean.That cheesy crust tho.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensAnd get this: You mix the apple filling in a plastic bag, like a piece of meat you’re going to throw on the grill later. The recipe asks to let the mixture sit for at least an hour, or even overnight (which should be fine if you use hard apples like Grannies). The marinade sucks the moisture out of the apples, which sounds dry and weird but in fact what we’re preventing is a dry pie filling. You’ll put a bag of apples in the fridge and wake up with a bag of apples and all this liquid. Sweet. Then you mix the apples and all those eked-out juices with brown butter and cornstarch, and it thickens together in the oven.Part II: The Cheesy CrustWhy isn’t there cheese in the filling, like other recipes for apple-cheddar pie online? “The filling is sugary and spiced,” Molly explains, “cheese melting in there would give it this mac and cheese quality that we didn’t want. We want pie.” Yes, we do. By incorporating the cheese into the crust, you “really get to experience the cheese,” which might be one of the most beautiful things Molly has ever said. It reminded us of our sacred cheese twist recipe, a buttery flaky cracker you never want to stop eating. There’s also a dash of whiskey in the crust, which takes the place of vodka (you could also use apple cider vin), as booze evaporates faster than water = maximum flake factor. You don’t taste it at all. Well, unless you pour some for yourself on the side.TJ’s English cheddar would be a good cheese-fit for this pie.\nAlex LauPart III: Cheese à la ModeThe cheese we use throughout is Grafton Village’s 2-year cheddar, and that’s what you see served on the side like a stray roof shingle (mmm roof cheese) up top. “This isn’t the time for that expensive 7-year Gouda,” Molly advises, as it’s too potent to complement the sugary apples. The final cheese chunk on the side plays up the sweet and savory even more, and it’s a fun way to serve pie, so of all the things in this recipe you could skip (the overnight marinade, the whiskey, okay), don’t skip this one!Get the recipe:Apple-Cheddar PieA slice of apple pie with a slab of sharp cheddar on it is one of life’s great gastronomical treasures.View RecipeExplore Bon AppétitPieAppleapple pieDessertFallCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Alex Beggs"]}