{"id": "407679dad5000930f5ba4ae0cb1c35ff", "url": "https://www.bonappetit.com/story/how-to-meal-prep-for-one", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "How to Meal Prep for One But Never Eat the Same Thing Twice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Meal Prep for One But Never Eat the Same Thing TwiceChristina Chaey has spent the past decade honing her solo-cooking rules.By Christina ChaeyApril 18, 2020FacebookTwitterEmailPhoto by Gentl and HyersFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. This one is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.Dear Healthyish readers,Many of us are finding ourselves with a lot more alone time these days, whether we like it or not. This includes more time spent cooking and eating alone, too. I'm extremely familiar with eating alone, as I've spent the last decade cooking meals just for myself. I've always found the act of feeding myself therapeutic, but over the years I've also honed my solo-cooking strategy to make it even more pleasurable. And with no upcoming dinner parties on my calendar, I find myself applying these rules more than ever before.So as part of The Healthyish Guide to Being Alone, I’m sharing my solo cooking rules (though it might come in handy for those of you cooking for more than one, too). This is what works for me, but it might be different from what suits you. And that’s not only okay, it’s great. So let’s keep trading notes—and reminding each other that we’re never completely alone.1. Make A Master Grocery ListI use a list-making app called Clear Todos that I love because it allows me to easily create checklists for recurring events. (For example, my “Weekend Travel” list means I’ll never forget to pack my phone charger or underwear.) I have one called “True Weekly Groceries” that contains the same 10 baseline ingredients I know I’ll need to feed myself. It doesn’t sound like an extraordinarily exciting list—kale, yogurt, eggs, onions—but these are the building blocks I know I can pair with pantry items I already own (it helps if you can invest in your pantry stock), plus the occasional fresh fish or meat, to make meals I’m always excited to eat. Only after I have these items in my cart do I allow for some novelty and extras (fancy cheese! A salami! Buttermilk!). The goal is to be realistic about what I know I can—and will want to—eat in a week, then supplement with the fun stuff that brings me joy.My “True Weekly Groceries” List:Sweet potatoesOnionsGingerGarlicFresh chilesGreens (including leafy things like kale and spinach and cruciferous stuff like broccoli or brussels sprouts)YogurtEggsFresh fruitTofuAlex Lau2. Treat Your Freezer Like Temporary Storage SpaceI used to think of my freezer as a black hole where all kinds of mystery meats and random containers of clear broths would disappear, never to be seen again. But rebranding it as short-term storage has completely changed my solo-cooking routine: These days, I treat it almost like a second fridge where the vast majority of things stay only for a short period of time (i.e. a couple of weeks or less). Now, I find myself constantly opening my freezer in search of dinner options because I actually know what foods are in there and I’m excited to eat them ASAP: cooked farro for kimchi stir-fried grains; (labeled) pint containers of dashi for quick clean soups; a single sausage (yes, a SINGLE SAUSAGE!) for a sub sandwich; a half-package of ground pork for broccoli bolognese. It takes an extra day of planning if I need to wait for something like meat or seafood to thaw, but the payoff is that I never have to stress about using a whole package of anything ever again.This is probably a good time to mention that I’ve also recently gotten into the habit of keeping balls of cookie dough in a resealable plastic bag in the freezer so I can bake them off in my toaster oven one at a time. It’s a tiny luxury and I love it so much.3. Prep More to Cook LessI do most of my “cooking” for the week on Sundays right after I get home from the store, but I’m rarely ever turning on the stove or oven because what I’m actually doing is prepping. I wash the grit off the spinach leaves, pick the herbs, scrub the carrots, break down the broccoli into manageable florets that are ready to steam or sauté at a moment’s notice. This is unglamorous behind-the-scenes work. But, week after week, I do it without fail so that when I open the fridge to actually cook, it’s as if small elves have come in the middle of the night to prep my mise en place. The time spent cooking any meal is easily cut in half, if not more, when I’m starting with peeled garlic cloves, scraped ginger, and sliced squash—which means I’m much more likely to want to do it all over again tomorrow, and the day after that.Photo by Maria Del Rio, Styling by Bryson Gill4. Invest in Solo-Sized CookwareI own skillets, pots, and pans in all sizes, but the ones I use almost every day are sized just for me: my 1.5-quart stainless steel lidded saucepan, personal-sized donabe, small 6-inch stainless steel and nonstick skillets, and 8-inch cast iron. Between these five pieces of cookware, I can do it all, just for me: small batches of soup or dal, tiny frittatas, a single perfect piece of fish. Plus, it’s so much less labor-intensive to wash smaller pots and pans (imagine shampooing a buzz cut vs. a long mane!).If you’re an appliance fiend, you might also want to consider smaller-sized versions of traditional appliances, such as a mini food processor and a smaller blender (I love the Vitamix Explorian).5. You Get ONE HerbI get the allure of those lush bunches of dill, parsley, and mint sitting pretty under the produce misters at the store. But guess what? Your green sauce, grain salads, and herbed chickpeas will be perfectly delicious with one herb, not four, and you’ll be much less likely to throw out slimy cilantro at the end of the week (no one can eat four bunches of herbs in a week by themselves, except maybe Andy Baraghani). These days, I try to limit myself to one herb (usually parsley or cilantro) and one bunch of scallions per week.6. Banish the Concept of “Leftovers”I love the way Julia Child’s book editor Judith Jones describes cooking meal after meal for herself in The Pleasures of Cooking for One: “The secret of making cooking for one fun and creative is not to think of a meal as self-contained, but to understand that home cooking is an ongoing process, one dish leading to another.” It’s the difference between eating “leftovers”—a.k.a. last night’s dinner heated up for today’s lunch—and using the DNA from your last meal to make it something new and exciting, like building five different outfits around a favorite pair of jeans. A meal of roast chicken and greens may not yield many leftovers for a family of four, but for just you, tonight’s dinner might lead to a quick ’n’ dirty mayo-y, celery-studded chicken salad for lunch tomorrow and a carcass for stock. Freeze it for a day in the future when you get a sudden craving for chicken noodle soup. When that day comes, you’ll be so pleased with Past You for giving Future You such a lovely gift.Alone together,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?Healthyish Guide to Being AloneessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-18", "author": ["Condé Nast", "Christina Chaey"]}