{"id": "407f440559d20d89d588388382dc0417", "url": "https://www.bonappetit.com/recipe/daiquiri", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Daiquiri, Up-Rocks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2015 IssueDaiquiri, Up-RocksBy Chiltern Firehouse, LondonPhotography by Peden + MunkMarch 22, 20225.0(4)Read ReviewsTriangleEmailPinterestPrintPeden & MunkEmailPinterestPrintEmailPinterestPrintThe elegant combo of lime and rum in a classic daiquiri has nothing to do with the syrupy mixed drinks you’ll find tumbling in a drum at swim-up bars. “The original version is an import from Cuba,” explains writer, bartender, and cocktail consultant Al Culliton. “A proper daiquiri has legitimate universal appeal.” And, along with a mojito, it’s the rum cocktail we’re most likely to reach for on a hot summer evening.This rendition of the classic drink takes a bit of liberty with tradition, serving it “up-rocks.” The term, which started to circulate amongst bartenders a few years ago, refers to any drink that’s served on ice in a stemmed cocktail glass. In this case the shaken daiquiri is strained into a chilled coupe over a single large ice cube, which keeps the drink cold and allows its texture to evolve as the ice slowly melts. When making at home, just be sure to use a coupe that’s big enough to hold that ice as well as the drink. White rum is the backbone here and keeps this daiquiri cocktail breezy (Culliton recommends Denizen Aged White). Aged white rum is grassy and bolder than silver rum. Swap in aged dark rum if you prefer a drink with a warmer profile.For a traditional daiquiri recipe, head this way. Or if you just can’t live without a fruity rendition, opt for this version made with a rhubarb sugar syrup, or this strawberry daiquiri made with a tantalizing secret ingredient (it’s salt!).Editor’s note: This recipe was originally published September 2015.IngredientsMakes 1 serving1bar spoon (or 1 teaspoon) superfine sugar1¾ounces white rum¾ounce fresh lime juice½ounce simple syrup1limePreparationStep 1Combine sugar, rum, lime juice, and simple syrup in a cocktail shaker; stir until sugar dissolves, about 20 seconds. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds. Place a large ice cube in a coupe glass; strain cocktail through a Hawthorne strainer or a slotted spoon into glass.Step 2Using a small serrated knife, remove a 1\" strip of peel from lime (some white pith is okay); it should be stiff enough to provide some resistance when bent. Twist over drink to express oils; discard. Garnish with a lime twist.How would you rate Daiquiri, Up-Rocks?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleReally goodChipNashville1/23/2021What is the purpose of using both sugar and simple syrup?  AnonymousChi-city6/19/2019Explore Bon AppétitCocktailDrinks AllCubanCaribbeanRumAlcohol & Other DrinksLimeCitrusFruitDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-09-22", "author": ["Condé Nast", "Chiltern Firehouse", "Peden"]}