{"id": "4081b8ab309087f2d865da61ffa817d1", "url": "https://www.bonappetit.com/story/beckon-denver-wine-pairing", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "The Wine Pairing at Beckon Denver Changed the Way I Think About Wine Pairings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Wine Pairing That Changed the Way I Think About Wine PairingsI didn’t realize how wine could electrify the food its served with, until I went to Beckon.By Amiel StanekJanuary 3, 2020FacebookTwitterEmailPhoto by Paper Laundry / Jonnie SirotekFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Never get the wine pairings. That’s what I had always been told, at least. You’re paying too much for the wines you’re given. You’re getting too much or too little to drink. You’re asking to have your meal interrupted by some ego-tripping sommelier. Who wants any of that?But then I booked a solo meal at Beckon in Denver, a 2019 Top 50 finalist and tasting menu-only sister restaurant to 2018 Hot 10 winner Call, while I was in town visiting my sister last spring. It was one of those new fangled ticketed sort of deals—pay upfront for eight courses, whatever additions you want, tax, and tip—and I opted to add the (very affordable!) $65 wine pairing, mostly because I was tickled by the idea that I wouldn’t even have to take out my credit card to pay for drinks at the end of the meal. Aside from thinking that it sounded extremely convenient, I didn’t give much thought to the fact that I was doing exactly the opposite of what I had always been told. Which is particularly funny, considering the thing I’ve been thinking about for the better part of this year is actually the wine pairing by Zachary Byers, Beckon’s sommelier.To be clear: I loved the food at Beckon. Every course that chef Duncan Holmes and his team passed across the counter to me was fresh and fascinating, made with equal parts care and creativity. But for the first time in my life, the wine I was being poured positively electrified the food. Barely cooked California spot prawns lolling about in a verdant green spring gazpacho was delicious on its own but transcendent alongside a salty, floral albariño from Monterey, California. I went from standing on a cliff overlooking the Pacific to hang-gliding over it. Monkfish in a gripping mussel broth found its voice in between sips of an off-dry Alsatian pinot gris, its honeyed sweetness just evanescing off the brine of the seafood. The experience of each course in its totality was so captivating that I kept forgetting that there was more to come.But the brilliance of Byers’s pairings went beyond the gustatory; they made me think. And not because he was speechifying with every pour—he deftly dispensed just enough information about each wine to clarify without confounding—but because I was experiencing something new with each glass. Come to think of it, I hadn’t had albariño from California before. If I’m not a person who “likes sweet wines,” then why was that pinot gris so damn delicious? I thought about how special and rare it was to drink wines made by two female winemakers in a row—and then thought about how depressing it is for that to be special and rare. It’s easy for one’s mind to wander when dining alone in a situation like this, but I was riveted, present, there the entire time. All that for the price of a middling bottle at another restaurant? Yes, yes, and yes!When I talked to Byers later about my prejudice against wine pairings and how surprised I was by his, he confirmed that this was all by design. “Beverage programs are responsible for a lot of the profit at restaurants, and a lot of people take advantage of that when it comes to wine pairings,” he explained. “I’m trying to bring that cost right up to the limit, and I feel like I would be cheating people if I didn’t do that.” And in trying to keep the wine affordable, Byers often ends up seeking out high quality, off-the-beaten-path bottles that don’t command the exorbitant price points of more recognizable grapes and regions. “It’s fun to get to play with people’s preconceived expectations,” he shared. “One of the things I’ve learned over the years is that there’s a good version of everything and a perfect context, and when you can get those things together, you can really open people’s eyes to something special.” I wasn’t just presented with the wines that I should be drinking, in that particular moment with that particular plate of food, but the amazing wines I could be drinking if I got out of my comfort zone, thought a little bit harder, explored more boldly.More than anything, my meal at Beckon was a reminder of how rewarding it can be to take a chance, to put yourself in someone else’s hands and have the gamble pay off. “Trust is such a huge thing, and a really fragile thing,” Byers said. “If someone is giving it to you, then you have to make sure not to mess it up.” And if more sommeliers start thinking like that, then there are going to be a whole lot more wine pairings in my future.Go there: BeckonExplore Bon AppétitHighly RecommendRestaurantsDenverWineRead MorecultureWhy You Should Get Down with an All-Beer Pairing Instead of Boring Old WineBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-03", "author": ["Condé Nast", "Amiel Stanek"]}