{"id": "408d26fa92541f4b09a6b6568e9845e1", "url": "https://www.bonappetit.com/recipe/chef-joe-kindreds-tillamook-white-cheddar-and-heirloom-tomato-pie", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Chef Joe Kindred’s Tillamook White Cheddar and Heirloom Tomato Pie Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDChef Joe Kindred’s Tillamook White Cheddar and Heirloom Tomato PieSponsored by TillamookFacebookPinterestTwitterEmailServes 6–8Restaurateurs Joe and Katy Kindred of Hello, Sailor and Kindred turn a classic tomato pie into a zesty flavor favorite with Tillamook Sharp White Cheddar. They call it \"southern fancy pizza-ish deliciousness,\" and we can't help but agree.PrintIngredientsCrust2 ½ cups all-purpose flour (sub with White Lily Flour, if available)1 tsp. salt½ tsp. sugar½ lb. Tillamook Sweet Cream Salted Butter (2 sticks), diced and kept ice cold⅔ cup ice cold water1 Tbsp. chilled apple cider vinegarFillingAbout 1 ¼  lb. of heirloom tomatoes, sliced ¼-inch thick5 oz. Tillamook Sharp White Cheddar, grated (2 cups)1 large egg lightly beaten⅓ cup heavy cream1 shallot, thinly sliced (optional)3 Tbsp. drained, chopped roasted red peppers (optional)4 oz. browned sausage, drained of excess fat and cooled to room temperature2 Tbsp. mayonnaisePinch of salt and pepperRecipe PreparationCrustChef notes: Make the crust a day ahead of time so it can chill overnight (6 hours ahead will do, if necessary). This recipe produces two 8-10 inch crusts.  You can make one with this recipe and freeze the other for a couple of weeks. Alternatively, if you want to get the kids involved, you can make one crust for the pie and then divide the rest between the kids to play with.Combine flour, sugar, and salt and mix with a whisk in a large bowl. Toss Tillamook Sweet Cream Salted Butter in the flour coating evenly. Using a pastry cutter, cut butter into 1/8-1/4-inch morsels.Stir together cold water and vinegar.Add ½ the water mixture to the bowl, mixing with a spoon. Once absorbed, add all but 1 Tbsp. of the remaining water mixture and mix until dough starts to form. If floury and dry, add remaining Tbsp. Press a couple times against side of bowl with your hand to gather dough together. Transfer dough to a lightly floured surface and knead a few times until dough comes together. Divide the dough into two disks. Wrap each in plastic wrap and refrigerate one at least 8 hours or overnight and freeze the other for future tarts.)Roll out dough on a floured surface to a 12-inch round, about 1/4-inch thick. Fit dough into the tart pan, trim, and freeze completely (1 to 2 hours.)Preheat oven to 425°F with an oven rack in the center. Cut out a round of parchment paper or a use a piece of foil a bit larger than the shell. Line the frozen shell with the paper and fill with dried beans or rice to weigh it down. Par-bake the tart shell on rimmed baking sheet, not the one you froze the shell on, 20 minutes, rotate the pan and bake another 20 minutes. Let rest on the counter with weights in it for 10 minutes minimum. (The crust can be wrapped tightly and will last 1-2 days room temp.)FillingChef notes: This part is easy breezy for the whole family, and there are plenty of ways to riff this to make it your own. A couple ideas to add to the custard before baking: add sautéed greens, red onions, pepperoni, grilled vegetables… the world is your oyster!While tart shell is baking, spread sliced tomatoes into a single layer on a cooling rack and gently salt. Let stand 20 minutes to leach out the water. Flip tomatoes over and repeat salting and draining.Turn oven down to 350°F. Combine all the remaining filling ingredients and press into the tart shell. Arrange tomatoes on top and bake tart on a rimmed baking sheet 25 minutes. Rotate the tart and bake another 25 minutes. Serve at room temperature.Pro-move is to wait and reheat. The absolute best-best is to reheat it the next day. It only gets better!Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}