{"id": "4090aaa44a0edef2427fc268eaf6e606", "url": "https://www.bonappetit.com/story/never-fail-linguine-recipe-olives-zesty-breadcrumbs", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "This Olive-y, Breadcrumb-Topped Linguine Recipe Cannot Be Messed Up (Believe Me, I've Tried) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Olive-y, Breadcrumb-Topped Linguine Recipe Cannot Be Messed Up (Believe Me, I've Tried)The best dishes to have in your back pocket are the most forgiving ones.By Sasha LevineMarch 22, 2019FacebookTwitterEmailLinda XiaoFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Never have I ever made this linguine recipe right. I’ve cooked it on more occasions than I can count, and read it through even more times than that. And yet, for the life of me, I always manage to get some step wrong. I've mixed the lemon zest in with the sauce and not the crispy panko topping. I've chopped all the olives but none of the capers. I've put all the right herbs in all the wrong places. And on, and on, and on.But you know what? It. Doesn’t. Even. Matter. This recipe for Linguine with Green Olive Sauce and Zesty Breadcrumbs is so good, even idiots like me can’t screw it up.There’s the sauce part: a deliciously herby, briny mix of Castelvetrano olives, anchovies, capers, parsley, and basil, a salty green slap straight to the face. And then there’s the topping part: a zingy, crunchy medley of toasted panko, lemon zest, and dill that you’ll want to take generous spoonfuls of and sprinkle all over your body (I mean...bowl). Those combine with hot pasta to create a dish that's fresh, satisfying, and simple, all while being so much more than the sum of its clearly interchangeable (whoops?) parts.This recipe first came out in 2015, just in time for peak summer, but I’ve been making it all year round ever since—and especially when all I want is something green to remind me of the warmer days ahead. I say go for it and get a little heavy handed with all your ingredients, because no one is going to complain about having more chunky goodness to swirl their pasta in (the recipe calls for linguine, but I like using spaghetti). Sure you'll find tons of green bits in all your tooth crevasses after you’ve licked your plate clean, but when all the mouths at your dinner table look like they’ve gathered moss, who really cares? I’ve converted more than one self-professed olive hater with this dish, and everyone asks me to pass along the recipe on their way out the door.Sure: I’ll send it to them. But, of course, only I know the secret to making it perfectly every time—that is, to always mess up at least one thing.Get the recipe:Linguine with Green Olive Sauce and Zesty BreadcrumbsBursting with the big brash flavors of green olives, anchovies, and capers, this herbaceous pasta sauce isn't afraid to bite back.View RecipeExplore Bon AppétitBasicallyNever FailOlivePastaBreadcrumbsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-22", "author": ["Condé Nast", "Sasha Levine"]}