{"id": "4099babb5eafe80932f573317658280c", "url": "https://www.bonappetit.com/recipe/tofu-with-soy-butter-corn", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Tofu with Soy-Butter Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTofu With Soy-Butter CornBy Sarah JampelSeptember 28, 20204.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown, Bowl by Meilen CeramicsEmailPinterestPrintEmailPinterestPrintThe combination of corn, soy, and butter is as delicious as it is classic. As Hiroko Shimbo writes in her book Hiroko’s American Kitchen, corn and butter are a common pair in Hokkaido, the northernmost island of Japan, where both are produced. Here, the three come together along with pan-fried tofu, scallions, mirin, and sesame oil to make an ultra-flavorful, just-rich-enough vegetarian main. Serve it over rice, a chewy grain like farro or wheat berries, or arugula dressed with rice vinegar and more sesame oil. A crispy fried egg would also be welcome.Ingredients2-3 servings114-oz. package firm or extra-firm tofu, drained3large or 4 medium ears of corn, husked1Tbsp. plus 1 tsp. vegetable oilKosher salt8scallions, thinly sliced on a diagonal2Tbsp. mirin3Tbsp. soy sauce; plus more for serving (optional)2Tbsp. unsalted butter½cup torn basil leaves and/or cilantro leaves with tender stemsGomasio or toasted sesame seeds (for serving)1tsp. toasted sesame oilCooked white rice (for serving)PreparationStep 1Wrap tofu in a kitchen towel and place in a shallow baking dish or on a rimmed baking sheet. Weigh down with a heavy object (a cast-iron skillet topped with a couple of heavy cans works well). Let sit at least 15 minutes and up to 1 hour (go the full time if you can).Step 2Meanwhile, cut kernels from corn cobs. (Save cobs to make stock in the future.) You should have about 3 cups kernels; if you have much more, save for another use.Step 3Unpack and unwrap tofu and transfer to a cutting board. Slice crosswise into 8–10 planks about ½\" thick; pat dry. Heat 1 Tbsp. oil in a large nonstick skillet over medium-high. Working in batches if needed, fry tofu in a single layer until golden brown all over, about 2 minutes per side. Transfer to a plate and season lightly with salt.Step 4Reduce heat to medium and add remaining 1 tsp. oil. Set a small handful of scallions aside for serving; add remaining scallions to skillet and cook, stirring often, until wilted and starting to brown, about 2 minutes. Add corn and cook, stirring, until kernels are well coated, about 2 minutes. Pour in mirin, 3 Tbsp. soy sauce, and 2 Tbsp. water and bring to a simmer. Nestle in tofu and cook until sauce reduces slightly, about 3 minutes. Swirl in butter and cook until sauce is glossy and coats tofu, about 2 minutes.Step 5Set a few herbs aside for serving. Remove tofu mixture from heat and stir in remaining herbs. Sprinkle with gomasio and top with reserved scallions and herbs. Drizzle with sesame oil and more soy sauce if desired. Serve over rice.How would you rate Tofu With Soy-Butter Corn?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleI LOVE this! I had never in my life ever PURCHASED tofu and I dove in head first to try this recipe. Everything was perfect. Used flavored rice vinegar vs mirin and basil vs cilantro; served over wild rice. Next time I may add snap peas or broccoli too, and may double the scallions. Will make many times! Yay!JodyAllentown.  PA1/25/2022An easy and delicious dinner recipe especially when using canned corn. Recommend serving topped with furikake. Georgia Sydney, Australia3/8/2021This was excellent! I added in some chopped up mushrooms with the corn and also added a splash of vinegar at the end. The tofu took quite a while to brown, definitely more like 5 minutes per side and unless you have a giant pan you'll have to do it in batches, but that's the only part of this dish that takes a while. Super easy and comforting! love the sweetness of the corn against the salt savoury flavours. I also used frozen corn and it worked just fine.HannahUnited Kingdom3/4/2021Very good, but next time I will marinate my tofu beforehand. I like to marinate it for an hour or so in 2T reduced sodium soy sauce and maple syrup and 1T liquid smoke. Since the corn adds sweetness to this dish I may omit the maple syrup.Anonymous1/28/2021Delicious delicious!!! I made some small adjustments... I made a little extra sauce, per recommendations from the reviews below, and I upped a lot of the other flavors/aromatics (more scallions, vinegar, cilantro. added red pepper flakes to the oil when frying the scallions and corn). \nAdded a little sliced red cabbage that  I needed to use up. I felt it needed some crunch and a vegetable other than the corn.\nI agree with another reviewer below that it would be even better with a squeeze of lime...Anonymousbrooklyn11/1/2020Simple & tasty. Super easy to throw together after a long day of working from home. Didn’t have any firm tofu so used silken & it turned out great. AnonymousMI11/1/2020Delicious! I doubled the quantities for the sauce given the reviews below and it was perfect. Served with wild rice for a nuttier flavour. Will be making it again soon for sure.London10/25/2020Delicious, well balanced, jam packed with flavor with a few pantry staples! My dad has never been a fan of tofu and enjoyed this! I would double the sauce, I would have liked it to soak into the quinoa I served it with. I used rice vinegar in place of mirin and balanced it with some honey. Quick, easy, will make again!Wilmington, DE10/20/2020This is a great recipe. The corn + tofu combo - yum! Pretty easy, too. AnonymousSeattle. WA10/20/2020What a pleasant surprise!! This was the most incredible delicious dish ever - my tofu-hating husband licked the pan! The umami, the sweetness of the corn, the butter and soy - just perfection. I used seasoned rice vinegar, cilantro, basil and shiso from my garden. SO GOOD!wildlilacwellnessPortland, OR10/10/2020This was okay. I've had the soy-butter-corn combo before in other ways, and I think this recipe just needs to be punched up in all areas. Add more butter, soy, mirin, salt, and maybe something acidic like lime juice or rice vinegar. As happened with another reviewer, there was pretty much no 'sauce' left, and I measured my corn to make sure I didn't use too much.AnonymousNew York10/9/2020This looks excellent, especially since I'm trying to eat more veggie based dishes instead of meat!AnonymousBrooklyn, NY 10/6/2020Can't wait to try it!AnonymousLondon10/6/2020Very good!AnonymousChicago, IL10/1/2020Delicious dish and easy to make.  There really wasn't much sauce left so I increased the liquid.  BTW I substituted rice wine vinegar for mirin.  And, I used toasted sesame seeds and cilantro. bitebyeveChicago9/28/2020Explore Bon AppétitRice and Grain BowlTofuOther IngredientsCornVegetableOne-Pot MealsMainVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-28", "author": ["Condé Nast", "Sarah Jampel"]}