{"id": "409aa87adab4182988d7e6aa671eb8fe", "url": "https://www.bonappetit.com/story/instant-pot-ace-blender-review", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "The Instant Pot Ace Blender, Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Instant Pot Ace Blender Promises Ice Cream and Hot Soups—But Does it Deliver?I took it for a spin. Here’s my story.By Priya KrishnaDecember 19, 2018FacebookTwitterEmailFacebookTwitterEmailDo I really need this? This is the thought that ran through my mind as I lugged the new Instant Pot Ace Blender—the latest gadget from the company that brought us the electric pressure cooker that broke the Internet—onto a crowded subway car and then up two flights of stairs to my tiny Brooklyn apartment, where I certainly don’t have spare kitchen cabinet space.As I unpacked the massive box and all its various bobs and doo-dads, I asked myself again: DO I NEED THIS? I already have a blender, which is about half the size of the Instant Pot version—it’s a Breville model that does a reasonable enough job of blitzing through kale for smoothies and breaking down herbs for chutneys. Why do I need another? When I received an Instant Pot, I thought the same thing. I already had a slow cooker, I didn’t need anything else! But the Instant Pot’s ability to more quickly and effectively produce all the things I made in my slow cooker (dal, pulled pork), and then even more (risotto, yogurt) changed my mind, and it’s since become one of my most-used appliances.The Instant Pot Ace Blender, which was released this fall (just in time for soup szn!!), is the second appliance behind the upstart Canadian business that brought us the device that launched a thousand cookbooks/hot takes/Facebook groups. Here, the company is relying on the same logic it used to sell the Instant Pot: that this product can do everything this device you already have (in this case: blender) can do, but better. And more. The TL;DR? It’s a high-powered blender that can also heat and cool food.The instruction manual claims it can make ice cream (or at least, soft serve), hot soup from raw ingredients, and—because this is where the world is headed, I guess—several kinds of alternative milks. Similar to the Instant Pot, there are preset buttons (three are for alternative milks) as well as a manual option. Even the lid is somewhat familiar, as it has latches for locking the top in place. The blender won’t operate unless the lid is securely on, which is comforting for someone like me, who has had several mishaps.I spent a recent morning testing out all the features of this fancy new blender, and let me get the bad news out of the way: it cannot make ice cream. Following the instructions of this friendly-looking lady with a cute bob on YouTube, I combined heavy cream, sugar, and vanilla extract in the blender, and hit the ice cream button, which promised to have my 7 a.m. dessert ready in a minute and twenty seconds. I was surprised that as the machine was running, it didn’t seem to be getting much cooler (there’s a temperature reading on the front of the gadget, though it was in Celsius because the Instant Pot company is Canadian and I got very confused!). Once my ice cream was supposedly done, all it had become was whipped cream. I gave the ice cream another shot, this time adding cornstarch as a thickener and frozen mangoes, which I thought would help cool everything down. What I got was more like melting soft serve. I stuck it in the freezer, and after several hours, it was technically ice cream, but more just cold cream dotted with ice granules.Many articles I read also mentioned that this blender could churn butter. Let me just say that I bought several cartons of cream and tried “churning” it using every possible setting—puree, smoothie, ice cream, crushed ice—and no butter solids ever formed.Where the Instant Pot Ace Blender fared better was alternative milks. I decided to try making oat milk, because it’s trendy and I already had large cartons of almond and soy milk in the fridge. On my first try, I forgot the water and unintentionally found out that this thing is great for making alternative flours (the oat flour was silky and homogeneous!). On my second try, after adding oats, water, and a little vegetable oil (there are step-by-step instructions in the manual), hitting the “nut/oat milk” button, and waiting the requisite 4 minutes and 32 seconds (the timings are so precise!), I had something that very closely resembled what I’ve seen in coffee shops. The blender even comes with its own cloth that you can use to strain your milk. I ended up with about a quart of oat milk, and it was nice, albeit more bitter and less creamy than the ones I tried.But if you’re really going to buy this blender, it will be for the soup function. This is the most Instant Pot–adjacent feature, and it is also the best feature. Basically, you can dump any raw veggies into the blender, and the device will both cook and blend them into a soup. I decided to go with butternut squash, a veg that usually takes a while to cook. Into the blender I dropped about two cups of cubed, UNPEELED, squash, a sliced, sautéed onion, a small knob of ginger, water, and some salt and pepper. I pressed the Soup button, and the blender took about ten minutes to heat up, the equivalent of when the Instant Pot takes some time to build up the pressure before it starts the countdown clock (in this soup’s case, 20 minutes). It was pretty mesmerizing to watch the soup. At first, the water started to boil. Then, little cubes of squash would dance around and disappear into the blender, a few at a time. By the time 20 minutes was up, the blender made that familiar, comforting Instant Pot beep, and everything appeared to have puréed into a smooth soup. Common wisdom is that blenders can’t hold hot food, as they will explode due to pressure build-up, but the IP blender fared just fine.The soup was good, albeit not deeply flavored. Neither the squash skin nor the ginger had fully broken down, though I imagine if I had puréed the mixture for a minute or so longer it would have, and I didn’t mind the couple of chunky bits. This blender obviates the need for an immersion blender, or a separate pot for cooking your vegetables. That said, unlike the Instant Pot, there is no sauté function on this blender, and so I had to use a separate pan to brown my onions. (Here’s how Carla Lalli Music uses an Instant Pot to make super delicious chicken or veggie stock.)But would I buy this blender to replace my current one, exclusively to be able to make hot soup and oat milk? Nah. It’s a perfectly good blender, but not uniquely more powerful than my Breville. The hot and cold functions don’t feel like a game changer. I can make better-flavored soup in my regular ol’ Instant Pot, and I don’t mind using my immersion blender to purée it! Every alt milk imaginable is so widely available and reasonably priced. Also, even if the Instant Pot blender could make butter, we don’t live in settlement times anymore! You can buy great butter at the store!!!And ice cream? While I don’t love paying five dollars a scoop at the incredible gelato shop within eyeshot of my apartment, this option is far more preferable than cramming yet another appliance into my cabinet, only to end up with melty soft serve.Explore Bon AppétitToolsInstant PotShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-19", "author": ["Condé Nast", "Priya Krishna"]}