{"id": "409f02562765105c83efe3467148110a", "url": "https://www.bonappetit.com/story/old-poland-bakery-granny-rye", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "I’ll Take Old Poland Bakery's Granny Rye Over Bread Bro Sourdough Any Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ll Take Granny Rye Over Bread Bro Sourdough Any DayWhy shell out $10 for “Old World-style” loaves when you can have the real thing? The bread at Greenpoint’s Old Poland Bakery is chewy, crusty, whole-grain bliss.By Amiel StanekMay 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailDeeply browned, verging on burnt crust. Moist, chewy, almost-sticky crumb. The unmistakable nutty-nostalgic aroma of whole grain rye. It was a loaf to remember, that rare assemblage of flour and water and salt that leaves an impression that lingers long after the last crumbs are swept from the cutting board. The best part? It didn’t come from one of the countless, cooler-than-thou artisanal bakeries that have cropped up in the last few years. Quite the opposite, in fact: That 100 percent whole-grain loaf of “Granny Rye” came from Old Poland Bakery, a sliver of a space with a faded maroon awning in Greenpoint, Brooklyn’s Polish neighborhood. And it was everything.Don’t get me wrong: I’m beyond glad to be living in the Golden Age of Bread. I’m thrilled about the explosion of solid bakeries that have popped up in the decade since Chad Robertson first published Tartine Bread—along with its infamously long “basic” country bread recipe—and grateful that now, in cities across America, crusty, naturally leavened loaves made from quality grains are almost as commonplace as pour-over coffee. This is the kind of bread that I want to eat, and the kinds of bakeries that I want to support.But at the same time, it also feels like a certain toxic, masculine competitiveness has crept into bread culture, and that gives me pause. The rise of the Bread Bro. Aggressive virtue-signaling and one-up-manship around sourcing and technique. How high is your hydration? How local are your grains? Do you even mill?! It’s exhausting, and intimidating, and runs counter to the utopian ideal of making quality, unfussy bread available to everyone. And for me, a loaf of Granny Rye is the ultimate antidote.Honest. Delicious. Wholesome. To me, bread like that from a bakery like that is a humbling reminder that, while everything old is new again in the world of food, some old things are just, well, old. And that’s exactly the point.Go there: Old Poland BakeryExplore Bon AppétitHighly RecommendBrooklynBreadRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-28", "author": ["Condé Nast", "Amiel Stanek"]}