{"id": "40b5f15199162e2a5a9b0a7ed20acf86", "url": "https://www.bonappetit.com/story/egyptian-magic-skin-cream", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "There’s No Inch of Skin I Won’t Put Egyptian Magic On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s No Inch of Skin I Won’t Put Egyptian Magic OnIt’s my winter skincare savior.By Carla Lalli MusicNovember 26, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.“It’s not even technically winter, and already my knuckles are bleeding.”That’s an actual text I sent to my sister, Nina, last year, and the year before, and the year before that. I know—it’s gross. But it’s also real life. In my experience as a person living on the northeast coast of the United States, as soon as the weather even hints at the autumnal transition, my hands dry up and wither just like the fading leaves on the trees. I’m being dramatic because it’s dramatic! Being in the kitchen all day exposes my hands to extra washing for dishes that need doing, blasting heat from the stovetop and oven, and little scrapes and burns—and all of that wreaks havoc on my digits.When something terrible is happening to me, including but not limited to bloody knuckles, I like to involve my sister. My sister is a ceramicist. Everything I’m complaining about, she has it worse because working with clay literally strips her hands of every ounce of moisture they have. After I texted her, she was quick to respond.“Why aren’t you using Egyptian Magic?” she wrote back. “You need. Fix everything.”“What is???” I replied.Then she just sent me a link to buy it, and soon after I was head over heels in love with my skincare savior, Egyptian Magic cream. I can’t confirm or deny that this salve is truly “the ancient Egyptians’ secret” as the label professes, but I can tell you that the buttery combination of olive oil, beeswax, honey, bee pollen, propolis, and royal jelly is definitely Magic. Texture-wise, it feels like a lighter, more fluid Vaseline, but it melts instantly when you rub it between your palms, and it absorbs into the skin instead of sitting like a grease slick on top. When I got that first jar, I dabbed it onto my inflamed knuckles and my lips, and overnight it seemed like those chapped spots showed signs of healing. Good stuff, I thought.It was a slippery slope from “never heard of it” to “can’t live without it.” There’s no inch of skin I won’t put Egyptian Magic cream on. I use it to remove eye makeup and to calm my son’s itchy elbow creases. I work it into my knees and cuticles, shins and ankles. After bouts with winter sniffles, I rub it all around my nose, which gets irritated and flaky after using too many tissues. During the driest, coldest, wind-whipped, moisture-starved, ashiest day of winter, I thought maybe I should just slather it all over my face and see what happened. Then I rubbed what was left on my hands into the ends of my hair. I do that a lot now, and I never break out. I’ve scooped a sidecar amount into a little travel-sized jar, which I keep in my bag, so I can use it on the go. Once, I boarded a plane and schmeared Egyptian Magic up my nose as a protective barrier between me and the airborne germs. Did I get sick? No, I did not.This winter, you might think you need to find another good moisturizer. But what you need—what we all need—is just a little Magic.Buy it: Egyptian Magic All Purpose Skin Cream, $22 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-26", "author": ["Condé Nast", "Carla Lalli Music"]}