{"id": "40b81775d755c42c9b51d27bd97885ff", "url": "https://www.bonappetit.com/story/shout-out-to-chicken-bryan-carrabbas", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "My Singular Obsession with Carrabba’s Chicken Bryan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Singular Obsession with Carrabba’s Chicken BryanBut wait, who’s Bryan?By Alex BeggsApril 16, 2019FacebookTwitterEmailPhoto by Lisa DiederichFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.A long, long time ago, uh, in the early 2000s, when I’d spend the night at my friend Moselle’s house, we almost always went to Carrabba’s for dinner. We’d pile into the back row of her family’s giant SUV and slowly make our way out of their gated driveway. Carrabba’s was on a busy stretch of road next to an Outback, a Japanese-fusion spot, and a Weight Watchers. When we walked in, the hostess greeted the entire family like they were famous. I had no idea what a “regular” at a restaurant was, but as with everything in Mo’s life, it was something to aspire to.The kids always got Carrabba’s oven-fired pizza. Her parents the Chicken Marsala, or Chicken Bryan. Frank Sinatra was playing on the speakers and Mo’s family knew the lyrics. This is as close as it got to a red sauce joint for me. I can’t remember a single restaurant from my Texas childhood that transported me anywhere other than out of the heat, into the A/C. This chain Italian food, though, it felt special. It felt fancy. The music even played in the bathroom. I had so much of life yet to figure out.I grew up, I figured the stuff out, and I forgot about Carrabba’s. Until three years ago, when I started working at this fancy food magazine, where only a few of my colleagues had heard of the restaurant. I wanted to write something about Carrabba’s, so I talked to Joel Barker, VP of research and development at Carrabba’s. He mentioned that Chicken Bryan recently “took off.” Fans continue to profess their love on Twitter (“Damn Carrabba’s prices have almost doubled but I’ll pay anything for the Chicken Bryan,” says @jeff1uk), bloggers replicate the recipe and write odes to the dish that veer on rapture. People are (still!) obsessed with CHICKEN BRYAN.After all those sleepovers, I’d never had the legend, the phenomenon that is Chicken Bryan. A juicy grilled boneless, skinless chicken breast topped with a precise circular patty of goat cheese, a sprinkle of sun-dried tomatoes, and a dousing of lemon-butter-wine sauce. 680 calories. I couldn’t stop thinking about it. Why is this, in a world with heavy cream–based fettuccine, the most popular dish on the Carrabba’s menu? Boneless, skinless chicken breast? Sun-dried tomatoes?! And who the hell is Bryan? It’s just so...random. I stewed on it. And I waited until now, in honor of Red Sauce America, to search for the answers.A pretty generous portion of lemon-butter sauce, I see.\nPhoto by Lisa DiederichI’m going to break the spell right now and tell you that Chicken Bryan isn’t named after a guy named Bryan who smoked a bowl and plopped some goat cheese on a grilled chicken breast before riding into the sunset. It’s named after the town of Bryan, Texas, where the Carrabba family settled when they arrived from Sicily in the 1890s. Carrabba’s was created in 1986 by Johnny Carrabba and his uncle Damian Mandola. They mined their family’s Sicilian history, their grandma’s recipes, and then invented their own, like Chicken Bryan, originally named Chicken Bryan Texas around 1989–90. There’s no solid explanation for the ingredient combination other than it just happened one recipe-testing day and stuck. “I always said Carrabba’s is ten years ahead of our time,” Barker said. “Johnny and Damian aren’t nervous to put these big, bold flavors together.”One of Chicken Bryan’s biggest fans is Dash of Sanity blogger Sandra McCollum, whose family were regulars at the Fort Collins, Colorado, Carrabba’s for years. “They know we want extra sauce on everything,” McCollum said to me over the phone. She brought the staff her famous Christmas coffee cake during the holidays, knew the franchise owner by name, and even—please hold—went into labor at Carrabba’s, while her husband was—yes!—eating Chicken Bryan. (McCollum likes the Sicilian chicken soup, a salad, and the chocolate dream dessert.) After she gave birth to her daughter, she opted for Carrabba’s takeout instead of the hospital’s complimentary steak and lobster dinner for new parents (no, I don’t know what hospital this was).“It’s the best ever,” she said of Chicken Bryan with her husband on the line to join in. “Nothing overpowers anything.” She posits that the secret is the grill seasoning (a simple spice mix). Husband chimes in: “What’s underrated is that rough-cut fresh basil. You get that super savory, salty base, the citrus through the lemon butter sauce, and”—he lets out a guttural umh!— “a little sweetness from the basil.” Aha!I needed to taste Chicken Bryan myself. This required obtaining a car and planning an outing to Secaucus, New Jersey, the closest Carrabba’s to the island of Manhattan. This Carrabba’s is next to an Outback and an LA Fitness. Inside, Sinatra was swinging and the Diet Coke was flowing. I was nearly bouncing out of my booth to say the words, I’ll have the Chicken Bryan. (Side of garlic mashed potatoes, please, and the Caesar salad.) More than half of the plate was taken up by the two sloppy plops of mashed potatoes. The Bryan snuck into a wedge between them. The circles of goat cheese were cold and firm, the sun-dried tomatoes placed in their centers, and basil scattered between, creating this sort of owl face. Well, Bryan. We finally meet.The CB was perfectly cooked and juicy (and it’s a breast, remember?!). I wanted more sauce, more sunny-T’s. My dining companion ordered the Pasta Weesie (shrimp, scallions, a creamy Alfredo sauce, named for a founder's niece, per VP Barker), which I liked best. The pasta was fresh and delicate. The service was genuinely warm and friendly. The zucchine fritte had the lightest fry batter, irresistible. This place, I realized, is so much better than that other more famous, ubiquitous Italian chain.Carrabba’s family photos—and some wine—adorn the walls of the restaurant nationwide.\nPhoto by Lisa DiederichAnd finally, I needed to make Chicken Bryan myself, straight from the Carrabba’s cookbook. First I mixed up Carrabba’s grill seasoning: salt and pepper, dried oregano, granulated garlic, granulated onion, and red pepper flakes. Then I made the basil-lemon-butter sauce: lemon juice, clarified butter, white wine, onion, and garlic. At the very end, you add in fresh basil and sun-dried tomatoes. I grilled the seasoned, pounded chicken indoors on a carbon steel pan (I wasn’t able to grill it over pecan and oak as they do at the restaurants). On the plate, I topped the breasts with imperfect circles of goat cheese and doused everything in the delicious basil-lemon-butter sauce, which was more flavorful than what I’d had in New Jersey the day before. That’s right: CB two days in a ROW! I served it with steamed asparagus to my Texan friend Tarik and told him it was an upcoming Bon Appétit recipe. I thought this would be a clever prank. He’d wonder what direction BA was going in. Where was the Aleppo pepper, the fennel salad? But the joke was on me, the snobby food writer, because...he loved it.Me: “Do you think you’d make this at home?”Tarik: “...yeah, actually.”Me: “Why?”Tarik: “I like the lemon sauce, the goat cheese, and I really like sun-dried tomatoes but I’ve never cooked with them.”Me: “Does it feel modern to you?”Tarik: “It’s chicken breast and asparagus, so, uh, no.”Me: “Well it’s 30 years old. It’s Chicken Bryan! From Carrabba’s! Italian! Grill!”Tarik: “What’s Carrabba’s?”So that experiment failed. But it was an easy, healthyish lunch. I traced my finger in the saucepan and licked it clean. There were no leftovers, which was too bad. Because Chicken Bryan, three days in a row, would have been an honorable streak. I’d have felt, you know, like some kind of regular.Alex Beggs is a senior staff writer at Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Beggs"]}