{"id": "40b982021a810949ea97bc5a710fd4a6", "url": "https://www.bonappetit.com/recipe/burst-cherry-tomato-pasta", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Burst Cherry Tomato Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBurst Cherry Tomato PastaBy Molly BazSeptember 6, 20184.8(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Anna BillingskogEmailPinterestPrintEmailPinterestPrintA simple sauce of juicy, bursty cherry tomatoes (aka nature’s Gushers) that comes together in around 15 minutes. If you can’t find cherry tomatoes, any larger ones will work just as well for this summery pasta sauce recipe. Simply cut them into pieces about the size of cherry tomatoes and proceed.Ingredients4 servings½cup extra-virgin olive oil, plus more for drizzling6garlic cloves, smashed4pints cherry tomatoes (about 2½ lb.)¾tsp. crushed red pepper flakes2large sprigs basil, plus 1 cup basil leaves, torn if large1½tsp. kosher salt, plus morePinch of sugar (optional)12oz. campanelle or other tube pasta1oz. finely grated Parmesan (about ⅓ cup), plus more for servingPreparationStep 1Heat ½ cup oil in a large heavy pot over low. Add garlic and cook, stirring, until softened and fragrant but not browned, about 2 minutes. Increase heat to medium and add tomatoes, red pepper flakes, basil sprigs, and 1½ tsp. salt. Cook, stirring to coat, until tomatoes begin to burst, about 4 minutes. Smash some but not all of the tomatoes with the back of a wooden spoon to help create a sauce, then continue to cook, stirring occasionally, until a chunky, thickened sauce comes together and about half the tomatoes are completely broken down and half remain in tact, 10–12 minutes. Taste and adjust seasoning, adding sugar if sauce seems tart. Pluck out and discard basil sprigs.Photo by Chelsie Craig, Food Styling by Anna BillingskogStep 2Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, add to pot with sauce, and cook over medium heat, stirring, until coated, 1–2 minutes. Remove from heat and stir in 1 oz. Parmesan.Step 3Divide pasta among bowls. Top with more Parmesan and 1 cup basil leaves. Drizzle with oil.How would you rate Burst Cherry Tomato Pasta?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleBought a big box of cherry tomatoes and didn't know what to do with it. Of course I had to make this recipe for lunch! It is so easy - by the time the pasta is done, the sauce is done as well. Toss them together and voila, the perfect pasta. Tangy, sweet, savory, umami. I keep wanting to eat more but had to pace myself - carbo load! AnonymousVancouver, BC3/11/2022Very good!  I made a smaller portion so I used grape tomatoes and 4oz. Tomato sauce and 1/2 tsp. Of sugar.   I did smash them all.  Otherwise I followed recipe.  I love fresh basil but next time I will use a little less.  Romano cheese of course.  AnonymousOmaha NE1/11/2022My family loved this I added shrimp in close to the end and dished it over a bed of linguini. Delish!!Ann S,NY NY10/14/2021Wow, I just finished eating and it’s so delicious 🤤 thank you\nI might make this a weekly mealSam HMichigan9/5/2021It was easy and very tasty. It's a very good recipe for summer when you don't want to use the oven. The recipe is fast and very few ingredients.\nAnonymousNew Jersey7/7/2021We love this recipe. I have made it countless times over the past 2 months and probably will do so for months to come. It is easy, fast and very satisfying. Thank you!!AnnStratford, Ont6/28/2021I don't usually leave reviews for recipe but this tomato pasta is toooo good that I HAVE to give it a credit and show my appreciation! AliceTaiwan3/20/2021This is such a nice recipe - light flavours that really stand out individually. It is best with cherry tomatoes right from the garden but when I don't have enough I use a mix of home grown and either a 400g tin of diced tinned tomatoes, or some shop bought cherry tomatoes. I throw in a bit more garlic and lots and lots of basil because my plants are prolific, as well as a pinch of brown sugar if it needs it. A half tsp of powdered beef stock adds some depth as well.Anonymous1/30/2021Amazing with Late late summer tomatoes and basil. AnonymousDurham, NC10/18/2020We made this for the second time.  It's incredible and so easy.  We did add a little pasta water and it became very creamy.  A great way to use a variety of different color \"tiny\" tomatoes from the farmers market.AnonymousChicago area10/16/2020LOVE this recipe. I've made it twice already and it's incredibly easy and super flavorful. AnonymousKansas City, MO10/11/2020While I get that most recipes are slight variations of others it’s interesting that this recipe is almost an exact copy of one in the six seasons cookbook by Joshua McFadden. Perhaps you could say he influenced you in your recipe instead of just taking is almost exactly and printing as your own. Anonymous9/25/2020This recipe is amazing. I didn't have all the cherry tomatoes it called for, so I subbed in some red and yellow bell peppers. Now I make it that way every time. Quick, easy and delicious!Diamonddeb12Richmond, IN9/15/2020Delish and super easy.  We used tomatoes and basil from the garden, vegan Kite ravioli for a bit of protein.AnonymousChicago, IL8/29/2020Loved this dish--so simple to make and easily vegan. I used casareccia pasta and it worked perfectly. I even had it for breakfast the next morning.AnonymousAUSTIN8/15/2020Explore Bon AppétitPastaItalianEuropeanCherry TomatoTomatoVegetablePennePasta & NoodlesRigatoniSummerWeeknight MealsQuickEasyMainNut-FreeVegetarianSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Molly Baz"]}