{"id": "40bf3c235764b80bbf85446929550d77", "url": "https://www.bonappetit.com/story/best-reusable-silicone-lids-gir", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "The Silicone Lids That Are Keeping Me from Singlehandedly Ruining the Planet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Reusable Silicone Lids That Are Keeping Me from Singlehandedly Ruining the PlanetEnough with the plastic wrap!By Dayna EvansApril 18, 2018FacebookTwitterEmailFacebookTwitterEmailI like to think—because I recycle, carry a reusable coffee mug, and have never been on a cruise—that I register as above-average on the Are You Sincerely Trying to Reduce Your Carbon Footprint scale. Not as thoughtful about how I treat the earth as some, slightly more thoughtful than others. It helps me sleep at night.But blind spots, when combined with sheer stubbornness, abound. I have a particular weakness for paper towels, as well as Amazon deliveries of paper towels, and I run through plastic wrap and aluminum foil without even considering how much I am using and how bad they are for the preservation of our planet. Like death and taxes, plastic wrap and aluminum foil have always felt like inevitabilities. Ya can’t live without em...and ya can’t live without em.I had two GIR silicone lids taking up a small but obnoxiously noticeable amount of space in my kitchen drawer. Available in five round sizes and three rectangular sizes, the lids are intended to “turn any bowl into a storage container,” and they’re microwave, dishwasher, freezer, and oven safe. I had been gifted 4” and 8” round lids over a month ago and out of laziness, I had both never tested their functionality nor thrown them out. But on one random weeknight, my hands otherwise full with cooking utensils, I unthinkingly grabbed for the larger of the two to cover a bowl of soup I needed to stay warm. Instead of laboring over an unwieldy spool of plastic wrap, my soup was instantly shielded from leeching heat. The next day, I employed the same lid when heating up the same soup in my microwave. My plastic wrap—untouched—gently wept.A new world of environmental consciousness opened up to me. At a dinner party, I could cover a just-baked blueberry crumble with a 9x13 rectangular lid instead of several yards of foil to keep it warm until dessert time. If I felt wasteful washing the bowl I had leftovers in just so I could transfer them to another storage container, I could put the bowl directly in the fridge covered with one of these flat silicone bad boys. Instead of getting mad that the coffee I made at home got cold too quickly, one of the smaller lids would suction lightly to the top of my mug.There are some things GIR lids can’t do—double-wrap bacon to put in your freezer, tent an oven-roasting turkey—so I haven’t fully broken up with plastic wrap and aluminum foil yet. I also wouldn’t recommend flipping your bowl over to see if your soup stays sealed inside, as they’re not, in my experience, made to be totally topsy-turvy secure. But the seemingly obvious technology (it’s just a lid, after all) makes reheating, keeping warm, covering, and protecting much more earth-friendly and simpler activities. I’ve used them more than any other tool in my kitchen lately, and let me tell you: I’ve been sleeping great.Buy It: GIR Silicone Round Lids, $10 on AmazonRelated: The Best Insulated Bottles for Keeping Drinks Cold or HotAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-18", "author": ["Condé Nast", "Dayna Evans"]}