{"id": "40ce93c25251a1555b7f5432cfe436e1", "url": "https://www.bonappetit.com/recipe/caramel-crunch-chocolate-chunklet-cookies", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Caramel Crunch–Chocolate Chunklet Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramel Crunch–Chocolate Chunklet CookiesBy Dorie GreenspanOctober 25, 20213.3(72)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThese not-your-average chocolate chunk cookies boast big caramel flavor—but there’s no caramel in the ingredient list. Instead, the sugar and butter in these slice-and-bake one-bowl cookies brown in the oven for a deeply sweet, nutty, caramelly flavor, and the cookies are baked in muffin tins for extra toasty, crisp edges. If walnuts aren’t your thing, feel free to substitute with more chopped chocolate. From Baking with Dorie: Sweet, Salty & Simple by Dorie Greenspan, out now.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMuffin Pan$10 $9 At AmazonElectric Mixer$40 At AmazonBamboozle Nesting Bowls$80 At Bon Appétit MarketWire Cooling Rack$17 At Bon Appétit MarketScale$25 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes 24½cup (100 g) granulated sugar½cup (55 g) powdered sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1cup (2 sticks) unsalted butter, cut into pieces, room temperature, plus more for pans1tsp. vanilla extract2¼cups (281 g) all-purpose flour3oz. bittersweet, semisweet, or milk chocolate, coarsely chopped½cup coarsely chopped walnutsPreparationStep 1Using an electric mixer on medium speed, beat granulated sugar, powdered sugar, salt, and 1 cup butter in a large bowl until creamy, about 2 minutes. Beat in vanilla; scrape down sides of bowl. Add flour and pulse mixer a few times, then beat on low speed until flour is almost fully incorporated, about 1 minute (don’t overbeat; dough should be more clumpy than smooth). Beat in chocolate and walnuts just to blend.Step 2Turn dough out onto a surface and knead gently to bring together. Divide in half and form into 6\"-long logs about 2\" in diameter (no need to be perfect about shape of logs). Wrap in plastic and chill until firm, at least 2 hours.Step 3Place racks in upper and lower thirds of oven; preheat to 350°. Butter 2 standard 12-cup muffin pans. Unwrap logs and mark at ½\" intervals, then cut into rounds with a chef’s knife. Place rounds in muffin cups.Step 4Bake cookies, rotating pans top to bottom and front to back halfway through, until golden on top, browned around the edges, and slightly soft in the center (cookies will firm up as they cool), 20–22 minutes. Let cool in pans 3 minutes, then transfer cookies to wire racks and let cool completely.Do Ahead: Dough can be formed into logs 3 days ahead; keep chilled, or freeze up to 2 months. Thaw 1 hour at room temperature or overnight in the refrigerator before slicing and baking. Cookies can be baked 7 days ahead; store airtight at room temperature.Excerpted from ‘Baking With Dorie: Sweet, Salty, & Simple’ 2021 by Dorie Greenspan. Reproduced by permission of Mariner Books, an imprint of HarperCollins Publishers. All rights reserved.\n\nBuy on Amazon or Bookshop.orgHow would you rate Caramel Crunch–Chocolate Chunklet Cookies?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleSugar. . . Sugar ... Sugar.  Butter . . Butter . . . Butter.   NO. . .  NO. . . NO.LLGreenwich Village, NYC2/12/2022As soon as I finished making these cookies, my family devoured a whole batch of them, so I would disagree with some of the negative reviews here.  The dough is a little dry, but I found after kneading well it turned out fine.  The title is definitely misleading, but the end result is still delicious- totally worth making again!AnonymousSacramento, CA1/21/2022I'm amazed at so many negative reviews - these were delicious with a shortbread flavor, but a bit more chew. I left out the walnuts and they were perfect. I hesitated to try these because I didn't like the look of the cookie in the photo, but mine didn't have that raised edge from the muffin tin - the cold, sliced rounds stayed sharp even through baking. And mind were much more lightly golden - I baked them 25 mins and they were just getting brown on the edges. I was nervous when I saw the crumbly dough, but it pulled together perfectly with just a bit of kneading in the bowl. These are my new favorite!nonaluAsheville, NC1/17/2022So phenomenal that I now want to bake my next cookies (peanut butte, molasses, cookie butter & molten chocolate this way). Mine didn't quite caramelize as shown in the pics AND needed longer bake times, but wow, the flavor! Agreed, the choc chip ones tasted more like shortbread, but the heat from being directly on metal on bottom and eventually on sides as cookies expand give a great texture inside and out and flavor seems a little more intense possibly because of restricted spreading. A definite winner!GlennPalm Springs11/22/2021Did you forget an egg or two.  Cookie was too dry.  It needed something more.Pat MoseleyÇhicago 11/18/2021Dry and uninspiring.  Won't make this again.WillieDundas, ON11/15/2021Absolutely loved the flavor of these cookies. I was expecting more of a gooey caramelization so I overbaked them a bit. By the picture I expected a soft and gooey cookie but these are delicious shortbread instead. Happy surprise! I expect these cookies to become a regular part of our rotation. Elizabeth SchipperBozeman, MT11/14/2021These are great. Took a little longer than the recipe called for for mine to become the golden brown in the photo. Not sure what some other commenters took issue with — these are shortbread cookies. Maybe folks were expecting a soft and chewy cookie?Lucy11/12/2021This recipe made a delicious and beautiful little shortbread cookie.  It’s important that 1) you use chopped chocolate from bars, not chips and 2) the dough should be kneaded well after bringing the dough together. Both will help you to easily slice the cookies after refrigeration and help them hold their round shape.  AndreabakesNew Jersey11/8/2021I made these yesterday, thinking bonappetit could only offer terrific recipes. Boy, was I wrong!  These were tasteless, hard, and dry! I followed the recipe and directions carefully.  My family, my guests, and I all thought they were awful.  Don't invest your money in the ingredients or your time in the prep of these disappointing cookies.CarolWarren Ohio11/8/2021I had reservations about proceeding with no baking soda/powder and no eggs.  Following the recipe exactly and even after several attempts, I was disappointed.  I understand this is a shortbread cookie, but it was dry and underwhelming.  The color was light, the cookie dry and none of the caramelization flavor.  I think the takeaway here is the technique.  I plan to cook my favorite cookie recipe in a buttered tin.  This cookie might have benefited by using brown sugar.  I don't though.  I feel like I wasted $ and time on this one.  TautoArizona11/7/2021For the one making these for a vegan friend, unless you have a really good butter substitute, they won’t be vegan even without the eggs. Dragonphile Ottawa, Canada11/7/2021I wanted to love these but the extra step of making them in the muffin tin was extraneous as it added work without the big ‘wow’ return I’d expected. They baked in the suggested amount of time, but the result was just over cooked shortbread. I didn’t get a real caramel flavor out of them. I baked the other half of the recipe the next day for 14 min just on a piece of parchment and they were well received (and I was glad I hadn’t baked the whole batch at once). AbigailMcMinnville, OR 11/6/2021These are delicious, crispy edged shortbread cups with walnuts and chocolate. Don't let the other reviews fool you - if you follow the recipe, you'll get the desired results. I do think the \"caramel\" in the title throws off the expectations a little, but in no way does this disappoint. My only mistake was eye-balling the cutting of the rounds and I ended up with 21 cookies instead of 24. Will definitely make again.ElizabethSanta Barbara, CA11/6/2021terrible. really bad. Don't make these. FlyingFork Kaneohe, Hawaii 11/5/2021Explore Bon AppétitCookieDessertChocolateOther IngredientsWalnutNutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-25", "author": ["Condé Nast", "Dorie Greenspan"]}