{"id": "40d6325946f8d334236da0c230e9ce71", "url": "https://www.bonappetit.com/story/rabbit-wine-bottle-stopper", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The Wine Bottle Stopper That Saves Me From a Wicked Hangover   | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Wine Bottle Stopper That Saves Me From a Wicked HangoverAnd keeps my wine tasting better longer.By Rachel KartenJune 20, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My wine-drinking life is divided into two periods: B.G.W.S. and A.G.W.S. That is, Before Good Wine Stopper and After Good Wine Stopper. Back in the B.G.W.S. days, I re-used the other end of the original cork, which I may or may not have accidentally already thrown in the trash, or jammed a hideous zebra head cork I got from an ex into my bottle. But more often than not, I’d just end up finishing the entire thing, because I didn’t trust any of my other options. Yeah, there were many hangovers during the B.G.W.S. era.Then during a late-night Amazon binge, I bought a pack of Rabbit bottle stoppers, and entered the era of A.G.W.S. These bottle stoppers are made with rubber and stainless steel to provide an actually-airtight seal. For real, I’ve left a bottle with one in for a week or so, and it tasted just as good as when I first opened it. Another bonus: Each stopper has rubber ridges and a funnel-like shape, making it easy to remove. My teeth are very happy to no longer have to pull out an old cork. They’re not too bad looking either, with a sleek shape and fun colors that are way more sophisticated than the random zoo animal heads that used to poke out of my bottles.Do I still finish a bottle every once in a while in this new A.G.W.S. era? Sure. But is it because I am afraid it’ll go bad in my fridge? Definitely not.Buy it: Rabbit Bottle Stoppers, $10 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendWineShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-20", "author": ["Condé Nast", "Rachel Karten"]}