{"id": "40e4c5cda167f4ca583b0123686df829", "url": "https://www.bonappetit.com/story/its-that-simple-green-gumbo", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "A Giant, Freaky, Joyful Pot of Greens to Redeem My Butter-Drenched Soul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Giant, Freaky, Joyful Pot of Greens to Redeem My Butter-Drenched SoulGreen gumbo makes stuffing your face with veggies a pleasure, not an obligation.By Amiel StanekJanuary 24, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Anna BillingskogFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.If I told you that I was eating stewed greens and rice—and only stewed greens and rice—for dinner, it would be reasonable to assume that I had something to repent for. That I had to make up for a weekend-long burger bender, say, or course correct after an evening of particularly meaty eating.And most of the time you'd be right: As a person who has worked in the food world in some capacity for close to 12 years, I find myself needing that kind of hard restart on the regular. But if you were to assume that I sit down to said bowl of stewed greens and rice begrudgingly, with anything other than joy and absolute relish in my heart, well, that's where you'd be wrong, friend. Because if I'm eating stewed greens and rice, I'm eating green MF gumbo. And it couldn't be more exhilarating—or simple—to make.I was first introduced to green gumbo in an essay by John Thorne—one of America's best and most underrated food writers, IMHO. In it, he describes a storied Creole dish that bears almost no resemblance to the meaty, roux-thickened stew that most of us know to be gumbo. Rather, gombo zhebes is a brothy, hearty celebration of all things leafy, and reflects a notion of what constitutes a \"green\" that is far more generous and expansive than our own.Radish tops. Romaine. Turnip greens and arugula. Bitter chicories and parsley and spinach and chard. If it's greenish and a leaf, it has a home in the pot. Green gumbo is a celebration of the garden and all of its diverse delights. To me, the thrill of this dish is the opportunity to cook and taste a crazy variety of green things together, many of which—lettuces, herbs—we're otherwise told to never, ever subject to the heat of the stove. Freaky-flexible, it's the ultimate all-in fridge clean out meal, but also one worth doing some shopping for if you're really in the mood—which for me is kind of all the time.Here's how my by-no-means-traditional green gumbo comes together. Start by heating a good glug of olive oil over medium heat in a big Dutch oven. If you happen to have some kind of salty, fatty pork product lying around—a few strips of bacon, a nug of pancetta, a bit of chorizo—then chop up a few ounces and let it sizzle until it gets crisp and some of the fat renders out. (Vegetarians, don't sweat: It's great without pork.) Then throw in 1 chopped pepper (I like poblano, but any not-too-spicy guy will do), the chopped white parts from about 6 scallions (save the green parts for garnish), 3 chopped celery ribs, and 4 well-smashed garlic cloves. Hit everything with a big pinch of kosher salt and a sprinkling of red chile flakes, and let that cook, stirring occasionally, until it all goes soft, about 5 minutes.All green everything.\nPhoto by Chelsie CraigThen it's time for the greens. You want 8-10 cups of torn greens in total, a combo of any/all of the following: arugula, romaine, escarole, mature spinach, endive, radicchio, radish tops, turnip tops, dill, parsley, cilantro, basil, chard, beet greens, fennel fronds, chard, mustard greens, kale, collards. (In general, I like to avoid anything too delicate like baby spinach, sprouts, or microgreens, which tend to get slimy.) Add the greens to the pot in rounds, stirring in between each addition so that each couple of handfuls has the opportunity to wilt and make room in the pot for the rest. Then add just enough water to barely cover the contents of the pot. Once the whole mixture comes up to a boil, cover the pot, lower the heat, and simmer until the greens are no longer bright green but not quite until they're dark-dark, which will take 20-30 minutes depending on the lineup of greens. You want to cook them long enough that each individual green still tastes like itself but has had an opportunity to give some of its unique goodness to the cooking liquid. Add a splash of vinegar (I like apple cider), taste, and add more salt and/or vinegar if needed. You're eating a big pot of greens for dinner, so season it like you mean it—the flavor should pop.Mound some steamed white rice into a shallow bowl, ladle over a great big sloppy scoop of greens and the accompanying broth, and garnish with thinly sliced scallion greens, a few dashes of vinegary Louisiana-style hot sauce, and maybe some lemon wedges for squeezing over. Close your eyes and give yourself a chance to really taste all of the elements that made their way into your green gumbo, how each bite is wild and different. Make yourself a second bowl. And a third. And don't stop until you're so full of vegetables that you want to lie down on the couch and moan with pleasure.And that's how you make a pot of greens that always tastes like joy, never obligation.About that pot of rice:The Perfect Pot of RiceEver wondered how to make the perfect pot of rice without a rice cooker? We got you.View RecipeExplore Bon AppétitIt's That SimpleCollard GreensKaleLeafy GreensherbMustard GreensDandelion GreensRadicchioGreen Onion ScallionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Amiel Stanek"]}