{"id": "40f9d45b4ab13b1bf15d5cf9d429427f", "url": "https://www.bonappetit.com/story/beth-nguyen-beef-stroganoff", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "I Thought Beef Stroganoff Was For Fancy People, Until I Made It My Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought Beef Stroganoff Was For Fancy People, Until I Made It My OwnAs a Vietnamese refugee growing up in the Midwest, I spent a lot of time trying to figure out what American was supposed to mean. Turns out I already knew.By Beth NguyenMarch 16, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by D’mytrek BrownFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.I didn’t grow up eating beef stroganoff; I grew up thinking about it. This was the ’80s, in a mostly white Midwestern town where my Vietnamese refugee family had been resettled and where I had to get used to friends calling my grandmother’s food weird, smelly, and gross. They’d run away from her stir-fries and pho, back home to the meatloaves and tuna casseroles we thought were weird, smelly, and gross. But their food was everywhere and ours hadn’t yet been mainstreamed or appropriated, so I spent a lot of time trying to figure out what American was supposed to mean. I studied commercials, kept track of what characters ate in the books I loved, like the tomato sandwiches in Harriet the Spy. I thought all named foods—Salisbury steak, chicken à la king, beef stroganoff—had to be fancy.I had my first taste of stroganoff when I was seven years old and for years after would wonder how to get back to that moment: my friend Tara’s house, so large that it had its own formal dining room, a table covered in breakable dishes, cloth napkins that Tara and her parents placed on their laps. It was winter break; garlands lined the fireplace and wound around the banisters. Under the Christmas tree, already-opened presents were on display. Everything about Tara existed in a neighborhood, a world, far from what my sister and I knew. Invited to spend the day, we kept looking at each other for clues: How were we supposed to behave?Beth Nguyen (left) with her sister, Anh\nAt home with our family, dinner was a free-for-all. The rice was kept warm in its cooker. The only time I used a napkin was when I spilled something. My sister and I loved our grandmother’s bò kho, beef stew with hints of star anise, and bún bò, lemongrass beef with rice noodles. But at Tara’s house we sat down to yellow egg noodles slicked with a gravy of beef cubes. I’d never had such a thing before. It looked straight out of a commercial, and for a moment I pretended I was in one, trying to memorize the salty silkiness of the sauce in case I never got to taste it again.Not until college did I discover packets of noodles labeled “stroganoff” at the grocery store. All I had to do was boil water, milk, and butter, then pour in the noodles and powdered sauce. Add your own beef, the directions encouraged, but even without it you’d get a thick sauce that coated the noodles and tasted exactly like Tara’s. I’d imagined her mother surrounded by complicated cookbooks, but now I understood: The idea of fancy wasn’t theirs; it was mine.The beef stroganoff of my childhood imagination was rooted in a midcentury Midwestern American take on a vaguely Russian-French dish that might have been inspired by the Stroganov family, might have been food for the wealthy or food for the poor. The history of stroganoff is the history of migration, adaptation, and story making. Today you can find dozens of interpretations. Some involve ground beef; some are casseroles with cream of mushroom soup. You can use pasta or rice or potatoes. Beef stroganoff has so few rules you don’t have to worry about breaking any.I started making my own version after I had kids. I didn’t realize it then, but I wanted to return to that childhood space of discovery—and make it better. It took a few years to get to this recipe, with a sauce that sometimes involves a demi-glace. Instead of sliced beef I pan-sear a larger piece to avoid overcooking. Mushrooms are quick-sautéed separately and then added at the end. My secret ingredient is the same one every Vietnamese person has: a tiny bit of fish sauce, for depth and umami. You can’t taste it, but you need it. And then a few scissor snips of scallion over the finished dish. This beef stroganoff would be unrecognizable to my seven-year-old self, but it will always connect me to her.I don’t remember what happened to Tara, if she moved away or if we stopped being friends; my sister and I were never invited back to her house. But on chilly days when beef stroganoff sounds comforting, I think about her and that meal at her house. I spent so much of my childhood trying to discern the unspoken standards of American life, not realizing that I could be part of the conversation too. That my family already was. That we can use the same ingredients to make wildly different dinners and maybe try something new. Cooking, after all, is about hope and learning. In the kitchen I’m not thinking about being Vietnamese or American. I’m thinking about time and timing, the efforts made and the risks taken. I’m hoping that the thing I make will be good enough to remember.Make the recipe:Beef StroganoffA splash of fish sauce adds instant umami in author Beth Nguyen’s take on this classic dish.View RecipeBeth Nguyen is the author of two novels and the memoir Stealing Buddha’s Dinner.Explore Bon AppétitAll on the TableFirst PersonRead MorecultureWith Mommy, Food Wasn’t Simply Sustenance—It Was an Adventure and a CelebrationBy Maya L. HarriscultureI Didn't Really Know My Mother. But I Did Know Her PilafBy Nadia OwusuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Beth Nguyen"]}