{"id": "40ff13cfa39fa9a579dcd700a8fb4689", "url": "https://www.bonappetit.com/story/women-craft-beer", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "What It's Like to Be a Woman in the Craft Beer Industry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat It's Like to Be a Woman in the Craft Beer IndustryWomen working in craft beer have been anonymously sharing experiences of sexual harassment, sexual assault, and racism on the job. Some are speaking out.By Devi JagsMay 28, 2021FacebookTwitterEmailPhoto by Matt HaasFacebookTwitterEmailIt was a spur-of-the-moment post on Instagram. “Do you get sexist comments on the job?” Brienne Allan, a production manager at Notch Brewing in Salem, Massachusetts, asked on her account, @ratmagnet. It was Tuesday, May 11, and her first day out of the house since the COVID-19 pandemic. “I was going to build a new brewhouse and two of the contractors said some comments that pissed me off,” she said in a phone interview. “So I posted, and then it went viral.”Since then, she has received over 1,000 messages on Instagram, detailing sexist comments in the workplace as well as accusations of alleged racism, sexual harassment, and sexual assault against some of the most high profile breweries and their workers. Allan began reposting these stories, keeping the identity of the survivors anonymous. In the wake of these allegations, a few industry workers in craft beer and local guilds (non-profit state associations that promote the interests of brewers/breweries in the region) were reportedly called to step down from their positions. Industry groups like the Brewers Association, American Society of Brewing Chemists, Craft Beer HR Professionals Group, Master Brewers Association of the Americas, and Pink Boots Society launched an investigation into the allegations.Allan didn’t anticipate the shockwave that hit both her inbox and the industry as a whole. “I’m getting hundreds of requests for interviews,” she says.As more stories come to light, bringing the #MeToo movement into the craft beer world, I spoke with three women who originally shared their experiences with Allan about what they experienced and what reforms are necessary for change.What Working in Craft Beer Has Been LikeMegan Stone, media coordinator at Societe Brewing Company in San Diego, California: “In a previous job, I can’t even count the amount of times I would cry due to the severity of my toxic work environment. I was once called a ‘bitch’ and one boss told everybody he was ‘going to fuck me straight’ because I asked for simple handoff meetings [where managers exchange information in between shift changes]. Whenever I tried to report these things at the many previous breweries I worked at, I experienced gaslighting. I was told that things were in my head, that people probably didn't mean the things they said even though I was bringing repeating issues to my supervisors. HR would always say that, if no one else was around to witness the bullying or harassment and if it didn't leave a bruise, then there was nothing they could do about it. As a woman, I’ve constantly had my ability and knowledge questioned.”Erin Wallace, owner of Devil’s Den in Philadelphia and local chapter leader of Pink Boots Society, a women-led organization focused on career advancement in the beverage field: “I had the opportunity to purchase my restaurant from a family member and turn it into a craft beer bar in 2008. There was an incident when an employee and I went for lunch and he made a comment about how he’d really like to take me to a hotel. We had a conversation about how inappropriate it was and that he could not say anything like that again. He agreed, but a few months later he said he had a gift for me but one he did not want to give me in front of my husband or his wife. I told him he shouldn’t give me the gift. A month later, I came into work and he made another comment about how the boots I was wearing were making him ‘hard.’ As an owner, I felt helpless because I don’t have management to report to. So even when I am a woman in a position of power, men are still trying to take our power.”Chanell Williams, craft beer blogger and influencer based in Seattle: “I have held numerous positions in craft beer distribution nationwide. When it comes to sexism in the industry, the overarching mindset is to suck it up and deal with it. And as a woman of color, I feel like I am always having to hold on, even through the pain, even through abuse, offhand comments, and microaggressions. I once attended a beer festival to network and break into the industry. Going into those spaces as a single woman, I was already wary of the types of behaviors I might encounter. I was working relentlessly to make a name for myself back then, and a group of men requested a picture with me. Being in the influencer role, this request was not out of the ordinary. I stood between them to take the photo and one of the men reached out and grabbed my breast. I slapped the man’s hand away and said, ‘Excuse me. Don’t ever touch me again.’ They all just laughed at me.Later, I was hired for a job through a manager I met at the festival. Two months into the job, a colleague realized it was his father who grabbed my breast. He sent me a message, trying to apologize for the violating behavior on behalf of his father. The message said, ‘If I were to call my dad anything, it would be silly. I know he didn't mean anything by it. Not that it's an excuse. Again, I just feel like I had to suck it up.”How the Craft Beer Industry Needs to ChangeMegan Stone: “First and foremost, women need to be believed and supported. They need to be taken seriously when they raise these red flags about their experiences. I feel like a lot of the time we get written off as being dramatic or exaggerating. And when women share their experiences, it's not just the responsibility of the brewery, but the responsibility of local guilds and the Brewers Association to do something greater than share another sexual harassment course. There's been a massive lack of support for victims and that needs to change. I think that the people who have had serious accusations, especially multiple accusations, need to be investigated—no question. There's also a responsibility for consumers to do some research and see what you are supporting and where your money is going.”Erin Wallace: “The Brewers Association has a code of conduct. They have a place where you can file a complaint. Before these Instagram stories, I don’t think many people lower in the brewery job chain knew that was an option. I had never known that. (Editor’s Note: This code of conduct was enacted on August 6, 2020, so the association only considers complaints after that, according to the website.) But also, if a brewery is not a member of the Brewers Association, what options are there? It's the same with local guilds. The Brewers have to join the guild and they have to join the Brewers Association to be able to be held accountable for the code of conduct. If they don't join, then you have to go to a state organization, like the police department, and every state has different rules and regulations. Maybe it would be best if there were a third-party organization for the industry that is more open and easy to find and also not owned by a certain guild or association.As of this week, I sat on the board of Philly Loves Beer. I was the first woman voted onto the board. I found it really hard to consider myself an advocate for women when accusations were made against people that I sit with on the board. (Editor’s Note: Another board member has stepped down after allegations of a hostile work environment, according to reports by the Philadelphia Inquirer.) I decided I could not justify being a part of a group that is accused of treating other people the same way I have been treated in my career. I hope that me...stepping down shows that I can’t stay silent, and that Philly Loves Beer should make a good action plan moving forward.”Chanell Williams: “Even with my trauma in this industry, I haven't given up on it. I am almost always the only person of color in my brewery space, but I still want to create change within the industry and I am more than qualified to do it. Some of these stories are so disheartening, from allegations of sexual assault to being fired for being pregnant, and no one is held accountable. (Editor’s Note: The pregnancy discrimination court case is currently pending.) There needs to be a complete restructuring of breweries, with more extensive training of what discrimination and harassment mean. These companies need to revamp their HR, and get women and people of color in leadership and management. I want to see myself reflected in my management. I want to feel comfortable talking to someone on my team about any situations that may occur, from getting harassed by an employer to getting stalked by a patron of the brewery. People need to be held accountable.”Explore Bon AppétitBeerRestaurantsBreweriesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-28", "author": ["Condé Nast", "Devi Jags"]}