{"id": "410e09253c66e01a3bb397365f46080d", "url": "https://www.bonappetit.com/story/clam-key", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "The Clam Key Is My Fastest Route to Fresh Seafood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Clam Key Is My Fastest Route to Fresh SeafoodHow many clams could a clam shucker shuck if a clam shucker could shuck clams? (A lot.)By Jessica KellyAugust 3, 2021FacebookTwitterEmailPhoto by Emma Fishman, styling by Kat BoystovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Raw oysters get all the love, but my heart belongs to raw clams. With their meaty texture, salty liquor, petite size, and hint of sweetness, raw clams are perfect for slurping on the half shell with a squeeze of fresh citrus, a generous sprinkle of celery salt, and a heavy dose of a cayenne-based hot sauce. The problem we raw clam lovers run into is that they’re not as readily available at restaurants as raw oysters or steamed clams, and if they are, they’re comparably very expensive. And while you can get a deal on raw clams at seafood markets, there remains the issue of getting them open.A traditional clam shucker resembles a bread knife with a dull, rounded tip and a long, sharp edge. You run the sharp side along the seam of the clam shell, applying pressure until you can wedge the blade in between the top and bottom shells and pop the clam open. Too much force and you’ll shatter the clam’s delicate shell and end up with shards in the meat. Not delicious. Despite watching countless how-to videos, I can’t tell you how many clams I’ve ended up steaming after giving up on shucking them.But then, while on vacation in Cape Cod, I came across the Clam Key by SeaScissors. With a sharp, tapered, pointy tip (like a tiny spear!), the Clam Key didn’t look like any clam knife I’d seen before. Instead of applying steady, even pressure on the seam of the shell like you do with a normal clam knife, you insert the tip of the Clam Key into a spot near the hinge. This, according to SeaScissors, is the clam’s “Achilles’ heel,” a weak spot where the ligament that holds the shells together ends. The body of the Clam Key is very thin, so it slips right in, allowing you to sever the muscles that attach the clam to the shell using a smooth, side-to-side motion. Then turn the Clam Key 90 degrees—like a key, get it?—and watch the shell pop open.As I shucked clam after clam with ease and speed, I realized the Clam Key was about to revolutionize my relationship to my favorite bivalve. Never again would I need to choose between steamed clams at home or expensive raw clams at a seafood restaurant. Now, would someone pass the Frank’s RedHot?Photo by Emma FishmanClam Key$8 at SeaScissors$13 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-03", "author": ["Condé Nast", "Jessica Kelly"]}