{"id": "41358c5ce80debb7ee8537697d8223fc", "url": "https://www.bonappetit.com/recipe/pizza-al-taglio-with-onion-and-provolone", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Pizza With Onion and Provolone Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssuePizza al Taglio With Onion and ProvoloneBy Jake BagshawNovember 19, 20194.3(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintTwo one-pound balls of store-bought pizza dough will work in a pinch, but if you’ve got time to plan ahead, nothing beats homemade. This dough is springy-crispy-chewy like focaccia. You’ll need 24 hours from start to finish, during which time the dough will develop complex flavor, but most of that process is inactive, so it basically makes itself. The onions char and sweeten in the oven and pair perfectly with sharp provolone cheese. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.IngredientsMakes two 18x13\" pies5tsp. kosher salt, plus more6½cups bread flour¾cup spelt or whole wheat flour1¼-oz. envelope active dry yeast (about 2¼ tsp.)3Tbsp. extra-virgin olive oil, plus moreAll-purpose flour (for dusting)10oz. aged provolone cheese, thinly sliced2large onions, diced into ½\" pieces10oz. low-moisture mozzarella, gratedFlaky sea saltFreshly ground black pepperPreparationStep 1Combine 5 tsp. kosher salt and 3 Tbsp. water in a small bowl and stir to dissolve salt; set aside.Step 2Whisk bread and spelt flours and yeast in a large bowl to combine. Add 3 Tbsp. oil and 3 cups room-temperature water; mix with a rubber spatula until a large shaggy mass forms. Knead in bowl until dough forms a rough ball, about 4 minutes. Let rest, uncovered, 10 minutes.Step 3Add reserved salt water to dough and knead until water is incorporated (dough will be very wet and shaggy), 5–10 minutes. Generously oil a bowl that is at least twice as big as dough and place dough in bowl; cover with plastic wrap. Let rest at room temperature 30 minutes.Step 4Transfer dough to a clean work surface and fold in half over itself 3 times, turning 90° after each fold. Return to oiled bowl, arranging seam side down. Cover tightly with plastic wrap and chill dough overnight (it should double in size).Step 5Place dough on a lightly floured surface and divide in half. Lightly flour tops of dough. Working with 1 piece at a time, fold each corner into center of dough. Rotate 90° and repeat process until you have a neat ball. Turn dough, seam side down. Generously flour two 18x13\" rimmed baking sheets and place a ball on each baking sheet. Cover each with a damp kitchen towel. Set in a warm spot; let rise until dough is very relaxed, supple, and doubled in size, 2–3 hours.Step 6Place racks in upper and lower thirds of oven; preheat to 500°. Transfer dough balls to a work surface and lightly oil baking sheets. Lightly flour work surface and set 1 ball of dough on top, seam side up. Release some air by pressing down into dough with your fingers. Stretch dough; continue working with your fingers until it is about the same size as baking sheets. Transfer to a baking sheet and stretch to fit, pressing into corners. Repeat with remaining ball of dough.Step 7Scatter provolone over dough. Top with onions, then mozzarella. Drizzle with oil; season with kosher salt. Bake pizzas, rotating top to bottom and front to back halfway through, until crust is golden brown and onions are charred in spots, 12–15 minutes.Step 8To serve, drizzle pizzas with more oil and season with sea salt and pepper; cut into squares.How would you rate Pizza al Taglio With Onion and Provolone?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI really enjoyed this! I subbed smoked gouda for provolone. The dough came out great even though I made some mistakes, like adding the yeast in with the water and a shortened proof time. I also had to bake longer than recommended. I will definitely make this again and for guests.Christine M.California3/14/2021WOWWWW!!!!!! First bite was like heaven. I made it 100% following the recipe until the end, kept it in for an extra 5 mins and added thyme and crushed red pepper to the top. I will say something (dough or toppings) ended up a little bit salty but I will chalk that up to being my fault. AnonymousNOLA6/3/2020Awesome stuff here. Use whatever toppings, pepperoni and onions are good, try some  shrooms and Italian sausage, a toss of olives, but go with a good provolone as a cheese base, then go with other cheeses, fresh mozzarella, Chihuahua or Oaxaca, some swiss, mix and match; it's your pizza.  Think of Bagshaw's recipe as a base then make it to your ownAnonymousBowery, NYV4/17/2020looks great except, it sure looks like there is a little tomato sauce mixed in there which I think looks great.  I will add that if I try this .  \n\n\n\n\n\n\nRichie_721Sarasota, FL4/16/2020I made this from the winter magazine; it was awesome. Had a bunch of people over and it was a perfect party food. I made one with these toppings and then one margherita-style. I used sliced onions and added some thyme as well before baking. I feel like it needs a little something herby to bump up the flavor, or maybe I just needed more salt. Anyway, it was delicious and easy and I'll be making it again soon.natnatchiChicago3/27/2020The key takeaway to this recipe is the provolone cheese slices. The recipe calls for diced onions, but the photo showed sliced onions and that's what I used. I did add some green onions also. Took it easy on the olive oil and did not add it at the end. I used my own go to pizza dough recipe and it worked well, so don't be afraid to substitute different. But the slices of provolone, those make the difference!AnonymousMid-Atlantic1/15/2020This pizza is magic, the way the onions caramelize between the layers of cheese. But it does need some extra spice, maybe rosemary, to liven up the cheese. And as other commenters have said, even with a half-batch, I had to keep the pizza in the oven for a while longer.AnonymousNew Haven, CT1/10/2020Takes a bit more time to cook depending on your oven but is by far the best pizza dough recipe I’ve made! Also added prosciutto on top which came out great!Anonymous12/29/2019So this was good, but mine didn’t look as golden and appealing as this one in the pic. The dough did take a long time, and I used my stand mixer with a dough hook, something the recipe doesn’t suggest but will save you a lot of effort. Both the mozzarella and provolone are pretty mild cheeses, I felt like it needed something with my tang like a goat cheese. Easily adaptable but this is definitely a project recipe. AnonymousBROOKLYN 12/29/2019Explore Bon AppétitPizzaItalianEuropeanOnionVegetableProvoloneCheeseMozzarellaMainVegetarianNut-FreeSuper BowlLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Jake Bagshaw"]}