{"id": "414318d6cfabf1c9476d3bf37eeb34bd", "url": "https://www.bonappetit.com/recipe/strip-steak-au-poivre", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Steak au Poivre Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStrip Steak au PoivreBy Molly BazMay 4, 20214.3(70)Read ReviewsTriangleEmailPinterestPrintPhoto by Taylor Peden and Jen Munk / Courtesy Clarkson Potter, Random HouseEmailPinterestPrintEmailPinterestPrintI recently had textbook-perfect steak au poivre at Gjusta in Venice, CA. If you haven’t had it before, it’s a classic French dish of steak drenched in creamy pepper sauce. It’s old school, but I think it deserves a comeback, which is why it got a spot in my first cookbook, out this April. A nice cut of steak is pan-fried (turn on all your vents and open the windows), and its juices, along with cognac, cream, and black pepper turn into a pan sauce of your 10 p.m. Parisian dinner dreams. Make sure to use freshly ground pepper, which has a brighter, fresher flavor than the preground stuff. Whether you use a mortar and pestle or a pepper mill, grind or crack the peppercorns as coarsely as possible so they add big pops of flavor and crunch. —Molly BazAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMortar and Pestle$25 At AmazonCast Iron Skillet$30 At AmazonCutting Board$10 At IKEAInstant-Read Thermometer$35 At ThermoworksIngredients4 Servings 21½\"-thick New York strip steaks (about 1½ lb. total)Kosher salt, freshly ground pepper1Tbsp. whole black peppercorns2Tbsp. vegetable oil4garlic cloves, 2 smashed, 2 thinly sliced3sprigs thyme3Tbsp. unsalted butter, divided1large shallot, finely chopped⅓cup cognac, dry sherry, or brandy½cup heavy creamFlaky sea saltPreparationStep 1Pat steaks dry with paper towels. Season all over with kosher salt and a generous amount of ground pepper. Let sit 15–30 minutes.Step 2Coarsely crush peppercorns with a mortar and pestle or place in a resealable plastic bag and crush with a small saucepan (they should be a lot coarser than ground pepper).Step 3Heat oil in a large skillet, preferably cast iron, over medium-high. Cook steaks, undisturbed, until a deep golden brown crust forms underneath, about 3 minutes. Turn over and cook on second side until golden brown, about 3 minutes. If the steaks have a fat cap, stand them on their sides with tongs and cook until browned, about 3 minutes.Step 4Reduce heat to medium-low. Add smashed garlic cloves, thyme sprigs, and 1 Tbsp. butter to the pan. Cook, basting steak continuously, until an instant-read thermometer inserted into the thickest part of each steak registers 120°, about 2 minutes. Transfer steaks to a cutting board and let rest 10 minutes.Step 5Meanwhile, combine shallot, sliced garlic, crushed peppercorns, and remaining 2 Tbsp. butter in skillet and cook, stirring often, until shallot and garlic are softened but not browned, about 5 minutes.Step 6Remove from heat and add cognac to pan. Set over medium heat and cook until cognac is mostly evaporated and spoon leaves streaks in skillet while stirring, 1–2 minutes. Add cream, bring to a simmer, and cook until sauce coats spoon, about 1 minute. Season with kosher salt.Step 7Slice steaks against the grain and transfer to a platter. Pour any juices from cutting board back into skillet and stir into sauce. Spoon sauce generously over steak; sprinkle with sea salt. Adapted from Cook This Book. Copyright 2021 by Molly Baz. Photographs copyright 2021 by PEDEN+MUNK. Published by Clarkson Potter, an imprint of Random House.\n\nBuy it on Amazon or BookshopHow would you rate Strip Steak au Poivre?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleHow do you  print this?L. MarshallEncino CA2/10/2022I'm not a Molly Baz stan at all, but this recipe was really good and way less complicated than other steak au poivre recipes out there. Great payoff for the level of effort. The key is a really good steak and decent peppercorns. And be AGGRESSIVE with the peppercorns. With a simple recipe like this the quality of the ingredients is everything so if you use a subpar steak and old pepper from the back of your cabinet, then yeah...it won't be good. If you simmer the sauce too long it will break, but I just added more cream and it came back together perfectly. My one criticism is that it was VERY rich, almost to the point of greasy. I think it could be made with less butter and still be just as delicious—let the peppercorns shine!lasagnaqueenPortland, Oregon2/8/2022Even just using regular ground pepper and 1/2 regular onion (in the absence of peppercorns and shallots), this was amazing.  Not bland at all!  Sautéed 1 LB sliced mushrooms separately in butter and added to the sauce just before serving.  AnonymousNaperville IL1/27/2022Didn't make this, but judging from the ingredient list alone, it sounds very bland.Jane DoeQuebec, Canada1/22/2022Didn't watch the video, followed the recipe and it turned out great. I served this as an appetizer for Christmas Eve, cutting the steaks into thin slices and assembling on skewers folded over like a ribbon. I served the sauce on the side for drizzling and it was hit. Also, since there's some hostility in the comments, I checked Molly's book out from the library and made several recipes before I had to return it, but will definitely be purchasing!ShaynaDetroit, MI1/1/2022There are better Steak au Poivre recipes out there.  This one was passe with no good flavors coming through from any of the ingredients or proportions or directions provided by Molly Baz.  If this is an example of what can be found in her cookbook, we will not be buying her cookbook -- there are so many others that actually have a fantastic melding of flavors from the ingredients and directions.  Considering the cost of the dish, this one was a disappointing waste of money and Molly needs to go back to cooking school to better appreciate how to create a truly lovely, memorable dish.  This was merely forgettable food.  <sigh>We Live For Memorable Meals11/8/2021This is one of our absolute favorites from Molly’s book. We love it, and it never fails to impress!PriscillaVancouver, WA11/6/2021Try it with green peppercorns (The kind that come in a can in Bryan) Instead of cracked black pepper. It’s a completely different take on this dish. To be honest I got this from a recipe that little rendezvous in Tucson Arizona uses for the best pepper steak I’ve ever had. Pretty much the rest of the recipe is spot on thoughDavid WohlstromTucson Az.11/6/2021Is there any reasonable sub for the cream that is non-dairy?VikkiNew York NY11/6/2021And if you’re out of all of other options, hard cider works too!KateMoscow, ID11/6/2021Why am I not finding the video?AnonymousOwings Mills MD11/6/2021molly is the BEST1genecalifornia11/5/2021Is there any substitute for the alcohol?DavidMexico8/17/2021I really like your take on the Au Poivre recipe for three reasons: First, I like that you add garlic and thyme to the steak because garlic and thyme are strong enough in flavor to stand up to the spiciness of the pepper without being overwhelmed by it. Cream is also a good choice to help create the sauce at the end because it pairs well with cognac. Lastly, I like the idea of pouring the sauce from the cutting board into the skillet. No wasted flavors!  chef-brent.comSan Francisco6/27/2021It works well even with a good Rib-Eye. I add some mushrooms before putting in some Martell Cognac. I also like to use French Echalion Shallots!!! All good stuff......Vince\nVince T.........Oak Park, Ca6/4/2021Explore Bon AppétitFrenchEuropeanSteakBeefMeatCognacAlcohol & Other DrinksMainGluten-FreeNut-FreeKetoSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-04", "author": ["Condé Nast", "Molly Baz"]}