{"id": "41432d78f0c0dd1f52b43db250fd646a", "url": "https://www.bonappetit.com/recipe/lamb-burgers-with-yogurt-sauce", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Lamb Burgers With Yogurt Sauce and Arugula Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLamb Burgers With Yogurt Sauce and ArugulaBy Jarrett MelendezJuly 4, 20214.7(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintLamb, lemon, cilantro, arugula—in our house, these ingredients scream summer, so it seemed natural to combine them, along with a few other ingredients, to make a burger with a bright, citrusy yogurt sauce. The arugula does double duty as a topping and a side salad, keeping this meal quick, easy, and light. My partner and I found this burger doesn’t need cheese, but if you feel compelled to add it, it pairs particularly well with nutty, earthy cheeses like sheep’s-milk Gouda, aged cow’s milk Gouda, and Manchego, though you will only need half as much yogurt sauce. —Jarrett MelendezIngredients4 servings1¼lb. ground lamb1lemon2garlic cloves1tsp. ground coriander1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided1tsp. freshly ground black pepper, divided¼cup (packed) cilantro leaves with tender stems½cup plain whole-milk Greek yogurt4Tbsp. extra-virgin olive oil, divided4Tbsp. unsalted butter, room temperature4hamburger buns, preferably whole wheat4cups baby arugulaPreparationStep 1Using your hands, crumble 1¼ lb. ground lamb into small pieces into a large bowl, scattering in a single layer across bottom and partway up sides of bowl. (This makes it easier to disperse the seasonings evenly without overworking the meat.) Using a Microplane, finely grate 1 lemon over meat; set lemon aside. Finely grate 2 garlic cloves into bowl. Sprinkle in 1 tsp. ground coriander, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. freshly ground black pepper.Step 2Finely chop ¼ cup (packed) cilantro leaves with tender stems and scatter half over lamb. Set remaining cilantro aside for making yogurt sauce. Toss ground lamb mixture with your hands just until combined—you don't want to overwork the meat mixture, otherwise it can become tough. Divide meat into 4 equal portions. Hold 1 portion in the palm of your hand, then gently pat down to make a patty that’s about ¾\"-thick and just a bit wider than your buns (if you have small hands, it might be easier to do this on a cutting board). Place patty on a large plate and repeat with remaining portions.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Spoon ½ cup plain whole-milk Greek yogurt into a measuring glass or small bowl. Cut reserved lemon in half, and squeeze juice from 1 half into yogurt. Add 2 Tbsp. extra-virgin olive oil, ¼ tsp. Diamond Crystal or Morton kosher salt, ¼ tsp. freshly ground black pepper, and reserved cilantro. Using a small whisk or fork, mix until oil is fully incorporated.Step 4Heat a large cast-iron or stainless-steel skillet over medium. Spread 4 Tbsp. room-temperature unsalted butter over cut sides of 4 hamburger buns, preferably whole wheat. Working in 2 batches, toast buns, buttered side down, in skillet until golden brown, about 3 minutes. Transfer to plates.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Increase heat to medium-high and add 1 Tbsp. extra-virgin olive oil to skillet. Once oil begins to shimmer, arrange lamb patties in skillet and cook until a dark brown crust forms on bottom side, about 5 minutes. Using a spatula, flip burgers and cook until browned and an instant-read thermometer inserted into the center registers 135° for medium. Transfer to a plate and let rest at least 5 minutes.Step 6Place 4 cups baby arugula in a clean large bowl. Drizzle remaining 1 Tbsp. extra-virgin olive oil over, then squeeze juice from remaining lemon half over. Season with remaining ¼ tsp. Diamond Crystal or Morton kosher salt and ¼ tsp. freshly ground black pepper and toss to combine.Step 7Spread about 1 Tbsp. yogurt sauce on bottom half of each toasted bun. Top with a small handful of dressed arugula. Place patties on top of arugula. Spread 1 Tbsp. yogurt sauce over patties and close up hamburgers. Serve with remaining arugula salad alongside.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Lamb Burgers With Yogurt Sauce and Arugula?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis recipe is fantastic! I upped the salt and the garlic and do not regret it. I also added sliced tomato and red onion to the bun. Very tasty. I topped the burger with a 1000 day aged Gouda and it was perfect.OliviaAsheville, NC2/27/2022Atomic in Nashville: Are you thinking that the instructions are telling you to use a microplane to juice the flesh of the lemon into the meat? You should grate the rind from the lemon over the meat. This step is shown in the video clip. Then when you make the yogurt sauce you squeeze the juice from half of the reserved lemon (now without rind) into the yogurt sauce!AnonymousWashington, D.C.1/17/2022Step one: \"Using a Microplane, finely grate 1 lemon over meat...\"\n mmmkay, perhaps proofread once?aTOMicNashville12/14/2021Absolutely incredible! Honestly, thinking about making it again tonight. The yogurt sauce is EVERYTHING! Served with the BA Roasted Fingerling Potatoes w/Chive Pesto. Karen Raleigh, NC9/18/2021A MUST try! Everything about this recipe is so simple and so incredible. I did not expect it to come out as well as it did. Flavors balance with lamb perfectly and nothing over powers each other. Thank you BA! Will be making again.Tat RoeMiami, FL7/22/2021Guys, this recipe does not mess around...I subbed lamb for Impossible meat and it worked so well. BA really nailed the head on this one. So summery and fresh because of the lemon and yogurt. I put a little parm in the arugula salad and it satisfyingly cuts that sourness. Please do yourself a favour and make this. Adrian PonceVancouver, BC7/7/2021deviousann sklarlivingston nj7/4/2021Explore Bon AppétitBurgerGround LambLambMeatArugulaLeafy GreensVegetableGoudaCheeseManchegoCilantroHerbs & SpicesSummerQuickEasyWeeknight MealsMainNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-04", "author": ["Condé Nast", "Jarrett Melendez"]}