{"id": "415c1fbcca3bc2984bf7e2da3d7fe35f", "url": "https://www.bonappetit.com/story/the-absolute-most-important-factor-in-brewing-great-coffee", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "The Coffee to Water Ratio That Makes a Perfect Brew  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Absolute Most Important Factor in Brewing Great Coffee More coffee beans does not make for stronger or better coffee. By Alex DelanyJanuary 17, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou’ve met someone who has declared that coffee has to be strong in order to be \"worth it.\" Maybe it’s your dad. Maybe it’s you friend Patricia. Maybe it’s your roommate Kevin. (Classic Kevin.) There are people out there that load up their coffee maker or pour over cone or on-the-go press or espresso machine with a ton of extra coffee grounds in order to get \"a more flavorful, caffeinated cup.\" These people will claim they can only get through the morning with an extra-strong cup. If you know people like this, get in touch, sit them down, and tell them that they’re wrong.Because they’re living a lie. More coffee doesn’t mean stronger or better coffee.You’d think it would, right? Adding more beans that hold flavor and caffeine and oils should give you coffee with more of all of those things. But that’s not how brewing coffee works. It all has to do with the way that coffee and water interact with one another and how the flavors are extracted from the beans.We get flavor from coffee beans because the hot water dissolves soluble compounds in the ground beans (the same is true for just about anything you soak in hot water). When it comes to coffee, there’s only so much flavor and caffeine that can be extracted from each bean. Over-extracting coffee (meaning you take too much of the soluble flavors from the beans) will make coffee taste bitter, dry, and flavorless. And under-extracting (meaning you haven’t dissolved enough of these compounds) will leave you with coffee that tastes sour and a bit salty.You want to be right in the middle. And for the tastiest, most flavorful extraction, we use a golden coffee to water ratio of 1:16 parts coffee to water when we brew. (We prefer to measure this ratio in weight, like 22 grams of coffee to 352 grams of water, but if you don’t have a scale, you can measure by volume.) When you add more beans, you’re just wasting coffee, since there’s only so much caffeine that you can draw out before you start to pull over-extracted flavors, too. Some of this has to do with grind size, brew time, and water temperature, but the most significant factor is the coffee to water ratio.Photo by Chelsie CraigBut say you’re the type of person that likes a bolder, toastier, full-bodied cup. That kind of coffee does exist. But you get those flavors by buying the right beans, not by doubling down on the amount of coffee. Buy dark-roasted coffee. And if you’re looking for a more caffeinated cup, buy light-roasted beans.But either way, you should be brewing at a coffee to water ratio of 1:16. In the coffee world, more is more, but not the kind of more you actually want. Keep that ratio dialed in and start with the right beans for the kind of \"more\" we like.Get to know the light and dark roasts a little better:What's the Difference Between Light and Dark Roast Coffee?They taste really different. Best to know what you're into before you go any further.View StoryExplore Bon AppétitBasicallyCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-17", "author": ["Condé Nast", "Alex Delany"]}