{"id": "415e41976e44697479bff2c520c50db1", "url": "https://www.bonappetit.com/story/chef-chloe-coscarelli-and-her-drive-to-stay-balanced-in-a-fast-paced-lifestyle", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Chef Chloe Coscarelli and Her Drive to Stay Balanced in a Fast-Paced Lifestyle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredChef Chloe Coscarelli and Her Drive to Stay Balanced in a Fast-Paced LifestyleBy CitizenMay 8, 2018FacebookTwitterEmailFacebookTwitterEmailEight years ago, renowned chef Chloe Coscarelli burst onto the culinary scene as the only vegan chef to win Food Network’s Cupcake Wars. Since then, she has continued to bring her bubbly personality and fresh, approachable style of plant-based cooking mainstream with her best-selling cookbooks. Beyond her success and her work advocating for positive change in the culinary world, she is the face of Citizen Watch and their new Ladies’ Eco-Drive Collection—a partnership that helps her keep up with her hectic schedule, which includes recipe testing, cooking, and traveling to meetings, and events. We got to know a little bit more about her food philosophy and how she works to stay balanced while living life in an industry with no intention of slowing down soon.How Plant-Based and Renewable Energy Come Together to Make a Lasting ImpactChloe's mission is focused on using food and cooking to promote health, sustainability, and animal welfare. “At the end of the day, I believe that food is just such a powerful catalyst for change and such a great way to make a positive impact in the world,” she says. Leading a healthy lifestyle and focusing on a plant-based lifestyle can make a lasting impact not only on personal wellness but the very health of our planet, too. The power of light—an integral part of her vegan, plant-based cuisine—is also a key player in Citizen’s innovative light-powered technology. This is why Chloe believes Citizen has created the perfect recipe for its Ladies' Eco-Drive Collection (which prioritizes positive change through commitment to sustainability). The watches in the collection are powered by light—a natural, renewable energy—and never need a battery. A bonus that allows for more time in your day along with the peace of mind that accompanies not adding extra batteries to landfills.The Key to Staying on Task Whether It’s Inside or Outside of the KitchenKeeping time is as essential in the kitchen as it is in her personal life, so Chloe has found a favorite from the collection that she can wear all day. “My favorite Citizen watch is Riva because it’s feminine and functional, and works as a statement jewelry piece that goes from day to night.” When testing new ideas and dishes in the kitchen she loves that it helps her stay on task—especially when cooking and timing steps in her baking recipes. “If I’m not wearing my watch and checking the time, I will burn nuts, and I will burn them again, and again and again… It’s so important to keep track of time.” Beyond a seemingly never ending list of professional commitments, Chloe also works hard to find a balance in her personal life. Her favorite non-cooking moments? Making time to fit in a yoga class during a busy week to keep calm and centered.This Delicious Summer Salad Is Quick to Prepare and (of Course) Completely VeganChloe has worked tirelessly in her career to adapt people’s mindset about plant-based and vegan eating. She believes that dishes with clean, natural, and seasonal ingredients can be full of flavor, have exciting textures, and of course, be oh-so-good for us. With only a handful of ingredients, this simple summer recipe from Chef Chloe’s latest book, Chloe Flavor, is easy enough to whip up after work or a workout class and showcases some of the season’s best produce.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast"]}