{"id": "416596467819253db3e4b5b07ea7b243", "url": "https://www.bonappetit.com/story/pineapple-collaborative-apple-cider-vinegar", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "This Apple Cider Vinegar Has Changed My Salad Game for Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Apple Cider Vinegar Has Changed My Salad Game for GoodPineapple Collaborative’s ACV is the first I’ve tried that actually tastes like apples.By Aliza AbarbanelJuly 27, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve always had a soft spot for sour things. As a kid, I snacked on lemon wedges, horrifying my parents and dentists alike. I’ve since stopped for the sake of my enamel and digestive system, but I still use an abundance of acidic ingredients in everything I cook. No pot of chickpeas is complete without a good squeeze of lemon; no dipping sauce is perfect until some rice vinegar joins the party. I’ve amassed a small collection of acidic ingredients, but lately I’ve ignored it for Pineapple Collaborative’s Apple Cider Vinegar.This is my first real ACV crush. Despite its health halo and widespread availability, I rarely reached for the stuff. But Pineapple Collaborative’s ACV is the first I’ve tried that actually tastes like, well, apples, and that got me hooked. I suspect that’s because it’s “crafted in collaboration” with farmer Joanne Krueger of Little Apple Treats orchard in California’s Sonoma County. The vinegar is made by fermenting a blend of Krueger’s organic Gravenstein, Red Rome Beauty, Golden Delicious, and Pink Pearl apples.Truly, this vinegar is potent stuff: Just a tablespoon or two is enough to wake up any dish with a jolt of bright, shimmering, sweet-and-sour fruitiness. I’ve made countless quick weeknight salad dressing by shaking up a few tablespoons with Dijon mustard, olive oil, and a bit of honey. But I’ve also added a splash to mellow out saccharine homemade jam, stirred it into weekly batches of acidic green sauce, and shot it back straight as a DIY wellness shot. The world is my oyster and I’m going to keep spiking it with vinegar forever...or at least until I drain the bottle.Photo by Laura MurrayPineapple Collaborative Apple Cider Vinegar$20 at Pineapple CollaborativeExplore Bon AppétitHighly RecommendShoppingApple Cider VinegarRead MoreLifestyleThese Are a Few of My Favorite FatsBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-27", "author": ["Condé Nast", "Aliza Abarbanel"]}