{"id": "4165eaec6b481ec9f47ea97681b76f0a", "url": "https://www.bonappetit.com/recipe/shrimp-scampi", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Shrimp Scampi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShrimp ScampiBy Rick MartinezFebruary 25, 20224.7(171)Read ReviewsTriangleEmailPinterestPrintLaura MurrayEmailPinterestPrintEmailPinterestPrintShrimp scampi is an ideal weeknight recipe: It comes together quickly with just a handful of ingredients, many of which you might already have in the house. The key here is, unsurprisingly, good shrimp. Unless you have access to a fishmonger, frozen wild-caught or frozen sustainably farmed shrimp are likely to be fresher than the frozen-then-thawed shrimp sitting on ice at your local supermarket.We urge you: Don’t skip the marinade step—it really amps up the flavor and sets this recipe apart. Use the time to make a big green salad or enjoy a glass of wine that you can also use in the recipe (we like a Pinot Grigio or Fiano here). Before you add the shrimp to the pan, be sure everything else for your meal is set up. The dish cooks in less than 10 minutes and shrimp can easily overcook and turn rubbery. Serve this with bread for dipping so none of the lemony garlic-butter sauce goes to waste. Plates are optional.If you’re looking for a shrimp scampi recipe with pasta, this one keeps it classic but adds fettuccine (linguine works too) and a toasted panko topping for crunch, while this one uses spaghetti and an extra punch of heat from fresh jalapeño and canned roasted green chiles.Editor’s note: This recipe was originally published in February 2017. The introduction has since been updated.Ingredients4 servings4garlic cloves, 2 grated, 2 thinly sliced1teaspoon kosher salt3tablespoons olive oil, divided1pound large shrimp, peeled, deveined¼teaspoon red pepper flakes¼cup dry white wine1tablespoon fresh lemon juice¼cup (½ stick) unsalted butter3tablespoons chopped parsleyWarm crusty bread (for serving)PreparationStep 1Whisk grated garlic, salt, and 1 Tbsp. oil in a medium bowl. Add shrimp, toss to coat, and chill, uncovered, at least 30 minutes and up to 1 hour.Step 2Heat remaining 2 Tbsp. oil in a large skillet over medium and cook shrimp mixture, being careful not to let shrimp or garlic brown, until shrimp is pink but still slightly underdone, about 1 minute per side. Transfer to a plate with a slotted spoon, leaving as much oil in pan as possible. Add sliced garlic and red pepper to skillet and cook, tossing, until fragrant, about 1 minute. Add wine and lemon juice and cook, stirring occasionally, until reduced by half, about 2 minutes. Add butter and cook, stirring and swirling pan occasionally, until butter is melted and sauce is thickened, about 5 minutes more.Step 3Scrape shrimp along with any accumulated juices into skillet. Toss to coat and cook until shrimp are fully cooked through, about 2 minutes. Transfer to a platter, top with parsley, and serve with bread for dipping alongside.How would you rate Shrimp Scampi?Leave a ReviewTell us what you thinkReviews (64)Back to TopTriangleThis is a great recipe, it is garlic-y and goes great with pasta.DanoBoise, ID3/10/2022Simple and delicious!  Made this as a lighter holiday meal with salad and baguette.  Anonymous12/29/2021No doubt the best shrimp scampi I’ve ever made. Even better the next day! Delicious. AnonymousNew jersey12/28/2021Quite literally the most delicious, perfect shrimp scampi ever, in restaurants or elsewhere. This recipe was simple enough for an amateur college cook like myself and delicious enough to serve to my parents and extended family. Everyone had seconds and licked the plate! I have made this with and without marinating the shrimp, and I can say it really is worth letting them sit for at least 15-20 minutes and it makes all the difference! The longer the better though! SkyePittsburgh, PA11/25/2021Excellent dish - we marinated the shrimp for four hours which really enhanced the flavors. It paired well with a flinty Sancerre.RegisMcLean, Va10/29/2021This is the easiest and tastiest scampi recipe I have ever made.  The results are Delicious every time.YolyFlorida10/19/2021I've made dozens of recipes for Scampi, and I thought I was all set with one I found a couple of years ago. But this one caught my eye because it called for marinating the shrimp. Now I am all set. My family and friends lavish praise any time this is on the menu. One thing I do add is a large pinch of Paprika in the marinade. Something from one of my other recipes, and I think it adds something special to the final dish. Cooking in Detroit Detroit 9/12/2021Didn’t even marinate the shrimp and it turned out delicious. Perfectly tender shrimp and flavorful. Deja Gainesville, Fl9/7/2021My go to recipe for shrimp.  Served in corn tortillas with spiced sour cream, queso and veggies, on top of jasmine rice, with pasta or alone with good bread.  So easy and so delicious.  AnonymousGearhart, oregon3/23/2021This is a perfect recipe. So easy and amazingly good! We had it with a lightly toasted sourdough baguette and a frisee salad on the side. What a terrific, easy mid-week meal!MariSan Francisco, CA3/4/2021WOW!\nThis was a hit! \nWas it the marinating?\nI don't know! \nI won't change a thing except maybe DOUBLE the recipe!!\nBest ever!JoansM2/20/2021By far this is the best scampi we’ve ever had. Marinating the shrimp is key, and I like to double everything for extra sauce. Today we dipped naan, we also love sourdough, or toasted Italian. You’re going to want to lick the plate clean! Ashley K-PDayton, OH2/14/2021Marinading the shrimp makes a world of difference.  This is a great recipe that I have made many times.  BeviStowe, VT1/29/2021LOVE this recipe! The garlic sauce is incredible. While dipping bread in the garlic sauce was delicious, putting this sauce/shrimp over pasta was awesome. Thank you for providing such a simple but absolutely delicious recipe!RonnieLos Angeles, CA1/11/2021This recipe was absolutely the BEST Scampi I have ever made. I believe placing the shrimp with garlic and oil in the frig for at least 30 mins. Was the key. I also had diced shallot to the sliced garlic and or was delicious. Thanks for my new fave!!!Karen MitschkeFlorence, AZ11/30/2020Explore Bon AppétitItalianEuropeanShrimpShellfishSeafoodGarlicVegetableEasyOne-Pot MealsMainNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-02-22", "author": ["Condé Nast", "Rick Martinez"]}