{"id": "416631f5e57149e72668d3304c290481", "url": "https://www.bonappetit.com/story/moya-bailey", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "‘Misogynoir’ Coiner Moya Bailey Is Eating Pasta and Channeling Her Inner Black Auntie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle‘Misogynoir’ Coiner Moya Bailey Is Eating Pasta and Channeling Her Inner Black AuntieThe writer and cultural critic is all about that arrabbiata.By Martine ThompsonNovember 28, 2018FacebookTwitterEmailPhoto by Matthew Modoono/Northeastern UniversityFacebookTwitterEmailIn our new series Person of Interest, we talk to the people catching our eye right now about what they're doing, eating, reading, and loving. Up next, scholar of critical race, feminist, and disability studies Dr. Moya Bailey.Dr. Moya Bailey believes that good things come from connecting and organizing. After seeing how Black women were stereotyped and miscategorized in medical yearbooks while working on her graduate school dissertation in 2010, Bailey coined the term “misogynoir” (a portmanteau of “misogyny” and the French word for “black”) to describe how Black women are viewed and treated in society vis-à-vis their race and their gender. “It was about creating clarity. Once you’re able to name your oppression, I think you’re better able to address it,” she says.Through the work of Bailey and the artist and critic Trudy, creator of the now-defunct blog Gradient Lair, “misogynoir” entered the popular lexicon and has since been used to unpack everything from Beyonce’s Lemonade album to racist beauty ideals. “I think it’s been useful to other people in the sense that they see Black women are treated very differently from white women, and even from other women of color.” What’s unfortunate, she adds, is that people need to use the designation so often.Bailey curates the digital presence for the Octavia E. Butler Legacy Network, an organization that supports and promotes the writer’s legacy, and she is a professor at Northeastern University, where she teaches Introduction to Women's, Gender, and Sexuality Studies. She also has two books in the works, one on “hashtag activism,” which she’s co-writing, and a solo venture called Transforming Misogynoir: Black Women's Digital Resistance in U.S. Culture due out in 2021. We caught up with the scholar of critical race, feminist, and disability studies about the things that satisfy her spirit and taste buds, the meaning of community, and the timeless bops filling her playlist.The best thing I did this year was... start swimming lessons with a friend of mine. Learning how to swim has been an important task. With the history behind many Black people not knowing how to swim, that was really important for me.My love language is… ’90s R&B. I’m fully embracing my inner Black auntie.I feel grounded when… I’m cooking for people I love.The last thing I read, watched, or listened to that made me feel seen was… I just finished Unapologetic by Charlene Carruthers. The last chapter on the mandate for a movement was really powerful to me.My village includes... a group of folks we lovingly call The House of Mati, building on Gloria Wekker’s use of the term mati work, [“an old practice among Afro-Surinamese working-class women in which marriage is rejected in favor of male and female sexual partners”]. We build these relationships between women who have romantic, platonic, and non-platonic connections. I would also say my partner, our good friends, and the community that I’ve built in Boston.Real activism is… intentional and collective. Being an activist in isolation does not do the work of creating the kinds of changes we need for a different world. It requires organizing and relationship building.My favorite thing to eat when I’m celebrating is… Pasta. Pasta in any form is my favorite thing. With any tomato-based sauce like arrabbiata, because it’s spicy.Two dishes from African American cuisine I’d bring on a deserted island… My mac and cheese is legendary. It is quite excellent. Mac and cheese for sure. And probably fried catfish.When I feel blue I like to… listen to music by Black folks. Jazz, R&B more generally. Hip hop. A little bit of everything.I lose it when I’m… at concerts. That’s my space where I’m very free and excited to see people. Bilal is incredible, Little Dragon—always excellent, and Erykah Badu is my problematic fav.Right now, I’m reading... I’m about to start reading Erena Hogart’s book, Medicalizing Blackness. It’s kind of about the making of racial difference and how scientists started medicalizing the idea of race.A good morning looks like... gym time, meditation, and a good discussion with my students in Introduction to women's, gender, and sexuality studies.\nI find joy in... food, friends, and music! Oh, and videos of Black children being carefree and wonderful.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyleNutrition Goddess Marion Nestle on the One Thing She’d Change About How We EatBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-28", "author": ["Condé Nast", "Martine Thompson"]}