{"id": "41671068a92b4692356d8fdf4eb6f1f5", "url": "https://www.bonappetit.com/recipe/spicy-tomato-braised-pork-with-herbed-polenta", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Spicy Tomato-Braised Pork With Herbed Polenta Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDSpicy Tomato-Braised Pork With Herbed PolentaSponsored by Barilla® Vero GustoFacebookPinterestTwitterEmailIf you prefer pasta instead of polenta, stir the basil, parsley, and butter into 24 oz. cooked spaghetti or rigatoni and serve alongside the pork.PrintIngredients2 tsp. fennel seeds4 tsp. kosher salt, plus more4 lb. boneless pork shoulder (Boston butt), cut into 1½\"-thick steaks4 Tbsp. extra-virgin olive oil, divided2 large red onions, cut into wedges through root end3 carrots, peeled, halved if large, cut crosswise into 3\"-long pieces1 head of garlic, cut in half crosswise, papery skins discarded3 sprigs oregano2 20-oz. jars Barilla® Vero Gusto Calabrian Marinara Sauce2 tsp. crushed red pepper flakes2 tsp. kosher salt, plus more1½ cups polenta3 red chiles (such as Fresno), very thinly sliced, seeds removed if desired2 Tbsp. fresh lemon juice½ cup finely chopped basil½ cup finely chopped parsley4 Tbsp. unsalted butter2 oz. Pecorino or Parmesan, finely grated (about 1 cup)Recipe PreparationPorkToast fennel seeds in a dry small heavy skillet over medium heat, shaking skillet often, until fragrant, about 1 minute. Let cool. Finely grind fennel seeds in a spice mill or with mortar and pestle; transfer to a small bowl and stir in salt. Season pork on both sides with fennel salt.Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Working in batches if needed, cook pork, turning occasionally, until browned on all sides, 15–20 minutes.Transfer pork to a large plate or platter. Carefully pour off all but 1 Tbsp. drippings in pot. Pour in 2 Tbsp. oil, then add onions, carrots, garlic, and oregano. Season with salt and toss to combine. Cook, stirring occasionally, until vegetables start to soften, 6–8 minutes. Stir in Vero Gusto sauce and red pepper flakes. Rinse out a sauce jar with about 1 cup water and add to pot; season with salt. Bring to a simmer.Return pork to pot along with any accumulated juices. Reduce heat to low and bring to a very bare simmer (pork should be mostly submerged; stir to redistribute vegetables and add more water if needed). Cover pot and cook, stirring occasionally and skimming fat from surface, until meat is fork-tender, 2–2½ hours.Polenta and AssemblyAbout 45 minutes before pork is done, bring 8 cups water to a boil in a large pot; season with 2 tsp. salt. Whisking constantly, gradually add polenta. Bring to a simmer and cook, whisking often, until tender, 30–35 minutes.Meanwhile, toss chiles and lemon juice in a small bowl; season with salt. Let sit until ready to use (at least 10 minutes).Remove polenta from heat and stir in basil, parsley, and butter. Gradually add Pecorino, stirring constantly until combined.Scrape polenta onto a large platter. Pluck oregano sprigs out of pork mixture; discard. Arrange pork mixture over polenta and top with pickled chiles.Do Ahead: Pork can be braised 4 days ahead. Transfer to an airtight container and let cool. Cover and chill. To serve, skim off any solidified fat from surface, then return to a simmer over medium heat.\\Sponsored by Barilla® Vero GustoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBarilla® Vero GustoStewItalianPork ShoulderPolentaMainGluten-FreeNut-FreeBraiseDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Barilla", "Vero Gusto"]}