{"id": "4169f62697d8177f8bfdabb5ec0b4a9d", "url": "https://www.bonappetit.com/story/habichuelas-guisadas", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "There’s No One Way to Make Habichuelas Guisadas—and That’s the Point | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s No One Way to Make Habichuelas Guisadas—and That’s the PointThere are many variations on the beans-and-rice theme, particularly within African diasporas. To me, they all taste like home.By Ruth TerryAugust 28, 2020FacebookTwitterEmailIllustration by Amanda BaezaFacebookTwitterEmailTo my knowledge, no one in my family has ever written—or likely ever read—a recipe for habichuelas guisadas, the Puerto Rican oxblood-colored kidney beans stewed in a tomato sauce so flavorful they belie a relatively short cooking time. All of us just know how to make it.I have no recollection of learning how to prepare and portion the ingredients for the dish, though I do recall we always used canned beans. When I make it at home in Istanbul, where I moved five years ago, I start by making sofrito.Sofrito, an amalgam of aromatics and herbs that Spanish colonizers brought to the Caribbean, is what makes all Puerto Rican guisados shine. It was the foundation for all my mother’s soups and my grandmother’s corned beef asopao and arroz con pollo. It is also the only thing I remember making together with my mother, aunt, and grandmother, all seated around my aunt’s spacious table in Levittown, New York, when I was in my late 20s.The exact formulation is not without contention, and our individual concoctions, just like our habichuelas guisadas, have been shaped by our varied locations. My grandmother’s sofrito, like abuelita herself, comes from the island and uses heaps of onions, garlic, cilantro, culantro, and ajicitos dulces, habanero’s unspicy doppelgänger. Mami omits the ajicitos dulces because they were never widely available where we lived in the Chicago suburbs. She likes her sofrito “dirty,” with a splash of manzanilla olive juice and a jalapeño or two for a kick. When I ask Mami what Tio, her brother who lives near her in central Florida, puts in his, she shakes her head disdainfully and relays a painful family secret: “He buys it.”Unlike many Puerto Ricans, I don’t keep a stash of the eye-watering mixture on hand. In my Turkish-size refrigerator, which is about two-thirds the size of a typical American one, its pungency would cast a garlic glow over anything in proximity.I make my sofrito by hand because I do not own a food processor. I figure I’m due for a good cry, so I start with the more acrid—and, therefore, more cathartic—purple onions over the white ones. With my left palm astride the blade and right hand fisted around the handle, I chop onions, a head of garlic, and two Turkish kırmızı biber, a carrot-shaped pepper with a bright sweetness. I have no memory of ajicitos dulces, but I like to imagine these local peppers taste just the same.I fall into a teary but calming trance, chopping ingredients so finely that they are nearly liquefied. This sofrito has colorful edges like a salsa, not the muddy yellowish-brown of the blended version. Perhaps bean preparation is locked into my genetic memory, a gift from my Indigenous, African, and European ancestors.While black-eyed peas and pigeon peas arrived in the Americas via the trans-Atlantic slave trade, Phaseolus vulgaris—an eclectic species of beans that includes red, black, white, and even striped kidney beans with both matte and shiny skins—was first cultivated in Mexico and made its way to the Caribbean and from there into habichuelas guisadas.Rice, the eventual sidekick to these beans, was brought by Africans to the so-called New World—a misnomer if there ever was one—braiding the grains into their tresses. Throughout the African diaspora, rice and beans became a classic combination, eventually morphing into dishes like bruine bonen met rijst in Suriname and Brazilian feijoada.Somehow, I remember Mami’s flourishes: adding a pinch of thyme, using canned-kidney-bean brine as a thickener, and mashing a few beans against the side of the pot for a toothier sauce. But living in Istanbul has changed other aspects of my guisado. Pork, traditionally used to flavor the beans, is so ubiquitous in Puerto Rican cuisine that I’ve sometimes jokingly referred to it as “puercoriqueña.” But pork isn’t available in Turkey, a Muslim-majority country. It’s expensive when you find it, and there is little variety outside bacon and Italian-style deli meats. And adding Turkish beef sausage to my beans is just a step too far for me.So I’ve pivoted to a completely vegan formula, deepening the sauce’s character with local salcı, a dark-as-blood tomato paste with a richer flavor than its American counterpart. While Mami sometimes puts cumin in her beans when she wants them to taste “Mexican,” I like to add smoky isot biber—also known as Urfa pepper in the States—which sings at the same register as the salcı.The pandemic in Istanbul has further altered my beans-making process. A lifetime ago in February, I knew my partner had started to take coronavirus seriously when he earnestly told me, “You know, we should really stock up on dry beans.” He and a few million other people had the same thought.Prior to the pandemic, I rarely if ever soaked my beans for any dish. It took forever and they always seemed to remain toothsome. Now overnight soaking has become a way to mark the passage of time during run-together quarantine days. I credit the high mineral content of Istanbul’s municipal water with breaking down the beans to their utmost creaminess.Every time I make a dish with kidney beans, whether it is Afghan lubya or Costa Rican gallo pinto, the taste ends up mimicking my childhood favorite. The exact flavor may vary, but habichuelas rojas in any incarnation always tastes familiar.But is my version, made from memory and of assorted Turkish ingredients, still even Puerto Rican? When I call Mami to discuss the matter, she brushes these questions of authenticity aside. “It’s really a mindset,” she says. If I believe it tastes Puerto Rican, if it creates for me that sense of comfort in this uncertain world, then that’s enough.Explore Bon AppétitHealthyishPuerto RicanessayRead MorecultureWhen I Couldn't Be With My Sister After Childbirth, We Practiced Zuo Yue Zi From AfarBy Charlene Wang de ChenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-28", "author": ["Condé Nast", "Ruth Terry"]}