{"id": "417f483c1af33c973f91761112857a41", "url": "https://www.bonappetit.com/recipe/buttery-kimchi-chicken", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Buttery Kimchi Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButtery Kimchi ChickenBy Sunny LeeJanuary 11, 20214.5(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Pearl Jones, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintIf you ever eat at Sunny Lee’s house, don’t be surprised to find dishes that combine influences from her Korean, Greek, and American roots. Notably, her family’s kimchi jjigae recipe is untraditionally enriched with butter at the end, nudging it towards something closer to Italian Bolognese or Indian Butter Chicken. This dish gets its creaminess from browning the yogurt marinade as well as ground up soybeans. Caramelizing tomato paste with kimchi harmonizes the bright funky acidity of both ingredients as well as brightening the color of this stew—perfect for a winter night. Channel your inner grandma: Be prepared to stand over the stove for the better part of an hour and make sure to wear an apron. This spicy and sweet, slightly nutty, and creamy stew will be worth the time.Ingredients6-8 servings1cup plain whole-milk Greek yogurt4garlic cloves, finely chopped12\" piece ginger, peeled, finely chopped3Tbsp. gochugaru (coarse Korean red pepper powder)1Tbsp. fish sauce1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1tsp. freshly ground black pepper2lb. skinless, boneless chicken thighs½cup dried soybeans2Tbsp. vegetable oil1onion, sliced ½\" thick2cups drained Napa cabbage kimchi, cut into 2\" pieces2Tbsp. plus 1½ tsp. tomato paste1½cups low-sodium chicken broth4Tbsp. unsalted butterCooked white rice (for serving)3scallions, thinly sliced1red chile (such as Fresno), thinly slicedPickles (for serving; optional)PreparationStep 1Mix yogurt, garlic, ginger, gochugaru, fish sauce, salt, and pepper in a medium bowl. Cut chicken thighs crosswise into thirds and add to bowl. Massage yogurt mixture into chicken until well coated. Cover and chill at least 1 hour and up to 3 hours.Step 2Meanwhile, place soybeans in a medium saucepan and pour in 2 cups cold water; bring to a boil. Immediately drain soybeans and rinse under cold running water. Return to pot, pour in 1 cup cold water, and bring to a boil again. Immediately remove from heat and let cool slightly. Transfer soybeans and water to a blender and blend until a thick purée forms. (It’s okay if the soybeans are a bit chunky still; they’ll soften in the braise.) Set aside.Step 3Heat oil in a large Dutch oven over medium-high. Working in 2 batches, remove chicken from marinade, letting any marinade that wants to cling stay on, and cook, stirring occasionally, until browned all over, 5–7 minutes per batch. Using a slotted spoon, transfer chicken to a plate as you go, leaving all the crunchy bits and oil in pot. Set any remaining marinade aside.Step 4Reduce heat to medium-high. Combine onion, kimchi, tomato paste, and reserved marinade in same pot and cook, stirring and scraping up browned bits constantly to prevent burning, until onion is softened and tomato paste darkens slightly and begins to stick to bottom of pot, about 10 minutes. Return chicken, along with any juices collected on plate, to pot and stir in broth, butter, and reserved soybean purée. Bring to a simmer and cook until chicken is just cooked through, 10–15 minutes.Step 5Divide rice among bowls and ladle chicken mixture over. Top with scallions and chile. Serve with pickles alongside if desired.How would you rate Buttery Kimchi Chicken?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleSo good and pretty easy. Like another comment suggested, I used a can of chickpeas in place of the soybeans. Definitely would make this againAnonymousSan Francisco, CA12/12/2021This was great. I blended a can of chickpeas to replace the soybeans because they were hard to find, and it worked out well! Next time, I'm going to add more kimchi and slightly less ginger.AngelaSF Bay Area, CA6/26/2021Delightful mix of cultural cuisines.. Perfect for guests  young and old alike.. all who tried eating this  beyond its uncommon name were joyous in response and eager to try more similar treats.Estelle Speros Macdonald4/1/2021Explore Bon AppétitChickenPoultryDinnerKoreanEast AsianAsianGreek YogurtGarlicVegetableGingerHerbs & SpicesgochugaruFish SauceKosher SaltBlack PeppersoybeanOilOnionKimchiTomato PasteChicken BrothButterRiceRice & GrainsGreen Onion ScallionChileEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-11", "author": ["Condé Nast", "Sunny Lee"]}