{"id": "41818ccf1ed5d06514207b43c43d3c61", "url": "https://www.bonappetit.com/recipe/soto-ayam-betawi", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Soto Ayam Betawi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSoto Ayam BetawiBy Lara LeeFebruary 23, 20214.5(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintIt’s perhaps ironic that the translation of the Indonesian word soto is summed up so modestly as “soup,” for there is nothing modest about this deeply flavored, complex, traditional meal, designated by the Indonesian government as a national dish. Also known in parts of the country as coto, tauto, sroto, or saoto, there are 75 types of soto, and each region boasts its own specialty based on local spices and produce. There are 22 varieties of soto on the island of Java alone, and there you will find Soto Betawi, a defining dish of the Betawi people from the nation’s capital, Jakarta. Traditionally, the soup is made with a full-bodied beef broth that develops over several hours and served with meltingly tender chunks of beef and offal, fried potatoes, tomatoes, and layers of spice and coconut milk (a recipe for this version is in my cookbook, Coconut & Sambal). You’ll find Soto Betawi eaten for breakfast, lunch, or dinner all over the bustling metropolis, from street food kaki lima vendors to fine-dining restaurants. My version of the dish here swaps bone-in chicken thighs in for beef (ayam means “chicken” in Indonesian), reducing the cooking time to just under an hour, while still showcasing the rich, spiced, and coconutty flavors the soup is famous for. With aromas of makrut (Thai) lime and lemongrass and a turmeric-golden hue, Soto Ayam Betawi is delicious on its own, but I prefer to eat it as the Betawi do, with a side plate of rice. Spoon a small amount of the broth and some chunks of chicken and potato over the rice and enjoy eating it from both plate and bowl for a heartier meal. The Betawi often serve it with fried shallots, vinegary acar pickles, crackers made from the local melinjo nut, and a chili sambal, but my favorite addition is lime wedges for extra zing and seasoning.Ingredients4–6 servings6–8skin-on, bone-in chicken thighs (about 3 lb.)Kosher salt2Tbsp. vegetable oil6large shallots, 2 shallots finely chopped, 4 shallots cut into ½\" pieces4garlic cloves, crushed1Tbsp. ground coriander1tsp. ground turmeric3medium tomatoes (about 1 lb.), quartered2medium russet potatoes (about 1 lb.), scrubbed, cut into 1\" pieces2lemongrass stalks, trimmed, tough outer layers removed, bruised3makrut (Thai) lime leaves4cups chicken stock or low-sodium chicken broth113.5-oz. can unsweetened coconut milkJuice of 1 makrut (Thai) lime or limeSteamed rice and lime wedges (for serving)PreparationStep 1Pat chicken thighs dry; season generously with salt. Pour oil into a cold large Dutch oven and arrange chicken, skin side down. Cook over medium heat, rotating pan around on burner to ensure even browning, until skin is golden brown, 12–16 minutes. Using tongs or a slotted spoon, transfer chicken to a plate.Step 2Cook finely chopped shallots, garlic, coriander, and turmeric in same pot over medium, stirring constantly, until softened, about 3 minutes. Return chicken to pan, turning skin side up, then add tomatoes, potatoes, lemongrass, lime leaves, and remaining shallots. Pour in stock and bring to a boil over medium-high heat. Reduce heat and simmer, skimming any foam from surface, until chicken is cooked through and tender, 25–35 minutes.Step 3Stir coconut milk into soup and return to a simmer. Remove from heat and stir in lime juice; taste and season with more salt if needed. Serve soup with rice and lime wedges alongside.How would you rate Soto Ayam Betawi?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe broth is very delicious and so versatile. I made this by the book and felt like the soup was lacking in terms of contents so I added some mushrooms, and could have probably used more. Next time I may add boy choy or other vegetables to fill out the base. I also ended up shredding the meat to make it easier eating, but all-in-all, I will definitely make this again. I have plenty of extra lime leaves to freeze and keep for next time. Stephcincinnati1/26/2022Yum! Really tasty. The lemongrass and lime leaf come through beautifully. My only gripe is that I don’t love soggy chicken skin; you spend all that time perfectly crisping the skin just to simmer it and let it go limp. I’d either remove the skin after crisping next time (could be a nice garnish at the end) or just use skinless thighs and a little extra oil. Overall still excellent.DanielleChicago10/28/2021Explore Bon AppétitSoupSoups and StewsIndonesianSoutheast AsianAsianChicken ThighChickenPoultryLemongrassHerbs & SpicesEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeBraiseRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-23", "author": ["Condé Nast", "Lara Lee"]}