{"id": "418e766e16fe127ec37f85cb6f33380b", "url": "https://www.bonappetit.com/recipe/tomato-watermelon-salad-with-turmeric-oil", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Tomato-Watermelon Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueTomato-Watermelon Salad with Turmeric OilBy Anna StockwellMay 21, 20194.2(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintRed, juicy, and sweet, tomatoes and watermelon are soul mates, and they both need salt, spice, and fat to reach their full potential. Make sure your tomatoes and watermelon are room temperature: If they’re too cold, they’ll make the spiced coconut oil seize.Ingredients4–6 servings ¼cup virgin coconut oil1tsp. coarsely crushed peppercorns1tsp. coarsely crushed coriander seeds½tsp. cumin seeds½tsp. ground turmeric¼large seedless watermelon (about 3 lb.), preferably yellow, rind removed, flesh cut into ½\" pieces (about 4 cups)2medium heirloom tomatoes, cut into ½\" pieces8oz. mild French feta, cut into ½\" piecesFlaky sea saltPreparationStep 1Heat coconut oil, peppercorns, coriander seeds, cumin seeds, and turmeric in a small saucepan over medium until fragrant, about 3 minutes. Let turmeric oil cool slightly.Step 2Arrange watermelon, tomato, and feta on a platter. Drizzle turmeric oil evenly over and sprinkle with salt.How would you rate Tomato-Watermelon Salad with Turmeric Oil?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleAmazing!! I used olive oil because I had it on hand and subbed fresh peaches for the watermelon - that spiced oil really tied the sweet and savory together!  Loved it!!Chris F453449/2/2021This salad is delicious with an impressive array of complex flavours and textures for something that's also very refreshing and summery. The turmeric oil holds its own as an ingredient, I sprinkle it on soups and toast - it's very versatile.kiaradeanLondon, UK3/27/2021Super juicy and great mix of flavors. bulldogdadSeattle8/2/2020Delicious. Definitely serve immediately after making, as it over tenderizes and falls apart quick. Flavor is great though and perfect for a quick summer salad that is both fruity and sweet with just the right amount of savory and spice. AnonymousSeattle8/2/2020Outstanding combination of flavors, especially now with fruit in peak season.  Note:  It is absolutely essential that fruit is not cold, but room temperature, when mixing in oil - if it seizes, it's not pretty.  Also,  I agree with other reviewer - if taking it to a BBQ - assemble right before serving.  Definitely a keeper.aclouserNJ9/1/2019I liked this salad a lot. The flavors of watermelon and tomatoes with the spices and feta are superb. I wasn't a fan of the coconut taste coming from the oil though. It combined rather oddly with the tomatoes and spices. The next time I make this I think I'll swap in either a savory tasting oil like olive oil, or a more neutral tasting oil like grapeseed. It's also important to note that this is a very very juicy salad, and it only gets juicier as it sits. I wouldn't take this to a potluck, and if serving it at dinner I would assemble the salad right before serving. AbbyRAlabama7/5/2019I loved this recipe but the next time I'll make it with avocado oil as it can only be served right away with coconut oil and not stored in the fridge for leftovers as the coconut oil will harden. staceyfedericoLondon6/18/2019Explore Bon AppétitSaladWatermelonMelonFruitTomatoVegetableFetaCheeseSummerQuickSideGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}