{"id": "41bef1272b3e6bd92567a18611fff251", "url": "https://www.bonappetit.com/story/claire-saffitz-apple-cake", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Claire Saffitz Made the Apple Cake of Our Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Saffitz Made the Apple Cake of Our DreamsAnd it’s far from the sad, soggy number you (and your great aunt) might be familiar with.By Sarah JampelSeptember 23, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWithin approximately thirty seconds of asking Claire Saffitz to develop an apple cake for the October issue, it became apparent that she had some thoughts on the subject. There was one type of apple cake in particular that Claire just would not get behind: the kind where uncooked apple pieces are suspended in the batter. (Maybe you know it? Tall, sometimes baked in a bundt, maybe served at brunch at your great aunt’s house?).And the more Claire articulated her mulled-over opinions—that those squishy, not-quite-tender apple pieces make the batter strangely damp while simultaneously interrupting the eating experience—the louder we applauded when she went in a different direction. Instead of dicing the apples, Claire went with halves. Using larger pieces meant that (a) she could caramelize the fruit on the stove beforehand, which would give the fruit the head start it needs to completely cook through, and (b) every serving would have the ideal ratio of caramelized apple to buttery cake.But that’s not all! Claire thought through every step of the cake to guarantee its success. Here’s how you’ll make your new favorite apple dessert:The applesPick them right. There is a time for plucking one apple from every bin at the market and discovering your favorite, and then there is a time for choosing apples guaranteed to withstand baking. Guess which time this is? To ensure that your apples will be spoonable but not mushy, Claire strongly suggests using baking apples whose flavor and texture will not suffer. Pink Ladies are Claire’s pick, but Jonagolds, Honeycrisps, and Braeburns will also do the trick.Peel and halve. Whichever apples you choose, you do want to take the time to peel them—otherwise, they won’t nestle as nicely into the batter later on. But you’ll make up all the time you spent peeling the apples because you don’t have to chop. Simply halve the apples, then scoop out their cores (use your melon baller from 1985 or a sturdy teaspoon to get the job done).Start them on the stove. Once you’ve prepped the apples, the next step is to caramelize them in a skillet. The advantages here are three-fold: You’ll remove excess moisture, you’ll get gorgeous color, and you’ll give the apples an opportunity to start cooking before they’re insulated by cake batter.If you're using juicier apples, be patient: They'll take longer to brown.\nPhoto by Chelsie Craig, food styling by Rebecca JurkevichThe caramelYour apples are tender and out of the pan, and now you’re left with a skillet full of buttery, apple-y juices that definitely should be put to use. Claire adds brown sugar and a little bit of water, then simmers the sauce until it’s thick and bubbling—that’s caramel! That will be the sauce that glazes the apples once you flip the cake out of the pan.The batterYou’ve given so much attention to the apples, but what about that cake? Since the batter comes together in a food processor, it’s (nearly) as hands-off as they come. You do need to take the extra step of roasting and grinding the walnuts, but it’s worth it: Not only do they give the cake a warm, toasty richness, but they also tenderize the crumb by replacing some of the flour, which is prone to toughness.Once you’ve whipped together the batter, all that’s left to do is arrange the apples in the pan (with some thought, perhaps, since they’ll be front-and-center when you serve) and spread the mixture over the top. You might have to nudge it to the sides of the pan, but don’t worry if it’s thin in some places: The eggs, baking powder, and baking soda will ensure that the cake rises and expands in the oven.The amount of batter might seems sparse, but it will puff and spread in the oven.\nPhoto by Chelsie Craig, food styling by Rebecca JurkevichThe finaleA.k.a. The Big Flip. Don’t be scared. After the cake has cooled for 10 minutes, run a knife or a mini-offset spatula around the edges, then invert onto a plate. The easiest way to do this is to place a plate, upside down, on top of the skillet. Then get a good grip on both the pan and the plate using mitts or towels and flip the whole set-up away from you.Pull the pan away, then gawk at your creation. If any apple or cake sticks to the skillet, just scrape them it off and gently press them back into place. Quick cover up your errors with whipped cream—that’s what it’s for.Get the recipe:Apple-Walnut Upside-Down CakeTender, nutty, and studded with caramel-glazed apple halves, Claire Saffitz’s apple cake is the best apple cake. (There, we said it.)View RecipeExplore Bon AppétitCakeAppleFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-18", "author": ["Condé Nast", "Sarah Jampel"]}